{"sid": "owh1mr", "link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/", "title:": "Living in a dorm even if I live 15 minutes away from home", "text": "So my friends and I are all attending this state school very close to us. It’s literally a 15 minute drive max. They’re all living in a dorm and I’m quite surprised since it wouldn’t be a long commute and they’re always driving somewhere. They were surprised when I said I’m living at home and said I should just take a loan. I peeped the room and board cost and it said 11k/yr?? Then there’s a 2k meal plan? Is dorm life actually that worth it? I’m not a people person whatsoever but I don’t want to regret it in the future and be like “Dang I should’ve just lived in a dorm like the other folks”\n\nUpdate: Thanks for responding y’all. Decided to just commute because fuck student loans. Also I like having my own bathroom and a washer and dryer I don’t typically have to wait to use. I think it was everyone talking about “move in day” that made me really consider getting a dorm because I didn’t want to feel left out. Not worth it though. I also spoke with someone from the Student Involvement and Leadership Center at my college and they told me tons of commuters are involved so that comforted me a bit more. I think I gotta befriend other commuter students too ngl", "author": "Callie_Russel26", "created": 1627918652, "retrieved": 1632947874, "over_18": false, "upvotes": 725, "upvote_ratio": 0.99, "comments": {"hacj1by": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/hacj1by/", "text": "Don’t do it I hate living in the dorm", "author": "Scary_Succotash9606", "created": 1629928594, "upvotes": 2}, "h7pllxa": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7pllxa/", "text": "Even if it were free, I’d much prefer to live at home. Dorm life is awful", "author": "NerdPerson10", "created": 1628103256, "upvotes": 2}, "h7mnqkp": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7mnqkp/", "text": "That $44K you save is gonna be worth $250K in 20 years if invested in the stock market. Leech of your parents while you can. Then 20 years from now sit and relax in awe of your fat, padded brokerage account. Sure, you’ll miss the dorm experience but that also means missing smelling your roomies farts and cleaning his skidmarks from the toilet bowl. Many state colleges have special clubs, committees for commuters to ensure you connect, it might even work out better for you.", "author": "rick_in_west_windsor", "created": 1628042789, "upvotes": 1}, "h7maxtw": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7maxtw/", "text": "Im going to give you my humblest of opinions...no because it is the same experience except you have to pay upwards of 1000. Even if you want to party go to the Greek society scene and you will still be fine.", "author": "Rocketpocket10", "created": 1628036513, "upvotes": 1}, "h7lwjyz": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7lwjyz/", "text": "Save your money, OP. There are plenty of other ways to make friends (classes, clubs, campus events, Reddit, parties). The money that you don't spend on dorms now will definitely help you in the future.", "author": "cantfindausername019", "created": 1628029646, "upvotes": 1}, "h7lcib1": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7lcib1/", "text": "I mostly live near commuter universities, and I've dormed for 3 years, and all the roommates I had were just as antisocial as I was, or had other friends, or were complete jerks who slammed stuff or were too messy. I made friends through classes or clubs, never through dorming. All the universities I went to were far from my house, and I always had to take out loans. If I had a choice, I would rather just stay at home and save money to be honest, but alas, I had no choice. Especially since the food buffet they had on campus was decent at best, but not great. Sure friends are awesome, but loans are not. I'm 100% not excited to pay back loans, especially with the interest. I would rather spend money on other beneficial things. This is just my experience. Save your money and your peace of mind. There's plenty of other places to make friends.", "author": "fluffyball63", "created": 1628020998, "upvotes": 1}, "h7ky6wf": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ky6wf/", "text": "Don’t follow them. You won’t miss out on anything.", "author": "Usual_Toe_9129", "created": 1628015045, "upvotes": 2}, "h7kli5e": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7kli5e/", "text": "Not worth it, particularly since there is the chance that the campus will lockdown this Fall.", "author": "Independent_Mud5354", "created": 1628009798, "upvotes": 1}, "h7kcppm": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7kcppm/", "text": "Financially, not worth it. Also in your situation it looks like you already have friends on campus, so honestly not really worth it unless you wanted to try living away from home. \n\nI’d argue that it’s somewhat worth it to live away from home and hang out with different people as as social exercise/good experience. You could do it just for one 1 year to experience it. Also some of the people I dormed with have been great connections and friends to ask for professional advice, so there’s that as well.", "author": "chippywatt", "created": 1628006144, "upvotes": 1}, "h7k0dwm": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7k0dwm/", "text": "Not worth it", "author": "alextraynham", "created": 1628000453, "upvotes": 1}, "h7jys5i": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7jys5i/", "text": "with that short of a drive, i definitely don’t think the dorm life would be worth the cost. as i’ve told other friends going to local colleges, if you have a roof over your head from your family still, take that as long as you can. if you’re worried about social situations and such, you can always work on campus or do your college’s sports/clubs. that way you can meet people and experience more at your college but you’re still saving a ton of money. you’ll be glad later on when you don’t have to pay off that loan.", "author": "vvolleymollyy", "created": 1627999721, "upvotes": 1}, "h7jo1yi": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7jo1yi/", "text": "Some people, like me, can not get away from their parents soon enough", "author": "Gamerz1818", "created": 1627994274, "upvotes": 1}, "h7jibmd": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7jibmd/", "text": "Don't waste your money, the more you can save the better. Stay home, eat at home, chill with your friends in their dorm if they invite you, but don't move in", "author": "Bootyshortsforcorgis", "created": 1627990648, "upvotes": 2}, "h7jb4ks": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7jb4ks/", "text": "If you take the dorms just drop out of college", "author": "Frenchdu", "created": 1627985150, "upvotes": 1}, "h7j3ybw": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7j3ybw/", "text": "I moved to a different city for college so it helped me meet some of my best friends, but since you’ll be near home I don’t think dormlife would be such an experience. I think it’s smart to save the $.", "author": "kelsieelynn", "created": 1627978809, "upvotes": 1}, "h7ivchv": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ivchv/", "text": "If you can live at home for free and there's not a long commute, it's better to save the money that you would spend on the dorms.  You have a car, so you can just meet your friends and drive to parties.  The only benefit that I see to dorming in your situation is no commute and not having to live with your parents.  But, the flip side of that is that you'll have to take out loans.  $40000 in loans is about $400 a month in payments, so when you graduate, get a job and want to find your own place, that's another big bill every month.", "author": "Usual_Individual_493", "created": 1627971621, "upvotes": 2}, "h7itesg": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7itesg/", "text": "Small card box room, with no privacy yeah no", "author": "pumpkinpie555", "created": 1627970176, "upvotes": 2}, "h7iskcf": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7iskcf/", "text": "given the instability of the covid situation, I think commuting makes a lot of sense! the dorm activities will most likely not be worth it, and since you already know people attending this school, you will probably will have an easy time meeting new people.", "author": "beepbopboopbop69", "created": 1627969563, "upvotes": 2}, "h7is3av": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7is3av/", "text": "Living in a dorm is an essential part of college life. You gain independence and make a whole network of friends that you would not have otherwise. If you think you will be able to afford it long term, I do recommend it.", "author": "chesterfielders", "created": 1627969222, "upvotes": 2}, "h7iqtig": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7iqtig/", "text": "dont do it man", "author": "Cerenya", "created": 1627968337, "upvotes": 2}, "h7ilqrr": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ilqrr/", "text": "Honestly, live in the dorm for a year and live at home for the rest. Provides a good experience and connections with other students while saving money for the the other years.", "author": "qpzmeocn", "created": 1627965021, "upvotes": 2}, "h7ikk98": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ikk98/", "text": "I wouldn’t take a loan, but living at home while attending college is likely going to suck.", "author": "dalej42", "created": 1627964291, "upvotes": 1}, "h7ikefe": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ikefe/", "text": "I’m very pro-dorm life, but even for a 30 minute drive I have a hard time saying it’s worth it.. for a 15 minute drive, I’d say absolutely save your money. You’re close enough to easily engage in on-campus activities while saving a bunch.", "author": "ElderScrollsIV", "created": 1627964197, "upvotes": 3}, "h7ij02y": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ij02y/", "text": "I DID THIS. I almost basically lived on the same road as my school. My house was 20 minutes away. It was only supposed to be for freshman year because I wanted a little bit of that life. I ended up spending all four years on campus and truthfully, it would not have been the same without it. Yes it will be expensive but if you want it work for it. I worked every summer and throughout the school year to help. I also applied for lots of scholarships. All to make it happen and I wouldn’t take it back.", "author": "joywynter", "created": 1627963363, "upvotes": 1}, "h7iii4b": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7iii4b/", "text": "Nope. Living in a dorm is an experience but not worth that much money.", "author": null, "created": 1627963069, "upvotes": 2}, "h7ii84e": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ii84e/", "text": "Your friends are dumb and will be on Reddit in a few years crying \"hoW AM I goING TO rEpAy my stUDEnt LoanS thiS isNot FAIr!\"", "author": "orangeblackteal", "created": 1627962906, "upvotes": 1}, "h7ihru1": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ihru1/", "text": "I lived 45 minutes from my university and commuted from home freshman year. absolutely worth saving that $50k + an additional couple thousand dollars for dining food that'll likely give you the runs. my junior year I moved in with some friends about 15 minutes from campus to have a more \"fun\" (aka more going out) college experience, it was more expensive but didn't put me in debt. many of my friends commuted from their parents home and managed to graduate debt free or nearly debt free because of how much it saved. think long term, this is one of the first big \"adult\" decisions you'll make.", "author": "DependentCorgi", "created": 1627962647, "upvotes": 1}, "h7ihpyr": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ihpyr/", "text": "No", "author": "Undesirable_11", "created": 1627962616, "upvotes": 1}, "h7igka0": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7igka0/", "text": "Not worth it.  Esp if you have to take out a loan to do it.  If your home situation is ok, it's better to stay there and save a bunch of money.  25 years from now, you will not regret not living in the dorms.", "author": "Ratly05", "created": 1627961965, "upvotes": 2}, "h7ibp3n": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ibp3n/", "text": "Stupid. These kids watch too much American movies and think living in a dorm will be some wild, full of sex life experience when in reality i bet they wont be able to afford ANYTHING and spent most of thier time studying. Sure there will be parties sometimes but you can just attend the party and crash at someone's place it's the same thing. \nIf you really want similar experience go to summer camp for like 2 weeks. Enough time to get sick of crazy people and enough time to get some fun experiences.", "author": "Professional_Mine2", "created": 1627959343, "upvotes": 5}, "h7iat97": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7iat97/", "text": "It makes socializing easier, but not enough to justify $11k/year in debt. Especially since you'll have friends there that you can probably hang out with and even sleep on their floor/couch if you drink or something and don't want to drive home", "author": "SkiMonkey98", "created": 1627958887, "upvotes": 1}, "h7ia8bw": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ia8bw/", "text": "I made this mistake. Lived at University for one semester before transferring to a community college and living at home. Took me 5 years to pay one semester’s room and board off. Definitely take advantage of living at home if it’s an option for you!", "author": "saveme-shinigami", "created": 1627958589, "upvotes": 2}, "h7ia2na": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ia2na/", "text": "Not worth it at all. Youll save an obscene amount of money that itll be 100% worth it", "author": "humantornado3136", "created": 1627958508, "upvotes": 2}, "h7i9sq2": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7i9sq2/", "text": "Since your buddies will be in a dorm, I am sure they won’t mind having you as an extra staying with them occasionally. \n\nIf you didn’t have anyone you were good friends with on campus then maybe dorming would be a good way to meet more people and network outside the classroom environment. \n\nThat said, there is something special about the dorm experience that makes the college more memorable but so is having to pay back a additional school loan for the next 20 years because you decided to dorm and pay a meal plan when you only lived 15 minutes away.", "author": "tekpc811", "created": 1627958368, "upvotes": 1}, "h7i838k": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7i838k/", "text": "I mean I’m doing it but that’s cause it’s cheaper than just living on my own at the moment. Also it’s a community college. (Need to get out cause of unhealthy environment)", "author": "DarkPho3nix40", "created": 1627957511, "upvotes": 1}, "h7i6tp5": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7i6tp5/", "text": "i'm in a similar boat where i live in town to my college but i am living in a dorm, but i feel it's worth it just because i can't stand living with my parents any longer. but a lot of my friends are living at home and it definitely is the better choice financially", "author": "cloudatic", "created": 1627956881, "upvotes": 1}, "h7i5adg": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7i5adg/", "text": "I’m biased because I hated the dorms and MUCH preferred living at home…. I wouldn’t spend any amount of money if I lived that close!! You can definitely still socialize, I knew plenty of people who did what you might be doing", "author": "icyfang1", "created": 1627956130, "upvotes": 1}, "h7i5641": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7i5641/", "text": "I cherish the time I got to live on campus in the dorms. It really made my college experience and I haven’t felt as connected/as much like a student since living off campus. There’s so many events going on all the time so living there and with your hallmates, makes frequenting events with new people alot more fun and accessible… I’m js, I’m broke and a pell grant recipient, and I very much think it was worth investing in… don’t let price discourage you, college is hard and it’s the good fun parts that make the tough ones worth it. there’s a reason that stats show students who live on campus in their first year do better and are more likely to graduate 👨🏻‍🎓", "author": "adamnblake", "created": 1627956073, "upvotes": 2}, "h7hvslv": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hvslv/", "text": "100% dumb idea. Maybe get an apartment in the later school years.", "author": "talex625", "created": 1627951589, "upvotes": 2}, "h7hvq37": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hvq37/", "text": "You’ll pay it off anyways, live in a dorm and party it up. Party, have sex, get drunk, smoke etc. You gotta live it up", "author": "Layzay374", "created": 1627951555, "upvotes": 2}, "h7httjh": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7httjh/", "text": "You can always hang out in your friends’ dorms! It’s not worth the loan. Just be intentional about making plans!", "author": "Cali-wildflowers", "created": 1627950636, "upvotes": 2}, "h7hrxhh": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hrxhh/", "text": "Dorms are like crazy expensive prison cells you're allowed to leave. Definitely not worth it, especially if you get along with your family.", "author": "thomasd_train", "created": 1627949748, "upvotes": 1}, "h7hr4nx": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hr4nx/", "text": "Honestly, I disagree with everyone else. You’ll have a great experience in the dorms if you’re the type to go out/party. Loans really aren’t that big of a deal if they’re under $40k. Do what will make you happiest and allow you to have a great college experience\n\nEdit: it’s also easier to make friends and people here complain about not having them all the time. You also don’t want to be the person constantly hanging out in someone else’s dorm all the time.", "author": "LoudTrousers", "created": 1627949374, "upvotes": 1}, "h7hqyoo": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hqyoo/", "text": "Your friends are out of their minds. Save the money. Take the bus or trolley for $76/mo. $11k a year? Pfff. Yeah no im good.", "author": "Greedom619", "created": 1627949295, "upvotes": 1}, "h7hptlq": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hptlq/", "text": "It's questions like this that make me wonder why some people are going to college- or even got into college", "author": "Calgrei", "created": 1627948749, "upvotes": 1}, "h7hov2o": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hov2o/", "text": "No way. You'll thank yourself later when you're not paying off massive student debt.", "author": "darkin888", "created": 1627948284, "upvotes": 1}, "h7ho5dn": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ho5dn/", "text": "I can relate so much. I live in a city and the school I'm going to is a 30-minute commute via public transportation or a 10-15 minute car ride. Most of my friends are living on campus and they look at me like I'm crazy when I say I'm going to be living at home instead of taking out an additional 15k loan each year ALONGSIDE tuition. I'm glad someone wrote about this because going in debt for living in a space for a few months is not worth it at all!!", "author": "molemanthecat", "created": 1627947939, "upvotes": 2}, "h7hka8t": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hka8t/", "text": "I would say no, especially bc you said you’re not a big people person.\n\nI did it for a year and a half before COVID and I thought it was going to be great. Had some roommate problems and didn’t really end up making any friends bc I had severe anxiety I didn’t really do anything about. I ended up coming home every weekend at least bc it felt more “comfortable”. I would say only try it if you have no doubts about your self-confidence and you’re really outgoing.", "author": "newsadacc", "created": 1627946108, "upvotes": 1}, "h7hjnk6": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hjnk6/", "text": "As someone who is now in a crazy amount of debt because of school and dorming...it isn't worth it. At all. I barely got any sleep when I lived in the dorms. I was constantly sick (which is not like me). My fees were similar and at the time I thought it wasn't that bad. A few years removed and having more responsibilities, paying off loans really is that bad.", "author": "moonbeam813", "created": 1627945805, "upvotes": 1}, "h7hj6ci": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hj6ci/", "text": "No, that sounds like a complete waste of money for much lower quality of living. I don’t live in a dorm so I have no idea what it’s like, but I imagine they have a lot less space, a lot shittier food, and have to deal with a lot more people. I’m in an apartment with 2 roommates", "author": "chadan1008", "created": 1627945575, "upvotes": 1}, "h7hhmvv": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hhmvv/", "text": "Dorm life is awesome, but it's only so for the social aspect. There's nothing awesome about communal bathrooms, uncomfortable furniture, a cramped bedroom, and lack of privacy if you live with a roommate (not that you'd have THAT much more privacy in your parents house, but I mean, at least you have your own private room, I assume). But, you don't have to live in a dorm to experience the good parts. My first year, I had a friend who was ALWAYS over hanging with our friend group even though he lived in a different dorm building. So just try and make friends, I mean it sounds like you already have some anyway so you can hang with them some in their dorm buildings.   \n\n\nThat being said, if you live at home, try and talk to your parents about boundaries and expectations. You're presumably gonna be 18 or are 18? Do you have any siblings who have been in your shoes before? Things are gonna be different. It's not like high school, you're gonna be really busy with classwork. So your parents need to know that even when you're home, you may not be as available to do chores exactly whenever they want, hang with family, etc. You'll need more personal space and ability to manage your own time.", "author": "dontcry2022", "created": 1627944851, "upvotes": 1}, "h7hgt3g": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hgt3g/", "text": "If you live 15 minutes away then it really isn’t worth it. However, dorm life is an experience & an almost unparalleled way to meet a bunch of people & get really close with your roommates, even if you’re already friends you get infinitely closer to people you live with.  \n\nI would try & spend as much time at your friends’ or other friends dorms as you can & sleepover occasionally just so you can kinda get the experience & relate when people talk about dorm life. It really isn’t that bad.", "author": "scorpiopathh", "created": 1627944459, "upvotes": 1}, "h7heqcn": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7heqcn/", "text": "Honestly, I really didn't like living in the dorms that much. It was definitely fun being able to hang out with friends and do whatever I wanted, but I'd have gladly saved the 12k a year I spent on the dorms. The lack of a kitchen and communal bathroom really sucks. I mean if you really want the experience you could try it out for one semester, but I'd only do that if you can get a REALLY low interest loan or scholarship. But I think it also depends on your parents, if your parents are fine with you coming and going as you please or staying nights at friends dorms then I wouldn't bother paying for the dorm.", "author": "mmccnnmm", "created": 1627943497, "upvotes": 1}, "h7hczkp": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hczkp/", "text": "For me, I'd only live on campus if the drive to school is over 1.5hrs long. Anything below that time isn't worth the money spent on the dorm and meal plan", "author": "Tycoon_2000", "created": 1627942694, "upvotes": 1}, "h7hbwyw": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hbwyw/", "text": "I've lived in the dorms at 2 different colleges.  The first one had shitty dorms with communal showers, no AC, the overall look was painted cinderblocks walls and exposed pipes.  Awful, spent as little time as possible in my room and hung out around campus.  I myself was not much of a people person either, but I slowly warmed up to have multiple friend groups and now consider myself the polar opposite to highschool me.\n\nThe college I'm currently at has quality dorms.  They look like hotels.  Each room has their own bathroom and there's a lobby for every floor with lots of seating and a big TV each.  I found myself hanging out in the lobby every night and made lots of friends and did so many movie/game nights.  I now live in an apartment just a 5 minute walk away from the dorms but it's so... isolating.  Not being able to just pop into the lobby to see who's there or look out the window to see a group sitting outside for me to join has cut my socialization down to less than 10%.  I also can't enter the dorms if I'm not signed in by a resident so that's also a huge obstacle.  Basically I regret choosing an apartment for my second semester here.\n\nBut if I was still at the first college with shit dorms, I would see this apartment as a total upgrade since I only hung out at other locations there anyway.\n\nYou'll have to judge for yourself how worth it it is.  Depending on your preference and the quality of the campus", "author": "Jeffotato", "created": 1627942211, "upvotes": 1}, "h7hanuh": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7hanuh/", "text": "While dorms provide an important social experience that commuters do miss out on, to dorm when college is 15 minutes away is just foolish. Like flat out stupid. \n\nthere will be certain experiences and things that that you miss out on, but you’ll be keeping all that money. Plus, commuters can still be involved on campus too.", "author": "Ms_Digglesworth", "created": 1627941654, "upvotes": 5}, "h7ha82h": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ha82h/", "text": "Not worth it. I paid like 8k to live in a dorm like 30 mins away from my house and I hated it. It was a huge waste of money \n\nIf you’re worried you’ll miss out on making friends and stuff, you won’t. You’ll have plenty of opportunities to make friends just join clubs and talk to people in your classes. Also don’t leave campus right after class ends.", "author": "bitterandconfusedd", "created": 1627941456, "upvotes": 2}, "h7h9i46": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h9i46/", "text": "Not worth it at all, what's beneficial about taking a loan that you'll have to pay back? Save the money if you can, it's gonna become so useful. I live at home as well, I have home cooked meals, my own room, silence when studying.. I'm also not a big people person so it's good for me.", "author": "ana9997", "created": 1627941129, "upvotes": 1}, "h7h8rme": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h8rme/", "text": "11k bro?! Hell nah dude, that's more than 6k of what I'm paying for room board and a meal plan at a private college.  I wish I could live at home, it makes financing and leisure-spending alot easier", "author": "caramel_cube03", "created": 1627940800, "upvotes": 1}, "h7h6v5h": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h6v5h/", "text": "Well, if you like living at home and not really caring about being independent, I’d say it’s not worth it, even if you get it for free. It’s nice to still live with the family, especially if you’re happy with being with them. And if you have siblings, you won’t have to worry about buying a new gaming console when you move out. Not yet, anyways", "author": "Mynam3wastAkn", "created": 1627939937, "upvotes": 1}, "h7h6mug": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h6mug/", "text": "Not worth it. Dorms are a huge rip off.i lived in a dorm and apartment and the dorm where i had to share a room with a girl was twice as expensive as the apartment i got my own room in. Just stay home, the trouble in dorms and apartments and the money it costs isnt worth it.", "author": "VanGoghsSeveredEar", "created": 1627939834, "upvotes": 1}, "h7h6lxk": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h6lxk/", "text": "If you don't care about the \\~campus experience\\~ then don't bother. I was in the same boat as you and lived on campus, wouldn't change it for anything, it was a blast. I'm not everyone though.", "author": "DeNile227", "created": 1627939823, "upvotes": 1}, "h7h6fqs": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h6fqs/", "text": "I went to a state school 20 miles away from my home and committed daily. That along with working full time I got my bachelors with 7k in debt. My friends graduated with 60-80k in debt because they wanted the “College Experience”. I gave up the college experience for a better post college experience and they should’ve done the same.", "author": "NotJoshhhhh", "created": 1627939744, "upvotes": 2}, "h7h4tzz": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h4tzz/", "text": "I'd say don't do it", "author": "calgaryeboy", "created": 1627939022, "upvotes": 1}, "h7h40dq": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h40dq/", "text": "Do not do it! Save your $$", "author": "angles_and_flowers", "created": 1627938656, "upvotes": 1}, "h7h0rh6": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h0rh6/", "text": "How is  your relationship with your family or the people you currently live with?", "author": "TBDobbs", "created": 1627937224, "upvotes": 1}, "h7h0hf3": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h0hf3/", "text": "Don’t do it dorms suck", "author": "trapstephanie", "created": 1627937101, "upvotes": 1}, "h7h0eji": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h0eji/", "text": "Honestly in my opinion there is no point in getting a dorm if you live fifteen minutes away. I also live 15 minutes away from my college so I decided to stay with my parents. However, you could always stay at a dorm for a semester or two just for the experience. Good luck!", "author": "Aesthetically_Emily", "created": 1627937065, "upvotes": 1}, "h7h08m5": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h08m5/", "text": "not worth AT ALL if you have a place 15 minutes away you can live for free. you're still be able to hangout at their dorms whenever you want", "author": "freshguy2002", "created": 1627936994, "upvotes": 1}, "h7h085c": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7h085c/", "text": "I live next to my dream college and walking is 10 minutes and car is basically 2 minutes. I can't remember how much the rent is for the dorm but the cheapest dining plan was like 2k. Its most definitely better to walk 10 minutes and make my own food", "author": "CaptainLlama500", "created": 1627936988, "upvotes": 1}, "h7gzw9g": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gzw9g/", "text": "Ask yourself how often you want to get laid. The. Decide if dorm or parents house is the right choice.", "author": "USSR_Research_Komrad", "created": 1627936843, "upvotes": 2}, "h7gzr0e": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gzr0e/", "text": "I was in a similar situation (but slightly farther) and I chose to stay home. Definitely worth it, the cost of living is too high now :((", "author": "Luigi64128", "created": 1627936779, "upvotes": 1}, "h7gzl9p": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gzl9p/", "text": "Definitely not worth it.", "author": "JonathanL73", "created": 1627936708, "upvotes": 4}, "h7gz5ng": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gz5ng/", "text": "Please please please don’t do it. The benefits of living at home far way out the benefits of a dorm. I lived 15 minutes from my first university I attended and I took it so for granted. Having no debt is better than having debt.", "author": "3DoorsUp", "created": 1627936518, "upvotes": 7}, "h7gz099": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gz099/", "text": "You’ve put yourself in a great position where you can still chill in the dorms and make friends but don’t have to actually pay to be there", "author": "rwalston19", "created": 1627936452, "upvotes": 7}, "h7gyxzx": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gyxzx/", "text": "Personally, I prefer dorm life to living at home. I’ve commuted and I’ve lived on campus and on campus was by far the better of the two. There’s a divide between commuters and on-campus people, at least at my current school. Commuters don’t come to weekend events or late night events or parties or anything. Being friends with a commuter is like being friends with that one kid who has a really early bedtime or something. I know people are saying it’s not worth it, but in my opinion, it’s totally worth it.", "author": "worldwidefunnygui", "created": 1627936424, "upvotes": -2}, "h7gyq2a": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gyq2a/", "text": "Bro you’re 15 mins away. Taking loans for dorms just isn’t it", "author": "Capt_Doge", "created": 1627936327, "upvotes": 7}, "h7gygzn": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gygzn/", "text": "It’s definitely not worth it during a pandemic. You could be sent home at any moment and won’t get your money back.", "author": "redhill00072", "created": 1627936216, "upvotes": 1}, "h7gx685": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gx685/", "text": "Nah it’s not worth it. You’ll get the experience through your friends who live on campus! If you don’t absolutely hate your household, save the money!!", "author": "Readdithere1st", "created": 1627935645, "upvotes": 1}, "h7gwy7g": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gwy7g/", "text": "I'm still really good friends with some people from m dorms. This was nearly five years ago. Tbh I would've gone somewhere farther from home your friends may not be your friends after the first year. A few people I knew in high school went to my school. I stayed in contact with 2 of them after the first few months of school.", "author": "flamec4", "created": 1627935546, "upvotes": 1}, "h7gvnnz": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gvnnz/", "text": "They’ll regret it in 10 years and cry everyday about how they’re oppressed and wait for the government to bail them out which will never happen. Don’t do it, do it the right way and don’t pay tens of thousands just for the “experience”", "author": "Tackysock46", "created": 1627934958, "upvotes": 1}, "h7gunwp": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gunwp/", "text": "Stack that cash, invest it in VT. You will be so happy when you’re $30k-$50k ahead of everyone else upon graduation.\n\nEarn your independence, don’t borrow it.", "author": "iwantknow8", "created": 1627934528, "upvotes": 1}, "h7gu04q": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gu04q/", "text": "I did this same thing but after the fact I decided it was worth it. Expensive, but as an introvert, I would have never made friends any other way. Worth every penny.", "author": "mynamesmace", "created": 1627934241, "upvotes": 1}, "h7gtuaa": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gtuaa/", "text": "I got shit on so much by my friends parents when they found out I wasn’t dorming even though I was basically in the same situation you’re in, I live 10 minutes tops from my college. They claimed I wouldn’t be getting “the college experience”, but my family literally doesn’t want to waste money on room and board when we don’t need too, rightfully so. I think it’s a misconception that there is one college experience because everyone is on their own journey and experience college differently. Don’t dorm if you live 15 minutes away, it isn’t worth the money for jail cell living lmao. Espeically now with covid around, my heart goes out to everyone who is stuck in their dorms.", "author": "InfluenceNatural4149", "created": 1627934169, "upvotes": 9}, "h7gtc5e": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gtc5e/", "text": "Expensive but depends on what you’re looking for. College is definitely an experience and living in the dorm will teach you tons about yourself and other new people.\n\nThink about it. Keep in mind the Covid restrictions though. Maybe it’s not worth it at all but I would recommend living away from home during college. Save up to rent a house with friends next year or something.\n\nAlso remember Reddit is a site full of introverts & and very polarized hive mind. Some of these people don’t get out much and possibly had a horrible time in college because they couldn’t make friends. You can make your experience whatever you want.", "author": "AlpacaBigBowl", "created": 1627933950, "upvotes": 2}, "h7gsvoc": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gsvoc/", "text": "Stay home, stay out of debt! Not worth it!!", "author": "crayl11", "created": 1627933751, "upvotes": 1}, "h7gshz7": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gshz7/", "text": "I can promise you, you're not missing anything. I commute over an hour to my university (sometimes by train) to avoid living on campus. The cost for dorming and meal plan is extremely overpriced and usually for students who live far away or out of state. Not to mention I would be sharing the room with two other girls, have a communal bathroom (3 toliets/3 showers for the entire half floor about 20+ women).\n\nIf you want to experience dorm life, do it later when the rooms are actually worth it. You could use that 11k elsewhere. Perhaps to rent in the future?\n\nI can promise you, you're not missing anything. I commute over an hour to my university (sometimes by train) to avoid living on campus. The cost for dorming and meal plans is extremely overpriced and usually for students who live far away or out of state. Not to mention I would be sharing the room with two other girls, have a communal bathroom (3 toliets/3 showers for the entire half floor about 20+ women).", "author": "Nerdyxwitch", "created": 1627933589, "upvotes": 1}, "h7gs45s": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gs45s/", "text": "Honestly it entirely depends on your relationship with your parents. If you think your parents will hinder your academic career, get a dorm. Otherwise, save the money and stay at home.", "author": "TheManicMonocle", "created": 1627933423, "upvotes": 1}, "h7grz6r": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7grz6r/", "text": "No😂, unless your school is actually invested in dorming and meals  it’s gonna be ass. IUs got mold, shitty food, and just overall terrible quality in living terms. You’ll be woken in the middle of the night bc of alarms, you might have thin walls that allow you to hear what “activities” others are doing. You could save the 13 grand every year and buy almost a house coming out of college and then flip it once the housing market goes up (hopefully not down) years later. Also loans are a trap depending on what your plan is for the future, racking up unnecessary debt is like THE last thing anyone should do unless it’s like a smart investment.", "author": "lil-dlope", "created": 1627933364, "upvotes": 1}, "h7gqbbc": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gqbbc/", "text": "Dorm life is incredibly overrated. I got grants to cover mine when I was freshman and from that experience I would not spend 11k to only eat microwaveable meals, live with an idiot 18 y/o who watches Alex Jones, live with an 18 y/o who regularly drank himself to puking on the bathroom floor, and having a bed that felt like rocks.  Now that I am an older student, I live in a house about 15 minutes away from campus (both biking and driving b/c parking is a pain in the ass) and it is much more enjoyable.  Stay at home, in a year or two if you're comfortable maybe rent a place with some buddies.  Avoid loans if possible (just general advice) and make friends!  Enjoy!", "author": "Stealyosweetroll", "created": 1627932636, "upvotes": 2}, "h7gq2tv": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gq2tv/", "text": "[removed]", "author": null, "created": 1627932534, "upvotes": 1}, "h7gp8li": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gp8li/", "text": "There is an experience to dorm life, but it is ridiculously expensive. Even getting a separate apartment within the university area of influence and paying for separate groceries is half the cost of a dorm.  On the flip side, not having to park, and being able to go home between classes can be nice.  The extra 15 mins add up quickly.", "author": "xaminmo", "created": 1627932169, "upvotes": 1}, "h7gosok": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gosok/", "text": "As much as I love moving out, and being away. It doesn't make sense to dorm if the commute is 15 minutes.", "author": "tha_oz", "created": 1627931979, "upvotes": 1}, "h7gocbk": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gocbk/", "text": "I live 12 minutes away from my school. I haven't needed to paid tuition, and I live at home for free. I've saved so much money doing this and I was able to buy a brand new car. I wouldn't say it's worth it at all, save your money. You're probably more comfortable at home anyway.", "author": "ekaric15", "created": 1627931781, "upvotes": 1}, "h7go6fv": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7go6fv/", "text": "Hey, if your friends live on campus, just hang with your friends. You'll meet the same people and save $11k.", "author": "SpectrumDiva", "created": 1627931709, "upvotes": 1}, "h7gmhek": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gmhek/", "text": "Saving this thread for later because I literally am in the exact situation as you. Pm me if you have doubts about it lol we can discuss what I’m planning. all my friends have apartments but I’m planning on joining student organizations and stuff to stay on campus more, also having season tickets to football will allow me to go down every weekend. But yeah it’s a dilemma I had to. I’m working part time in school and I’d hate to put my money in making to paying rent. I live 20 min away from campus.", "author": "NoOutlandishness9892", "created": 1627930966, "upvotes": 5}, "h7gmae9": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gmae9/", "text": "Absolutely not lol. Future you will not appreciate having to pay back that money.", "author": "rollllllllll_", "created": 1627930880, "upvotes": 1}, "h7gl33z": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gl33z/", "text": "You're fine without living in a dorm. Colleges try to say \"oh live on campus for the experience\", however, they really only want you to live on campus so they can get that extra several thousand dollars a year (the last year and a half during COVID really shows that). You will get the exact same experience commuting 15 minutes (heck I knew people who commuted an hour 1 way and were still super involved). It is not worth the debt at all.", "author": "squirrel8296", "created": 1627930358, "upvotes": 1}, "h7gk0zn": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gk0zn/", "text": "I probably would, but it’s not a good idea at all", "author": "Inf3rnalis", "created": 1627929903, "upvotes": 1}, "h7gjtmm": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gjtmm/", "text": "As someone who commuted 15 minutes… *hell no* do not stay in a dorm just because your friends are. Student loans aren’t worth it.", "author": "meg-c", "created": 1627929814, "upvotes": 1}, "h7givmi": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7givmi/", "text": "Def not worth it. If i could stay at home I would.", "author": "torianii", "created": 1627929408, "upvotes": 1}, "h7gi79g": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gi79g/", "text": "If it were an hour commute, I’d say pick the dorm, but at fifteen minutes it’s not worth it. Yeah there are advantages to living on campus and it’s easier to walk around and stumble upon events, but you’re better off not spending that money.", "author": "jojoisland20", "created": 1627929116, "upvotes": 1}, "h7ghzi9": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ghzi9/", "text": "In 10 years they’ll all be jealous of you for no debt", "author": "dogwheeze", "created": 1627929023, "upvotes": 1}, "h7ghlhr": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ghlhr/", "text": "It depends on your financial situation and what your parents say. I’m sorry to say this but you will regret not living in a dorm. Will you regret it to the order of 13k/yr? That’s up to you.", "author": "CommonwealthCommando", "created": 1627928854, "upvotes": 5}, "h7gh3f1": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gh3f1/", "text": "Not worth it at all. Dorming honestly fucking sucks once you get past that initial freshman excitement about it", "author": "strangelyahuman", "created": 1627928634, "upvotes": 17}, "h7ggauu": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ggauu/", "text": "Dorm life is way overrated. \n\nMovies make it look like you're gonna make friends with everyone on your floor then stay up all night with them eating junk food and playing video games. In reality, you're crammed into a box with a friend, which regardless of how close you are eventually starts to suck, you sleep on matresses significantly older than you are, you probably won't get super close with the randos on your floor, the bathrooms alternate between \"Recently power washed with bleach\" and \"absolutely filthy\" with no in-between, and you sometimes have to go out and stand in freezing weather at 3AM because someone burnt popcorn or decided to hotbox their room and set off a fire alarm.\n\nMeanwhile, there's nothing stopping you from enjoying most of the positive aspects of dorm culture while also living from home. Especially since you live so close, you can always hang out in your friend's room until early morning doing whatever then just drive home to a clean bathroom and nice mattress. \n\nUnless your home environment is just absolutely awful, there is no reason to put yourself in debt to live in a dorm.", "author": "LordMudkip", "created": 1627928288, "upvotes": 43}, "h7gg8kq": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gg8kq/", "text": "save spaces in housing for other students plz", "author": "joocy_kooter", "created": 1627928261, "upvotes": 1}, "h7gfuwb": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gfuwb/", "text": "I don’t recommend it. You might not feel the weight of that extra 11k+ in your loan now, but you will when you have to pay it back after college.", "author": "JupiterRocket", "created": 1627928095, "upvotes": 1}, "h7gfs7j": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gfs7j/", "text": "Don’t be dumb. if it’s a 15 minute drive, and you don’t HAVE to take out the loan for a dorm, DO NOT do it. Number one way to screw yourself over when you graduate.", "author": "Amxricaa", "created": 1627928062, "upvotes": 1}, "h7gfocz": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gfocz/", "text": "I think that living in a dorm especially as a Freshman is a unique experience to say the least.  But honestly since you only live 15 minutes away I would not spend the extra money towards it.  Plus the meal plan adds a lot of extra costs that you could spend on other things such as tuition.  You really if you wanted to spend time with your friends on weekends just chilling or hanging out in the dorms and still get the same experience.", "author": "cactus_jacks", "created": 1627928014, "upvotes": 2}, "h7gebn3": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gebn3/", "text": "Do you really think that it's worth at least $13000 + tax + interest to hang out with your friends a couple extra hours a day, granted they aren't flooded with school work.", "author": "Timecounts", "created": 1627927412, "upvotes": 2}, "h7gea1h": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gea1h/", "text": "Not sure about the positives of paying 50k to get a cramped space, a potentially shared room and shared bathrooms.", "author": "DemonicBarbequee", "created": 1627927392, "upvotes": 4}, "h7ge6qt": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ge6qt/", "text": "I was in a similar situation for school. I opted for living at home, and felt I was able to participant in school stuff as much, or as little, as I wanted. I had one friend who did live on campus just for freshman year, in order to easily meet new people, but then moved back home for the rest of college. This could be an option if you are worried about \"missing out\", but I think you'll be fine since you do live that close. I will say, I would look into your options for getting to campus, cause parking passes can be quite expensive, so you might want to consider public transport, or maybe even biking if its close enough for that!", "author": "jjthejetplane42", "created": 1627927350, "upvotes": 5}, "h7ge0lx": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ge0lx/", "text": "Don’t do it. I’m sure in the moment it seems like a good idea but in the long run I think you’ll be a lot happier that you saved some money that extra year by not paying all that for housing/meal plan.", "author": "mattyq10", "created": 1627927274, "upvotes": 2}, "h7gdzn4": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gdzn4/", "text": "I commuted 35 min to college and I'm so glad I did. I was able to make friends on campus and by sophomore year I was going home less and less. You won't miss out on much by not living on campus so long as you stay on campus as much as possible and go home as little as possible. \n\nThe debt isn't worth it. By commuting, I avoided a ton of debt and I'm much better off now than I would have been. I graduated in 2018 and I'm buying a house now. If I lived on campus I would not be.", "author": "wrennekamp", "created": 1627927261, "upvotes": 6}, "h7gdk4j": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gdk4j/", "text": "I wish there was a college I liked close to home. I actually have attempted to convince my parents, aunt, and older brother to move to my college town so I can just live with them instead of pay extortive room and board costs or live in a crappy student apartment. Hasn’t worked so far…\n\nI wouldn’t do it, especially if it’s that expensive.\n\nAlso COVID restrictions make dorm living suck.", "author": "notfornowforawhile", "created": 1627927077, "upvotes": 4}, "h7gd0h8": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gd0h8/", "text": "You can visit your friends at their dorm while saving 13k! Win win", "author": "siegure9", "created": 1627926845, "upvotes": 2}, "h7gcpqu": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gcpqu/", "text": "I would seriously not do this. You can be on campus as much as you want and get a good experience without this. You will likely regret that debt and will feel terrible after graduation having wasted so much money.", "author": "ratherbewithmycat", "created": 1627926715, "upvotes": 3}, "h7gc8yg": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7gc8yg/", "text": "You'll be staying at their place enough. It's only 15 minutes which is nothing. Not worth north of 15k after all said and done.", "author": "Vallarfax_", "created": 1627926513, "upvotes": 5}, "h7ga9je": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7ga9je/", "text": "Same situation as you other than the fact me and all of my friends realized 10k+ for room and board was just not worth it.", "author": "FumyLikes", "created": 1627925661, "upvotes": 10}, "h7g9ly9": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7g9ly9/", "text": "I was in the same situation that you are and decided to live at home (10-minute commute). Even if you did have scholarships to cover it (I did), I would say live at home and use that scholarship money for books and whatever else you need. I have no regrets about using scholarship money for extra school supplies. You never know what supplies you'll need during the semester. Keep this in mind when people tell you to take out a loan. \"Make interest work for you, not against you.\"", "author": "RunDan16", "created": 1627925378, "upvotes": 5}, "h7g96qd": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7g96qd/", "text": "Yeah that $50k you won’t spend on the dorm will be very useful later.", "author": "sepia_dreamer", "created": 1627925195, "upvotes": 650}, "h7g8wl7": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7g8wl7/", "text": "No loans. Commute.", "author": "tmuscles", "created": 1627925073, "upvotes": 14}, "h7g8lun": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7g8lun/", "text": "Big disagree with what people are saying about not living on campus, but don't live in a dorm. Get an on campus apartment instead. Half the price and you get a bigger space.", "author": "IronGemini", "created": 1627924944, "upvotes": -6}, "h7g6l4k": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7g6l4k/", "text": "I have done both (living on campus even though i live nearby and living at home) so I can speak to the pros and cons of each. \nPros of living on campus: close to friends and campus events, more independent, getting the “dorm experience “\nCons: Expensive, less privacy, roommate/floormate issues, less personal space. \nPros of living at home: Free!, more privacy/quiet time, no roommate (other than family)\nCons: harder to spend time with friends spontaneously, must leave earlier to get to campus on time, paying more for gas, more house chores to share. \n\nOverall, I enjoy living at home more than on campus, but I am jealous of those who live off campus in apartments with friends. It all really depends on how you like to live and if you want to take out more loans to do so. I also really enjoyed living on campus, but I think it also depends how you approach the experience. Good luck OP!", "author": "is_strange", "created": 1627924079, "upvotes": 14}, "h7g6hbd": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7g6hbd/", "text": "I've been studying for 9 years after high school (4 years college, 5 years postgrad), and I spent all those years commuting to and from my home where I live with my parents. I've heard my friends say they were jealous of me since I get to see my family everyday, I get home cooked meals, I don't have to worry about laundry or groceries, etc. I'd definitely say it's not worth it.", "author": "AllamandaBelle", "created": 1627924033, "upvotes": 91}, "h7g4sur": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7g4sur/", "text": "Absolutely not worth it.", "author": "noogiey", "created": 1627923317, "upvotes": 526}, "h7g384r": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7g384r/", "text": "Depending on your school COVID policies, it might be a huge hassle to live in a dorm anyway. I would say it all depends on how things are between you and your parents. If you don't have issues living at home, I would say it isn't worth the 13k (plus interest) to live in a dorm. You have a short commute, you can still make friends at school. I never lived in a dorm and didn't feel like I really missed out on anything.", "author": "Hunt3r8806", "created": 1627922646, "upvotes": 38}, "h7g2tp8": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7g2tp8/", "text": "That is an extreme waste of money, it is like throwing it into a fire pit.", "author": "HowlSpice", "created": 1627922475, "upvotes": 69}, "h7fxvx6": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7fxvx6/", "text": "[removed]", "author": null, "created": 1627920373, "upvotes": 1}, "h7fx4pe": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7fx4pe/", "text": "If you had scholarships to cover it, then I would live in the dorm even if it's close. I wouldn't take out a loan for it though. I think a lot of people want that independence of not living at home. Talk to your parents about what they expect since you're an adult and still living at home. Do they still expect you to ask permission to go out, or be home by curfew? If it's working for you, then you are saving a lot of money. You should still make an effort to spend time on campus outside of classes. Study there, join clubs, eat with friends in the cafeteria.....", "author": "fawkes_fiesta", "created": 1627920048, "upvotes": 166}, "h7fv0gd": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7fv0gd/", "text": "I wouldn’t do it. You’ll be just fine without a dorm, even better since you save all that money, and you can still socialize and make a bunch of friends living off campus. You just don’t want to rush out off of campus the second your classes are over, you know? Hang around and actively make an effort to meet people. You live 15min away and have a car(?), that’s perfect. Maybe even walking distance? I don’t think you need a dorm.", "author": "tingdemsweet", "created": 1627919129, "upvotes": 557}, "h7futjz": {"link": "/r/college/comments/owh1mr/living_in_a_dorm_even_if_i_live_15_minutes_away/h7futjz/", "text": "Don't take a loan to live in a dorm 15 minutes away from home. It is not worthy.", "author": "coqui82", "created": 1627919046, "upvotes": 421}}}