{
  "sid": "qe5pq6",
  "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/",
  "title:": "Wanting to be alone in college",
  "text": "I’m a freshman at Florida State University. I’m originally from Chicago, so i basically came here without knowing anyone. I have a group of friends that I hang out with about once a week, but it seems that I found a tendency to want to be alone more than usual. My days are still packed, I workout a lot (actually lost 20 pounds since college started) and I’m currently spending a lot of time studying my third language. My grades are good. Basically what i’m asking if this is somewhat normal/ok. My mom worries that I’ll miss out on the “college experience”. I’ve gone out to bars a multitude of times already and just don’t see the appeal because I can’t drink due to my diet. Has anyone had similar experiences?",
  "author": "SurroundDistinct2340",
  "created": 1634998687,
  "updated": 1635184576,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.91,
  "comments": {
    "hhqwop5": {
      "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhqwop5/",
      "text": "Just remember you don’t live with your parents anymore. Do what makes you happy and don’t try to please your parents",
      "author": "CajunCriminal24",
      "created": 1635001082,
      "upvotes": 25,
      "replies": {
        "hhrakst": {
          "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhrakst/",
          "text": "thanks for your insight",
          "author": "SurroundDistinct2340",
          "created": 1635008170,
          "upvotes": 5,
          "replies": {
            "hhsbm4y": {
              "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhsbm4y/",
              "text": "I second this. Enjoy your independence honestly",
              "author": "Immediate-Duck3929",
              "created": 1635024753,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hhrdk9p": {
      "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhrdk9p/",
      "text": "Parties and the drinking are way over rated. Trust me you’re not missing a thing. Personally I think we have a societal issue when folks start equating drinking so strongly with socializing.",
      "author": "nic5678",
      "created": 1635009499,
      "upvotes": 20,
      "replies": {}
    },
    "hhrc849": {
      "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhrc849/",
      "text": "Have the college experience *you* want to have, not the one you think you’re supposed to have or the one your parents want you to have. Not everyone wants the greek life, business major, drunk from thursday to saturday college experience — not everyone wants the all-week grind, never rest, 4.0 GPA at the expense of having fun experience either. \n\nUse your new freedom to figure out what you like to do and do exactly that. :)",
      "author": "another-reddit-noob",
      "created": 1635008895,
      "upvotes": 9,
      "replies": {
        "hhsqyt4": {
          "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhsqyt4/",
          "text": "love this :) thank you",
          "author": "SurroundDistinct2340",
          "created": 1635031896,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhr7syt": {
      "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhr7syt/",
      "text": "I’m a sophomore in pretty much the same situation. I have some friends that I see in class and have hung out with outside of school a couple times, but I really prefer to be alone most of the time.",
      "author": "stumaq",
      "created": 1635006947,
      "upvotes": 7,
      "replies": {
        "hhrap7w": {
          "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhrap7w/",
          "text": "yeah, i feel like it’s not necessarily a bad thing the situation is in because i feel like it’s praises to have a lot of friends and get drunk every day but taking a lot of time for yourself and putting your own priorities straight is just as good if not better",
          "author": "SurroundDistinct2340",
          "created": 1635008224,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhsqjud": {
      "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhsqjud/",
      "text": "You’re totally fine!!!\n\nI’m a senior. I live alone now, have my car, a group of friends at running club, people I know in my classes. If I’m dating someone I tend to hang out with them pretty often, that’s just my style of relationship, but I also love personal projects and tinkering, cooking, working out (literally keep plates and a bar in my apartment lol) and just generally doing my thing. \n\nI think I mostly found it lonely at times because I had decided it was, because I perceived others around me as having better social lives and that being “right.” Also didn’t help that one girlfriend I had thought it was lame I didn’t go out much. Kinda internalized that. Don’t let that happen to you!!",
      "author": "Helllo_Man",
      "created": 1635031702,
      "upvotes": 7,
      "replies": {
        "hhsr7ob": {
          "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhsr7ob/",
          "text": "I think your second paragraph perfectly describes what i’m feeling. this made me feel a lot better about it. i was definitely letting myself think things like that. thank you so much, this really helps.",
          "author": "SurroundDistinct2340",
          "created": 1635032011,
          "upvotes": 3,
          "replies": {
            "hhstr5d": {
              "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhstr5d/",
              "text": "You’re welcome! I remember talking about it recently. I was like, “yeah I just feel stupid sometimes being alone on a Friday night, I know other people are partying or at the bar or whatever.” (I’m single rn and was the one dumped so I’ve felt lame lately) \n\nEd, my therapist, was like, “yeah, but do you even want to go to a big ol house party? What about a loud crowded college bar?”\n\nMy response: “No…”\n\nOnly way around that is to just do you! Socialize when you feel like it, prioritize the few people you do meet that you *really* think are cool. So many people have tons of “friends” in college, but really in name only. I’d rather have a few good ones.",
              "author": "Helllo_Man",
              "created": 1635033222,
              "upvotes": 4,
              "replies": {
                "hhswwib": {
                  "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhswwib/",
                  "text": "I totally agree! The time where people are going out to bars and what not, I’m spending that time studying Japanese and working out. i’m at my happiest honestly learning new languages, so I feel it is worth it.",
                  "author": "SurroundDistinct2340",
                  "created": 1635034717,
                  "upvotes": 3,
                  "replies": {
                    "hhsxstl": {
                      "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhsxstl/",
                      "text": "That’s great! Whatever you do, don’t let people convince you that is somehow wrong. As I mentioned, I think the first girl I dated thought I was lame for not wanting to go to frat parties or whatever big outing with her. She’d always talk about all these people she knew that were going or she met or whatever. That rubbed off on me. The next one thought I was a slacker for procrastinating things, or sometimes preferring a slow weekend where I slept in a bit and cleaned the place, washed the car, etc. I wasn’t “accomplishing” enough. I let that get to me too. Don’t let that happen to you! You *will* meet people who think your lifestyle is cool, especially when you get further along. By Junior/Senior year, some people actually start to think it’s cool when you have hobbies and a life outside of parties and drinking games.",
                      "author": "Helllo_Man",
                      "created": 1635035132,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhs0s07": {
      "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhs0s07/",
      "text": "Remember, similar people attract to each other. You will find friends from doing what you love",
      "author": "mononlabe",
      "created": 1635019819,
      "upvotes": 3,
      "replies": {}
    },
    "hhsmfp3": {
      "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhsmfp3/",
      "text": "I'm the same exact way and almost done with school. Before I used to want to make friends and my first year at my current college (transferred from a cc to a 4yr) I made a few friends and we hung out together sometimes. Since the pandemic I just want my degree and to get out of here. I'm over it! The most social interaction I get is talking to my roommate sometimes, texting/calling family and friends from back home at least once a day, and hanging out with my boyfriend every weekend. That's all I need now.\n\nEdited a word",
      "author": "JLA342",
      "created": 1635029757,
      "upvotes": 3,
      "replies": {
        "hhsr224": {
          "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhsr224/",
          "text": "We have very similar schedules, I’m glad we have similar feelings :)",
          "author": "SurroundDistinct2340",
          "created": 1635031939,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhtaelw": {
      "link": "/r/college/comments/qe5pq6/wanting_to_be_alone_in_college/hhtaelw/",
      "text": "I go to FSU too and noticed mostly in younger groups that socialization is almost a MUST. Mastering the joy of being alone as a freshman will help you out in the long run, most groups won’t last 2nd year and you’ll find most people you meet want something from you with little return. Doing things alone is a freedom many fear especially at a party school like ours, take advantage of the ease of parties here but also recognize those days and nights you just want for your own interests.",
      "author": "utilizemybrainwaves",
      "created": 1635041142,
      "upvotes": 1,
      "replies": {}
    }
  }
}