{
  "sid": "qz6ail",
  "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/",
  "title:": "You buy into a lie and wonder why you feel so depressed",
  "text": "Telling yourself that a chunk of 4 years in your life is your ultimate peak you will reach out of the 60-80 some years of your total existence is quite literally the blueprint to becoming a depressed college student.\n\nYou wonder why you feel sad? Depressed? Stressed? Because you buy into bullshit. You telling yourself that college is the best 4 years of your LIFE, is the reason why you start hating yourself and feel worthless. \n\nWake the fuck up and realize how dumb you sound. The average person may live up to 60-80 years old. Your telling me your peak in life is 4 years? The best years of your entire life is 4 years? That in itself is depressing, and now shoving that into your mental and thinking about it over and over is what MAKES YOU DEPRESSED.\n\nBruh your not even financially independent yet, you have no fucking financial freedom. And your telling me your best years of your life are 4 years where your paying for school? Getting an education? Going to classes and then doing homework. Yeah you go to the occasional parties, meet people. \n\nBut what about when you ACTUALLY start living life after college. Travel the world with the money you have, ACTUALLY grow your experiences in life and not limit it to the 4 mile radius of a college campus. That’s when your life becomes the best years of your life. \n\nJust think about it. How the hell are 4 years, going to be the best years of your life. You might as well just die when you graduate? Stop fixing this shit in your head and be realistic. Your life experiences are not limited to that 5-10 mile radius of a college campus. You have your whole damn life ahead of you. Once you see what’s actually out there in the world, THATS when you actually live your best life.",
  "author": "Normal_Flan_1269",
  "created": 1637534142,
  "updated": 1637689029,
  "over_18": false,
  "upvotes": 173,
  "upvote_ratio": 0.85,
  "comments": {
    "hlklnqs": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hlklnqs/",
      "text": "Think I’m depressed because I procrastinated on a a paper due tomorrow but go off king 🤙",
      "author": "cud1337",
      "created": 1637537041,
      "upvotes": 162,
      "replies": {
        "hll83q4": {
          "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hll83q4/",
          "text": "Same!!!",
          "author": "_sincerely_a",
          "created": 1637547416,
          "upvotes": 8,
          "replies": {}
        },
        "hlkmu5q": {
          "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hlkmu5q/",
          "text": "Lmao gl",
          "author": "Normal_Flan_1269",
          "created": 1637537568,
          "upvotes": 6,
          "replies": {}
        },
        "hlm1uug": {
          "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hlm1uug/",
          "text": "This too.",
          "author": "ukbep",
          "created": 1637563909,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hll3um7": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hll3um7/",
      "text": "I think a lot of people feel depressed when they see others having the time of their life, but they are not.",
      "author": "saturn1855456",
      "created": 1637545439,
      "upvotes": 52,
      "replies": {
        "hll47cu": {
          "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hll47cu/",
          "text": "That’s true. I was just addressing the many posts on here about kids who felt like they weren’t living the college experience or getting the college experience.",
          "author": "Normal_Flan_1269",
          "created": 1637545604,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "hlkgxbf": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hlkgxbf/",
      "text": "Thanks bro",
      "author": "Egan_32",
      "created": 1637534939,
      "upvotes": 16,
      "replies": {}
    },
    "hllcx64": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hllcx64/",
      "text": "Don’t let a single place define your happiness",
      "author": "Kai_151",
      "created": 1637549703,
      "upvotes": 15,
      "replies": {}
    },
    "hllvkzo": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hllvkzo/",
      "text": "Its been really hard the past 2 years I really needed someone else to say college doesn't have to be the peak of my life. Its okay to struggle now. Thank you.",
      "author": "Impavid3",
      "created": 1637559612,
      "upvotes": 9,
      "replies": {}
    },
    "hllvilq": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hllvilq/",
      "text": "I agree with OP. I attempted college, lived a life, then went back when I knew it was right. Put what OP said in perspective... how depressing would it be if 4 years in college really WAS the peak of your life? I mean, you're then looking at the next 60 years having supposedly already had your best 4! These are not the best years of your life and, if they really are, then that's what's depressing.",
      "author": "Mammoth-Title-2102",
      "created": 1637559569,
      "upvotes": 7,
      "replies": {}
    },
    "hlmvz19": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hlmvz19/",
      "text": "I'm making a lot of assumptions here. Mainly, that you're still in college or at least haven't worked in the workforce long. \n\nI'm 32 and have come back to finish my degree after 10 years. \n\nI think the thing that is hard to understand for young people how college relates to the rest of life. It makes it difficult to see why people say college is the best 4 years of their lives. Without having the perspective of being a part of the workforce for years on end, I think it's nearly impossible to justify why college rocks. \n\nSince I've gone back, my mental health and quality of life has improved greatly. It's contrarian in ways. I'm not making ANY money, I'm spending money, I'm going into debt and I'm in class with peers who are 14 years younger than I am. \n\nIt's important to note that I know exactly what you're talking about and how other's tend to feel. I remember in my early 20's thinking the same things and really feeling shafted by the system.\n\nThe thing is, college is amazing. Ask anybody who's worked jobs without a degree and come back to go to school. There seems to be an overwhelming amount of those people who love it. I can personally say that I find college to be so much easier than the jobs I held.\n\nMultiple times in different industries I worked myself to making 50k+ a year. Out of all of those jobs, I've always returned home at the end of the day aching. Every single day for 10 years I've been in pain to do a job. The pain wasn't always unbearable but I've been on workers comp before for work injury. Even something as simple as sanding for a few hours causes pain in so many different places. Elbows start to ache like crazy, your lower back will be trashed and inevitably your feet will start to hurt after HOURS of standing on concrete. Working out of non-air conditioned warehouses was standard. Freeze all winter and sweat like crazy all summer. It was horrible. \n\nCollege in comparison is just so easy. I don't think it will ever amount to the physical or mental stress put on by a job. My college course work is my responsibility and nobody else's. I don't have a 'manager' standing over my shoulder telling me how to do everything. I don't have to worry about coworkers on drugs that will kill me with a fucking fork lift. I just do my work and work hard. I'm in control of all of it.\n\n I can't explain how your soul will be crushed by bad managers and coworkers. YEARS of every single day slaving into work knowing that you're disposable and everybody knows more than you. I found that not having a degree lumped me into jobs with people who didn't have them either. I don't like working around those people. I worked with grown men who would smoke pot at lunch and come in driving forklifts and operating heavy machinery. The illegal mexicans that the owner hid would take a group of 3 of them into a single mens restroom the day after payday to do cocaine. I found a joint roach on the floor of the bathroom one day, and not a single person gave a shit. The finisher would consistently smoke pot right out back of the shop. Everyone was on drugs on the floor. \n\nCollege is great. You're expected to behave professionally and the knowledge is amazing. I love being back in school. I wouldn't trade it for anything. I know it will improve my knowledge and make me a smarter person. I know it'll also result in a real wage. I haven't had a 401k for 8 years. I've only had 4 weeks of vacation in the past 10 years. \n\nI think the idea is to enjoy it the best you can. It's the last easy hoorah of your life. Without the perspective of what working a garbage job is like, it doesn't really make college shine as it should. It's a HUGE opportunity to improve your life. I implore anybody who thinks college isn't worth it to work a factory job for a few years. When all of the joints in your body scream at you at 2 PM every day, sitting in a class listening to a professor for an hour really starts to seem like a good gig.",
      "author": "Awkward_Mail_2786",
      "created": 1637587382,
      "upvotes": 4,
      "replies": {
        "hln20ks": {
          "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hln20ks/",
          "text": "I hate to be that guy. But my degree will be such that I won’t be making $50k per year, and I’ll be living in a vibrant city where I have an abundance of spending money, time to pursue hobbies, and time to travel. I’m not flexing on you I just wouldn’t be in the same position as you financially, for me to feel the stress. Being able to take a vacation and travel when I want seems much better to me than college.",
          "author": "Normal_Flan_1269",
          "created": 1637590584,
          "upvotes": 1,
          "replies": {
            "hln4fth": {
              "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hln4fth/",
              "text": "Well, the 50k mark isn't about it being enough money but rather the work I was doing for it was just too much. The hard labor portion was never worth that money. I don't even know if it'd be worth twice that. 50k a year isn't a terrible salary, especially if your significant other is making the same money. I mean, that salary is what has allowed me to save to come back to college in the first place.\n\nI mean, if it works for you without a degree, by all means don't get one. A lot of the guys I'd worked with loved what they did and wouldn't do anything different. There are people who love the jobs that I walked out of. There are some stubborn fuckers out there that LOVE to do hard labor. It's strange. I like using my brain a little more I suppose. \n\nNon-degree jobs in my experience have the shittiest 'benefits' on Earth. No vacation until 1 year of working, and it's only a week. A lot of them didn't have any retirement benefits for me either. Most of the jobs I had aren't sustainable whatsoever. The staff is constantly turning over and the companies aren't going anywhere.\n\nAre you saying you'll have more than 50k a year? \n\nI think it's hard to see for young people the actual value of college. For me, it's terribly simple. I've got roughly 4 semesters left which will be around 30k total debt for the whole thing. Out of that, my salary instantly jumps 25k. Out of college, I'll EASILY be able to maintain my quality of life and pay off my loans in a year or two. Since I work together with my girlfriend, I'll probably pay hers off as well. \n\nI feel like college affords you more time than any job would for travel. We get breaks like every 3 weeks. Hell, I have a week off for Thanksgiving because all my professors cancelled classes for this week. A job won't afford you that much vacation until you're in it for 3-5 years. I never ever got more than a week of vacation after a year of work in the past 4 jobs I'd held regardless of position. I have more time to travel and focus on my hobbies now that I'm in college. Work definitely doesn't support that. Hell, most the time I'd be clocking overtime instead of having the time off I should. I hated it. Any time there was voluntary overtime, no matter how much they asked and begged, I told them no. I value my time away from work probably more than anybody. I HATE working over time. It's not what I need, it's what the business needs. I don't give a fuck about any businesses I've worked for. I give a shit about me and only me. \n\nGive it 10 years. Then look back on college and you'll be thinking what all of us old folks are. College is probably one of the better eras in someone's life. Just as much as being a child is. It's no different than looking back on yourself when you first hit high school and making that same comparison in life. When I look back at myself, I always thought I knew what I needed to know. In reality, I didn't know shit.",
              "author": "Awkward_Mail_2786",
              "created": 1637591758,
              "upvotes": 2,
              "replies": {
                "hln4t1a": {
                  "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hln4t1a/",
                  "text": "Oh no I’m in college. I’m a junior. I’m saying my degree will pay such than it’s more than 50k. This whole post isn’t a argument against going to college, it’s that for those that are in college, and im addressing posts where students said they aren’t living the college experience and are depressed. Im telling them that the idea that 4 years of your life are the peak of your life in itself is a depressing thought. Hence making you more depressed.  My degree will pay me well is what I’m saying.",
                  "author": "Normal_Flan_1269",
                  "created": 1637591932,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hln4xqn": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hln4xqn/",
      "text": "I saw always told that college was going to be the best years of my life. I didn’t have fun during high school because I was focused on university. I could have gone out with friends and gone to parties but I didn’t because I was told it would be worth it to stay in and study. I’m currently in my last year of university. I graduate this spring and it was definitely not worth it. I was told a lie and I think that’s a reason for my depression. I didn’t live in the moment and now I’m regretting it. University gave me a diploma, depression, anxiety, debt, and a chronic illness. \nMy life is never going to be the same again and that makes me even more depressed.",
      "author": "DepressyFanficReader",
      "created": 1637591992,
      "upvotes": 3,
      "replies": {
        "hln5q56": {
          "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hln5q56/",
          "text": "Thats why I’m saying you shouldn’t have bought into it.",
          "author": "Normal_Flan_1269",
          "created": 1637592358,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hln4z5n": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hln4z5n/",
      "text": "My thoughts exactly. I could never agree with people who claimed that college was supposed to be the most fantastic years of your life. \n\nI don't see how a student who 1.) has a part-time job because he/she needs money 2.) is trying to get good grades and graduate with a degree 3.) has personal issues is supposed to feel as if these 4 years are going to give him/her the best years of a person's life.",
      "author": "Melon-Kolly",
      "created": 1637592011,
      "upvotes": 5,
      "replies": {}
    },
    "hllvx9s": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hllvx9s/",
      "text": "Y'know, I'm sure there are people who needed to hear this, but I've never had a single person tell me that college was going to be the best experience of my life, everybody has always at least said that it would be very difficult but worth it, everyone else has ranged between that and saying that it will be absolute hell\n\nRight now I'm just finding it hard cause there aren't any breaks, even the upcoming Thanksgiving break won't really be a break since I have so much shit I need to do for classes over it anyway",
      "author": "Tandemdonkey",
      "created": 1637559834,
      "upvotes": 8,
      "replies": {}
    },
    "hllxoow": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hllxoow/",
      "text": "And you won’t believe how many people still think this shit lol. Despite the clearly logical and obvious facts.",
      "author": "elpresidentdeusa",
      "created": 1637560996,
      "upvotes": 3,
      "replies": {}
    },
    "hlm588w": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hlm588w/",
      "text": "Lol you haven't left yet.  Once you leave and have been gone for 5-10 years is when it hits you that it truly was the best time of your life. You can't see it yet because you haven't lost it.",
      "author": "GriIIedCheesus",
      "created": 1637566447,
      "upvotes": 3,
      "replies": {
        "hlmnlge": {
          "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hlmnlge/",
          "text": "I’m just saying I can make the best life for myself after",
          "author": "Normal_Flan_1269",
          "created": 1637581954,
          "upvotes": 3,
          "replies": {
            "hln332h": {
              "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hln332h/",
              "text": "Your ability to do do is dependent on a lot of things that are outside of your control.",
              "author": "GriIIedCheesus",
              "created": 1637591108,
              "upvotes": 1,
              "replies": {
                "hln3nqs": {
                  "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hln3nqs/",
                  "text": "Like what, I don’t really buy that",
                  "author": "Normal_Flan_1269",
                  "created": 1637591387,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hllq51h": {
      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hllq51h/",
      "text": "Just because you believe college isn't for you, doesn't mean that college isn't for everyone.",
      "author": "vibinggrass",
      "created": 1637556343,
      "upvotes": -6,
      "replies": {
        "hllqqbb": {
          "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hllqqbb/",
          "text": "Your missing the point of the whole post. I’m telling people who are getting depressed because they aren’t living the college experience to rid of the mindset that the best 4 years of their life is college. Because that thought in itself is depressing, in turn making them more depressed because aren’t living up to a lie they have been told. Because the idea that 4 years out of your entire life are the best lives EVER is a complete joke.",
          "author": "Normal_Flan_1269",
          "created": 1637556674,
          "upvotes": 6,
          "replies": {
            "hllrbu8": {
              "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hllrbu8/",
              "text": "I see you're point now. I agree that people say they're \"depressed\" even though they're just sad because they expect their college experience would just be handed to them. Personally, I enjoy my college experience. Luckily, I have roommates & friends that we all hangout almost everyday. We got to parties & stuff. Also, I'm living my best life, while I'm in college. However, causation doesn't mean correlation. Will I have a time period in the future where I am living a better life? Who knows? I have some major goals, both academically & athletically I wish to pursue.",
              "author": "vibinggrass",
              "created": 1637557020,
              "upvotes": 1,
              "replies": {
                "hllsr0d": {
                  "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hllsr0d/",
                  "text": "Right. That’s great for you. I’m saying, that people, in general, shouldn’t base their best years of their lives off of one 5-10 mile radius for 4 years. Your best years of your lives are yet to come if you choose to make them that way. Of course there are outliers to the exception. But what your college experience is may not be for others. And what im saying is what makes your lives the best years of you life is more than just what you do in college. And there’s opportunity to do so after. The college experience, doesn’t necessarily have to define the best years of your life. Tying those two things together will make life after college more depressing.",
                  "author": "Normal_Flan_1269",
                  "created": 1637557858,
                  "upvotes": 1,
                  "replies": {}
                },
                "hllw8hf": {
                  "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hllw8hf/",
                  "text": "You must be having the time of your life because it's correlation doesn't equal causation, not the other way around. Lol . You can't have a causal relationship without correlation.",
                  "author": "Mammoth-Title-2102",
                  "created": 1637560037,
                  "upvotes": 1,
                  "replies": {
                    "hlnzi5s": {
                      "link": "/r/college/comments/qz6ail/you_buy_into_a_lie_and_wonder_why_you_feel_so/hlnzi5s/",
                      "text": "i have no clue what he’s saying either",
                      "author": "Normal_Flan_1269",
                      "created": 1637604610,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}