{
  "sid": "qh726o",
  "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/",
  "title:": "can we talk about how NICE and FRIENDLY people are in college??",
  "text": "context: I'm a freshman in college right now and coming from a small private high school, one of the biggest differences I noticed is that people in college are so chill, nice and friendly. ok, so I know this could just come off as pertaining to my specific college or just to the people I hang out with..but it's not. People are always inviting me to hang out, study, and grab food together and idk how to explain it but it just feels so nice to have a lot of approachable people to talk, do things with and relate to. People here are so less judgy, rude and everyone just vibes with eachother. It also made me realize how crappy my hs friends were for the most part., and yes ik it's not totally like that, there are some snobby-ish people or people who obvi peaked in hs but other than that, did anyone else have any similar experiences or stories of meeting good people?",
  "author": "kashmiri-chai",
  "created": 1635370023,
  "updated": 1635456943,
  "over_18": false,
  "upvotes": 124,
  "upvote_ratio": 0.97,
  "comments": {
    "hibga5e": {
      "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/hibga5e/",
      "text": "Everyone freshman year is trying to make friends and meet people, it’s nice",
      "author": "logaboga",
      "created": 1635379992,
      "upvotes": 35,
      "replies": {}
    },
    "hibu60y": {
      "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/hibu60y/",
      "text": "I shouted \"nice\" and \"friendly\" in my head when I was reading the title lol",
      "author": "NoDryHands",
      "created": 1635386108,
      "upvotes": 29,
      "replies": {
        "hiee4u9": {
          "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/hiee4u9/",
          "text": "Lol",
          "author": "kashmiri-chai",
          "created": 1635439055,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hibqz3j": {
      "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/hibqz3j/",
      "text": "I might be wrong, but it's mostly a US thing. As a Swede attending an American Uni, I was incredibly surprised how friendly people are :)",
      "author": "elsa_the_swede",
      "created": 1635384716,
      "upvotes": 45,
      "replies": {}
    },
    "hic5w05": {
      "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/hic5w05/",
      "text": "It’s cause we’re all struggling so might as well commiserate with others",
      "author": "G3ek3r",
      "created": 1635391599,
      "upvotes": 9,
      "replies": {}
    },
    "hic9e19": {
      "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/hic9e19/",
      "text": "Definitely. The people in my community college were pretty friendly, but this semester I moved to a university and went into the dorms, and now I get the chance to talk to other students more than I ever did before...and I'm always happy with my interactions. To get into my dorm room, I have to use a keycard in two places, and if I'm carrying a lot of stuff and there are students by me, they will always open the doors for me. One time a man was inside the building, came jogging next to me and really went *out of his way* to open the door for me, lol. Everyone is very nice.",
      "author": "SquigglyHamster",
      "created": 1635393466,
      "upvotes": 7,
      "replies": {}
    },
    "hib6wjy": {
      "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/hib6wjy/",
      "text": "Also coming from a small high school, I've realized it's not just a college thing. In a small high school, you're going to see the same people every day, and will form friends based on shared schedules. With college, unless someone is in your major, with all the intro level classes you're taking, you won't see many of the same people around. Cliques have a much harder time forming outside of frats and sororities, so everyone has to reach out and make a lot more connections if they want to have a friend or two in every class. It's actually why I chose to go to a really big state school over a more specialized engineering one.",
      "author": "ArtisticEscapism",
      "created": 1635375763,
      "upvotes": 18,
      "replies": {}
    },
    "hiclt3e": {
      "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/hiclt3e/",
      "text": "Idk if it's me, but people are assholes.\n\nLike I'm beefing with few students because they tried to steal some tests( from out teaching assistant) and I didn't collude with them. I literally had to argue for them to put the tests back...\n\nIt's them I guess.",
      "author": "sundowner17442",
      "created": 1635401375,
      "upvotes": 5,
      "replies": {
        "hid48hc": {
          "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/hid48hc/",
          "text": "people are scum.",
          "author": "ObjectiveAnalysis643",
          "created": 1635416753,
          "upvotes": 3,
          "replies": {}
        },
        "hiee3na": {
          "link": "/r/college/comments/qh726o/can_we_talk_about_how_nice_and_friendly_people/hiee3na/",
          "text": "Yeah it’s totally them, just keep being yourself bro don’t let others get to you",
          "author": "kashmiri-chai",
          "created": 1635439042,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}