{
  "sid": "r3afvk",
  "link": "/r/college/comments/r3afvk/help_choosing_the_right_college_major/",
  "title:": "Help choosing the right college major",
  "text": "Hello everyone, I hope you are enjoying your time. \nI’ve graduated from high school, and just as the title says, I’m struggling to choose the right major, sometimes I feel like I want to be an engineer, other times a doctor, I feel hearing others advice might help me decide by knowing what I am going to study in medical college, and whether it would suit me. \nI’m sorry for making this post long but I’m really anxious and want help. \nThanks in advance",
  "author": "Bin_Masoud",
  "created": 1638007077,
  "updated": 1638206873,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hma5tr8": {
      "link": "/r/college/comments/r3afvk/help_choosing_the_right_college_major/hma5tr8/",
      "text": "What are your pros and cons of each major?",
      "author": "EmergencyAd9297",
      "created": 1638026744,
      "upvotes": 3,
      "replies": {
        "hmaardr": {
          "link": "/r/college/comments/r3afvk/help_choosing_the_right_college_major/hmaardr/",
          "text": "For instance: \nMedicine:\nPros:\n•I feel satisfied when I help other people. \n•I think it’s challenging and I like challenges;)\nCons:\n•time consuming \n•People saying it’s very hard but I think I’m capable of it. \n•I love physics and chemistry but biology is not my favorite although I like studying it. \nIT and CS:\nPros:\n•I love computers and programming and during my free time I find myself thinking about it without a glance. \n•I see the future within it. \n•People say I’m quite talented with computers. \nCons:\n•I’ll have quite a trouble finding a job where I live. \n•most of universities around me aren’t really qualified and teaching an outdated curriculum. \n\nAnd that’s just to name a few",
          "author": "Bin_Masoud",
          "created": 1638029026,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmalori": {
      "link": "/r/college/comments/r3afvk/help_choosing_the_right_college_major/hmalori/",
      "text": "I wouldn't stress too much right now. You're going to be a freshman and it's pretty common for students to flip flop on majors during their freshman and sophomore years. I ended up changing mine 3 times. The key thing to remember is RESEARCH....RESEARCH....RESEARCH. I cannot stress this enough. If you know what you're about to get into and what to expect it will make your experience so much better. Take this time to maybe narrow down on a profession that interests you and then choose your major accordingly.",
      "author": "spartan1115",
      "created": 1638033836,
      "upvotes": 3,
      "replies": {}
    },
    "hm9tcpd": {
      "link": "/r/college/comments/r3afvk/help_choosing_the_right_college_major/hm9tcpd/",
      "text": "Considering we know absolutely nothing about you or what you like to do, this could become long format really fast.",
      "author": "Awkward_Mail_2786",
      "created": 1638020144,
      "upvotes": 2,
      "replies": {}
    },
    "hm9x9i8": {
      "link": "/r/college/comments/r3afvk/help_choosing_the_right_college_major/hm9x9i8/",
      "text": "It is normal for someone to change their major multiple times. General ed classes are required to make a \"well rounded scholar,\" but it also helps to see what other subjects are out there. You may find that a business or accounting class is really interesting and want to pursue that, for example. That is why it is suggested to try not to take too many of your major courses in your first year in case you do change your major and it won't be wasted time.",
      "author": "metalheadplanner",
      "created": 1638022382,
      "upvotes": 2,
      "replies": {}
    },
    "hmagl4k": {
      "link": "/r/college/comments/r3afvk/help_choosing_the_right_college_major/hmagl4k/",
      "text": "I dont think your major really matters in the end, especially if you are generally interested in science. just pick one at random, more than likely you can change it pretty late into your college career. \n\nfocus more on what classes you are taking",
      "author": "LowElectrical9168",
      "created": 1638031638,
      "upvotes": 2,
      "replies": {}
    },
    "hmaligt": {
      "link": "/r/college/comments/r3afvk/help_choosing_the_right_college_major/hmaligt/",
      "text": "Well, doctor and engineer are very different professions that you’d follow a very different path to become. Id focus on your favorite subject and turn it into a career. For example, I really like biology so I’m studying it in school and I’m going to do something in the future with it like grad school or med school.",
      "author": "sgRNACas9",
      "created": 1638033762,
      "upvotes": 2,
      "replies": {}
    }
  }
}