{"sid": "bd128e", "link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/", "title:": "Does anyone else feel like some students make college a lot harder than it really is?", "text": "*So before I go further into this post, college can be super challenging and different schools/majors require a different workload.  I understand that college can legitimately be the hardest time of your life.  This purpose of this post is not to attack or single anyone out.  I suffer from several different learning disabilities and have experienced some of the challenges that many students face.*\n\nIn high school, I was a C student at best, and honestly, it was touch and go if I would even attend university.  After hearing many horror stories from older students I entered my freshman year terrified. I thought for sure I would fail every class, but I actually found it to be super easy. For the last four semesters, I have faced some challenging times but nothing on the level that other students complain about. I hear these stories about students staying all night for multiple nights during the week, or stories about students having total meltdowns during dead week and I get a bit puzzled. Like I said above these are all very real valid things that occur on college campuses, but I personally feel like some students make it a bit harder for themselves than it has to be. From my experience, I have noticed that even at my (and a lot of my classmates who I have discussed this with)  worst if we apply ourselves most assignments are very manageable. I feel like the elitist stigma we currently have regarding college creates a lot of unneeded anxiety for new students. Throughout high school, we are constantly trained to succeed at standardized tests that require you to over think.  I think this conditioning is extremely dangerous, and that for a large percentage of students overthinking is actually a bigger enemy to their education than even the most challenging of courses. I made a 19 on my ACT and finished high school with a 2.7-ish. I now have a 3.5 in college, and I feel like not being prepped for standardized testing has actually helped me.  My question here is do any of you agree or have similar experiences?  It has been very hard for me to find students who can relate to my experience.\n\nEdit: I think a lot of the negative comments just read the title and nothing else. I want to state once again that elements of college can be overwhelming and challenging. Struggles and break downs are ALL valid.  Once again the purpose of this post was to share how I feel over thinking and elitist culture affects students.", "author": null, "created": 1555233607, "retrieved": 1632947968, "over_18": false, "upvotes": 619, "upvote_ratio": 0.93, "comments": {"ekz754m": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekz754m/", "text": "Funny, my life went the opposite way. I breezed through high school even taking AP courses, now I struggle in college. Sometimes I wonder if it’s worth it.", "author": "Inopmin", "created": 1555368794, "upvotes": 1}, "ekx2n6a": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekx2n6a/", "text": "i see! thanks so much! and another question—how do you pace yourself on longer/more complex assignments? do you split it up into chunks or devote a large chunk of time for it?", "author": null, "created": 1555300091, "upvotes": 1}, "ekwum7u": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekwum7u/", "text": "I've done waayy better as a student in college than high school, my first semester of college was awful though, because i was new to college but then i was able to comeback to a 2.9 almost 3.0 gpa.", "author": "Carloverguy20", "created": 1555293557, "upvotes": 1}, "ekwttgu": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekwttgu/", "text": "I feel very very similarly. I’ve had a few breakdowns but it’s less because of academics and more because I hate my current college. I graduated with a 2.84 and had a 3.62 last semester and I’m probably gonna have something in the 3.0-3.8 range this semester too. I feel like a lot of us students who’ve failed like crazy in high school but come into college are a bit more prepared for the failures and get through them quicker then our peers who are used to success (especially when that success came easy).", "author": "blvcktea", "created": 1555292878, "upvotes": 2}, "ekwryhh": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekwryhh/", "text": "Well first thing is that your professor can make or break the class. You can have a teacher with all the knowledge in the word but he’s unable to get his message across to students. Some teacher might have a crappy grade policy. So the first thing is get a good teacher. Now when looking up teacher rating on rate my professor or word of mouth if they say a teacher is horrible ask why!\n\nIn my experience so far the teachers who are disliked tend to be the easiest. Often times they have attitudes and can come off as arrogant or narcissistic but they often make their expectations clear. Do this and you get an A and it’s often times the easiest at least for me. \n\nNow teachers with a higher recommendation are usually more fun but you also want to make sure you are learning. So you need to determine what you need from the class. A gpa booster, learning the actual material or getting a gen ed out the way. Then you chose a professor base off that. \n\nShow up to class, most classes just showing up and paying attention alone can get you at least a C+ do homework and don’t procrastinate until last minute. You had a month to write that essay and you decide to wait until the last two day. Why should I feel bad for you?  \n\nGet to know your professors, if you’re friendly with them I generally find that they are more lenient in grading me and they are more likely to write letter. What I usually do is go up to them and ask for advice on something, even if it’s something you don’t want their advice on. I feel like a lot of them are often times happy to share advice and they like you more. That’s what I did in Calc II. I did not get a single grade over 80 and got an A in the class, there was no curve and there were a lot of kids with 90s average so just play smart. \n\nI feel the idea behind college is being able to manipulate your way through, why work hard when you can work smart.", "author": null, "created": 1555291196, "upvotes": 1}, "ekwqc5v": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekwqc5v/", "text": "Agreed. High school was alot of work for me. I felt like it had way more assignments, the competition between my peers was much fiercer AND I had 8 classes. College has fewer assignments, more genuine collaboration with peers, and I only took 5-6 classes at a time. The cherry on top is that I loved what I studied in college so that made the hours I spent working on something with friends rewarding instead of draining.", "author": "ertgbnm", "created": 1555289735, "upvotes": 1}, "ekwln0n": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekwln0n/", "text": "I think college only feels easier because students apply themselves much more here. Any comparison to high school is already going to be skewed because you're required to attend high school and college is a choice. When I know I have an upcoming test that's going to be difficult, I start studying weeks ahead of time. In high school, I could study the night before a test and come out with an A or not study at all and still do relatively well. College requires independent effort that you may or may not notice you're putting in. I have a GPA of 3.8 in college and I had a 3.5 in high school. It's a small difference, but I assure you I work more than 3 times as hard in college.", "author": "Derek_Coco", "created": 1555285811, "upvotes": 2}, "ekwjx5q": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekwjx5q/", "text": "I have had the experience of going through college twice. During my first time, I made a lot of the mistakes that all college students make. I cut classes, I procrastinated, I didn't do homework, I never studied throughout the term. So of course I was stressed at test time because I had no preparation. I put in all nighters right before tests and projects because I did no preparation and didn't manage my time wisely.\n\nTo me, it seemed like college was hard because I coasted through high school without having to study, manage my time wisely, or do homework, since I was a \"smart\" kid. When it came time for college, I didn't have any of the skills I needed to succeed in that environment.\n\nMy second time around, I had specifically learned how to manage time, how to study for small amounts of time daily and weekly rather than try to do everything right before big tests or deadlines. In contrast to my first college experience: I NEVER pull all-nighters. Though I study almost daily, I'm really only studying a few hours a day. My entire day of work is only around 4-6 hours, compared to an 8 hour job. And I'm getting a 4.0.\n\nPeople think that 4.0 students must be grinding hard in the library, but I swear to you, I have so much free time, I don't often know what to do with it. I don't work in the evenings, and my weekends are always free, and I usually don't start working until 10am each day.\n\nMeanwhile, a student struggling to get a 3.0 will spend hours upon hours in the library wondering why they studied for 20 hours for a test, and are barely passing. It's because they aren't being realistic about how they're spending their time. \n\nFor example a struggling student might spend 10 hours in a library but only like 1 hour doing work, and the other 9 hours messing around on social media or their phone. Whereas a student who knows how to manage their time will spend 3 hours at the library, and all 3 hours of that time completely focused. The 3 hours of focused time is more productive than the 10 hours of unfocused time, and the 4.0 student has 7 more hours of free time than the non-4.0 student.", "author": "peregrin5", "created": 1555284360, "upvotes": 2}, "ekwitpg": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekwitpg/", "text": "Unless you’re like us fellow engineers than you soon realize it’s just a fact of life and get used to it.", "author": "WhitE-TightE", "created": 1555283425, "upvotes": 1}, "ekwi4z9": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekwi4z9/", "text": "I think some of the more “elite” colleges can be pretty difficult. College is definitely harder for me, but some of my homies from high school who went to  state schools have said that college is easier than high school for them. Im still doing better in college than I did in high school, but that’s because I take this very seriously since it costs money. It’s all relative imo.\n\nEven then, going to class and having time management skills makes things easier.", "author": "JWiLLii", "created": 1555282833, "upvotes": 2}, "ekwegd2": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekwegd2/", "text": "Man no offense, but this is SO dependent on your major. I’m in a generally tough major. I’m a week of classes and finals away from graduating. I’m not saying tough major students need to stay up all night multiple times a week.\n\nSometimes though that shit is just necessary. Maybe I do have to stay up late sometimes because I slacked off for a day or two, but you need that to keep your sanity. I’d much rather work until 4am once in a while than work from 8am to 7pm every day. I’m not perfect and there are ways to go to bed early every day, but that takes an insane level of focus and a hit to your social life.\n\nBottom line, I’m saying I think some majors are a lot tougher than you’re giving credit. Hell I’ve got a lab this semester where for 3 months, every TTh, we got lab projects that quite literally required us to be in lab for at least 6 hours those days. Not to mention having to write 20-30 page lab reports each month while doing countless hours of calculations. That class alone is regularly responsible for 25 hours of my time a week. I’ve got another senior design class that takes probably 15 hours a week outside of class for our project that’s worth half the grade.\n\nMeanwhile I’ve picked up an unrelated minor and in those classes I don’t got to class, only study the day before exams and score 90s. Some majors are incredibly time consuming. Some are not. So unless you’re speaking from the standpoint of someone about to graduate from a very tough major, I’d suggest you shouldn’t criticize those who have to really bust their ass day in and day out.", "author": "lil_v_vape_god", "created": 1555279760, "upvotes": 3}, "ekwcddm": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekwcddm/", "text": "Oh gosh, I don't know. I just started at a 4 years uni this semester after doing great and getting an associates at community college. I have been struggling pretty hard with my classes in my major and I honestly cannot figure out why. I study soooo much. I don't put off homework. I go to the extra discussions. I just don't know. I feel stupid", "author": "grebilrancher", "created": 1555278127, "upvotes": 2}, "ekw9deh": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekw9deh/", "text": "I think it depends a lot on the school you go to. Some schools are significantly harder than others. It also depends on your major / how hard that program is in your university. I just got in to my major (we have to apply here) and it is a very good but strict program in my school, I have been studying at least 2x as much this quarter. That being said it also depends a lot on your time management skills. You spend way less time in classes and the main thing in college is studying and doing work by yourself (that requires you to manage when to do it). I have fairly good time management skills and it is clear how much less stressful it is for me. I know plenty of people who to bed late to finish assignment, can almost never hangout because they are always behind, etc. I on the other hand, sleep 8-10h per night and have time to do all the fun activities I like.   Even then, I wouldn’t say college is easier that hs at all. I went to a private college prep hs that was pretty serious about academics, but even then I had to put much more time in to succeed in college than hs.", "author": "toiavalle", "created": 1555275755, "upvotes": 2}, "ekw8zff": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekw8zff/", "text": "I agree in some ways, disagree in others. I've had some really good semesters where my marks were great and I was never stressed out, I've also had terrible semesters where I've failed a class and had weeks of sleepless nights and hair falling out.\n\nThe difference for me all comes down to staying on top of things, it's all easy until one of the plates you're spinning starts to wobble, and then everything comes crashing down. Last semester I was doing really well in all my classes, but let one of them slip away from me a little bit, next thing I knew I was behind in all of them as a result of trying to catch up on the first one.", "author": "BaddestBrain", "created": 1555275450, "upvotes": 1}, "ekw8sib": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekw8sib/", "text": "I always feel like the odd one out. My major is a lot of work - I’m taking 2 pure math, 1 upper level Econ math, 1 mid-level finance math, and a foreign language.\n\nMy friends think that our work loads are comparable, but they’re just not. They act annoyed that I have to study every moment I can. They think it should be easy to pass these classes because they get A’s in the one difficult class they’re taking that semester. And they think I make it harder than it is or exaggerate or am hard on myself.\n\nI used to be a liberal arts major, and I thought that coursework was difficult. Now, I see that STEM is both difficult and extremely time intensive. You can’t skim a math textbook and suddenly know how to do it. You have to do a ton of practice problems, and I’ve experienced where 1 problem takes me over 30 minutes even WITH help because they’re that intense. If you’re lucky to get a good teacher, that’s great. But sometimes I get teachers who confuse me and have to spend twice as long watching youtubes or going to math tutoring.\n\nAnyway tldr; sometimes we aren’t making it more difficult than it is, and I hate that my friends treat me like I am because they don’t believe it’s more difficult than their experiences.", "author": "mintjubilee", "created": 1555275300, "upvotes": 4}, "ekw7heb": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekw7heb/", "text": "When I’m not working, college is a breeze. Now that I work 40-50 hours a week, married, and mother of an 18 month old life’s pretty crazy. I submit my work usually 5min before it closes. I try to stay on top of it, but it isn’t always reality. When I only worked 25 hours a week I submitted things same day or next day it was assigned. I get home at 6:30pm usually. I make my daughter dinner, eat, play with her until about 9pm and put her to bed, and then I do my work. Some nights it’s a 5min quiz, sometimes it’s not. I try and use a portion of my weekend to work on the projects that take longer. However, I also have to do laundry, clean, spend time with my daughter. It’s all about time management in college and unfortunately in my case it isn’t always poor time management it’s just literally not having enough time in the day. Currently have a 3.57 though. I was a 4.1 GPA upon graduating high school. Even though it’s not the 4.0 I want I’m pretty proud of it.", "author": "KnitKnackNo", "created": 1555274257, "upvotes": 2}, "ekw5fg4": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekw5fg4/", "text": "Honestly looking back, (as an-almost graduate) with the exception of one class, all the classes I did so-so in or straight up just didn’t pass, were not these incredibly hard classes, but rather classes I just wasn’t willing to put the work/effort into.", "author": "leo080997", "created": 1555272633, "upvotes": 1}, "ekw4h62": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekw4h62/", "text": "What's your major? Some majors are much harder than others.", "author": "destructor_rph", "created": 1555271888, "upvotes": 3}, "ekw39sz": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekw39sz/", "text": "[deleted]", "author": null, "created": 1555270950, "upvotes": 7}, "ekw3409": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekw3409/", "text": "I definitely agree with you, but I also think it depends on what kind of student you are. Some students require more studying or just have a harder time getting motivated to do work, while others can just listen to the lecture and ace a class. I think situations where students are pulling all nighters and having emotional breakdowns over school could be prevented. Personally, I’ve only ever pulled all nighter if I left a huge assignment until the very end. I honestly don’t think you need to unless you’ve been majorly procrastinating. As for emotional breakdowns and crying, this is usually caused by being overwhelmed, so yes - if you’re setting yourself up for these situations by skipping class, not doing homework, etc, then college will be hard. When I first started college, I heard all the stories about students pulling all nighters and studying in the library all day and night. However, when finals came around for me, I did just about as much studying as I would for any other test. I still maintained my same daily schedule, and I felt like it was any other school week.\n\nOverall: yes. Students make it harder than it needs to be.", "author": "squishybeary", "created": 1555270824, "upvotes": 1}, "ekw1j3g": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekw1j3g/", "text": "I definitely make it harder than it has to be. In high school I generally put off everything until the last second. I did ok.\n\nIn college I knew I couldn't do things the same way. I did some time management stuff and it worked well, but when things really started heating up then the time management techniques kinda fell to the wayside. I don't know if it's burnout or being a lazy shit. Either way, I'm back in a cycle of \"do everything at the last possible second during the week, then on the weekends completely shirk your responsibilities and try to recover from the five days of stressful bullshit you subjected yourself to\". Then deadlines start coming up again for the next week..\n\nbleugh", "author": "Kapalka", "created": 1555269595, "upvotes": 1}, "ekw0khr": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekw0khr/", "text": "Tbh I was so nervous for college, as long as you dedicate the time to just get shit done you'll be fine! I barely go to class and have As and Bs", "author": "DChappyC", "created": 1555268839, "upvotes": 0}, "ekvzczy": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvzczy/", "text": "It depends on the student really. For some students what may come as common sense to you or I may take a longer adjustment for them. To me, college was a great learning environment because I got to structure my own time and plan things the way that helped me learn the best. However, self-motivating myself to learn was already a habit for me in high school. Other people really struggled because it wasn't second nature for them or they didn't really need as much effort to succeed in high school. They have to learn through trial and error how to study and how to discipline themselves to prevent procrastination.", "author": null, "created": 1555267931, "upvotes": 3}, "ekvyrmu": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvyrmu/", "text": "I think you're missing that a lot of people are active in other parts of college life outside of just the academics. Some clubs are a lot more work than just classes and they will have deadlines, requirements, etc. that you can't miss. A lot of people have to also work these days. So yes, the actual schoolwork might not be a ridiculous amount, but if you're working a part time job, active in extracurriculars, and also trying to do schoolwork, it can be a lot to handle. \n\n(This isn't saying that everyone is like that or it's impossible to have a high GPA like that, but I think it's important to remember that the college experience can be very different depending on what you're actually participating in and doing.)", "author": "doneanddead", "created": 1555267500, "upvotes": 3}, "ekvwmgq": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvwmgq/", "text": "YESSSS. Once in high school I pulled an all-nighter to study for my US Government final, but I failed anyways. So, I was in a pretty shitty mood and told this to one of my friends that was a year older and in her first year of college. Her response was: “Just wait until college, that’ll happen ALL THE TIME.” At that moment I never felt more like shit. But nah, I don’t think college is that much harder.", "author": "turboshot49cents", "created": 1555265926, "upvotes": 1}, "ekvw5x9": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvw5x9/", "text": "What college did you go to? Asking because it's very hard to get into college with such a GPA.", "author": "Flairtor", "created": 1555265590, "upvotes": 3}, "ekvv8w0": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvv8w0/", "text": "I did terrible in highschool but college is a breeze. I think doing college after the military helped with that and having some life experience makes it easier. Maybe those who come from high school should take a year break or have a normal job for a little bit to learn some independence. High school doesn't teach you to adult or teach you how to do life on your own, it holds you hand too much. I hate when people micromanage like high school does but \"honors\" students from high school, a lot only know how to do good when they're being babysit constantly.", "author": "thinkB4WeSpeak", "created": 1555264921, "upvotes": 0}, "ekvskgt": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvskgt/", "text": "It depends on what you're aiming for. I'm aiming for as close to 4.0 as possible as an engineering major, so I do struggle. If I was aiming for a 3.5, then college would be significantly less stressful.", "author": "MarxSoul55", "created": 1555263015, "upvotes": 9}, "ekvsbyb": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvsbyb/", "text": "No offense, but if you got a 19 on your ACT and a 2.7 GPA of course college is going to be easy. You could only get into ”not good” colleges. I got almost double your ACT score and over 1.2 GPA points higher (unweighted), went to a top 20 institution, and it’s hard. If you aren’t smart in high school you’re not going to really get challenged in college because your options are limited.", "author": "dhesswfb26", "created": 1555262846, "upvotes": 2}, "ekvs6fq": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvs6fq/", "text": "I think it depends on the college too. There are some college where getting even getting a B isn't simple.", "author": "curly_headed_cutie", "created": 1555262735, "upvotes": 4}, "ekvqy04": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvqy04/", "text": "This post seems really useless.  So much of your difficulty in college is based on major, the difficulty of the school, and your other necessary commitments (working).  These factors vary so much that saying \"I don't know why it seems so hard for everyone else\" or \"it's all about time management\" sounds really condescending.  \n\nI work 35 hours a week, attend and top public university, and major in engineering.  I've never pulled an all-nighter and I make it a point to get ~8 hours of sleep every night.  I am allergic to procrastination and always have been, it stresses me out when my assignments aren't done at least a few days in advance.  My time management skills are excellent and my classes aren't too bad this semester, and it's still stressful at times.  In contrast, I have friends that work a lot less while taking harder classes, and they pretty much only sleep on the weekends because they are so busy.\n\nCollege is hard, and I'm really over people saying \"time management is key\" and \"you just need discipline\" when some people really do have it a lot easier than others in a lot of ways.  Stop making comparisons and wondering about why other people are struggling so much when it's not that hard for you.  You know very little of the stressors in their lives, don't judge them for breaking down in the library.", "author": "jtg11", "created": 1555261831, "upvotes": 45}, "ekvqhxf": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvqhxf/", "text": "You didn’t mention what college you attend and what you’re studying. \n\nThis may be news but colleges range in academic rigor from vodka day care to preprofessional gpa dogfight.", "author": "CreamyRook", "created": 1555261503, "upvotes": 8}, "ekvqemu": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvqemu/", "text": "I have been more successful in college than in high school. My success is due to discipline and tie management. As long as you have a calendar  and put important dates from the syllabus on there and plan accordingly, you should be ok!", "author": "RatherBeStoned", "created": 1555261435, "upvotes": 1}, "ekvorsn": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvorsn/", "text": "I think it 100% depends on your major and your overall position in life. For me, managing school work, working full time , trying to spend time with both (divorced) parents and a little brother, and my own apartment is nearly impossible without going crazy. I think people in college all have very different experiences for different reasons.", "author": "Leahcar8819", "created": 1555260267, "upvotes": 7}, "ekvomdc": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvomdc/", "text": "[deleted]", "author": null, "created": 1555260170, "upvotes": 10}, "ekvmr1z": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvmr1z/", "text": "For me college is just more inconvenient\n\nI am always stuck with terrible class hours. Like having to take a class that meets at 7pm.", "author": null, "created": 1555258786, "upvotes": 1}, "ekvm8f2": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvm8f2/", "text": "I definitely make my life harder by procrastinating. I know I do it, and there's no logical reason to, but I just can't stop myself. I didn't do standardized test prep beyond what was required in my regular classes, but I don't really understand why that would make college harder", "author": "SkiMonkey98", "created": 1555258401, "upvotes": 1}, "ekvlswt": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvlswt/", "text": "Just curious OP what is your major?", "author": "Mr_Voltiac", "created": 1555258076, "upvotes": 4}, "ekvl5ev": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvl5ev/", "text": "College is mostly about time management.", "author": "throwaway184726492", "created": 1555257584, "upvotes": 2}, "ekvkf01": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvkf01/", "text": "College classes and grades are only a fraction of what a student can focus on. This doesn't apply to everyone, but my first and second year was wasted because I didn't really do anything with all my free time outside of school, work and exercise. I wasted many spare hours playing video games, browsing the web or sleeping. If you feel it's too easy, do more work, college is supposed to be challenging so you can grow.", "author": "TinnkyWinky", "created": 1555257040, "upvotes": 4}, "ekvjg0h": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvjg0h/", "text": "It's its own culture, really. Any \"college student\" page on social media is memes about failing and how everything is so hard. People are dramatic and make things out to be worse than they are because they think it gets them sympathy. The reality is that yes it gets hard sometimes, but most students never truly try and, as a consequence, are always playing catch up and not doing well.", "author": "grahamalondis", "created": 1555256302, "upvotes": 3}, "ekvgt57": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvgt57/", "text": "People who have to pull \"all-nighters\" just can't plan properly and waste a lot of time", "author": "Sennheiser321", "created": 1555254284, "upvotes": 171}, "ekvg50d": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvg50d/", "text": "Yeah, and I think it’s because said students still haven’t developed a good work ethic/attitude and think that a work session where they’re on their phone every 15 minutes or talking to a friend half the time  is going to suffice. And possibly because they haven’t learned how to budget their time properly, ie, the kid who signs up for two sports and six clubs and then wonders why he is falling behind on his school work. \n\nBut There’s definitely some people who have good reasoning for saying school is so difficult. Any STEM majors,  for example, have very good reasoning with the extremely rigorous curriculum that those majors have.", "author": "Ms_Digglesworth", "created": 1555253743, "upvotes": 1}, "ekvg2ay": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvg2ay/", "text": "I think it's dependant on your major and the program at your university. I was a straight A, 3.9 GPA student in high school and now I'm going to be finishing college around a 3.35. I'm a chemistry major and the upper level classes are HARD. One class in particular that I am taking right now is taught like a graduate level class and is double the work of any other class I have ever taken. My classmates and I easily spend 20hrs a week on this class between class, lab, study group, lab reports, and homework. \n\n\nOn the other side of things, the general classes everyone has to take were extremely easy. I got an A in those classes without much effort at all. I also took a fair number of nutrition classes for personal interest reasons and found those to require very little effort as well. At my university, it seems like the non STEM majors are relatively easy to complete because there aren't 4-5 hour labs attached to each class.", "author": "BlondeNinja182", "created": 1555253683, "upvotes": 29}, "ekvft0d": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvft0d/", "text": "I'm actually kind of in the opposite boat. I chose to go from a teeny tiny high school to a massive and prestigious school, because I was getting a full ride and I wanted to move out of the house for college instead of commute.\nEnded up pulling C's and Bs instead of the all As I was used to, and I've been studying my stupid little butt off every day. \nI'm still average compared to everyone here, but I took classes at a different state school for summer freshmen and sophomore year, and got As. So I think it's just this dumb dumb poo poo head school that I chose for myself. \nEven tho I do love it, I STRUGGLE man, I don't have any free time at all. I literally block out what time each day I have to study what subject, so I don't fall behind. Sucks butt man", "author": "bad_at_formatting", "created": 1555253472, "upvotes": 9}, "ekvfsdm": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvfsdm/", "text": "There are so many different tiers of universities here in America. If your college accepted you with mediocre grades and test scores, that absolutely is indicative of the amount of work it takes to succeed there. I don't want to be rude, but I believe you go to an easy school.", "author": "choontang", "created": 1555253458, "upvotes": 84}, "ekvfnme": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvfnme/", "text": "At first I was a little nervous when people would talk about how they got their ass kicked the first semester and all that. But honestly as a junior in international studies and I work 20+ hours during the week, college is pretty easy. Didn’t understand what the fuss was about. Especially in the first year because all you’re doing is taking freshman 100(0)-level Gen Ed courses that are made to be so easy, it’s really hard to fail. But some dumbasses still manage to fail them.\n\n\nAt least on the humanities side, they make the Gen Eds like introduction to sociology, anthropology, etc so damn easy. All you do is show up, and the professor puts the slides online so you don’t have to worry about taking notes. And the quizzes and tests are usually online and they give you a couple days to do it. So you’re just bound by the honor system. Homework isn’t usually anything more than reading or doing multiple choice quizzes or something.", "author": null, "created": 1555253349, "upvotes": 1}, "ekvf4ne": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvf4ne/", "text": "I really think people complain about college cause it's the \"cool thing to do.\" Everyone loves to make Instagram posts, snaps stories, etc about how hard college is. I've seen so many snap stories from people studying at the library at like 2 am, but in reality they spend most of the time talking to friends or wasting time on their phone. \n\nEspecially in engineering, people really buy into the \"C's get degrees.\" Like somehow since your major is hard, it's okay to get bad grades and barely pass your classes. \n\nIf you come in with a mindset of excellence and are committed to doing well, college really isn't that bad no matter what major you're in. I think most people just lack the discipline and drive, not the intelligence, to do well.", "author": "BigSnugs", "created": 1555252909, "upvotes": 19}, "ekveqck": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekveqck/", "text": "I agree. Maybe it’s due to my major (Computer Science), and my school (far from being an Ivy League), but I had the free time to watch five fours of professional LoL games yesterday before sitting down again for the four hour runtime of Lord of the Rings: Return of the King. I don’t know where these horror stories I hear from others come from.", "author": "eazeaz3", "created": 1555252570, "upvotes": 2}, "ekvdlxt": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvdlxt/", "text": "I think you’re absolutely right! Of course, it depends on the person, school, and major, but I’ve found that if you stay on top of things, it’s not so bad. Of course, I’ve had some late nights and some frustrating classes, and I will have more, but nothing compared to what I was told I was going to face.", "author": "abbygrau", "created": 1555251603, "upvotes": 14}, "ekvcn4y": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvcn4y/", "text": "My problem was I assumed the opposite lol. Undergrad was no problem and I definitely didn't understand how some people did the things you mentioned. Grad school, though, I assumed people were exaggerating about my program. Nope, it was totally inevitable that I was going to hate my life while being drowned in work lol.", "author": "Underground_Queen", "created": 1555250713, "upvotes": 13}, "ekvb6fu": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvb6fu/", "text": "[deleted]", "author": null, "created": 1555249315, "upvotes": 80}, "ekvaq8v": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvaq8v/", "text": "Sometimes it feels like I don't have a lot of time, but it has never really been an issue in hindsight. I have never had to sleep less than 7 hours and never really done school work after 9pm in H.S or College. Sleep 9:30pm-5:30am every morning for reference. \n\nI think people just study inefficiently or maybe pick material slower? I almost always have 30-35 free hours a week and I work full time + double major in chemical engineering and economics so I think its reasonably difficult work... Only ever got 1 3.5 class in a poorly structured orgo chem class, easy 4.0 in the 2nd Orgo course with a better instructor. \n\nI think the key is picking things up when you learn them in class and such, don't wait to learn.", "author": "Altedd", "created": 1555248862, "upvotes": 18}, "ekvaf1e": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekvaf1e/", "text": "I definitely agree with the sleepless nights, it's never been an issue for me, never had to stay up any later than I wanted to, thus keeping a consistent sleep schedule. I'm a sophomore becoming a junior in the Fall, and honestly haven't faced unbearably hard challenges, maybe some annoying one's but not challenging per se.", "author": "Muinonan", "created": 1555248551, "upvotes": 14}, "ekv7efp": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekv7efp/", "text": "Yeah I find college a lot easier than high school and I think part of it is having control over my schedule and studies. If you’re not working more than like 20 hrs/week or struggling with insomnia/another health issue I don’t really see any reason you shouldn’t be able to get 8 hours of sleep every night. I also think a lot of kids freak at not being 4.0 students anymore even though the grading standards are totally different. I definitely wish I had done better in high school but in a way being accustomed to failure put me in a better mindset for college haha", "author": "puffy-jacket", "created": 1555245193, "upvotes": 39}, "ekv2mlj": {"link": "/r/college/comments/bd128e/does_anyone_else_feel_like_some_students_make/ekv2mlj/", "text": "I was nervous when I started college a few years ago. However, one of my friends told me that I shouldn't worry because her friends told her that college is much easier than the high school we were at. I didn't do that well in high school either, but my GPA definitely improved when I was in college. I agree with your reasons. I think a lot of it has to do with time management. In college, there's a lot more time to be considered. I remember one class was very hard for me, and I was very overwhelmed for the final paper due date. I was so stressed out that day as well because I had a flight to catch. So, I submitted my paper on the plane.", "author": "travelwaves", "created": 1555238287, "upvotes": 226}}}