{"sid": "jcb2qb", "link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/", "title:": "Is anyone else slipping?", "text": "At the beginning of this semester, I was doing great. I was finishing assignments early, I was on top of studying, I knew the material and I was doing well on the grading portion of all my classes. However, sometime around the end of September, I felt myself slipping in one of my classes, and started to see my grades dip slightly, and just recently, I realized its happening to all of my classes. It feels like I'm at least a week behind where are in the course material, and that there's an insurmountable gap I have to bridge before I can catch up with everyone else. Is this slow decline happening to anyone else?", "author": "restinstress", "created": 1602859473, "retrieved": 1632947279, "over_18": false, "upvotes": 1210, "upvote_ratio": 0.99, "comments": {"g93blcj": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g93blcj/", "text": "Yeah, I had a pretty hard time focusing in highschool, and then went to college for a semester, dropped out. Took year off. Thought about life. Changed my major. Did good the first couple weeks but then started failing my philosophy class. So I withdrew from it last week to take just two courses and focusing on them has been easier somewhat. Still hard to focus day to day and devote time to it.", "author": "kylejacobp99", "created": 1602931615, "upvotes": 1}, "g92oumn": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92oumn/", "text": "It's ok! Don't beat yourself up about it. If you can, try seeing a counsellor or possibly taking one fewer class next semester. I found that I really couldn't keep up with all the stress from the \"normal\" 16 credit courseload, and I learned so much better when I took 12 credits at a time. I loved summer classes; the 3 weeks of intense focus on one thing brought me up from D's to A's. I failed a LOT of classes, but I ended up graduating anyway because the summer classes pulled my gpa up so much! I also slept better and studied more when I had fewer classes. I know it could be hard to do that if you have constraints from funding, so it's extremely important to seek help through therapy to help deal with stress.", "author": "chiahroscuro", "created": 1602908956, "upvotes": 1}, "g92nl83": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92nl83/", "text": "Deadass, I don’t know if I’m getting bored with class or what. I’m not slipping too hard, my grades are sitting a *little* below what they would normally be at but I’ve been having a LOT less motivation to really do any school work. It’s my last semester so I’m sure that’s part of it, but I also feel like professors are taking the opportunity to just pile on extra shit work in place of not having in-person class. Instead of going to class and sitting in a lecture where I’m TAUGHT the material in a meaningful lecture or discussion, now I’m reading the assigned readings for the week and doing the obligatory writing assignment/discussion post and this shit is just getting old. Also doesn’t help that I finished all my major-related courses about 2 or 3 semesters ago so now I’m just filling out my schedule with whatever 300+ level course I can get, which is a lot harder than it sounds.", "author": "DatBoiDanny", "created": 1602908010, "upvotes": 1}, "g92nc9m": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92nc9m/", "text": "Honestly I am worried I have entered the point of no return. Pre-class lectures are killing me", "author": "Panthera_leo22", "created": 1602907829, "upvotes": 2}, "g92ks9a": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92ks9a/", "text": "I haven’t been on top of things at ALL this semester. I’ve done none of the reading. How am I supposed to sit and read hundreds of pages on a laptop back to back? I can’t concentrate.", "author": "MarcelineMSU", "created": 1602905959, "upvotes": 1}, "g92i1oc": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92i1oc/", "text": "I had to drop a class because I fell so far behind", "author": "WildConsequence7", "created": 1602904002, "upvotes": 2}, "g92hw6o": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92hw6o/", "text": "Same here. My life has been going awol as of lately so that’s not helping anything. But on the plus side, my geography professor has basically cancelled class for next week to give us students a break. Gives me a little time to catch up.", "author": "HappySeaworthiness4", "created": 1602903894, "upvotes": 5}, "g92g44r": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92g44r/", "text": "You’re not alone! I dropped one of my classes cause this whole online format has got my stress and anxiety levels off the charts.  It’s triple the work than in person classes. Don’t give up! Take care of yourself and take deep breaths.", "author": "roman_cx", "created": 1602902644, "upvotes": 4}, "g92e3p8": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92e3p8/", "text": "Slipping, but not grades-wise. College has been ridiculously easy so far, but I have made legitimately zero friends. Classes are cool and all, but I’m paying an extra 15k in boarding for mediocre food and a shitty room. I guess I’m more angry than anything else. I worked my ass off for 4 years in high school for this bullshit? Fuck that, I want a fucking refund.", "author": "Xenonflares", "created": 1602901287, "upvotes": 4}, "g92c745": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92c745/", "text": "I’m a freshman and had the first assignment that completely fucked me over. Couldn’t make the office hours because I’m overseas and it was like 4 am when it was being held. I know my grades won’t be amazing this semester so I’m just doing my best to make sure I learn everything, even if it’s at a much slower pace. Godspeed my guy", "author": "teh_duranimal", "created": 1602900033, "upvotes": 2}, "g92by1n": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92by1n/", "text": "This happens to me almost every semester that I have had of school. But I’ve gotten a lot better at preventing it mostly by just really pushing myself and not giving up, by the end you’ll be happy that you did well in those classes despite the difficulties rather than regret that you didn’t finish them.", "author": "Marianoz2", "created": 1602899869, "upvotes": 2}, "g92bpcd": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92bpcd/", "text": "Get help now.", "author": "etwichell", "created": 1602899709, "upvotes": 1}, "g92awug": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92awug/", "text": "Yes :(", "author": "aminayiscool", "created": 1602899193, "upvotes": 2}, "g92a4n3": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g92a4n3/", "text": "starting about 2 weeks ago I just hit a wall. I went from top student with all A's to having zero motivation, missing class, and just not being capable of finishing assignments. I'm so depressed. This is my first semester of college and I'm forced to be at home for it. My home life is fucked. Abusive parents, all that. I'm so lonely. Shit, man.", "author": "GraceJR02", "created": 1602898680, "upvotes": 6}, "g927vgd": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g927vgd/", "text": "I’m usually pretty good at managing all my work and stress but this year and over the past couple weeks especially it’s been so hard to stay in the right mindset. It’s all getting to my head and I feel like I’m not only slipping in school but as a person too. It’s not as if I don’t do any work but I’ve fallen into the realm of playing catch up and I still can’t seem to find a groove that works... 😖", "author": "slouchingpotato", "created": 1602897208, "upvotes": 2}, "g927h1y": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g927h1y/", "text": "It's the longest month in the semester. I think most students feel the same way you do. I did. November is right around the corner & then you've got holidays & before you know it the semester is over. Try to stay focused! You got this!", "author": "Dezz2011", "created": 1602896947, "upvotes": 2}, "g927e80": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g927e80/", "text": "I lost all motivation. Im trying to ger back into it cause this is serious but its been so hard for me. Online schooling is horrible. I hate staying cooped up trying to learn material its just hard and i end up just leaving it for another day", "author": "Bbghaha", "created": 1602896896, "upvotes": 5}, "g927bkj": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g927bkj/", "text": "lol have you seen the posts on here? It’s the primary thing I see people talk about.", "author": "ZMAC698", "created": 1602896848, "upvotes": 3}, "g926gve": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g926gve/", "text": "Yep. Just had a quick sob session in the shower. My brain feels like it won’t let me think. I’ve begged my parents to let me go home and finish the semester there but they won’t let me. I think about dying all the time, so much that at least 50% of my day is spent thinking about how I’d rather be dead than being a failure. I have a therapist but all of the progress I had made has been destroyed since I’ve moved to college. Now everything is the worse it’s ever been. I physically feel sick every day. I feel like I can see everything around me declining, my grades included. My parents pushed me really hard so for my whole life I’ve based my worth off my grades. I’d gotten better but I just failed my first calc test so it’s like my brain has done a landslide.", "author": "labbaloo", "created": 1602896296, "upvotes": 3}, "g924g0n": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g924g0n/", "text": "Last semester I was SO motivated and I did so well as a result:( this semester I still need to do well but it’s harder to put in the necessary work. Even harder when one of my professors is being super difficult.", "author": "cinnamonmuse", "created": 1602895023, "upvotes": 4}, "g922ux1": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g922ux1/", "text": "I got an email about a deficient grade today. Im taking six online classes and somehow managed to miss EVERY discussion post for one class, even though I've aced the exams. I'm trying not to panic because there's half a semester left but man this online learning is bullshit", "author": "scusemewhat", "created": 1602894031, "upvotes": 2}, "g91zs2x": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91zs2x/", "text": "I’ve avalanched and realized my major isn’t for me. I’m taking 1-2 semesters off to think about my future.", "author": "Danile2401", "created": 1602892130, "upvotes": 5}, "g91xhyr": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91xhyr/", "text": "Doing well in all my classes except one class that’s “self-paced”. Haven’t done anything for it since august.", "author": "mexhanicfrog", "created": 1602890743, "upvotes": 2}, "g91xdcb": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91xdcb/", "text": "I am two weeks into my classes and I’m slipping", "author": "WongleDongle", "created": 1602890666, "upvotes": 4}, "g91w6hx": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91w6hx/", "text": "I wish I could say I am but to be honest I’ve been behind since the beginning of the semester", "author": "Sean737", "created": 1602889951, "upvotes": 5}, "g91vzqa": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91vzqa/", "text": "Yeah I've already been calculating which assignments I can miss and which classes I have to prioritize for most of this semester. But now I've moved to calculating my G.P.A and seeing how bad I'd have to do to loose my scholarship, so yup I've been going down hill lol. (Thankfully I still have a bit of wiggle room with that though.) I also have like 4 projects due on the 26th this month and I've been working like crazy to get caught up in my math class as I let myself slip. So that'll be fun.\n\n I've been a lot more stressed this semester too. It feels like I'm not doing enough work if I only get one or two assignments done a day. And taking days off feels especially guilty.", "author": null, "created": 1602889839, "upvotes": 4}, "g91ui7z": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91ui7z/", "text": "I’m the opposite. Started off really poorly at the beginning of the semester and I’m having a resurgence of sorts after meeting with my advisor", "author": "wagman43", "created": 1602888953, "upvotes": 3}, "g91tsbi": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91tsbi/", "text": "Lol yes, and I decided to go away with friends last weekend. today I successful submitted an assignment at 5:00pm when it was due @ 5:00pm it disappeared as I hit the submit button :)", "author": "Throwawayyy21323", "created": 1602888530, "upvotes": 5}, "g91smk4": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91smk4/", "text": "Yessss every year", "author": "victorianmood", "created": 1602887843, "upvotes": 2}, "g91s5mb": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91s5mb/", "text": "I think class material in general is easy in the beginning and you’re more motivated to do things and as time goes on it all slips away. However, online classes make that process speed up, at least for me it did. I can’t learn from lecture videos and I’m not motivated to do school when I’m home. Also teachers are dumping more on students for some reason. For example, I never had assignments due the same week as a test but this semester I’ve had the stress of studying for a test and getting assignments done all in one week. It’s not cool. \n\nWe all just gotta hang in there.", "author": "Emiwee98", "created": 1602887567, "upvotes": 5}, "g91s12x": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91s12x/", "text": "Absolutely I do. I’ve been trying really hard this semester to stay on top of everything, because it’s been extra difficult with everything online. I was doing OK in my classes, scoring well, getting A’s. But then with the last round of tests it was one failure after another. Overall my GPA is still OK, but I am failing so many things I’m just really concerned about passing this semester. My professors don’t even seem to want to help, half of them don’t even seem to want to teach anything. One in particular mostly just sits there and gives us busywork all lecture. He doesn’t teach anything, and when I try to ask him what sort of topics will be on the test he just tells me “it’s not my responsibility to tell you it’s on the test” And I’m like no, but it is your responsibility actually teach her stuff if you’re going to expect us to know it on a test. but yeah, I’m falling behind in a lot of courses, and I’m really worried about this semester and my future.", "author": "ShakaWTWF", "created": 1602887493, "upvotes": 3}, "g91rudd": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91rudd/", "text": "Absolutely man. I don't remember the last time I attended an online class, and getting work done feels like a Herculean task. I found a way to channel all the stress I'm feeling due to 2020 and turn it into productivity but some of it is definitely being Asian and the fear of not having good grades, but still you got this man just try to find some way to make the most out of whatever you're feeling and hey if you can't, it's understandable. This isn't what we're going into debt for and I think the profs will come to understand that come finals.", "author": "racistfire", "created": 1602887383, "upvotes": 4}, "g91rik4": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91rik4/", "text": "Happens to me each semester about halfway through.", "author": "omgitsabean", "created": 1602887190, "upvotes": 5}, "g91r8gw": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91r8gw/", "text": "I started off bad so idk if I would call it slipping", "author": "KING_COVID", "created": 1602887027, "upvotes": 15}, "g91r341": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91r341/", "text": "I’ve been behind since September tbh. Teachers have been giving twice the work load on most of my classes because of of Covid and there just isn’t enough hours in the fucking day to get through it all. Like I understand where the come from but they have overcompensated , because now I have four classes but it feels like 8 with all this hw.\n\nAnd let’s say I spend the day to focus on one class right? Then I’m behind in the other three. Then don’t get me started on these two hour lectures that are utterly impossible to sit through. This semester is definitely fucking with my grades considering I got all As before all this stuff happened. As well as my mental health from being cooped up in a room 24/7 trying to drill material into my head.", "author": "mmmmikki", "created": 1602886938, "upvotes": 36}, "g91qfkr": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91qfkr/", "text": "Weeks 1-6 had very little problems for me at all. I'm in Week 8 now and it's slowly starting to fall apart. I hate doing things last minute because I have to rush and it puts pressure on me and I feel tired doing it.", "author": "ClericalAnnexation", "created": 1602886556, "upvotes": 3}, "g91ptfu": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91ptfu/", "text": "Yes.", "author": "Cat_Panda_Canda", "created": 1602886194, "upvotes": 1}, "g91ohwv": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91ohwv/", "text": "yeeup", "author": "slate_er", "created": 1602885442, "upvotes": 1}, "g91nqzl": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91nqzl/", "text": "Yes. Then I started focusing on other classes instead of the math class I should be doing and now I missed like 5 quizz assignments and 5 hw assignments.", "author": "SmugFaces", "created": 1602885010, "upvotes": 6}, "g91lpdo": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91lpdo/", "text": "Sameeeee.", "author": "ApsSuck", "created": 1602883817, "upvotes": 2}, "g91klyq": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91klyq/", "text": "Current self written in a single Reddit post! \nI resonate with every word you wrote. \n\nFor me the biggest issue is getting out of the loop of half-assing/missing assignments, stressing about the fact that I half-assed/missed an assignment, and trying my best to ignore it while still stressing the fuck out about it on the inside. \n\nIt’s a daily struggle smh", "author": "amdreuu", "created": 1602883174, "upvotes": 10}, "g91jb48": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91jb48/", "text": "Sounds like we have the same spirit animal. I just realized I forgot how to cite, had to drop a class with a nightmare prof because of an extremely low essay mark to save my GPA, and realized it's too late to get into a new class. So, yeah, I'm there. I haven't had to drop a class for over a year, FFS.", "author": "AnothaCuppa", "created": 1602882402, "upvotes": 6}, "g91gf5w": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91gf5w/", "text": "Same here. I’m not necessarily behind but let’s just say that I wait until the day before a lab report is due to start working on it and start panicking and stress myself out to finish it within a day. And I stopped reading and doing the practice problems for one of my classes after the first couple of chapters.", "author": "BlkGirl181", "created": 1602881379, "upvotes": 22}, "g91gdmk": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91gdmk/", "text": "Same here. I’m not necessarily behind but let’s just say that I wait until the day before a lab report is due to start working on it and start panicking and stress myself out to finish it within a day. And I stopped reading and doing the practice problems for one of my classes after the first couple of chapters.", "author": "BlkGirl181", "created": 1602881366, "upvotes": 4}, "g91eo6p": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91eo6p/", "text": "I didn't do any work this week and I'm ashamed. I think my depression is getting to me and I'm low as fuck. Shit is going down in my family and I'm just... I don't care right now. Drowning.", "author": "Jujubini", "created": 1602880860, "upvotes": 123}, "g91dozo": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g91dozo/", "text": "Yep exactly this. Normally I'm on top of deadlines and I do pretty good in my classes. This semester started off okay, but I feel worn down and like I'm falling behind on everything. Very frustrating to feel like every step forward just ends up with my goal further out of reach.", "author": "evasivemacaroni", "created": 1602880347, "upvotes": 7}, "g916ooj": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g916ooj/", "text": "Yep. I thought I was on top of my shit until I forgot to take 2 small quizzes (meant to be easy and pretty much free points) two days ago. They were only worth 6 points total but now my grade has dropped 5% and I need 100% on the next 2 midterms to keep an A (and this is an intro level class...)", "author": "actariaa", "created": 1602876662, "upvotes": 27}, "g90wzol": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g90wzol/", "text": "Rip the fever get you. Even worse if you are at CMU", "author": "Ashamed-Sandwich8518", "created": 1602871709, "upvotes": 11}, "g90spa4": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g90spa4/", "text": "Yes, I believe I invented this process. The next stage is sacrificing one class for another. Then, some delusion sets in about doing 6 weeks worth of work in mid-Nov. Followed by a purist theory of just f-ck it and start over fresh. Which doesn't work because it all happens again. The trick I've found is to take the intense fear of noticing decline and turning it into productive urgency. Instead of freaking out and ignoring it.", "author": null, "created": 1602869558, "upvotes": 613}, "g90j3p3": {"link": "/r/college/comments/jcb2qb/is_anyone_else_slipping/g90j3p3/", "text": "[deleted]", "author": null, "created": 1602864768, "upvotes": 41}}}