{
  "sid": "q4rabp",
  "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/",
  "title:": "navigating a frustrating situation- complaint about prof?",
  "text": "is it valid to make a complaint about a prof while currently taking the course with them? obviously, i'm fearful of any repercussions, such as biased marking (which there's no way to prove because you can't go into the mind of someone to collect concrete evidence)currently taking a course with prof who is being adamant about not replying to emails, very difficult to get a hold of in terms of communication\n\nmentioned they would host office hour, so i went in person, but they never mentioned it would be virtual (all the previous times I met with them in person, so this was totally unexpected) , so I took the bus all the way to school and eagerly brought all my notes with me only to be met with no replies after me knocking on the door, I was waiting outside of the office and then realized that they were still hosting a zoom meeting but weren't in their office (previously they hosted zoom meeting in their building office and you could see them in person if you wanted to, so he would be able to communicate in person and virtually while being in their office building) so I entered the zoom meeting and asked the prof why they weren't at their office, apparently the prof said that that day's office hours would be virtual\n\nI asked if they received my emails , of which I have sent numerous, all have gone ignored\n\nI've also sent a  message to them (through another platform), no response\n\nthis isn't a one-off instance, on first day of class, i asked if i could book an office hour appt with them, they said yes nicely in person\n\nwhen I emailed them, they eventually told me they were too busy to book office hour appt with them\n\nit seems only they will send emails to me only when they want to, but I can't email them, or they selectively choose which emails to respond to, I really don't believe that they didn't read my email, I'm pretty confident they read my email but just deliberately brushed my emails off or ignored them\n\nprof just told me they weren't reading their emails\n\nthey only also uploaded the last 2 lecture recordings 2 days ago when the midterm is coming in 3 days from now,i don't believe they're accessibility-friendly either, because i'm sure there is at least one person in class registered with accessibility so they would be eligible for extra time, but there's a lecture right after the test , unlike another course where a professor would give a 10 minute buffer time to allow those registered with accessibility some time to travel from accomodated testing centre to class\n\nthey are probably a full professor so probably me complaining to the department head/chair wouldn't do anything, right? plus, they probably have a status of seniority, and people would respect them since they are a researcher who publishes papers\n\nplus, i think they will obviously know who complained and then probably hold a negative attitude towards me when evaluating me , right? there's also no way to prove that someone does hold a negative bias towards me after I complain",
  "author": "mammothelephant2",
  "created": 1633804928,
  "updated": 1634083128,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hg0l8oq": {
      "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg0l8oq/",
      "text": "You cant complain about accessibility issues of disability issues you don’t have - you have no idea what has has not been done for any students with accommodations and why.\n\nIf you cant get in touch with the professor check the syllabus first.\n\nIf it says no email, zoom appointments follow the instructions for that.  If there are not, and you get no response, you can complain to the chair that you have followed the instructions and you get not response.\n\nNobody is required to record lectures if they are live.  If you mean that this is the course content and it is uploaded late, you can also send that to the chair.\n\nYou will have to be more focused and clear in your email",
      "author": "PersephoneIsNotHome",
      "created": 1633807881,
      "upvotes": 5,
      "replies": {
        "hg18wqs": {
          "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg18wqs/",
          "text": "i'm registered with accessibility myself \n\nthe syllabus does not say \"no email\"",
          "author": "mammothelephant2",
          "created": 1633818457,
          "upvotes": 1,
          "replies": {
            "hg1c32d": {
              "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1c32d/",
              "text": "Then if you are personally not getting accommodations you are due than you may email about that.",
              "author": "PersephoneIsNotHome",
              "created": 1633819972,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hg0o9da": {
      "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg0o9da/",
      "text": "First, professors are under no obligation to read and respond to emails, hold office hours or record lectures (unless all instruction is remote), however they are subject to providing accommodations per the requirements of and in conjunction with the disability office.  Are your lectures all remote? Or are the recorded lectures just a bonus and the original lectures are in person? Of course it’s great when/if they do all those things. As far as recording lectures, it’s usually the responsibility of the student subject to any conditions of the professor and/or school. Often a contract is signed by the student regarding use, sharing, privacy and disposal. \n\nSecond, I think that complaining will get you very little because professors have wide latitude to conduct themselves and their courses as they choose. You’re probably not the first student to be frustrated with this professor’s attitude unfortunately. Is there a TA or a tutor that you could meet with regarding your questions?",
      "author": "Significant-Equal-12",
      "created": 1633809219,
      "upvotes": -1,
      "replies": {
        "hg1m8dr": {
          "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1m8dr/",
          "text": "This is completely untrue and can be easily disproven by checking the institution's code of conduct for faculty. Faulty are required to communicate with students, hold office hours, and provide accommodations.",
          "author": "hdorsettcase",
          "created": 1633824954,
          "upvotes": 3,
          "replies": {
            "hg1msug": {
              "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1msug/",
              "text": "Those requirements are set on a school by school basis, at least in the US.",
              "author": "Significant-Equal-12",
              "created": 1633825242,
              "upvotes": 1,
              "replies": {
                "hg1ntbz": {
                  "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1ntbz/",
                  "text": "Of course they are, except possibly in state systems. But there are common expectations. I've taught both public and private schools in the US and these have all been required.",
                  "author": "hdorsettcase",
                  "created": 1633825752,
                  "upvotes": 3,
                  "replies": {
                    "hg1o20n": {
                      "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1o20n/",
                      "text": "I’m not saying I agree with the professor’s behavior. I’m saying that short of it being a school, department or contractual obligation, there’s no legal requirement that he return emails or hold office hours.",
                      "author": "Significant-Equal-12",
                      "created": 1633825871,
                      "upvotes": -1,
                      "replies": {
                        "hg1oclb": {
                          "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1oclb/",
                          "text": "Of course there's no legal requirement. It's a job requirement not a legal matter.",
                          "author": "hdorsettcase",
                          "created": 1633826016,
                          "upvotes": 3,
                          "replies": {
                            "hg22mzy": {
                              "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg22mzy/",
                              "text": "Exactly, so if there’s no requirement regarding emails and office hours then the professor can do what he wants.  OP isn’t the first student to encounter this problem and it’s been discussed according to OP on ratemyprofessor. Practically speaking a tenured prof won’t be fired for not returning emails or holding office hours.",
                              "author": "Significant-Equal-12",
                              "created": 1633833173,
                              "upvotes": 0,
                              "replies": {
                                "hg25ftm": {
                                  "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg25ftm/",
                                  "text": "My point is these requirements are practically universal in academia.",
                                  "author": "hdorsettcase",
                                  "created": 1633834623,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hg230uv": {
                      "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg230uv/",
                      "text": "So there’s never a prof that ignores the requirements?",
                      "author": "Significant-Equal-12",
                      "created": 1633833368,
                      "upvotes": 0,
                      "replies": {
                        "hg259up": {
                          "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg259up/",
                          "text": "Refusing to do your job does not mean your job doesn't have standards.",
                          "author": "hdorsettcase",
                          "created": 1633834535,
                          "upvotes": 1,
                          "replies": {
                            "hg265ue": {
                              "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg265ue/",
                              "text": "Your experience has nothing to do with the OP’s problem. My point is that it’s unlikely that his prof will be required to change what he’s doing (or not doing), for a variety of possible reasons, including that he’s been doing it for a long time and his department allows it, for whatever reason.   That’s my opinion. You are free to voice a different one.\n\nOP is free to contact the department chair and discuss his concerns as well. However, there is a risk of the professor at least suspecting who is complaining about him. I say proceed at your own risk.",
                              "author": "Significant-Equal-12",
                              "created": 1633835016,
                              "upvotes": 0,
                              "replies": {
                                "hg27918": {
                                  "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg27918/",
                                  "text": "I am not addressing OP's problem. I'm addressing your flawed understanding of a professor's obligations. Your opinion is not free from criticism because it is an opinion.",
                                  "author": "hdorsettcase",
                                  "created": 1633835605,
                                  "upvotes": 1,
                                  "replies": {
                                    "hg2j2cw": {
                                      "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg2j2cw/",
                                      "text": "Criticize away!  My professors have run the gamut from great to completely sucks as far as responding to emails and holding office hours.  While I appreciate that emails and office hours may be  “required” or “encouraged” reality doesn’t always match up.",
                                      "author": "Significant-Equal-12",
                                      "created": 1633842180,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "hg2gok6": {
                                  "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg2gok6/",
                                  "text": "He wasnt talking about OP he was talking about you lmfao",
                                  "author": "Divinebookersreader",
                                  "created": 1633840672,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hg1q68k": {
          "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1q68k/",
          "text": "Professors are often absolutely held to offer office hours - that’s generally a requirement from the university. It’s a widely accepted and expected part of the job. And if a student needs accommodations, they certainly can be required to record their lectures.\n\nNot communicating with students is a little more subjective, but it’s something the Chair would be interested in hearing about if it’s impacting success rates.",
          "author": "Notfunnnaaay",
          "created": 1633826927,
          "upvotes": 1,
          "replies": {}
        },
        "hg192vc": {
          "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg192vc/",
          "text": "how come they're not obligated to respond to emails if you're a student in their course?",
          "author": "mammothelephant2",
          "created": 1633818538,
          "upvotes": 1,
          "replies": {
            "hg1b8gi": {
              "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1b8gi/",
              "text": "Quick question : is your professor older?  \n\nAs a general rule no one is required to reply to an email. We do it because it’s the courteous, polite thing to do. Your professor doesn’t sound like a polite, courteous person. He may feel that his job is to teach his class, do research (if he does that) and that’s it.  No extras. Even though the majority of professors do. \n\nThat being said you could arrange a meeting with the department head/chair to find out whether holding office hours, answering emails and such is generally encouraged within the department without naming names. If your prof is tenured he may feel pretty free to do what he likes without repercussions. Do your classmates feel the way you do about how he’s conducting himself?",
              "author": "Significant-Equal-12",
              "created": 1633819563,
              "upvotes": 0,
              "replies": {
                "hg1brt4": {
                  "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1brt4/",
                  "text": "how did you know? yes, prof is quite old, in 60s-70s (praying to god that ur not his colleague or my prof undercover)\n\ni can't speak for my classmates, but ratemyprofs does have people saying that he's very irresponsible and rarely replies to emails\n\ntenured- that's just straight up dogshit no repercussions\n\nare you in North America? I've always heard otherwise about obligation to respond to emails",
                  "author": "mammothelephant2",
                  "created": 1633819821,
                  "upvotes": 1,
                  "replies": {
                    "hg1cqjr": {
                      "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1cqjr/",
                      "text": "Yes I’m in the US and I’m not your prof.  The reason I asked is because back in the dark ages (when this guy started teaching) students didn’t email professors because there wasn’t any email. This guy sounds like he’s never moved into the new technology age, and prefers it that way. Did he give any preferred method of contacting him on the syllabus?\n\nThe obligation question comes down to is it part of his contract or the rules of tenure at your uni. And even if it is, is anyone enforcing them? It definitely could be different rules in Canada.",
                      "author": "Significant-Equal-12",
                      "created": 1633820291,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hg1b3n9": {
          "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg1b3n9/",
          "text": "what country are you in? in Canada, I'm pretty sure professors should be responding students' course-relevant emails",
          "author": "mammothelephant2",
          "created": 1633819500,
          "upvotes": 1,
          "replies": {
            "hg26p6a": {
              "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg26p6a/",
              "text": "As far as your accommodation I don’t know what Canadian laws require. Generally, in the US students have to register with their uni’s disability office and then the student discusses their requested accommodations with each professor.  If there’s an issue the disability office gets involved.",
              "author": "Significant-Equal-12",
              "created": 1633835308,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hg29mzq": {
      "link": "/r/college/comments/q4rabp/navigating_a_frustrating_situation_complaint/hg29mzq/",
      "text": "It is difficult to address a lot of your scheduling and E-mail concerns without more specific information. A lot of it sounds like miscommunication and a busy professor, which are not infractions and best worked out between you and your professor. It is common not to respond to unapproved communication methods, this is professional not being rude. If the professor has clearly stated they are not reading E-mails this is worth reporting.\n\nYour concerns about consequences from reporting is called retribution. This is not allowed. If you choose to report you should state you are concerned about retribution and use that word specifically. \n\nFrom what information you've given it seems more likely there's been miscommunication with you professor and the situation would be best resolved by talking to them about your concerns.",
      "author": "hdorsettcase",
      "created": 1633836840,
      "upvotes": 1,
      "replies": {}
    }
  }
}