{"sid": "pqqz7h", "link": "/r/college/comments/pqqz7h/canvas_download_all_files_from_course/", "title:": "Canvas download all files from course", "text": "I discovered recently that it is possible to bulk download all the files from any canvas course, even the ones that haven't been made available to students yet. I wasn't actually trying to do anything that could possibly be regarded as bad, I was just incredibly annoyed that I had to download all the files individually, print them to PDF, and then load them into Notability individually. So, when I saw that the files were ordered numerically, I got very excited. A touch of excel, a dash of notepad, and a generous pinch of batch link opener browser plugin allows one to bulk download all the files automatically.   \nNote that the firefox download settings will have to be set to automatically download all the file types you want to download. For chrome, ensure that \"Ask where to save each file before downloading\" is disabled. \n\n***Instructions:***\n\n1. Get the download link for a file from canvas. It should look like this: https://<CollegeName>.instructure.com/courses/<CourseID>/files/<FileNumber>/download?download\\_frd=1\n2. Create list of around 500 links using excel  (or google sheets, if that's your thing)\n   1. Paste link into excel/google Sheets\n   2. Split link into 3 pieces, such that everything preceding the <FileNumber> is in a column to the left of the fileNumber, the fileNumber is by itself in the middle column, and everything to the right of <FileNumber> is in a column to the right of the fileNumber column.\n   3. make the cell directly below fileNumber the numeric value of <FileNumber> +1\n      1. If FileNumber was 123456, the cell below filenumber would be 123457\n      2. if you wanted the files preceding the one that you have the link to, you could change the filenumber below the original to one less than the original filenumber\n   4. copy the right and left bits of the link to the cells below them\n   5. Select the block of 6 cells, then extend the range downwards for however many files you want to download\n   6. Select all the cells with stuff in them\n3. Re-Assemble links\n   1. Paste all the links from the spreadsheet into notepad\n   2. Copy one of the tab characters that will be found surrounding the filenumber.\n   3. open the find/replace menu\n   4. Paste the tab character you copied into the \"Find What\" box\n   5. ensure that there is nothing inside the \"Replace With\" box\n   6. Click \"replace all\"\n4. Open all the links\n   1. Install a \"Bulk Link Opener\" or \"Bulk URL Opener Extension\" plugin for your browser\n   2. Copy everything from notepad and paste into the bulk link opener\n   3. use the plugin to open all the links\n5. Wait. Unless you have a very powerful computer, it will take a while to download all the links. Your browser WILL slow down. That's just what happens when you open and load hundreds of tabs at once. However, assuming that the internet connection is good, it shouldn't take too long to download all the files. When you see that no more files are being downloaded, feel free to force-close the browser.\n\n***Notes:***\n\nThere will be some tabs that will say something along the lines of \"File not found\". That is normal, I believe that those are just files that existed for the course at one point, but are no longer there.\n\nI'm planning on writing a program to automate all the steps 2 through 4 if there's any interest in that, and if I do write the program, I'll post the github link as an edit to this post.  I'm absolute crap at UI design, but there will be a gui. It'll be hideous, but it'll be there.\n\nAlthough some might see this as skirting rule 5, I firmly believe that this is not cheating or in any way violating rules. The only files that are accessible are ones that the teacher wishes students to be able to access. However, files are accessible that would normally only be made accessible in the future.", "author": "PhlegethonAcheron", "created": 1631987125, "retrieved": 1632801494, "over_18": false, "upvotes": 12, "upvote_ratio": 0.87, "comments": {}}