{"sid": "psn6af", "link": "/r/college/comments/psn6af/failed_a_pop_quiz_this_morning_and_its_really/", "title:": "Failed a pop quiz this morning and it’s really messing with me", "text": "Got a 50 on a pop quiz this morning and I’m really upset about it, it’s really messing with me", "author": "Phenomonal-One_01", "created": 1632244182, "retrieved": 1632946601, "over_18": false, "upvotes": 9, "upvote_ratio": 0.91, "comments": {"hdsdk4n": {"link": "/r/college/comments/psn6af/failed_a_pop_quiz_this_morning_and_its_really/hdsdk4n/", "text": "let your anger consume you", "author": "censqred", "created": 1632271409, "upvotes": 1}, "hdr6y8g": {"link": "/r/college/comments/psn6af/failed_a_pop_quiz_this_morning_and_its_really/hdr6y8g/", "text": "I have always hated pop quizzes, but I will admit that they do seem to help me remember the right answers for when the actual test rolls around. Look at it as a goal you have to accomplish rather than a failure. If those questions are asked on your test and you know them by then, you have the opportunity to show that you’ve learned something and we’re able to improve.", "author": "WickedPuffin", "created": 1632252403, "upvotes": 1}, "hdr3wk6": {"link": "/r/college/comments/psn6af/failed_a_pop_quiz_this_morning_and_its_really/hdr3wk6/", "text": "I’m a math major and I once got a failing grade for a Diffy Q midterm. Felt like crap but I ended up bouncing back and passing.\n\n\n\nOne 50% on a pop quiz means nothing in the grand scheme of things", "author": "HundredPanda", "created": 1632251155, "upvotes": 1}, "hdqvbsl": {"link": "/r/college/comments/psn6af/failed_a_pop_quiz_this_morning_and_its_really/hdqvbsl/", "text": "Pop quizzes suck, I don't think they're fair or reflective of your capabilities. It's a brief moment of time where you weren't prepared, but isn't indicative of your potential. Pop quizzes also don't allow for people who are slower on the uptake to spend time consolidating their knowledge. \n\nThe strategy I use, because I struggled with pop quizzes: Get ahead on readings, work practice problems immediately after class, and do a morning slides review (while you drink your coffee or eat your bagel or something). I wish more fellow students would look at Ebbinghaus and his forgetting curve! You lose a significant fraction of your knowledge within just hours of consuming new information, so it's very very important that you review content daily and as soon as you can after class, so it's less likely to fall out of your head. If you're interested in this topic, look into spaced repetition.\n\nBest of luck, this will pass. Again, this is not indicative of your ability, you were caught off-guard. Kill it on the exam and use your pop quiz as a diagnostic tool for your weaker areas.", "author": "ItsReallyVega", "created": 1632247604, "upvotes": 2}, "hdqs69e": {"link": "/r/college/comments/psn6af/failed_a_pop_quiz_this_morning_and_its_really/hdqs69e/", "text": "It’s just one quiz. Now you know what you need to focus on studying for the exam.", "author": "thot_bryan", "created": 1632246296, "upvotes": 5}, "hdqol47": {"link": "/r/college/comments/psn6af/failed_a_pop_quiz_this_morning_and_its_really/hdqol47/", "text": "No worries! I failed a midterm with a 32 once. I still passed the class. Don’t beat yourself up just do better next time!", "author": "skippy5433", "created": 1632244811, "upvotes": 5}}}