{"sid": "b1sq05", "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/", "title:": "Someone in my College made a petition to suspend everyone who has been accused of sexual misconduct", "text": "A girl in our second year accused someone, but the legal system will take 6 months. So she started this petition, with the goal of getting everyone accused suspended until a verdict is reached. It seems mainly geared towards this one guy, but the title and text still call for all suspects to be suspended.\n\n\nIn the groupchat of my year people are angry, calling for suspension even though no proof has been shown yet. People seem to have done away with the principle of 'innocent until proven guilty'. I want to support victims, but this just seems crazy!\n\n\nOn top of that, one of my best friends had also been falsely accused by a different girl (weeks before). He is having a breakdown, his depression making a swift comeback because of the accusation. I truly believe he is innocent, they hooked up multiple times, she was sober and they even showered together. But she had a boyfriend, as he found out later, so possibly she didn't want to own up to it. He has moved out of our building already on request on the uni, but still studies with us.\n\n\nWhat can I do to ensure people aren't getting suspended based on accusations alone? Is a petition like this even legal? I am personally rather upset by the amount of ire this has elicited. When I defended maybe not punishing someone without evidence I got some angry comments thrown my way.\n\n___\n\n\nEDIT: I want to put this into perspective, there is no physical protests or anything going on, just discussions in the groupchat. However, the petition now has 681 signatures. I assume most of them are just out of solidarity, but the title of the petition is ''MY UNIVERSITY to Suspend Suspects of Sexual Crimes from Education'' so it isn't exactly covert in its intentions. It is only a petition, but still.\n\n\nThere are people speaking out against this luckily, so it isn't as bad as it could be.", "author": null, "created": 1552744776, "retrieved": 1632802543, "over_18": false, "upvotes": 857, "upvote_ratio": 0.95, "comments": {"eiqusxe": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiqusxe/", "text": "welcome to feminism!", "author": "dontbeabitchok", "created": 1552845893, "upvotes": 0}, "eiqe08b": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiqe08b/", "text": "Accuse the woman that made the petition of sexual misconduct.\n\nProblem solved.\n\n&#x200B;", "author": null, "created": 1552833471, "upvotes": 1}, "eiq9ogy": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiq9ogy/", "text": "object to it in your chat group. tell peoğle its wrong to suspend people for just being accused.", "author": "14b755fe39", "created": 1552829727, "upvotes": 2}, "eipzoha": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipzoha/", "text": "Find a way to get that shit shut down or else half of the college will be empty because everyone will accuse each other left and right.", "author": "Ironwarrior29", "created": 1552816376, "upvotes": 1}, "eipqlqr": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipqlqr/", "text": "Technically it isn't illegal, as a university isn't a court of law and since a university is mostly a business, they are within their rights to throw you out even if you aren't guilty of anything and there isn't much you can do about it. That being said, it isn't like it's the end of the world, if you're suspended or expelled you can simply transfer to a different college, and while you won't be able to hang out with your friends other than that it won't effect you. \n\nIt won't effect your job opportunities as employers are looking for work experience. In the workplace it is all about your experience in the workforce, a university graduate is worthless as while a degree will tell them you know the information, you don't have any experience applying it and using it in a workplace setting, so as far as they know they will have to teach you from the ground up. As worthless as a degree is, obviously your grades, what school you went to, and any trouble you managed to get in really doesn't matter. Since you're fresh out of college, you're pretty much worthless and a student who went Harvard and got straight A's is the same in their eyes as someone who went to podunk college and got C's.", "author": "ChaosOpen", "created": 1552802089, "upvotes": 2}, "eipiv8h": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipiv8h/", "text": "Seriously messed up. It’s like burning people at the steak for being a witch. So messed up. Prove what is accused first. Accusations can ruin lives.\n\n& frankly, ya can blatantly suspend males for being accused, the same moment women are a suspended for sexual misconduct/assault, etc. If ya wanted to be a one sided society, despite past generations history of actions, this is the way to do it. The pendulum swings to the other side of the spectrum.", "author": "Bullen-Noxen", "created": 1552793646, "upvotes": 1}, "eipi3ei": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipi3ei/", "text": "You just need video content from the girl sent to the cloud every time you have sex. That is all that there is to this.\n\n&#x200B;\n\nNo video record = no consent = no sex.", "author": "Nude-eh", "created": 1552792895, "upvotes": 1}, "eiphy1v": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiphy1v/", "text": "Recently, a student organization at my school started a list where anyone could add a name of a sexual predator, and then those people would be unable to attend certain events, parties etc. (as in, students enforcing the list would literally stop a person from entering the event). It's such a scary precedent to set. Democracy without legal processes behind it is terrifying--it feels as though mob rule is taking over my campus.\n\nA kid I know was added to the list--no one knows why or who added him, he's in a happy relationship, doesn't drink or attend parties, but now all of a sudden people tell me to stay away from him because he's a perpetrator. It's absolute slander--who the fuck are we as a student body to judge a persons entire existence based upon one anonymous student report to a student organization?!", "author": null, "created": 1552792751, "upvotes": 8}, "eip9p9j": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip9p9j/", "text": "Start accusing the signatories.", "author": "booyah2", "created": 1552785397, "upvotes": 1}, "eip60f0": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip60f0/", "text": "Petitions only call attention to something, they don't actually mean that something gets implemented. I don't believe the petition will have any real affect, but the voice of the people can be very powerful. \n\n&#x200B;\n\nIf I were you, I'd write an email to a higher up and explain what's going on and why you think that may be a bad idea. If you're really concerned try to find other's with similar opinions and contact those higher ups.", "author": "RaNDoM123SaLAd", "created": 1552782415, "upvotes": 2}, "eip5bat": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip5bat/", "text": "Let the petition go through. Have a bunch of men accuse women. Watch them get suspended. Have some tea.", "author": "hakoonamatata9", "created": 1552781851, "upvotes": 1}, "eip0pye": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip0pye/", "text": "Guys. Don't have sex in college unless with your girlfriend. \n\nSo many crazies out there looking for attention and to ruin lives. \n\n", "author": "JumpyPorcupine", "created": 1552778360, "upvotes": 0}, "eioxqeb": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioxqeb/", "text": "At some point, people are going to have to ask how many of these accusations were just women covering up their cheating or shame. ", "author": "ThrowawayGhostGuy1", "created": 1552775939, "upvotes": 1}, "eiot73s": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiot73s/", "text": "Get her name and anonymously accuse her of sexual misconduct.\n\n", "author": null, "created": 1552772250, "upvotes": 0}, "eiormpy": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiormpy/", "text": "This girl needs to understand that people are innocent until proven guilty... emphasis on the *proven.* Just because she says something happened does not make it true.\n\nSadly though, it seems like people take the girls side in these situations (whether she was the assaulter or the one being assaulted or neither and just made it all up).\n\nIf I was your friend I would try to have a private conversation with the girl and get to the bottom of it. Honestly, saying sorry and being super sincere may diffuse the situation (if your friend is actually innocent). Often these kinds of people just want to know that they are heard and that you are sorry. Have a rational talk, do not accuse her of anything, but try to see her point of view so it can be refuted.\n\nThat being said, I also think you and your friend need to talk. The truth is, as someone else mentioned, false accusations are pretty rare ( or at least based on some form of truth). Do not go to bat for your friend just because \"he's a really great guy and said he did not do it.\" This could put you in a bad place as well. So I would keep my distance from the situation, if I were you. ", "author": null, "created": 1552771060, "upvotes": 1}, "eiorcyk": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiorcyk/", "text": "If that were to happen, people could just accuse the smartest students in class of sexual misconduct to lower the curve... I mean coupled with the fact that it would just be wrong in general, this could have horrible consequences.", "author": "real-live-adult", "created": 1552770848, "upvotes": 10}, "eiopbr0": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiopbr0/", "text": "She’s calling for suspension not expulsion. I think her call to action is fair. If no one didn’t do anything, they don’t have anything to worry about right? \n\nIf she’s making false accusations, have peace in knowing her time will come. People who make false police reports usually serve time in prison and get a record.\n\nBut as a sexual assault victim of assault and rape, I can empathize with her on making sure her voice is heard and her perpetrators are held accountable. Don’t mix with the wrong crowd next time if you don’t want to be involved in a mess. ", "author": null, "created": 1552769301, "upvotes": 5}, "eioomoi": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioomoi/", "text": "I would only agree if the accuser was suspended as well.", "author": "Litheism", "created": 1552768737, "upvotes": 0}, "eiooa70": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiooa70/", "text": "\"Accused\" not \"convicted \" \n\nThis is how far the MeToo movement has gone to.", "author": "Anonymously_Aroused", "created": 1552768451, "upvotes": -1}, "eionlo5": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eionlo5/", "text": "That's a stupid petition. It just boasts the idea that we should presume guilt without evidence. The justice system tells us an accused individual is \"Innocent until proven guilty\", not \"Guilty until proven innocent.\". ", "author": "samicmalik", "created": 1552767877, "upvotes": 1}, "eionhwa": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eionhwa/", "text": "Get your hands on the petition, make copies and circulate it to employment agencies with a warning:\n\n\"Hiring any of these individuals may result in financial hardship and legal expenses for your organization.\"\n\nAlso, avoid everyone on that list unless you enjoy pain.\n", "author": "mgtow-zen", "created": 1552767790, "upvotes": 5}, "eiola6o": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiola6o/", "text": "I hearby accuse everyone in your college of groping me.", "author": "Men-Are-Human", "created": 1552765992, "upvotes": 13}, "eiokyl2": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiokyl2/", "text": "Accuse everyone you walk past/dislike of sexual misconduct, then according to their own rules they have to be suspended until a verdict is reached, which could take months or years, so if you make sure everyone directly involved gets accused and suspended, they’ll likely call it off because “I wasn’t talking about *me* I was talking about everyone else?”", "author": "microgroweryfan", "created": 1552765731, "upvotes": 3}, "eiokvun": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiokvun/", "text": "This is obviously not going to happen, it would be a huge overreaction. I reccomend staying out of it so you don't end up in trouble or connected in any way. But if you would like to take a stand against it, I would suggest finding out if it isn't possible to be involved in the conversation if a conversation about this ever happens. \n\nAs for your friend. I'm going to be downvoted to hell for this, but false accusations are not very common despite the nonsense and cherry-picked studies you read on reddit. I can talk about this forever if you like, but that isn't the point of what I am trying to say. \n\nStatistically it is more likely your friend might actually be guilty. I don't think you're a bad judge of character, and I don't actually think your friend is guilty. I don't know what happened and I wasn't there. But the reason rapists so often go free is because the people around them absolutely refuse to even consider the possibility that a person they know did something wrong. I want you to take a long look at the situation with unbiased eyes and maybe even ask other unbiased people for their opinions on the details of what your friend says happend vs what the accuser says happened. \n\nThe reason I say this is because if your friend is guilty, you going to the college to speak on his behalf will look very bad. You have an understandable worry here with petetions to suspend people, but if you use your friend as a motivation for this it would absolutely backfire. Either don't mention him if you choose to be involved, and make sure people won't find out about it, or decide for yourself whether or not you can trust what he's told you and go from there.  ", "author": "bubblegumpandabear", "created": 1552765670, "upvotes": 7}, "eioigau": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioigau/", "text": "God damn SJWs and the fucking liberals. ", "author": "WhitE-TightE", "created": 1552763796, "upvotes": -4}, "eiohtzt": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiohtzt/", "text": "we want more men to college.University needs fresh meat for cannon fodder.", "author": "user_miki", "created": 1552763334, "upvotes": -2}, "eiof98u": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiof98u/", "text": "This really begs the question: who makes it to college never having read To Kill a Mockingbird?", "author": "f33dmewifi", "created": 1552761409, "upvotes": 36}, "eiof63p": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiof63p/", "text": "Guilty until proven innocent ", "author": "jdent77", "created": 1552761344, "upvotes": 1}, "eiof0qf": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiof0qf/", "text": "For a young man, going to University is like walking into a mine field. The advantage is that the mines are literally every person there that has a vagina so they're easy to identify. But, you still need to be careful where you step. \n\nWhile you're there, avoid contact with any female that falls outside of the classroom and study groups. Keep everything professional. The women in your class will attempt to character assassinate once they realize that you're not giving them power over you by attempting to date or have consensual sex with them. They'll likely label you an incel or homosexual. That's ok. \n\nThat's fine. Wear it like a badge of honor. Do your partying off campus at unaffiliated residences/bars/whatever.\n\nIf you want to date/have sex find yourself a woman that is 15 - 20 years your senior. Date her while you're going to college. She'll eagerly satisfy all of your carnal needs on demand. She'll pay for most of your dates. She'll also act as a mentor to you and generally have your best interests at heart. Dating a significantly older woman is a completely different dynamic than dating one of your contemporaries. She wants you for sex. She knows you want her for sex. There's little worry about the \"future\" because her life is likely already established and she's using you for physical satisfaction as much as you are her. Each encounter is purely for the enjoyment of the moment. Neither person has the expectation of making a life long partner out of the other so that dynamic is not there there way it is with your contemporaries. ", "author": "U21U6IDN", "created": 1552761235, "upvotes": -9}, "eiocht9": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiocht9/", "text": "> accused\n\n\ntell her that accused != proven guilty?", "author": "balne", "created": 1552759371, "upvotes": 3}, "eio9bos": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio9bos/", "text": "Maybe make a counter petition. Instead of waiting on the legal system, many schools will have their own hearing by a board to determine if the claim has any merit. It's a lesser standard in most places than the \"proof beyond a reasonable doubt\" criminal standard because being suspended from school for a time is a lesser punishment than going to jail and being put on a sex offender list for the rest of their life.\n\nSchools do have the right to protect their students and don't have to follow most due process rights. (Right to a hearing and notice of the accusations)\n\n", "author": "InTooDeepButICanSwim", "created": 1552756956, "upvotes": 1}, "eio8v4v": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio8v4v/", "text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/mensrights] [I’m a male college student right now and this kind of stuff is so scary.](https://www.reddit.com/r/MensRights/comments/b1uqxn/im_a_male_college_student_right_now_and_this_kind/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "author": "TotesMessenger", "created": 1552756600, "upvotes": 0}, "eio8hqu": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio8hqu/", "text": "They really should watch the documentary called Fantastic Lies. Honestly, in the US some universities do have a policy where being accused of rape can get you expelled, which is stupid considering the fact that not all accusations are true. I don't get why somebody would falsely accuse somebody. I guess it would come from a deep hatred, but I really just can't believe somebody could be so sadistic to ruin somebody's life like that. I mean even when the accusations are proven to be false, the person's reputation remains the same, and their life remains ruined. It just isn't right. Honestly, if you're going to falsely accuse somebody of committing such a heinous act against you, you clearly have no humanity. Whether it's online, to the police, or the media, you're one fucked up individual and there's a very special place in Hell for you. You are ruining lives, and taking credibility away from the true victims, who the majority of the time are already too scared to report rape as it is. So good job, I hope you're happy with the type of person you are.", "author": "gonzaliz", "created": 1552756309, "upvotes": 7}, "eio5utg": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio5utg/", "text": "[deleted]", "author": null, "created": 1552754370, "upvotes": 17}, "eio5oso": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio5oso/", "text": "Does anyone not remember mattress girl...? It's like nobody believes false accusations happen.", "author": null, "created": 1552754250, "upvotes": 30}, "eio3kj8": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio3kj8/", "text": "Accuse her", "author": "f33dmewifi", "created": 1552752714, "upvotes": -1}, "eio2phk": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio2phk/", "text": "this is absolutely ridiculous. I understand her frustration but if it is implemented it could ruin many people’s lives. ", "author": "bleedingacrobat", "created": 1552752085, "upvotes": 13}, "eio2h3d": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio2h3d/", "text": "This is the main issue that has plagued campuses around the country.\n\nA minority of college students feel emboldened by social media and political revolutions to engage on subjects that harm the basis of life, liberty, and overall democratic society. \n\nInnocent till proven guilty.\n\nWhy should someone lose 6 months of their life and education for a false accusation. By the end of that ordeal, the falsely-accused would be the real victim in pursuit of actual justice, an ordeal that will come with continuous emotional strains. \n\nI do not know the specificities of her case, but even though a petition in general is legal, her actions can be construed as intimidation and should refrain from attempting to publicize/defame the accused. If he is found not guilty, he rightfully has the option of suing for defamation.", "author": "Vestibuleskittle", "created": 1552751916, "upvotes": 39}, "eio1ftl": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio1ftl/", "text": "Are you in the US?  If so, look at your college's Title IX policy & procedures.  They are federally mandated and have very specific requirements for the rights of the accused as well as those of the accuser.  Also your college will have a Title IX coordinator whom you can talk to about your specific questions.", "author": "CursorTN", "created": 1552751161, "upvotes": 73}, "eio1c3v": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio1c3v/", "text": "Maybe I'm wrong, my wife tell me I am often, but a petitions purpose is only to ensure an issue gets heard my the administration, it doesn't automatically make things \"written in stone\" policy.\n\n\nI think that's an important distinction when moving forward with this. Make sure you keep your eye on it and make an effort to maybe address it with someone who might matter in these types of issues. ", "author": "HisMajestytheSquid", "created": 1552751082, "upvotes": 381}, "eio0v3o": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio0v3o/", "text": "Geez whatever happened to innocent until proven guilty ? Hmmm. ", "author": "FluffyCorgis", "created": 1552750729, "upvotes": 27}, "eio0i6y": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio0i6y/", "text": "Petitions like this are definitely legal. However talk to the department about this growing issue. As another comment said crosspost on r/LegalAdvice. ", "author": "JTJWarrior_3", "created": 1552750451, "upvotes": 118}, "eio06c9": {"link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio06c9/", "text": "Honestly this might get you better advice under r/legaladvice", "author": "Brownie_McBrown_Face", "created": 1552750206, "upvotes": 46}}}