{
  "sid": "edqzxs",
  "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/",
  "title:": "I feel bad with myself when I'm not studying or working",
  "text": "I'm not from USA so finals in my country are in like 3 weeks, but in 2 weeks i should present my last practices for this semester. I always feel bad with myself when not studying or working on those practices. Does anyone know some tips or something to not feel like that.",
  "author": "Expensive_Alfalfa",
  "created": 1576941298,
  "over_18": false,
  "upvotes": 617,
  "upvote_ratio": 0.99,
  "comments": {
    "fbq47wp": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbq47wp/",
      "text": "Set out days in which you concentrate your work— get a lot of things done in one or 2-3 days depending on your workload. Then give yourself one day off, completely separated from anything college-related. Then repeat. I find it easier to relax when I know I’ve gotten quite a bit of things done.",
      "author": "ezgggi",
      "created": 1577028106,
      "upvotes": 2,
      "replies": {}
    },
    "fbpch6i": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbpch6i/",
      "text": "That's totally anxiety. We're still not in 2020 but your brain is already in the middle of 2030.\n\nWhat do you feel is the cause of this feeling of ''waste of time'? Maybe you do have something in your backlog, or maybe it could be guilt from not giving the effort you wanted during classes. It could be many \nother things that you worry about, these things are from the future (Closer and/or far future), dude, the problem probably is that you are having  trouble living the moment, either because you want something right now, have a pending task, are afraid of something that will happen, you could be feeling guilty over things you didn't do at school or something and now you want to compensate (even if not useful anymore),  or you're worrying over things out of your control, this is usually the case among people I often talk and have anxiety issues. The causes for this are endless, so you'll have to do everything you can to successfully determine what is causing you to worry or care so much about the future.\n\nI too suffer from high anxiety, I understand this exact problem fairly well, I struggle with it every time I'm in winter or summer vacation from school.\n\nTL,DR: This may sound like \"you need to be the earth, be the sea, be your mind, bla bla bla\" But basically yep, be one with your body and try to notice what triggers your anxiety, it's a good start to know what could be triggering it, or if it's chronic. In simple words, you're fighting in tbe future causing you to not enjoy the present. if you notice that the something troubling you is something that you can solve or mitigate in The present: do it, stop procrastinating if it turns out to be a pending task; if not, you need to learn accept things out of your reach.",
      "author": null,
      "created": 1577019732,
      "upvotes": 3,
      "replies": {}
    },
    "fbmvdvj": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbmvdvj/",
      "text": "Same",
      "author": "twoplus2isfive4thpwr",
      "created": 1576989331,
      "upvotes": 2,
      "replies": {}
    },
    "fblx73m": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fblx73m/",
      "text": "You can De-escalate those feelings.  Something you believe or have experience within you is telling you to have this feeling.  You can quiet that.  Anyway that's what I do with feelings that I don't want.  Diy technique.  I do follow along videos for my massage clients...helps them to destress\nhttps://youtu.be/azfJEppbGoo",
      "author": "Reneeot49",
      "created": 1576972637,
      "upvotes": 1,
      "replies": {}
    },
    "fblwjej": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fblwjej/",
      "text": "I wholly empathize with you here. I feel like I always have to fill my time with being productive. Volunteering is an effective way for me to address that feeling and I enjoy doing it. I'm not sure what you enjoy, but consider finding something productive yet relaxing that you like. Trying out a new recipe to share with others, starting (and finishing) a 1,000 piece jigsaw puzzle, tutoring a student, etc. Take some time to find out whatever that thing is, and once you do find it try and stick with it.",
      "author": "handy_dandy_andy",
      "created": 1576972142,
      "upvotes": 3,
      "replies": {}
    },
    "fblt6c9": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fblt6c9/",
      "text": "lol, y’all crazy. I do my school work, and all the rest of free time is for video games or anime.",
      "author": "ChuErDHM",
      "created": 1576969626,
      "upvotes": 1,
      "replies": {}
    },
    "fblrhj8": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fblrhj8/",
      "text": "I struggle too. I work 3 jobs plus marching and pep band so I constantly have something to do. Usually I always make sure I have scheduled cleaning time for my apartment and scheduled relaxation/video game time. It helps with unwinding",
      "author": "cactus-crusher",
      "created": 1576968389,
      "upvotes": 1,
      "replies": {}
    },
    "fbloss0": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbloss0/",
      "text": "Try finding educational videos to watch in your freetime, or try working on a hobby that relates to your field of study. That way in your downtime you will still feel productive.",
      "author": "gracefulspork",
      "created": 1576966438,
      "upvotes": 0,
      "replies": {}
    },
    "fblczs0": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fblczs0/",
      "text": "I feel the same way often during breaks so I start doing things that are productive or improving myself. For example you can volunteer, clean your living space, try to learn something, workout, or try to improve your abilities (talents, arts, etc).",
      "author": "lookingformemes007",
      "created": 1576961266,
      "upvotes": 5,
      "replies": {
        "fblf5c8": {
          "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fblf5c8/",
          "text": "I go to the gym as an extra activity through the week, but i feel this way normally the free days when i don't have class, like in weekends.",
          "author": "Expensive_Alfalfa",
          "created": 1576962061,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fbl805e": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbl805e/",
      "text": "i just don't. it may feel kinda stupid but honestly, i would just try not to worry about it. you've worked hard enough the rest of the time so you should take \"lazy\" days without feeling guilty.",
      "author": "panicatthebookstore",
      "created": 1576959409,
      "upvotes": 4,
      "replies": {}
    },
    "fbl0b6x": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbl0b6x/",
      "text": "I know it might be hard for you, but just.... Don't. I don't. School isn't everything.",
      "author": "purplelovely",
      "created": 1576957037,
      "upvotes": 10,
      "replies": {}
    },
    "fbksj1d": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbksj1d/",
      "text": "What really helped for me is making an actual schedule and a to do list. If my to do list is finished and I have planned time left, I'll work ahead. I always keep certain days free of work, so I can relax. I also take regular (short) breaks, to keep my concentration high.\n\nHopefully this helps, good luck with everything.",
      "author": "Sofpug",
      "created": 1576954947,
      "upvotes": 16,
      "replies": {}
    },
    "fbkrcqc": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbkrcqc/",
      "text": "Thank you all for the answers, I'll try to pick the best out of all of them. :)",
      "author": "Expensive_Alfalfa",
      "created": 1576954507,
      "upvotes": 0,
      "replies": {}
    },
    "fbkobrr": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbkobrr/",
      "text": "I would read some medical or physiological studies on the value of rest. I rationalize to myself it is benifical to me my brain and my work if I rest and ____ study said it ____ in blank way. Then I don’t feel bad because I’m resting to achieve more!",
      "author": "redwallchronicles",
      "created": 1576953312,
      "upvotes": 10,
      "replies": {
        "fbmxydh": {
          "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbmxydh/",
          "text": "This is my same mindset. Studying without enough rest or regular breaks just isn’t productive.",
          "author": "soccergirl13",
          "created": 1576990226,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fbkjs05": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbkjs05/",
      "text": "I experience this also and what works for me is to treat my time off as either a mini-reward or as another \"assignment\". So rest is very intentional, and I have very firm boundaries around it. \n\nI actually build mental-health days into my academic schedule so that I know on that day or for that hour (however much I have allotted for myself), I am free to rest and do things exclusively for me because I have actually planned for it on my calendar.\n\nI tend to feel more guilty about taking time off when I am less aware of what all needs to get done or whether I am behind or on track. It still takes me a little time to unwind at first, but I stick with it and eventually find I'm able to enjoy my down time.",
      "author": "anuneducatedguess",
      "created": 1576951448,
      "upvotes": 77,
      "replies": {
        "fbldwye": {
          "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbldwye/",
          "text": "This is what I do too! I plan relaxation time into my schedule so I know I have time for it.",
          "author": "Meg_hansoloVT",
          "created": 1576961591,
          "upvotes": 12,
          "replies": {}
        },
        "fblfaqe": {
          "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fblfaqe/",
          "text": "This seems like a good idea, I'll try it. Thank you.",
          "author": "Expensive_Alfalfa",
          "created": 1576962151,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fbk5mhu": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbk5mhu/",
      "text": "Pick up a hobby that requires you to learn something or work toward a goal. Maybe try an instrument.",
      "author": "ilikepie-1234",
      "created": 1576945126,
      "upvotes": 65,
      "replies": {}
    },
    "fbk34bi": {
      "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbk34bi/",
      "text": "Welcome to academia, where there is no end of the day work whistle to tell you it’s closing time. \n\nAcademia lets you pick your hours which is great.\n\nAcademia makes you feel like there is a monkey on your back when not working making you feel like you aren’t doing enough, which is bad.",
      "author": "urnbabyurn",
      "created": 1576944055,
      "upvotes": 247,
      "replies": {
        "fbpeeq9": {
          "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbpeeq9/",
          "text": "We can easilly abstract this issue enough to see the academia is unrelated to the core problem",
          "author": null,
          "created": 1577020215,
          "upvotes": 3,
          "replies": {}
        },
        "fbkwmp1": {
          "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbkwmp1/",
          "text": "[deleted]",
          "author": null,
          "created": 1576956053,
          "upvotes": -3,
          "replies": {
            "fbkx0w7": {
              "link": "/r/college/comments/edqzxs/i_feel_bad_with_myself_when_im_not_studying_or/fbkx0w7/",
              "text": "It’s called empathizing. People in academia often feel this. Many find commiserating as a form of empathy useful but you get what you pay for.",
              "author": "urnbabyurn",
              "created": 1576956136,
              "upvotes": 31,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634056686
}