{"sid": "pu7j3r", "link": "/r/college/comments/pu7j3r/is_community_college_at_all_like_normal_college/", "title:": "Is community college at all like normal college?", "text": "Sorry if this isn't the place for this post, just not sure what kind of post it really is. Basically I'm currently sort of panicking because my previous plans for college have fallen through. The main two possibilities I'm considering are either:\n\n* Attend 2 years of a community college (I would need to move/live on campus)\n* Try to go straight for a 4 year college (Still need to move/live on campus)\n\nMy biggest fear with going to a community college is that... I want the social aspect of schooling. I want clubs and classmates I can actually befriend who are my age, not 30-40 year olds that I feel like just aren't really my peers. And I don't want an experience that lacks the social groups aspect because, if nothing else, it's going to make me really depressed and my education will suffer. \n\nSo, the short question is: Can I have a normal college social life by attending a community college? Specifically, I'm looking at schools in the Seattle area (Shoreline, Central Seattle Community, North Seattle Community, etc.) Or am I just going to waste 2 years trying to muddle through my classes alone?", "author": "CPUGamer101", "created": 1632440106, "retrieved": 1632800744, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"he5x43d": {"link": "/r/college/comments/pu7j3r/is_community_college_at_all_like_normal_college/he5x43d/", "text": "CC is much much better. Better prices, better teaching, easier classes. You’ll save a ton and you’ll still have 2 years of social stuff", "author": "evasiveshag", "created": 1632532051, "upvotes": 1}, "he2n746": {"link": "/r/college/comments/pu7j3r/is_community_college_at_all_like_normal_college/he2n746/", "text": "Personal experience. I have taken both university and CC classes and the teachers at CC IMO are better", "author": "Captianyeet", "created": 1632477648, "upvotes": 3}, "he1z8uh": {"link": "/r/college/comments/pu7j3r/is_community_college_at_all_like_normal_college/he1z8uh/", "text": "Ok so community college is pretty different from regular uni mostly because of residency stuff. A lot of CCs aren’t residential, I don’t even know if all of them have dorms (mine had housing that was basically just apartments under their name, it wasn’t really traditional dorms). Class sizes may also be different depending on where you go. If you’re willing to sacrifice that social aspect for cheaper schooling for 2 years and a bit of a jumpstart when you get to a 4-year I’d say do it, but go into it knowing you’d like to transfer later (I did it kinda spontaneously and it’s fucked me over a little).\n\nI’m currently in New Student Week at my regular 4-year and it feels very different. I can elaborate more if you’d like!", "author": "lesbyeen", "created": 1632458439, "upvotes": 1}, "he17thw": {"link": "/r/college/comments/pu7j3r/is_community_college_at_all_like_normal_college/he17thw/", "text": "i’m at community college right now and it’s pretty cool, classes are small and the teachers are super understanding, it just gets kind of lonely sometimes", "author": "badbitchbobo", "created": 1632444347, "upvotes": 1}, "he10q92": {"link": "/r/college/comments/pu7j3r/is_community_college_at_all_like_normal_college/he10q92/", "text": "I go to shoreline!! \n\nBut I'm one of those 30 year old non-peer people I guess lol.\n\nBut I really like it here a lot. I wish clubs would start up again soon though, they're mostly all still on a covid hiatus.", "author": "huntsber", "created": 1632440959, "upvotes": 2}}}