{
  "sid": "q5rduv",
  "link": "/r/college/comments/q5rduv/i_need_opinions_on_the_topic_exotic_animals_as/",
  "title:": "i need opinions on the topic \"exotic animals as pets\" for a big assignment",
  "text": "long story short, i'm a college student studying animal care and i have an assignment where i have to find sources, opinions and reasons behind different answers to an ethical question. the question of my choice is \"should exotic animals be allowed as pets?\". my goal is to find more reasons to stand behind my own opinion, or change my mind using the opinions and sources of others. i have to put this all into one essay, which includes sources, opinions and answers to a list of questions (listed at the end of the post).\n\nnow i'd like to clerify, as i got this question before, but what do i consider exotic animals in this case? it's a rather wide umbrella and many exotic animals like birds, fish and bunnies are already commonly known as pets. in this case, i consider any animal that isn't domesticated or hasn't evolved in nature to live with humans exotic. therefore i don't consider common types of bird, fish or bunny exotic. having a wild rabit or a big bird like a dove, crow or birds taken from their native land will be considered having an exotic animal at home. a more obvious difference is the one between house cats and wild cats like lions etc.\n\ni'd appreciate any comment, opinion or questions if you happen to have any.\n\nhere's the link to the before mentioned survey, and i hope some of you are willing to help me out.\n\n[https://www.smartsurvey.co.uk/s/WUCCUW/](https://www.smartsurvey.co.uk/s/WUCCUW/)\n\nplease note that i'm not asking this so others can do research for me, i'm asking this to find out opinions on the matter and see if the reasoning and opinions can give me a better insight than some sources like websites or news articles.",
  "author": "tiny_saysrawr",
  "created": 1633941070,
  "updated": 1634083016,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hg87by8": {
      "link": "/r/college/comments/q5rduv/i_need_opinions_on_the_topic_exotic_animals_as/hg87by8/",
      "text": "Many common types of bird and fish were and still are taken from their tropical habitats for pets here.  The fact that it is common may not be your best bet as a definition.\n\nParakeets are more “exotic” than doves and size should not be a rationale.  Doves and pidgeons live here natively, and have arguablt been domesticated .\n\nIn some places  the dominant species of hare or rabbit are actually feral populations of escaped or abandoned pets.\n\nCrows are native to the us also.\n\nHoneybees are not.\n\nSo you should also consider what is a pet. Sheepdogs are working animals but may also sit by the fire at your feet of an evening.  A horse is a stickier issue. \n\nPeople are also keeping smaller wild cat species and many of the biggest issues with them have little to do with the size of the cat.",
      "author": "PersephoneIsNotHome",
      "created": 1633959887,
      "upvotes": 2,
      "replies": {
        "hgbuzdi": {
          "link": "/r/college/comments/q5rduv/i_need_opinions_on_the_topic_exotic_animals_as/hgbuzdi/",
          "text": "i believe that what you're saying is only partially true, in some counties, there are places that have those 'exotic' birds born in captivity or domesticated. this has been going on for so long that to those countries they're no longer considered exotic, or seen as taken from the wild. i appreciate the facts from the country you live in but you can't prove me wrong unless you've studied every country and every company in the sector on the matter. i'm not saying you're wrong, nor am i saying that i'm right, i'm only saying that there's no way to be sure. now may i ask your opinion? you're only telling me what to consider, and not what your opinion is. i need opinions for my assignment so i'd appreciate to see a propper opinion.",
          "author": "tiny_saysrawr",
          "created": 1634023538,
          "upvotes": 1,
          "replies": {}
        },
        "hgbv72i": {
          "link": "/r/college/comments/q5rduv/i_need_opinions_on_the_topic_exotic_animals_as/hgbv72i/",
          "text": "adding to my last message, i did mention the sizes, but i also mentioned that it's just an example. i said that for this specific assignment, i consider animals that aren't domesticated or evolved to live with humans exotic. if a tiger is born in captivity and raised by humans, they're still exotic even if they live with humans, so that's no excuse to keep them as pets.",
          "author": "tiny_saysrawr",
          "created": 1634023728,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg7vimc": {
      "link": "/r/college/comments/q5rduv/i_need_opinions_on_the_topic_exotic_animals_as/hg7vimc/",
      "text": "well i think that if the animal is suffering and the human is spending all time on resource to care for it is also suffering. the animal should be turned over to some sort of sanctuary. i think it is a very bad idea to have say, a chimp many instances of them becoming very neurotic and unhappy when they become teenagers. they attacked the owners, the friends, pulled the owners arms off and bit her face. secondly, they were putting the chimp on anxiety medicine. the owner was also suffering knowing the animal was becoming too hard to care for. \n\ni am related to joe exotic btw but havent spoken with him in a long time but the zoo was very expensive caring for the cats became what i can only presume very stressful for him. the animals are smarter then what they may seem and they realize they are confined.",
      "author": "jelq_master420",
      "created": 1633953123,
      "upvotes": 1,
      "replies": {}
    },
    "hg7ppms": {
      "link": "/r/college/comments/q5rduv/i_need_opinions_on_the_topic_exotic_animals_as/hg7ppms/",
      "text": "[removed]",
      "author": null,
      "created": 1633948753,
      "upvotes": -2,
      "replies": {
        "hg7uq02": {
          "link": "/r/college/comments/q5rduv/i_need_opinions_on_the_topic_exotic_animals_as/hg7uq02/",
          "text": "why are you promoting cheating ?",
          "author": "jelq_master420",
          "created": 1633952592,
          "upvotes": 2,
          "replies": {
            "hg7za6w": {
              "link": "/r/college/comments/q5rduv/i_need_opinions_on_the_topic_exotic_animals_as/hg7za6w/",
              "text": "Far from it. She just provided guidance every step of the way. It's what you are doing here, no?",
              "author": "Michelle_Royal",
              "created": 1633955536,
              "upvotes": 0,
              "replies": {
                "hg800x8": {
                  "link": "/r/college/comments/q5rduv/i_need_opinions_on_the_topic_exotic_animals_as/hg800x8/",
                  "text": "no i didnt you just linked a website where you can buy an essay writer?\n\nalso you are a shill get a life",
                  "author": "jelq_master420",
                  "created": 1633955979,
                  "upvotes": 2,
                  "replies": {
                    "hg8932d": {
                      "link": "/r/college/comments/q5rduv/i_need_opinions_on_the_topic_exotic_animals_as/hg8932d/",
                      "text": "Anyone who needs help will get it. Simple.",
                      "author": "Michelle_Royal",
                      "created": 1633960720,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}