{
  "sid": "qkwcpq",
  "link": "/r/college/comments/qkwcpq/how_to_memorize_complex_charts_in_4_days_study/",
  "title:": "How to memorize complex charts in 4 days? (study tips needed)",
  "text": "Yeah so I have a big exam (closed note, closed book) on Friday for rather difficult biology class. A few days ago my prof told us that we will need to know [this entire phylogenetic tree](https://imgur.com/a/R3LP0CP) for the exam, as well as other charts. We don't have to draw it on the exam or anything but there will be very specific questions about it. \n\nUsually whenever I need to memorize something I just use flashcards or quizlet but Idk how to memorize a chart, especially not a chart with as many levels and details as this one.  I'm struggling here, does anyone have any tips?",
  "author": "quietoneintheback",
  "created": 1635827321,
  "updated": 1635890800,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hizodsl": {
      "link": "/r/college/comments/qkwcpq/how_to_memorize_complex_charts_in_4_days_study/hizodsl/",
      "text": "By looking at the picture you posted yes I think definitely try using mnemonics would be really helpful. Also, the diagrams looks very complicated because the text is not in uniform layout, with all the different levels stack tightly… recreate them yourself!  \nTry memorizing them in different chunks, first memorize the different levels, then assign the specific invertebrates into those chunks. And to test yourself, try recreating the ones you’re not sure with to double check! Use online softwares like xmind.works or just notes function to recall information. Because recognizing definitely does not guarantee memorization. Good luck!",
      "author": "chococaex",
      "created": 1635843841,
      "upvotes": 2,
      "replies": {}
    },
    "hiz9ye3": {
      "link": "/r/college/comments/qkwcpq/how_to_memorize_complex_charts_in_4_days_study/hiz9ye3/",
      "text": "Nmemonics. Use nmemonics to memorize the organization of the tree. practive drawing it over and over. then on the exam, draw it out and answer questions on it",
      "author": "Ihavsunitato",
      "created": 1635831210,
      "upvotes": 1,
      "replies": {}
    }
  }
}