{"sid": "b8xcir", "link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/", "title:": "Have you ever studied really hard for an exam then proceeded to forget everything when you are handed the exam paper?", "text": "So that happened to me today, I studied everything that I could possibly encounter in the exam and I was quite confident that I would do well, so here I am in the exam room I look at the questions and nothing, I couldn’t seem to link the questions to the answers in my head, it was so damn confusing because I have never been in that spot before, anyone knows what could’ve caused that?", "author": "TyraelYS", "created": 1554294700, "retrieved": 1632802174, "over_18": false, "upvotes": 967, "upvote_ratio": 0.98, "comments": {"ek2wty6": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2wty6/", "text": "God yes", "author": "Shan132", "created": 1554352850, "upvotes": 1}, "ek2tqjm": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2tqjm/", "text": "LPT:  don't study too much, go to class every day stoned, get drunk when you have to write, test sober knowing you got a celebratory bowl waiting", "author": "HourRecipe", "created": 1554349647, "upvotes": 1}, "ek2tlgw": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2tlgw/", "text": "This happens to me a lot in organic chemsitry. Once my professor hands me the test paper, a wave of anxiety hits me. Even when I start to calm down, I forget half the shit I went over prior to the test.  I followed the recommended amount of studying (12 hours a week) and still manage to do a shit job on the exams.  The lowest I made is a 20% while the highest is a 69%.", "author": "Redcat64", "created": 1554349512, "upvotes": 1}, "ek2t0ju": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2t0ju/", "text": "I remember this happened to me in 3rd grade. The quiz was on the pilgrims and there was like 3 questions. We literally reviewed it right before she passed it out and then my mind went completely blank. I was so sad for some reason hahaahaha", "author": "John_m33", "created": 1554348969, "upvotes": 1}, "ek2quvj": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2quvj/", "text": "This literally used to happen to me all the time but I started studying (memorizing / reciting and recalling) all the material as close to the exam as time permitted and that really helped. I think I was so anxious that it clouded my thoughts pushing what I needed to the back of my brain, so by studying right before, I knew I was prepared and way more confident. Also after I study I take a break to watch youtube or do whatever just to relax my nerves. Hope this helps good luck ! :)", "author": "M0420", "created": 1554347032, "upvotes": 1}, "ek2nyo2": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2nyo2/", "text": "I hate it when some professors make exams a huge portion of the overall grade. ", "author": null, "created": 1554344642, "upvotes": 1}, "ek2nmk0": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2nmk0/", "text": "Story of my life. Just not a good test taker period. ", "author": null, "created": 1554344364, "upvotes": 1}, "ek2lm21": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2lm21/", "text": "Yup, and I ranked my exam today.  Apparently a lot of other people did tho though.  So there’s that.", "author": "kellasong", "created": 1554342722, "upvotes": 1}, "ek2ilak": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2ilak/", "text": "Here’s how I study. I get questions from the book or study guide and answer the questions on a separate piece of paper. When I finish, I look back at the questions and try to imagine myself taking the test and get out another piece of paper and redo the questions then check answers etc.  So basically, try to study like you’re taking a test at home. If that doesn’t help, literally staring at questions with blank answers is another way that helps me feel the atmosphere of taking a test since when you are given a test there is obviously no answers given to you on the paper. ", "author": null, "created": 1554340327, "upvotes": 2}, "ek2gl2a": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2gl2a/", "text": "back in high school yes. But thats only because I barely studied and crammed last minute. ", "author": "PossiblyAsian", "created": 1554338735, "upvotes": 1}, "ek2gbgn": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2gbgn/", "text": "Every. Single. Time....", "author": "TheStudentKey", "created": 1554338529, "upvotes": 1}, "ek2cgmn": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2cgmn/", "text": "Yup; more common that I think people are willing to admit. Happened during my calc final last year.", "author": "Mrfuzzymonkeys", "created": 1554335515, "upvotes": 1}, "ek2c9wq": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2c9wq/", "text": "I didn't do too bad, or so I thought. This teacher waits a whole week before giving us our grades. ", "author": null, "created": 1554335369, "upvotes": 1}, "ek2axct": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2axct/", "text": "This happens to me. It's an anxiety thing for me. I almost always recover and write the test without major issues. ", "author": null, "created": 1554334331, "upvotes": 1}, "ek2a58s": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek2a58s/", "text": "It happened to me once during a microeconomics test. I am not good at this subject so I had to work really really hard. I learned absolutely everything. When I was handed the exam sheet  I realized I forgot everything. \nAfter spending 20 minutes doing nothing I managed to recover parts of the lesson and ended up with a 14/20 which is the equivalent of an American B+ or maybe even A. \nThe mean of the class was around 7/20, which is very low considering that you fail the class when you're below 10. Yep, French public University teachers are not joking. ", "author": "amokrane_t", "created": 1554333738, "upvotes": 2}, "ek29k2n": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek29k2n/", "text": "Haha yeah. I probably landed a 30 on my calc 2 exam yesterday. ", "author": "bayer_aspirin", "created": 1554333297, "upvotes": 1}, "ek27cv1": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek27cv1/", "text": "all my accounting exams!", "author": "ekesty13", "created": 1554331631, "upvotes": 1}, "ek1zx7a": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1zx7a/", "text": "never happened before but im always afraid it will beacsue i always cram a shot ton of info right before a test", "author": "PersistantBlade", "created": 1554326335, "upvotes": 1}, "ek1w5ht": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1w5ht/", "text": "Scored 4.5 out of 50 after feeling like I did everything, dropped the course in the end.  ", "author": "ReggaeMonestor", "created": 1554323830, "upvotes": 1}, "ek1tswa": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1tswa/", "text": "Happens to me constantly no matter how long/hard I study", "author": "scienceblues92", "created": 1554322317, "upvotes": 1}, "ek1rcij": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1rcij/", "text": "Yeah this happens to me literally every time, I always just do the easy questions first to kind of calm down and everything starts coming back to me by the time the easy questions are done", "author": "itshighdune", "created": 1554320769, "upvotes": 1}, "ek1ozhy": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1ozhy/", "text": "Yes it has. Test anxiety used to hit me hard, i found a cure though. What i do , i enter the exam room and take the booklet and question paper. I compose myself then go through the questions without writting anything and see those that i can tackle. I select them and start working on them first. I then slowly feel more in control and things start coming back to me. Just like that cinfidence and memory are back and i get to tackle as much as i can on the paper", "author": "Limeandoranges", "created": 1554319378, "upvotes": 2}, "ek1oyrr": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1oyrr/", "text": "With subjects I dislike yeah ", "author": null, "created": 1554319367, "upvotes": 1}, "ek1ohbd": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1ohbd/", "text": "Yup. I have a test today. I’m terrified it’ll happen again since I have to do decently to not drop the class. ", "author": "PotlePawtle", "created": 1554319086, "upvotes": 1}, "ek1nifs": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1nifs/", "text": "no", "author": "monkeyburrito411", "created": 1554318523, "upvotes": 1}, "ek1lbuv": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1lbuv/", "text": "Yup", "author": null, "created": 1554317271, "upvotes": 1}, "ek1kn7m": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1kn7m/", "text": "Have you ever dealt with anxiety issues? This happens to me becuase of my anxiety. I won't be nervous about the test until it's sitting in front of me and then I proceed to zone out and forget everything I know as I contemplate my life because I'm freaking out.", "author": "deltapilot97", "created": 1554316884, "upvotes": 1}, "ek1jxhf": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1jxhf/", "text": "Yeah, my stats final. Pretty sure I didn't get a single question correct. It was worth 40 percent of my grade and to my amazement, I had a b+ at the end of the semester", "author": "noogiey", "created": 1554316483, "upvotes": 1}, "ek1d4tx": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1d4tx/", "text": "The only time this has ever happened to me was my midterm this semester. As someone who did AP in highschool and never took another english or history class, I've gone the past 4 years without a single timed writing.\n\nBut last month my philosophy professor decided to give us 7 possible prompts referencing the various readings through the semester. He would select 2 for us to write on. No assignment has ever given me more anxiety.\n\nI was overprepared. I spent HOURS creating fully-fleshed outlines for each prompt. The night before, I still felt unprepared so I decided to pull an all nighter and review. Needless to say, I bombed. Still haven't gotten my grade but I didn't even come close to finishing either of the essays. I broke into tears at one point in the writing. I absolutely loathe timed writing and to be forced to reference a random selection out of over 50 readings was cruel imo.", "author": "fff192", "created": 1554312569, "upvotes": 1}, "ek1bf1l": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1bf1l/", "text": "I think cramming for exams the night before has that effect. Your mind has a significantly less amount of time to properly absorb the information you’re trying to remember. However, putting it into your own words and talking about it out loud even to just your pet is very helpful. ", "author": "redflavormp3", "created": 1554311590, "upvotes": 4}, "ek1b0ae": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek1b0ae/", "text": "Yeah. Cram, cram, cram. Exam comes - NOPE.", "author": "jerdle_reddit", "created": 1554311355, "upvotes": 1}, "ek19p1c": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek19p1c/", "text": "all the time ", "author": "Fattire25", "created": 1554310582, "upvotes": 1}, "ek18u2x": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek18u2x/", "text": "Lmao, have you ever studied really hard for an exam and then DIDN'T proceed to forget everything?", "author": "Abounding", "created": 1554310070, "upvotes": 1}, "ek14t93": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek14t93/", "text": "Every fuckin time", "author": "veniepenie", "created": 1554307508, "upvotes": 1}, "ek13ufo": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek13ufo/", "text": "Ya this has happened. This is because of stress and nothing else. Don't panic or overwhelm yourself. Just be calm and write it like it is a normal practice paper. Like you've nothing to lose!", "author": "studytips007", "created": 1554306875, "upvotes": 1}, "ek13418": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek13418/", "text": "Felt this last night, practice exams getting 60-70% (very good for me) and then get handed the exam, forget everything and walk away with a %40. It’s so frustrating putting in so much time a week for no result. Fuck chem. ", "author": "Garbcole", "created": 1554306379, "upvotes": 1}, "ek12q0d": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek12q0d/", "text": "definitely has happened to me before. usually happens when i put too much weight onto the exam. I've found that if i approach it with the thought process of \"it's currently 2:30 PM. i just have to write out a couple things and I'm out of here before 4. Then I'll get to go home and eat some chips and salsa and be good\" test anxiety is a real bitch. ", "author": "azallday", "created": 1554306115, "upvotes": 1}, "ek11pz0": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek11pz0/", "text": "Every chemistry exam", "author": "DrBarkerMD", "created": 1554305447, "upvotes": 2}, "ek11l6h": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek11l6h/", "text": "Honestly OP, I know the feeling but it basically comes down to not having studied enough or not having studied in the right way. First of all don't try to cram everything into your head on the last day. What you should be doing is learning the theory throughout the course, then when it's time for revision you quickly check you know all the theory (for maths it would be definitions, properties and theorems). Then you do exercises and previous exams until the questions become a matter of automation. It may not be necessary to go that far if you're naturally good at what you're doing, but if you're struggling then I recommend you do this.", "author": "TheTardonator", "created": 1554305357, "upvotes": 4}, "ek11jew": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek11jew/", "text": "It has happened when I cram the day of and the day before the exam. ", "author": "downheatx", "created": 1554305323, "upvotes": 2}, "ek11ixd": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek11ixd/", "text": "I'm about to take an exam. Wish me luck. ", "author": null, "created": 1554305314, "upvotes": 5}, "ek11avg": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek11avg/", "text": "My best advice would be to study exactly how you are going to take the exam. Like down to stupid details. \n\nIf you can't listen to music during the exam, down listen to music while studying the last few days. \n\nIf you can't take the exam in bed, don't study for it in bed. \n\nIf you aren't going to be on adderall during the exam, don't study on it. \n\nStudy how you will take the exam. ", "author": "UltraRunningKid", "created": 1554305163, "upvotes": 3}, "ek11395": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek11395/", "text": "You mean every single time? I can know everything, but every single time I'm handed that exam paper its like my brain shuts down", "author": "asoep44", "created": 1554305018, "upvotes": 2}, "ek0zvj6": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0zvj6/", "text": "Your fight or flight part of your brain receives blood before the thinking part of your brain. If you are severely stressed or anxious very little blood will be going to the thinking portion of your brain, because it's all going to fight or flight. This is why some people are just bad test takers even if they know the material cold. If you don't have enough blood going to the right part of your brain you can literally not remember things ingrained in you.", "author": "Bomcom", "created": 1554304172, "upvotes": 3}, "ek0yi08": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0yi08/", "text": "Happened to me my last Calculus test. I chalked it up to me getting little to no sleep. That helps a lot. Because my second calc test I sacrificed extra study time for some sleep and scored way better. Try that maybe.", "author": "CircaALex", "created": 1554303210, "upvotes": 3}, "ek0ya82": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0ya82/", "text": "Dude I’ve been so tired I have literally woken up with an essay I don’t remember writing.", "author": "corgishorti", "created": 1554303058, "upvotes": 2}, "ek0xui0": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0xui0/", "text": "Did that at my exam yesterday and I also have an exam tonight and will definitely happen again. It’s really frustrating when you know that you know the material but freeze up when handed the exam. I try to chill out but I feel it’s a little weird for the person next to you to be closing their eyes and doing deep breathing during an exam lmao ", "author": "kgreatie", "created": 1554302748, "upvotes": 3}, "ek0xbva": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0xbva/", "text": "Interesting. I too took an exam 2 hours ago when you posted this and blanked out. This is one of the few times this has happened to me and it's awful. Best of luck", "author": "5414496", "created": 1554302379, "upvotes": 2}, "ek0xbpa": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0xbpa/", "text": "Every fucking time dude", "author": "BMW666Series", "created": 1554302376, "upvotes": 1}, "ek0x75u": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0x75u/", "text": "What I’ve started doing is before I even look at any of the questions, I brain dump everything that I can think of that I studied onto the test somewhere. It’s helped me, especially in my math classes, to be able to review the formulas and theories and better allows me to apply those to the test", "author": "ATM0123", "created": 1554302285, "upvotes": 1}, "ek0wtso": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0wtso/", "text": "It’s even worse when everything clicks in the last 5 minutes because of some stupid formality you overlooked in the beginning.", "author": "CrimZ_24", "created": 1554302017, "upvotes": 12}, "ek0wbe1": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0wbe1/", "text": "Legitimately know the feeling all to well. That's why I've countered it with a simple trick: a single, small hit from a weed dab pen before class. Not even a big smoker, but something about it feels ritualistic, calming, and hey if you can giggle at calculus why wouldn't you?", "author": "Phelps1576", "created": 1554301646, "upvotes": 6}, "ek0vpww": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0vpww/", "text": "This has happened to me on pretty much every college exam I've taken. I have some real testing anxiety that didn't start until college and man has it destroyed all of my confidence in taking tests", "author": "BlueberryOnions", "created": 1554301228, "upvotes": 8}, "ek0vcm3": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0vcm3/", "text": "What I do to cope with this is write everything I know where there is space on the front or back of the paper, or at least the very important things I don’t want to forget. \nI also read future questions and try to tie back answers to the previous questions. Not much else I can do. ", "author": null, "created": 1554300958, "upvotes": 22}, "ek0uqte": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0uqte/", "text": "All the time. I think I have ADHD or something. ", "author": "FlowerShine2U", "created": 1554300515, "upvotes": 9}, "ek0u11f": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0u11f/", "text": "It's called test anxiety my friend, a lot of people I know get this too. They study for the test but when the test comes they blank. It does not mean you didn't study right, rather you need to relax in your test and not be so stressed when taking a test ", "author": "Cblue777", "created": 1554299996, "upvotes": 134}, "ek0tmjk": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0tmjk/", "text": "Every test I've ever taken.\n\nI could know the material inside and out but the moment the test gets handed out my brain gets wiped of everything. It's similar to that spongebob episode where he forgets everything, all the spongebobs in his brain are running around screaming \"WE THREW OUT HIS NAME\".\n\nThat's how it feels.", "author": "Zerobeastly", "created": 1554299703, "upvotes": 124}, "ek0shen": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0shen/", "text": "This happened to me with every test I had in Business Calculus. It was infuriating ", "author": null, "created": 1554298840, "upvotes": 25}, "ek0oep1": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0oep1/", "text": "So...anyone else wake up early to study for a test today, and this is what they’re greeted with?", "author": "PianoConcertoNo2", "created": 1554295422, "upvotes": 444}, "ek0no96": {"link": "/r/college/comments/b8xcir/have_you_ever_studied_really_hard_for_an_exam/ek0no96/", "text": "Biochem. My entire life. ", "author": "shadowwolfsl", "created": 1554294741, "upvotes": 48}}}