{"sid": "pwfurz", "link": "/r/college/comments/pwfurz/homesickness/", "title:": "homesickness", "text": "so I’m a freshman and I started school like a week ago and I’m extremely homesick :/ i came to school without any friends so I don’t really know anyone yet and every morning I just kinda get sad because I miss home. Does this feeling like go away?", "author": "missingolive", "created": 1632745187, "retrieved": 1632945560, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"hemu4bv": {"link": "/r/college/comments/pwfurz/homesickness/hemu4bv/", "text": "This is exactly how I was. I'm a freshman too but I started 6 ish weeks ago. I had no friends and I was sobbing every night because of how much I missed my family. I promise you get used to it. I don't make friends easily, so it took me some time, but I now have some pretty good friends that I can rely on to keep me company. \n\nMy best advice would be to keep yourself busy. As stupid as it sounds, go to all of the events. For someone super introverted like me, it's really hard, but it does help. You stay busy and it forces you to make friends. \n\nDon't call your family that often. I was calling my mom multiple times a day because I missed her so much. Don't do this. Call once a day, max. Trust me, it helps. \n\nAt night, keep your mind as busy as possible before you fall asleep. I relied on podcasts and audiobooks to fall asleep because if I was allowed to be alone with my thoughts for even a moment, I'd break down because I just thought about how much I wanted to go home. \n\nDuring lectures, try to make small talk with the people around you. Remember, these people also have no friends and they're just as desperate as you. As someone who's very introverted, small talk can be hard and scary, but just try to force it. It helps, and forming these connections early is super awesome. \n\nEven if your lectures give you the option to connect via zoom or skip entirely, GO TO LECTURES. Get out of your dorm. You do not want to stay holed up in there. Go to every lecture and engage as much as you can. If you just sit in your dorm and zoom into class or skip entirely, you will feel a million times worse. \n\nExplore the city if you can. Once you make some friends, invite them out to do something off campus. Staying on campus 24/7 personally made me feel worse. I'd never mini golfed a day in my life before I moved, but now my friends and I go every weekend. If you can afford it, invite someone out to lunch off campus every once in a while. \n\nAnd most importantly, just be patient. I remember feeling like I'd never get used to college and it would never get better. But it DOES get better and you DO get used to it. Just hold on. <3 \n\nAnd if you need support, feel free to DM me", "author": "awelias8", "created": 1632858075, "upvotes": 2}, "hegwfb9": {"link": "/r/college/comments/pwfurz/homesickness/hegwfb9/", "text": "The first few weeks are hard. Try giving yourself time to adjust, don't go home the first weekend, set a goal to stay for a month, until fall break, or thanksgiving,  depending on how far away your are.  Everything is new, and it's both exciting and overwhelming. Try and find some balance in it. Keep going to class, try eating in different dining halls if your school has them. Some food options will be better than others. Keep an eye out for activities that interest you, even if you are going alone, sports events, concerts, museums. There are usually activity fairs, and call out meetings for clubs within the first few weeks of school. The atmosphere on a campus really changes within a few weeks once things start getting busier. It's also okay, to let people at home know you miss them. Instagram and video chat with your family and high school friends. A lot of college students ask for frequent pictures or videos of their pets. My dogs have an instagram page. Some people have comfort shows they like to watch, (good place, great british bakeoff, schitts creek, ...)  Don't spend all your time in your room alone, but it's okay to take care of yourself.", "author": "fawkes_fiesta", "created": 1632749311, "upvotes": 1}}}