{"sid": "9uto5g", "link": "/r/college/comments/9uto5g/call_your_grandma/", "title:": "Call your grandma", "text": "Seriously. I just got off the phone with mine and I feel 10x better.\n\nThis semester has been hell for me. I'm taking 3 hard classes and marching band so I've never been more stressed. I'm not getting the grades I want and I've been rather hard on myself. I have 2 tests this week that really make or break my GPA and I'm sick with stress.\n\n I needed someone to vent to so I called my grandma.\nShe was so thrilled that I called and was so happy to talk to me. I let out all my frustrations and she gave me encouraging compliments. It made me feel so great when she told me that I would make her proud even if I did end the semester with bad grades. It was just 15 minutes of pure wholesome. \nShe prayed for me over the phone and asked when my tests were so she could pray during that time.\nNow she's telling all her friends to do the same for me. \n\nI'm sure I'm not the only one here who's stressed right now. If you have a grandma, call her. I'll make your day and hers. \n", "author": "Sham129", "created": 1541546693, "retrieved": 1632947845, "over_18": false, "upvotes": 757, "upvote_ratio": 0.97, "comments": {"e9946m8": {"link": "/r/college/comments/9uto5g/call_your_grandma/e9946m8/", "text": "Both of my grandmothers passed away years ago. In fact, I never met one of them, while I only met the other one once/twice while I was a baby and that's really it. I never met both of my grandfathers, either. They passed away, too.", "author": "-Sky_Nova_20-", "created": 1541627041, "upvotes": 1}, "e98z4r5": {"link": "/r/college/comments/9uto5g/call_your_grandma/e98z4r5/", "text": "My grandma is a piece of shit. Fuck that. ", "author": "MachiavelliP", "created": 1541623386, "upvotes": 2}, "e98lwz4": {"link": "/r/college/comments/9uto5g/call_your_grandma/e98lwz4/", "text": "Definitely. My grandma passed away last week and I feel bad for not having kept more in touch. But anytime I did call her she was nothing but helpful and loving. Don't forget your family! Because they'll be gone before you know it", "author": "korwyn69", "created": 1541613377, "upvotes": 1}, "e98l2gs": {"link": "/r/college/comments/9uto5g/call_your_grandma/e98l2gs/", "text": "I call both pairs every Sunday night.  No more than 5 minutes for each call.  They always comment on how happy it makes them.  I look forward to it each week.", "author": "PattyIce123", "created": 1541612725, "upvotes": 1}, "e98gqoq": {"link": "/r/college/comments/9uto5g/call_your_grandma/e98gqoq/", "text": "My last grandparent passed away last year. I wished I called him more often, even if he was a little senile.\n\nBut I once called my dad and I had a cold. He then texted my mom saying that I had a cold (as if she wouldn't know). I don't call my dad much as I'm closer to my mom, but I thought it was kinda adorable. ", "author": "littlebutcute", "created": 1541609373, "upvotes": 1}, "e98eby9": {"link": "/r/college/comments/9uto5g/call_your_grandma/e98eby9/", "text": "My gramma passed my spring semester of my senior year of high school. She was so proud that I was working so hard to graduate, and wanting to go to college, so whenever I start to get worn out, I think of how my gramma would've been so proud to see me in Honors and all the successes I've had so far. ", "author": "HolidayAardvark", "created": 1541607453, "upvotes": 2}, "e98d5v3": {"link": "/r/college/comments/9uto5g/call_your_grandma/e98d5v3/", "text": "Side note: cherish your grandparents while you have them. Mine are all gone.", "author": "Crimson9724", "created": 1541606501, "upvotes": 1}, "e98ac9m": {"link": "/r/college/comments/9uto5g/call_your_grandma/e98ac9m/", "text": "Whoa. It’s my grandmas birthday today and I was really worried I was going to forget to call her. ", "author": "jko8ukm", "created": 1541604245, "upvotes": 1}, "e97v1eb": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97v1eb/", "text": "Sounds exactly like my grandma ", "author": "bettycoopersponytail", "created": 1541584617, "upvotes": 1}, "e97saob": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97saob/", "text": "My grandma has always been really strict.  I just failed a midterm and I’m not sure I can face her... ", "author": "vader5000", "created": 1541579066, "upvotes": 1}, "e97rzqk": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97rzqk/", "text": "My grandma, who basically helped raise me, passed away this June while we were going on our family vacation with her. I miss her, and definitely called her more than once whenever school was stressing me out last year. She was the best grandma :(", "author": "sleepycorndogs", "created": 1541578515, "upvotes": 1}, "e97qsbu": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97qsbu/", "text": "On a side note, what do you play? I play trombone in the SEC.", "author": "FANTOMFLAPJACK", "created": 1541576404, "upvotes": 2}, "e97qjpv": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97qjpv/", "text": "Well,  ones dead and evil and the other has been a bit off since her husband “disappeared.”", "author": "KnitSocksHardRocks", "created": 1541576006, "upvotes": 2}, "e97nqay": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97nqay/", "text": "All my grandparents are dead. I just have my mom and dad for family. I'll probably call them, though. ", "author": "AlienRocks", "created": 1541571747, "upvotes": 1}, "e97njob": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97njob/", "text": "God, I miss my grandma. She basically raised me and I called her every week when I was off in college. Now I live with her and I understand why my uncle has a restraining order against her from visiting his family and I see why my parents keep away from her.\n\nShe's so horribly narcissistic and she's only getting worse. Things were better when I was a kid and only knew her as the lady I have coffee with. She's also my last grandparent and the best of her mentally insane siblings.", "author": "musiclovermina", "created": 1541571501, "upvotes": 3}, "e97n73l": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97n73l/", "text": "We should start a Grandma calling society. Just have a platform and we can talk to grandmas from around the world. Might help keep them company too :)", "author": null, "created": 1541571046, "upvotes": 10}, "e97lzcd": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97lzcd/", "text": "My housemate just found out his grandma died two hours ago, after he just got off the phone with her. Needless to say he's heart broken and can't study for his midterms tomorrow, but I doubt he would have traded studying for that phone call. Seriously guys, call them.", "author": "Pudinmonsta", "created": 1541569539, "upvotes": 4}, "e97knd8": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97knd8/", "text": "Mine is dead ", "author": "welchie98", "created": 1541568003, "upvotes": 1}, "e97kiap": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97kiap/", "text": "My grandmother been passed since I was 3 sadly", "author": "BlueBlurX", "created": 1541567848, "upvotes": 1}, "e97jaar": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97jaar/", "text": "Awwww this made me cry. Wish I could call mine...one passed last October and the other 9 years ago.", "author": "ReachandCrackTheSky", "created": 1541566560, "upvotes": 3}, "e97it0d": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97it0d/", "text": "Just talked to her yesterday evening. My grandpa died this past September, so I feel bad for not having called her as often to check up on her. I mean, he was very very sick and we're all glad that he's not suffering anymore, but I still worry about her. Because of him she had my mom, and because of my mom she has her grandchildren. \n\nAnyway, I told her about my worries regarding the election yesterday and she said \"Mija, don't let that affect your life. You need to move on, you can't be like that.\" Her words stuck with me. She also says she's proud of me for working hard at my very first job. \n\nI love her to fucking death. ", "author": "mental_dissonance", "created": 1541566085, "upvotes": 3}, "e97ih6m": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97ih6m/", "text": "Mine is dead :(", "author": "myalwaysthrowaway", "created": 1541565767, "upvotes": 2}, "e97i5ir": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97i5ir/", "text": "I was really not happy about staying in my city for college, but the best part of it is my aunts, great-aunt, and grandparents all live five minutes away from my school. Whenever I miss breakfast, whenever I need lunch, whenever I have time to spare before or after class, I know I have someone ready to comfort me, let me have a nap, or talk my ear off. I’m very lucky and it’s great that you appreciate your grandma. ", "author": "Nimbus2017", "created": 1541565463, "upvotes": 3}, "e97hyx2": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97hyx2/", "text": "What is the number to call the dead?  ", "author": "Neversexsit", "created": 1541565292, "upvotes": 2}, "e97ft7b": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97ft7b/", "text": "My grandma lives in China and I haven’t seen her in 9 years. ", "author": "Guitar_God75", "created": 1541563277, "upvotes": 3}, "e97frio": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97frio/", "text": "The semester is almost over! Keep on going strong for the last few weeks!", "author": "Crepcare", "created": 1541563236, "upvotes": 1}, "e97e1lp": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97e1lp/", "text": "This is so sweet i love it", "author": null, "created": 1541561764, "upvotes": 2}, "e97d33m": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97d33m/", "text": "If my grandmother wasn’t a raging narcissist who accuses me of not loving her if I don’t call 3 times a week, and whose words of wisdom include “Maybe you’d have more friends if you weren’t such a bitch” and “No one gives a shit about your opinions,” I might take you up i\non your offer.", "author": "MiyaDoesThings", "created": 1541560957, "upvotes": 2}, "e97csgr": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97csgr/", "text": "So cute. All my grandparents passed as of this past February. I encourage all of you to call and visit them while you can. ", "author": "mackys", "created": 1541560709, "upvotes": 2}, "e97cd8v": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97cd8v/", "text": "That's so cute!\n\nI wish I could call mine. :( She was my best friend, and lived with me for 13 years. She passed suddenly in May, and I wish every day I could talk to her again. Don't take her for granted! :) \n\nThanks for sharing!", "author": "Iripol", "created": 1541560351, "upvotes": 6}, "e97b88o": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97b88o/", "text": "Your grandma sounds lovely. \n\nI wish my grandma was still alive. She was a sweet and loving person, but died when I was six. I feel like my life would have gone much better if she was still alive. \n\nMeanwhile my living grandma lives on the other side of the country, but that's good because she was an abusive mother to her children, is a religious hypocrite, and is a homophobe. \n\nAny grandmas out there looking for new grandchildren to adopt? I need a nice grandma. ", "author": "Naolini", "created": 1541559387, "upvotes": 14}, "e97b7a6": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97b7a6/", "text": "I'm sleep deprived and this made me cry. ", "author": null, "created": 1541559364, "upvotes": 29}, "e97b78t": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97b78t/", "text": "If only I still had any grandparents", "author": "hOstAgE_SItuaTiOn", "created": 1541559363, "upvotes": 6}, "e97b72k": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97b72k/", "text": "I honestly have no idea what it's like to have extended family.\nNearly all of mine are either estranged or dead.", "author": null, "created": 1541559359, "upvotes": 3}, "e97b2u1": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97b2u1/", "text": "What if my grandparents don't speak English? Then what, Lol.", "author": "NativeCalifornianx", "created": 1541559258, "upvotes": 9}, "e97anoz": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97anoz/", "text": "My grandma is abusive and I always feel horrible after talking to her. I try to maintain minimal contact with her because she is toxic. I am happy you have a great relationship with your grandma though! ", "author": null, "created": 1541558897, "upvotes": 3}, "e97ajtt": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97ajtt/", "text": "My grandma's are in Mexico and I don't have a relationship with them. You have to realize how lucky you are to have your grandma! ", "author": "aprenderythink", "created": 1541558806, "upvotes": 15}, "e979ul6": {"link": "/r/college/comments/9uto5g/call_your_grandma/e979ul6/", "text": "My grandmother passed away back in April and the last thing she ever said to me was, “keep studying”. Keeps me in line whenever I start falling off. ", "author": null, "created": 1541558219, "upvotes": 245}, "e979cnp": {"link": "/r/college/comments/9uto5g/call_your_grandma/e979cnp/", "text": "Both of mine are dead", "author": "praine97", "created": 1541557803, "upvotes": 45}, "e977ydx": {"link": "/r/college/comments/9uto5g/call_your_grandma/e977ydx/", "text": "I talk to mine every Sunday. She loves her routines. She called me once on a Sunday, and I called her the next Sunday. I forgot the following weekend and found out she was waiting by the phone for me to call. It broke my heart, and I make sure to call every single Sunday because imagining her waiting by the phone for me to call makes me cry.", "author": "carmy00", "created": 1541556617, "upvotes": 97}, "e977emv": {"link": "/r/college/comments/9uto5g/call_your_grandma/e977emv/", "text": "Lmao I hate my grandma. She was an abusive mother and she tries to make it up by buying my love and still being abusive to my mother. She can burn in hell for all I care", "author": "breathingnicotine", "created": 1541556133, "upvotes": 22}, "e97675u": {"link": "/r/college/comments/9uto5g/call_your_grandma/e97675u/", "text": "Aw, how adorable. Too bad I don't really get along with mine", "author": "5414496", "created": 1541555065, "upvotes": 102}}}