{
  "sid": "q0cosm",
  "link": "/r/college/comments/q0cosm/freshman_need_help_to_socialize_properly_in/",
  "title:": "[Freshman] Need help to socialize properly in college",
  "text": "Graduated this year! I want to start community college and have!\n\nI go to a college in SoCal, some of the best transfers in the country. Currently taking 6 classes and really taking the fun with them! \n\nCurrently I'm doing fine in terms of academics, social life however is another idea.\n\nThis is different from my high school. People at the college always look like they are trying to get somewhere, or are extremely busy and preoccupied. The few times I see people, they look unamused, tired, frustrated or just plain poker faced.\n\nI can understand heavy work load. However I find it daunting how everyone at my school are so to themselves. I can't tell if it is just me or the environment. I had the plethora of social opportunity in high school, however everybody I meet now is so closed off.\n\nThe few times I do strike conversations, things can't go greater. However, I either never see them again due to how vast the school is, or they seem to be too preoccupied. \n\nI feel like mixed signals are given. I pack slowly after class, so must people are literally out by the time I turn. It's crazy. I feel really uneasy. I really don't like to make people uncomfortable with my presence, yet the conversations I've had have always been positive and great, even though I have had to initiate 99% of them. I can appreciate all comments given :)",
  "author": "azade12",
  "created": 1633244546,
  "updated": 1634089659,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hf751bc": {
      "link": "/r/college/comments/q0cosm/freshman_need_help_to_socialize_properly_in/hf751bc/",
      "text": "I agree. I am usually always the one to initiate conversation. I wish people would just try to strike up conversation more, most people want friends and it would it so much easier for everyone.",
      "author": "shrimpynut",
      "created": 1633244869,
      "upvotes": 3,
      "replies": {
        "hf754bg": {
          "link": "/r/college/comments/q0cosm/freshman_need_help_to_socialize_properly_in/hf754bg/",
          "text": "Exactly :) it's greater for everybody!",
          "author": "azade12",
          "created": 1633244935,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}