{
  "sid": "q1fmbp",
  "link": "/r/college/comments/q1fmbp/changed_majors_from_statistics_data_science_to/",
  "title:": "Changed majors from Statistics & Data Science to Sociology. Big L or smart decision?",
  "text": "I’m a junior-level transfer student (20/F) who wormed my way into a prestigious university out of a community college transfer agreement. Transitioning into university life nearly broke me, especially after COVID online school. I never realized how bad I was at math and computer science until I got here. Community college provided that safe-space environment where my peers and my professors would hold my hand and guide me through anything. Math tests and coding assignments made my anxiety and depression go through the roof. Even then, high-level math and coding made me miserable and I never thought ahead and understood the hell I would be getting myself into. \n\nSociology on the other hand, involves a lot of reading and writing. Things I can do by myself, calmly, and generally anxiety-free. I already have most of the GE prerequisites from my community college, and I’d be able to finish sociology relatively quickly. I don’t know what I want to do after college, but a job involving helping others would be fulfilling. Might go onto get a CNA license, since I’d love to work in a hospital setting. \n\nFeels weird being a STEM drop out. Thoughts?",
  "author": "hetarae",
  "created": 1633382630,
  "updated": 1634084172,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hfem3pd": {
      "link": "/r/college/comments/q1fmbp/changed_majors_from_statistics_data_science_to/hfem3pd/",
      "text": "If you found something you like then good for you I really hope it works out for you",
      "author": "davvidho",
      "created": 1633383377,
      "upvotes": 2,
      "replies": {}
    },
    "hfepeh9": {
      "link": "/r/college/comments/q1fmbp/changed_majors_from_statistics_data_science_to/hfepeh9/",
      "text": "Lol yes a big L. What are you going to do with a sociology degree?",
      "author": "Old-Bird612",
      "created": 1633384662,
      "upvotes": 1,
      "replies": {}
    }
  }
}