{
  "sid": "qbzisr",
  "link": "/r/college/comments/qbzisr/i_think_my_roommate_might_be_trying_to_gaslight_me/",
  "title:": "I think my roommate might be trying to gaslight me…",
  "text": "My roommate has been telling me that I snore, apparently so loudly and powerfully that I wake him up several times throughout the night.  \n\nLet me say, i have **absolutely no history of snoring**.  None at all.  I didn’t snore at camp, i didn’t snore at home, i didn’t snore last year, and when i sleep over at my boyfriends or other friends, they told me after I asked that I don’t snore.  \n\nToday he told me that my snoring woke him up a couple times last night, including at 3 o’ clock, which I know is BS, because **i was still awake then** (and he was fast asleep).   He keeps telling me that he wants to record me while I sleep, which i’m definitely not comfortable with.\n\nWhat the hell am I supposed to do?",
  "author": "jolygoestoschool",
  "created": 1634732317,
  "updated": 1634750203,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.88,
  "comments": {
    "hhcpxbq": {
      "link": "/r/college/comments/qbzisr/i_think_my_roommate_might_be_trying_to_gaslight_me/hhcpxbq/",
      "text": "The obvious way to test this would be to download a free snore app. Charge your phone overnight and it will record any spikes in audio. When you rise out of bed, it should give you an overview.",
      "author": "123faur",
      "created": 1634732485,
      "upvotes": 35,
      "replies": {}
    },
    "hhct4y5": {
      "link": "/r/college/comments/qbzisr/i_think_my_roommate_might_be_trying_to_gaslight_me/hhct4y5/",
      "text": "In the grand scheme of things, it’s not that big of a deal. Record yourself if you want to, but it might be best to let this one go.",
      "author": "kmbell333",
      "created": 1634734246,
      "upvotes": 14,
      "replies": {}
    },
    "hhdbbgt": {
      "link": "/r/college/comments/qbzisr/i_think_my_roommate_might_be_trying_to_gaslight_me/hhdbbgt/",
      "text": "Tell him to get earplugs.\n\nAs the other chap commented so check  it out using the snoring app. But don't let him record you.\n\nThe whole let me record you while you're sleeping is super creepy",
      "author": "peterfun",
      "created": 1634742518,
      "upvotes": 7,
      "replies": {
        "hhdbe95": {
          "link": "/r/college/comments/qbzisr/i_think_my_roommate_might_be_trying_to_gaslight_me/hhdbe95/",
          "text": "Well interestingly he said he’s been using ear plugs but that its not enough.",
          "author": "jolygoestoschool",
          "created": 1634742551,
          "upvotes": 3,
          "replies": {
            "hhdc7jg": {
              "link": "/r/college/comments/qbzisr/i_think_my_roommate_might_be_trying_to_gaslight_me/hhdc7jg/",
              "text": "The app should give you an idea of he's being honest about this whole thing.\n\nIf you do really snore. There's some stuff you get to help with snoring(something worn while sleeping iirc) . Not sure if it's for sleep apnea or snoring but apparently it helps both the person who snores and others (it reduces it or something apparently). But it may require professional opinion.",
              "author": "peterfun",
              "created": 1634742890,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhd9jen": {
      "link": "/r/college/comments/qbzisr/i_think_my_roommate_might_be_trying_to_gaslight_me/hhd9jen/",
      "text": "You might snore or breathe really quietly but your roommate might just be a super light sleeper that the sound of someone else breathing wakes him up. \n\nAs for him saying you woke him up at 3 when you were up and he was asleep I have no idea that’s pretty odd.",
      "author": "ilikecacti2",
      "created": 1634741780,
      "upvotes": 3,
      "replies": {}
    },
    "hhdrp7g": {
      "link": "/r/college/comments/qbzisr/i_think_my_roommate_might_be_trying_to_gaslight_me/hhdrp7g/",
      "text": "Just speaking from my own experience, I'd be wary of this as a bad sign. I agree with others, download an app to see if you snore. It's not impossible that your sinuses have developed an issue you haven't yet noticed, or something. I was being abused at home and my abuser said I was always loud and would claim I was screaming when I was in my room silently writing essays. Later threatened to kill me and the biggest warning sign was that they created little problems and then gaslit me about it. Just be cautious and get a new roomie situation if it escalates in any way.",
      "author": "ShesAlex",
      "created": 1634749054,
      "upvotes": 1,
      "replies": {}
    },
    "hhdkl56": {
      "link": "/r/college/comments/qbzisr/i_think_my_roommate_might_be_trying_to_gaslight_me/hhdkl56/",
      "text": "IGNORE him. \nYou shouldn’t lose sleep over the comment. If you know that you don’t, move on. \n\nIt’s your roommates issue and not yours. \n\nSimply ask “Do you want to move to a different room?” \n\nBecause let’s say you do snore, what can you do? Nothing. \n\nPoint made.",
      "author": "VonVonVroom",
      "created": 1634746272,
      "upvotes": 1,
      "replies": {}
    },
    "hhdpqpp": {
      "link": "/r/college/comments/qbzisr/i_think_my_roommate_might_be_trying_to_gaslight_me/hhdpqpp/",
      "text": "Never sleep again ur a pos",
      "author": "Treat--14",
      "created": 1634748293,
      "upvotes": 1,
      "replies": {}
    }
  }
}