{
  "sid": "qlaiw4",
  "link": "/r/college/comments/qlaiw4/cheating_or_miracle/",
  "title:": "Cheating or miracle?",
  "text": "So while I was studying for my Calc II test a few hours before we take it in class, I get an announcement from our professor on our canvas page that he posted a pdf of our exam.  In a state of confusion and shock, I didn't know whether or not if this was real. I quickly checked our class group chat wondering if this might be the actual exam we will be taking in a few hours.  After a minute, the professor's post was quickly deleted without any further announcements making me think it was the actual exam that my not tech-savvy professor accidentally posted.  Can the students get in trouble for exploiting our professor's mistake?",
  "author": "SodaPop28",
  "created": 1635877096,
  "updated": 1635890397,
  "over_18": false,
  "upvotes": 22,
  "upvote_ratio": 1.0,
  "comments": {
    "hj1i99z": {
      "link": "/r/college/comments/qlaiw4/cheating_or_miracle/hj1i99z/",
      "text": "Lmao not unless they admit to it. He is responsible for making a new exam unless he wants to still use that one.",
      "author": "angstyart",
      "created": 1635877276,
      "upvotes": 23,
      "replies": {
        "hj1ivu7": {
          "link": "/r/college/comments/qlaiw4/cheating_or_miracle/hj1ivu7/",
          "text": "That’s what I’m thinking. There’s no way he’s gonna use the test he accidentally posted. I’m very sure he’s going to quickly make a new one making the old test simply practice",
          "author": "SodaPop28",
          "created": 1635877519,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hj1yidf": {
      "link": "/r/college/comments/qlaiw4/cheating_or_miracle/hj1yidf/",
      "text": "I'd be careful. Canvas shows the instructor who has accessed each assignment in the quiz log, along with other information. It sounds like only a few people had an opportunity to open the file, so if those people just so happen to ace the exam it may be a red flag.",
      "author": "ImpressiveBowler5574",
      "created": 1635883546,
      "upvotes": 1,
      "replies": {
        "hj2fgi5": {
          "link": "/r/college/comments/qlaiw4/cheating_or_miracle/hj2fgi5/",
          "text": "That's not any sort of cheating, and the students could not get in any trouble.",
          "author": "temsik1587againtwo",
          "created": 1635890020,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}