{"sid": "prj8vu", "link": "/r/college/comments/prj8vu/if_a_core_class_is_apart_of_your_major_does_that/", "title:": "If a core class is apart of your major, does that count as both a core class requirement and a major class requirement?", "text": "This is an oddly worded question, but felt general enough to ask here. I'm currently trying to break down all the course both required for my major and core classes. Looking over the core class options for each subject, I've found some courses over lap with the courses required in my major. Now obviously it's only a few specific courses, with there being plenty of other classes to take to fill said core class requirement besides the one that my major requires. That being said, does that mean I can take one of those overlapping classes and have it count as both a core class and a major requirement. Or do I have to simply pick another core class option for it to count as a core class requirement (so taking two different classes for separate requirements, or killing two birds with one stone for having both requirements done from one class) \n\nNot sure of how this might effect the whole course credit requirement situation. But just thought I'd ask.", "author": "Only_Chick_Who", "created": 1632095075, "retrieved": 1632801439, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hdleqac": {"link": "/r/college/comments/prj8vu/if_a_core_class_is_apart_of_your_major_does_that/hdleqac/", "text": "it does at my school, but you should double check with your advisor. might be different", "author": "watchgal1", "created": 1632148108, "upvotes": 1}, "hdj1d2i": {"link": "/r/college/comments/prj8vu/if_a_core_class_is_apart_of_your_major_does_that/hdj1d2i/", "text": "This is a question for an advisor as this may vary from school to school. At my school we have gen-eds and major classes. A gen-ed and a major class can overlap. So I'm a biochem major, my bio classes county as gen-ed science classes. However, gen-ed classes cannot overlap each other. Meaning a gen-ed diversity class can't also count as a global course. The exception is an intensively writing classes. But again ask your advisor as this is school specific.", "author": "noelblossom", "created": 1632095292, "upvotes": 5}}}