{
  "sid": "q6cg9h",
  "link": "/r/college/comments/q6cg9h/to_anyone_who_transferred_how_do_you_tell_your/",
  "title:": "To anyone who transferred: How do you tell your parents?",
  "text": "This may just be me but I parents love the school I currently attending to the point where they are talking about sending my sister there. However I am not enjoying it. I don’t know how to tell them because I usually bite the bullet with things, but this is like major so I have to eventually. This might seem stupid but I feel like they will get mad or something idk.",
  "author": "KillaClay",
  "created": 1634007306,
  "updated": 1634082959,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgb7uh2": {
      "link": "/r/college/comments/q6cg9h/to_anyone_who_transferred_how_do_you_tell_your/hgb7uh2/",
      "text": "Frame it with action “I know you have been excited for me to go to X university, but it doesn’t feel like the right fit. I’ve applied to and been accepted at Y university. They have a, b, c that offers me more opportunities. It does/does not affect my graduation date and is more/less expensive than X university. (If more show that you’re willing to help or take loans to pay for it).\n\nIt’s a big decision, but when it’s presented as a rational adult decision, it will all be okay. \n\nAlso if they object, don’t argue. Listen and tell them you’ll think about what they’ve said and give them a decision in x amount of time.\n\nEdit: missing parenthesis",
      "author": "MomfromAlderaan",
      "created": 1634008503,
      "upvotes": 3,
      "replies": {
        "hgblna0": {
          "link": "/r/college/comments/q6cg9h/to_anyone_who_transferred_how_do_you_tell_your/hgblna0/",
          "text": "You think I should just apply else where and wait to see if I’m accepted before telling them?",
          "author": "KillaClay",
          "created": 1634016235,
          "upvotes": 2,
          "replies": {
            "hge84de": {
              "link": "/r/college/comments/q6cg9h/to_anyone_who_transferred_how_do_you_tell_your/hge84de/",
              "text": "Yes, or have already submitted applications. It shows your motivation.",
              "author": "MomfromAlderaan",
              "created": 1634068669,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hgbll54": {
          "link": "/r/college/comments/q6cg9h/to_anyone_who_transferred_how_do_you_tell_your/hgbll54/",
          "text": "Thank you. This is well put.",
          "author": "KillaClay",
          "created": 1634016193,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}