{"sid": "ps6sgj", "link": "/r/college/comments/ps6sgj/difficult_first_exam_due_to_professors_broken/", "title:": "Difficult first exam due to professor's broken English, not sure what to do.", "text": "I'm a neuroscience major, I'm a sophomore and this is my first year on campus.\n\nI'm currently taking Neurology 101. My professor's first language is Spanish, and his accent is really thick. I have auditory processing issues which can make it very difficult for me to understand what he is saying during lectures. I tried recording using a transcription app I found so that I could read what he is saying, but it couldn't understand him either.\n\nI just took our first exam today, and it was rough to say the least. More than half of the questions just generally didn't make sense. A lot of the options for fill in the blank didn't fit grammatically, sentences were just overall very, very difficult to decipher. I'm very worried I'm going to get it back with a terrible grade due to this. I take my exams in a different building so that I can have a distraction reduced environment as well as time and a half on all exams, so I can't ask him directly to clarify what a question means.\n\nI checked and the only other NEURO 101 class is online asynchronous, and I really struggled with asynchronous classes last year, so I'd prefer not to do that. But I also don't want to fail an intro class to my major. I love neuroscience, but this class is making me second guess myself.\n\nIs there anything I can do to make this easier? He doesn't seem to teach much from the book, and his PowerPoint presentations only give so much information. Most is just from what he says in class.", "author": "serpentheo", "created": 1632181682, "retrieved": 1632801001, "over_18": false, "upvotes": 13, "upvote_ratio": 0.93, "comments": {"hdqxv74": {"link": "/r/college/comments/ps6sgj/difficult_first_exam_due_to_professors_broken/hdqxv74/", "text": "Are you working with an Office of Accessibility?  Because if you are (and from the accommodations on exams, it sounds like you are) bring the test to whomever in the office you work with.  Explain the (many!) things you have done to solve the problem on your own.\n\nThings they might do:\n\n1. Provide someone to assist while you take exams\n2. Provide you with a note-taker (I have had these in my classes)\n3. Tell the professor to get his shit together.\n\nYou should not change what you love doing because a professor is confusing.  You need to enlist some help.", "author": "emarcomd", "created": 1632248646, "upvotes": 2}, "hdot5e7": {"link": "/r/college/comments/ps6sgj/difficult_first_exam_due_to_professors_broken/hdot5e7/", "text": "In my freshman year, I walked into my Calc I class with about 250 other people on the first day. The professor had a really thick Indian accent and, by about the halfway mark of that class, we were down to probably 15. I left at 4, still having zero idea what was being taught. Don't try to power your way through this.", "author": "Mammoth-Title-2102", "created": 1632204689, "upvotes": 2}, "hdoax7y": {"link": "/r/college/comments/ps6sgj/difficult_first_exam_due_to_professors_broken/hdoax7y/", "text": "talk to someone. talk to your advisor, the chair or anyone really. if a test isn’t grammatically correct or is hard to understand then it’s absolutely not your fault. honestly if you took the async class at least you would be able to understand all the questions and probably the course material. also from personal experience my async classes were good because you could set up office hours with the professor just in case you had any questions. at least your teacher would be coherent and you would be able to understand all the material. i understand not wanting to take an async class though, but i would rather deal with that than go through grammatically incorrect tests.", "author": "anonymous25635", "created": 1632193339, "upvotes": 3}}}