{
  "sid": "q0oup3",
  "link": "/r/college/comments/q0oup3/looks_like_it_would_be_nearly_impossible_for_me/",
  "title:": "Looks like it would be nearly impossible for me to raise my GPA this semester since my workload is really heavy and classes are very difficult",
  "text": "Considering I barely passed summer semester with embarassingly terrible grades (which was only 2 months long and exams are on campus and were binary  multiple choice question meaning no partial grades so you either know it  or you don't and there is no close in science) are as follows: \n\n \n\nCourse Code                      Course                    Grade Letter      Number Grade     Credits\n\nEENG350                      Electronics I                     D+                       69%                       3\n\nEENG350L                    Electronics I Lab              B                         80%                       1\n\nCENG380                      Microprocessors             C                         74%                       3\n\nCENG352L                    Digital Logic Lab             B                          82%                      1\n\nEENG385                      Signal Processing           C+                        75%                      3\n\nEENG388                      Electromagnetics            D                         60%                      3\n\nTotal Credits                   14 Credits\n\nSemester GPA 2.1\n\nCGPA 2.91\n\nMy Schedule for Fall Semetser:\n\n&#x200B;\n\nCourse Code                      Course                               Credits\n\nEENG400                     Electronics II                                3\n\nEENG400L                   Electronics II Lab                         1\n\nEENG410                     Power Electronics                        3\n\nEENG410L                   Power Electronics Lab                1\n\nEENG435                     Control Systems                           3\n\nEENG435L                   Control Systems Lab                   1\n\nEENG447                     Analog Communications            3\n\nEENG467L                   Analog Communications Lab     1\n\nCENG430L                  Linux Lab (Raspberry Pi)               1\n\nTotal Credits    18 \n\nLabs are 1 credit but each prelab takes on average of 4 hours of work, and I have 6 labs so 6 lab reports per week, and that's not considering lectures and preparing the material for the regular course which are extremely difficult.\n\nI know I must raise my CGPA to at least 3.0 in order to make it easier for me to get a first job as well as apply to grad schools overseas. I aim to get A's preferrably at worst B. I also have another problem I am not really smart and not a bright student and I tend to be pretty excited at the begining of the semester but I lose interest quickly and I felt burnt out after thinking I did great in my midterms during summer semester when my actual grades were 66, 65, 61, and 80, and made me question my choice of this major and should have done compsci because they have far less bullshit.\n\nIf u have taken a heavy workload of difficult classes what did you do to achieve good grades? And how did you manage your time\n\nPS: Classes are online and so are labs for now but exams will be on campus and we don't have any office hours or counselors or any extracredit and most likely only midterm weighing 45% & final weighing 55% of the resultant grade.",
  "author": "ENTP_AnarchoEgoist",
  "created": 1633289325,
  "updated": 1634089633,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hf9wsh5": {
      "link": "/r/college/comments/q0oup3/looks_like_it_would_be_nearly_impossible_for_me/hf9wsh5/",
      "text": "Yikes\n\nIt's okay if your GPA isn't the greatest, instead focus on trying to master the material. If employers want a higher GPA pad it up with easy A classes.\n\nIf you bomb a test make sure you go over the parts that caused you to bomb so that you learn from it.\n\nEdit: I'll recommend you take less classes at once. I'll recommend instead of taking a bunch of hard classes in one semester mix up the hard classes with easy A classes that could pad your GPA.",
      "author": "malarkeyasian",
      "created": 1633296134,
      "upvotes": 1,
      "replies": {}
    }
  }
}