{
  "sid": "q6bcpl",
  "link": "/r/college/comments/q6bcpl/help_how_do_i_not_stress_about_the_amount_of_math/",
  "title:": "Help! How do I not stress about the amount of math that I need to do in college?",
  "text": "I'm a freshman in college majoring in mechanical engineering. I need to go up to calculus 3 and I'm kind of scared. I want to do good in college, and I'm doing good in all of my classes...except for calculus one. I mean, I did terrible on the first test, but so did everyone else too. The average was 46 put of 100 on the first midterm, which does make me feel a bit better because it shows that I'm not the only one struggling. \n\nI want to do good, because I want to be happy and not have to constantly be stressed about passing my class. I'm not really worried about it affecting my future because I know that it's not the kind of math I'm going to be using. My dad was very involved with engineering his whole life and he told me that none of that math is even used and that all of the work is done on computers anyways. Even my mechanical engineering classes use the simplest of math.\n\nBut...It nearly put me into a depression of constant stress and anxiety when I got over my college honeymoon phase. I could barely focus on my other class, my friends, myself. I was constantly on the verge of tears because of my worries. I tried looking up stuff about it to make me feel better, but instead I was getting the idea that I needed to constantly kill myself and do math just to do really good in the class. But why am I paying for college just so that I can spend my free time (that I feel like I barely have) teaching myself how to do something my teacher is supposed to teach me?\n\nI just want to be reassured that it will be okay and that I dont need to be perfect or overwork and stress myself to pass my classes. That it's okay to pass with a C. That everyone goes through the same thing and that's its very possible to do it without spending all your time on it and ruining your mental health.\n\nMy brother says that engineers all get past their college with c's...and that makes me feel a bit better.",
  "author": "PinkLovlipop",
  "created": 1634003640,
  "updated": 1634082783,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hgb0whk": {
      "link": "/r/college/comments/q6bcpl/help_how_do_i_not_stress_about_the_amount_of_math/hgb0whk/",
      "text": "I was always above average at math, but not even by much. In high school I averaged a B- or B, with the occasional B+. In college that pretty much became a C- to B- on average. My only real advice is to pick a major with less math. There are majors with lots of math but it’s simple math and there are majors with lots of math but it’s advanced topics. Find majors where the math classes are like: statistics I and applied calculus I(or it could be business calculus I) as the highest levels of math.\n\nIf you’re dead set on a major, then just do your best, there’s no avoiding it. Engineering will always be very hard mathematically and from what I’ve seen, fail rates are 40-60% for calculus 1-3(D’s included since they don’t usually count either)",
      "author": "evasiveshag",
      "created": 1634005314,
      "upvotes": 2,
      "replies": {}
    },
    "hgax6f0": {
      "link": "/r/college/comments/q6bcpl/help_how_do_i_not_stress_about_the_amount_of_math/hgax6f0/",
      "text": "\nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nhttps://suicidepreventionlifeline.org",
      "author": "hotlinehelpbot",
      "created": 1634003652,
      "upvotes": 2,
      "replies": {}
    }
  }
}