{
  "sid": "qrlc6j",
  "link": "/r/college/comments/qrlc6j/im_still_going_to_fail_this_class_no_matter_how/",
  "title:": "I'm still going to fail this class no matter how hard I try",
  "text": "I'm so overwhelmed. I've never studied so hard for a class before and I've never had such awful results. In each test I get worse grades than I did in the previous one. I've tried everything, I can't bring myself to try any longer. There is one last test to do, I need 6 points in it; I got 4.9 in the first test and 3.7 in the second. The content of this last test is going to be even harder than the previous ones, there's no way I'm getting a 6. At least this is what goes on and on in my mind, I've lost trust in my capability and because of that I can't properly study.\n\nThe students' mean in this class is 3. How in the world are we supposed to pass? Never in my life have I had class with such an indifferent professor, most of us are going to fail in one of the most important classes of our major (it is literally the base of everything we are yet to learn).\n\nI want to be my old motivated self again but I don't know how. I just wanted some good news for once. Have you ever felt this way? (not a native English speaker)",
  "author": "Alf_Zion",
  "created": 1636637375,
  "updated": 1636654768,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk7bpcs": {
      "link": "/r/college/comments/qrlc6j/im_still_going_to_fail_this_class_no_matter_how/hk7bpcs/",
      "text": "Is it possible for you to withdraw from one of your classes. Maybe you're overburdened with your workload.",
      "author": "MansaMusa333",
      "created": 1636639531,
      "upvotes": 2,
      "replies": {
        "hk7cczl": {
          "link": "/r/college/comments/qrlc6j/im_still_going_to_fail_this_class_no_matter_how/hk7cczl/",
          "text": "It is possible, but we had a deadline to do so and I didn't withdraw then, I thought I could handle it :/",
          "author": "Alf_Zion",
          "created": 1636639843,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}