{
  "sid": "q9v8g8",
  "link": "/r/college/comments/q9v8g8/dont_know_if_i_am_ready/",
  "title:": "Don't know if I am ready",
  "text": "I will start this off by saying I am 18F and doing a lap year (grade 13). I went back for an extra year to take some extra classes I was interested in to find what I am passionate about, boost my average, gain some good studying habits (quit procrastinating) and overall become more mature before heading into university.\n\nFor most of my life, my grades have been semi adequate (60-80's). I moved around a lot as a kid and jumped from school to school - finally settling down in a city a couple of years before I went into secondary school. From there teachers advised me to take \"low level\" classes as I was maintaining a C average in grade 8. And that's what I did. My grades got higher the more interested I was in the class and I ended up switching from those \"low level\" classes to academic ones (as I started to do fewer mandatory courses and ones I actually enjoyed) during the end of my grade 10th year. So far my grades have been as low as 85 and as high as 99 (w/ an average of 92 and making honour roll). I will say this - I believe those marks to be undeserved in a way? Of course, I did the work, and at times went the extra mile for projects I was passionate about. Although I never truly got into the habit of studying frequently, I would usually never do homework daily and would most often study on the bus ride to school on a test day. A lot of these classes came very easy to me and since I kept getting high marks I never found a reason to try even harder. \n\nWith applications coming up soon I am starting to second guess going next fall. It's a big fear of mine to start uni only to have it hit me like a truck because I slacked off now. Of course, I know that the transition may always be difficult - I don't want it any worse than it needs to be\nIt's also important to note I work about 30 hours a week doing nightshift at a retirement home. Its sometimes difficult to work all night only to start school right after. Although I only go for a few hours (I only have two classes this sem, next sem I have full classes). I have a really really good job with very good pay for someone my age and I am trying to take advantage and save up for school. I recently got my inheritance (30K) and it has just made me realize that maybe I *really* should continue working here an extra year to save up even more before I move away for school. Especially if I want a car.\n\nAnyways, with applications coming up soon I am starting to second guess going next fall. It's a big fear of mine to start uni only to have it hit me like a truck because I slacked off now. Of course I know that the transition may always be difficult - I don't want it any worse than it needs to be.\n\nSome parts of me do really want to go next fall, I already feel like I am missing out watching all my other friends my age get the \"university experience\" and I really would like some of my own independence by living on my own. \nMaybe next sem I will do better? As I will be working a lot less? Don't know. Someone give me an opinion please - don't have many to discuss this with",
  "author": "milkbaggg",
  "created": 1634461851,
  "updated": 1634654843,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgztaov": {
      "link": "/r/college/comments/q9v8g8/dont_know_if_i_am_ready/hgztaov/",
      "text": "If you don't go to college, what will you be doing?\n\nDr. Grandpa",
      "author": "FreeThinkingGrandpa",
      "created": 1634484890,
      "upvotes": -1,
      "replies": {
        "hgzuiq3": {
          "link": "/r/college/comments/q9v8g8/dont_know_if_i_am_ready/hgzuiq3/",
          "text": "If i do not go to university in the fall i would be working full time to save up until i believe i am ready to go (hopefully 2023)",
          "author": "milkbaggg",
          "created": 1634485424,
          "upvotes": 1,
          "replies": {
            "hgzv6oq": {
              "link": "/r/college/comments/q9v8g8/dont_know_if_i_am_ready/hgzv6oq/",
              "text": "Okay, well you have a plan so that is a great first step.",
              "author": "FreeThinkingGrandpa",
              "created": 1634485712,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hgzune0": {
          "link": "/r/college/comments/q9v8g8/dont_know_if_i_am_ready/hgzune0/",
          "text": "i work as a UCP and a PSW with forty-ish residents.",
          "author": "milkbaggg",
          "created": 1634485481,
          "upvotes": 1,
          "replies": {
            "hgzusd1": {
              "link": "/r/college/comments/q9v8g8/dont_know_if_i_am_ready/hgzusd1/",
              "text": "Okay, well you've got a plan so that is good.",
              "author": "FreeThinkingGrandpa",
              "created": 1634485542,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}