{
  "sid": "ps9882",
  "link": "/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/",
  "title:": "I feel that I lost my chance with my major",
  "text": "I'm a student, currently at my third semester at my local community college. My major is computer science and I feel hopeless with it. I'm in my third computer science class and I'm still so confused with the topic and rely heavily on my friend to help me out with the exercises. I am also taking calculus 1 for the third time because the last two times, I failed. I did talk with my advisor last semester and asked the possibility of switching my major to CIS which seemed suited for me, however my advisor told me that most of my credits wouldn't transfer and I would graduate late. I was okay with that but the major problem that was blocking was money. I unfortunately am not eligible for financial aid and my mom is the one who paying my tuition in full. I really think I screwed up my options choosing this major and that I'm in this deep hole that I can't get out of. I am so anxious to think that I won't even graduate and be a disappointment to my mother. I don't know what to really do besides try my hardest and pass my classes.",
  "author": "Wheetos-",
  "created": 1632190224,
  "over_18": false,
  "upvotes": 34,
  "upvote_ratio": 1.0,
  "comments": {
    "hdq4maa": {
      "link": "/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/hdq4maa/",
      "text": "Hi! I was also a failed computer science major. I went into it wanting to program video games since I love video games so much, but I was bad at it, and I HATED doing any of the work and I didn’t understand anything that was going on. I always had to have my ex boyfriend help me because he was so good at it and I was not. During this summer before the fall semester, I had a mental breakdown at work because I realized out of nowhere that this wasn’t what I wanted to do, and now I’m a physics and biochem double major. If you’re not happy with it, then switch. I get the whole wasting your mom’s money sucks, but it’s better to switch now than waste more money, or be stuck in a field for the rest of your life that makes you feel miserable.",
      "author": "Jaded-Reporter",
      "created": 1632236642,
      "upvotes": 2,
      "replies": {}
    },
    "hdoqp3u": {
      "link": "/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/hdoqp3u/",
      "text": "Switch while it is early. Saying this as a CIS student.",
      "author": "1jay_y",
      "created": 1632202877,
      "upvotes": 2,
      "replies": {}
    },
    "hdoa245": {
      "link": "/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/hdoa245/",
      "text": "As a failed computer science/cybersecurity major, I can relate to your predicament.\n\n I was so bad at coding that after the 3rd week of classes I would pay indian people on Fiverr to code my hw for me. It got expensive really fast and didn't help my situation. I was delaying the inevitable.\n\nWhy did you choose this major? Because you like computers? You can still stay within the IT field.\n\nIf you hate what you're doing and you think you're going to fail, you're better off cutting your loses and making a new plan.",
      "author": "ggggfdddr",
      "created": 1632192913,
      "upvotes": 28,
      "replies": {
        "hdodw2t": {
          "link": "/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/hdodw2t/",
          "text": "Good advice here, OP. You need to quit before you make matters worse for yourself and your mom. Wasting money sucks, but if you're mom loves you and prioritizes your happiness, then she should understand. \n\nIf you're not eligible for financial aid, and your mom isn't willing to continue paying tuition if you decide to quit and change majors, your next option is to find work and self-pay. \n\nCountless college students regret their choices and eventually find what they enjoy. I'm on my fourth major change, and I'm 24. It's debilitating but I've pushed through regardless of setbacks and I believe I've finally found my area of interest.",
          "author": "Elyktronix",
          "created": 1632194885,
          "upvotes": 10,
          "replies": {
            "hdpetel": {
              "link": "/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/hdpetel/",
              "text": "I have tried to mention the idea of switching majors to my mother. Last semester when I went ahead to talk with my advisor, I was talking with my mother and dropped the idea of switching majors because I found the coursework to be difficult for me and she got very upset at the idea. She was asking if she wasted her money for nothing? It doesn’t help she’s working a lot because of me and I feel guilty for essentially wasting her money for a major I don’t seem interested in. I know too, that delaying the inevitable is worse but I feel so lost here. I’m too scared to talk with my mother about the subject.",
              "author": "Wheetos-",
              "created": 1632223678,
              "upvotes": 3,
              "replies": {
                "hdpk0dc": {
                  "link": "/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/hdpk0dc/",
                  "text": "Sorry to hear that. I don't blame her for being upset. Any parent would be if they found out their hard-earned money was going nowhere useful. I can empathize. My deceased great-grandmother left me $10k for college and I ended up wasting it away pursuing a two majors that I ended up hating. So needless to say some people were upset. But the important thing is dwelling on past mistakes of your children isn't something your mom needs to be doing. \n\nShe will have to accept that you're not happy and money isn't everything in this situation. You need to sit down and have a serious talk with her because she will only become more upset the longer you drag this out. If you tell her how deeply sorry you are and that you desperately just want to make things right, the last thing she should view you as is a disappointment. You have nothing to be ashamed or feel guilty of. You're a reasonable person who has realized he's unhappy so logically you're making it a priority to fix that. \n\nShit happens and the best thing you two can do is work through this hardship together. And, ultimately, it's your life, not hers. She can't dictate your choices. You do you. Best of luck to you OP.",
                  "author": "Elyktronix",
                  "created": 1632226908,
                  "upvotes": 3,
                  "replies": {}
                },
                "hdqyfej": {
                  "link": "/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/hdqyfej/",
                  "text": "Hey. A mom here. You do NOT need her okay. Make the change you need to make. Tell her you got what you could put of those years and part of what you learned is that you chose a major you don't actually have the ability to complete. Tell her that you don't want to waste more of her money than you already have, and that that's what would happen.\n\nYou can prepare for this in a couple of ways. Work with your career centre and academic advisors to find a major that fits your abilities better and that still has a good future. Have that info to present if you need to. Your mom might have a limited or outdated idea of what's out there. Talk with your institution's financial advisors about what happens in the worst case that your mom decides not to pay your way.\n\nBut this is your life, not hers. Most parents adjust to changes their now adult children make. Your mom most likely will.",
                  "author": "ResidentNo11",
                  "created": 1632248880,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hdo5rkp": {
      "link": "/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/hdo5rkp/",
      "text": "Remindme! 1 day",
      "author": "ENTROPY501",
      "created": 1632190896,
      "upvotes": 2,
      "replies": {
        "hdo5v2e": {
          "link": "/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/hdo5v2e/",
          "text": "I will be messaging you in 1 day on [**2021-09-22 02:21:36 UTC**](http://www.wolframalpha.com/input/?i=2021-09-22%2002:21:36%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/college/comments/ps9882/i_feel_that_i_lost_my_chance_with_my_major/hdo5rkp/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fcollege%2Fcomments%2Fps9882%2Fi_feel_that_i_lost_my_chance_with_my_major%2Fhdo5rkp%2F%5D%0A%0ARemindMe%21%202021-09-22%2002%3A21%3A36%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ps9882)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "author": "RemindMeBot",
          "created": 1632190942,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634056132
}