{
  "sid": "q71aem",
  "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/",
  "title:": "Turn It In said I plagiarized… But I didn’t",
  "text": "Apparently I “plagiarized” about 65% of a bio lab report that I definitely wrote all by myself. My TA gave me a 0 but did give me the option of redoing the assignment in 24 hours. \n\nI am apparently at risk of getting reported to the university. My grade dropped a horrific amount. I’m pretty much being called a liar and a cheat. \n\nHappened to anyone else? I literally cried when my TA told me. This is my 3rd year at college and nothing like this has ever happened to me.",
  "author": "Lividhounddog",
  "created": 1634091169,
  "updated": 1634167511,
  "over_18": false,
  "upvotes": 177,
  "upvote_ratio": 1.0,
  "comments": {
    "hgfomrg": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgfomrg/",
      "text": "65% is pretty high to be a false positive. Did you properly cite everything you needed to?",
      "author": "mrbmi513",
      "created": 1634091938,
      "upvotes": 177,
      "replies": {
        "hgfpkxz": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgfpkxz/",
          "text": "Yep, all from peer reviewed sources. I don’t have a clue how this happened. Its a pretty easy class, there’s not even a “good” reason to cheat.",
          "author": "Lividhounddog",
          "created": 1634092397,
          "upvotes": 119,
          "replies": {
            "hgfqoe0": {
              "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgfqoe0/",
              "text": "Ask your TA what went wrong. There's a decent chance they didn't even look at the paper because of having that high of a similarity score.",
              "author": "mrbmi513",
              "created": 1634092925,
              "upvotes": 147,
              "replies": {}
            }
          }
        }
      }
    },
    "hgfy090": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgfy090/",
      "text": "One of the times I turned in a paper it had like 99% plagiarism flagged but that’s because I accidentally turned in the paper twice. Idk if you have the option but see if you can find where the commonalities originated",
      "author": "datesaremyfave",
      "created": 1634096703,
      "upvotes": 127,
      "replies": {
        "hgiu8hg": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgiu8hg/",
          "text": "I was going to say something similar to this. Our midterm was based on essay questions that were very similar to our discussion forum questions so it’s easy to plagiarize your previous work.",
          "author": "LatinaPumpkina",
          "created": 1634154263,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hggxxuu": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hggxxuu/",
      "text": "You should look at your TurnItIn report and probably have your professor look over it. There's a huge difference between it saying that 65% is plagiarized, but from 50 different sources vs. 65% plagiarized from one or two sources. One is legitimate plagiarism, the other is likely a mistake made by TurnItIn. TurnItIn will literally flag your citations and properly cited quotes. It will also often flag common phrases. It's a very simple software and doesn't know how to check for anything other than \"does this match?\"\n\nEdit: Since you turned it in to TurnItIn, you should be able to view the report somewhere. It's usually where you submitted it, or under the grades section of Canvas/Blackboard.",
      "author": "4BlackHeart4",
      "created": 1634124118,
      "upvotes": 94,
      "replies": {
        "hgi0f8k": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgi0f8k/",
          "text": "TurnItIn use to always flag my last name.",
          "author": "Minimum-Speaker-1223",
          "created": 1634142376,
          "upvotes": 24,
          "replies": {
            "hgihej1": {
              "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgihej1/",
              "text": "It flags my name too, because apparently I've plagiarized my own name from previous papers I've turned in.\n\nDoesn't matter though, the highest plagiarism% I've ever gotten was like 2%",
              "author": "SuiDyed",
              "created": 1634149084,
              "upvotes": 14,
              "replies": {}
            }
          }
        }
      }
    },
    "hgfyggv": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgfyggv/",
      "text": "If you have proper citations, then it's time to have a talk with your TA. If your TA refuses to budge, go over his head and go to the professor. If your professor refuses to intervene, go over his head. If you followed the proper formatting and gave credit where credit is due, there is no reason why you should suffer for it.\n\nTurnitin is a pretty bad standard to follow in terms of judging plagiarism, it saves thousands and thousands and tens of thousands of papers and it is 100% guaranteed that at some point, at least one other person wrote a paper on the same topic as you with the same ideas you had. There is always going to be a high degree of similarity. All of my papers that have had large amounts of citations have had high percentage similarities through Turnitin.",
      "author": "YouBoreMeHard",
      "created": 1634096946,
      "upvotes": 143,
      "replies": {}
    },
    "hggookk": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hggookk/",
      "text": "Turnit in scares the shit out of me as a first year undergrad. I purposefully look at absolutely nothing when I am analyzing a text as plagiarism anxiety floods every cell in my body. I find it almost impossible that 85% of the connections I will make at my level haven't been said before in a paper. I never check though, so maybe I would surprise myself with my own originality if I did. All I will say is, If you cited correctly, fight it tooth and nail. Modern University has to understand that Turnitin has its limitations.",
      "author": "Harnne",
      "created": 1634116658,
      "upvotes": 61,
      "replies": {
        "hgikntb": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgikntb/",
          "text": "I am a second year grad student and it also terrifies me, especially when I have to cite myself.",
          "author": "CrispyToasty98",
          "created": 1634150402,
          "upvotes": 7,
          "replies": {}
        },
        "hgj3x57": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgj3x57/",
          "text": "Yes! It is a ridiculous and draconian system. Also the AI is dumb and most AI is dumb just look at safety filters and all kinds of things that go awry because ultimately human judgment is best.",
          "author": "comfort_fiend",
          "created": 1634158216,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hggzhgd": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hggzhgd/",
      "text": "Check with your TA. These websites suck at actually detecting plagiarism. My psych teacher had to completely stop using it because every student got about 10-15 “flags” per chapter review sheet. (5-6 were his own questions & the other ones were basic facts and definitions, even if the words were in a different order). \n\n* I once reworded a definition, but since I still had enough “common words” like THE, A, BRAIN & PAVLOV I got flagged.",
      "author": "TheGR8HoytNerd",
      "created": 1634125170,
      "upvotes": 18,
      "replies": {}
    },
    "hgghm4x": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgghm4x/",
      "text": "Hey, I'm the senior writing coach at my university's writing center. Turnitin is horrible and really only works to catch those who completely copy and paste their work. Chances are your TA is an overworked grad student who didn't fully look at your lab report. Email a copy of the exact file you uploaded to turnitin to both your TA and your professor and explain the situation fully. You may also want to reach out to your university's writing lab for advice.\n\nI know this is stressful, but just remember that you didn't do anything wrong. You may also want to ask your TA to show you the specific parts that are plagiarized. It may just be a coincidence, or something slightly off in your citations. Hopefully this will resolve any confusion. If they still push the issue, and cannot prove that you plagiarized, then you can and should go to your administration. At that point you are completely in the right, and have university policy on your side.\n\nI see this issue happen more often than you would think. It is usually resolved pretty smoothly",
      "author": "shelbylomo",
      "created": 1634110059,
      "upvotes": 39,
      "replies": {}
    },
    "hgg66mw": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgg66mw/",
      "text": "Talk to your ta, talk to the professor. Don't let this slide. You didn't do anything wrong so don't take the punishment for a crime you didn't commit.",
      "author": "GeneticHero",
      "created": 1634101354,
      "upvotes": 20,
      "replies": {}
    },
    "hgfrr4f": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgfrr4f/",
      "text": "Did you share your work with another student? If they copied sections of your stuff and turned it in before you that'd explain it. Unfortunately you'd both still be on the hook for cheating.",
      "author": "ossmeier",
      "created": 1634093457,
      "upvotes": 18,
      "replies": {
        "hghgsvu": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hghgsvu/",
          "text": "This happened to me once. We were doing a group lab assignment, but one that had an individual portion in addition to the group work. I accidentally left the sharing on with my group in google drive when someone offered to print my rough draft for me, and one of the group mates copied and pasted my work word for word. I got called in for cheating and explained I hadnt intentionally shared my work with anyone, then we looked through the edits and found what happened. I wasnt in trouble luckily. This was a friggin freshman chem lab. Not some high level report or anything. They take cheating seriously even if you’re not the one who did it.",
          "author": "Pyro-Millie",
          "created": 1634134299,
          "upvotes": 9,
          "replies": {}
        },
        "hgfsw57": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgfsw57/",
          "text": "Nope. I literally did it alone.",
          "author": "Lividhounddog",
          "created": 1634094034,
          "upvotes": 8,
          "replies": {}
        },
        "hgfs3vn": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgfs3vn/",
          "text": "thisssssss!!! in university i really really would refrain from showing any of ur classmates ur work",
          "author": "stressinglucy",
          "created": 1634093633,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "hghkf8v": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hghkf8v/",
      "text": "I've seen this with jargon and phrase heavy fields. If you're writing a paper about something that has a niche language and lots of 3-4 word coined terms, it can pop as plagiarized. I would look at the report and see exactly what got hit. Plagiarized papers are usually whole sentences or whole paragraphs lifted. If it's 3-4 word combos that are part of the class lexicon, that should be discernible.",
      "author": "SemanticBattle",
      "created": 1634135840,
      "upvotes": 5,
      "replies": {}
    },
    "hghs13w": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hghs13w/",
      "text": "I had that happen— it turned out that I had plagiarized my own rough draft that I had submitted for a progress review. \n\nAgree with the other comments— ask the TA to show you what was plagiarized.",
      "author": "cas47",
      "created": 1634138937,
      "upvotes": 5,
      "replies": {}
    },
    "hggfk2z": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hggfk2z/",
      "text": "Regardless of whether you cited them correctly or not.. how much of your paper was direct quotes from another source? Even if it's quotation marks with in text citation and a works cited page. How many quotes did you use and how long were they?",
      "author": "Britty_LS",
      "created": 1634108293,
      "upvotes": 13,
      "replies": {
        "hggx9xr": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hggx9xr/",
          "text": "I only have two citations, neither are full sentences either.",
          "author": "Lividhounddog",
          "created": 1634123650,
          "upvotes": 4,
          "replies": {
            "hghc2pg": {
              "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hghc2pg/",
              "text": "I don't know then :( did you run your essay through some sort of website that checks for errors or something? They may have stolen it",
              "author": "Britty_LS",
              "created": 1634132144,
              "upvotes": 3,
              "replies": {}
            },
            "hgjo0p3": {
              "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgjo0p3/",
              "text": "On turnitin, under assignments or grades or something, you should be able to open the report and see what it’s saying is plagiarized and from what sources. This may help you explain things to your TA/professor.",
              "author": "m-is-for-music",
              "created": 1634167055,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hggohp7": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hggohp7/",
          "text": "Yeah I was thinking about this. I try to paraphrase and parenthetically cite as much as possible when I’m taking a lot of information directly from other sources. It’s about synthesizing the information from multiple sources and integrating it into the paper.",
          "author": "roganwriter",
          "created": 1634116480,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgi95dh": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgi95dh/",
      "text": "Email your TA. TurnItIn plagiarism checking is absolutely useless. I once got flagged for a completely original sentence that just happened to be generic enough that it was used in some report from the 1960s that had nothing to do with my topic and that I had no access to whatsoever. I've also been flagged for the use of single words and 2-4 word phrases that aren't nearly enough to determine plagiarism. In fact, my entire works cited page was marked as plagiarized somehow, probably because my sources were used in other papers and the TurnItIn algorithm is just too useless to understand what citations are. And of course, all my quotes (with proper in-text citations and citations in my works cited list) were flagged as plagiarized.\n\nIf you're able to view the plagiarism report, see what it flagged. It's likely that the TA didn't even look at your paper and just assumed the plagiarism checker was correct, when there are likely plenty of things marked as plagiarized that are just wrong.",
      "author": "para_lyzed",
      "created": 1634145857,
      "upvotes": 4,
      "replies": {}
    },
    "hghh9nr": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hghh9nr/",
      "text": "Check what's marked as plagiarism in your report. Compare your work with other sources. It should be pretty easy to demonstrate that you didn't plagiarize anything if you didn't plagiarize anything.",
      "author": "temsik1587againtwo",
      "created": 1634134503,
      "upvotes": 3,
      "replies": {}
    },
    "hgid9yy": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgid9yy/",
      "text": "Ya know, so many papers get written nowadays. I find it almost impossible that there won’t be papers that are somewhat identical without legitimate plagiarism. Imo, it’s possible you wrote something similar without realizing. Possibly a fluke. Have your argument ready, I say.",
      "author": "homieisgenderneutral",
      "created": 1634147425,
      "upvotes": 3,
      "replies": {
        "hgjo7ul": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgjo7ul/",
          "text": "This. And OP is in an intro level lab, so that’s likely a pretty large class all writing about the same basic concepts, possibly from the same sources.",
          "author": "m-is-for-music",
          "created": 1634167147,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hggql73": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hggql73/",
      "text": "Why don’t you check what’s highlighted? It usually gives you the source where the checker has found possible plagiarism from, that’s your first step. My university lets us submit to turnitin and check for plagiarism before the actual due date though, im not sure if all universities are the same",
      "author": "Brain-pain369",
      "created": 1634118381,
      "upvotes": 5,
      "replies": {}
    },
    "hghrj6x": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hghrj6x/",
      "text": "Turn it in is such useless horseshit",
      "author": "Cannapsilo",
      "created": 1634138736,
      "upvotes": 2,
      "replies": {}
    },
    "hgijxo5": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgijxo5/",
      "text": "i don’t trust turn it in. Once it said i plagiarized my own name which was at the top of the paper",
      "author": "Specialist_Ad9987",
      "created": 1634150106,
      "upvotes": 2,
      "replies": {}
    },
    "hgj9zfa": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgj9zfa/",
      "text": "Are there graphs/tables on the report that could be similar to something that came from a lab manual? One of my TAs last semester told me that Turnitin will flag for plagiarism if you use a graph or table straight out of somewhere",
      "author": "Able_Succotash_8914",
      "created": 1634160770,
      "upvotes": 1,
      "replies": {}
    },
    "hggo4s0": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hggo4s0/",
      "text": "A lab report is not supposed to be 65% quotations or citations.\n\nGo to the TA and find out what the problem is.\n\nIf you have a problem fix it and re-do the assignment and you have no more problem.\n\nIf you don’t have a problem the TA is obviously being flexible with the allowing a resubmission so if you can defend yourself it should get resolved.\n\nIf not you can go to the professor.",
      "author": "PersephoneIsNotHome",
      "created": 1634116132,
      "upvotes": 3,
      "replies": {}
    },
    "hgjotsn": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgjotsn/",
      "text": "God, turnitin is THE WORST. Universities really need to stop using it. It will flag quotes for plagiarism even if they’re cited parenthetically. It will also flag works cited if someone else used the same sources, and if you had to turn in any kind of rough draft, it will say you plagiarized yourself. Not to mention you said you’re in an intro level lab, so that’s likely a big class using the same sources to write about the same general topics.\n\nI’m sorry you’re going through this, OP, it sounds super stressful. There’s some great advice on this thread, hopefully it’ll help. Good luck!",
      "author": "m-is-for-music",
      "created": 1634167439,
      "upvotes": 1,
      "replies": {}
    },
    "hgg2lu4": {
      "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hgg2lu4/",
      "text": "Turnitin is not a plagiarism checker, it only checks for textual similarities between your submission and existing work. It's quite possible to have a high score like that if you added stuff like the problem statements or questions in your lab report.\n\nWhy did you cry? You didn't steal anything as you have mentioned. Is someone actually accusing you of cheating or are you just making that assumption?\n\nJust take this one as a loss and re-do it. Then sit down with the professor and go through the essay to identify what the issue was with this one. If it was an error by the TA, I would ask for the lab re-do to count as extra credit and not an assignment.",
      "author": "darniforgotmypwd",
      "created": 1634099259,
      "upvotes": -19,
      "replies": {
        "hghhdjs": {
          "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hghhdjs/",
          "text": "Dude everyone cries in college. Even though he did nothing wrong, being accused of cheating is serious and can ruin someone’s career if not resolved. Its stressful AF. And then dealing with resolving it on top of dealing with the actual work you need to do for other classes is a nightmare. So don’t bash the dude for being stressed to the point of tears",
          "author": "Pyro-Millie",
          "created": 1634134549,
          "upvotes": 10,
          "replies": {
            "hghkh03": {
              "link": "/r/college/comments/q71aem/turn_it_in_said_i_plagiarized_but_i_didnt/hghkh03/",
              "text": "Okay, honestly I am surprised at the reaction to this comment. Doesn't seem to be the main view. Maybe some people are not reading the original post between the times.\n\nOP hasn't told any of us he was accused of cheating. They were just told to re-do the assignment without an explanation. It's not healthy to jump to assuming the worst possible outcome when the chances of that are very low in a specific case. It's much more likely that OP has similar text in the paper. It is a lab report, after all, so there will be shared prompts and formatting.\n\nThe TA offered to re-grade the assignment if the \"issue\" was fixed, so it is *highly* unlikely anything serious is going to happen here. I would bet $100 on it. I have had scary moments too but a lot of them turn into nothing when you sit down and go through the logic of it instead of just worrying without thinking critically about the situation. Validating OP's assumption it was about cheating is only going to make them more anxious.",
              "author": "darniforgotmypwd",
              "created": 1634135860,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}