{"sid": "psmeo8", "link": "/r/college/comments/psmeo8/girlfriend_isnt_going_to_college_and_its_putting/", "title:": "Girlfriend isn't going to college and it's putting a strain on our relationship", "text": "My (18m) girlfriend (18f) girlfriend isn't going to college or at least isn't going right now. She wants to focus on work and see if she likes the field she wants to go to before school. I'm going to University and she lives about 15 minutes away from her. She's constantly on campus with me, and it feels a little weird that she doesn't go there. She goes to frat parties with me and it feels a little weird that she's not going to school there. \n\nWe are going through a rough patch I would say. She's jealous that I'm interacting with girls on campus, and I don't want to go to sorority functions without her, but my fraternity did not like that idea at all. People do think it's weird she's around so much but not enrolled. \n\nNot really sure what to do? I really like her and we've been dating for about 5 months, but I'm not sure our paths are compatible. Does anyone have any experience with something like this?", "author": "LordHawkeye", "created": 1632241996, "retrieved": 1632800987, "over_18": false, "upvotes": 0, "upvote_ratio": 0.33, "comments": {"hdqokja": {"link": "/r/college/comments/psmeo8/girlfriend_isnt_going_to_college_and_its_putting/hdqokja/", "text": "I don’t really think this needs to put a strain on your relationship, but the fact that it is might be a sign that it just won’t work out. Then again, I don’t know the full situation so it’s hard to say. \n\nI’d try to talk it out. I don’t necessarily think it’s weird for her to be around. People like to have fun. She is getting all of the social benefits of going to college without actually having to enroll. I don’t think that’s weird. Even if it is though, doesn’t necessarily make it an issue.\n\nIs there a good reason why she is jealous of you talking to other girls? What exactly are you doing? \n\nDid you tell her your fraternity doesn’t want you going to sorority functions with her?\n\nIt’s going to be hard to give advice without more information. What exactly is causing the tension here?", "author": "MicrobialMicrobe", "created": 1632244805, "upvotes": 3}, "hdqifvr": {"link": "/r/college/comments/psmeo8/girlfriend_isnt_going_to_college_and_its_putting/hdqifvr/", "text": "I went through a similar thing with my ex. Just don’t try to force the relationship to work. And if she’s getting jealous about you just talking to girls, that’s super toxic. You’ve been together 5 months, just don’t let her pull you down or make you feel guilty for having fun and talking to people.", "author": "mfitz1718", "created": 1632242317, "upvotes": 5}}}