{"sid": "lv9oxn", "link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/", "title:": "Are dual monitors for studying really helpful?", "text": "Like monitor 1 is your laptop and monitor 2 is tv-like screen/larger monitor. \n\nIs this really helpful? I posted something here on reddit and most of the comments suggested to have dual monitors for studying/schooling. \n\nThoughts on this? How was your experience if you have this kind of setup? What are your suggestions?", "author": "muningmuning", "created": 1614606659, "retrieved": 1632802574, "over_18": false, "upvotes": 818, "upvote_ratio": 0.99, "comments": {"gqet1q7": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gqet1q7/", "text": "yes. 100x easier for essays, notes, lectures, projects, zoom + work, etc. even a cheap monitor makes a huge difference", "author": "hopeless_sarcastic", "created": 1615349116, "upvotes": 1}, "gq39r05": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gq39r05/", "text": "I don't have a dual monitor, but I do have a laptop and a PC. Sometimes I will plug-in my laptop to my monitor through an HDMI cable and that way I have a quick dual monitor. Whatever I do on my laptop, I can split it into two sides, on one side I have stuff I do on the laptop (on monitor) and on the laptop's view - I have either a show or PDF or whatever is more of a less moving animation. Basically main view on the monitor is what I'm working on, and the other is support or something to watch.\n\n&#x200B;\n\nPersonally, I've found it to be great for me, makes me feel like I have a genuine dual setup, and honestly kinda nice to not have to minimize and open constantly folders.", "author": "unfab", "created": 1615118875, "upvotes": 1}, "gpfwkhn": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpfwkhn/", "text": "It's useful if you take notes digitally. It's even more useful for research. It's super useful if you are in tech, design or media.", "author": null, "created": 1614709413, "upvotes": 1}, "gpfmntk": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpfmntk/", "text": "I think it depends on your major and your learning style. It's definitely not a must. A lot of online readings/writings you can just split your computer screen. But for more elaborate stuff on your computer (i.e. I had to do a lot of video editing in college) it can be useful to have. I honestly just had a small tv that I bought an HDMI cable for and did it that way. Worked find and meant I could watch stuff on a bigger screen if I wanted to watch a movie or something in my dowm.", "author": "stev3609", "created": 1614705104, "upvotes": 1}, "gpexb7a": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpexb7a/", "text": "At this point I have three and if I had any more desk I would probably get a fourth if I could afford it. I hate working on my laptop where I usually don't have other screens", "author": "coldblade2000", "created": 1614693270, "upvotes": 1}, "gpeuf2q": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpeuf2q/", "text": "Hell yeah. I’m tryna get a 3rd lol", "author": "R3alDe4lll", "created": 1614691602, "upvotes": 1}, "gpeddbe": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpeddbe/", "text": "Currently using a two monitors set-up. Once you have two, you will never *ever* want to go back to 1.\n\nAs for any number of monitors higher than 2, I personally say you have diminishing returns at that point. Unless you *really* need that many reference documents open at once, it probably wouldn't even be humanly possible to boost your productivity any more.", "author": "yooneek_naym", "created": 1614677417, "upvotes": 1}, "gpdxo99": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdxo99/", "text": "I just added a second screen this term during my last year of college and it has made things so much easier. Especially when doing assignment or papers where you need to reference certain materials. It’s beneficial to not have to continuously click back and forth", "author": "UseDiscombobulated73", "created": 1614663613, "upvotes": 1}, "gpdx6nb": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdx6nb/", "text": "[removed]", "author": null, "created": 1614663281, "upvotes": 1}, "gpdx6hz": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdx6hz/", "text": "I have two laptops and I find myself using both at the same time for school work all the time. A dual monitor setup is definitely useful/helpful, at least in my experience.", "author": "wh0lock", "created": 1614663278, "upvotes": 1}, "gpdvcah": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdvcah/", "text": "Dual monitors are fucking life changing. I preach about them like the gospel to almost everyone I know.", "author": "Waffle-Toast", "created": 1614662048, "upvotes": 2}, "gpduscv": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpduscv/", "text": "Yes! Right now I have a laptop that I use and a 36” monitor. I can’t stand working on my laptop anymore! 2 monitors or a huge monitor is amazing and will be helpful for any kind of job I think so it’s a good investment.", "author": null, "created": 1614661676, "upvotes": 1}, "gpdthcg": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdthcg/", "text": "Yes definitely", "author": "liyate4", "created": 1614660845, "upvotes": 1}, "gpdqouv": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdqouv/", "text": "I have 3 - laptop & 2 monitors. Life is much easier.", "author": "nizzerp", "created": 1614659110, "upvotes": 1}, "gpdkgi9": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdkgi9/", "text": "I’m currently in my internship and have 3 monitors at the office and I could easily use more with the amount of applications I have open at once.", "author": "knightrain76", "created": 1614655593, "upvotes": 1}, "gpdidtm": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdidtm/", "text": "YES. Totally worth it. Particularly now that we're all using so many reference materials that are on the computer. \n\nWhen I'm doing something that requires the use of 2+ windows at a time, which happens on a daily basis, it really helps to have that second screen.\n\nClass notes, zoom, hw, pdf of the textbook, stack overflow, program we're using in class or for lab, etc, a second screen helps so I don't have to click away from the lecture to view it. I regularly have 4 things open side by side. \n\nIt's kind of a slippery slope though. I've been using 2 screens for over a year now, and I'm starting to want a third, lol.", "author": "symmetrical_kettle", "created": 1614654463, "upvotes": 1}, "gpdhgoi": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdhgoi/", "text": "Depends on what you're studying for for the most part but honestly it's nothing but a benefit. I don't have a second monitor unfortunately (space issues rn) but if I could I'd love to have one. Would make reading things so much simpler when I have to do work simultaneously.", "author": "GBFMarineScientist", "created": 1614653972, "upvotes": 1}, "gpdg504": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdg504/", "text": "This year I was stumbling on getting a monitor or a TV, I went for the monitor and have zero regrets, the workflow is so much better that once you go dual monitor, it's hard to ga back to just one, especially when writing reports. I'd say a monitor is one of the best investments I've made in college.", "author": "ramiro_bohon", "created": 1614653256, "upvotes": 1}, "gpdfjdc": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdfjdc/", "text": "Dual monitors are nice no matter what you're doing.", "author": "Tristan8853", "created": 1614652929, "upvotes": 1}, "gpdfbw4": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdfbw4/", "text": "Yes. You will never be able to go back", "author": "debantures", "created": 1614652818, "upvotes": 1}, "gpdep0c": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdep0c/", "text": "Yes, I have word on one screen, and two chrome windows going with 75 tabs on the other, that I alternate between.", "author": "spoung45", "created": 1614652477, "upvotes": 1}, "gpdej4b": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdej4b/", "text": "I use two laptops currently. One to watch lectures on and the other to write my notes on. It’s changed my life.", "author": "Temporary_Ad2805", "created": 1614652390, "upvotes": 1}, "gpddmgl": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpddmgl/", "text": "I'm only in high school but YES!! Ever since I got my second monitor has made everything amazingly easier. Please get a second monitor!!!", "author": null, "created": 1614651905, "upvotes": 1}, "gpddffm": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpddffm/", "text": "Yes", "author": "RougeKnight96", "created": 1614651798, "upvotes": 1}, "gpdb4q3": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpdb4q3/", "text": "YES YES YES! It seriously makes you more productive and overall reduces the amount of tab and screen switching when you have a lot of things. It’s one of the best investments you can ever make. I started with one tiny 768 pmonitor, went to a 1080p monitor, then a 4K tv, and then now to a laptop/pc setup with my laptop the 1080p monitor and a vertical monitor. I feel like a productivity god.", "author": "TwiningLeek881", "created": 1614650577, "upvotes": 1}, "gpd8pv7": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd8pv7/", "text": "YES! YES! YES!", "author": "lolmary101", "created": 1614649306, "upvotes": 1}, "gpd8lb3": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd8lb3/", "text": "I didn't have a 2nd monitor until my sophomore year, and when I finally thought to hook up my TV as a 2nd monitor, I don't know how I went so long without one. I have ADHD, and sometimes need to have a bunch of sensory input to focus, so it's nice to be able to put a movie or spotify or whatnot on the 2nd screen and keep homework open on my laptop. Also nice to have a screen just for reading assignments and a screen just for typing. \n\n&#x200B;\n\nIf you use an actual TV as a 2nd monitor, you have the added bonus of additional external speakers too. I would keep an eye out at thrift stores or similar places for older TVs, it doesn't matter a whole lot if it has super high quality graphics or is super big (at least, not to me). I'm using a 10 year old Insignia, maybe 20 inches? gets the job done", "author": "NatashaBrightflower", "created": 1614649240, "upvotes": 1}, "gpd8fyg": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd8fyg/", "text": "YES! I swear by this, it makes you feel like you're hacking into the mainframe too, which is always cool as hell.", "author": "AmberBoBamber98", "created": 1614649164, "upvotes": 1}, "gpd6zfl": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd6zfl/", "text": "Countless benefits but especially if you’re in zoom classes because you never have to tab out of the call to look at your own screen", "author": "the_ashman18", "created": 1614648393, "upvotes": 3}, "gpd6ff3": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd6ff3/", "text": "Watching Zoom class on one monitor while doing the work on another is a game changer. That being said, it also allows for distractions (for example: me, in class, right now).", "author": "Bseagully", "created": 1614648097, "upvotes": 3}, "gpd67dz": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd67dz/", "text": "I like it a lot. I’m on my computer a lot so having to monitors give me less of a headache when I have a lot of programs open.", "author": "QuickCoyote097", "created": 1614647979, "upvotes": 3}, "gpd60e3": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd60e3/", "text": "Yes. First time student made my life easier.", "author": "Breesmomy88", "created": 1614647876, "upvotes": 3}, "gpd43oi": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd43oi/", "text": "I have this setup and it help me with being more efficient and gives me a better posture. Having a monitor forced me to get out of bed and sit at my desk. I’m hoping to get a PC one day to ditch my laptop since I’m always at home, then I’ll have two large monitors.", "author": "charper47", "created": 1614646853, "upvotes": 3}, "gpd3g4y": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd3g4y/", "text": "I use my laptop as one screen and my iPad as another. I’ll pull up my textbook on one and do the hw or pull up any digital notes on the other. Then I usually have my tv playing music or YouTube videos as background noise. It’s a tad difficult for me without multiple screens tbh. I’ve been told it might have something to do with ADHD but I’ve never been formally diagnosed.\n\nEdit: plus I’m minoring in Russian and its much easier to do typed hw or essays on my iPad since I can easily switch to Cyrillic with one button press, versus the infuriating process of trying to blindly type in Cyrillic on a QWERTY keyboard or copy/paste words and characters.", "author": "anactualfrog", "created": 1614646497, "upvotes": 3}, "gpd3ek1": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd3ek1/", "text": "Yes, I didn’t get them until I was working full time but having 2+ monitors is life changing", "author": "uglybutterfly025", "created": 1614646474, "upvotes": 5}, "gpd2zzp": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd2zzp/", "text": "Not exactly sure if they're really helpful, but if it helps you. Go for it.", "author": "Halomast123", "created": 1614646253, "upvotes": 2}, "gpd1bqm": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd1bqm/", "text": "Buying a monitor for my laptop has been the best thing to happen to my life since my girlfriend. It makes school work so much quicker", "author": "PasswordLogger", "created": 1614645353, "upvotes": 1}, "gpd0a8l": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpd0a8l/", "text": "Anecdotally, additional monitors do indeed increase productivity following diminishing marginal returns (after two, there is just no point). \n\nIn general, I'd say a good keyboard is actual far more important for productivity than an added monitor. Once you go w/ mechanical switches over mesh you'll never go back.", "author": "niwhsa9", "created": 1614644797, "upvotes": 1}, "gpcztre": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcztre/", "text": "I can't function without my external monitor--doing research or ANYTHING on just one, tiny screen is such a chore.\n\n I can have zoom open on one screen and a PDF open on the other, I can have one screen with 93290412094 tabs open while I write my essay on the other, I can watch a movie while flipping through vocabulary flashcards on quizlet, and I don't have to worry about getting disoriented during online exams that require me switching between an external window with a reading section and the actual questions.", "author": "0x0_0x0", "created": 1614644554, "upvotes": 1}, "gpcz93b": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcz93b/", "text": "depends on two things,\n\n 1. how much online work you have, if you do a lot of online work, I highly recommend it. \n\n2. what your workload is/what your work is in general. If you have more essays, do it\n\nWhen I was online having a dual monitor was a godsend. I would have one screen the lecture and the other being my notes and it was perfect. If you have a lot of essays it can also help. I would put my outline or sources on one screen and my essay on the other. Another piece of advice is to gauge how much you split your screen up. If you split your screen up a lot I say again go for it if not then save your money. Lastly, if you're only using it for school, don't break the bank. Find a cheap or old tv with HDMI and use that. hope this all makes sense I'm on 2hrs of sleep and too much caffine", "author": "mihelic8", "created": 1614644248, "upvotes": 1}, "gpcydxc": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcydxc/", "text": "I've got dual monitors and it is unbelievably convenient", "author": "ThoughtsOnGovernment", "created": 1614643788, "upvotes": 1}, "gpcvpot": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcvpot/", "text": "Totally, being able to have 4 windows open at once (two on each screen) is a life changer. On a Mac with that 4-finger swipe to go between desktops, you can have even more (not sure if there’s a similar feature on Windows). My setup is my laptop connected to a keyboard, mouse, and second monitor through a hub. That way when I’m at my desk I basically have a desktop with two monitors, and when I leave I can just take my laptop with me by unplugging the charger and the hub.", "author": "CaveJohnsonOfficial", "created": 1614642387, "upvotes": 1}, "gpcvlyq": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcvlyq/", "text": "I don't know how people live *without* two monitors tbh.", "author": "RainofOranges", "created": 1614642333, "upvotes": 5}, "gpcuis3": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcuis3/", "text": "I have 4 Monitors (including a laptop) and I love it. Honestly, try 2 and you won't be able to go back.", "author": "Jimmy_E_16", "created": 1614641766, "upvotes": 1}, "gpctyly": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpctyly/", "text": "I hook up my MacBook to an ultra wide monitor that’s risen up. I use the MacBook as my keyboard and trackpad and I put less important screens on the bottom display. Important windows are at the top display on the ultra wide. It’s super convenient", "author": "microfsxpilot", "created": 1614641473, "upvotes": 1}, "gpcs5nd": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcs5nd/", "text": "I really like it as i can have the zoom call on the big screen, notes on my monitor and google for help understanding a term on my monitor as well", "author": "ArkGaming_", "created": 1614640547, "upvotes": 1}, "gpcs34a": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcs34a/", "text": "No doubt about it. Absolutely the only way I'm getting through all these online classes with my sanity intact.", "author": null, "created": 1614640511, "upvotes": 1}, "gpcr1dw": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcr1dw/", "text": "I got to occasionally use 2 monitors depending on where I was on campus and it is honestly a game changer, so much more productive when you can have your work spread out and don't have to alt tab all the time.", "author": "nvangi", "created": 1614639973, "upvotes": 1}, "gpcnhbq": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcnhbq/", "text": "Yeah, I find it helpful. My laptop screen is really small anyways so I needed a second monitor. Especially with ebooks; having the homework on one screen and the book open on the other. Or when I'm writing; the word doc on one screen and research in a browser on the other screen.\n\nI also use it for zoom calls since my professors like to use the whiteboard and use really small fonts, the big monitor really helps my eyes", "author": "bad-attidude", "created": 1614638199, "upvotes": 1}, "gpcn5df": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcn5df/", "text": "It is VERY helpful. I love having multiple windows open at once, and being restricted to a small screen kinda sucks. I often full screen videos I’m watching to one screen and then am free to search stuff up/take notes on the other. Very worth it, invest in it for sure :)", "author": "Doubleknotonmyyeezy", "created": 1614638033, "upvotes": 1}, "gpcmgru": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcmgru/", "text": "I love it. I just started doing it this semester when I got my desktop computer. I use my laptop for Zoom and then I can do homework for the class on the desktop while Zoom is going and I can knock it all out at once which I couldn’t do before.", "author": "Hello-I-Am-Trash", "created": 1614637698, "upvotes": 1}, "gpcm7ou": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcm7ou/", "text": "I'm a cs major, and I might pull up my source code, instructions for an assignment, notes, and maybe spotify. Its great not having to switch between apps all the time", "author": "miekolpham", "created": 1614637575, "upvotes": 1}, "gpclysy": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpclysy/", "text": "Yes - though I will say having a 2 monitor desktop setup usually deters me from wanting to do work on my laptop.   \n\n\nAlso, 3 monitors is even better like no comparison between 1 monitor and 3. \n\nWhatever it is, physics hw, programming , writing essays. etc. It's just way better.", "author": "SecureDropTheWhistle", "created": 1614637457, "upvotes": 1}, "gpclseq": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpclseq/", "text": "Depending on your classes really. If it's self guided training, then you really just need one, but if you have to refer back to the book while being on an elearn site or look up info, or have a calculator open. Great place to look up answers for your online tests.", "author": "mtnlion74", "created": 1614637370, "upvotes": 2}, "gpckn6a": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpckn6a/", "text": "It really helped me. I bought one more so for video games and streaming and stuff but now that school came online, I used to not bring it to campus because I’ll be bringing my laptop everywhere, but at home, it’s very useful for everything", "author": "insurgent117", "created": 1614636816, "upvotes": 1}, "gpcklhy": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcklhy/", "text": "I was adamantly opposed to a second monitor but now that I got one I can't go back", "author": "thegoblindynasty", "created": 1614636794, "upvotes": 1}, "gpckio4": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpckio4/", "text": "My prescription glasses have aged out fast, presumably  because they're my first pair (farsighted and astigmatism). My monitor is great for doing my readings, especially if I can't zoom in all that much. Don't know if that applies to your situation, though.", "author": "thegeniuswizard_", "created": 1614636756, "upvotes": 1}, "gpckev4": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpckev4/", "text": "Yes. 100%. As a computer science major, it’s a huge difference. Hell, even if you’re doing office work or just essays, research, webassign, or anything, a second monitor is worth it. \n\nHaving one monitor to read an article or watch a documentary and the other to have your essay on, or one monitor with your project requirements while you’re working on the other for constant glances at it, one with zoom window and the other with notes, it’s a game changer.", "author": "DynamicHunter", "created": 1614636705, "upvotes": 1}, "gpcgzd4": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcgzd4/", "text": "Bio major. Two monitors is so nice for lab reports and researching. I can just look at my results while typing and I normally have Spotify running on one so I can easy change songs without leaving my document.", "author": "Shownkindness", "created": 1614635108, "upvotes": 1}, "gpcgdy7": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcgdy7/", "text": "I had a small TV that I didn't have a spot for so I made it a makeshift dual monitor and it has changed my life. Definitely recommend for reading PDFs, e-texts, or even if you just have a bunch of tabs open while writing an essay. 10/10", "author": "shelly5825", "created": 1614634834, "upvotes": 1}, "gpcfxui": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcfxui/", "text": "It’s very very helpful. I just got one and it’s great. Usually I’ll have an assignment pulled up on one monitor and the rubric on the other. It also helps if I want to pull something up while still keeping the zoom call on the screen", "author": "big_billford", "created": 1614634624, "upvotes": 1}, "gpcez4e": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcez4e/", "text": "I love having dual monitors!! It's useful for everything. Can't recommend enough", "author": "HumanSushiBurrito", "created": 1614634172, "upvotes": 1}, "gpcesoi": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcesoi/", "text": "Businesses have spent a decent amount of money on research regarding this. I believe you see productivity increase up to 3 monitors before seeing diminishing returns.", "author": "OsculatingPlanes", "created": 1614634092, "upvotes": 1}, "gpcec12": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcec12/", "text": "I don’t have one, by at my GA job there was a dual monitor set up and it made things so much easier when I did home work in my down time. Hoping to get a second monitor sometime this year", "author": "Eened", "created": 1614633880, "upvotes": 1}, "gpcdxrh": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcdxrh/", "text": "I have my Macbook as one monitor and use the Sidecar function to make my iPad a second monitor. Works great for me, I usually have the video lecture or academic text up on my laptop and Onenote or Pages on my iPad for making notes. Only thing I have to disconnect them for is live Zoom calls because the video feed janks out, but that might be a connection issue with my wifi tbh.", "author": "dumb_bitch_juicero", "created": 1614633699, "upvotes": 1}, "gpcd1cf": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcd1cf/", "text": "I find it really helpful for Anatomy. I have a laptop that I plug a monitor into so I can have a dual screen (intended it to be for gaming), but it’s really nice when I need to read how something functions and works, and I can also see the structure of it on my second monitor. \n\nIt also really helps during video lectures, so I can have the text/PowerPoint/notes pulled up next to the actual lecture.", "author": "Niarah", "created": 1614633291, "upvotes": 1}, "gpccua2": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpccua2/", "text": "Highly recommend it. Especially if you need a billion tabs open or completing a thesis. Its very useful for research", "author": "just_in_who_ung", "created": 1614633201, "upvotes": 1}, "gpcctxp": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcctxp/", "text": "I run a dual monitor and will never go back.  I can take notes on my computer while in zoom, and keep references up on one of the screens, and the essay on the other.", "author": null, "created": 1614633196, "upvotes": 1}, "gpcbtnu": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcbtnu/", "text": "definitely helpful! i have my laptop and a wide screen computer monitor i was able to get for free from my town’s community facebook page and it’s been a game changer for zoom university. \n\ni feel more productive with the split screen and it mimics how i would work at my college library if i brought my laptop and worked at a desktop computer. you can get affordable and nice ones on amazon.", "author": "memekella", "created": 1614632740, "upvotes": 1}, "gpcauds": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcauds/", "text": "I recently bought the \"duet app\" on my old Chromebook and currently use it as a second monitor. Its nice to have reference sheets alongside my zoom meetings. I can strongly recommend the app if you arent looking to get a decked-out setup.", "author": "zreamx", "created": 1614632315, "upvotes": 1}, "gpcasut": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcasut/", "text": "It is absolutely the most helpful thing for school work. For undergrad it was super helpful, for grad school is a necessity. Warning: once you go double, you can never go back. If you have some extra funds, get the double! You absolutely wont regret it.", "author": "pikachuomg", "created": 1614632296, "upvotes": 1}, "gpcamk9": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpcamk9/", "text": "I use sidecar on my Macbook and iPad (basically my iPad becomes a second screen for my macbook) and its super useful, especially for taking notes over videos, lectures, textbooks etc.", "author": "idunnobroseph", "created": 1614632222, "upvotes": 1}, "gpc9vrt": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc9vrt/", "text": "I do school work at work sometimes and I have 3 monitors counting my laptop... I say the more the better lol", "author": "roseyd317", "created": 1614631894, "upvotes": 1}, "gpc94gu": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc94gu/", "text": "Hell yes it does. I have three actually: One going horizontal, one going vertical, and my laptop's screen. Being able to see several pages and programs at once saves time from switching between tabs and keeps you more focused. When I have to go back and forth on one screen, my mind just gets messy.", "author": "----NSA----", "created": 1614631560, "upvotes": 1}, "gpc7k8e": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc7k8e/", "text": "I love it. I can have a lecture open and a notepad or the software i need to follow along with. 10/10", "author": "CommanderNat", "created": 1614630865, "upvotes": 1}, "gpc5jjc": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc5jjc/", "text": "Yes— it’s a game changer. If it’s just for studying you don’t need anything high res or expensive. You can find one that does the job for very cheap on Facebook market place, Craigslist, or offer up.\n\nAlternatively, some small TV’s can double as a monitor if they have an HDMI port. Just be sure to turn down the backlight in settings or it’ll tire your eyes pretty quickly.\n\nTo be clear, adjusting the brightness or contrast has no effect on the backlight.\n\nHope this helps", "author": "Resco809", "created": 1614629983, "upvotes": 2}, "gpc5838": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc5838/", "text": "I’m in Computer Science, and I only got a second screen a few months ago, but it’s been really helpful. Coding across multiple screens, especially when I need to reference libraries, has been very helpful, but even in a normal non-coding workflow it’s been great using one screen to work and the other to reference prompts or articles or whatever I’m writing about at the time.", "author": "restinstress", "created": 1614629842, "upvotes": 1}, "gpc4uiy": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc4uiy/", "text": "For writing essays and reports 2 monitors are very helpful at cutting time in half on projects.", "author": "whyrweyelling", "created": 1614629680, "upvotes": 1}, "gpc3wwd": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc3wwd/", "text": "short answer: yes\n\nlong answer: yess", "author": "bearbarebere", "created": 1614629274, "upvotes": 1}, "gpc3b7r": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc3b7r/", "text": "I have two 27 inch monitors and then my laptop screen. I use the laptop screen for Spotify and the other two for actual work. Makes it easy when programming and seeing the assignment details,  or when writing a paper or viewing multiple pdf or word docs.", "author": "jbagel27", "created": 1614629004, "upvotes": 1}, "gpc35fc": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc35fc/", "text": "Makes a lot of thing easier, but if your ADHD is as bad as mine it'll do you best to keep the second monitor off until you really need it on.", "author": "PaperSauce", "created": 1614628931, "upvotes": 1}, "gpc2r7l": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc2r7l/", "text": "I recently got an iPad that I use as a second monitor. It’s so much easier to watch lectures and then take notes using my iPad. I also do A LOT of online readings for my major and using my iPad for them is so much easier while also using my computer to take notes. I don’t have the space for a traditional dual monitor set up and I like the convenience of being able to take my iPad anywhere with me.", "author": "spinchrecall", "created": 1614628755, "upvotes": 1}, "gpc2nuq": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc2nuq/", "text": "You’ll never go back.", "author": "Lethal4001", "created": 1614628713, "upvotes": 1}, "gpc2fly": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc2fly/", "text": "I have 4 28” monitors and love every square inch of them.", "author": "Professor_1977", "created": 1614628611, "upvotes": 1}, "gpc1w2y": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc1w2y/", "text": "Second monitor is sooo clutch. Zoom on one screen, Padlet on the other for notes. Makes reading for essays way easier too.", "author": "SirHankOfTheHill112", "created": 1614628371, "upvotes": 1}, "gpc1ubp": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc1ubp/", "text": "Yes!! I’m a computer science major and for every assignment I put the project description on one screen and I code on the other screen\nIt’s helped a lot since I don’t have to keep switching back in forth", "author": "GmS_11702", "created": 1614628349, "upvotes": 1}, "gpc1cd0": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpc1cd0/", "text": "Yes, especially for coding! It's super convenient to have the prompt on the second monitor, and coding on your primary monitor! I'd recommend everyone who can to get a second monitor.", "author": "I_Wanna_Name", "created": 1614628125, "upvotes": 1}, "gpbzv8j": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbzv8j/", "text": "As someone with adhd, they honestly make things more distracting for me... I tend to turn one off while studying. But otherwise they’re quite helpful 😂", "author": "moonreefe", "created": 1614627475, "upvotes": 1}, "gpbzj9r": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbzj9r/", "text": "Dual monitors are one of those things you can do without, but if you have the opportunity to get you absolutely should.", "author": "General_Lee_Wright", "created": 1614627328, "upvotes": 1}, "gpbyp9d": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbyp9d/", "text": "If you have a laptop, there are second monitors that you can mount on the back of your laptop like [this one](https://www.amazon.com/gp/product/B081QVGVS2/ref=ppx_yo_dt_b_asin_title_o02_s00?ie=UTF8&psc=1). You can purchase of full monitor and use it, but I have to move around for my classes and my desk is not that big, so this one provides portability and space for me. It is mounted with magnets so I can remove it if necessary and it is small enough to fit in my backpack with my laptop. You do not have to purchase this one specifically because it is a bit pricy, but I am sure you can find other monitors that can't be mounted at cheaper prices like [this one](https://www.amazon.com/Portable-Monitor-1920x1080-External-Computer/dp/B08JB1NKN5/ref=sr_1_8?crid=1BKDAU9XQS0Z9&dchild=1&keywords=dual+monitor+for+laptop&qid=1614626719&s=electronics&sprefix=dual+monitor+for+lapt%2Celectronics%2C202&sr=1-8).\n\nWhen everything went online, I was constantly switching from my notes to Zoom lectures. So having a second screen has helped me stay focused on the lecture and be able to take notes without much disruption. I am never going back to just one monitor, even after the pandemic. It provides extra space to work electronically without having to go from one window to another. Also, this one is personal, but when I was working on Winter break, my main monitor had my work and the second one had a Christmas movie for my little cousin that I was taking care of. \n\nYou also have to take into account that a second monitor will use more battery life, making it last less than usual. I am always plugged into the charging cable, so I do not have that problem.", "author": "Thalia756", "created": 1614626952, "upvotes": 1}, "gpby576": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpby576/", "text": "Definitely, I don't use paper anymore so I have a uni surface tablet to write on one note, 2 monitors for tabs and lecture videos and 1 vertical monitor for my one note page so I can drag and drop pdf's and images straight to my notepad. Would definitely recommend.\n\nSwitching to one note for my notes has been a game changer. I always struggled with organisation so having all my notes with me at all times is SUPER helpful. And no bulky rucksack.", "author": "Noxious_1000", "created": 1614626705, "upvotes": 1}, "gpbxpq8": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbxpq8/", "text": "Dude it changes everything, especially for business! you can have notes or lecture videos up on one screen and excel/word up on another. Totally a game changer for schoolwork and studying.", "author": "spikeknight1", "created": 1614626513, "upvotes": 7}, "gpbvon9": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbvon9/", "text": "I have dual mons and a surface pro 7. My workflow is disgusting (in a good way). I also have a mouse with sidebuttons and multiple profiles I can switch between. One of then has buttons that automatically open snipping tool and copy, paste, del functions. This way I can instantly snip an assignment and save it to my one drive screenshot folder, then I paste it in one note. I didn't like home learning at the beginning of the pandemic but now with my workflow optimizations I actually prefer it.", "author": "61-127-217-469-817", "created": 1614625602, "upvotes": 1}, "gpbvo1h": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbvo1h/", "text": "It’s a game changer, especially if you’re doing a lot of spreadsheets. Information up on one screen and excel in the other", "author": "mjbrown210", "created": 1614625594, "upvotes": 1}, "gpbvfhj": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbvfhj/", "text": "Definitely helpful if you have multiple programs, tons of tabs open, or even for just studying. Allows you to be significantly more organized without having to constantly search for what you need.", "author": "DjSzymek", "created": 1614625485, "upvotes": 1}, "gpbv38e": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbv38e/", "text": "I don't know how I made it through college only just using a 15 inch laptop screen", "author": "PossiblyAsian", "created": 1614625331, "upvotes": 1}, "gpbuyok": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbuyok/", "text": "Yes it's a huge difference, i feel way more productive with a second monitor.", "author": "HolaMundo_97", "created": 1614625274, "upvotes": 1}, "gpbulva": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbulva/", "text": "yes oh my god, it’s so so worth it. i got a cheap monitor for my laptop and just hooked it up with hdmi and it makes a WORLD of difference", "author": "feedabruh", "created": 1614625114, "upvotes": 1}, "gpbt5ah": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbt5ah/", "text": "YESSSS.", "author": "Nerobus", "created": 1614624466, "upvotes": 1}, "gpbt1la": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbt1la/", "text": "Yes, I discovered the dual monitor lab at my school in my junior year and it made everything so much easier. One screen for soccer matches and the other for work!", "author": "OmnipotentDoge", "created": 1614624421, "upvotes": 1}, "gpbsu0z": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbsu0z/", "text": "I got a 27 inch 2k monitor a few months ago and it has been extremely helpful. I set up the windows project/extend so that I use it with my 13 inch laptop as one big workspace, which comfortably fits 3 windows (or 5 windows less comfortably). Does wonders for multitasking. \n\nI think my main point here is that if you can't afford or don't want to buy two monitors and you already have a laptop, you can easily use your laptop screen with a monitor and have what I consider to be very ample space as a cybersec student.", "author": "Gj_FL85", "created": 1614624328, "upvotes": 1}, "gpbqfeg": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbqfeg/", "text": "I normally have my ebook on one screen and my text editor on the other when I am working on assignments. Or I have my program known on one and 30,000 chrome tabs open on the other when I am doing a programming assignment.", "author": "theduckman936", "created": 1614623268, "upvotes": 1}, "gpbqcqw": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbqcqw/", "text": "YES. I don’t have dual monitors but it would help me SO MUCH if I did.", "author": "Jakeremix", "created": 1614623237, "upvotes": 1}, "gpbq3lt": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbq3lt/", "text": "Definetly! I rarely have to print anything since I can look at two things simultaneously.", "author": "popfilms", "created": 1614623125, "upvotes": 1}, "gpboq8r": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpboq8r/", "text": "I don't but man would I love to. I just have a pretty small and old Dell chromebook. I always have so many windows open and tabs within windows, it's not even funny lol", "author": "Stock_VerbConjugator", "created": 1614622524, "upvotes": 1}, "gpbnxet": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbnxet/", "text": "Yes", "author": "TylerYeet", "created": 1614622175, "upvotes": 1}, "gpbn1u6": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbn1u6/", "text": "Do it. Many second hand stores sell monitors that are good enough to study with. You can also check if your school has a used electronics shop for all the computers and accessories they no longer use.", "author": "GreenGiant69", "created": 1614621795, "upvotes": 1}, "gpblhpp": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpblhpp/", "text": "It's always helped me. back when I was in school. I game so I've at times had three or even four monitors in some combination of monitor's laptops or tvs.\n\nComes in handy when you got an ebook, one note, Word /Excel and some slides  / web page or combinations thereof open at once.", "author": "dade305305", "created": 1614621132, "upvotes": 1}, "gpbkm8b": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbkm8b/", "text": "Depends on your major and computer needs", "author": "JohmasWitness", "created": 1614620751, "upvotes": 1}, "gpbjqy8": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbjqy8/", "text": "yes!!!! so helpful & so worth it", "author": "bigboyonmain", "created": 1614620376, "upvotes": 1}, "gpbjk5m": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbjk5m/", "text": "I love having dual monitors (although I might replace them with an ultra wide in the future). It is nice to be able to have multiple documents up and simply glance between them instead of having to fully switch which window is open an on top. I don't know if you are on windows or a Mac, but on macOS I can even scroll through a secondary document without activating it as the main open window (windows doesn't do this though). In general it helps avoid unnecessary context switching.", "author": "squirrel8296", "created": 1614620293, "upvotes": 1}, "gpbji2w": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbji2w/", "text": "I've got a dual monitor setup.  It's honestly great to be able to keep things I need to reference constantly up on one monitor while I work on the other.  It's also great for keeping my citation manager up while I write.  (For any fellow TAs, being able to pull the student docs up on one monitor and fill out the rubric and feedback on the other was a game changer--it cut the amount of time I needed to grade down significantly.)  Also works great for Zoom where you may want the Zoom window on one side and have a presentation or a doc they keep asking you to reference on the other!\n\nIf you do have to do it with a laptop plus a monitor, the suggestion I have would be to try to find a way to arrange it so they're roughly about the same level, otherwise it can kind of play hell on your neck.  I joke about my $1,000 laptop stand because I use a pile of hardcover textbooks so that it's adjustable by adding or removing a few, but it's super helpful.  Same also goes if you have two monitors with a desktop and they're different models or sizes.", "author": "LadyWolfshadow", "created": 1614620267, "upvotes": 2}, "gpbjf4i": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbjf4i/", "text": "Dual monitors are amazing for workflow, on my PC setup I can have the grading rubrics on my portrait monitor, and then split screen research and my assignment on my main landscape monitor. I highly recommend it!", "author": "spencefunk", "created": 1614620232, "upvotes": 1}, "gpbjee4": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbjee4/", "text": "It's made everything easier in terms of sorting windows and E-textbooks. \n\nWikipedia articles and college powerpoints", "author": "Ffom", "created": 1614620223, "upvotes": 1}, "gpbjbn9": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbjbn9/", "text": "Yes, 100% worth it. I have my 15\" laptop hooked up to a 32\" monitor and I can have multiple things open side by side and not have to worry about switching tabs all the time (essay + sources, code + documentation, etc)", "author": "OkayKatniss413", "created": 1614620190, "upvotes": 1}, "gpbhp6q": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbhp6q/", "text": "It's very useful to be able to work on something on one monitor while having things like references or google chrome open on the other monitor if you need to search for something. Like for example for programming, you can have your IDE open on one Monitor and Stack Overflow on the other.", "author": "Peterrior55", "created": 1614619484, "upvotes": 1}, "gpbh8x2": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbh8x2/", "text": "Dual monitors are the bomb for anything really. At this point, my MacBook is just the processor because I have a keyboard, mouse, and two monitors. There are some MacBook adapters for the Type C USB on Amazon.", "author": "KentuckyHustle", "created": 1614619286, "upvotes": 1}, "gpbh7va": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbh7va/", "text": "Makes it much easier, and when it comes to doing school work, I'll take anything that makes it easier. Textbook open on one screen, and Blackboard or whatever else on the other. I have a tilted laptop stand next to a 27\" monitor. Additionally, I have both a USB keyboard and mouse. Cost effective, and keeps cords out of the way.", "author": "erichellyeah", "created": 1614619274, "upvotes": 1}, "gpbh5oz": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbh5oz/", "text": "Its pretty great, also if you have one with a nice stand or arm you can turn them vertically to help read long papers/ quotes which is really useful for when you are studying or trying to find quotes in a article", "author": "Go_On_Shadow", "created": 1614619247, "upvotes": 1}, "gpbgse0": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbgse0/", "text": "Especially with zoom classes it's crucial. Zoom meeting on one screen, notes on the other. Also makes open book exams much easier. One screen for resources, the other for the exam.", "author": "Gaffelstein", "created": 1614619086, "upvotes": 1}, "gpbgkuu": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbgkuu/", "text": "It is  helpful but don't get bogged down & distracted by details like this. Do whatever you can with what you have.", "author": "GrannyGrunge", "created": 1614618994, "upvotes": 2}, "gpbg7s9": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbg7s9/", "text": "Dual Monitors are great, especially if you are using a lot of digital textbooks or are working in an analytical degree.  I also highly recommend putting your second monitor in Portrait mode... For PDF, word documents, web browsing it is the only way to go.  All of those items are optimized for phones/vertical scrolling, or mimic a standard printer paper which are all portrait.  Even for desktop items, you will find that splitting the screen top/bottom on a portrait monitor is much closer to the standard 16:9 aspect ratio then splitting the same screen left/right meaning items wont appear squished", "author": "laxwkbrdr2", "created": 1614618835, "upvotes": 1}, "gpbfzpp": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbfzpp/", "text": "Second monitor has been great especially with all of my classes being on zoom! I can take notes on one screen and have the lecture on the other. It’s definitely an improvement to my setup from last semester. Also super helpful for writing papers.", "author": "vbptak", "created": 1614618738, "upvotes": 7}, "gpbffrr": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbffrr/", "text": "Yes!\n\nI'm a PhD student in theoretical/computation astrophysics, and when I came back to my university city under lockdown, my department gave me a 24\" monitor, keyboard, and mouse to use alongside my laptop. I have found myself so much more efficient and focussed since getting them.\n\n1. Laptop screens are not at the right height, so you're going to strain yourself if you use it as-is. You can reduce that by placing your laptop on a stand so the screen is ~eye level. That also means you'll need a separate keyboard and mouse though, and at that point you may as well get a second monitor to put alongside.\n\n2. You can't fit very much on a small laptop screen, and if you try to make things smaller, you'll be straining your eyes. A second screen means you have more space. How many times have you gone to switch tabs or programs and accidentally closed out of something? Two monitors means you can drag important stuff to the second and keep it visible.\n\n3. It's easier to set up a work/play divide. I use my second screen *only* for work and even have a different desktop background for it.\n\n4. If you do a lot of coding, you can get screens that are orientable on their side, making it a long, thin monitor perfect for coding.\n\nI'd also recommend you get a proper ergonomic desk chair too, one with a full adjustable back and arms.", "author": "officially_anxious", "created": 1614618494, "upvotes": 13}, "gpbf7mc": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbf7mc/", "text": "Yes, it is very helpful.", "author": "WashiBurr", "created": 1614618394, "upvotes": 1}, "gpbf1xe": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbf1xe/", "text": "It’s very helpful to me. I’m a stem major so I often have many tabs open and want to see multiple things going on at once. It helps keep me organized and is great for having an assignment sheet up next to whatever you are working on.", "author": "desba3347", "created": 1614618324, "upvotes": 1}, "gpbezha": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbezha/", "text": "I love having dual monitors. \nOne monitor has the assignment and the other has where I am typing up my answers. Or I can have a textbook PDF and my notes. Or any combination of useful things", "author": "Metro_Star", "created": 1614618294, "upvotes": 1}, "gpbeoit": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbeoit/", "text": "Dual monitors is a life saver. Literally could not do coding (and like it) without a second monitor. It also has helped me be more efficient in finishing my assignments for my college classes.", "author": "Littlebitt95", "created": 1614618158, "upvotes": 1}, "gpbemc4": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbemc4/", "text": "Surprising yes. Have them both on a monitor arm bent at an angle so they are easier to view.\n\nI usually use one for references while doing school work. For example, research/ reading on on monitor and writing paper on the other.\n\nAlso great for zoom classes. Open book exams you can reference way faster.\n\nTo do list for school on spare monitor.", "author": "RedDragon777", "created": 1614618131, "upvotes": 1}, "gpbe5th": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbe5th/", "text": "It's like buying a treadmill at home but you've never jogged before.\n\nIt can definitely help but you have to get the ball rolling first.", "author": "Klauslee", "created": 1614617928, "upvotes": 2}, "gpbe5o9": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbe5o9/", "text": "I personally prefer an Ultrawide over 2 seperate monitors. But yes, more screen space is a game changer.", "author": "taa20002", "created": 1614617926, "upvotes": 7}, "gpbe4mk": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbe4mk/", "text": "I currently have a 32\" Samsung monitor along with my small 14\" laptop. I do most of my work on my PC that includes the monitor simply because having a big area to work with is a lot easier. \n\nI am a professional at zoning out on my zoom classes that is on my laptop while I browse reddit. \n\nI picked mine up from walmart for around $150", "author": "Dragon_Socks", "created": 1614617913, "upvotes": 1}, "gpbdz5v": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbdz5v/", "text": "Thrift store/free Facebook TVs with an HDMI input have worked great for me, and very cheap as well. Super helpful even if I’m just playing a game, watching TV, or doing something actually important like an essay or (open-note!) quiz.", "author": "Seamor19", "created": 1614617846, "upvotes": 3}, "gpbdyab": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbdyab/", "text": "I use a laptop and a laptop stand along with an external monitor. Not only is it great for gaming but it is fantastic for being productive. I can have class, a PDF, a website, or anything I'm reading on one screen and my word document on the other.\n\nHaving two screens just opens up a lot of different ways that I can move windows around my computer and it improves my studying for sure.", "author": "TwelveBrute04", "created": 1614617834, "upvotes": 9}, "gpbdlox": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbdlox/", "text": "Yes, u can separate the word in one screen and the pdf. That makes taking notes a lot more easy than the alt+tab. Not to mention the essays", "author": "Dextr0o", "created": 1614617681, "upvotes": 1}, "gpbdhlw": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbdhlw/", "text": "Yes definitely. There are so many use cases. My most used applications are Microsoft to do, Gmail, anki, one note. It's nice being able to see most of these at a single glance. I typically keep To do, email, zotero, and calendar on my secondary screen, and one note/anki on my primary screen", "author": "xAsianZombie", "created": 1614617631, "upvotes": 1}, "gpbdfey": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbdfey/", "text": "A very big huge large sized YES.", "author": "ceilingfan-19", "created": 1614617605, "upvotes": 1}, "gpbdfd4": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbdfd4/", "text": "alternatively (this isn't very budget friendly tho) if you get a bigger singular monitor then u can split screen and that's just as good. maybe thats a dumb tip tho lOL", "author": "YeetasaurusRex2287", "created": 1614617604, "upvotes": 1}, "gpbdbnk": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbdbnk/", "text": "idk about studying but it makes everything else a lot easier", "author": "iamfearformylife", "created": 1614617560, "upvotes": 2}, "gpbcuh8": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbcuh8/", "text": "I don’t see a reason where a secondary monitor would not be beneficial. Even for things other than studying", "author": "AUGSOME47", "created": 1614617350, "upvotes": 4}, "gpbcufi": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbcufi/", "text": "Absolutely. I just got a monitor and it changed everything because I write a ton of essays. It makes it so much easier to work. Total gamechanger.", "author": "Megadog3", "created": 1614617349, "upvotes": 2}, "gpbc3g9": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbc3g9/", "text": "my second monitor changed my life as a CS major because i can code on one screen and look at instructions/ stack overflow on the other lol", "author": "the_whitepanther", "created": 1614617008, "upvotes": 21}, "gpbatn1": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpbatn1/", "text": "As a cs major it's been incredibly useful. I have not than double the screen space I had before so I have my text editor, terminal, homework instructions, and Google open at the same time so I don't have to switch between screens constantly.\n\nAll of my lectures are virtual and one way (no participation other than chat) so I put my lecture on my monitor and follow along on slides on my laptop screen or my iPad. It's absolutely the move.", "author": "Parcival_Reddit", "created": 1614616440, "upvotes": 5}, "gpb9dix": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpb9dix/", "text": "yes, so much yes. I don't know what i'd do without them. On top of having homework on on screen and textbook on the other, it's also nice to have Zoom on one and the lecture slides open on another incase you need to go back.", "author": "hunskey", "created": 1614615776, "upvotes": 6}, "gpb8ibv": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpb8ibv/", "text": "I have 3 (don’t laugh) and it actually makes it so easy to multitask. I personally would vouch for 2 monitors; once you have it, you can never go back, it just makes doing work so much easier and faster without any alt tabbing.", "author": "Scorpia03", "created": 1614615380, "upvotes": 101}, "gpb6nlr": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpb6nlr/", "text": "I swear by dual monitors. I'm in CS, so I've got google on one side, code on the other, and it's just...*chefs kiss*", "author": "marykated10", "created": 1614614513, "upvotes": 175}, "gpb63xb": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpb63xb/", "text": "It helps.  Some of my classes hava a class activity to do, so I have the class (on Zoom) on my second monitor, and I do the class activity on my laptop (do the work on OneNote w/o needing to alt+tab between OneNote and the class, for example)", "author": "SanjivanM", "created": 1614614258, "upvotes": 4}, "gpb54jk": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpb54jk/", "text": "[deleted]", "author": null, "created": 1614613802, "upvotes": 42}, "gpb313s": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpb313s/", "text": "Yes very much so", "author": "vicemagnet", "created": 1614612804, "upvotes": 4}, "gpb2tv4": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpb2tv4/", "text": "Getting a dual monitor quite literally the best thing. I love having my laptop open for my zoom screen if I’m doing online classes. On my monitor I can do notes for the lecture or have the text book open.", "author": "Right-Reaction-8223", "created": 1614612707, "upvotes": 24}, "gpb2fiv": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpb2fiv/", "text": "Tbh I do almost all of my work in bed lmao on my MacBook.", "author": "MY_CUM_ON_UR_FACE", "created": 1614612516, "upvotes": 41}, "gpb1851": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpb1851/", "text": "YES", "author": "shy-labuff", "created": 1614611935, "upvotes": 15}, "gpaya3t": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpaya3t/", "text": "Getting a second monitor is a life changer.", "author": "Zrolix", "created": 1614610481, "upvotes": 256}, "gpaue5t": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpaue5t/", "text": "Yes, it has made my life so much easier. I have to read a lot of PDFs for my major so I like to have one on one monitor and my notes/assignments on the other.", "author": "kewpiedayo", "created": 1614608462, "upvotes": 405}, "gpas49t": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gpas49t/", "text": "I just got a second monitor set up, and I must say it’s been nice working on a couple essays bc now I can easily have four windows open!", "author": "ambient_temperature", "created": 1614607200, "upvotes": 534}, "gparabn": {"link": "/r/college/comments/lv9oxn/are_dual_monitors_for_studying_really_helpful/gparabn/", "text": "It makes work a lot easier", "author": "mikeoxhard12", "created": 1614606726, "upvotes": 96}}}