{
  "sid": "qypw1t",
  "link": "/r/college/comments/qypw1t/should_i_stick_with_my_cs_major/",
  "title:": "Should I stick with my CS Major?",
  "text": " \n\nHey, I'm a typical college student who's having trouble with deciding their major. Been in college for like 2 and a half years already and went from a criminal justice major to a psychology and now a computer science major. I'm about to hit you with a long ass story so maybe go grab a snack or somethin idk\n\nLike a year back your boy got cheated on for the first time, it was his first relationship too so that ruined me. During that time my home girl lets say Emily helped me go through that tough time. I knew her for 7.5 years, we've been online friends for a long time and have been playing video games throughout those years very often. We got super close ever since my ex cheated on me, we then started dating. Everything was going great, I switched majors to computer science and started my prerequisite classes during the summer, I was doing fine (B- in discrete math and C- in calc 1). Me and Emily planned on meeting for the first time towards the end of October. This is where everything goes downhill, Emily cheats on me hell yeaaa this is awesome (not really). Your boy was heart broken, exams were also near, I took a massive L on my linear algebra calc 2 and intro c++ exams. I was able to complete my english essay though so that's good (taking a intensive english writing class as well). Imagine dating your best friend of 6 years for a year and a half and then have them cheat on you when you two were literally about to meet in a couple of weeks haha. Yea your boy went through the great depression. It also sucked that I had no one to talk to about it so yea I bottled it all up and I still do which probably isn't healthy. I now lack the beginning/mid information of these courses, I am NOT an math expert so catching up has been extremely hard for me, like honestly I don't think I'm catching up at all it's like I'm taking in information and spitting it back out for another piece of information. Been struggling to focus on lectures as well. I have a linear and cs exam on Tuesday which I am NOT prepared for, I'm looking at my cs/linear practice exam and oh god I can't solve any of the questions. I know I'm going to fail these two exams.\n\nNow the big question is whether or not computer science is for me. Around the early stages of the class I really did enjoy it, it felt nice when my code worked and I did kind of liked the puzzles here and there. As the course progressed things obviously started to get harder which is normal for every college course. Its frustrating when I don't understand what's happening, I'll be trying to google up parts of the question to have myself google up a part of the googled answer, it's very frustrating. I'm not sure if it was because of the girlfriend incident that's making me want to change majors, I don't really like pure math at all but the concept of coding is really interesting to me, I do find myself enjoying it sometimes and I do feel really cool doing it haha. Obviously the incident hindered me and ruined my learning experience in CS, I'm not sure whether it is me as person not enjoying the class or if it was her that made me not enjoy the class. I don't really know how to explain it, basically I went from variables loops stuffs like that and then hopped backed in at recursions and arrays, its all very confusing right now. Maybe it was a bad idea to take 2 math class and intensive writing class on the side? (probably was, especially when im not a math talented student). Honestly I don't even know if I make sense right now, I probably sound hella dumb trying to explain my entire situation. Over the years of taking career quizzes and personality exams they all recommend me trying computer science but like I don't really enjoy it I think? Am I suppose to look forward to this class every single day? Like am I suppose to be excited to wake up at 9 am (big mistake taking it at 9 am btw im not a morning person) in the morning for this CS class? It's like I enjoy it but I don't enjoy it, my brain is so conflicted I don't know how to explain it. How do I know if it's something I'd want to do for the rest of my life? One thing I do know is that I really do want to do something tech related. I really enjoy being near computers and doing computer related activities, it's one thing that I learned about myself when taking this CS class. I was looking at maybe IT but I really don't want to transfer college again. Should I retake the course alone next semester and see how it goes? Or should I just change majors into something else, I was looking at accounting business or graphic design. I heard the math in accounting isn't that bad, I'm fine with doing basic algebra I just really hate the complex math questions where you gotta use like 500 formulas on one question that has an part a to z in it. I'm worried about what to do next but I don't really want to delay my graduation anymore, I already delayed it by a year when I switched my major, I don't want to delay it even more. I have nothing against people who graduated late, I don't know why I get this feeling but I just have this random fear of graduating late, not sure why. Another thing is I feel so bad and guilty for wasting my dad's money. He's paying for my tuition, he didn't even want to pay for it in the beginning but my mom convinced him to do it. What am I suppose to tell him if I fail this class (which I probably will, I got a 6/40 on my first CS exam yeaa I didn't do good, 45/100 linear exam and 28/100 calc 2). I'm pretty much lost right now with what I want to do with my life, this post is probably really dumb but I just wanted to put it out there and see what your thoughts are. If I said anything confusing go ahead and ask a question, I wrote this on my phone past midnight while I was crying myself to sleep so there will probably be some confusing sentences here and there. Your mentally broken home boy is extremely confused with everything and needs some guidance.\n\nI'm a 20 year old dude enrolling in a CUNY college btw if you were curious.\n\nOh btw If I do pass linear algebra and calc 2 with a c- the only math class I'll have left will be probability, I was able to complete discrete math, pre calc, and calc 1. I'm just unsure whether I actually enjoy coding or not.\n\nWas gonna post this in a cs subreddit but I do wanna see what everyone else has to say about this.\n\nThrowaway Account",
  "author": "GaminW",
  "created": 1637480034,
  "updated": 1637689174,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hlhizy4": {
      "link": "/r/college/comments/qypw1t/should_i_stick_with_my_cs_major/hlhizy4/",
      "text": "I haven't been 20 since I was, well, 20... so please take this tough love as advice from experience. At 20, a bf could have not responded to a text in 5 minutes and I would have failed my exam thinking about it. And I did, which is why I came full circle back to college now. Over the past semester and a half my husband went to jail for a year, my kids and I lost everything, we've been without a permanent home for 2 months, and I have destroyed my finances trying to survive and overcome it. Still maintaining a 4.0 to this day. When you have a little more life experience that I have clearly gained since failing exams over texts, you are able to prioritize your emotions towards your future instead of towards what obviously wasn't. The whole \"cutting off your nose to spite your face\" thing. My advice is to stop making any big decisions. Major, school, classes... for right now, you are not in the headspace to make  good ones, so just stop. Also, please stay out of relationships for a bit. Recover, glue your head back on after this semester, and make a rational decision about moving forward. Maybe revisit college later, maybe do this semester over, maybe do something else entirely. Cross that bridge when this semester ends. For the next month, stop thinking.",
      "author": "Mammoth-Title-2102",
      "created": 1637481627,
      "upvotes": 3,
      "replies": {}
    }
  }
}