{"sid": "mq78fu", "link": "/r/college/comments/mq78fu/sad_about_graduating/", "title:": "sad about graduating?", "text": "I'm a senior and I'm graduating in less than two months. I'm excited about living as a post-grad in my 20s, but I can't shake the feeling that I'm losing a sense of community and connectedness on my college campus that I may never have again. Does anyone else feel this way?", "author": "matthewmacgugan1", "created": 1618335265, "retrieved": 1632948106, "over_18": false, "upvotes": 576, "upvote_ratio": 0.99, "comments": {"guikpf6": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guikpf6/", "text": "I graduate next year but I have the opposite opinion. I'm ready to GTFO. I feel so mentally and emotionally drained out because of college. It's been one long thankless grind. I've had some good times here and there but I would not call college the \"best years of my life\"", "author": "WittyImprovement", "created": 1618424546, "upvotes": 1}, "guht9c9": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guht9c9/", "text": "yup same boat I'm done in a few weeks very bittersweet", "author": "lilwonderboy808", "created": 1618412655, "upvotes": 1}, "guh8lok": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guh8lok/", "text": "I wish. I would be happy when I finally get out of my shitty college. Bad management, bad professors, bad experiences. I would be relieved of a burden.", "author": "NoobyDGaming", "created": 1618402136, "upvotes": 1}, "gughaby": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gughaby/", "text": "Prof here. I graduated into the 2008 recession, so I feel some kinship with COVID graduates.\n\nWhen I felt the same creeping sense of dread about graduating, I asked my professors what to do. They told me two things:\n\n1) You'll figure it out \n\n2) You'll be okay\n\nI've spent a lot of time thinking about what I wish they would've told me. They were right and wrong. I am okay, and I have figured some things out--but what they didn't tell me was how hard and un-okay many things would be, how hard the figuring. \n\nOne of the first things I realized as a recent graduate is how everyone at college cares for you, from your advisors to the dorm cooks. They want you to succeed, either because they're paid to do so or because they're just kind. But the \"real world\" is not college; people are paid for many other things and generally don't give a shit about you, even when you're struggling in plain sight. They've got their own struggles.\n\nIt was a sad realization. It was also important, because I realized that I'm a person who cares no matter what. Maybe that's why it was so hard for me, but it also gave me information. It's been over ten years (yikes lol) but I've done caring work (teaching, tutoring) that I love more than anything. I have friends whose caring inspires me, and who I trust to take care of me. The tough transitions keep coming--you do not graduate into an adult, get married, have kids, and fuck off--but I've lived through enough of them to remember, to remind myself how alive toughness makes me feel. And even when it's tough, there are always okay moments if you look for them.\n\nI'm not going to tell you you'll be okay and that you'll figure everything out. I don't know! Maybe you'll fall off the edge of the Grand Canyon trying to get a good selfie. Maybe you'll never figure out math because you have dyscalculia like me. Oh well. It would also be boring if okayness and wisdom were guaranteed. What I put my faith in is your inherent weirdness, whatever you can't stop yourself from doing, the things some people hate about you but that your friends (and you) love. Because everyone has those things. Cling to them, worship them, protect them, and they'll keep you okayed and figured. \n\nAnd even if you forget about and abandon those things, don't fear. The most precious parts of you will always be safe somewhere, waiting for you.", "author": "brownidegurl", "created": 1618378186, "upvotes": 3}, "gugcai6": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gugcai6/", "text": "I graduated last May, and I had the same apprehensions as you and a lot of the seniors in this thread. I’ve always been socially awkward, and I would sometimes marvel at the fact that I’d even managed to find friends in college. Add the pandemic on top of that and it didn’t look good.\n\nHaving now been out of college for a little under a year, I can tell you that recent college grads are just as eager for the same kinds of friendships as college students are. You’ll probably have to go more out of your way to find those people in the first place — but once you find them, it’s *mostly* the same situation as college. In my case I was lucky in that I found those people among my coworkers, but for you it might be in a local group or club, or through a hobby. Not going to go into this too much more, but there are a lot of threads around the internet where people ask how to make friends as an adult, and they’re often full of really helpful advice.\n\nI won’t say it’s entirely the same. The most important difference is that you have to be more intentional about your friendships and spending time with people, since you can’t count on just seeing your friends in class or at your usual spot in the dining hall. That’s definitely a skill I struggled to learn at first, and I’m not going to say I have it down now, because I don’t. But it will vastly improve your post-college social life.\n\nTl;dr: The transition out of college is definitely hard, but there’s no reason you can’t have the same kind of friendship and community you had in college after graduating. It’s harder, but it’s 100% possible, and it’s worth it.", "author": "secondpriceauctions", "created": 1618374535, "upvotes": 3}, "gug34l6": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gug34l6/", "text": "It’s like when you first went off from highschool and then came to college- everything will be ok. Change is always scary", "author": "Catbug94", "created": 1618368880, "upvotes": 1}, "gug2vio": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gug2vio/", "text": "I graduated several years ago and felt the same way. If you really enjoyed the college experience and the community/environment, then I think it's to be expected.\n\nI moved out of the dorm the day after graduation and it really hit that night as my friends and I were decompressing from the day full of activities. My friends that I had on-campus for four years are now spread out across the Midwest and Southeast, but I'm thankful for our time together and that we are having success in the fields that we prepared for during our college years.", "author": "BourbonCoug", "created": 1618368737, "upvotes": 1}, "gug2hx7": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gug2hx7/", "text": "Lol felt this I’m taking an extra semester cuz I’ll be a senior this year", "author": "lilaczebraaaa", "created": 1618368526, "upvotes": 1}, "gug0xwz": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gug0xwz/", "text": "Yeah it’s definitely bittersweet. I graduate in June. I had all these plans for an awesome senior year & it all went out the window with COVID. \n\nBut even still, in these last 2 months it’s like I want to stomp on the break pedal. I want to soak up these last moments. I can honestly say that college has been the best years of my life. It’s gonna be tough to leave this behind.", "author": "ih8uheaux", "created": 1618367661, "upvotes": 1}, "gug0jk3": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gug0jk3/", "text": "I'm a few years post graduation at this point, but I definitely remember having that feeling. It was a bit surreal to think that that was the last time I would ever see some of my friends.", "author": "Birdy1072", "created": 1618367440, "upvotes": 1}, "gufxoen": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gufxoen/", "text": "I graduated last year. It’s an adjustment to go from college adult to full time working adult. You will lose a lot of friends, but you will realize that they were friends of proximity that you spent time with because you were in the same area, the time just does not exist to keep tons of close friendships. You will keep a few friends and they will be quality friends, quality over quantity. After school everyone thrives in different jobs in different locations and it takes more energy to keep up with people when they don’t live in the same town, or even state anymore. The people that I still keep up with are people I want in my life for awhile. \n\nStart saving for a car or a trip or something that you wouldn’t have been able to afford to do in college. Enjoy some free relaxing time on weekends without worrying about upcoming exams. Each transition in life comes with pros and cons, but it’s important to take some time to figure out more pros so you can live in the present.", "author": "anonymous_gam", "created": 1618365914, "upvotes": 2}, "gufso55": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gufso55/", "text": "I just want to move forward from this zoom U. Just giving my best right now", "author": "Rmaranan1999", "created": 1618363322, "upvotes": 1}, "gufjycb": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gufjycb/", "text": "I have never once felt a sense of community or connectedness during my time here lol.", "author": "needhelpne2020", "created": 1618358796, "upvotes": 3}, "gufhonn": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gufhonn/", "text": "I get that feeling regarding my lecturers. I will miss listening to them. Like yes I follow them on Twitter or LinkedIn but it's not quiet the same", "author": "astonaidan", "created": 1618357613, "upvotes": 1}, "gufhkf8": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gufhkf8/", "text": "Yes I felt the exact same way! Something about the campus life that molded my young adulthood. I’m forever grateful for the memories and hardships that came with college life!", "author": "Alternative-Pie-5941", "created": 1618357553, "upvotes": 1}, "gufg2m6": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gufg2m6/", "text": "Yes! I'm moving on to grad school this fall so my college time isn't completely done, but I love my current program and will really miss it. Plus, with everything being online this year, I don't feel like I got the same sense of closure with friends and mentors that I would have felt if we'd been on campus.", "author": "torgoboi", "created": 1618356768, "upvotes": 1}, "gufadrp": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gufadrp/", "text": "I feel the community has largely been gone ever since covid began, so I've already mourned and accepted the loss of that. Personally, I can't wait to graduate atm because I've been severely burned out from schooling for the past year and a half, however I am still sad it's all ending. It leaves a bittersweet taste in my mouth to see people go off into new directions.", "author": "CrimsonMassacre", "created": 1618353860, "upvotes": 3}, "guf8i50": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guf8i50/", "text": "I only know 3 people from my school and they all live in a 10 block radius from me so I don't mind. I just wanna get the fuck out as soon as possible.", "author": "DjSzymek", "created": 1618352895, "upvotes": 1}, "guf7u3z": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guf7u3z/", "text": "Hell no. I want out of this hell", "author": "remo25801", "created": 1618352557, "upvotes": 4}, "guf77wu": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guf77wu/", "text": "A few days ago I realized I've spent my entire life in the education system, worrying about assignments and grades. I am happy to graduate!!", "author": "kickitlikeadidas", "created": 1618352252, "upvotes": 4}, "guf75kb": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guf75kb/", "text": "Nope. Not at all. But I think a big part of that depends on what college experience you had. I could see someone who started and lived in the dorms for the whole four years feeling this way. But for someone like myself and I’m sure many others who worked close to or full time while attending school full time I doubt they feel sad about it. I’m excited to have a huge commitment off my plate in 4 weeks when I graduate. I also transferred in to a 4 year from community college, would go to classes then need to leave right away to go to work or home to attend other responsibilities. But if you lived or just spent a ton of time on campus and likely worked very little or none at all then I can see how you feel this way.", "author": "alion23", "created": 1618352220, "upvotes": 3}, "guf4kdg": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guf4kdg/", "text": "I'm sad I lost the ability to see my friends in person because I don't live close, as well as some of my professors I had. I'm counting down the days, though because I graduate in September and can't wait to get these stupid last major required classes done. My internship got pushed back so far because of COVID that I need to do a summer semester this year just to graduate.", "author": null, "created": 1618350925, "upvotes": 1}, "guf4agm": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guf4agm/", "text": "Definitely not a computer science major", "author": "memerG69", "created": 1618350789, "upvotes": 2}, "guf1ajq": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guf1ajq/", "text": "I’m a freshman and for many reasons I cannot wait to graduate. It can’t come fast enough. Maybe I’ll feel differently post-Covid.", "author": "Queasy_Repair251", "created": 1618349332, "upvotes": 2}, "gueyy13": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gueyy13/", "text": "No. \n\nI went to my undergrad university. Did two semesters and then deployed for a year. When I came back, all my friends graduated. When I went back to school covid hit. So for me, it's been years since I've interacted with friends.", "author": "TJkiwi", "created": 1618348181, "upvotes": 3}, "guevz4a": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guevz4a/", "text": "I'm sad about it too. I feel like I never got to enjoy college.", "author": "gabriey", "created": 1618346754, "upvotes": 11}, "gueuy86": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gueuy86/", "text": "You are leaving a community and it's healthy to feel kind of sad for it. Of course you can keep up some of the old friendships by going to alumni events and inviting people over. Try to keep going with some of the outside activities you did together, like playing sports or going to pubs if you did that before. Some of you will be lifelong friends, and others will become important professional contacts.\n\nI quit school the first time 40 years ago but I still see some of those friends because they stayed local.", "author": "GrannyGrunge", "created": 1618346289, "upvotes": 1}, "guepnpe": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guepnpe/", "text": "Something that I talk about often is how our title in this world is a “student” we can work and we can do other things in these 20 something years but we always had student attached to ourselves. Now what? We don’t have that comfort and sense of belonging. I’m sad to be graduating!", "author": "1autumnleaf1", "created": 1618343897, "upvotes": 8}, "guepawk": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guepawk/", "text": "I feel like I'd be sad after graduating, but for the time being I can't wait to fucking graduate.", "author": "rpj6587", "created": 1618343737, "upvotes": 2}, "guepah5": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guepah5/", "text": "No.  I'm ready to seize the world and shit !", "author": "OccupiedGarrett", "created": 1618343732, "upvotes": 2}, "gueogsj": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gueogsj/", "text": "Yup, I miss it, especially the freshman year experience. As much as I had problems with my university, I will definitely miss the memories and the community sense that you really can’t find anywhere else.", "author": "basicbiatch", "created": 1618343367, "upvotes": 5}, "gueny93": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gueny93/", "text": "Personally i'm glad it's finally ending because i can't take the pressure of exams, tests and everything anymore. I'm really looking forward to have more time for myself.", "author": "HolaMundo_97", "created": 1618343139, "upvotes": 4}, "guenkcv": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guenkcv/", "text": "The past is known, the present overwhelming, and the future is unknowable: the way you have been living for a while your near future was pretty well known, you were going to go to school every day until a break, and then you would go back the next year, and repeat until you are almost done. Now though it feels like you are staring off into an abyss this is normal, it looks dark from far away, but you have been walking in the light on a known path for so long you have forgotten you are carrying a light of your own. Its almost time to step out into the unknown but unless you have done this before it feels frightening almost, but trust me it does get easier: you start to find your way, but remember to enjoy the journey because the destination is the same for all of us.", "author": "bestjakeisbest", "created": 1618342966, "upvotes": 16}, "guemo5s": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guemo5s/", "text": "Yes. I’ve gone through 3 different schools (cc,uni,study abroad) and have found so many great ppl and experiences just by hanging around campus. I’ll miss running into people at the library or in the dorms. But there’s more to it tbh — being a college student in itself is an identity. You have so much potential and all the ‘hard’ decisions are always a few semesters away. Once we graduate that identity will be lost and you’ll actually have to prove yourself in the ‘real world’. I think people go about it different ways. Some join alumni clubs, go to all the sports events, and put school stickers all over their stuff. Other people find new clubs/communities in their chosen field or for their hobbies. I think it’s best to tap into other parts of your identity and find a community for that. It might not be on the same scale but it’s better than panic applying to grad school.", "author": "OmegaBornAndRaised", "created": 1618342575, "upvotes": 21}, "guelaqj": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guelaqj/", "text": "For sure, I especially hate the way it’s ending. Last year’s class only had to put up with a month of pandemic learning and had their ceremonies taken away, while I feel like this year it’s been a year-long whimper to the finish with a half-assed attempt by my uni for recognition. Not to mention some sophomores in my sorority did some dumbass shit to a couple of new members and caused us to lose everything (events, meetings, senior send-off, etc) just as we were clearing protocols to restart normal-ish operations. It crushed me.\n\nAt this point I’m just looking forward to getting out of here and starting grad school and feel lucky I get some more time in college doing what I enjoy, but I feel terrible for all the seniors on their last hoorah in college where fuckall is what they get.", "author": "piranhamahalo", "created": 1618341964, "upvotes": 18}, "guekpcz": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guekpcz/", "text": "Can't be sad about losing a sense of community if you never had it in the first place *taps head*", "author": "KaiserWilhelmDaThird", "created": 1618341706, "upvotes": 171}, "guekmpn": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guekmpn/", "text": "I definitely am sad as hell about it, can’t shake the feeling that I’ve lost potential amazing days, weeks, or even months of my youth to Zoom University. Now I feel this inescapable dread that is finding new friends, being alone in the world, and being an “adult” when I don’t even necessarily want to be. \n\nI hope life after college isn’t as lonely and soul crushing as I think it will be. I’ve met a lot of interesting people here and I hate to move on from it.", "author": "Shank_", "created": 1618341674, "upvotes": 96}, "guek908": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guek908/", "text": "I am currently a junior and tired of school. That being said, I know for a fact that when I am going to miss school when I graduate.", "author": "iamsojellyofu", "created": 1618341504, "upvotes": 24}, "guejobr": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guejobr/", "text": "Hah, I wish I felt this way. Been in Zoom university for over a year and haven't made any significant connections. Really I'm looking for that \"I did it!!\" feeling when I graduate.", "author": "unholymanserpent", "created": 1618341245, "upvotes": 202}, "gueig2k": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gueig2k/", "text": "Lol I’m a sophomore and I’m counting the days, I cannot wait to leave my school", "author": null, "created": 1618340684, "upvotes": 16}, "guefled": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guefled/", "text": "I'm sad about it too. I'm going to miss my friends when we're all separated in a few weeks. I'll be getting a Master's degree at my current college, so I won't be leaving permanently yet! I do recognize that it will definitely be different, though.", "author": "jlm2299", "created": 1618339389, "upvotes": 5}, "guebrsu": {"link": "/r/college/comments/mq78fu/sad_about_graduating/guebrsu/", "text": "exactly, I'm even thinking about a masters or something to make up for the time I lost", "author": "Ultumx", "created": 1618337671, "upvotes": 27}, "gue7ihe": {"link": "/r/college/comments/mq78fu/sad_about_graduating/gue7ihe/", "text": "Definitely. :(\n\nMy college used to host on-campus spring and fall concerts, seasonal \"crawls\" for those 21+ (i.e. Santa Crawl). We used to be able to check out anatomy models at the library and study in a big group of friends. My pre-med fraternity used to host in-person meetings for all 100+ members and it was one day every week that I'd be able to see and socialize with my friends without fail. This year has been tough, and my friends are graduating now - and I'll follow next semester - and it's a very lonely process. :(", "author": "gukkiecookie", "created": 1618335780, "upvotes": 147}}}