{"sid": "przjqr", "link": "/r/college/comments/przjqr/switching_majors_from_computer_engineering_to/", "title:": "Switching majors from Computer Engineering to Computer information systems maybe?", "text": "So I’ve been a computer engineering major for 3 years and I have found out I’m really hate circuitry work. So my advisor told me I should look into something else if I really dislike what I do. I also am not crazy about coding so that’s the reason on not just doing CS. I have done Calc 1-4, all my gen Ed’s physics 1-2, Computer science 1&2 and some more into computer engineering. I want to work with computers or like tech in some how I just do not want to work with circuits what so ever and I’m not a huge fan of coding as well. Im fine with minimal coding but any tips on what I should look into because right now I’m looking at CIS but I’m not certain I want to go into it yet.", "author": "Misterhoeee", "created": 1632158927, "retrieved": 1632801364, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hdodvo5": {"link": "/r/college/comments/przjqr/switching_majors_from_computer_engineering_to/hdodvo5/", "text": "I think CIS could be a good option if you want to do business/IT type work: setting up computer systems and using tech to address the needs of businesses. Another option could be computer science. I know you said you disliked programming, but depending on your curriculum, you may be able to take mostly computer science theory classes (advanced algorithms, cryptography, optimization, etc.) where there is little coding involved. Having that kind of mathematical background could qualify you for a lot of jobs in finance, tech, business, etc.", "author": "postmaloneismediocre", "created": 1632194878, "upvotes": 1}, "hdm71bo": {"link": "/r/college/comments/przjqr/switching_majors_from_computer_engineering_to/hdm71bo/", "text": "What job roles do you have in mind after college?  \n\nHave you undertaken any internships?", "author": "VA_Network_Nerd", "created": 1632159786, "upvotes": 2}}}