{
  "sid": "qzbyru",
  "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/",
  "title:": "Is college worth it? I really want to know because I'm close to giving up again. I'm lost",
  "text": "I really don't even know where to start. I'll be as brief as possible. \n\nI'm 26, with two young kids, and im poor. I know, I know. I shouldn't have had kids without at least having a fucking career first. I realize this. I live with my grandparents and have since 2018. I've been in and out of college for close to 8 years now and feel so stupid for not having a degree by now. I've been to tons of different colleges. 2 or 3 community colleges and the same university twice now. If I can finish my associates in May like planned, I'll be going to the university for the third time. I have to take college algebra and I'm so bad at math I could cry just thinking about it. I haven't done pre algebra since 2013.\n\nThe reason it's taken me so long is 1.) Having young kids who aren't both in school really is a distraction. 2.) My mental state in the past couple years has been awful. I've suffered from moderate-severe depression and tons of anxiety about not having a major. I go from being very confident in having chose a major and then I switch it or completely drop out. I've dropped out probably 3 times or \"taken breaks\". Whatever you wanna call it.\n\nAnother issue is that I can't figure out what's even worth getting a degree in. Literally EVERY single thing I'm interested in, im told is a waste of time and I don't need a degree to do it. For instance, I love writing. I was thinking of doing a journalism or creative writing degree. Possibly English because I'm passionate about all of those. I'm told it's worthless and I won't find a job. Criminal justice was another idea. Again, worthless apparently. Library science. Worthless. I was a fine arts major once and was told I wasn't good enough to do it. That was soul crushing. I could go on. Seems like no matter what I chose to do, I'm going to question its validity in finding an actual job. I don't know what to do anymore. I'm losing interest in everything I once really enjoyed. \n\nI'm already writing too much and no one will probably read this far. My main question is, what can I get a degree in 2 years or so, make okay to good money, can support two kids with, provides medical insurance, and something I can retire doing. Also does it require a degree or not? Is college really worth it when you're so indecisive and have no direction in life? \n\nI'm losing my mind and the years are just passing me by. I'm getting nervous and worried I won't ever leave my grandparents house and be self-sufficient. Please, I need real advice.",
  "author": "ladylavenderrrr",
  "created": 1637551927,
  "updated": 1637689126,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hllj0hc": {
      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllj0hc/",
      "text": "Actually, all the degrees you listed are needed if you want to go into those career fields.  Those aren't fields you can't really get a job in without a degree (preferably a Bachelor's).  Sounds like you need to figure out what you really want to do with your life long term and stop taking advice from people who maybe shouldn't be giving it. I would also recommend seeing a therapist if you can to help you deal with your mental health and decide what you want to do. With a journalism degree you can look into working for your local news sources (it will take a while to actually get a writing job but it will help get you in the door and work towards it).  A library sciences degree you can work as a librarian in any library.  With a degree in criminal justice there are lots of directions you could go depending in what you want to do - dispatch work, parole/probation work, social work, case worker for private organisations, work for private companies processing background checks on potential employees, combine it with psychology and become a therapist to name just a few.",
      "author": "1976Raven",
      "created": 1637552669,
      "upvotes": 4,
      "replies": {
        "hllk2pl": {
          "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllk2pl/",
          "text": "I honestly was interested in forensic science more than anything but I'm pretty sure you need even a higher math than algebra. Forget about it lol there's no way I can do Trig or calculus. If I were to go into criminal justice, which is what I'd probably choose, I wanted to be a cps worker. All those babies and kids who are being abused and neglected that need help. I would love to be able to help even a small portion of the country's suffering child population..but I've heard cps workers have a bad reputation and they're hated. I guess I could do social work... I'm big into psychology so maybe I could be a therapist? Idk. I need to figure it out, you're right. I'm only getting older and I can't be 30 without a job. There's no way. I've always been told by my grandma I'd make a good lawyer..but that takes more than 2 years I'm assuming?",
          "author": "ladylavenderrrr",
          "created": 1637553197,
          "upvotes": 2,
          "replies": {
            "hllnxmq": {
              "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllnxmq/",
              "text": "Yea, unfortunately forensics requires a lot of math and science which is what kept me from going for a major in it (I have dyscalculia).  I'm a criminology major but honestly am not 100% sure what I want to do with it.  My dream job would be a caseworker for NCMEC (I live near their HQ in VA) but I think they can be difficult to get in with.  I've also considered victims services.  I'm 45 have been attending school off and on part time since the mid 90's (having kids, mental health issues, ill parents and just life in general getting in the way) and hoping to finally get my Associates next Fall and am still debating if I can afford to go for my Bachelor's degree when I finish - my oldest daughter is also in college and I have 2 younger ones in elementary and middle school.  I've been debating adding a second major to my current program as I'm also only a few classes short of an Associates in psychology as well (I tend to take random classes that I just have an interest in as well). You are correct that getting a law degree will take much longer than 2 years, if you go full time you're looking at 7 years (need a Bachelor's then I believe law school is 3 years after that).  You can get a paralegal degree in 2 years if your school offers it and you're interested. CPS is a great field to go into, and while they're hated they are hated for the right reasons in most cases.  The important thing regardless of what you decide is that you like the work you are doing.  You can always get your Associates and use that to get an entry level job then when your kids start school you could look into going back to school part time to extend your education and get farther into whatever field you decide on.",
              "author": "1976Raven",
              "created": 1637555177,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hllk7wt": {
      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllk7wt/",
      "text": "Have you thought about working in any trades? Typically less cost investment, less time investment and a decent pay off.",
      "author": "Lylleth88",
      "created": 1637553271,
      "upvotes": 3,
      "replies": {
        "hllkz24": {
          "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllkz24/",
          "text": "Is phlebotomy a trade? Probably not but I did try that. Got certified and passed my class with an A. No one wanted to hire me because I had no real experience besides clinicals.",
          "author": "ladylavenderrrr",
          "created": 1637553647,
          "upvotes": 2,
          "replies": {}
        },
        "hlll38h": {
          "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hlll38h/",
          "text": "I have thought about it yes. I should honestly just do that. I know im smart enough for a bachelors but I'm kinda running out of time and I need money and my own place for my kids like, yesterday.",
          "author": "ladylavenderrrr",
          "created": 1637553707,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hllmf4i": {
      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllmf4i/",
      "text": "Ok I found out I can get a criminal justice AAS degree in a year or less. What kind of jobs can I get with that? Paralegal perhaps?",
      "author": "ladylavenderrrr",
      "created": 1637554395,
      "upvotes": 1,
      "replies": {
        "hllulzl": {
          "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllulzl/",
          "text": "Paralegal has a specific certificate, and it wouldn't require math. \n\nIf you have the phlebotomy certification, you should find out if you can take a refresher so you can work. There's such a shortage right now that you can get a job. \n\nNext, I'm going to suggest getting a nursing assistant certification, then working on your lpn. You can be a real nurse in 2 years full time, and if you get the aide certification, you can work all the time in a nursing home while you go to school. You can take night shifts and study while patients are asleep.",
          "author": "CindsSurprise",
          "created": 1637559002,
          "upvotes": 1,
          "replies": {
            "hllvrv3": {
              "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllvrv3/",
              "text": "I had pretty bad anxiety when it came to actually drawing people's blood. I wasn't bad at it, I only missed a few times during clinicals, but every time a new patient came in the room I'd have a mini panic attack. I would do it just fine but mentally I'd be freaking tf out. What if I hurt them? I'd never forgive myself.",
              "author": "ladylavenderrrr",
              "created": 1637559735,
              "upvotes": 2,
              "replies": {
                "hllw76h": {
                  "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllw76h/",
                  "text": "So look at what you have towards paralegal and nursing aide. Aides have more demand, but they don't have as interesting work as paralegals.",
                  "author": "CindsSurprise",
                  "created": 1637560013,
                  "upvotes": 1,
                  "replies": {
                    "hllxrqh": {
                      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllxrqh/",
                      "text": "I'd rather be a paralegal.",
                      "author": "ladylavenderrrr",
                      "created": 1637561054,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hllmqo4": {
      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllmqo4/",
      "text": "Pastry arts / culinary field is actually kinda interesting too... omg I'm so lost. I need a guru or some shit lol.",
      "author": "ladylavenderrrr",
      "created": 1637554558,
      "upvotes": 1,
      "replies": {}
    },
    "hllo0qh": {
      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllo0qh/",
      "text": "Can you set up an appointment with your community colleges career advisor? Get an aptitude test done? There are non college careers like banking, real estate, insurance, sales, opening your own business like a maid service or lawn care. I mean the world is your oyster. 🦪there’s also retail management Trader Joe’s and Whole Foods pay 6 figures I heard for retail management.",
      "author": "beanie1816",
      "created": 1637555224,
      "upvotes": 1,
      "replies": {
        "hlloc9z": {
          "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hlloc9z/",
          "text": "I've tried to talk to a career counselor several times there and they have helped me almost none. Whats an aptitude test? Is that like an IQ test?",
          "author": "ladylavenderrrr",
          "created": 1637555389,
          "upvotes": 1,
          "replies": {
            "hlloge7": {
              "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hlloge7/",
              "text": "It measures what your good at. It asks your likes and dislikes then recommends careers.",
              "author": "beanie1816",
              "created": 1637555445,
              "upvotes": 1,
              "replies": {}
            },
            "hllol7g": {
              "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllol7g/",
              "text": "You can ask your community college advisor about taking one. It’s free.",
              "author": "beanie1816",
              "created": 1637555514,
              "upvotes": 1,
              "replies": {
                "hllotdo": {
                  "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllotdo/",
                  "text": "I'm surprised they've never offered considering how many times I've been in their office.",
                  "author": "ladylavenderrrr",
                  "created": 1637555632,
                  "upvotes": 1,
                  "replies": {
                    "hllqb4p": {
                      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllqb4p/",
                      "text": "Huh maybe they don’t have it that was my go to reference for indecisive students when I was a peer assistant. It’s worth an email at least. College is requirement for many jobs it’s a prerequisite just like you described math. Not all jobs require a college degree but many do. I started in poverty and at 24 I woke up got my ged and went to community college. I chose business and applied for internships. Business is a respectable and doesn’t require calculus (at least that’s was the case at my school) you might have a tough time with stats. But if you went to psychology to really make money you would have to at least get a masters and the real stability is phd. That might not be your path. Social work is not where the money is. People get paid really low. Any kind of helping others pay when you are the manager and leading. Writing for grants and talking to donors. If you want to help other medical might be good but that’s a lot of science. Culinary can be great but a lot of food places have slim margins.  They also require working off hours. I’m biased to business but it’s not the only path. Do you know anyone successful? Can you do an informational interview with them?",
                      "author": "beanie1816",
                      "created": 1637556436,
                      "upvotes": 1,
                      "replies": {
                        "hllr3u4": {
                          "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllr3u4/",
                          "text": "All of what you said is true. See my dilemma? Lol. I don't know many \"successful\" people. A lot of my friends are amazing artists and some are tattoo artists that make thousands a day. I'm not talented like that.",
                          "author": "ladylavenderrrr",
                          "created": 1637556888,
                          "upvotes": 1,
                          "replies": {
                            "hllrq9j": {
                              "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllrq9j/",
                              "text": "You can ask them if they know anyone in the fields your thinking about. Network. You can also ask any clubs like honor society, or any career specific clubs if they have any graduated advisors. Also asking your professors or department heads. I would just make a project of it.",
                              "author": "beanie1816",
                              "created": 1637557253,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hllp2gl": {
      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllp2gl/",
      "text": "Also, what's the best way to take algebra when you're awful at math? Online or in person? I'm so nervous. I have 4 classes to finish my associates degree. Public speaking (easy), a computer class (easy), algebra and another 1 hr p.e. or health course (easy).",
      "author": "ladylavenderrrr",
      "created": 1637555763,
      "upvotes": 1,
      "replies": {
        "hllxh3d": {
          "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllxh3d/",
          "text": "Do NOT take an online math class if you are not naturally gifted at math. Also, most universities and cc's have tutoring centers. Go everyday, they're there to help!",
          "author": "Mammoth-Title-2102",
          "created": 1637560854,
          "upvotes": 1,
          "replies": {
            "hlly1t6": {
              "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hlly1t6/",
              "text": "I haven't done pre-algebra in almost 10 years. I know the college offers a different algebra class that also goes over the basics of pre-al and then goes into algebra. I'm going to definitely have to take that class. I do plan on using the learning lab every day. I just always worry about my kids at home without me. Stupid anxiety.",
              "author": "ladylavenderrrr",
              "created": 1637561243,
              "upvotes": 2,
              "replies": {
                "hllyfl8": {
                  "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllyfl8/",
                  "text": "I get it. I really do. My 2 kids are now 13 and 10, and I'm remarried with a 2 year old. From experience, they aren't going to remember that they were there without you while you went to school. What they are going to remember is the difference that letting go of the anxiety and guilt and doing what makes you happy makes in your parenting when you are there.",
                  "author": "Mammoth-Title-2102",
                  "created": 1637561507,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlluxyx": {
      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hlluxyx/",
      "text": "[removed]",
      "author": null,
      "created": 1637559211,
      "upvotes": 1,
      "replies": {}
    },
    "hllx5l9": {
      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllx5l9/",
      "text": "I'm not going to answer the question you asked because I can't tell you what to get a degree in. What I can tell you is that I also went back to school as a single mom of 2 when I restarted, and it wasn't to make more money. There's something more important than that and it's why you should get your degree in whatever you really want. You have the opportunity to show your kids that, just because someone may have children at a less than ideal time in their lives, being a parent doesn't mean you have to stop pursuing your own dreams and happiness. Do you want your kids to believe their goals in life are basically dead should they ever find themselves in a similar situation? Then don't let them see that that's what happens, because it doesn't have to. You being happy is the greatest life you could give your kids.",
      "author": "Mammoth-Title-2102",
      "created": 1637560639,
      "upvotes": 1,
      "replies": {
        "hllxwfo": {
          "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hllxwfo/",
          "text": "I do agree with you, I guess I'm just panicking because I need to figure something out and quick. I've procrastinated way too much and it's time to buckle down.",
          "author": "ladylavenderrrr",
          "created": 1637561140,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlm8fjs": {
      "link": "/r/college/comments/qzbyru/is_college_worth_it_i_really_want_to_know_because/hlm8fjs/",
      "text": "As someone who has been struggling to pick a major, man I felt this. I’ve done a lot of research in terms of different jobs, what they entail, pay and so forth, so what people have told you about the different degrees/fields you are interested in is correct, but to an extent. \r  \n\r  \nFor Journalism, it’s not a useless degree (in my opinion no degree is useless), but in terms of what you are looking for in a job (make okay to good money, can support two kids with, provides medical insurance), now that's hard. Being a journalist does not pay well at first, and it takes time to find stability in. It’s not impossible, but it will take hard work and time and, more importantly, time that you have to be okay with not making good money. \r  \n\r  \nFor English, I think this is a really useful degree if you utilize it well. You can go into a variety of fields with it, and the good thing (or bad depending on your personality) is your job outlook mostly depends on being able to market yourself. I think the most obvious of career paths to go from this degree is to teach, but that would take more schooling.\r  \n\r  \nFor Criminal Justice, definitely not a useless degree, but the jobs that you can get from it either don’t pay well, are highly competitive, or you need more schooling. You mentioned being a social worker, and I definitely think that we need more social workers, but from what I’ve gathered, the pay isn't good and people are very overworked. \r  \n\r  \nFor Library Science, you can get a job, but you would definitely need to do more schooling and jobs are highly competitive. This is one career path that I was really looking into and it broke my spirit when I found out how hard it is to actually get a job in this field. Most people get at least a Masters and they have to move to even find a decent paying job. \r  \n\r  \nThis is all to say that it definitely isn’t impossible to find a job with these degrees, but it will take time and most likely more education. I also want to say that obviously I’m not an expert in these fields, this is just the information I’ve gathered while researching jobs, so take what I say with a grain of salt.\r  \n\r  \nI’m also gonna be honest here and say that wages to cost of living are overall terrible, just in general. Most jobs, even with degrees, are paying way less than they should be. From months of trying to find jobs/fields that pay a decent wage, it seems you need to do more schooling, or have years of experience to make a good income. This applies to STEM degrees as well. Most of those with biology, chem, or physics degrees need to do further schooling/specialization to get stable/well paying jobs, so it’s not just you facing this problem, most of those entering the workforce are facing this problem. \r  \n\r  \nI would look into a trade if you want to do minimal schooling and get a decent pay. I’ve seen people mention being a paralegal or a nurse assistant which are both great jobs to go into if they interest you. You can also try and start your own business if you want to do something more art centric. Some other non mathematical/science careers are: real estate, interior design and graphic design. Overall, this is daunting and it sucks that jobs can't be more exact/secure after getting a degree, but there are opportunities out there and I think once you find what interests you, you’ll feel more secure/motivated regardless of what job/field you choose. Good luck!",
      "author": "reefxyz",
      "created": 1637569003,
      "upvotes": 1,
      "replies": {}
    }
  }
}