{
  "sid": "k089ay",
  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/",
  "title:": "Here's what might happen to you if you get caught cheating",
  "text": "Well, I never thought this would happen but it did. As we all know, online courses have been a mess this semester. In particular my chemistry class has been hell. Our average test scores are 20%-30%. I usually get lower, and chemistry has never been my strong suit. \n\nSince this is reddit, im not going to lie. On our 3rd exam last week I was having trouble with a few questions. Our tests are technically open note, but I went to the one place that is usually off limits: chegg. I searched some questions and some people had clearly copied and pasted the exam questions to chegg, and received answers. To my credit I did look at the explanation of questions and figured out how the answer became to be, but ultimately I did see the answer and therefore put that answer into my exam. \n\nYesterday my professor sent an email about how people posted the exam questions on chegg and how my schools Dean Of Students would be contacting chegg to request who posted the questions AND who accessed the questions. He mentioned how the penalties will be lesser if those who cheated came forward on their own. So I did. \n\nBecause I came forward and its my first offense, my punishments include a 0 on the exam, have to take an online academic integrity course, and get an official report filed at the Dean of Students just to have it on record in case I offend again. The real part that sucks? I work within the Dean of students which makes this 10x more embarrassing. Im pretty sure nothing will happen to my employment, but there's still a worry in the back of my mind. \n\nI never thought about using chegg to be honest. All of my roommates use it even on exams and a lot of other people in my class cheated on this exam as well. Its so common I didn't think anything would happen. But it did and its my mistake and I take the consequences. \n\nBasically. I want this to be a warning. I've learned a huge lesson, and I deactivated my chegg account. Id rather get a C in the class vs getting suspended from my university. Even though my punishments can be seen as mild, it certainly wasn't worth it.\n\nEdit: there are people calling me dumb and an idiot in the comments because they believe my professor tricked us into confessing. I dont know exactly what to believe, because on cheggs policy they say they can and will give out extensive information on who accessed certain questions, meanwhile threads on r/professor say differently. The point is no matter if I was baited or not, I learned my lesson from looking at chegg and won't be doing it again. I find it takes my integrity to admit mistakes then try to get away with everything. Sometimes its just better to receive the necessary punishment and learn for the future.\n\nAlso, everyone is asking why on earth id use my real name on my account. I did so because I truly didn't start my chegg account to cheat, and when I looked at questions during the exam I wasn't even thinking about it because its so common to use chegg. Yes it would have been smarter to not use my name, but understand that I didn't start my chegg account with the direct attention to cheat.",
  "author": "morfoodie",
  "created": 1606235453,
  "over_18": false,
  "upvotes": 1672,
  "upvote_ratio": 0.98,
  "comments": {
    "gdghetr": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdghetr/",
      "text": "Thank you for sharing your experience. Normally we remove posts about cheating because they result in a bunch of people advocating for cheating. I’m going to leave this up because it’s valuable info.\n\nPlease report any comments promoting illegal/unethical behavior.",
      "author": "Laurasaur28",
      "created": 1606235853,
      "upvotes": 1
    },
    "gf69bnp": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gf69bnp/",
      "text": "Uh ... I didn’t actually realize these sites were mainly for cheating. Also, I do think your teacher baited you, but whatever. You took something from it.",
      "author": "BanannyMousse",
      "created": 1607526904,
      "upvotes": 1,
      "replies": {}
    },
    "gdmpnm4": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdmpnm4/",
      "text": "Yeah, I had to stop using Chegg bc I was getting too paranoid. I got lucky that I was never caught. I switched to Quizlet and Brainly bc I think they’re safer (but I only cheated for one class and never did it again after that).",
      "author": "thisistherealmee",
      "created": 1606367951,
      "upvotes": 2,
      "replies": {}
    },
    "gdmg1b3": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdmg1b3/",
      "text": "Anti-plagiarism isn't designed to stop cheating.  It's designed to stop people who are bad at it.  Next time try not being so blatant.  I hate to be harsh but you got caught cheating on an open note exam.",
      "author": "FinalSniper",
      "created": 1606361424,
      "upvotes": 1,
      "replies": {}
    },
    "gdjy3p2": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjy3p2/",
      "text": "First, I commend you for coming clean.  Many people cheat at sometime in their lives (human nature) and it's what you do afterwards that shows who you really are. If you can still get a C in a class with a 0 on an exam you weren't doing that bad to begin with, but that's not the issue.  Learn from it and move on.  When you are a out in the real world in the future, you will probably think twice before attempting something like that again.  College is for learning and my guess is you learned.",
      "author": "GreyMatter399",
      "created": 1606312908,
      "upvotes": 3,
      "replies": {}
    },
    "gdjuzxp": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjuzxp/",
      "text": "Why is Chegg off-limits?",
      "author": "whydoesSATexist",
      "created": 1606310815,
      "upvotes": 1,
      "replies": {
        "gdjv3po": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjv3po/",
          "text": "I mean, is it just Chegg that has this ability to allow investigation? How about quizlet?...",
          "author": "whydoesSATexist",
          "created": 1606310888,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gdjuxr5": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjuxr5/",
      "text": "I was academically dishonest in Chem 111 as well. happened once- NEVER again. I was contacted by student affairs. For reference, i have a 3.6 cumulative GPA, and this was my first offense. I received a 0 for the quiz (it was 5 questions..not at all an exam lol.) My penalty was the low grade as well as writing a paper on my university’s ethics code. there is note of it in my student conduct file but this is confidential and, in my case anyway, will not go on my transcript. it’s a shitty process and a shitty feeling, but just remember you 100% deserve all the guilt and embarrassment you’re feeling right now and I hope that deters you from every cheating again.",
      "author": "ohmymycelium",
      "created": 1606310772,
      "upvotes": 0,
      "replies": {}
    },
    "gdjrn8e": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjrn8e/",
      "text": "lmfao brooooooooo NEVER PUT YOUR REAL INFO ON CHEGG THATS THE WHOLE POINT 😂",
      "author": "grubbycoolo",
      "created": 1606308269,
      "upvotes": 2,
      "replies": {
        "gdl3e9i": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdl3e9i/",
          "text": "When you aren't intending to use chegg to cheat you don't really think about it",
          "author": "morfoodie",
          "created": 1606333975,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gdjl9oa": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjl9oa/",
      "text": "I have learned a lot from the comments. Thanks ig",
      "author": "muntakimhk",
      "created": 1606302311,
      "upvotes": 2,
      "replies": {}
    },
    "gdjh30m": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjh30m/",
      "text": "So like does chegg tell them which accounts accessed the questions with the names and posted them, or do they report IP? \n\nGenuinely curious. I’ve never used it.",
      "author": "Niarah",
      "created": 1606297953,
      "upvotes": 2,
      "replies": {}
    },
    "gdj9yhr": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj9yhr/",
      "text": "20-30% average? Seems a little strange...",
      "author": "sleepy_scav",
      "created": 1606291077,
      "upvotes": 6,
      "replies": {
        "gdl3bwr": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdl3bwr/",
          "text": "Just a combination of hard material and poor teaching 🤷‍♀️",
          "author": "morfoodie",
          "created": 1606333943,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gdj8qut": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj8qut/",
      "text": "Most times than not students copy. Other times, there are cases like this:\n\nLast year there was this assignment in my years' class (which I didn't take with them because issues) where something went wrong, and like 5 students, not even bed students, had trouble understanding the assignment material or something. so they did what every student does when they feel they can't ask the professor/ta/etc... went searching the internet for alternative answers.\n\nSomehow, even though they did the final assignment individually and I know at least one of them didn't actually copy their stuff from the net word by word, their essays ended up being similar enough the professor called them one by one into his office and basically interrogated them military style  about plagiarizing and copying off each other. But eventually he accepted their complains about *him* not being clear enough and that the works have similarities because.... well what do you expect when *you're* the one providing the same essay topics to everyone?\n\nYes, the professor is the one who assignment each student what their essay is gonna be about. The students didn't get to pick their topics. Yes, these topics were recycled - it's a class of like fucking over 50 people. OF COURSE some of the final works are gonna look the same! Not to mention the students had to it in groups, so like... I didn't hear the professor's side of it, but what gives??\n\nLike it was so ridiculous, to the point that if the some students even tired to just *help* one another, like beta-reading, fixing error, rephrasing, grammar, etc, they could get suspected for copying.\n\nI'm taking this course this year, with another class of students but the same professor. I'm gonna have a talk with my study partner later to warn him about this. Might as well warn the rest of his year, just in case.",
      "author": null,
      "created": 1606290012,
      "upvotes": 2,
      "replies": {}
    },
    "gdj4qyl": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj4qyl/",
      "text": "Chegg is a snitch that gives out your ip and other info to colleges who request it and they can connect the dots and see who's cheating",
      "author": "Iko_syco",
      "created": 1606286695,
      "upvotes": 7,
      "replies": {}
    },
    "gdj3c23": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj3c23/",
      "text": "It’s called integrity. And you’ve got it! Congratulations.",
      "author": "labluesue",
      "created": 1606285600,
      "upvotes": 6,
      "replies": {}
    },
    "gdizjac": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdizjac/",
      "text": "And then there’s me, not even aware that chegg supplied answers. -_-",
      "author": "rosenwaiver",
      "created": 1606282781,
      "upvotes": 1,
      "replies": {
        "ge570k2": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/ge570k2/",
          "text": "Then there’s me who knows that chegg (a lot of the time) have wrong answered and wrong/weird processes/steps so when you have to show your work on an exam the prof knows that somethings up",
          "author": "yslwej",
          "created": 1606741070,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gdizavg": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdizavg/",
      "text": "With approval from the dean (or whoever handles academic honesty cases) chegg does give out info.  I had students cheat in the same way you are explaining. Chegg provided us with time stamps of when they access the content - this includes poster info and viewing info. \n\nAdditionally, chegg lets you search by days, so it’s relatively easy to view posts by date and see if content is being posted. \n\nI’d like to also add, the answers on chegg are often weird/wrong. This is one of the most common ways we figure it out.",
      "author": "drluhshel",
      "created": 1606282617,
      "upvotes": 5,
      "replies": {
        "gdpom7c": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdpom7c/",
          "text": "So Chegg keeps the timestamps of the viewers? There is an integrity investigation going on in my class, I was not on chegg during the exam time but I was curious and searched up the questions weeks later.",
          "author": "myfriendmickey",
          "created": 1606432571,
          "upvotes": 1,
          "replies": {
            "gdpu5ds": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdpu5ds/",
              "text": "Yes. It shows viewing history/IP address.",
              "author": "drluhshel",
              "created": 1606436006,
              "upvotes": 1,
              "replies": {
                "gdpuosp": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdpuosp/",
                  "text": "Thanks, that is good to hear. I was getting a little worried that if I viewed it and it had no timestamps then I’d get accused of being on it during the test day.",
                  "author": "myfriendmickey",
                  "created": 1606436334,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gdix8ep": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdix8ep/",
      "text": "My sister got accused of cheating last week cause blackboard glitched on the teachers side? Basically whatever happened made it look like my sister took another girl's paper, and couldn't even be bothered to change the name on it. \n\nMy sister fought it, and explained that I was in the room while she wrote her paper, and I can confirm that she triple checks all her assignments because earlier this semester she almost submitted a meme on accident. \n\nNow the teacher loves her and is excited to have her next semester? IDK I'm confused?",
      "author": "Khaleesi_dany_t",
      "created": 1606281214,
      "upvotes": 3,
      "replies": {}
    },
    "gdivbey": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdivbey/",
      "text": "The school like your employer NEVER has your best in mind, counselors and so forth are there to protect the brand, NOT YOU. \n\nI played the the role of finding out whose who and what’s what, and I’m an ace at profiling and cataloguing authority personality types, the spin artists, guilt trippers, trap setters, the fisher of men, and the fucking tech wizards that can both social engineer and develop blueprints for catching chegg cheaters. I’ve helped a lot of people map out their college hurdles and like wise have reaped benefits and planted some great benefits to pluck in the future. \n\nThat being said,\n\nThere is only ever 1-2 teachers, if you’re lucky and it’s their first year that think of you in mind before they change sides and have to protect their career, via lazy dip shit from all sides. \n\nThat being said, you made a mistake, chegg isn’t going to mess up its brand by ratting out students. If it did, it would be over for chegg paid subscriptions.\n\nTake this as a college challenge, the enviroment is as much a part of your career as the course load, scheduling and credits.",
      "author": "OH-Kelly-DOH-Kelly",
      "created": 1606279952,
      "upvotes": 0,
      "replies": {}
    },
    "gdiubkz": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiubkz/",
      "text": "It looks like Chegg would have caught you anyways but it seems unethical of a company to give out private info like that...",
      "author": "TrumpIsMyDaddy69",
      "created": 1606279305,
      "upvotes": 1,
      "replies": {}
    },
    "gdisvhi": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdisvhi/",
      "text": "You couldnt make a chegg account with fake names?",
      "author": "Nicofatpad",
      "created": 1606278389,
      "upvotes": 1,
      "replies": {}
    },
    "gdirsl2": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdirsl2/",
      "text": "In my humble opinion, 'academic integrity' is bullshit. As long as academic success is quantified by exams, students will cheat in order to pass. Exams tend to promote memorization, not understanding. I really appreciate when professors allow me to use my own notes on exams instead of forcing me to memorize factoids from their lectures. Grades should be based on effort and understanding of greater concepts, not the memorization of whatever nitpicked information the professor chose to include in their slideshow or overpriced textbook.",
      "author": "subxcity",
      "created": 1606277708,
      "upvotes": 35,
      "replies": {
        "gdje12y": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdje12y/",
          "text": "From a design perspective, **exams are almost set up in a way to purposefully encourage cheating**. By putting artificial constraints on you (no collaboration, no book/online material, harsh time constraint), they encourage you to panic and do something like what OP did: access shady websites online in hopes of finding your exam question. They cause you to panic because they're worth so much too. With the harsh time constraint, you don't have time for rational thought or to think your decision over. At that point, the desperation sets in and you go scouring the internet for anything that can save you.\n\nExams would see less cheating if they were designed more like homework and/or if homework had more emphasis on the grade than exams do. A soft time constraint, active collaboration, being able to look up formulas and facts, etc. all really remove the necessity of cheating and give you many avenues to succeed. Homework tends to be more comprehensive than any exam too, which makes it more effective for learning. \n\nDesigned this way, the only real cheaters that would be left are the people that outsource their homework, but this system wouldn't penalize a panicking, but well-meaning student for a poor split-second decision to cheat.",
          "author": "Noisetorm_",
          "created": 1606294884,
          "upvotes": 21,
          "replies": {
            "gdl45rv": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdl45rv/",
              "text": "I really like this comment, it makes a lot of sense.",
              "author": "morfoodie",
              "created": 1606334361,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gdj1oxw": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj1oxw/",
          "text": "usually if you truly understand the content well enough you don’t *need* to memorize a bunch of random stuff",
          "author": "Pendragon_____",
          "created": 1606284353,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gdiqtg1": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiqtg1/",
      "text": "Damn y’all admit to it? Just deny it if they can’t prove you -don’t forget it’s not cheating if you don’t get caught 🤣",
      "author": "nickydaddyy",
      "created": 1606277113,
      "upvotes": 3,
      "replies": {
        "gdj0k4h": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj0k4h/",
          "text": "They made it very clear they can identify if it was you",
          "author": "morfoodie",
          "created": 1606283509,
          "upvotes": 1,
          "replies": {
            "gdmub4j": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdmub4j/",
              "text": "That's only because YOU put your initials in.",
              "author": "ChronoZ52",
              "created": 1606371502,
              "upvotes": 0,
              "replies": {
                "gdq8b6n": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdq8b6n/",
                  "text": "Yes, exactly...",
                  "author": "morfoodie",
                  "created": 1606445240,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gdiqdrj": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiqdrj/",
      "text": "What is chegg?",
      "author": "applelover67",
      "created": 1606276847,
      "upvotes": 2,
      "replies": {
        "gdiqek4": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiqek4/",
          "text": "Chegg, Inc., is a publicly traded American education technology company based in Santa Clara, California. It provides digital and physical textbook rentals, online tutoring, and other student services.The company was launched in 2005, and began trading publicly on the New York Stock Exchange in November 2013.\n\nMore details here: https://en.wikipedia.org/wiki/Chegg \n\n\n\n*This comment was left automatically (by a bot). If something's wrong, please, report it.*\n\n*Really hope this was useful and relevant :D*\n\n*If I don't get this right, don't get mad at me, I'm still learning!*",
          "author": "wikipedia_answer_bot",
          "created": 1606276860,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gdin64o": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdin64o/",
      "text": "I would of took the chance of not admitting. I would have put fake stuff when singing in to prevent from being located.",
      "author": "Puzzleheaded_Ad_9348",
      "created": 1606274928,
      "upvotes": 2,
      "replies": {}
    },
    "gdimckd": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdimckd/",
      "text": "Why the fuck do people use their real names and shit to make an account",
      "author": "KING_COVID",
      "created": 1606274453,
      "upvotes": 2,
      "replies": {}
    },
    "gdikpnu": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdikpnu/",
      "text": "Why did you use real info to sign up?",
      "author": "CSHooligan",
      "created": 1606273512,
      "upvotes": 9,
      "replies": {
        "gdin5ft": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdin5ft/",
          "text": "I didn't use my school email but my personal email which still has my initials in it and I use the school's wifi. I never intended to cheat in the way I did in the first place so that's why I ended up in the situation. If I planned a whole scheme to cheat I would have done it smarter but I didn't plan on It at the time",
          "author": "morfoodie",
          "created": 1606274917,
          "upvotes": 3,
          "replies": {
            "gdip287": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdip287/",
              "text": "Sucks. Least you didn't get kicked out or have your gpa ruined.",
              "author": "CSHooligan",
              "created": 1606276047,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gdijzde": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdijzde/",
      "text": "I have used chegg to help me understand a couple of my lab problems. There have been two occasions where I still didn't understand how to answer correctly and I could have copied but decided to just take the loss of points. On my most recent exam, we are allowed to use notes, internet, etc just not online tutors or other students. I was looking looking for some info and I clicked on the first link and it was chegg (I didn't realize it at the time) when I got on the site I noticed someone else in my class had just taken a picture of the problem and posted it. I yeeted out of there as fast as possible lmao.",
      "author": "geothermal_barometry",
      "created": 1606273098,
      "upvotes": 3,
      "replies": {}
    },
    "gdiiash": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiiash/",
      "text": "You cheated on your 3rd exam?\n\nI cheated on my 1st homework assignment.\n\nYeah you were pretty dumb you got baited SOOOO hard.\n\nYou got baited by the same middle school threat of \"If you come forward your punishment will be less\".",
      "author": "Xiscis",
      "created": 1606272162,
      "upvotes": -5,
      "replies": {
        "gdiuxcv": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiuxcv/",
          "text": "No reason to be rude",
          "author": "szakattack",
          "created": 1606279694,
          "upvotes": 4,
          "replies": {
            "gdivf8w": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdivf8w/",
              "text": "Calling someone dumb isn't rude. When someone does something dumb, and you call them dumb, its stating the obvious. \n\nCalling you dumb for not being able to do 10th grade math in College is rude.\n\nComprende?",
              "author": "Xiscis",
              "created": 1606280021,
              "upvotes": -6,
              "replies": {
                "gdiw59o": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiw59o/",
                  "text": "Holy shit that was fast. Yes, calling people names is rude believe it or not. People actually learn from their mistakes, too\n\n\nEdit: omg I just realized he went through my post history to find something so he could call me dumb. Ah, so good.",
                  "author": "szakattack",
                  "created": 1606280494,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "gdin0r5": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdin0r5/",
          "text": "Please look at other comments relating to cheggs policy before calling me an idiot. Again, it isn't helpful nor constructive",
          "author": "morfoodie",
          "created": 1606274841,
          "upvotes": 6,
          "replies": {
            "gdipvzv": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdipvzv/",
              "text": "And how exactly will your school contact chegg? Your school is not the president of the United States. To accuse a student of cheating would be a lengthy process. Chegg doesn’t just hand out reports like candy. Also the admins won’t know how to read the chegg report, it’s all code. \n\nYou are an idiot.",
              "author": "Xiscis",
              "created": 1606276545,
              "upvotes": -6,
              "replies": {}
            }
          }
        }
      }
    },
    "gdihn0l": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdihn0l/",
      "text": "Similar thing happened to me recently. Talked to my teacher and they just took the points off of the questions I didn’t honestly answer. There are some good teachers out there. Honestly, I’m pretty embarrassed of what I did but hey... you live and you learn. We got this!",
      "author": null,
      "created": 1606271790,
      "upvotes": 8,
      "replies": {
        "gdimyn5": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdimyn5/",
          "text": "Thanks for sharing your experience!",
          "author": "morfoodie",
          "created": 1606274808,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gdidnzg": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdidnzg/",
      "text": "Lol why tf would you make a chegg account with your real name and email",
      "author": "LifeFromBlood",
      "created": 1606269577,
      "upvotes": -4,
      "replies": {
        "gdidxrv": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdidxrv/",
          "text": "Because I never intended to use it for cheating. My email wasn't my school email but it had my initials and birthday in it so I figured it was safe to bet they could figure out it was me. Didn't intend to get accused of cheating so didn't think of it.",
          "author": "morfoodie",
          "created": 1606269728,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gdi9078": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi9078/",
      "text": "This isn't an issue for my classes... We use Honor Lock. It records your every move lol.",
      "author": "WoodlyElf",
      "created": 1606267032,
      "upvotes": 2,
      "replies": {}
    },
    "gdi8bn6": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi8bn6/",
      "text": "I'm sorry that so many people are SOO misinformed about internet searches. Don't worry OP, I don't think you were baited by your professor either. This actually happened in my school to a specific student. I'm not sure what came out from it, but you aren't alone. Don't listen to these people who are calling you an idiot, when they do idiotic stuff like that. Lmao\n\nFor a lot of the commenters, but YES. Your school DOES see what you are looking up (when you are on their wifi.) YES. Internet Websites/Providers will not release this information to other people, but when it comes to people like Police, and Academia, they CAN release your information. Especially when it comes to police they are a lot of times REQUIRED to give away your information. I had to read about it for a class, and it's actually terrifying. A lot of courts will rule in favor that providers have to give it away because they don't believe it does any \"real\" damage. If you have a chance, read \"Dragnet Nation\".",
      "author": "ChewingSeok",
      "created": 1606266657,
      "upvotes": 3,
      "replies": {}
    },
    "gdi87rr": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi87rr/",
      "text": "Flashback: The only time I ever cheated was in 1st grade, it didn’t know how to spell the word chocolate and I looked on my friend’s paper.  I got in trouble for it. Mainly what made me never cheat again was my grandpa(who was from China and was really strict about everything, basically tiger grandparent) He lectured me for 2 hours about cheating and it scarred me so bad, I have never done it again. I remember him saying that if I cheat “I will NEVER become successful and I will NEVER be happy!” Still bothers me to this day.",
      "author": "Gumydenrures",
      "created": 1606266598,
      "upvotes": 3,
      "replies": {}
    },
    "gdi6c3v": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi6c3v/",
      "text": "Idiot. Make them prove it. Less severe if you admit is a fishing expedition.  + if convicted sue chegg win win",
      "author": "desertpenguin27",
      "created": 1606265561,
      "upvotes": -4,
      "replies": {}
    },
    "gdi5h7q": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi5h7q/",
      "text": "I use chegg, but I talk to my professors about what is and isn't acceptable. Helps me without cheating",
      "author": "Cesco5544",
      "created": 1606265086,
      "upvotes": 2,
      "replies": {}
    },
    "gdi37fa": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi37fa/",
      "text": "Professor here, and a frequent poster in r/professors, and I don’t think you were baited by your professor. Your consequence is much more lenient than you would have experienced in my class (first attempt at cheating is an auto-fail in the course with personnel marks and an academic integrity course requirement; second or more attempt is all the above plus an automatic academic sanction with possible expulsion from school if I push for it—and, in certain cases, I just might). I’m sure my consequences will get me downvotes here, but I just wanted to tell you that you’ve gotten off the hook more easily than you could have in some cases, AND I wanted to thank you for deactivating your Chegg account and detailing for everyone who is tempted to cheat what might happen *from the horse’s mouth*. Good luck with the rest of your courses (not said in snark!), and I hope you have learned from this experience!",
      "author": "biglybiglytremendous",
      "created": 1606263851,
      "upvotes": 12,
      "replies": {
        "gdi4sk2": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi4sk2/",
          "text": "Thank you, you made me feel a bit better in a sea of \"you're an idiot for confessing\" 😂",
          "author": "morfoodie",
          "created": 1606264712,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "gdi15ro": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi15ro/",
      "text": "Flashbacks to when I cheated in first grade because I was scarred.",
      "author": "deprimada",
      "created": 1606262738,
      "upvotes": 2,
      "replies": {}
    },
    "gdhz9za": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhz9za/",
      "text": "That's hard when classes are so challenging that they push students to that desperation to cheat. I'm sorry that this class has been so frustrating that it has pushed you to that. I think it shows integrity that you came forward and that you are sharing this experience with others. Good luck with the rest of the semester!",
      "author": "Hairy_Otter00",
      "created": 1606261718,
      "upvotes": 33,
      "replies": {
        "gdhztpc": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhztpc/",
          "text": "Thank you!!",
          "author": "morfoodie",
          "created": 1606262010,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gdhyo1c": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhyo1c/",
      "text": "What happened to the folks that didnt come forward?",
      "author": "thescopeoflife",
      "created": 1606261390,
      "upvotes": 2,
      "replies": {
        "gdhzrog": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhzrog/",
          "text": "Not sure yet. Its assumed they will either be receiving an F in the class or getting suspended. All I know Is there was a case of cheating in the first exam (not chegg related) and we now have fewer people in our class 🤷‍♀️",
          "author": "morfoodie",
          "created": 1606261981,
          "upvotes": 2,
          "replies": {
            "gdj9upt": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj9upt/",
              "text": "i'm wondering how they got discovered. i have a similar story but it was about final exams after high school, we're talking state examinations. and people from another region were caught cheating because someone noticed that the google trends activated for the questions just before and during the exam. it was so crazy because we didn't know if the entire year of students was gonna have the exam annuled because of them and it was already done in extraordinary circumstances because of corona and it was necessary for college. but thankfully they didn't annul the exam for everyone, hence i'm a college student now.",
              "author": "thescopeoflife",
              "created": 1606290982,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gdhy99q": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhy99q/",
      "text": "Lol it took this for you to learn cheating is bad?? Oof. Small brain time.",
      "author": "dyvrom",
      "created": 1606261172,
      "upvotes": -24,
      "replies": {
        "gdhzo9g": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhzo9g/",
          "text": "I know you're just being an asshole, but obviously I knew cheating was bad. But I honestly didn't think of it as cheating at the time because I didn't post the questions themselves but was just looking at what the tutors wrote. I admit the stupidity came when I didn't make the connection that in a professors eyes there is no difference and it was cheating either way. Dont know why people comment if they don't have anything constructive to say",
          "author": "morfoodie",
          "created": 1606261929,
          "upvotes": 10,
          "replies": {}
        },
        "gdivrg2": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdivrg2/",
          "text": "Oof. Time to be a huge asshole huh?",
          "author": "szakattack",
          "created": 1606280245,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gdhxiw1": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhxiw1/",
      "text": "Public or private school?",
      "author": "yeeeyyee",
      "created": 1606260780,
      "upvotes": -1,
      "replies": {
        "gdhz4k6": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhz4k6/",
          "text": "Public",
          "author": "morfoodie",
          "created": 1606261637,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gdhugad": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhugad/",
      "text": "You always call the bluff in situations like this. Rookie move to self snitch",
      "author": "Whoknvws",
      "created": 1606259144,
      "upvotes": 10,
      "replies": {
        "gdhz39j": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhz39j/",
          "text": "Well im not trying to be a rookie in cheating, im not trying to be a part of it at all. It was a mistake I shouldn't have done in the first place so I got what I deserved.",
          "author": "morfoodie",
          "created": 1606261618,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gdht73o": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdht73o/",
      "text": "You did something wrong, you knew it was wrong, you took the consequences, you learned from it. \n\nHold your head up. You’re a good person and a good student. Good for you.",
      "author": "lepidio",
      "created": 1606258494,
      "upvotes": 98,
      "replies": {
        "gdhyzs5": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhyzs5/",
          "text": "Thank you, I really appreciate that",
          "author": "morfoodie",
          "created": 1606261566,
          "upvotes": 30,
          "replies": {}
        },
        "gdl4nlp": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdl4nlp/",
          "text": "Agreed. Nobody is perfect. It's a positive character trait to admit and learn from mistakes.\n\n10 years from now this embarrassment will be in the long distant past and OP will never think about it.",
          "author": "Money4Nothing2000",
          "created": 1606334618,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "gdhrjfx": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhrjfx/",
      "text": "Lmao you got finessed. Shouldn’t have came forward.",
      "author": "ZMAC698",
      "created": 1606257642,
      "upvotes": 9,
      "replies": {}
    },
    "gdhppb2": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhppb2/",
      "text": "I work on Chegg, Chemistry to be precise and I can tell mostly which questions are being asked because the student doesn't get the concept and which question is being copy-pasted. I write my explanation the same for every single one of the questions and I am very happy you took the time to read what was going on. About Chegg's part, Yes Chegg will release the list of people who either upvoted, downvoted the answer, or the one asked the question(I am not too sure about the access part). You may have been baited but don't feel bad. You felt guilty for cheating that's why you came forward and that really shows you are a good human being.",
      "author": "Algok2001",
      "created": 1606256705,
      "upvotes": 148,
      "replies": {
        "gdhyumk": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhyumk/",
          "text": "Just curious, what do y’all get paid?",
          "author": "1870s",
          "created": 1606261487,
          "upvotes": 32,
          "replies": {
            "gdhz3bk": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhz3bk/",
              "text": "I get paid a dollar and a half per question. Thats why when people post all the big assignments with 10 questions. Most of us answer 1 at the top. Because according to Chegg we only have to answer the top question.",
              "author": "Algok2001",
              "created": 1606261619,
              "upvotes": 62,
              "replies": {
                "gdhzeh1": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhzeh1/",
                  "text": "Do the dislikes and likes affect the pay?",
                  "author": "1870s",
                  "created": 1606261785,
                  "upvotes": 22,
                  "replies": {
                    "gdhzp7f": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhzp7f/",
                      "text": "Yes, if we get a lot of dislikes, we may lose our privileges as an answering expert and sometimes don't get money for that question. Thats why I don't answer until I know the answer however, if the correct answer gets disliked(which happens quite a lot when we answer 1 question out of a 20 question assignment)  we get our pay and we are not in trouble.",
                      "author": "Algok2001",
                      "created": 1606261943,
                      "upvotes": 46,
                      "replies": {
                        "gdhzzxw": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhzzxw/",
                          "text": "But nothing if lots of likes huh",
                          "author": "1870s",
                          "created": 1606262105,
                          "upvotes": 6,
                          "replies": {
                            "gdi0cfw": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi0cfw/",
                              "text": "Well let's say you have a post with a lot of upvotes and you get two downvotes on it. See, your post is still popular and you still get a lot of karma correct? Now imagine if nobody upvotes your post but people downvote it. That makes your post go into negative which a)makes you lose karma, b) takes away your post from even new let alone hot. It's like that, likes help us staying clear from the radars and honestly when I see a like on an answer I get a small smile on my face.",
                              "author": "Algok2001",
                              "created": 1606262294,
                              "upvotes": 18,
                              "replies": {
                                "gdi0qnw": {
                                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi0qnw/",
                                  "text": "Haha I’m gonna like answers more then. Even tho I don’t take chemistry, thanks for your work :)",
                                  "author": "1870s",
                                  "created": 1606262510,
                                  "upvotes": 10,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gdhyvbm": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhyvbm/",
          "text": "Thank you, I really appreciate your empathy",
          "author": "morfoodie",
          "created": 1606261498,
          "upvotes": 24,
          "replies": {}
        },
        "gdig4bu": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdig4bu/",
          "text": "*upvoted, downvoted, or asked the question*\n\nNoted",
          "author": "grandilequence",
          "created": 1606270934,
          "upvotes": 9,
          "replies": {
            "gdihubz": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdihubz/",
              "text": "Actually someone else pointed out that the access part is also correct.",
              "author": "Algok2001",
              "created": 1606271906,
              "upvotes": 8,
              "replies": {
                "gdilu94": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdilu94/",
                  "text": "Ugh  >:(",
                  "author": "grandilequence",
                  "created": 1606274155,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gdi68sx": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi68sx/",
          "text": "You, however, are NOT a good human being. You enable cheaters, you outsource and diminish learning, and you do it for a pittance. (If you are in a poorer country where a dollar and a half goes a long way, I feel bad for you but there is more ethical work to be had.)\nChegg’s “honest” business model would not be severely damaged if they simply put a time delay on answering questions, but they will not do that because it would destroy their main revenue center of emergency test cheaters.",
          "author": "chemprofdave",
          "created": 1606265511,
          "upvotes": -46,
          "replies": {
            "gdi78d2": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi78d2/",
              "text": "Okay I want to build a computer pay me 2000 dollars and I'll stop doing this. Second of all, Chegg is active throughout the year every year except for the breaks. Why do you think is that?  Because while some people do use Chegg to cheat there is an awful lot more people who use Chegg to understand how to do the questions. You are a prof according to your user so you will surely know this. A lot of chem teachers teach you the concepts, and the basic processes but don't teach the students how to do the questions. There are legit people who thank me through the comments on chegg for teaching them how to use the ideal gas equation because no one bothered to tell them once that the units of the gas constant should match the units of everything else as well. I see a lot of questions about organic conversions, why is that? Because that takes practice and more importantly needs your teacher to tell you that you do \"this\" in \"that\" situation and how if you want to reduce something just use LiAlH4 and if you want to oxidize something just use KMnO4. While Chegg yes does have a drawback of cheaters, Chegg also has a very VERY big audience of students whose teachers simply don't give a fuck.",
              "author": "Algok2001",
              "created": 1606266055,
              "upvotes": 25,
              "replies": {
                "gdin4m6": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdin4m6/",
                  "text": "Thank you!!! I cancel my chegg subscription at the end of every semester so I don’t get charged the months for winter and spring break. At the beginning of each semester I see how long I can go without chegg before the professor inevitably assigns a bunch of homework that they barely covered. Then I need to get chegg to teach myself how to do these goddamn problems because my professors can’t be bothered..",
                  "author": "macncheese323",
                  "created": 1606274904,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "gdi7wkb": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi7wkb/",
              "text": "ah yes, he's evil because he answers questions on a website",
              "author": "NeedRedditForSchool",
              "created": 1606266427,
              "upvotes": 11,
              "replies": {
                "gdj7lsr": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj7lsr/",
                  "text": "This made me laugh thank you",
                  "author": "Algok2001",
                  "created": 1606289029,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gdi7akp": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi7akp/",
              "text": "That’s a bit harsh",
              "author": "ToeSins",
              "created": 1606266089,
              "upvotes": 8,
              "replies": {}
            },
            "gdi82p2": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi82p2/",
              "text": "[deleted]",
              "author": null,
              "created": 1606266521,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "gdhporr": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhporr/",
      "text": "I like to think this is a post made by a professor to freak out students",
      "author": "CobaltCrusader123",
      "created": 1606256698,
      "upvotes": 44,
      "replies": {
        "gdhysxs": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhysxs/",
          "text": "God I wish that was true 😅",
          "author": "morfoodie",
          "created": 1606261462,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "gdhoyzw": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhoyzw/",
      "text": "Why do people keep falling for this?\n\nYou got lucky tho.\n\nThe notation in your record won't follow you unless you go on to a private school and they ask.",
      "author": "I_am_Not_A_Robot_13",
      "created": 1606256337,
      "upvotes": 0,
      "replies": {
        "gdhyrtw": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhyrtw/",
          "text": "Good thing is it's not on my transcript or anything its just on file privately for university records",
          "author": "morfoodie",
          "created": 1606261445,
          "upvotes": 4,
          "replies": {
            "gdhzgcp": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhzgcp/",
              "text": "yeah and it won't follow you anywhere.",
              "author": "I_am_Not_A_Robot_13",
              "created": 1606261812,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gdhnmki": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhnmki/",
      "text": "Teacher: assigns study guide for exam 1. \n\nStudents: complete and study using the study guide. \n\nExam 1: Study guide literally doesn’t help you complete the exam at all and all students fail\n\nExam 2: students cheat \n\nTeacher: surprised pikachu face",
      "author": "ethancknight",
      "created": 1606255666,
      "upvotes": 197,
      "replies": {
        "gdhow7o": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhow7o/",
          "text": "Haha yeah I didn't want to put any blame on the professor as this is my mistake only, however let's just say I was one out of like 30 kids that did the same thing. And if you cant tell by our exam averages, he isn't the best teacher 😬 oh well.",
          "author": "morfoodie",
          "created": 1606256299,
          "upvotes": 69,
          "replies": {
            "gdivm2w": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdivm2w/",
              "text": "You should be blaming the professor for being so horrible at teaching. I would be steaming mad if the class average for exams is 20-30 percent!!! That is unreasonably low and borderline mental abuse for students. Especially with how expensive college is and how much seems to be on the line.",
              "author": null,
              "created": 1606280147,
              "upvotes": 29,
              "replies": {
                "gf6m62n": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gf6m62n/",
                  "text": "Second this motion!",
                  "author": "RubenMuro007",
                  "created": 1607532999,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gdhmmzm": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhmmzm/",
      "text": "Nah bro, u did the right thing, professors can get information on the exact email addresses for who posted and looked at the page. Chegg gets hundreds and thousands of requests for the people who accessed a certain page, and you best believe chegg has that data stored in a database. Your email and along with the other students would have been sent in a nicely formatted document to your professor, who would have personally contacted you and exposed you. So u did the right thing.",
      "author": "veeeerain",
      "created": 1606255172,
      "upvotes": 15,
      "replies": {}
    },
    "gdhfbem": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhfbem/",
      "text": ">All of my roommates use it even on exams and a lot of other people in my class cheated on this exam as well.\n\nAt every school I attended or have worked for, you would be responsible for passing this information along. \n\nDon't cover up for cheaters. You'll get treated like one of them when it all comes out.\n\n*Edit: downvote all you like, y'all. Doesn't make it any less true.*",
      "author": "lucianbelew",
      "created": 1606251609,
      "upvotes": -13,
      "replies": {}
    },
    "gdhe7is": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhe7is/",
      "text": "Geed",
      "author": "Thrillkilled",
      "created": 1606251073,
      "upvotes": -12,
      "replies": {}
    },
    "gdhdrc6": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhdrc6/",
      "text": "A business can't just release customer information like that. You're an idiot",
      "author": null,
      "created": 1606250858,
      "upvotes": -7,
      "replies": {
        "gdhnmkz": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhnmkz/",
          "text": "They can and they do. Read the terms of service. Also, they are remarkably good about getting back to us. Working with faculty helps them legitimize their business as more than cheating. I've caught a lot of students this way, either through their Chegg accounts or matching the ip with the LMS records.",
          "author": null,
          "created": 1606255666,
          "upvotes": 12,
          "replies": {
            "gdho1cc": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdho1cc/",
              "text": "So you agree with the unethical business practice of incorporating a privacy violation into terms of service?",
              "author": null,
              "created": 1606255870,
              "upvotes": -6,
              "replies": {
                "gdhrlyw": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhrlyw/",
                  "text": "I'm no lawyer but I'd imagine if you specifically agreed to it in the terms of service, it wouldn't constitute a privacy violation.",
                  "author": "EpicBroomGuy",
                  "created": 1606257678,
                  "upvotes": 8,
                  "replies": {
                    "gdhs931": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhs931/",
                      "text": "Yeah you're probably right honestly. Maybe we should boycott Chegg or something until they remove that clause from their terms.\n\nhttp://chng.it/QVvfqpRYSR",
                      "author": null,
                      "created": 1606258007,
                      "upvotes": -5,
                      "replies": {
                        "gdht8c6": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdht8c6/",
                          "text": "im good",
                          "author": "EpicBroomGuy",
                          "created": 1606258511,
                          "upvotes": 5,
                          "replies": {
                            "gdhtfja": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhtfja/",
                              "text": "I figured.",
                              "author": null,
                              "created": 1606258615,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gdhio87": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhio87/",
          "text": "Yes they can. Look at cheggs policy or any of the comments. Be kind to others, cost nothing.",
          "author": "morfoodie",
          "created": 1606253246,
          "upvotes": 7,
          "replies": {
            "gdhjko4": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhjko4/",
              "text": "https://www.reddit.com/r/Professors/comments/g1jiob/psa_heres_the_information_chegg_will_give_you/?utm_medium=android_app&utm_source=share\n\nThe information chegg provides. \n\nYou're still an idiot.",
              "author": null,
              "created": 1606253685,
              "upvotes": 8,
              "replies": {
                "gdhnufg": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhnufg/",
                  "text": "Reddit is not a reliable or guaranteed source to figure out what type of information Chegg will provide in an investigation. I used to work with a cyber crime unit where the team would often publish false information about investigations on social networking websites in order to attempt to cause more people to become sloppy. While I don’t think the OP would have been caught if they had not come forward, calling them an idiot and linking an unnamed and unverified professor’s post on Reddit as a credible source does not scream any higher level of intelligence, nor does your original incorrect statement. That information is not guaranteed to be consistent or current, no proof is provided, and it is only the experience of one main person.",
                  "author": "petiterunner",
                  "created": 1606255774,
                  "upvotes": 10,
                  "replies": {
                    "gdhoo9g": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhoo9g/",
                      "text": "The website says it can disclose personal information in the event of an academic integrity investigation. Which as the link I included above breaks down into the specific information that chegg provides.",
                      "author": null,
                      "created": 1606256187,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "gdhna3e": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhna3e/",
                  "text": "This is so sad to see because I can almost guarantee if OP wouldn’t have come forward nothing would’ve ever come of it.",
                  "author": "moonkie888",
                  "created": 1606255491,
                  "upvotes": 8,
                  "replies": {}
                },
                "gdhlltd": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhlltd/",
                  "text": "I'm not an idiot, literally look at cheggs policy. This one instance does not dictate every scenario. And even if my professor was baiting us, I dont think it qualifies me as an idiot for falling for it. I do take my academics seriously and think of myself as a person with integrity, so when I make a mistake like that I find it better to own up to it and I dont regret my decision. Again, it costs nothing to be kind and not hurl names at people you don't even know.",
                  "author": "morfoodie",
                  "created": 1606254675,
                  "upvotes": 7,
                  "replies": {
                    "gdhm4vm": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhm4vm/",
                      "text": "It doesn't matter whether I know you or not. All you had to do was create a chegg account with your personal email and a different school name than your actual school.\n\nAnd ACAB is a generalization based on the actions of those who make the news. So yes you're ignorant",
                      "author": null,
                      "created": 1606254928,
                      "upvotes": 2,
                      "replies": {
                        "gdhrb50": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhrb50/",
                          "text": "Yeah I was just thinking why would you make a chegg account with your school email and real name lmao wth \" hey look guys I'm cheating\" lol",
                          "author": "DarkAssassinXb1",
                          "created": 1606257525,
                          "upvotes": 6,
                          "replies": {
                            "gdhrfr1": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhrfr1/",
                              "text": "Someone with sense, thank you",
                              "author": null,
                              "created": 1606257590,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "gdi07qd": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi07qd/",
                              "text": "I didn't make it with a school email, but that doesn't mean they can't figure out which email is to which student",
                              "author": "morfoodie",
                              "created": 1606262223,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gdi7f0s": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi7f0s/",
          "text": "Bro, I feel bad for all the information you've looked up, and thought that internet providers and websites don't release this information. I don't feel bad for you, cause you're just an idiot. lmao",
          "author": "ChewingSeok",
          "created": 1606266156,
          "upvotes": 4,
          "replies": {
            "gdi7ut1": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi7ut1/",
              "text": "I will admit I was wrong, privacy policies do not in fact protect users privacy.",
              "author": null,
              "created": 1606266400,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "gdh9ni8": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdh9ni8/",
      "text": "oh man. i was about to purchase a chegg subscription because my biology homework was getting difficult, but ended up not going through with it in fear of something like this happening. sorry that happened OP but i'm glad you weren't suspended, at the least.",
      "author": "cyborgbunny01",
      "created": 1606248914,
      "upvotes": 13,
      "replies": {
        "gdhbf3m": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhbf3m/",
          "text": "I've never heard of a professor contacting Chegg for academic dishonesty over homework. You should be fine unless you're having people write essays for you or something. Moreover if you're looking up textbook questions, there's a good chance Chegg is just pulling from the solutions manual anyways.",
          "author": "kkoiso",
          "created": 1606249749,
          "upvotes": 33,
          "replies": {
            "gdjbv9t": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjbv9t/",
              "text": "Also, check the back of your text book. About half of all STEM textbooks tend to have solutions for either odd or even problems on the back. They don't show the work for the problems, but it's good enough being able to check whether or not you got the right answer for at least half your problems.",
              "author": "Noisetorm_",
              "created": 1606292817,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gdhn5m5": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhn5m5/",
          "text": "Just make one with a burner email, op didn’t think it through",
          "author": "long_crab",
          "created": 1606255429,
          "upvotes": 4,
          "replies": {}
        },
        "gdha8rw": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdha8rw/",
          "text": "Thank you for being empathetic. Its not worth it imo. 2020 has already been shitty for me and this just added the cherry to the top. Live and learn",
          "author": "morfoodie",
          "created": 1606249194,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gdh525n": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdh525n/",
      "text": "This is from the Chegg honor code page directly:\n\n“To Students\nThe Chegg Tutors team understands the pressures and time constraints school creates. However, the risk students take by violating their school's code of academic integrity is not worth the reward. Copying solutions or requesting unexplained final answers promotes completion without comprehension, which is something we don't support at Chegg.\n\nFurthermore, you should be aware that in the event your institution contacts Chegg as part of an investigation into academic integrity, Chegg is authorized under our Terms of Service and Privacy Policy to cooperate fully in that investigation and we commonly do. This can include providing information to your institution about your user profile, account, site usage activity, and interactions with Chegg Tutors.”",
      "author": "Pretend_Cold0130",
      "created": 1606246745,
      "upvotes": 497,
      "replies": {
        "gdha1t7": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdha1t7/",
          "text": "Yep 😬 that's why I came forward even though everyone is saying I was tricked. I didn't want to take the chance.",
          "author": "morfoodie",
          "created": 1606249103,
          "upvotes": 306,
          "replies": {
            "gdhxg0o": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhxg0o/",
              "text": "Disclaimer: I am not condoning cheating or advocating for it in anyway, that being said:\n\nIf you were smart enough to use a spam email and fake name, there is no way for your professor to trace that back to you and he or she was hoping people would come forward for that reason.",
              "author": "Brownie_McBrown_Face",
              "created": 1606260737,
              "upvotes": 280,
              "replies": {
                "gdi9ybw": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi9ybw/",
                  "text": "Chegg provides IP addresses that you access the site from. If you were on the school's network when you accessed Chegg, they will know exactly who you are. If you accessed Chegg from home or another network, the school IT can easily corelate your IP address to your school account from when you accessed any school systems (email, blackboard, etc).",
                  "author": "blackhorse15A",
                  "created": 1606267549,
                  "upvotes": 72,
                  "replies": {
                    "gdimpms": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdimpms/",
                      "text": "how about a VPN?",
                      "author": "praiseatombomb",
                      "created": 1606274661,
                      "upvotes": 60,
                      "replies": {
                        "gdmemau": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdmemau/",
                          "text": "If your using Chegg during an exam, it will be really hard to do one on the vpn and one not.\n\nBut IP isn't all they provide anyway. You had to pay somehow. You had to provide emails etc to set up your account. Not to mention,any Chegg answers are a bit, unique (and many times wrong or correct in very odd ways the teacher did not teach you) making the answer identifiable.",
                          "author": "blackhorse15A",
                          "created": 1606360519,
                          "upvotes": 9,
                          "replies": {
                            "gdmfzyn": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdmfzyn/",
                              "text": "Not *that* hard. I never personally use Chegg to cheat, but I suppose you could use two devices or maybe a separate browser like Opera with a built-in VPN. Requiring explanations of answers and/or webcam monitoring, of course, would prevent a lot (though not all) of this.\n\nAt that point, people who still cheat will probably put in more effort than actually learning the material would take.",
                              "author": "praiseatombomb",
                              "created": 1606361399,
                              "upvotes": 9,
                              "replies": {}
                            }
                          }
                        },
                        "gdkqy68": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdkqy68/",
                          "text": "We can compare the IP address used to take the exam with the IP address used to login to Chegg. Those should be the same in most cases (though there is always some work around). It is a pain to get the information but Chegg will give it to you if you ask.\n\nCheating is really not worth the risk. Most honor codes will allow you to be expelled even on a first offense. And professors are fed up with all the cheating going on right now. I understand people are struggling with COVID and online classes, but just as it's no excuse for professors to become shitty teachers it's no excuse for students to be shitty learners.",
                          "author": "Dr_Pizzas",
                          "created": 1606327827,
                          "upvotes": -2,
                          "replies": {}
                        }
                      }
                    },
                    "gdifu9v": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdifu9v/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1606270783,
                      "upvotes": 10,
                      "replies": {
                        "gdiot48": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiot48/",
                          "text": ">  If my exams are not locked down, it’s implied it’s open note and they don’t report you for using resources\n\nUmmm... no. It means that your professor is trying to respect your integrity and privacy. Don't abuse their respect.",
                          "author": "Quant_Liz_Lemon",
                          "created": 1606275895,
                          "upvotes": 68,
                          "replies": {}
                        },
                        "gdj6af1": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj6af1/",
                          "text": "I never used it on any exams (graduated before covid so everything was in-person) but many people I knew used Chegg for homework’s. I feel like it’s less troublesome for homework because the point of it is to learn, and you’re still learning by seeing the correct answer, even if it’s dishonest.",
                          "author": "Rockerblocker",
                          "created": 1606287935,
                          "upvotes": 4,
                          "replies": {}
                        },
                        "gdlitmq": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdlitmq/",
                          "text": "Wow the entitlement.",
                          "author": "quantum-mechanic",
                          "created": 1606341905,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "gdjv6ea": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjv6ea/",
                          "text": "or just like..realize it’s a college exam and don’t imply things.. & don’t cheat 🥳🥳",
                          "author": "ohmymycelium",
                          "created": 1606310943,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gdi8dsn": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi8dsn/",
                  "text": "You would also need a different name on the card used to pay for it (or someone else’s card).",
                  "author": "wrathfulpancakes",
                  "created": 1606266690,
                  "upvotes": 42,
                  "replies": {
                    "gdinlyt": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdinlyt/",
                      "text": "Or a prepaid disposable one",
                      "author": "Acelsys",
                      "created": 1606275185,
                      "upvotes": 21,
                      "replies": {}
                    },
                    "gdisfbv": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdisfbv/",
                      "text": "Not true! Chegg can not disclose any payment information, including the cardholders name.",
                      "author": "stonkmyster",
                      "created": 1606278107,
                      "upvotes": 55,
                      "replies": {}
                    },
                    "gdj472t": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj472t/",
                      "text": "That would be highly sketch if they’re looking into the credit card info to find it out. That would be a whole another privacy violation imo.",
                      "author": "nwi210",
                      "created": 1606286265,
                      "upvotes": 17,
                      "replies": {}
                    },
                    "gdi8ofz": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi8ofz/",
                      "text": "I mean do you though? Are they really going to search by credit card name which could have duplicates? Idk how they work but that seems unlikely",
                      "author": "J_Tuck",
                      "created": 1606266854,
                      "upvotes": 48,
                      "replies": {
                        "gdj6466": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj6466/",
                          "text": "I mean... even if your name was John Smith, it’s literally a question from that specific exam. The only people that have viewed it will likely be the people that are in that class",
                          "author": "Rockerblocker",
                          "created": 1606287792,
                          "upvotes": 4,
                          "replies": {
                            "gdk5jcf": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdk5jcf/",
                              "text": "That’s not true lol. The point of chegg is that many people across the nation have the same questions on their exams which makes the whole thing work. If professors really wanted to stop cheating, they’d come up with their own test questions. 🤷🏼‍♂️",
                              "author": "ZMAC698",
                              "created": 1606317251,
                              "upvotes": 9,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gdj5x1d": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj5x1d/",
                      "text": "The app ‘Privacy’ can allow you to pay for anything with a virtual Visa card with your name not attached :)\n\nMight as well get a VPN on your computer just to be safe while you’re at it",
                      "author": "Rockerblocker",
                      "created": 1606287631,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                },
                "gdi7dme": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi7dme/",
                  "text": "What if you accessed the site without an account? Hypothetically.",
                  "author": "mashedpotatoed",
                  "created": 1606266135,
                  "upvotes": 19,
                  "replies": {
                    "gdies8j": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdies8j/",
                      "text": "You need to pay to access answers so id assume this isn’t possible",
                      "author": "maebird-",
                      "created": 1606270198,
                      "upvotes": 22,
                      "replies": {}
                    }
                  }
                },
                "gdip0fe": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdip0fe/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1606276017,
                  "upvotes": 10,
                  "replies": {
                    "gdj1r12": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj1r12/",
                      "text": "For lockdown browser tests, a webcam is *required*, and not having one (or trying to uninstall drivers) will result in an invalid score. Any class that uses those browsers will state that in the syllabus, and also cite how cheap webcams are to buy (though it should be included in the tuition imo). Every lockdown browser that I've heard of thus far has VM detection, which is incredibly easy to implement, and practically impossible to circumvent because it deals with the entirety of the registry information, fake hardware information, and even sometimes down to determining they're being virtualized by running checks in the hardware itself. Even if you renamed all the registry entries, created new ones, and reprogrammed your VM software to *actually work* after doing so, then you won't be able to prevent hardware checks. So no, you cannot circumvent lockdown browsers with a VM or by trying to uninstall the drivers (I have no idea why you think uninstalling drivers would work to begin with).\n\nThat being said, I am not advocating for lockdown browsers even in the slightest. They are legitimately malware (and that VM detection I mentioned is actually directly copied from existing malware as well, so it's harder to analyze), and a gross violation of privacy, and sometimes even the law (having to show your driver's license or state ID, among other things). There are better solutions to combat cheating, such as requiring scanned images of your work, enforcing time limits that prevent cheating, not reusing test questions, having questions that have different parameters (like coefficients and basically anything else you can make different per person) for each individual, and designing tests well enough to still be challenging with open notes if you don't understand the concepts.\n\nEither way, using Chegg for test answers should not be a problem with a well designed test meant to be taken online.",
                      "author": "para_lyzed",
                      "created": 1606284397,
                      "upvotes": 9,
                      "replies": {
                        "gdj3kii": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj3kii/",
                          "text": "Not all lockdown browser tests are also webcam tests. Some are, but not necessarily. It depends how the professor wants to do It",
                          "author": "shamrockshakeho",
                          "created": 1606285779,
                          "upvotes": 5,
                          "replies": {
                            "gdj3orp": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj3orp/",
                              "text": "I've never heard of one that isn't. In that case, you're getting all the downsides of the malware and none of the protection against someone just looking up answers on their phone. Seems pretty useless to me",
                              "author": "para_lyzed",
                              "created": 1606285870,
                              "upvotes": 4,
                              "replies": {
                                "gdjvd4j": {
                                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjvd4j/",
                                  "text": "yeah...respondus is the webcam. i’ve never had a LB exam require my webcam to be on.",
                                  "author": "ohmymycelium",
                                  "created": 1606311078,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "gdjobdw": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjobdw/",
                          "text": "could you point me towards more info on lockdown browsers and VMs?",
                          "author": "blrglglerlglg",
                          "created": 1606305339,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "gdk1law": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdk1law/",
                      "text": "Sorry, it seems your thread or comment is in violation of /r/college Rule #5: Keep it legal and safe.  \r\n\r\nWe permanently ban members whose posts or comments either describe participation in or advocate for illegal or dangerous behavior. The number one offense in this category is piracy. If you link or otherwise refer someone to a repository of pirated material, it's a no questions asked permanent ban. Same for drugs, same for any other activity that breaks the law or endangers safety.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
                      "author": "VA_Network_Nerd",
                      "created": 1606315050,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gdi68e6": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi68e6/",
                  "text": "Genius",
                  "author": "danishcornhen",
                  "created": 1606265504,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gdi09gb": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi09gb/",
              "text": "You did the right thing, cheating is terrible, it's our responsability to get ready for the exam. Although I do understand some cases in which the teacher was really bad and didn't give material to study",
              "author": "chuygbg23",
              "created": 1606262249,
              "upvotes": 11,
              "replies": {
                "gdi73bt": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi73bt/",
                  "text": "False. College is a classist gate keeping system designed to keep certain shades of people out. The cheaters are those who support this system, AKA you.  I'll do whatever it takes to get thru college. People like you shouldn't get to determine my level of success.",
                  "author": "desertpenguin27",
                  "created": 1606265978,
                  "upvotes": -18,
                  "replies": {
                    "gdibbof": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdibbof/",
                      "text": "You had a point until you didn’t",
                      "author": "THEBIGC01",
                      "created": 1606268299,
                      "upvotes": 10,
                      "replies": {}
                    },
                    "gdi8brz": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi8brz/",
                      "text": "I placed second on the international congress of financial research and have a 4.0 GPA I don't cheat but I can understand when others do. Don't call people out if you don't know them, and don't brag about your success.  Saying I'm not at your level of success only show me how your insecurities drive you to prove that you're better than me when you don't even know me",
                      "author": "chuygbg23",
                      "created": 1606266659,
                      "upvotes": 4,
                      "replies": {
                        "gdi8rto": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi8rto/",
                          "text": "I'm glad that you understand why others do what they do. That is whole thing from my perspective. Exams are not a fair measuring tool of how well somebody will perform in whatever job function they go into. And from my perspective atleast, I'm only in college because I can't do physical labor anymore but don't want to be poor. I'm not less deserving compared to somebody that tests well\nI missed the part where you called me ignorant. Burn in a fire you twat",
                          "author": "desertpenguin27",
                          "created": 1606266906,
                          "upvotes": -5,
                          "replies": {
                            "gdi9mei": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi9mei/",
                              "text": "Of course it's not. Test are just a knowledge check, many people go trough life in a dogmatic way, beliving that if they do what the system wants they'll do well, and they're correct but, life is meaningless that way. If one really wants to go far he has to fall in love with learning, actually being able to use the material, not just copy it of the internet or from someone else. But we also have to take into account that there are some bad teachers that don't explain well, nor give proper study material. That isn't the student's fault and the unrealistic expectation of the profesor of having students memorize everything they say is what drives them to cheat",
                              "author": "chuygbg23",
                              "created": 1606267366,
                              "upvotes": 0,
                              "replies": {
                                "gdmth7j": {
                                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdmth7j/",
                                  "text": "life is meaningless in general.",
                                  "author": "ChronoZ52",
                                  "created": 1606370834,
                                  "upvotes": 2,
                                  "replies": {
                                    "gdnzhw8": {
                                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdnzhw8/",
                                      "text": "Yes but not caring makes it meaninglesser",
                                      "author": "chuygbg23",
                                      "created": 1606401626,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gdi7miu": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi7miu/",
                      "text": "what",
                      "author": "NeedRedditForSchool",
                      "created": 1606266272,
                      "upvotes": 5,
                      "replies": {
                        "gdi7v05": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi7v05/",
                          "text": "Is \"what\" a question?",
                          "author": "desertpenguin27",
                          "created": 1606266403,
                          "upvotes": -4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gdixzme": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdixzme/",
          "text": "So dont link your account to an email they can trace back to you?\n\nI mean unless they supply the school your IP address, but even then, how would your school have that?",
          "author": "omgitsabean",
          "created": 1606281717,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gdh10wp": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdh10wp/",
      "text": "Might not be the most appropriate space for this, but if you're assigning an open book exam that will be done asynchronously, I really think it's ridiculous to have to go through all this to teach students a lesson. Profs really need to rethink their pedagogy and build assessments that are plagiarism proof, if that's a huge concern of theirs. Add metacognitive and self-reflective portions into the test if they don't want students simply copying answers found on the web. \n\nIf you keep trying to deliver 19th century style teaching in the digital age, you're going to spend a lot of your time chasing down third party corporate vendors and administrators just to give assessments in your class. Seems like a huge waste of time and a wasted opportunity.",
      "author": "hegelwithcreamcheese",
      "created": 1606244857,
      "upvotes": 25,
      "replies": {
        "gf5h0y0": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gf5h0y0/",
          "text": "This",
          "author": "aguiladoradas",
          "created": 1607504304,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gdgzr11": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgzr11/",
      "text": "What?? Didn’t know they could track your internet searches like that. I’m sorry it happened \nLike someone else said invest in a VPN and don’t use your actual name in it.",
      "author": "izzypy71c",
      "created": 1606244264,
      "upvotes": 5,
      "replies": {
        "gdi7on2": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi7on2/",
          "text": "Most schools do keep track, but mostly internet providers/websites can and are sometimes obligated to release your information. A lot of courts are ruling that these people are obligated to release it because it doesn't physically hurt anyone. If you got time, check out Dragnet Nation. It talks a lot about internet privacy and stuff.",
          "author": "ChewingSeok",
          "created": 1606266306,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gdgxjg3": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgxjg3/",
      "text": "Never ever connect accounts where you might engage in ethically questionable behaviors. Use VPN technologies to access and post. NEVER give them your real name - you are under no obligation to do so.",
      "author": "SamSeebourne",
      "created": 1606243248,
      "upvotes": 79,
      "replies": {
        "gdi8ztu": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi8ztu/",
          "text": "wouldn't their name be connected under a payment method?",
          "author": "thefallinleaf",
          "created": 1606267026,
          "upvotes": 1,
          "replies": {
            "gdi9502": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi9502/",
              "text": "Borrow the card of a trusted acquaintance.",
              "author": "SamSeebourne",
              "created": 1606267105,
              "upvotes": 12,
              "replies": {}
            }
          }
        }
      }
    },
    "gdgrc7m": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgrc7m/",
      "text": "That's very admirable of you to come forward and do this. Growth sometimes is painful, but necessary.",
      "author": "storyteller_sun",
      "created": 1606240393,
      "upvotes": 59,
      "replies": {}
    },
    "gdgqjl3": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgqjl3/",
      "text": "The Chegg part sounds like a fake trick to admit. I highly doubt Chegg would give out this information just to “confirm” suspicion. If this were the case, Chegg would be handing out so much private info for free based on the fact that somebody requested it. There’s a reason you can’t tell who posted the questions and when the dates are from (unless there’s a comment)",
      "author": "AppleSiliconIsAMAZIN",
      "created": 1606240032,
      "upvotes": 29,
      "replies": {
        "gdgsgt7": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgsgt7/",
          "text": "they do for academic integrity cases, it just requires the right people in university admin to request the info. it’s not publicly accessible.",
          "author": "nflez",
          "created": 1606240900,
          "upvotes": 52,
          "replies": {}
        },
        "gdgte1z": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgte1z/",
          "text": "From what I know in cheggs policy they don't want to be used as a cheating website and will give out information if requested by universities. And even if I was tricked like ive been saying at that point it just wasn't worth the potential risk of thinking I could get away with it and the consequence being a lot worse",
          "author": "morfoodie",
          "created": 1606241329,
          "upvotes": 22,
          "replies": {
            "gdhrxlv": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhrxlv/",
              "text": "I’m p sure they can’t find everyone that accessed it tho. There was a post on r/professors that said chegg can only give information on the user that posted the question, not those that accessed it.",
              "author": "wakiBlaster",
              "created": 1606257843,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "gdgtp2n": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgtp2n/",
          "text": "It’s in their terms of service that they will cooperate with academic integrity investigations. They’ll hand over name, email, institution, and any identifying payment info (not CC numbers, but billing address, etc).",
          "author": "infjetson",
          "created": 1606241469,
          "upvotes": 18,
          "replies": {}
        },
        "gdgv2ou": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgv2ou/",
          "text": "> **Disclosures During Academic Investigations.** We may disclose your information, including personal information upon request of an academic institution connected to an investigation into academic integrity. \n\n[https://www.chegg.com/privacypolicy](https://www.chegg.com/privacypolicy)",
          "author": "ecklesweb",
          "created": 1606242098,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gdgo0he": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgo0he/",
      "text": "I didn't know Chegg was allowed to do that. I've never used the site so I'm not worried, but I would think there's some kind of privacy agreement they would be violating by giving away that information.",
      "author": "BlueTortillaChip",
      "created": 1606238894,
      "upvotes": 30,
      "replies": {
        "gdgoe1e": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgoe1e/",
          "text": "I think there is to a degree, but from what I know Chegg doesn't want to be used as a cheating website and in their policy said that if a post is used to do so and they are contacted by a university they will give out necessary information. Up until now I only thought that was for people who posted the questions, but according to my professor they can also tell who just viewed the questions. Lots of people are saying I was tricked into confessing and maybe I was, but this entire thing has been a learning experience and I think I'd be wise to take my professor seriously in this scenario",
          "author": "morfoodie",
          "created": 1606239065,
          "upvotes": 20,
          "replies": {
            "gdgokq5": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgokq5/",
              "text": "It might have been a trick. But it encourages you to be honest and have integrity. I think you did the right thing. It's definitely a learning moment.",
              "author": "BlueTortillaChip",
              "created": 1606239147,
              "upvotes": 12,
              "replies": {
                "gdgq61x": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgq61x/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1606239863,
                  "upvotes": 2,
                  "replies": {
                    "gdgr2ro": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgr2ro/",
                      "text": "Perfect response.",
                      "author": "BlueTortillaChip",
                      "created": 1606240273,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gdgngjg": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgngjg/",
      "text": "I got rid of my chegg account so I wouldn’t get the urge to use it.",
      "author": "labrats21",
      "created": 1606238641,
      "upvotes": 197,
      "replies": {
        "gdhaw7z": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhaw7z/",
          "text": "[deleted]",
          "author": null,
          "created": 1606249497,
          "upvotes": 147,
          "replies": {
            "gdigqs3": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdigqs3/",
              "text": "It also gives you access to detailed solution manuals for textbook problems, which is invaluable for understanding how to do difficult problems. It has purposes outside of cheating.",
              "author": "IanSan5653",
              "created": 1606271283,
              "upvotes": 76,
              "replies": {}
            },
            "gdj4dzz": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj4dzz/",
              "text": "It's like having the answers in the back of the book to check your work from.  Perfectly legit if used that way as well.  Also you should have a good understanding of the material anyway because the people that write chegg answers make typos constantly.",
              "author": "jackfrost2013",
              "created": 1606286413,
              "upvotes": 13,
              "replies": {}
            },
            "gdi9hwo": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi9hwo/",
              "text": "[deleted]",
              "author": null,
              "created": 1606267297,
              "upvotes": 30,
              "replies": {
                "gdiatc9": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiatc9/",
                  "text": "I need it for my homework because it would take me 45 minutes per question just to figure it out using the book when I could learn how to do it in 5 minutes from Chegg",
                  "author": "tekcor-",
                  "created": 1606268019,
                  "upvotes": 48,
                  "replies": {}
                }
              }
            },
            "gdiwagb": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiwagb/",
              "text": "You can use chegg BUT just never post exam questions or go on any exam quiz test stuff your genius classmates post",
              "author": null,
              "created": 1606280589,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gdgo1v0": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgo1v0/",
          "text": "That's a good idea.",
          "author": "BlueTortillaChip",
          "created": 1606238911,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "gdgmuy3": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgmuy3/",
      "text": "in fall 2019 i got caught cheating on a final exam with 5 other people. 3 of them got XF's on their transcripts, 1 didn't get a penalty cause she proved she wasn't actually part of the cheating, and i got the chance to retake the exam (i got a C) and had to take an academic integrity course. i had an extremely difficult semester regarding my personal life, and i explained all that to my prof. and i'm extremely blessed that he let me retake it.\n\ni will never ever do anything like what i did before because the possibility of having an XF on my transcript scared the shit out of me.",
      "author": "bellllabearr",
      "created": 1606238367,
      "upvotes": 493,
      "replies": {
        "gdib5ro": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdib5ro/",
          "text": "What’s an XF? Like an Xtreme F? Like you “super failed!”?",
          "author": "apginge",
          "created": 1606268208,
          "upvotes": 188,
          "replies": {
            "gdidpxh": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdidpxh/",
              "text": "XF is used to denote a course that you failed for an academic integrity violation or at some schools if you withdrew from the class after the refund period lapsed.",
              "author": "Smitty_Jarrett",
              "created": 1606269607,
              "upvotes": 161,
              "replies": {
                "gdj43jc": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj43jc/",
                  "text": "So if it isn't standardized who is going to know just by looking at your transcript unless they are familiar with how your school does things?",
                  "author": "jackfrost2013",
                  "created": 1606286187,
                  "upvotes": 20,
                  "replies": {
                    "gdj6edz": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj6edz/",
                      "text": "Transcripts typically have a key on them explaining what the letters mean, and some even give a typical grading scale",
                      "author": "Rockerblocker",
                      "created": 1606288026,
                      "upvotes": 35,
                      "replies": {}
                    },
                    "gdj5lev": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj5lev/",
                      "text": "I assume just Google (school name grading scale) and find out. Idk though I'm just saying what they generally mean. My school uses Fx for academic dishonesty.",
                      "author": "Smitty_Jarrett",
                      "created": 1606287367,
                      "upvotes": 6,
                      "replies": {
                        "gdjxats": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdjxats/",
                          "text": "That makes sense.  I was just curious how the school expected people to interpret their transcripts if they use a common academic dishonesty code for say a withdrawal or something like that.  But as the other commenter said I guess they include a key on them with what all the codes mean.",
                          "author": "jackfrost2013",
                          "created": 1606312384,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gdigiaf": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdigiaf/",
              "text": "At some schools it's called FF. Failed for academic integrity violations.",
              "author": "IanSan5653",
              "created": 1606271149,
              "upvotes": 35,
              "replies": {}
            }
          }
        },
        "gdidhxg": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdidhxg/",
          "text": "Who actually cares about transcript though? No one looks at that shit after you graduate",
          "author": "GhostBearIsGod",
          "created": 1606269485,
          "upvotes": 10,
          "replies": {
            "gdiefdh": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiefdh/",
              "text": "For those wanting to go to grad school, law school, medical school this is definitely still important. If you wish to get an internship at some places they will still look at your transcript if your a student, some first jobs will still look at your transcript (HR will) or scholarships that could be pending, list goes on....",
              "author": "DarwinQD",
              "created": 1606270000,
              "upvotes": 122,
              "replies": {
                "gdieled": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdieled/",
                  "text": "Never heard of HR requesting a college transcript",
                  "author": "GhostBearIsGod",
                  "created": 1606270093,
                  "upvotes": 12,
                  "replies": {
                    "gdik1fh": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdik1fh/",
                      "text": "My last 3 jobs requested official UG and G transcripts. It matters. I think explaining to HR (or at least be ready to explain) that you made a stupid mistake in your youth and that you learned a big lesson and have taken responsibility and have not had any other infractions. Just acknowledge it and move on. Some jobs will ask for it though.",
                      "author": "azzhole81",
                      "created": 1606273129,
                      "upvotes": 37,
                      "replies": {}
                    },
                    "gdieuqf": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdieuqf/",
                      "text": "Jobs can request college transcript at least first jobs can (not all but many engineering jobs do and other stem fields can), employers will look at them but usually it is HR that does so.",
                      "author": "DarwinQD",
                      "created": 1606270236,
                      "upvotes": 19,
                      "replies": {}
                    },
                    "gdixbua": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdixbua/",
                      "text": "I've applied for 3 different jobs now that have asked for an unofficial transcript, IDK if they actually read it, but they did ask",
                      "author": "Khaleesi_dany_t",
                      "created": 1606281277,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                },
                "gdj3gjf": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj3gjf/",
                  "text": "this is what i heard and that's why i was freaking out so much. i don't want to lose any opportunities",
                  "author": "bellllabearr",
                  "created": 1606285693,
                  "upvotes": 2,
                  "replies": {}
                },
                "gdj4fli": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj4fli/",
                  "text": "Yeah I want to go to law school so college transcripts are super important! My college gpa will be considered along with LSAT scores with any law school I apply with and will determine if I get a scholarship or not.",
                  "author": "BairMooDes82",
                  "created": 1606286449,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gditqa4": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gditqa4/",
              "text": "Ahh how short sighted you are. Grad school is becoming more and more common, and a necessity in some fields.",
              "author": "SpicyMargarita143",
              "created": 1606278928,
              "upvotes": 16,
              "replies": {}
            },
            "gdixa8t": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdixa8t/",
              "text": "Uhhh I had to send my transcript to HR. Most large or big name companies will require it.",
              "author": "yeehawsharknado",
              "created": 1606281247,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gdgjiaf": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgjiaf/",
      "text": "Chegg is a fuccing snitch. \n\nAll my classmates in my stats class got banned from their chegg accounts for “suspicious activity” when using it for literal help on how to do the homework. It sucks all around",
      "author": "FeelingLoan",
      "created": 1606236822,
      "upvotes": 216,
      "replies": {
        "gdgwzb6": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgwzb6/",
          "text": "This was probably because more than one person was using one account",
          "author": "kapbear",
          "created": 1606242988,
          "upvotes": 67,
          "replies": {}
        },
        "gdgurwh": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgurwh/",
          "text": "> Chegg is a fuccing snitch.\n\nA corporation has no obligation to protect their consumer if said consumer is engaging in an 'illegal' activity, that being cheating as it is against a school's policy.  Like, c'mon bro lol",
          "author": "BumbleFuckDuck",
          "created": 1606241960,
          "upvotes": 56,
          "replies": {
            "gdgxbof": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgxbof/",
              "text": "Cheating probably isn't an actual crime - at least not in my jurisdiction. There probably nothing illegal about it.",
              "author": "SamSeebourne",
              "created": 1606243149,
              "upvotes": 66,
              "replies": {
                "gdhoyh0": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhoyh0/",
                  "text": "There's no law for \"cheating\" itself so you are probably right in most cases.\n\nI think the part where it becomes iffy is when someone uses manipulated test scores to get into a college or practice something like medicine/law. It could potentially be seen as fraud in a few limited cases as you would essentially be misrepresenting yourself.",
                  "author": "br1039",
                  "created": 1606256330,
                  "upvotes": 19,
                  "replies": {
                    "gdhqq3e": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhqq3e/",
                      "text": "Yes, but only maybe. It would be a very tough case to prove and would have to be egregious.\n\nI want to be clear, I'm not advocating cheating at all. Its an unfair practice, but if you're going to do it then you should know what laws may or may not apply.",
                      "author": "SamSeebourne",
                      "created": 1606257228,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gdgyehb": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgyehb/",
              "text": "For context they were doing the same as OP using it to guide them through the question. Most questions were not even posted on there so they had to use similar questions to work through :) So get off ur high horse ab cheating weirdo",
              "author": "FeelingLoan",
              "created": 1606243653,
              "upvotes": 3,
              "replies": {
                "gdgynrl": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgynrl/",
                  "text": "I too use Chegg to guide me through questions.",
                  "author": "BumbleFuckDuck",
                  "created": 1606243771,
                  "upvotes": -1,
                  "replies": {
                    "gdgz1zb": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgz1zb/",
                      "text": "I said in the original comment “Literal Help” on the “homework”. That is in no way cheating or in anyway different than what would be done in an irl study group.",
                      "author": "FeelingLoan",
                      "created": 1606243946,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gdikteh": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdikteh/",
          "text": "[deleted]",
          "author": null,
          "created": 1606273570,
          "upvotes": 3,
          "replies": {
            "gdkg1cn": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdkg1cn/",
              "text": "not “in trouble” but chegg can suspend accounts anytime any reason without ACTUALLY specifying the reason more than “suspicious activity”. theres nothing wrong with using it for guidance for ur course!! it’s just annoying",
              "author": "FeelingLoan",
              "created": 1606322582,
              "upvotes": 1,
              "replies": {
                "gdkkz7i": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdkkz7i/",
                  "text": "I just cancelled it and requested deletion of data. Not remotely worth the risk since it doesn't really help me anyway.",
                  "author": "xobk",
                  "created": 1606324970,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gdgimh9": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgimh9/",
      "text": "How would they get the info of those who accessed the questions? Unless the police actually contacts Chegg with a subpoena (which is really drastic) i don’t think that they would ever divulge that information, you were dumb for cheating, but even dumber for ratting on yourself when the “come forward” was clearly a setup.",
      "author": "I_hate-you_already",
      "created": 1606236414,
      "upvotes": 195,
      "replies": {
        "gdgjr6h": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgjr6h/",
          "text": "I've heard it said that chegg will give info about who accessed a post if a school requests it, and I've heard that they only give the info of the poster. I'm not really sure what is true and ill probably never know.\n\nThough, I feel like a lot more students would be in trouble for cheating if they actually did.",
          "author": "hemehime",
          "created": 1606236934,
          "upvotes": 40,
          "replies": {
            "gdi4qvt": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi4qvt/",
              "text": "Following up on cheating is rarely worth it for professors.  Admin refuses to pursue, stuff like that.  \n\nMy stuff is up on Chegg, so I just do what I can to live with the reality that students cheat, and I have to stop it before they cheat rather than try to pursue it afterwards.",
              "author": "dontbothertoknock",
              "created": 1606264687,
              "upvotes": 20,
              "replies": {}
            }
          }
        },
        "gdgsav9": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgsav9/",
          "text": "check r/professors for similar threads if you’re curious. (please don’t post/comment/harrass them for this.) chegg will provide names, time stamps, and IP addresses of who accessed a given question if asked.",
          "author": "nflez",
          "created": 1606240826,
          "upvotes": 101,
          "replies": {}
        },
        "gdgjm6e": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgjm6e/",
          "text": "I heard they can track VIA IP addresses",
          "author": "FeelingLoan",
          "created": 1606236871,
          "upvotes": 50,
          "replies": {
            "gdgnjz8": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgnjz8/",
              "text": "Ip address can't be used to identify an individual. Unless you buy a static one, ips change all the time.",
              "author": "robendboua",
              "created": 1606238684,
              "upvotes": 99,
              "replies": {
                "gdgu1i8": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgu1i8/",
                  "text": "If you're on my network, I know what IP is assigned to your machine.  That is super basic network administration.\n\nFurthermore, if you're not on my network (say at home) but if you user a username and password access my systems (e.g., Canvas), I know what IP address you're using at that moment.  And if I see that same IP address in a list I get from Chegg that covers the same time frame, I know that IP address belongs to you.\n\nThe only thing I can't prove is that you were the very human being sitting at that computer when Chegg was accessed.  But we're also not trying to prove the point beyond all reasonable doubt.  A preponderance of the evidence will suffice.",
                  "author": "ecklesweb",
                  "created": 1606241626,
                  "upvotes": 68,
                  "replies": {
                    "gdgwqul": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgwqul/",
                      "text": "IPs are location based. I live in an apartment complex and the IP address for half of it is the same because we use the same network. There's no way to tell from an IP who was accessing the site.",
                      "author": "OFS_Razgriz",
                      "created": 1606242879,
                      "upvotes": 57,
                      "replies": {
                        "gdhtbqk": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhtbqk/",
                          "text": "not to mention that most people don't have static ip addresses and they change periodically",
                          "author": "nutsackhurts",
                          "created": 1606258560,
                          "upvotes": 15,
                          "replies": {
                            "gdhtu3z": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhtu3z/",
                              "text": "Exactly. Someone used a student's account to post a bunch of racist/sexual comments on our Living Learning Community's webpage and they couldn't discipline anyone because they couldn't prove what apartment complex it even came from.",
                              "author": "OFS_Razgriz",
                              "created": 1606258823,
                              "upvotes": 11,
                              "replies": {}
                            }
                          }
                        },
                        "gdhz87g": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhz87g/",
                          "text": "If it was a specific test in a class of 100, and your IP points to your apartment complex, the chance of another student having the same IP is negligible. For such a limited set of suspicious students and IPs, cross referencing is easy and accurate",
                          "author": "coldblade2000",
                          "created": 1606261691,
                          "upvotes": 8,
                          "replies": {
                            "gdi48lx": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi48lx/",
                              "text": "I'm not sure if they're legally allowed to request your specific IP address, and I definitely know your PROFESSOR can't know where you live.",
                              "author": "OFS_Razgriz",
                              "created": 1606264410,
                              "upvotes": 3,
                              "replies": {
                                "gdi4r5m": {
                                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi4r5m/",
                                  "text": "Sure they are, why wouldn't they be legally able to request a private site for IP addresses? It's not illegal to store that info for Chegg, and it shouldn't be a problem if a university asks them for a list, or at least asks them to cross reference with the students' IPs.\n\nAlso they don't have to know where you live. As long as they have access to any of the platforms you use in school, they certainly have your IP, or could easily start logging it at least. Finally, in academic dishonesty cases, privacy rules go out the window in certain ways.",
                                  "author": "coldblade2000",
                                  "created": 1606264690,
                                  "upvotes": 7,
                                  "replies": {
                                    "gdi5jey": {
                                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi5jey/",
                                      "text": "Couldn’t all of it be solved by making your IP dynamic? \nObviously not the easiest thing ever but wouldn’t that make it much harder?",
                                      "author": "nwi210",
                                      "created": 1606265121,
                                      "upvotes": 1,
                                      "replies": {
                                        "gdi7jm9": {
                                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi7jm9/",
                                          "text": "Well yes, but a good 80% of the school population, particularly the type of student that cheats in exams repeatedly, won't have the ability, knowledge or drive to do so. Even those who do might be at the mercy of their ISP, which might not allow them a dynamic IP or sets their changing interval to a long one.",
                                          "author": "coldblade2000",
                                          "created": 1606266229,
                                          "upvotes": 2,
                                          "replies": {
                                            "gdj3yoi": {
                                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdj3yoi/",
                                              "text": "Yeah I guess. Alternatively I would just use a personal hotspot for the computer I was using chegg on that way the IP wouldn’t be traced and just use multiple devices. \n\nThat being said I don’t have chegg because for most classes learning the material is easier than cheating especially if it’s gonna be in your major. I learned the hard way not to use chegg because I used it for CS200 and then struggled in 300 at the beginning, yet now I do all the assignments legit and it’s fairly easy.",
                                              "author": "nwi210",
                                              "created": 1606286080,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "gdi9jgk": {
                                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi9jgk/",
                                      "text": "That could easily be a violation of FERPA regulation. Remember that colleges are held to a really strict standard for privacy because they're publicly funded. They're not even technically allowed to demand your vaccination history - the reason that they can in most States is specific state-level regulation requiring vaccination documentation in order to enroll in public schools/colleges.\n\nOf course, if your next argument is going to be, \"Who's going to actually enforce that?\" then I would say that has merit. Despite many students complaining about it, Lockdown Browser and other test monitoring software (including the webcam monitors which, by the way, many teachers hate to use too) is still in use and I have yet to hear any successful lawsuits against its usage.\n\nEdit:\n\nForgot to mention - I know of one case where they knew the IP address of and even the apartment building that the computer that violated school policy accessed the internet from, and a potential culprit was narrowed down, but he claimed that it was not him and they couldn't punish him because they couldn't prove it was him at the computer (there were others in the apartment, some of whom were not students).\n\nSo even if they're reasonably sure it was you, they have to be certain. And there's no way they can be.",
                                      "author": "OFS_Razgriz",
                                      "created": 1606267320,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gdgw9ux": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgw9ux/",
                      "text": "I was referring to ips being directly used to identify someone like in movies, but I see what you're saying. But that wouldn't happen and doesn't change the fact that in ops case, he was never gonna be revealed by his ip. Chegg doesn't just release ips, and I'm pretty that nso at ops school has better things to do than cross reference ips from chegg to their users.",
                      "author": "robendboua",
                      "created": 1606242660,
                      "upvotes": 10,
                      "replies": {}
                    }
                  }
                },
                "gdgype2": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgype2/",
                  "text": "Oh i meant for people who lived on campus they wld track it down that way but i see",
                  "author": "FeelingLoan",
                  "created": 1606243792,
                  "upvotes": 1,
                  "replies": {}
                },
                "gdgtgn8": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgtgn8/",
                  "text": "It can be used to track the location of where a person is. So if the prof asked for it, they could have obviously seen some searches came from their school.",
                  "author": "Awelawi",
                  "created": 1606241362,
                  "upvotes": 0,
                  "replies": {
                    "gdgu0j2": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgu0j2/",
                      "text": "It could not have been used to identify an individual. You can't get detailed info about where an ip is being used without contacting the isp, who wouldn't release that info, and even if they did the ip could be used by many people. It could not have been used to get OP in trouble. And no one is \"getting ips\" from chegg. The fact that we're talking about ips tells me this was just some story to get people to rat on themselves.",
                      "author": "robendboua",
                      "created": 1606241613,
                      "upvotes": 15,
                      "replies": {
                        "gdgud2h": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgud2h/",
                          "text": "Yet they'll have tracked the location down. Plus, most of these things ask for emails and emails are another way of identifying. Even if a person uses their separate email. All I'm saying is integrity first!",
                          "author": "Awelawi",
                          "created": 1606241773,
                          "upvotes": -8,
                          "replies": {
                            "gdgwpad": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgwpad/",
                              "text": "It cannot be used to determine a location that's wrong. Not without contacting the isp which owns the ip and asking when exactly it was assigned to whom. Which wouldn't happen without a warrant.",
                              "author": "robendboua",
                              "created": 1606242858,
                              "upvotes": 7,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gdgl1qi": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgl1qi/",
          "text": "You're right in how I could have taken the route of not admitting anything, but chegg does have a history of releasing IP addresses and my professor made it very clear that if we did not come forward and were caught, the punishment would be severe (most likely kicked out of class). I did not want to take that chance even if it was slight. I already made the mistake of using chegg in the first place, I wasn't going to make another choice to think I would get away with it. It just wasn't worth it at that point",
          "author": "morfoodie",
          "created": 1606237529,
          "upvotes": 44,
          "replies": {
            "gdhglaz": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhglaz/",
              "text": "It reminds me of the \"moment of truth\" in Navy boot camp. They tell everyone that this is their last chance to come forward with whatever things they want to confess, because if the Navy finds out later the punishment will be great. The truth is that if the Navy didn't already know they would never find out. There were always those who got scared and went and confessed they smoked weed like 4 years ago and they immediately get discharged.",
              "author": "RadioactiveMermaid",
              "created": 1606252232,
              "upvotes": 14,
              "replies": {}
            },
            "gdgnshr": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgnshr/",
              "text": "Ip addresses are useless to find you in a case like this. You got tricked into confessing. I'm not saying don't cheat... But you didn't need to come clean.",
              "author": "robendboua",
              "created": 1606238792,
              "upvotes": 82,
              "replies": {
                "gdgo3ey": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgo3ey/",
                  "text": "Maybe maybe not. Im not sure how it works whether its ip addresses or if chegg gives out people's accounts, I don't know. Maybe I was tricked but at the end of the day I'd rather be in the situation I am now then have risked being suspended or kicked out of the class.",
                  "author": "morfoodie",
                  "created": 1606238931,
                  "upvotes": 18,
                  "replies": {
                    "gdhevy6": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhevy6/",
                      "text": "You should have dropped the class, studied the answers and questions on chegg (like actually learn how to do the work) and retake it later. Now you have a zero and probably gonna fail the class anyways",
                      "author": "crystalliite",
                      "created": 1606251402,
                      "upvotes": -9,
                      "replies": {
                        "gdhisix": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhisix/",
                          "text": "Actually my professor went over my grades and I could fail all the tests upcoming including final and still pass with a C, so I won't be failing the class.",
                          "author": "morfoodie",
                          "created": 1606253303,
                          "upvotes": 25,
                          "replies": {
                            "gdhy1vu": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhy1vu/",
                              "text": "What kinda chem class is that? Lmfao\n\nOur chem classes, especially ochem, make exams worth 70-75% of your total grade",
                              "author": "Brownie_McBrown_Face",
                              "created": 1606261062,
                              "upvotes": 2,
                              "replies": {
                                "gdhzcqj": {
                                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhzcqj/",
                                  "text": "Well everyone was failing the exams and doing really bad because of his teaching so he adjusted the grading scale to where we could basically fail exams and still pass. There was a reason people felt a need to cheat in the first place",
                                  "author": "morfoodie",
                                  "created": 1606261759,
                                  "upvotes": 1,
                                  "replies": {
                                    "gdhzvc6": {
                                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhzvc6/",
                                      "text": "No offense to your professor but that’s the dumbest response to a struggling student base that I’ve ever heard",
                                      "author": "Brownie_McBrown_Face",
                                      "created": 1606262036,
                                      "upvotes": 2,
                                      "replies": {
                                        "gdi0drh": {
                                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi0drh/",
                                          "text": "I agree. I do really want to learn and this class and believe it or not I've been studying my ass off. I never even had the urge to go to chegg until the 3rd exam because I was so frustrated by that point because we all kept failing bad. Not saying I have an excuse, but this class is definitely weird.",
                                          "author": "morfoodie",
                                          "created": 1606262314,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gdhmy3q": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhmy3q/",
                  "text": "They might not have been tricked. Chegg is usually very good about responding to request. I've caught a lot of students that way.",
                  "author": null,
                  "created": 1606255325,
                  "upvotes": 10,
                  "replies": {
                    "gdhplg7": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhplg7/",
                      "text": "Interesting, what info do they provide?",
                      "author": "robendboua",
                      "created": 1606256651,
                      "upvotes": 8,
                      "replies": {
                        "gdi1awx": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi1awx/",
                          "text": "Also what if you're using a vpn? Then the only way they can get you is if they give out the name on your card, which I'm sure they're never going to do.",
                          "author": "User808_",
                          "created": 1606262817,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gdh5m81": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdh5m81/",
          "text": "Companies are under no legal obligation to keep user records to themselves. It's usually a matter of company policy, not law, not to release the information to law enforcement without a subpoena. If a company want, they can release user records to whoever they want, it's just typically not a good business practice for them.",
          "author": "orangeblackteal",
          "created": 1606247009,
          "upvotes": 9,
          "replies": {}
        },
        "gdgtawz": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgtawz/",
          "text": "It was their choice to do it and it's an honorable thing to do. No need calling them dumb!",
          "author": "Awelawi",
          "created": 1606241289,
          "upvotes": 13,
          "replies": {
            "gdgwatb": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgwatb/",
              "text": "It’s honorable to cheat? First time i heard that",
              "author": "I_hate-you_already",
              "created": 1606242672,
              "upvotes": -19,
              "replies": {
                "gdgwvf1": {
                  "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgwvf1/",
                  "text": "It's honorable to own up to one's wrong is what I meant.",
                  "author": "Awelawi",
                  "created": 1606242938,
                  "upvotes": 15,
                  "replies": {
                    "gdgxe80": {
                      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgxe80/",
                      "text": "She’s sorry because she got caught, not because she cheated, *because she got caught*, it would have been honorable if she unprompted confessed, which is not the case, so yes, dumb.",
                      "author": "I_hate-you_already",
                      "created": 1606243181,
                      "upvotes": -20,
                      "replies": {
                        "gdhaq41": {
                          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhaq41/",
                          "text": "It was dumb to cheat yes, but it wasn't dumb to come forward. I could have made the Decision to try and get away with it further but didn't. Obviously this mistake is on me and even if you see me as someone you hate (ie your username), I don't regret my decision and I dont feel bad about it, im proud of myself for coming forward and will learn from this.",
                          "author": "morfoodie",
                          "created": 1606249417,
                          "upvotes": 3,
                          "replies": {
                            "gdhbbao": {
                              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhbbao/",
                              "text": "No one would hate you because you cheated, i cheated on exams too when i was in HS and it was a dumb thing as well, it’s not that big of a deal, and i have this username since a while ago, not related to you, dw",
                              "author": "I_hate-you_already",
                              "created": 1606249699,
                              "upvotes": -2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gdhmohf": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhmohf/",
          "text": "Chegg cooperates with us without a subpoena. We just make a request and they provide the accounts and addresses. They want to seem as legitimate as possible, which is why they are so cooperative.",
          "author": null,
          "created": 1606255192,
          "upvotes": 3,
          "replies": {}
        },
        "gdgjo4p": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgjo4p/",
          "text": "I don't think Chegg has an interest in doing anything without a court ruling. Could you imagine how bad that would be for their business?",
          "author": "br1039",
          "created": 1606236895,
          "upvotes": 11,
          "replies": {
            "gdguu4v": {
              "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdguu4v/",
              "text": "From [Chegg's Privacy Policy](https://www.chegg.com/privacypolicy):\n\n>**Disclosures During Academic Investigations.** We may disclose your information, including personal information upon request of an academic institution connected to an investigation into academic integrity.",
              "author": "ecklesweb",
              "created": 1606241989,
              "upvotes": 22,
              "replies": {}
            }
          }
        },
        "gdhk8au": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdhk8au/",
          "text": "A lot of the things other people said is true, but also Colleges can technically sue Chegg for exam questions being posted because Exams/Questions are copyrighted material by the university. Chegg would have huge legal trouble if they didn’t give all the information of every registered user who visited the page.",
          "author": "RealOJ",
          "created": 1606254007,
          "upvotes": 2,
          "replies": {}
        },
        "gdi8cv8": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdi8cv8/",
          "text": "It was not dumb that he fessed up. The same thing happened in my class when someone posted an entire test to Chegg. My professor found out and said that he contacted Chegg to find out who accessed the exam, just like OP said. They weren’t baiting.",
          "author": "HoeForCookieDough",
          "created": 1606266675,
          "upvotes": 2,
          "replies": {}
        },
        "gdgv931": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgv931/",
          "text": ">**Disclosures During Academic Investigations.** We may disclose your information, including personal information upon request of an academic institution connected to an investigation into academic integrity. \n\n[https://www.chegg.com/privacypolicy](https://www.chegg.com/privacypolicy)",
          "author": "ecklesweb",
          "created": 1606242179,
          "upvotes": 5,
          "replies": {}
        },
        "gdiyod7": {
          "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdiyod7/",
          "text": "Chegg will give the email accounts of the people who went on, so if the email account has OP's name on it, then yeah, that's how you get caught. OP would've gotten caught either way and you clearly have no idea what you're talking about. Also, some universities like the one I go to don't even require evidence of cheating, they will typically take the professor's word as the truth and I have talked to multiple people who got falsely accused but still got penalized.",
          "author": "LuckyMouse9",
          "created": 1606282183,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gdgh5dj": {
      "link": "/r/college/comments/k089ay/heres_what_might_happen_to_you_if_you_get_caught/gdgh5dj/",
      "text": "All I can say is. You did the right thing. You came forward. You didn't have to but you did anyways. Chegg is great for studying and what not but as you said you didn't go looking for answers but got them and used them. But you were upfront and honest. A zero is a better outcome than what will happen to those who don't take the step you did. \n\nI've heard stories about how people cheated and could've gotten away with it if they hadn't caused a fuss about a simple zero. They fussed and utimately got expelled for cheating and possibly criminal charges brought up (they hacked a site to get the answers to a open book open person open pretty much anything except the internet test) all because they refused to take a zero for the test and that's it.\n\nSo in the end you were a lot smarter than most people. And you owned up to your choice and mistake. And that's something to be proud of.",
      "author": "Alyssa_Hargreaves",
      "created": 1606235730,
      "upvotes": 269,
      "replies": {}
    }
  },
  "updated": 1634054881
}