{
  "sid": "qmr2li",
  "link": "/r/college/comments/qmr2li/roommate/",
  "title:": "roommate",
  "text": "my roommate does his schoolwork while also playing xbox at the same exact time? i asked him if he even retains any of the knowledge and he said yeah, but i find it hard to believe. is this some sort of ADHD? i have it as well and never felt like doing it at the same time, i usually just get distracted. what do i do to get him to work on his schoolwork so i can play MY game?",
  "author": "kr12021202",
  "created": 1636050332,
  "updated": 1636137393,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hjbi0ta": {
      "link": "/r/college/comments/qmr2li/roommate/hjbi0ta/",
      "text": "Maybe he trends more “ADHD” and you trend more “ADD”. Both have impaired focus, but they manifest differently — unfortunately genius psychiatrists decided back in the 1990s that any attention deficit disorder was basically just “ADHD.” Kinda stupid, but then again, what do you expect 🙃 Now they separate out three basic types of ADHD — one is no issues with focus, but hyperactive, one is issues with focus but not hyperactive, and another is a combo. \n\nBut realistically that’s the thing about brains — ADHD in one person doesn’t look exactly like ADHD in another.\n\nAs for how to get a chance to play your games…ask? I mean seriously, just say yo, in half an hour can I play some ____ ?”",
      "author": "Helllo_Man",
      "created": 1636053087,
      "upvotes": -1,
      "replies": {
        "hjbiid6": {
          "link": "/r/college/comments/qmr2li/roommate/hjbiid6/",
          "text": "yeah i was diagnosed ADD. i can’t focus, at all. and this doesn’t work with him, he’s my cousin, i’ve tried multiple times but he’s very narcissistic and egotistical. i can’t even have an honest conversation with him, it always turns into something about him.",
          "author": "kr12021202",
          "created": 1636053279,
          "upvotes": 1,
          "replies": {
            "hjbje35": {
              "link": "/r/college/comments/qmr2li/roommate/hjbje35/",
              "text": "Well…I mean I’d say either get another Xbox or get in his face about it more. “Hey, you’ve been on here for four hours — we share this thing, and it’s well past time for me to get a chance.” \n\nIf he gets all prissy about it, don’t back down. It’s not gonna get better if you don’t do something about it!",
              "author": "Helllo_Man",
              "created": 1636053624,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}