{
  "sid": "qk07pf",
  "link": "/r/college/comments/qk07pf/financial_aid_refund_disbursement/",
  "title:": "Financial aid refund disbursement?",
  "text": "I took out loans so that I could supplement my income to help pay rent, while I work less, to focus on school for the time being.\n\nThis is my first semester, so I'm new to the whole financial aid crap. It's 10 out of 15 weeks into the semester though and still haven't heard word about any disbursement. \n\nIs it normal for the refunds to be disbursed practically near the end of the semester?",
  "author": "Z-M-W",
  "created": 1635718989,
  "updated": 1635779492,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hitg9gb": {
      "link": "/r/college/comments/qk07pf/financial_aid_refund_disbursement/hitg9gb/",
      "text": "No not normal. Are you sure you took out enough time be issued a refund check?",
      "author": "Concerned-23",
      "created": 1635719059,
      "upvotes": 1,
      "replies": {
        "hitgs8c": {
          "link": "/r/college/comments/qk07pf/financial_aid_refund_disbursement/hitgs8c/",
          "text": "Yeah, I took out full loans for the entire year ($4500 a semester) which is all pretty much coming back to me. 95% or so of college costs are already covered.",
          "author": "Z-M-W",
          "created": 1635719317,
          "upvotes": 1,
          "replies": {
            "hith33w": {
              "link": "/r/college/comments/qk07pf/financial_aid_refund_disbursement/hith33w/",
              "text": "You need to contact your schools financial aid office",
              "author": "Concerned-23",
              "created": 1635719464,
              "upvotes": 2,
              "replies": {
                "hith7mm": {
                  "link": "/r/college/comments/qk07pf/financial_aid_refund_disbursement/hith7mm/",
                  "text": "I did last week, still waiting to hear back. I'll call tomorrow though. Thank you for the help",
                  "author": "Z-M-W",
                  "created": 1635719528,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hiu0i7b": {
      "link": "/r/college/comments/qk07pf/financial_aid_refund_disbursement/hiu0i7b/",
      "text": "Like the other person said, contact financial aid. The same thing happens to me with my scholarship disbursement and I had to check in with them and it turns out that there was an issue in the system that needed fixing. A lots of institutions have people in the financial aid department working remotely or are understaffed so sometimes you might not hear back from them or even have your call answered, so if those options don't work out I would suggest maybe going to campus to find someone to sort it out.",
      "author": "NoDryHands",
      "created": 1635729362,
      "upvotes": 1,
      "replies": {}
    }
  }
}