{
  "sid": "qqwyyz",
  "link": "/r/college/comments/qqwyyz/criminal_justice_vs_social_work/",
  "title:": "Criminal justice vs Social work",
  "text": "Hey everyone, \nI am thinking about changing my major (currently computer science). Math is just not my thing anymore, I was very smart at it when I was in high school but I have no interest in studying math anymore, I just can’t stand it.\n\nI enjoy searching for hours and writing, and was thinking about changing my major to either criminal justice (been my interest since I started college) or social work ( a friend of mine who has a degree in criminal justice said to look into it).\n\nSo I was wondering, if anyone had any experience with these two majors, what’s the main difference? And which is better for the future?",
  "author": "DeathAngel-X",
  "created": 1636558325,
  "updated": 1636655141,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hk2ugn2": {
      "link": "/r/college/comments/qqwyyz/criminal_justice_vs_social_work/hk2ugn2/",
      "text": "If I were in your shoes, I'd stick to the computer science degree. You will have a much better future earnings/ return on investment than either of the others you're looking at. Once you're done with school, leverage the marketability of CS and get a job you like that doesn't have to do with the math aspects.",
      "author": "Biggeasy",
      "created": 1636558657,
      "upvotes": 1,
      "replies": {
        "hk2uygd": {
          "link": "/r/college/comments/qqwyyz/criminal_justice_vs_social_work/hk2uygd/",
          "text": "Thank you for your advice I really appreciate it, it’s just if I stick to CS I will never graduate from it, I can’t stand studying math anymore, I know I sound like a kid and I should get my shit together, but I tried and every time I just lose hope and interest in math.\n\nSo, I was thinking about getting a degree that I can work with, then maybe in the future continue my CS degree",
          "author": "DeathAngel-X",
          "created": 1636558854,
          "upvotes": 1,
          "replies": {
            "hk2vumc": {
              "link": "/r/college/comments/qqwyyz/criminal_justice_vs_social_work/hk2vumc/",
              "text": "I know it's daunting right now, but I'd still suggest sticking with it. Rearrange classes so you give yourself a semester without math so you get a break, take advantage of tutoring/ study groups, whatever you gotta do. \n\nJust as a point of reference, I understand that social work is a noble field, however my local county starts folks with a bachelor's at $17 an hour, and those with a master's at $23, all capping at less than $30 an hour. All fine and dandy, but you can make that without spending tens of thousands on college.",
              "author": "Biggeasy",
              "created": 1636559195,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk2v2a4": {
      "link": "/r/college/comments/qqwyyz/criminal_justice_vs_social_work/hk2v2a4/",
      "text": "If you’re interested in these majors you should talk to a counselor about the different classes you will be taking for each, as well as the type of job prospects you will have after college. I don’t think you should stay in computer science if you really don’t care to work with computers/math in the future. However, it is still important to look into what careers will be available with these majors since college is a huge investment that you wouldn’t want to waste. So basically, talk to a counselor! (That’s my advice for almost everyone)",
      "author": "franco84732",
      "created": 1636558891,
      "upvotes": 1,
      "replies": {
        "hk2vbnb": {
          "link": "/r/college/comments/qqwyyz/criminal_justice_vs_social_work/hk2vbnb/",
          "text": "Thank you very much! I do have an appointment with a counselor in two weeks, I just wanted an idea about these majors.",
          "author": "DeathAngel-X",
          "created": 1636558987,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hk3bcye": {
      "link": "/r/college/comments/qqwyyz/criminal_justice_vs_social_work/hk3bcye/",
      "text": "I am a sociology major who is looking into MSW programs. One thing you should keep in mind is that many social work jobs (especially in my area) require a MSW. Also I used to be a CJ major, and also realized that many of those careers require at least a masters. I would definitely look up career fields your interested in and see what the academic requirements are and then go from there!",
      "author": "spinchrecall",
      "created": 1636565287,
      "upvotes": 1,
      "replies": {}
    },
    "hk5mhpc": {
      "link": "/r/college/comments/qqwyyz/criminal_justice_vs_social_work/hk5mhpc/",
      "text": "I’m currently in a criminal justice program and I am finding it extremely rewarding in the sense that I feel like an educated and informed citizen. I don’t have interest in law enforcement, but there are a lot of options that criminal justice can lay a foundation for- personally I’m leaning towards criminal psychology. (Edited a word).",
      "author": "mutual-cacophany",
      "created": 1636599532,
      "upvotes": 1,
      "replies": {}
    }
  }
}