{
  "sid": "q7ehra",
  "link": "/r/college/comments/q7ehra/i_feel_dumb_for_missing_my_class_any_advice/",
  "title:": "I feel dumb for missing my class. Any advice?",
  "text": "(I'm a nursing major btw; 19F) I just wanted to write this here because being angry at myself isn't doing enough for me.  I had a class at 8:30 am this morning and I woke around 6 something, but I couldn't get up and it's a stupid reason, but it's because I had to take a shower and brush and get ready. I actually enjoy the class, but I have trouble with taking shower or getting up from bed. I literally couldn't get up rather I just used my phone and I didn't want to go to class without taking a shower. and so I kept falling back asleep and when I woke up at around 8:14 I knew that I was going to be late :( .\n\nI'm not a fan of walking into class late so I just couldn't see myself getting ready anymore. I was even more mad because turns out the topic I was learning in class was one I was dying to learn because I'm afraid of not knowing how to communicate with patients because I can be socially awkward and now I feel like I'm doomed. \n\nI was so mad (and sad too) that I didn't want to get up anymore because then I would see how easy it would have been to just get up. I'm done ranting..I'm sorry if it doesn't make sense, but I wanted to go to email my professor to tell her that I was absent (she makes us sign in at the door) and to ask if I can get an overview at one her office hours, but anyways yea. Any advice, in general, please?",
  "author": "InterestedWallaby18",
  "created": 1634141428,
  "updated": 1634167536,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hgi61cu": {
      "link": "/r/college/comments/q7ehra/i_feel_dumb_for_missing_my_class_any_advice/hgi61cu/",
      "text": "Just let her know you had a off day, overslept and want to learn about what you missed in class. Most professors are understanding. I’m a junior and I missed no classes freshman year. Now that I’ve got the hang of everything it’s ok to miss one here and there",
      "author": "flyingfezz",
      "created": 1634144631,
      "upvotes": 5,
      "replies": {}
    },
    "hgi6va2": {
      "link": "/r/college/comments/q7ehra/i_feel_dumb_for_missing_my_class_any_advice/hgi6va2/",
      "text": "Everyone misses class sometimes, i think as long as you go to office hours and show your instructors that you want to do well in the course they should give you all the tools you need",
      "author": "consumehepatitis",
      "created": 1634144957,
      "upvotes": 2,
      "replies": {}
    },
    "hgiiep8": {
      "link": "/r/college/comments/q7ehra/i_feel_dumb_for_missing_my_class_any_advice/hgiiep8/",
      "text": "First, it's fine to miss here and there. As long as it's a rare occurrence it won't hurt you.\n\nSecond, I've had similar issues with struggling to get up and missing class (in HS, I haven't done it in college) and then hating myself for \"being a lazy POS\" but it was really just anxiety and depression and now that I'm medicated for it things are much better. If you have this problem frequently you might want to talk to a doctor. Just a friendly suggestion!",
      "author": "SuiDyed",
      "created": 1634149492,
      "upvotes": 1,
      "replies": {}
    },
    "hgj9zxy": {
      "link": "/r/college/comments/q7ehra/i_feel_dumb_for_missing_my_class_any_advice/hgj9zxy/",
      "text": "Set out your outfit the day before if you know that you struggle with this morning class. Also maybe invest in some dry shampoo and wipes in case you do need to get ready in a matter of minutes and run out the door.\n\nAlso remember that like 95% of the time, the things on your phone can wait and they’ll still be there after you’re done with class :)",
      "author": "shoelaceys7373",
      "created": 1634160776,
      "upvotes": 1,
      "replies": {}
    }
  }
}