{
  "sid": "qb6pl9",
  "link": "/r/college/comments/qb6pl9/is_that_normal/",
  "title:": "Is that normal?",
  "text": "One of my roommates is banging chicks left and right. My other roommate is friends with almost every girl he meets, he is hanging out with them most of the time even at night. I feel so insecure rn. Is that normal?",
  "author": "69earthling",
  "created": 1634630052,
  "updated": 1636176493,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hh7m51v": {
      "link": "/r/college/comments/qb6pl9/is_that_normal/hh7m51v/",
      "text": "Probably so man. I have a roommate who is also banging multiple chicks. It’s college bro.",
      "author": "KCVB56",
      "created": 1634632859,
      "upvotes": 2,
      "replies": {}
    },
    "hh807s0": {
      "link": "/r/college/comments/qb6pl9/is_that_normal/hh807s0/",
      "text": "I wouldn’t say it’s not normal, but you’re normal too, trust me. I didn’t meet anyone until my last semester and I had plenty of guy friends who were in the same boat. I know how hard it is and how lonely it can feel. Try doing some clubs or activities that tend to have more girls and just try to be friends with them, the rest will come. Run your race, not theirs!",
      "author": "starryeyed9",
      "created": 1634644232,
      "upvotes": 2,
      "replies": {}
    },
    "hh9uqr2": {
      "link": "/r/college/comments/qb6pl9/is_that_normal/hh9uqr2/",
      "text": "Ya know, this reminds me of a funny story. \n\nI had a room mate my sophomore year of college and he had literally fucked over 30 girls. I remember him bringing some mid 40 year old woman over to bang, different girls each week and from all over the place. \n\nOne week I vividly remember him telling us how uncool it really was. I just remember him being so out of character right then as he'd always been on board to go to pound town with pretty much anybody.\n\nHe's been a father ever since. It's a dangerous fucking game to play and I'm surprised most of us come out without kids. I've had my share of close calls and it's honestly not worth it. \n\nFinding a single girl to bang a lot is WAY better than banging a ton of girls. Diseases aren't fucking jokes and the cost to find out whether you have one or not isn't a joke either.",
      "author": "Awkward_Mail_2786",
      "created": 1634673161,
      "upvotes": 1,
      "replies": {
        "hhabrep": {
          "link": "/r/college/comments/qb6pl9/is_that_normal/hhabrep/",
          "text": "My roommate has girls coming over almost every 2 days I don't even know how that works. But yea I get what u mean.",
          "author": "69earthling",
          "created": 1634680112,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}