{
  "sid": "q7hwxm",
  "link": "/r/college/comments/q7hwxm/what_degree_suits_me/",
  "title:": "What degree suits me?",
  "text": " Hi, I am a 20yo Norwegian male currently studying at a college in Norway called the American College of Norway. To briefly explain how this college work; I am basically a non-degree seeking student this year, while I gather 30 credits aknowledged by American universities, and I will transfer next summer after I finish my year here.\n\nSince I am a non-degree seeking student, I have to pick a degree soon so that I know what to apply for in the US.\n\nMy dream job would be something within administration, as I am really facinated by how businesses work and the administration side of think, and I would like a job that allows me to be stationed in different countries for short periods of time, mainly in Asia.\n\nI am currently looking at getting a BS in Business, and then moving onto a Masters in Global Management, but at the same time, while I am reading about the global management masters, it doesn't really mention that much about what I would like to work with.\n\nTherefore I am asking my fellow Redditors here on r/college, what degree would fit me the best.\n\nI am sorry if this thread doesn't belong in this sub reddit. Thank you in advance.",
  "author": "5FeetOver",
  "created": 1634151153,
  "updated": 1634167549,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hgjct2j": {
      "link": "/r/college/comments/q7hwxm/what_degree_suits_me/hgjct2j/",
      "text": "International Business and an asian language",
      "author": "GoldRequest",
      "created": 1634161982,
      "upvotes": 1,
      "replies": {
        "hgjdkjx": {
          "link": "/r/college/comments/q7hwxm/what_degree_suits_me/hgjdkjx/",
          "text": "I don’t want to learn a language. I would like for an American or European company that operates in Asia, which may allow me to go there every now and then for an extended period of time.",
          "author": "5FeetOver",
          "created": 1634162316,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgjgh8u": {
      "link": "/r/college/comments/q7hwxm/what_degree_suits_me/hgjgh8u/",
      "text": "A business won’t easily send you overseas unless you are in a high position (think manager of a branch, senior accountant and HR representative, etc) or unless you can speak the language. You have to sell yourself to your company as being a valuable asset and/or eligible to go overseas. Otherwise they will only send you to other English speaking or Norwegian speaking places. \n\nAlthough a business may let you operate and live in a foreign country remotely, likely moving there would then be on your own dime.",
      "author": "milk1tea",
      "created": 1634163608,
      "upvotes": 1,
      "replies": {}
    },
    "hgj81ee": {
      "link": "/r/college/comments/q7hwxm/what_degree_suits_me/hgj81ee/",
      "text": "I’m a senior in business admin and will have my bachelors by next Spring. It’s a good degree and versatile. Get involved in global companies. There’s so much work in managing a global firm. Getting a business admin degree will mean you can play around before picking a specialty as opposed to finance or accounting. That degree is an inch deep in every aspect of business. International finance was one of my favorite classes though. I recommend it.",
      "author": "Butthole_seizure",
      "created": 1634159942,
      "upvotes": 1,
      "replies": {
        "hgjdopa": {
          "link": "/r/college/comments/q7hwxm/what_degree_suits_me/hgjdopa/",
          "text": "Okay, thank you. I’ll probably do that then, then I can use my masters to specialize somewhere",
          "author": "5FeetOver",
          "created": 1634162368,
          "upvotes": 1,
          "replies": {
            "hgje71g": {
              "link": "/r/college/comments/q7hwxm/what_degree_suits_me/hgje71g/",
              "text": "Masters is definitely for specialty and/or to level you up in your current field. \n\nTake international business classes. Many professors are seasoned in that world. My international finance professor worked for IBM Japan. He had the coolest stories about his work and living in a different country. He always had his door open for students interested in international opportunities. Seek out people like him. They can help you build your path.",
              "author": "Butthole_seizure",
              "created": 1634162594,
              "upvotes": 1,
              "replies": {
                "hgjebl2": {
                  "link": "/r/college/comments/q7hwxm/what_degree_suits_me/hgjebl2/",
                  "text": "That sounds like a dream job for me. Ill do that then, thank you for your help!",
                  "author": "5FeetOver",
                  "created": 1634162648,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}