{
  "sid": "qrcakt",
  "link": "/r/college/comments/qrcakt/how_to_spend_a_day_off_to_recover_from_burnout/",
  "title:": "how to spend a day off to recover from burnout?",
  "text": "Title kind of says it all. I'm in my first semester of college. I don't have a major so I am taking a bunch of classes to try and figure out what I want to pursue. I've joined several clubs and been actively looking for internships, jobs, and a bunch of other things I feel like I need to do but probably don't have time for.\n\nAs I was walking down my dorm hall today all the lights looked fuzzy and bright; I took a nap, and ate something when I woke up. I felt better, but I still don't really feel up to chugging away again...I have a day off tomorrow for Veterans Day, and I am definitely burnt out, but I can't really afford to take more than tomorrow to relax, much less the weekend. Does anybody do anything when they are feeling burnt out?",
  "author": "mwe38",
  "created": 1636603164,
  "updated": 1636654779,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hk5wzbs": {
      "link": "/r/college/comments/qrcakt/how_to_spend_a_day_off_to_recover_from_burnout/hk5wzbs/",
      "text": "This is what I would do, you can adapt as you need. Keep in mind I am an introvert, so if you're not maybe this is not the best way for you.\n\n1. Starting the night before: take a longer shower, take time to wash my hair, exfoliate, anything I don't always have time to do I would put the effort in at this time. \n\n2. Text your main people that you're taking tomorrow off and you won't be available, once you do, set you phone to do not disturb. No more people. Yay. Set the alarm to your regular time plus one for one hour later. \n\n3. Put on some moisturizer, read a book you've been meaning to, and go to sleep early. \n\n4. Wake up and eat breakfast. Something with protein is best, but if you want Nutella filled waffles I do not judge you. After breakfast, put on workout clothes. Not to workout, but because they are really comfy. \n\n5. Go outside and get some sun if that bright motherfucker is out in the sky. Sit somewhere where you get sunlight and just breathe and think about how this is a time for you. You are recharging in the sun. You are a complicated house plant, you need water and sunlight. Listen to some music too. \n\n6. Move. Get a kpop dance lesson on YouTube and practice it. Do yoga. Run after pigeons like you're a crazy golden retriever. Just move a bit, however you want, it doesn't need to make sense.\n\n7. Eat something that makes you happy. Is it avocado salad? Is is a giant burrito? Is it popcorn from a movie theater? Just go and get something that makes your brain make happy chemicals. Drink lots of water too. \n\n8. Not talking is the goal, people drain me so sometimes I need to not talk. If the only way to do it is to go to a library, go up to the highest level and lay on the floor until someone kicks you out, so be it\n\n9. Shower again, sing if you want, be mindful of the water hitting you and the sensation big being cleansed. \n\n10. Before going to bed, sit down and make a list of things you need to do the next day. Review it. You probably can do some of that another time, make a rough plan for the week and promise yourself you'll kinda follow it. \n\n11. Go to bed and think of all the amazing things you did all for yourself today.\n\nI do something like this once a month to reset myself and not get burned out, good luck",
      "author": "CollegeGalStuff",
      "created": 1636604615,
      "upvotes": 3,
      "replies": {}
    },
    "hk5vo0n": {
      "link": "/r/college/comments/qrcakt/how_to_spend_a_day_off_to_recover_from_burnout/hk5vo0n/",
      "text": "If you’re passing out, you should see a doctor.",
      "author": "AceyAceyAcey",
      "created": 1636603937,
      "upvotes": 1,
      "replies": {}
    }
  }
}