{"sid": "o33d85", "link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/", "title:": "How do I defend my Thesis from false Plagerism allegations?", "text": "For my bachelor thesis, I wrote about Biology and how machine learning can help in drug discovery. however, they said the overall plagerism count was \"too high\". it was 24% and the checker had my entire bibliography of 40 plus citations, including my own name and names of viruses listed as plagerism. Even the term \"Machine Learning\" was listed as plagerism with 20 hits. I explained to them that they can actually look through these sources themselves and see that most of the plagerism \"hits\" were from websites like \"Arab music world\", hidden from google searches or  in most cases where 5 words per entire paragraph were written in the same order. Then they changed their story and said it's not plagerism and that my proffesor whom I met twice and was my supervisor told me that I didn't reference \"basic biology knowledge\" and that I couldn't have written in myself. In the plagerism checker there were 25 other different papers that were using the same terms (because hey it's biology, can't really change names of viruses) and that was enough for them to claim plagerism on me. I explained to them that general knowledge according to [plagerism.org](https://plagerism.org) guidlines or bioinformatic publications online do not cite general knowledge such as \"An antibody is a protein\".  The sections he is refering to are sections where I'm either describing an image from my own words, or basic knowledge I know from high school. Aparantly, this is important to this institution and my supervisor never made mention of this in the feedback of the several drafts I sent him. In their terms of service for the thesis they say that the supervisor should guide the thesis step by step and provide detailed feedback so that the student does not end up in trouble. Now, 12 days after the deadline and several drafts he tells me about this citation of basic knowledge requirement and says I have to wait 7 months to submit my paper again to graduate. In the recent email he was even mocking me telling me that \"there is no time lost and you can do more x for your paper\" when my paper already focused on that topic which clearly means he didnt even read my paper....\n\nHow can I combat this situation where I was clearly not told of important information and that he clearly didnt read my paper? How can I clear my name and get some sort of compensation? I emailed him several drafts and he never advised me on this and yet I'm the one being punished for it. I implemented every single one of the changes he requested and I even saved each intermediate version so in conjuction with the mails its clear to see that I was following his advice. Am I somehow responsible for this? Who can I contact for this situation?", "author": "JavaNeenja", "created": 1624059704, "retrieved": 1632802688, "over_18": false, "upvotes": 690, "upvote_ratio": 0.99, "comments": {"h2eerd2": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2eerd2/", "text": "I used to use Chegg to check everyones work in group projects while I was obtaining my MBA. I never had a single issue until I ran into an HR ditz. Literally copied word for word. So we as a group decided to submit her paper separate as we all had to rewrite her sections. For whatever dumb reason they let her slide.", "author": null, "created": 1624166284, "upvotes": 1}, "h2e55h2": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2e55h2/", "text": "Yes", "author": "Singlehusband7", "created": 1624159780, "upvotes": 0}, "h2ci8fr": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2ci8fr/", "text": "[removed]", "author": null, "created": 1624126549, "upvotes": 1}, "h2c14dl": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2c14dl/", "text": "Trained professionals at your university who will read and evaluate your paper are more reliable than redditors who have no clue what you actually wrote.", "author": "AcademicDifficulty", "created": 1624117935, "upvotes": 2}, "h2bxlgk": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2bxlgk/", "text": "Since when does a Bachelors degree require a Thesis paper?  I graduated 28 years ago so I guess maybe it changed but I didn’t even have to do a thesis for my masters.  My degree was in writing so we wrote a ton of research papers, of which a thesis is a part of the process, but none of them were a “final to graduate” type paper.", "author": "StCrispin1969", "created": 1624116093, "upvotes": 3}, "h2boqm7": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2boqm7/", "text": "[deleted]", "author": null, "created": 1624111306, "upvotes": 11}, "h2bncli": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2bncli/", "text": "If you're in the US, your college may have a formal conduct procedure for academic dishonesty, including a conduct office or ombudsman who helps students through the process. Check your student handbook or google your university name + conduct to see if you can figure out the name and contact info of this office, or if you have an academic advisor that's not this faculty member, ask them. \n\nYou can reach out to the conduct office directly about the situation. On my campus, students have a right to go through student conduct when accused of academic dishonesty, which gives the student an opportunity to present evidence to a conduct committee outside the department so that they're not subject to bias in the decision.", "author": "LadySusansGhost", "created": 1624110518, "upvotes": 3}, "h2bawin": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2bawin/", "text": "I guess you are from the US, but here in Germany I would recommend getting a lawyer that specializes in university related cases. I would definetely look into that.", "author": "Spurlaut", "created": 1624101754, "upvotes": -1}, "h2baas4": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2baas4/", "text": "You need to take this to your Dean of your major ASAP, and take it to the highest authority possible at academic integrity", "author": null, "created": 1624101235, "upvotes": 1}, "h2avjus": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2avjus/", "text": "> which clearly means he didn't even read my paper....\n\n\nwelcome to academia", "author": "ObjectiveAnalysis643", "created": 1624087007, "upvotes": 37}, "h2apm37": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2apm37/", "text": "[deleted]", "author": null, "created": 1624081897, "upvotes": -5}, "h2ajm9x": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2ajm9x/", "text": "A lot of people giving good advice on how to get things fixed. \n\nMy only suggestion no matter what you do is to get copies of everything, screenshot, get formal writings from them stating what is wrong, document your case and paper well. People’s recollections change fast when they are properly challenged and find out they are in the wrong.", "author": "LPKKiller", "created": 1624077611, "upvotes": 56}, "h2ai0r1": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2ai0r1/", "text": "Plagerism checks can be so ridiculous. Turn it in said I had 5% for plagarism and it was singling out individual words and conjugations.", "author": "WhatABlake", "created": 1624076619, "upvotes": 47}, "h2afp4g": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2afp4g/", "text": "I’m glad I graduated before this kind of stuff was a thing.", "author": "Cruiser5139", "created": 1624075231, "upvotes": 15}, "h2ad6dt": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2ad6dt/", "text": "one time i had the word \"the\" count as plagiarism, honestly so stupid", "author": "09ikj", "created": 1624073768, "upvotes": 169}, "h2a9zw4": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2a9zw4/", "text": "[removed]", "author": null, "created": 1624072010, "upvotes": 1}, "h2a93s1": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2a93s1/", "text": "You don't.", "author": "ihavenoideanymore21", "created": 1624071505, "upvotes": -47}, "h2a93r9": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2a93r9/", "text": "You don't.", "author": "ihavenoideanymore21", "created": 1624071505, "upvotes": -49}, "h2a7uxl": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2a7uxl/", "text": "My comment (in response to another) got deleted. Just want to make sure you see what I wrote:\n\nI suggested checking your school’s honor code or code of conduct because these will typically have specific guidelines for how you can respond and who you should contact.", "author": "crepuscularsounds", "created": 1624070815, "upvotes": 73}, "h2a5sua": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2a5sua/", "text": "Appeal to the department chairperson or to the college dean?", "author": "LesbiaFlexible", "created": 1624069703, "upvotes": 23}, "h2a5fld": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2a5fld/", "text": "Go to your university ombudsman if they have one. Generally with situations like this you have to keep appealing higher and higher until you find an administrator that realizes that your university doesn't want a giant headache over false accusations.", "author": "chesterfielders", "created": 1624069500, "upvotes": 309}, "h2a1cgb": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2a1cgb/", "text": "Plagiarism.", "author": "BalmyCar46", "created": 1624067299, "upvotes": -44}, "h2a0132": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h2a0132/", "text": ">How can I ... get some sort of compensation\n\nwhat sort of compensation do you think you are entitled to here?\n\nThe pathway will be different depending on what you want.", "author": "RollWave_", "created": 1624066566, "upvotes": 33}, "h29uxng": {"link": "/r/college/comments/o33d85/how_do_i_defend_my_thesis_from_false_plagerism/h29uxng/", "text": "File a formal complaint via email, and outline your evidence and rationale. If this doesn’t fix the issue, escalate to a program chair, and then dean, and then someone higher up if need be. Check your college’s student handbook to learn about the grade complaint policy", "author": "thedarkwillcomeagain", "created": 1624063715, "upvotes": 459}}}