{"sid": "pt80is", "link": "/r/college/comments/pt80is/i_feel_incompetent/", "title:": "i feel incompetent", "text": "is it normal to feel like shit in college as a freshman? it sucks being a constant achiever in a competitive highschool environment then all of a sudden college tells you \"oh did you know that you suck big time? here's a failing grade in an area where you excel at before.\" \n\n\ni love to study but this feeling sucks. i feel so fucking demotivated. we have 4 semesters per year (Mapua) and the grading system fucks up our QWA big time. one failing mark and your good to go as an irregular student. i can't afford being one because of my scholarship... \n\n:(", "author": "codebIu", "created": 1632318815, "retrieved": 1632800849, "over_18": false, "upvotes": 8, "upvote_ratio": 0.84, "comments": {"hegzohz": {"link": "/r/college/comments/pt80is/i_feel_incompetent/hegzohz/", "text": "Rewire your brain and take it as a challenge. \n\nPlease take it as a grain of salt; once you overcome this phase in your academic conquest in Mapua, it will be much easier to face similar scenarios in your professional career.", "author": "MellonBoi", "created": 1632750864, "upvotes": 1}, "hduiuwa": {"link": "/r/college/comments/pt80is/i_feel_incompetent/hduiuwa/", "text": "Take advantage of any resources your school has. Talk to your professor. Go to student services. Whatever. These people are here for you and this is just the beginning of your adult life.\n\nLearning to find help is one of the greatest lessons you'll ever learn.", "author": "Knute5", "created": 1632320738, "upvotes": 1}, "hdufete": {"link": "/r/college/comments/pt80is/i_feel_incompetent/hdufete/", "text": "I had this same problem. I was the \"smartest\" in my family & always got straight A's in high school, but going into college and realizing I'm just... Average... Really messed with my head. \n\nI learned to stop trying to \"impress\" anyone with my skills and instead focused on passing & actually understanding the material.\n\nCollege *should* be challenging. And each professor is different so there's always a learning curve with each new class.\n\nJust tell yourself \"it's ok to be average, there is nothing wrong with that\".\n\nPlus, you'll find that you *do* excel in certain areas compared to other students. It's a whole different world. Welcome to it. You'll be ok 💗", "author": "BarIntelligent9156", "created": 1632319211, "upvotes": 7}}}