{"sid": "pxvwbl", "link": "/r/college/comments/pxvwbl/how_do_i_deal_with_constructive_criticism_from/", "title:": "How do I deal with constructive criticism from professors?", "text": "After only having dealt with professors who never communicate or only seem to focus on the positive, I'm getting stressed and the thought of withdrawing even appeared in my mind. I felt like a kid getting lectured by their parent about how disappointed they are in me. \n\nIt's on an assignment for my research paper so I know how important it is to get feedback, but how do I stop reeling over it and get back on track?", "author": "mymindbad", "created": 1632923759, "retrieved": 1632945358, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"heq83m1": {"link": "/r/college/comments/pxvwbl/how_do_i_deal_with_constructive_criticism_from/heq83m1/", "text": "It's normal to feel this way! When you work hard on something, and *especially* if you've only gotten positive comments before, it can seem like a lot.\n\n\nThe thing to remember is that constructive criticism isn't a judgment of you or your work. It's there to help you learn and improve. Someone cared enough about your work and your performance that they gave you suggestions. It may not always feel that way, and now and then you'll have someone who's just an asshole, but most of the time, it really is done for you.\n\n\nSo, just look at the feedback, take a second to feel what you feel, and then see how you can apply it next time. If you're not sure, office hours are great for that.\n\n\nOn a more personal note, remember feedback isn't about you, and that your work doesn't have to be perfect to be solid. Even profs who have written tons of books and articles get negative feedback on projects. It's okay; it's all part of the process!", "author": "torgoboi", "created": 1632926820, "upvotes": 3}, "heq7qp3": {"link": "/r/college/comments/pxvwbl/how_do_i_deal_with_constructive_criticism_from/heq7qp3/", "text": "The only way to get better at receiving criticism is to receive it repeatedly. It’s going to be hard at first, especially if you’ve never had honest critique before (and a lot of people haven’t). The professors who leave honest feedback are doing the right thing - they want you to improve, and the only way to do that is to give you direct feedback. There will be plenty of times this will happen both inside and outside of school, so it’s good to get used to it now.", "author": "PhDapper", "created": 1632926666, "upvotes": 2}, "heq7q5g": {"link": "/r/college/comments/pxvwbl/how_do_i_deal_with_constructive_criticism_from/heq7q5g/", "text": "What is the context for the criticism? Is this a first draft that you are expected to correct or are you looking for help before turning in the assignment?  \n\n\nProfessors are not looking to knock you down, they're looking to help you improve. Good feedback should be to the point. Some students feel that is nitpicking or harsh, but in reality it is giving you instruction on what to do.", "author": "hdorsettcase", "created": 1632926659, "upvotes": 1}, "heq65no": {"link": "/r/college/comments/pxvwbl/how_do_i_deal_with_constructive_criticism_from/heq65no/", "text": "I’ve had professors harshly criticize my essays and I know how you feel. You probably put a lot of effort into your work and you feel disheartened. Some professors are pretty blunt, I know. The best thing to do is to forget about it.", "author": "b0bcr4tch1t", "created": 1632925992, "upvotes": 2}}}