{
  "sid": "q7c24l",
  "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/",
  "title:": "Missed an exam by accident",
  "text": "I thought it closed monday not saturday. \n\nProfessor won't let me make it up.\n\nI had in A in the class, now highest I can get is a C. Now I have 3 Cs total in my academic career.\n\nTried asking about extra credit, professor said \"read the syllabus\" although all the syllabus says is that there is extra credit and not how much or what it is.\n\nI have to apply for Grad School. With a C in a major course, I'm fucked.\n\nI hate my life.\n\nEdit: Never mind, I rechecked the syllabus and even with this missed test I can still get a B. It's not an A but at least there's still a chance for me to fix things.",
  "author": "catsinbananahats",
  "created": 1634134414,
  "updated": 1634167439,
  "over_18": false,
  "upvotes": 313,
  "upvote_ratio": 0.94,
  "comments": {
    "hgi8r6f": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgi8r6f/",
      "text": "I got into (a few) grad school(s) with a C in a major course (calc II) and a few others. My GRE scores were good and they asked about them in the interviews. I told them the truth and pointed out that my other courses were good and I still learned quite a bit from the course. They seemed okay with the answers and gave me an offer.",
      "author": "The-Wrong_Guy",
      "created": 1634145703,
      "upvotes": 103,
      "replies": {
        "hgj2nsn": {
          "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgj2nsn/",
          "text": "im a freshman and i have a c+ in calc II rn should I be worried?",
          "author": "SlingoPlayz",
          "created": 1634157699,
          "upvotes": 13,
          "replies": {
            "hgj3rai": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgj3rai/",
              "text": "Worried? If you're learning the material, not at all. In the eyes of graduate schools it is perfectly acceptable, and maybe even desired, to be able to demonstrate growth as both a person and student. For example, they will ask about it and if you can point to later math classes with a better grade you can talk about your growth during that time. \n\n Academically, as long as you are Learning the material you will be fine. I would take this opportunity to figure what it is you're struggling with and practice that. Is it not doing enough problems? Try doing some more (I read on a subreddit a great quote a few days ago that said \"Math is not a spectator sport.\" Meaning that you have to actively participate and do the work). Is it the wording of the questions on exams? Practice reading past exams or talk to your professor about how to decipher them. Is it the concept of calc II? Find other sources to learn from that fit well with you. Sometimes you really need to see concepts presented in a different way to understand it. \n\nEspecially if you're going to be using calc in the future, classes or work, I'd suggest slowing down and focus on learning. The grades will come with that, not before, and so will a good mindset for future classes.",
              "author": "The-Wrong_Guy",
              "created": 1634158150,
              "upvotes": 8,
              "replies": {
                "hgj9dqi": {
                  "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgj9dqi/",
                  "text": "Yea i just asked cuz u said major courses and then calc II so i was interested",
                  "author": "SlingoPlayz",
                  "created": 1634160509,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hgjfj28": {
          "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgjfj28/",
          "text": "Where do you go now?",
          "author": "HovercraftDowntown88",
          "created": 1634163178,
          "upvotes": 1,
          "replies": {
            "hgjg9ht": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgjg9ht/",
              "text": "University of Florida",
              "author": "The-Wrong_Guy",
              "created": 1634163511,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgirndw": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgirndw/",
      "text": "Trust me, you’ll be ok with one C in the major, especially during the pandemic.",
      "author": "AcademicDifficulty",
      "created": 1634153218,
      "upvotes": 25,
      "replies": {}
    },
    "hghjdsn": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hghjdsn/",
      "text": "Sometimes, the most painful lessons are the ones we learn from the best.",
      "author": "VA_Network_Nerd",
      "created": 1634135410,
      "upvotes": 151,
      "replies": {
        "hgj519k": {
          "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgj519k/",
          "text": "It seems like school punishes us more than the real world does. Like if you turn in an assignment one day late you get a zero but in the real world, it's frowned upon to miss a deadline but usually acceptable.",
          "author": "Tustinite",
          "created": 1634158675,
          "upvotes": 17,
          "replies": {
            "hgj720c": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgj720c/",
              "text": "> Like if you turn in an assignment one day late you get a zero but in the real world, it's frowned upon to miss a deadline but usually acceptable.  \n\nDepends entirely on the assignment.  \n\nSending a fancy slide deck to your boss on Monday morning instead of Saturday is no big deal if the meeting to present the material isn't until Tuesday.  \n\nBut if the boss said they needed it on Saturday because the presentation is first thing Monday morning, three or four time-zones ahead of wherever you are, you just dropped a pretty large and potentially serious ball.",
              "author": "VA_Network_Nerd",
              "created": 1634159525,
              "upvotes": 16,
              "replies": {}
            }
          }
        },
        "hghjzy3": {
          "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hghjzy3/",
          "text": "I doubt I'll learn from this. I'll probably fail out of grad school, if I even get in at all.",
          "author": "catsinbananahats",
          "created": 1634135667,
          "upvotes": -75,
          "replies": {
            "hghl7sr": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hghl7sr/",
              "text": "As a perfectionist I can totally understand how it may feel like it the end of the world getting a bad mark, but it’s not. \nPeople fail classes all the time yet still get accepted into graduate programs.\n\nYou have a few options though. Just finish the course and never look back, finish the course and retake it another semester, or withdraw and take a W to save your GPA and retake the course another time. \n\nA C isn’t the worst grade you could get. It’s considerably better than a D or an F. You just have to rally and not let this affect the rest of your semester.",
              "author": "kizeltine",
              "created": 1634136163,
              "upvotes": 63,
              "replies": {
                "hghlfcf": {
                  "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hghlfcf/",
                  "text": "I can't retake anything, this is a fall semester only class and this is my senior year.",
                  "author": "catsinbananahats",
                  "created": 1634136249,
                  "upvotes": -11,
                  "replies": {
                    "hgjhatx": {
                      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgjhatx/",
                      "text": "You absolutely can retake it lol. Take it next fall and graduate a semester late. Its really not a huge deal",
                      "author": "taybay462",
                      "created": 1634163972,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hgiriyt": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgiriyt/",
              "text": "With such a fatalist attitude, you're right. \n\nIf, however, you can stop and be able to realize the lessons you can put into place in the future, it's absolutely surmountable. Used to work in graduate admissions and a C wasn't a dealbreaker.  The committee might ask about it, especially if it's out of character of the rest of your transcript.  If your response blames everything on everyone else, well...I don't want to admit you. If your response can talk about the mistakes you made, what you learned from them, and how you're changing things moving forward, I can work with that.",
              "author": "trustmeiknowthings",
              "created": 1634153169,
              "upvotes": 16,
              "replies": {
                "hgisu1e": {
                  "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgisu1e/",
                  "text": "The thing is I don't have a good excuse. I went out of town for a bachelorette party last weekend and put my exam off because I thought I could do it Monday and when I checked the due date Monday was what I thought it said. I should've rechecked. It was due that Saturday, and I was partying that whole Saturday.",
                  "author": "catsinbananahats",
                  "created": 1634153696,
                  "upvotes": -2,
                  "replies": {
                    "hgja98c": {
                      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgja98c/",
                      "text": "It's still a good lesson overall and shows growth obviously don't mention the bachelorette party stuff no need to divulge that much information. Just talk about what you did differently to avoid this from happening again i'm sure others can relate.",
                      "author": "HugeRichard11",
                      "created": 1634160887,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hgjlptr": {
                      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgjlptr/",
                      "text": "So, you learned that you need to double check things. What will you do differently next time? They’re not looking for you to make an excuse, but to take responsibility.",
                      "author": "trustmeiknowthings",
                      "created": 1634165991,
                      "upvotes": 1,
                      "replies": {
                        "hgjnyc0": {
                          "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgjnyc0/",
                          "text": "The thing I'm worried about is that I have two other Cs before this one and I can't explain one C as me forgetting to double check when I have two others that happened when I remembered the test dates.",
                          "author": "catsinbananahats",
                          "created": 1634167023,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hghyedu": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hghyedu/",
              "text": "You learned to not miss your exams next time lmao. I missed a call quiz two weeks ago and i felt so fucking bad about it but after a while you’ll forget about it and it’ll all be fine. Just don’t worry about it too much bro, it happens",
              "author": "zXHerpaDerpXz",
              "created": 1634141556,
              "upvotes": 23,
              "replies": {
                "hgia9ui": {
                  "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgia9ui/",
                  "text": "Call Quiz?",
                  "author": "jameskishtok",
                  "created": 1634146287,
                  "upvotes": 6,
                  "replies": {
                    "hgj325g": {
                      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgj325g/",
                      "text": "Calc quiz???",
                      "author": "metal_bulb",
                      "created": 1634157863,
                      "upvotes": 1,
                      "replies": {
                        "hgj7d7y": {
                          "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgj7d7y/",
                          "text": "That’s what I was thinking but I didn’t want to say that. Maybe it is terminology a professor came up with for a virtual quiz.\n\nWasn’t sure",
                          "author": "jameskishtok",
                          "created": 1634159657,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hghunil": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hghunil/",
              "text": "Myself and multiple people I know got into grad school with C grades. Maybe getting into a med school would be harder with a low grade, but for most programs, *one mediocre grade* won't hurt you.\n\n\nThe lesson to learn is to check and double check (and at times, triple check) everything. Keep a calendar. Plan to do things *early* as often as possible, so that if shit comes up, you're still on time. If you're planning on grad school, those are skills you need anyway, since you'll have way more responsibilities to manage.",
              "author": "torgoboi",
              "created": 1634140014,
              "upvotes": 13,
              "replies": {
                "hghwqs6": {
                  "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hghwqs6/",
                  "text": "Exactly. Hell, I had multiple C’s and even failed calc, now I’m in one of the best programs in my field. The grade doesn’t matter as much as how you learn from it.",
                  "author": "marbelousgeologist",
                  "created": 1634140874,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            },
            "hginn19": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hginn19/",
              "text": "Not with that attitude.",
              "author": "LordofDsnuts",
              "created": 1634151602,
              "upvotes": 5,
              "replies": {}
            },
            "hgiv4ty": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgiv4ty/",
              "text": "MIT rejected a guy who made a nuclear reactor. Perfection isn't everything.",
              "author": "OoglieBooglie93",
              "created": 1634154623,
              "upvotes": 3,
              "replies": {}
            },
            "hgjh7pe": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgjh7pe/",
              "text": "That whole attitude is not gonna serve you well. You wont learn from this? Really? Youre not going to double and triple check the date and time an exam closes?",
              "author": "taybay462",
              "created": 1634163933,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgiwqrw": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgiwqrw/",
      "text": "missing an exam and then asking for extra credit is typically not a good way to gain sympathy from a teacher. It comes off in their head as  \n\n\n\"Hey, I was irresponsible and missed your test because of x, y, and z. Can you pretty please give me extra credit for being irresponsible?\"\n\n&#x200B;\n\nWhich I mean, to be fair, is basically what it is. \n\n&#x200B;\n\nThat said if you continue doing well in the class and do everything else to the best of your ability, and get noticed because of this, then you'll have a better chance at getting the opportunity for a curve and/or extra credit. \n\n(Not a teacher, have worked with a lot of teachers though, and this is what I'd expect them to say). \n\n&#x200B;\n\nAlternatively, you can just drop the class and try again. GPA doesn't really mean anything after college anyway.",
      "author": "GennaroIsGod",
      "created": 1634155273,
      "upvotes": 6,
      "replies": {
        "hgiy1tu": {
          "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgiy1tu/",
          "text": "GPA means a lot after college when you're applying to grad school. And I can't just drop the class because this is my last fall semester.",
          "author": "catsinbananahats",
          "created": 1634155797,
          "upvotes": 3,
          "replies": {
            "hgiymof": {
              "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgiymof/",
              "text": "Ahh I guess for higher education thatd be a different story, along with some fields like doctors/lawyers and whoever else has strict requirements that don't make a lot of sense for the most part.",
              "author": "GennaroIsGod",
              "created": 1634156031,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hgiqpaq": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgiqpaq/",
      "text": "I'm glad you can pull out a B.  Take this as a life lesson on preparation.",
      "author": "Ocean2731",
      "created": 1634152838,
      "upvotes": 7,
      "replies": {}
    },
    "hghy5mu": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hghy5mu/",
      "text": "A couple Bs or Cs shows you have actually experienced some difficulty. Straight As really don't tell a story and a lot of good grad schools like success stories.\n\nYou can contextualize any poor grades in your application. I was considering several top 20 schools before I decided I didn't need a masters. I have an F and a D on my undergrad transcript. My story is that these were during the first two years and that the last two years are much better. \n\nSince this was during the last year you can't use that same strategy. But you can work to demonstrate how commited you were to extra work like projects, volunteering, or independent research during this semester. You want to make it look like you took on a ton of stuff and were ambitious, but it was just a little more than you could handle at the time. And above all else I would not keep talking in a way that diminishes yourself or looks like an apology. I don't think admissions likes that sort of talk.",
      "author": "darniforgotmypwd",
      "created": 1634141456,
      "upvotes": 39,
      "replies": {}
    },
    "hgittoa": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgittoa/",
      "text": "I'm a very light sleeper and always wake up to my alarms. However on the morning of my anatomy exam I slept in somehow and missed my exam. I was extremely upset because this was already my second time taking this class and I knew everything on this exam so I was going to get a good grade. Slept in and wanted to die. However, I still ended up with a B in the class. Even though I'd failed the class before and got a B the second time (I did it with other classes as well), I've gotten 2 interviews for doctorate programs I'm applying to. You'll be upset, but don't let it weigh you down.",
      "author": "Anarantula",
      "created": 1634154097,
      "upvotes": 5,
      "replies": {}
    },
    "hgj8wcf": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgj8wcf/",
      "text": ">I have to apply for Grad School. With a C in a major course, I'm fucked.\r  \n\r  \n\n\nI didn't get into Caltech (application rejected in two weeks), ended up at a reasonably good state school for PhD in a STEM field (UMN), even with some low B's and high C's. It's definitely a blemish for sure, but perhaps not world-busting so long as the other parts of your application look good.",
      "author": "TheEvilBlight",
      "created": 1634160305,
      "upvotes": 1,
      "replies": {
        "hgj949a": {
          "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgj949a/",
          "text": "Having learned the hard way about deadlines in grad school, this stinging experience is probably going to be memorable and hopefully keep you in good stead when you're in a grad program: lots of juggled deadlines, such as scheduling prelims and quals and how long before the program decides to dropkick you.\n\nGoogle Calendar (or whatever calendar) the hell out of your life",
          "author": "TheEvilBlight",
          "created": 1634160397,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgjfjuq": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgjfjuq/",
      "text": "That's rough buddy",
      "author": "_heatwaves_",
      "created": 1634163188,
      "upvotes": 1,
      "replies": {}
    },
    "hgjcig9": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgjcig9/",
      "text": "I hated the \"read the syllabus\" profs. Comes off as lazy and they sound like they don't give a shit to me.\n\nI had to miss days and assignments for family reasons and stuff and college and there would always be at least 1 or more prof who would just reply with \"read the syllabus\". They could at least pretend to care and talk about why they won't accept it one day late.",
      "author": "spicyboi619",
      "created": 1634161853,
      "upvotes": 1,
      "replies": {}
    },
    "hgip778": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgip778/",
      "text": "Sucks. Just try and move forward and do your best on all remaining assignments/tests.  S",
      "author": "LatinaPumpkina",
      "created": 1634152230,
      "upvotes": 1,
      "replies": {}
    },
    "hgishp0": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgishp0/",
      "text": "sometimes the final replaces the lowest grade so don't count yourself out yet",
      "author": "cumyounut",
      "created": 1634153557,
      "upvotes": 1,
      "replies": {}
    },
    "hgix2b5": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgix2b5/",
      "text": "Well I missed a writing essay for my midterms on purpose.",
      "author": "zerquet",
      "created": 1634155402,
      "upvotes": 1,
      "replies": {}
    },
    "hgj1urq": {
      "link": "/r/college/comments/q7c24l/missed_an_exam_by_accident/hgj1urq/",
      "text": "You live and learn, it won't mess you up",
      "author": "guy_with-thumbs",
      "created": 1634157366,
      "upvotes": 1,
      "replies": {}
    }
  }
}