{
  "sid": "qy0ubw",
  "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/",
  "title:": "Opinion needed about essay due date discrepancy",
  "text": "Im in this business ethics class and there’s a 10+ page paper that’s worth 25% of our grade. For last name’s A-M it is due on the 27th of November but for N-Z it is December 4th. \nI asked the professor if there was a reason for the difference and it essentially boiled down to her not wanting to read all the papers at once. \nEveryones doing the same assignment so it seems completely unfair that I lose an extra week to work on this paper just cause my last name is A-M. \nDo I report this to the department?",
  "author": "Zeas-44",
  "created": 1637394950,
  "updated": 1637689508,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hld4mdw": {
      "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hld4mdw/",
      "text": "The excuse doesn't really make much sense,  your professor can collect all papers at once and still not read every paper at the same time. If it bothers you that it's unfair, I'd say go report it. But if you think you can still do well despite having an earlier deadline, then just finish the paper.",
      "author": "kupcakezz",
      "created": 1637395783,
      "upvotes": 4,
      "replies": {
        "hld50ev": {
          "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hld50ev/",
          "text": "I think I’ll be fine personally. I’ve made it 3 and a half years in college doing things last minute lol. But, yeah it does bother me that there’s an unnecessary gap in due dates. I feel bad for future students of hers that she can just essentially say “hey your paper is due a week earlier than your peer’s cause…. Reasons”",
          "author": "Zeas-44",
          "created": 1637396115,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hldj88v": {
      "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hldj88v/",
      "text": "Tbh this is a pretty cool system from a grading standpoint. Instead of everyone waiting longer for their grades she’s figured out how to make better use of prof and students’ time.",
      "author": "ProfessorHomeBrew",
      "created": 1637408374,
      "upvotes": 3,
      "replies": {
        "hldjq16": {
          "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hldjq16/",
          "text": "Why not just have them all due on the first deadline and accomplish the same goal on the backend without giving only certain students extra time to complete the same assignment than others?",
          "author": "Zeas-44",
          "created": 1637408771,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlem2l4": {
      "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hlem2l4/",
      "text": "Go to the dean because having different due dates regardless of what's on the syllabus is unfair, especially if it's just due to last names and the teachers laziness.",
      "author": "Successful-Painter87",
      "created": 1637428801,
      "upvotes": 3,
      "replies": {}
    },
    "hld4ffw": {
      "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hld4ffw/",
      "text": "Nope. You had plenty of notice about the deadline, as it was on the syllabus you got at the beginning of the year. Just out on your adulty pants, stop whining about what is and isnt fair, and ask for an extension.",
      "author": "ManicPixieDreamSloot",
      "created": 1637395621,
      "upvotes": 2,
      "replies": {
        "hld4pd7": {
          "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hld4pd7/",
          "text": "That’s not the issue. I hardly need the extension, the paper will get done either way. But, the discrepancy in due dates makes absolutely no sense. Are you saying that’s fair practice?",
          "author": "Zeas-44",
          "created": 1637395856,
          "upvotes": 4,
          "replies": {
            "hld69tl": {
              "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hld69tl/",
              "text": "Im saying you have know this was the deadline since fhe beginning of semester, and the key to being successful at college is time management. Your professor is a human being who has to read ALL of the papers yall turn in, makes notes, and then assign a final grade - and they have to do so in a certain amount of time so that grades are in by the department deadline. \n\nPlus, I highly doubt your class is the only one being taught. \n\nMoreover, most people suck at writing papers and reading a bunch of what I assume are undergraduate student's last-minute papers is surely a level of purgatory in some cultures...\n\nSo yeah. It is totally fair. Your professor is only one person. If you manage your time wisely and plan to turn it in on time, why are you concerned with whether or not it is fair? It is reasonable, at the very least. Be a human being and stop worrying about things that arent worth your time.\n\nI cant believe you want ro report your professor even though you fully intend to turn the paper in on time. Go play outside",
              "author": "ManicPixieDreamSloot",
              "created": 1637397202,
              "upvotes": -2,
              "replies": {
                "hlejabc": {
                  "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hlejabc/",
                  "text": "I disagree.  This isn't about time management. It's true the first group had time to keep prepare since the syllabus came out, but that means the second group also had time to put prepare plus",
                  "author": "Defrost_ThenStir",
                  "created": 1637427623,
                  "upvotes": 3,
                  "replies": {
                    "hlek8n9": {
                      "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hlek8n9/",
                      "text": "...ok, I guess I can't ignore a call while relpying on reddit, who knew!  \n\nAnyway,  the second group has the and time to prepare, plus one week. Why should one group have an extra week to manage their time? \n\nSecondly, I have never been in a class where the topic of the assignment is given out at the beginning of the semester. It's always been given two weeks before, maybe three for CC classes.",
                      "author": "Defrost_ThenStir",
                      "created": 1637428018,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hldp7lk": {
              "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hldp7lk/",
              "text": "Do you not have time enough to do the paper?  Is it not apparent that they can’t all be graded at once?",
              "author": "PersephoneIsNotHome",
              "created": 1637412783,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "hlexgs5": {
      "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hlexgs5/",
      "text": "I was wondering when this kind of issue would come up. It’s certainly arguable that it’s an equity issue if everyone was able to start at the same time but would be given different due dates simply because of their last names.\n\nThe issue if you do complain is that this may not rise to the level of an issue that can be changed by anyone in administration. You would have to prove that certain folks are at a disadvantage. This is where the other side of the argument comes in - if everyone had weeks to do it but it only takes a few hours to complete (just for sake of argument), then the extra week is irrelevant. Of course, it’s all in how it’s framed or viewed.\n\nIf you do complain, do not go to the dean. You should first consider going to the department chair, but ONLY after you try getting the professor to change the dates (which sounds unlikely, but that’s the proper first step). Never go straight to the dean about an issue like this because it will almost certainly be kicked down to the chair, anyway, and you might end up with a negative mark on your reputation as a result.",
      "author": "PhDapper",
      "created": 1637433556,
      "upvotes": 1,
      "replies": {}
    },
    "hlf71vi": {
      "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hlf71vi/",
      "text": "Yea thats stupid. Why not just make them all due on the same day then he can grade one batch at a time",
      "author": "elkfn2",
      "created": 1637437700,
      "upvotes": 1,
      "replies": {}
    },
    "hld6gkg": {
      "link": "/r/college/comments/qy0ubw/opinion_needed_about_essay_due_date_discrepancy/hld6gkg/",
      "text": "You could report it to the department, but they’re not going to care. As long as they believe group A-M had enough time to complete their essay, they aren’t going to care about a discrepancy in due dates.",
      "author": "TFATFA1",
      "created": 1637397361,
      "upvotes": 0,
      "replies": {}
    }
  }
}