{"sid": "pr83w3", "link": "/r/college/comments/pr83w3/i_need_advice_about_my_situation/", "title:": "I Need Advice About my Situation", "text": "**Context:** I'm from the Pacific Northwest and I chose to go to a big SEC school (2000+ miles away from home). I've been here for 6 weeks now, and I'm having a really hard time. I'm proud of myself for making such a big leap, but I truly feel as if I bit off more than I can chew. These were my reasons for going so far away: \n\n1. it was out of my comfort zone and I was doing something different\n2. I got a good enough scholarship where I could come here for the same price as my in-state school, which was my 2nd choice\n3. my current university has better academic prestige then my in-state school\n\nI am starting to realize that I don't feel like I have a reason to be here other than the fact that it's a better school than the one at home and I am having more independence by being completely alone. Other than that I feel like a made a mistake. I'm an undecided major, so I don't have some special program or academic desire that is binding me to this place. Don't get me wrong, this current university is very cool and there are great things about it, but all of this stress and crazy change has been taking a toll in me mentally (I started meeting with a counselor last week) and at the end of the day I want to be somewhere I can thrive and be happy. I definitely am a homebody, and I'm realizing I don't want to be this far away from home unless I have a really good reason, which I feel I don't have. I want to continue to pursue what's out there and keep putting my best foot forward here, but if I'm feeling the same way by early November I'm thinking I may want to transfer at semester. I could easily transfer to my in-state school that's 2.5 hours away from my hometown and already have some solidified friendships next semester, but there is a part of me that feels guilty for not pushing through the whole year. Any advice and thoughts would be greatly appreciated.", "author": "PrettySelf2257", "created": 1632058729, "retrieved": 1632801460, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"hdj53x7": {"link": "/r/college/comments/pr83w3/i_need_advice_about_my_situation/hdj53x7/", "text": "I think it's great that you pushed yourself out of your comfort zone to find new experiences. However, if you don't think that where you are right now is right for you, I think that you should do what makes you happy, which in this case sounds like transferring closer to home. Don't feel guilty for doing what you need to feel comfortable.", "author": "SilentSwordfish392", "created": 1632097099, "upvotes": 1}}}