{
  "sid": "qqob19",
  "link": "/r/college/comments/qqob19/what_can_i_do_to_pass_time_in_class_on_my_phone/",
  "title:": "What can I do to pass time in class on my phone???",
  "text": "Okay so I’ve been doing online school for 2 years now and It’s been a rollercoaster to say the least. But, we’re back on campus now and I have the WORST social anxiety…it’s so bad that I feel so tense the whole time in class. One of the 3 classes I have to take is called modern architecture and I liked it at first when it was online and then in person I’m not even able to consume any of the information the professor is saying. There are girls at the back of the class who keep giggling and that just makes my anxiety 10 times worse and I’m completely unable to participate because it makes my breathing extremely rapid. idk why im trying to explain anxiety to you but I completely gave up on understanding in this class and just choose to self study it at home. What can I do to pass time in class?? Obviously i can’t watch netflix or something so??",
  "author": "AvocadoExterminator",
  "created": 1636526909,
  "updated": 1636655180,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hk1i6do": {
      "link": "/r/college/comments/qqob19/what_can_i_do_to_pass_time_in_class_on_my_phone/hk1i6do/",
      "text": "Is the attendence mandatory? Honestly I have the same problem with some of my engineering classes. I’m a straight A student but I simply can’t learn maths during a classroom, I just skip and watch youtube videos lol. \n\nYou can do homework for some other classes or something, or play a mobile game.",
      "author": "M33RHARIS",
      "created": 1636528099,
      "upvotes": 3,
      "replies": {
        "hk1nbj0": {
          "link": "/r/college/comments/qqob19/what_can_i_do_to_pass_time_in_class_on_my_phone/hk1nbj0/",
          "text": "Yeah unfortunately it is. i’m gonna sit at the back next lecture and just listen to podcasts while drawing ig also, ty for letting me know im not the only one with this problem 😮‍💨",
          "author": "AvocadoExterminator",
          "created": 1636532166,
          "upvotes": 1,
          "replies": {
            "hk1nllu": {
              "link": "/r/college/comments/qqob19/what_can_i_do_to_pass_time_in_class_on_my_phone/hk1nllu/",
              "text": "[Check out Kitboga, he is a scambaiter and his videos are hilarious, gets me through so much boredom](https://youtu.be/7mceb_t8EIs)",
              "author": "M33RHARIS",
              "created": 1636532396,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk1i9s6": {
      "link": "/r/college/comments/qqob19/what_can_i_do_to_pass_time_in_class_on_my_phone/hk1i9s6/",
      "text": "Drawing and/or writing in a notebook is soothing and less obvious IMO but if you need to use your phone I would recommend something like reading articles, browsing Reddit (lol) or idk other social media if you choose. I browse recipes a lot too!",
      "author": "Weird_Method",
      "created": 1636528173,
      "upvotes": 1,
      "replies": {
        "hk1mson": {
          "link": "/r/college/comments/qqob19/what_can_i_do_to_pass_time_in_class_on_my_phone/hk1mson/",
          "text": "Wow I actually tried coloring on my ipad I have “adult coloring books” and I also tried listening to podcasts, I’m gonna definitely stack interesting e books to read but yeah social media makes me kinda nervous so I avoid it :/ Do you mean food recipes?",
          "author": "AvocadoExterminator",
          "created": 1636531731,
          "upvotes": 2,
          "replies": {
            "hk1rkyy": {
              "link": "/r/college/comments/qqob19/what_can_i_do_to_pass_time_in_class_on_my_phone/hk1rkyy/",
              "text": "Yeah I just like to cook and bake as a hobby so if I can’t do that I like to research new recipes to try and it gives me something to think about",
              "author": "Weird_Method",
              "created": 1636535876,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk3dfdd": {
      "link": "/r/college/comments/qqob19/what_can_i_do_to_pass_time_in_class_on_my_phone/hk3dfdd/",
      "text": "I personally like Duolingo and those word cross games. Also Pinterest :)",
      "author": "801002",
      "created": 1636566080,
      "upvotes": 1,
      "replies": {}
    },
    "hk4ozqg": {
      "link": "/r/college/comments/qqob19/what_can_i_do_to_pass_time_in_class_on_my_phone/hk4ozqg/",
      "text": "draw listen to music text a stranger online",
      "author": "Parking_Cranberry935",
      "created": 1636584698,
      "upvotes": 1,
      "replies": {}
    }
  }
}