{
  "sid": "qf4ooy",
  "link": "/r/college/comments/qf4ooy/group_presentation_is_coming_already_hate_it/",
  "title:": "Group presentation is coming. Already hate it.",
  "text": "Lol, I'm not sure where I should post this, but I think people will relate to this here, so why not. I'm not asking for help or whatever, just venting. I have a group presentation that's coming and I'm already dreading it. In general, I'm a pretty shy person who gets nervous a lot, and one of the things I hate is public speaking. It doesn't matter if it's people I know or am friendly with or complete strangers, I still get nervous. I often try my best to avoid anything involving public speaking, but I can't withdraw from this class because it's required for my major. The last class I had that required us to present in front of people was when I was a freshman in the middle of COVID so we had to do it virtually, and that wasn't too bad because I just pretended they didn't exist, but it's hard to do that for an in-person class. I know I probably should have told my professor, but he doesn't seem like the type to give alternatives, plus it's too late now. Anyways, that's all, I know I have to push through but just thinking about it is making me nervous. I'm introducing the presentation and after that just have to quietly stand to the side, lol. The only thing comforting me is that it's not gonna be the end of the world. Like after, I'm gonna be able to go home and just relax because we finally just got through it. \n\nAlso, excuse my English it's not my native language.",
  "author": "Accurate-Ganache-834",
  "created": 1635120738,
  "updated": 1635184144,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.97,
  "comments": {
    "hhy9pin": {
      "link": "/r/college/comments/qf4ooy/group_presentation_is_coming_already_hate_it/hhy9pin/",
      "text": "hey, if you're doing the introduction, just remind yourself that after you get your part done, you've finished! its a good thing you're doing it first instead of having to wait until the end of the presentation, and maybe try remind yourself that since its a group one, not all the pressure/focus is on you if that makes you sorta nervous. we believe in you! you got this! a part of life is dealing with what makes you the most uncomfortable & overcoming it. you got this. maybe treat urself afterwards too. u deserve it and ur going to do just fine",
      "author": "Dense-Reaction-4542",
      "created": 1635137773,
      "upvotes": 3,
      "replies": {}
    },
    "hhyjnl7": {
      "link": "/r/college/comments/qf4ooy/group_presentation_is_coming_already_hate_it/hhyjnl7/",
      "text": "You write like English is your first language so you good",
      "author": "timidtasmaniandevil",
      "created": 1635145477,
      "upvotes": 1,
      "replies": {}
    }
  }
}