{
  "sid": "q37ss9",
  "link": "/r/college/comments/q37ss9/first_year_and_semester_in_college_five_weeks_in/",
  "title:": "First Year and Semester in College. Five weeks in and I'm not doing so hot in two out of five classes.",
  "text": "I'm new to all this college stuff and feel like I have no idea what I'm doing. I'm and out of state student, and I've never been so far away from home before as I went to college straight out of high school. I'm not doing the best in my computer science 1 class and my Intro to functions class. Does anyone know what I could possibly do to close the gap? Semester ends early December and I don't want to disappoint but I feel so out of my element..",
  "author": "Goldie_1987",
  "created": 1633608973,
  "updated": 1634083627,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfpye37": {
      "link": "/r/college/comments/q37ss9/first_year_and_semester_in_college_five_weeks_in/hfpye37/",
      "text": "Two out of the five is totally okay, you still have time to bring it up, just remember to go to office hours and ask as many questions as you need. Use every resource you have and don’t be afraid to look online either, some teachers record their lessons that make a lot more sense than what your professor said. Breathe, eat, drink some water, and make a plan. That’s the best you can do",
      "author": "21-MadDog",
      "created": 1633609528,
      "upvotes": 3,
      "replies": {}
    },
    "hfq8zrs": {
      "link": "/r/college/comments/q37ss9/first_year_and_semester_in_college_five_weeks_in/hfq8zrs/",
      "text": "Take advantage of the resources you have to get help. Go to office hours to review concepts or test questions you don't understand, check to see whether your university offers any kind of free tutoring, form a study group with classmates, etc.\n\nOn your own, you might try out other ways to learn concepts if the textbook isn't helpful. You might get more from watching YouTube tutorials, for example.",
      "author": "clearwaterrev",
      "created": 1633614925,
      "upvotes": 3,
      "replies": {}
    }
  }
}