{
  "sid": "r1pxu4",
  "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/",
  "title:": "What bachelor degrees pay well?",
  "text": "Pay well as in starting at least at 50 to 60k.\nI'm almost done with my associates in Psychology but lately I've been debating on what I want to do with myself career wise. I will be pursuing a Bachelors next fall but I don't know if I want to continue Psychology or just finish off with a different bachelors and get working because of the cost of college. I've always struggled with this.\n\nI've tried the medical field and I don't like it. I've thought about Marketing and HR.\n\nAny recommendations would be helpful. Thanks",
  "author": "Embarrassed-Fall5575",
  "created": 1637821313,
  "updated": 1638206985,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hm07wbe": {
      "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm07wbe/",
      "text": "if you’re good at math, try an engineering major. many different kinds and most make upwards of 60k entry level",
      "author": "forkillua",
      "created": 1637821889,
      "upvotes": 6,
      "replies": {
        "hm07zh6": {
          "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm07zh6/",
          "text": "I'm decent but I wouldn't consider myself good lol.",
          "author": "Embarrassed-Fall5575",
          "created": 1637821944,
          "upvotes": 2,
          "replies": {
            "hm0c5eg": {
              "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm0c5eg/",
              "text": "I wasn’t very good at math either and I’m studying Materials Engineering technology. It’s a 2 year program but on average we start at 70K/year.",
              "author": "skippy5433",
              "created": 1637824664,
              "upvotes": 3,
              "replies": {}
            },
            "hm095t9": {
              "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm095t9/",
              "text": "decent is definitely good enough for most engineering majors in my opinion, just gotta be willing to work hard for your degree! computer science is also a good major, and it requires less math. just calculus and discrete math if i’m not mistaken. i would look into major requirements at your school and take that into consideration",
              "author": "forkillua",
              "created": 1637822703,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hm1objy": {
      "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm1objy/",
      "text": "Engineering as a whole has the best starting salary. Computer, Electrical, and Chemical have the highest starting salaries I believe. Computer science is also a great option.\n\nBusiness has a lower starting salary (but could probably meet your 50k range), but has the potential for a higher ceiling. Engineers start higher and is a very stable job, but the ceiling is lower. About 6 years from now I'll probably top out my easy career growth unless I go into management. There are still a few more levels beyond that but they are much fewer and further between. Business, if you're willing to put in the time and chase the right job titles and salaries, can be extremely lucrative 10 or 15 years down the road.",
      "author": "Thelton26",
      "created": 1637856172,
      "upvotes": 4,
      "replies": {
        "hm24qxp": {
          "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm24qxp/",
          "text": "I've thought about Business as well but I have idea where to even start when it comes it business. I'll do my research. Thanks!",
          "author": "Embarrassed-Fall5575",
          "created": 1637863130,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hm0eo7t": {
      "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm0eo7t/",
      "text": "Computer science pays very well. Since you don't need a degree to get a job in the field, you could finish up your current degree and teach yourself how to code on your own time and land an entry level job and work your way up.",
      "author": "NoDryHands",
      "created": 1637826417,
      "upvotes": 4,
      "replies": {
        "hm1f4yl": {
          "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm1f4yl/",
          "text": "Best part with CS is that if you land a software engineering job, most of the math stuff you learn is useless anyway.\n\nAnecdotal source: Me, who's been working professionally for years.",
          "author": "Comprehensive-Ad3963",
          "created": 1637851914,
          "upvotes": 1,
          "replies": {
            "hm24uae": {
              "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm24uae/",
              "text": "What do you do in Computer Science? Tell me more about what you do.",
              "author": "Embarrassed-Fall5575",
              "created": 1637863167,
              "upvotes": 1,
              "replies": {
                "hm439d4": {
                  "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm439d4/",
                  "text": "Not OP but I am also a computer science student. Generally, I would say my classes have been divided into programming and math/theoretical. The programming classes are generally learning some kind of theory about computer science, and then apply it using code. This can span many different sub-fields of computer science, including computer vision, artificial intelligence, computer graphics, databases, etc. Then, there are the more mathematical/theoretical classes, which are either run of the mill math classes (calculus, linear algebra, discrete mathematics), or theoretical computer science, which is basically the math behind how computers work. But the math is often more \"logical\" than calculus, if that makes sense, it's more like a brain teaser than doing rote integrals and derivatives.\n\nThere are a lot of online courses that teach computer science. If you're interested, I've heard good things about  Harvard's free course on EDx, complete with assignments and tests. [https://www.edx.org/course/introduction-computer-science-harvardx-cs50x](https://www.edx.org/course/introduction-computer-science-harvardx-cs50x)",
                  "author": "postmaloneismediocre",
                  "created": 1637897123,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hm08evq": {
      "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm08evq/",
      "text": "HR would be a good one IMO…having interacted with so many recruiters and HR people the past 6 month it seems like it’d be in demand, but do your own research first.",
      "author": "NinjaLorian",
      "created": 1637822217,
      "upvotes": 2,
      "replies": {
        "hm24lp7": {
          "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm24lp7/",
          "text": "Do you know if they enjoyed their job or not?",
          "author": "Embarrassed-Fall5575",
          "created": 1637863072,
          "upvotes": 1,
          "replies": {
            "hm2id70": {
              "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hm2id70/",
              "text": "I never asked em...I have a cousin that's been doing recruiting for FB for like 6 months and he hasn't left yet so I assume it's decent at the very least. If you reach out to some on LinkedIn I'm sure they'd be happy to tell you about their job.",
              "author": "NinjaLorian",
              "created": 1637868948,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hma0dyp": {
      "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hma0dyp/",
      "text": "Accounting, anything with technology, marking is good, HR not so much for that price range.",
      "author": "metalheadplanner",
      "created": 1638024060,
      "upvotes": 2,
      "replies": {
        "hmdf5nm": {
          "link": "/r/college/comments/r1pxu4/what_bachelor_degrees_pay_well/hmdf5nm/",
          "text": "Thanks! I've been looking into Accounting.",
          "author": "Embarrassed-Fall5575",
          "created": 1638081409,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}