{
  "sid": "r2ew52",
  "link": "/r/college/comments/r2ew52/new_student_organization_defining_a_board/",
  "title:": "new student organization: defining a board structure",
  "text": "I’ve seen other student clubs/ organizations rename their leadership titles. For example, a club officer position such as “treasurer” can be renamed “director of finance”, which is seen in many business clubs (wanting to model a company structure). \n\nCan you also have “interns” within the student org? Before they become “director of finance”?\n\nAsking because I’m trying to fill in three board positions, and those who applied are either fresh/soph and I was thinking if I could temporarily ask them to work as “interns” for a few weeks before I decide to make them directors, is that possible? Can a student org just make up its own internship positions? Work internally, most likely unpaid?",
  "author": "lil-coco-booty",
  "created": 1637901324,
  "updated": 1638206937,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hm4dzze": {
      "link": "/r/college/comments/r2ew52/new_student_organization_defining_a_board/hm4dzze/",
      "text": "One of my organizations has a few \"in training\" positions for those that are more involved, like treasurer and regional liaison. It's a two year commitment if elected: one year \"in training\" with the current officer and one year as said officer, helping to train the next \"in training.\"\n\nIf you want to model the business world, I'd maybe have an \"Assistant Director\" or \"Junior Director\" title.\n\n> Work internally, most likely unpaid? \n\nI've never seen a student organization with paid officers.",
      "author": "mrbmi513",
      "created": 1637903226,
      "upvotes": 3,
      "replies": {}
    },
    "hm4fpbl": {
      "link": "/r/college/comments/r2ew52/new_student_organization_defining_a_board/hm4fpbl/",
      "text": "You can, but normally these intern positions are applied to so that they work with the current treasurer, do that when they get the board position they are prepared. It doesn't really make sense for them to just hang around as interns if they are going to just technically be the position whole undergoing training, since it will be them alone doing the work. In my org we had students in intern training positions, with a mandatory 1 semester served in order to run for a high board position with a student serving 2 semesters for president or vp.\n\nAlso you should consult with your orgs constitution to make sure it's possible and if not, make amendment to make it so with your board. It just can't be an executive decision.\n\nAlso most student positions are naturally unpaid. I have never seen a paid student org position. I doubt any org outside of elite ivy league schools even pay their board.",
      "author": "safespace999",
      "created": 1637904278,
      "upvotes": 1,
      "replies": {
        "hm6u4cq": {
          "link": "/r/college/comments/r2ew52/new_student_organization_defining_a_board/hm6u4cq/",
          "text": ">*Also you should consult with your orgs constitution to make sure it's possible and if not, make amendment to make it so with your board. It just can't be an executive decision.*\n\nit’s a new org, i’ll be writing one from scratch. \n\nwhat if it's structured like this: director of finance > board associates > interns",
          "author": "lil-coco-booty",
          "created": 1637956243,
          "upvotes": 1,
          "replies": {
            "hm70bx4": {
              "link": "/r/college/comments/r2ew52/new_student_organization_defining_a_board/hm70bx4/",
              "text": "You should be mindful of the size of your board.\n\nLet say you go for the most standard board (ignoring the name changes)\n\nPresident, Vice President, Treasurer, Secretary, Historian, Publicist/Outreach/Media (This one is the many hats role) That is 6 board members. You proposed two levels of further student staff into the board. This could well put you over twenty members on board. This might be good for an organization with 100+ members, but if you are pulling about 30 people it will be hard to coordinate or try and get consensus on decisions or even meeting times, even if not everyone is involved.",
              "author": "safespace999",
              "created": 1637959188,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}