{
  "sid": "qge7rd",
  "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/",
  "title:": "Is it better to drop a course or get a low grade in it?",
  "text": "I'm a second year computer science student at a large state school in the US. I'm doing poorly in one of my classes at the moment and will probably end with a \"C\" at best. When applying for internships/research/grad school would it be better to have a \"W\" signifying I dropped this course or a \"C\" on my transcript? This course is related to (and counts as an elective) but is not required for my major.",
  "author": "djdjeienenekekj",
  "created": 1635276726,
  "updated": 1635302348,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hi5jm3z": {
      "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi5jm3z/",
      "text": "Probably better to try for at least a C. You’ve already invested a lot of time and money into the class.",
      "author": "shedobefunny",
      "created": 1635276834,
      "upvotes": 8,
      "replies": {
        "hi5k9cj": {
          "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi5k9cj/",
          "text": "The way my school works I'm not paying by credit hours so the total cost of my degree shouldn't change. Would that change your recommendation?",
          "author": "djdjeienenekekj",
          "created": 1635277083,
          "upvotes": 5,
          "replies": {
            "hi5phvj": {
              "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi5phvj/",
              "text": "Since its an elective you don't need I would drop it",
              "author": "GoldRequest",
              "created": 1635279082,
              "upvotes": 3,
              "replies": {}
            },
            "hi5piid": {
              "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi5piid/",
              "text": "How much time is left in the course?",
              "author": "shedobefunny",
              "created": 1635279088,
              "upvotes": 1,
              "replies": {
                "hi5rw0m": {
                  "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi5rw0m/",
                  "text": "Just under half a semester",
                  "author": "djdjeienenekekj",
                  "created": 1635279998,
                  "upvotes": 2,
                  "replies": {
                    "hi6jjmx": {
                      "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi6jjmx/",
                      "text": "Okay, then I would stick with it. There’s still lots of time to try to improve your grade.",
                      "author": "shedobefunny",
                      "created": 1635291704,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hi5m3le": {
      "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi5m3le/",
      "text": "Does your school allow you to retake the course if you get a C? If so then you should stick it out and if you decide later on the lower grade is hurting you, then you can just retake. \n\nIf not, consider how important this class is for your future goals. The vast majority of classes won't be so important that taking a W instead of a C is worth it. However, there can be some exceptions. I know that in my area (statistics) a C in real analysis can put you out of the running completely for PhD admission at most places. So in that specific sort of situation, I'd recommend withdrawing and then trying again and shooting for an A. This is kind of an uncommon situation though, so chances are you should probably stick it out.",
      "author": "HumanDrinkingTea",
      "created": 1635277787,
      "upvotes": 3,
      "replies": {
        "hi5scu0": {
          "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi5scu0/",
          "text": "So do you think a W generally looks a lot worse than a C?",
          "author": "djdjeienenekekj",
          "created": 1635280178,
          "upvotes": 2,
          "replies": {
            "hi5twvf": {
              "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi5twvf/",
              "text": "In general, no, not at all. But you would have to take it again, and when that happens you may 1) end up getting a C again, and a C and a W look worse than just a C, or 2) find that you're really busy and the time spent on that class hurts your grades in other classes or your performance somewhere else in life. \n\nIn *most* cases, one C is hardly a blip on the radar when it comes to future opportunities, so the pain of taking a class again is usually not worth it. If you find you need the break this semester, then I think the W is the better option, but withdrawing because you're worried about the impact of the lower grade is most likely misguided.\n\nAs far as W's in general are concerned, it also is hardly a blip on the radar. People won't care, at all, really. The W grade is definitely way better than a D or F, and probably looks better than a C if you're typically an A student and probably looks worse than a C if you're typically a C student, but overall it's a fairly \"neutral\" look since all it means is that you didn't finish a class, which happens for loads of reasons unrelated to grades (like maybe you got sick or got a part-time job mid-semester and had to adjust your schedule or some other shit happened) so in reality people aren't too judgmental.",
              "author": "HumanDrinkingTea",
              "created": 1635280780,
              "upvotes": 3,
              "replies": {
                "hi5u4lh": {
                  "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi5u4lh/",
                  "text": "Ok thanks for the advice, I'll take it into consideration.",
                  "author": "djdjeienenekekj",
                  "created": 1635280864,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi5z9m7": {
      "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi5z9m7/",
      "text": "Strange people telling you to stick it out. I've never heard of any school seeing a few w's as a problem for graduate admissions. However, the GPA hit you'll take with a \"C\" can be substantial and could make the difference.\n\nI totally dropped a few classes to keep my GPA high. I retook those classes later and got A's in them. Sometimes life happens. Sometimes you're not ready for a course, but you will be later. Sometimes you bite off more than you can chew.\n\nWhat kind of school is yours? What types of graduate schools are you aiming for? What do you want to study there?",
      "author": "heuristic_al",
      "created": 1635282873,
      "upvotes": 3,
      "replies": {
        "hi61rsz": {
          "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi61rsz/",
          "text": "I go to Ohio State, a large and decently well ranked public school. I'm also a double major in physics which is what I'd be going to grad school for, ideally at a T20 school.",
          "author": "djdjeienenekekj",
          "created": 1635283896,
          "upvotes": 1,
          "replies": {
            "hi63vw2": {
              "link": "/r/college/comments/qge7rd/is_it_better_to_drop_a_course_or_get_a_low_grade/hi63vw2/",
              "text": "It's been a while since I've had to make these choices, and I went to grad school in CS, but in that situation, a W that gets replaced by an A (or probably even a B) is better.\n\nYou should continue to go to the class if the teacher will let you and you aren't overly stressed. Then you should be well set up to get an A in it when you retake it. Taking the W now is only worth it if you will get a better grade when you retake it. Otherwise I think  some schools count it as an F.\n\nWhat is your background? The GRE is important and so are your letters. If you are a native english speaker, and you study hard for the GRE, you are likely to do well.",
              "author": "heuristic_al",
              "created": 1635284773,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}