{
  "sid": "qz8jqx",
  "link": "/r/college/comments/qz8jqx/why_do_some_students_still_take_college_courses/",
  "title:": "Why do some students still take college courses when they are going to die soon (i.e. from a terminal disease?)",
  "text": "Do they believe that they will need that Earthly knowledge in their afterlife?\n\nWouldn't there be a chance that their afterlife would make them omniscient because some divine power would download the sum of all knowledge into them instantaneously? Therefore, they would not have needed college courses the entire time?",
  "author": "IDislikeHomonyms",
  "created": 1637540901,
  "updated": 1637689178,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.15,
  "comments": {
    "hlkxp9w": {
      "link": "/r/college/comments/qz8jqx/why_do_some_students_still_take_college_courses/hlkxp9w/",
      "text": "Maybe it’s something for them to do to stop thinking about the fact that they are dying.",
      "author": "ld2009_39",
      "created": 1637542524,
      "upvotes": 21,
      "replies": {}
    },
    "hlkynxs": {
      "link": "/r/college/comments/qz8jqx/why_do_some_students_still_take_college_courses/hlkynxs/",
      "text": "it depends on the person. Some want to feel like a “normal” kid their age, others want something to keep their mind off of being sick, some may just want the achievement before they pass away as they won’t get to see other life milestones (buying a house, getting married, having kids, etc).",
      "author": "rynpickles",
      "created": 1637542987,
      "upvotes": 11,
      "replies": {}
    },
    "hlkyt8v": {
      "link": "/r/college/comments/qz8jqx/why_do_some_students_still_take_college_courses/hlkyt8v/",
      "text": "People just want to do things for themselves, regardless of dying or not. Heck if you really think about it everything is meaningless because eventually you and everyone you know and love will die. Generations will pass and eventually most are entirely forgotten, blipped out forever despite living a full life. People with terminal disease are just living on a faster timeline to oblivion.\n\nAlso wouldn't bet on the last thing happening. No one has any concrete idea of what happens when you die so thinking you'll be endowed with infinite knowledge is wishful thinking. Just do what you like to do now no matter what time you have left.",
      "author": "safespace999",
      "created": 1637543058,
      "upvotes": 8,
      "replies": {}
    },
    "hll04go": {
      "link": "/r/college/comments/qz8jqx/why_do_some_students_still_take_college_courses/hll04go/",
      "text": "Maybe they have a life goal of getting a degree? After my car accident where I nearly died I got back in my classes and got my masters just a few months after. Only missed one term. I had major change from full movement to using a walker and I still valued my education.",
      "author": "beanie1816",
      "created": 1637543685,
      "upvotes": 5,
      "replies": {}
    },
    "hll50z0": {
      "link": "/r/college/comments/qz8jqx/why_do_some_students_still_take_college_courses/hll50z0/",
      "text": "There are some people who actually like learning.",
      "author": "Dunyazad",
      "created": 1637545979,
      "upvotes": 4,
      "replies": {}
    }
  }
}