{
  "sid": "pxdh3c",
  "link": "/r/college/comments/pxdh3c/do_you_actually_need_to_read_the_textbooks_how_do/",
  "title:": "Do you actually need to read the textbooks? How do you make the time for it?",
  "text": "I can barely manage taking notes from all my classes on top of assignments and other work, so I haven’t found the time to read the textbooks for classes where the prof doesn’t explicitly direct us to.  \n\nMy classmates seem to know a lot more about the topics covered in lectures, and have mentioned learning it from the textbook.  Is that expected in college, or are they just high-achievers?  Will I end up screwing myself over by being lazy and prioritizing sleep instead of ensuring I consume the material from every one of my classes?",
  "author": "vruv",
  "created": 1632856250,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "her32te": {
      "link": "/r/college/comments/pxdh3c/do_you_actually_need_to_read_the_textbooks_how_do/her32te/",
      "text": "No, I skim what I need to do the work.",
      "author": "nashamagirl99",
      "created": 1632939363,
      "upvotes": 1,
      "replies": {}
    },
    "heov5qz": {
      "link": "/r/college/comments/pxdh3c/do_you_actually_need_to_read_the_textbooks_how_do/heov5qz/",
      "text": "Same! It's hard! Idk how to want to do it. For me the thing I hate the most is the actual textbook so what I think would be helpful is maybe get it on PDF and put it on your iPad and maybe that'll be easier for you to read it",
      "author": "TragicalKingdom",
      "created": 1632893722,
      "upvotes": 2,
      "replies": {}
    },
    "heofv9r": {
      "link": "/r/college/comments/pxdh3c/do_you_actually_need_to_read_the_textbooks_how_do/heofv9r/",
      "text": "\"My classmates seem to know a lot more about the topics covered in lectures, and have mentioned learning it from the textbook. Is that expected in college...\"\n\nI truly hope this is intended to be a joke post.  If it isn't, I advise giving some thought as to whether academics are your forte.",
      "author": "taxref",
      "created": 1632884581,
      "upvotes": 3,
      "replies": {}
    },
    "henmzcs": {
      "link": "/r/college/comments/pxdh3c/do_you_actually_need_to_read_the_textbooks_how_do/henmzcs/",
      "text": "I always read the book and take notes before class so I can actually pay attention and make connections between concepts. If I don’t, I go into class feeling lost and I struggle to catch up.",
      "author": "FreezingDemon",
      "created": 1632870925,
      "upvotes": 1,
      "replies": {}
    },
    "henjkj5": {
      "link": "/r/college/comments/pxdh3c/do_you_actually_need_to_read_the_textbooks_how_do/henjkj5/",
      "text": "Definitely depends on the class and on year. There were a lot of 100 level classes where skimmimg and power points worked well for me. Not so much in 300-400 level classes.",
      "author": "Defrost_ThenStir",
      "created": 1632869338,
      "upvotes": 1,
      "replies": {}
    },
    "hen0ewh": {
      "link": "/r/college/comments/pxdh3c/do_you_actually_need_to_read_the_textbooks_how_do/hen0ewh/",
      "text": "I use my lecture notes and supplement them only with additional information the reading offers. \n\nI also skim and only try to look for the main ideas.",
      "author": "kizeltine",
      "created": 1632860924,
      "upvotes": 2,
      "replies": {}
    },
    "hemy17x": {
      "link": "/r/college/comments/pxdh3c/do_you_actually_need_to_read_the_textbooks_how_do/hemy17x/",
      "text": "I highly recommend tailoring this based on what you need personally.\n\nIf you're struggling to understand some concepts in a class or find that you aren't following along with the professor's lecture materials, then take some time to read the textbook. Sleep is definitely important, but sleeping won't get important concepts in your head: reading the material will. Obviously make sure you balance this, but don't prioritize 9+ hours of sleep over understanding your class. If you find that you're pretty up in the class, understanding things the first or second time they're explained, or if you're already familiar with the course material from a previous class, then don't worry as much about reading the textbook.\n\nOf course, all of this is entirely dependent on your professor and how they use the textbook. One class I had used the textbook as required reading, making a chapter a week and having graded quizzes on the material within, and including said material in exams. The professor barely included the material from the book in their lectures, so if you didn't read, you would not pass the class. On the other hand, another class I had was easy because the professor lectured nearly word-for-word through every chapter in the textbook. I ended up taking less notes in the class and simply reading the textbook at home (I preferred it that way) and I aced the class.\n\nAs for making time to read the textbook, I don't really have enough context about your life to give you specific suggestions, just some general ones like using some method like time-blocking for your time management or taking less time for something that's less important to you than school and using that time for reading textbooks.",
      "author": "ambitious-cactus",
      "created": 1632859836,
      "upvotes": 4,
      "replies": {}
    },
    "hemtosf": {
      "link": "/r/college/comments/pxdh3c/do_you_actually_need_to_read_the_textbooks_how_do/hemtosf/",
      "text": "Depends on the class and the professor",
      "author": "malarkeyasian",
      "created": 1632857898,
      "upvotes": 2,
      "replies": {}
    },
    "hemsgvd": {
      "link": "/r/college/comments/pxdh3c/do_you_actually_need_to_read_the_textbooks_how_do/hemsgvd/",
      "text": "You’re asking if people are expected to read the textbook in college?? Of course you are. You might be able to pass some classes without ever opening the book, but that won’t be the case for every class",
      "author": "PasswordLogger",
      "created": 1632857402,
      "upvotes": 6,
      "replies": {}
    }
  },
  "updated": 1634054975
}