{"sid": "le0ubz", "link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/", "title:": "Is your college giving out high-quality masks?", "text": "**Roughly, cloth masks let in ten times more viral particles than KN95/KF94 masks.**\n\nCloth masks are roughly 50% effective at blocking viral-sized particles, but high-effectiveness masks (e.g.: KN95, KF94) will block more than 95% of such particles. 50% of particles get through cloth masks, and <5% through KN95/KF94.\n\nAn FDA-approved mask of either type costs at most $1.3 in bulk, and can likely be worn for at least two days. With \\~110 days in a semester, this makes for \\~$72 per student— or **less than the cost of a single covid test.**\n\n&#x200B;\n\n**Is your college distributing high-quality masks?** (*Mine isn't. Currently trying to convince them to give quality masks, at the very least, for covid-testing volunteers and low-income students.*)\n\n&#x200B;\n\n[\"Why Aren't We Wearing Better Masks?\"](https://www.theatlantic.com/health/archive/2021/01/why-arent-we-wearing-better-masks/617656/)\n\n&#x200B;\n\nLet me know if you're trying to get your college to do the same.\n\n&#x200B;\n\n&#x200B;\n\nLet me know if you have any ideas to steelman this idea.\n\n&#x200B;\n\n&#x200B;\n\nNotes:\n\n# KN95s, not N95s\n\n* And there doesn't seem to be a shortage—KN95s for example are abundantly available on amazon for cheap, and elsewhere in bulk.\n\n&#x200B;\n\n* Just because college students don't tend to die from covid doesn't mean that the virus doesn't do considerable harm. I have an active friend that thought he dodged covid, and then found himself extremely fatigued a week later. [And he's not alone](https://www.vox.com/22166236/long-term-side-effects-covid-19-symptoms-heart-fatigue)— there are young athletes getting heart damage from this. I don't know if he's gotten better yet. For example:\n\n>  One study of mildly ill patients in China found that [**70 percent**](https://pubmed.ncbi.nlm.nih.gov/32838236/) had abnormal lung scans three months after their initial illness.", "author": "ChrisLakin", "created": 1612628575, "retrieved": 1632802706, "over_18": false, "upvotes": 670, "upvote_ratio": 0.94, "comments": {"gmgxasd": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmgxasd/", "text": "The masks being distributed are to prevent viral particles from going out, not in.\n\nProtective masks (and in fact all PPE) are designed for different purposes - sometimes to protect the wearer and sometimes to protect other people from the wearer.\n\nN95 masks work properly when you also have a seal -  the gap between your face and the mask is the biggest problem.  \n\nMost people will not actually wear a mask that makes a seal for any length of time because they hurt your face, have to be a reasonable fit, and can’t be taken on and off and still be effective.\n\nIf you want to hang a more expensive fiber off your ears and have it not actually be doing anything, you can get one yourself .\n\nGetting all people to wear masks to prevent the outflux of viral particles is doable if you have a reasonable cloth or surgical mask.\n\nAlso, you are an adult.  If you want a different mask, get one.  Do you expect your college to provide you condoms ?\n\nNot everything is some giant conspiracy.  Some things are personal responsibility.", "author": "PersephoneIsNotHome", "created": 1612716691, "upvotes": 1}, "gmeg7e5": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmeg7e5/", "text": "College students are the least likely to die from it and masks don't do shit anyway. High-quality, low-quality, it doesn't matter. If masks were the real solution, you'd be issued them by the government and they'd be disposed as hazmat after use. So my advice, just find something comfortable, or with a cool design, follow the rules, and move on with you life.", "author": "CaptainStunfisk1", "created": 1612694524, "upvotes": 1}, "gmduvoi": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmduvoi/", "text": "IU (Or my campus IUSB) gave out free masks with their logo on it", "author": "FCHusky", "created": 1612689880, "upvotes": 1}, "gmdtyip": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmdtyip/", "text": "UC Davis is giving out free masks (with their logo) and N95 replaceable filters to their students", "author": "CageTheMoney", "created": 1612689684, "upvotes": 1}, "gmd51tr": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmd51tr/", "text": "My college gave out cloth and shitty leather ones last semester and doesn't give out any for free anymore.  They sell cloth ones now for like $10 a pop and they never fit right.", "author": "SatanicSlugrifice", "created": 1612684184, "upvotes": 1}, "gmccctb": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmccctb/", "text": "99.9% survival rate for college aged students", "author": null, "created": 1612673564, "upvotes": 1}, "gmc9r4o": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmc9r4o/", "text": "My dorm gave out 2 one ply white cotton masks to each student.  My on campus job gave me a mask that felt like carpet. My chorus professor gave me 3 KN95s for our MWF in person rehearsals.", "author": "jempai", "created": 1612672736, "upvotes": 1}, "gmc9cgp": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmc9cgp/", "text": "lmaooo they just charged us a higher tuition and closed for the year", "author": "iamfearformylife", "created": 1612672606, "upvotes": 1}, "gmc6vhm": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmc6vhm/", "text": "The thing with disposable masks is they're gonna cause a TON of waste. Properly using any disposable mask is going to make them, at most, a one-day mask.\n\nI leave my dorm EVERY DAY because I have a DAILY meal plan. I can't bulk shop because my plan gives me 2 daily meals/$8 each in specified food (milk, certain frozen meals, etc). Yeah, i can stretch my 2 credits into about 1.5-2 days of food, but I'd be wasting my own money by skipping days of meal credits. There was no option for a non-daily plan.\n\nThat's, minimum, 7 masks a week. I'm in school for approximately 33 weeks. That's MINIMUM 231 KN95s into the garbage for a 5 minute trip where I don't get within 6 feet of more than maybe 2 people, and only for at most 2 minutes. That doesn't include masks that get wet or dirty before the end of the day, or if I toss my mask then realize I have to run to the library to print something, or if I drop my mask on the floor by accident.\n\nCloth masks just get tossed in with my laundry every week. There's virtually no waste until they wear out. The concern with cloth vs KN95 is that KN95 stops 95% of particles at a certain size vs cloth stopping, your number, 50%, but covid isn't generally spread by those tiny particles. Someone please correct me if I'm wrong, but it's spread via respiratory droplets. Think of when someone sneezes and you see all those specs fly out of their nose and mouth. You can see those. You can't see viruses. A cloth mask stops a significant amount of those droplets, enough to make the mask well enough effective.\n\nEven if my school offered free disposables, I still wouldn't use them. There's no point in generating that much waste when a reusable option exists for only a slight decrease in effectiveness. My school gave us 3 layer cloth masks with a soft inner layer and a tightly woven thick outer layer. Those KN95s can go to someone who really needs them, like nurses in the ICU with aerosolized covid from the ventilators that ARE at that tiny, non-visible size that KN95s are meant for.", "author": "therealmegluvsu", "created": 1612671749, "upvotes": 2}, "gmc3ipz": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmc3ipz/", "text": "My college lets each student get one free mask (it’s one of those masks that require filters, but they don’t hand out filters with said masks). Then try to sell masks for $15 each and bundles of $32", "author": "Damn-it-Nel", "created": 1612670571, "upvotes": 1}, "gmc3gsk": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmc3gsk/", "text": "Ya my college gave us ones with under table filters and they’re actually good", "author": "ekaplun", "created": 1612670553, "upvotes": 1}, "gmc266l": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmc266l/", "text": "Our college gave us one super thin cloth mask and a small container of hand sanitizer before deciding to not enforce mask requirements for students and faculty. I've seen students walk around with the mask under their chin.", "author": "depressed_jewel", "created": 1612670128, "upvotes": 1}, "gmc1w8v": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmc1w8v/", "text": "Hah. My college don't even give out masks, they're not supposed to since everyone has to bring they're own. Other than that we have sanitary wipes (lysol) and hand sanitizer.", "author": "Design4real-777", "created": 1612670037, "upvotes": 1}, "gmbzwzw": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmbzwzw/", "text": "My school gave us masks that are basically t shirt material with cardboard in them. They’re impossible to breathe in.", "author": "insomniacaesthetic", "created": 1612669354, "upvotes": 1}, "gmbpjaw": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmbpjaw/", "text": "My campus is mostly virtual aside from residents and certain courses that need to be in person like labs. They’ll charge you $20 for a cloth mask with their logo though.", "author": null, "created": 1612665567, "upvotes": 1}, "gmbhbed": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmbhbed/", "text": "I mean while the science is sound I have always only worth cloth masks during the pandemic and have not caught it.( I have to get tested every ten days) and I am constantly around people for my job", "author": "nemo1261", "created": 1612662990, "upvotes": 2}, "gmbf4oy": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmbf4oy/", "text": "nah they provide those paper ones but it is better than nothing.", "author": "gracefulspork", "created": 1612662360, "upvotes": 1}, "gmbdmx7": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmbdmx7/", "text": "Ew, we get two layers of fabric, the outer having our student government organization and school logo, and the inner getting sucked into our lips. Love that cotton taste!", "author": "lirbe", "created": 1612661929, "upvotes": 1}, "gmbdlch": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmbdlch/", "text": "Hello! N95 masks are designed for healthcare workers, and provide the level of protection needed in a high risk environment. [two-layer cloth masks](https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/about-face-coverings.html) masks get the job done for the rest of us", "author": "Sociosmith", "created": 1612661916, "upvotes": 2}, "gmb8f2b": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmb8f2b/", "text": "My college actually is providing really high quality masks. My college masks are the only ones I like using because they’re so good", "author": "Boomdigity102", "created": 1612660442, "upvotes": 1}, "gmb5zar": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmb5zar/", "text": "Mine isn’t giving out masks at all", "author": "Sean737", "created": 1612659742, "upvotes": 1}, "gmb3n2w": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmb3n2w/", "text": "We got masks that fit no one, is made out of synthetic material, and falls apart after 3 washes 🤷‍♀️", "author": "Ashamed_Equal", "created": 1612659051, "upvotes": 1}, "gmay48i": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmay48i/", "text": "My college provides two free cloth masks and free weekly PCR covid tests.", "author": "aimivan", "created": 1612657419, "upvotes": 1}, "gmavm7j": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmavm7j/", "text": "I am in Rutgers Business School and they offered seniors who are off campus (no RBS classes are in person so roughly everyone except those who came due to dire need situations) the opportunity to enter a raffle to receive a box filled with snacks and a mask. It is a cloth mask with a very nice fit but still. A University with about 45k undergrad maybe 50 business students who are seniors at home got cloth masks we can put our own filter into. I definitely like it I will definitely take graduation pictures in it, but as someone who makes masks and has a double-masked cloth over surgical or cloth over n95, it wasn't the best quality. Also, just the circumstance is quite laughable.\n\nDid also get combos in the box though so my dad gives them a 10/10 😂", "author": "hayl2121", "created": 1612656679, "upvotes": 2}, "gmask2e": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmask2e/", "text": "My college isn't even giving out high-quality education. 🤣", "author": "flawedgawd", "created": 1612655764, "upvotes": 12}, "gmao335": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmao335/", "text": "damn only thing my college is giving out is covid", "author": "wishkh", "created": 1612653979, "upvotes": 15}, "gmalnum": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmalnum/", "text": "Masks? They are making us return in a few days without any protective gear and are not providing the option of remaining online. They also took away our spring break so I would have dropped out if this wasn't my last semester 😔", "author": "Profess0rV1", "created": 1612653003, "upvotes": 1}, "gmallay": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmallay/", "text": "My school gave us all 2 very thin cloth masks, hand sanitizer, disinfecting wipes, and a thermometer. I could’ve forgone the other things for 2 higher quality masks.", "author": "knj94", "created": 1612652983, "upvotes": 1}, "gmal5n6": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmal5n6/", "text": "They have them available everywhere. They’re super strict on covid so they want to make sure everyone has access to everything they need. Non-cloth masks, hand sanitizer, wipes in every classroom/public space, we have mandatory testing every 3 weeks, etc.", "author": "yddadrovalf", "created": 1612652864, "upvotes": 1}, "gmajgrt": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gmajgrt/", "text": "It’s not about keeping stuff from getting in, the point of wearing one is to keep your breath to yourself. Chefs, surgeons, pharmacists in labs, anyone in an environment that must be sterile wears a mask. It’s not cause stuff is getting in, it’s so your filthy body doesn’t contaminate the sterile environment.", "author": "Glume-", "created": 1612652405, "upvotes": 1}, "gma37j6": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gma37j6/", "text": "My community college actually offers us the option of a KN95/standard medical mask everyday. Also has plenty of hand sanitizer and sanitation wipes laying around", "author": "toofeduptocare", "created": 1612647621, "upvotes": 1}, "gma1re6": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gma1re6/", "text": "Okay I go to uni on Scotland but we give cloth masks which I think is fair enough. Firstly the N95 masks are mainly for health care professionals. Secondly masks are mainly to stop you spreading Covid not to stop you from catching it. It's about the community not so much you as an individual. I think Americans have a bit of a different mentality towards this.", "author": "PlayfulAccident", "created": 1612647235, "upvotes": 1}, "gma185i": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gma185i/", "text": "We got free cloth masks from each of our RA’s.", "author": "NitroNate711", "created": 1612647089, "upvotes": 1}, "gma08ox": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gma08ox/", "text": "We're getting 2 free reusable cloth masks at the start of the semester, that's it. Thankfully I'm not an on campus student.", "author": "NoDryHands", "created": 1612646829, "upvotes": 1}, "gm9yjo0": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9yjo0/", "text": "It amazes me the range of precautions different colleges are taking. I go to a bougie New England SLAC. The school provided us all cloth masks, which doesn't bother me because of the volume of other precautions the school is taking. We stay in a hotel until we receive two negative COVID tests (three, if you're an international student). Then we're tested twice a week for the rest of the semester. We're not allowed to leave campus (except to walk into the adjoining town), we're not allowed to have guests on campus, and many interior common spaces are closed.  Campus is at 1/2 capacity, only a few classes are in person, and everyone lives on campus in singles. You can only eat in your room or outside with members of your \"block\" aka the 5 people you live next to. And use of some common spaces (kitchens, for example) requires \"supervision.\" They've kept covid cases near-0, which is great, but it has some of the strictest/most paternalistic rules of any campus I know about. But I agreed to live on campus this spring, so there's nothing much to do about it, and I'm glad I don't go to a school full of frat bros partying without masks.", "author": "bakeseal", "created": 1612646374, "upvotes": 18}, "gm9wyj4": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9wyj4/", "text": "My school, Tufts Univ., gives out at least 100 surgical masks at the start of each semester. Whenever you need more you can ask reslife and they’ll give you a pack of 50 more. and this is all for free. It surprises me how varying schools responses are when it comes to providing basic protection against COVID.", "author": "xMoj13", "created": 1612645959, "upvotes": 17}, "gm9uok6": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9uok6/", "text": "Y'all people are getting masks from your universities?", "author": "PazzoDiPizza44", "created": 1612645318, "upvotes": 6}, "gm9s4jo": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9s4jo/", "text": "UVM is providing pretty decent masks. They gave us 3-4 cloth masks when we showed up for our weekly test.", "author": "UnpavedWalrus", "created": 1612644535, "upvotes": 1}, "gm9ohpn": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9ohpn/", "text": "Most of my classes are in person and profs aren’t required to wear masks if “six feet can be maintained”, though mine do. I also see plenty of people wearing their masks improperly. We weren’t given masks by the school, there is no testing center at my school, and there are plenty of in person activities like sports, performances, etc where masks are “required” but not enforced. \n\n\nI stay away from campus as much as possible and I bought my own KN95’s on Amazon.", "author": "elleem7", "created": 1612643182, "upvotes": 10}, "gm9lpax": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9lpax/", "text": "No our school gives us virtually nothing, we’ve been off campus for most of this school year anyways so maybe they don’t see the point.", "author": "ellie15712", "created": 1612642298, "upvotes": 1}, "gm9ldg0": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9ldg0/", "text": "No, but they are selling basic cloth masks with their logo on them at like 40 bucks for a 2 pack... I dont feel like paying that much to be a walking advertisement tho, so I just get them elsewhere", "author": "GreamBeam", "created": 1612642189, "upvotes": 1}, "gm9hl0y": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9hl0y/", "text": "My college is still closed :-(", "author": "3lThunas", "created": 1612640805, "upvotes": 2}, "gm9hbjf": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9hbjf/", "text": "They gave us super thick cloth masks that make it feel like there are ten shirts over your face, a bar of soap, a bottle of hand sanitizer, and a map to the building where you can get tested for free as often as you would like. They also have extra bags all over the main buildings so you can pick up some any time you would like", "author": "SnapdragonPBlack", "created": 1612640711, "upvotes": 5}, "gm9fss3": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9fss3/", "text": "We got one cloth mask, an oral thermometer, and a bottle of hand sanitizer at the beginning of the fall semester. Oh and IIRC only commuter students got that stuff, on campus kids be damned I guess. \n\nAnyways though I’m sure my college has more effective masks but they are probably for sale in the book store and cost an arm and a leg", "author": "Ms_Digglesworth", "created": 1612640124, "upvotes": 1}, "gm9eexz": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9eexz/", "text": "I don't think my campus is giving out masks, not that I would use it unless I'm actually in a lecture.  They have tons of hand sanitizer everywhere and free refills/replacements for used ones.  Also required testing of you go to campus regularly.  It's honestly total overkill since almost no one gets sick on campus.  They should actually be trying to do something about the huge parties where idiots really do get sick, but I get that it's hard to do something about off-campus idiocy.", "author": "CaptainNemoid1", "created": 1612639584, "upvotes": 0}, "gm9e41n": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9e41n/", "text": "My university gave us 2 masks at the beginning of last semester, but I kid you not the mask is the size of my entire face, from chin to hairline, so they may as well have not given us any.", "author": "Your_Name_Here1234", "created": 1612639463, "upvotes": 14}, "gm9d808": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9d808/", "text": "Lol", "author": "TiPtoeThroughTulips", "created": 1612639091, "upvotes": 3}, "gm9cwyi": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9cwyi/", "text": "Only got a mask after returning to work on campus. They were supposed to mail them to all students with the logo on it. Instead, only abou one living or working on-campus during the pandemic got a cloth mask with 2 layers of t-shirt-like fabric in the wrong school color without any logo. It’s so thin it does nothing. Only wear it over my KN95s occasionally.", "author": "creativ_nickname", "created": 1612638962, "upvotes": 2}, "gm9cb1d": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9cb1d/", "text": "We had been giving out free cloth masks at the beginning of the Fall semester. Now since it's been a whole semester, I *think* we have stopped doing that since everyone has gotten some and figured out what works for them. I'm not positive though -- they are probably something students can get if they are in poverty, they just aren't given out in the thousands on-campus anymore.\n\nHonestly, some of the N95 masks are much more constrictive than the cloth ones or blue ones that have 3-ply construction. I think that a lot less students would have used the ones provided by the university if they were N95, they would have bought ones that were easier to wear for the full day.\n\nMost of our students don't even use the university ones anymore. They have just bought a pack on Amazon, at Walmart, Old Navy, etc. If you go for value you can a pack of 3-5 cloth ones for under $10 which is approachable for virtually all students. It's been a whole year so at this point it's almost the same thing as being responsible for buying your own clothing.", "author": "br1039", "created": 1612638704, "upvotes": 3}, "gm9bpm4": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9bpm4/", "text": "I thought KN95 were not approved by the FDA?", "author": null, "created": 1612638446, "upvotes": 2}, "gm9afx1": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm9afx1/", "text": "We got one cloth mask. Which I never even bothered to pick up because I prefer a neck garter + KN95 mask combo when I'm on campus. \n\nThey gave hand sanitizer too and I am **very** glad I didn't pick that shit up. Based upon the sanitizers they stock in the little dispensers, it would suck ass. Like, how hard is it to get a hand sanitizer that **doesn't** feel like jizz or lube?", "author": "EgyptianDevil78", "created": 1612637879, "upvotes": 4}, "gm980v0": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm980v0/", "text": "My clg said,fuck off get your own mask", "author": "DefinitelyMortis", "created": 1612636817, "upvotes": 5}, "gm96h32": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm96h32/", "text": "We got 5 reusable (cloth) masks with space to insert filters.\n\nI actually think it's smarter to give out cloth masks. KN95s aren't really reusable, not if you're using it properly. I think the danger in reuse is that it could be contaminated with the virus which would increase your risk the longer you wear it, hence why you're supposed to wash reusable ones after each use.\n\nPlus, I don't want to take away resources from people who need them. We still have shortages of PPE, that's why KN95s aren't available in stores and that's why the university doesn't distribute them. I go to an **exceptionally** wealthy university. Why the hell should a bunch of rich, privileged 20-somethings have free access to KN95s when there are working class folks in care homes who are going without? We're already privileged enough to be given *free* cloth masks and provided with *free* weekly asymptomatic tests.", "author": "officially_anxious", "created": 1612636138, "upvotes": 98}, "gm93kqq": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm93kqq/", "text": "I have an in person lab class that is required for my degree. \n\nThe professor is handing out n95's this week. I am very happy.", "author": "matttech88", "created": 1612634865, "upvotes": 8}, "gm92p4y": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm92p4y/", "text": "You can't just give people respirators.  The point of a type 1 mask is to prevent you from spreading your own germs, they do little to protect you.  The general public should not be wearing n95s\n\nIf everyone does what they're told, social distancing and everyone wearing masks correctly is sufficient.\n\nYou have to be fit tested in order for respirators to work.  I've tried several n95s before I landed one that fit my face, with an hour of testing.  If you aren't fit tested, there is a good chance the n95 is as useful as a type 1 mask, maybe even more dangerous because people assume they can't get it from wearing it.\n\nYou also need to know the correct doffing and donning procedure, don't touch the inside of the mask, wear the mask properly, can't just take it off for a drink when you feel like it, etc", "author": "redditbrock", "created": 1612634463, "upvotes": 16}, "gm924jj": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm924jj/", "text": "You guys are getting ~~paid~~ masks?", "author": "importUsernameAsUser", "created": 1612634208, "upvotes": 461}, "gm91y9n": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm91y9n/", "text": "My college is providing nothing but hand sanitizer everywhere", "author": "knopflerpettydylan", "created": 1612634129, "upvotes": 196}, "gm90wn1": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm90wn1/", "text": "We have KN95s in vending machines around campus and they gave everyone two disposable medical I’m guessing level 1 masks", "author": "ilikecacti2", "created": 1612633595, "upvotes": 4}, "gm8zvz2": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm8zvz2/", "text": "My college is charging $25+ for basic cloth masks that I can get for cheaper at my local retail stores", "author": "WittyImprovement", "created": 1612633080, "upvotes": 284}, "gm8xrso": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm8xrso/", "text": "My university gives you two n95s upon the start of a semester", "author": "laswat220", "created": 1612632017, "upvotes": 21}, "gm8x4dc": {"link": "/r/college/comments/le0ubz/is_your_college_giving_out_highquality_masks/gm8x4dc/", "text": "Only high level of covid 19 for now", "author": "Emergency_Break6922", "created": 1612631692, "upvotes": 41}}}