{
  "sid": "q9jlb7",
  "link": "/r/college/comments/q9jlb7/reason_help/",
  "title:": "Reason help",
  "text": "I applied to this college months ago and paid for the non refundable fee confirmation (not the tuition, it’s just you confirming you’re enrolling there) anyhoo, months has passed I realized I don’t want the course I got to and they don’t do change of majors (which sucks) and my mother is a single parent so i wanted to help her by getting that money back even if it is non refundable. I know It’s our fault we confirmed it but it sucks that I don’t go to college now and finding a school that has the major I really wanted.  \n\nIm thinking of trying and publicly shame them on media into giving our money back (it’s a lot of money trust me) so Anyone who can give me good reasons to get it back please please? I don’t wanna disappoint my mom for not going to college and not having enough money 😭",
  "author": "Terrible_Newt_1756",
  "created": 1634415058,
  "updated": 1634423770,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgwfrlw": {
      "link": "/r/college/comments/q9jlb7/reason_help/hgwfrlw/",
      "text": "You're not going to succesfully shame them or convince them to give you the money back. In paying the enrollment fee and then withdrawing, you took a spot that could have gone to another applicant. You knew it was non-refundable when you paid it. It's good that you want to help your mom, but this is a dead end. You're going to have to take the loss.",
      "author": "wetbogman2",
      "created": 1634415797,
      "upvotes": 2,
      "replies": {}
    },
    "hgwm5c5": {
      "link": "/r/college/comments/q9jlb7/reason_help/hgwm5c5/",
      "text": "Now, I don't know what version of English you speak, but \"it is non refundable\" typically means that you can not get a refund on the deposit. And besides, penalizing you for not attending after you confirmed you would attend it literally the entire point of having a non-refundable deposit in the first place. If you try to complain about it, you will be laughed out of the room.",
      "author": "patrdesch",
      "created": 1634418571,
      "upvotes": 1,
      "replies": {}
    }
  }
}