{
  "sid": "oigw0d",
  "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/",
  "title:": "Nervous about going back in person??",
  "text": "Am I the only one whose feeling a bit of anxiety about like going back to seeing people in person on campus?? \n\nI know I didn’t do a great job with maintaining like 99% of my relationships with college friends since covid (I’ve been home like away from school literally since right when covid hit) and I kinda got screwed with housing so I’m now living alone coming back to campus for my last year. \n\nPart of me is like ??? Wtf am I gonna do like living alone ??? But the other part of me is thinking like maybe I’m just overthinking???? Idk just could use some positive thoughts I guess lol",
  "author": null,
  "created": 1626052278,
  "over_18": false,
  "upvotes": 751,
  "upvote_ratio": 0.98,
  "comments": {
    "h51c4al": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h51c4al/",
      "text": "[removed]",
      "author": null,
      "created": 1626184495,
      "upvotes": 1,
      "replies": {}
    },
    "h51288z": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h51288z/",
      "text": "I've done my fair share and put on my ZOOM camera and be interactive with the Professors so they'll know me (if not for being the only person whose face they saw), but I'm nervous too.\n\nI'll miss how convenient ZOOM University was - no hour long commute, being able to take exams at my leisure, being able to study more as a result of both of these.\n\nI've not taken a paper exam in so long and honestly - sometimes I get a little gassy when I am nervous so that's going to be a wild time (have to not drink and eat before an exam now).\n\nBut if it makes my Professors happy and it makes some of my other fellow students more well attuned, I'm for it opening. It's just going to be weird at first.",
      "author": "Athragio",
      "created": 1626178949,
      "upvotes": 1,
      "replies": {}
    },
    "h4zval6": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4zval6/",
      "text": "I started online and I'm barely able to do it and I feel like going in person will be completely foreign and more difficult",
      "author": "Gestice",
      "created": 1626145059,
      "upvotes": 1,
      "replies": {}
    },
    "h4zbari": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4zbari/",
      "text": "Well, at least you know what the campus looks like. Not me having my whole experience be Zoom university! 😭😭😭",
      "author": "a_christmas_tree",
      "created": 1626134413,
      "upvotes": 1,
      "replies": {}
    },
    "h4zanyr": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4zanyr/",
      "text": "What exactly are you nervous about?",
      "author": "YYR123",
      "created": 1626134071,
      "upvotes": 1,
      "replies": {}
    },
    "h4yy8ct": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4yy8ct/",
      "text": "I was so nervous about going back in person that I started applying to jobs in my desired field and actually managed to get hired out of my first year of college.",
      "author": "VerifiedMadgod",
      "created": 1626127738,
      "upvotes": 2,
      "replies": {}
    },
    "h4yvexu": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4yvexu/",
      "text": "I feel the same. I too have not been able to talk to the majority of my friends/acquaintances because of the pandemic but I hope we can start talking again like we did before the pandemic. I also hope I can make new friends",
      "author": "imissmyshow",
      "created": 1626126394,
      "upvotes": 2,
      "replies": {}
    },
    "h4ylgg2": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4ylgg2/",
      "text": "im personally kinda excited and nervous at the same time, like wth am i supposed to do now that i gotta go do my work at school and not in the comfort of my desk.",
      "author": "iamdrawinggeek",
      "created": 1626121806,
      "upvotes": 1,
      "replies": {}
    },
    "h4yfttz": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4yfttz/",
      "text": "I know I should be excited to be living in my own place after a completely online freshman year but I'm terrified.  I don't have any friends and I already struggle enough with being social in the first place.  I get I should look on the bright side, that I'm going to be in a big city and there's plenty of people to meet there, but I'm still so scared.",
      "author": "SynthExe",
      "created": 1626119201,
      "upvotes": 3,
      "replies": {}
    },
    "h4y9qid": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4y9qid/",
      "text": "A lot of people didn’t get to connect because of COVID. I made friends with a guy in my writing class and we vibed great, but then COVID hit and it’s only been text conversation since he lives in Colorado. Don’t worry, man. I’m sure everybody’s feeling that way in some capacity. Gotta jump in feet first 🤷🏼‍♂️embrace your awkwardness",
      "author": "TheGrindson",
      "created": 1626116158,
      "upvotes": 2,
      "replies": {}
    },
    "h4y9d9e": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4y9d9e/",
      "text": "Im going for the first time, don't know if i should be exited or scared af",
      "author": "Seba6464",
      "created": 1626115993,
      "upvotes": 1,
      "replies": {}
    },
    "h4y4srq": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4y4srq/",
      "text": "It's funny, I'm a very introverted person, and usually spend most of my time alone or with one or two friends- but I'm excited, because I utterly *hate* online classes. I'd rather deal with people than another zoom call- which is something I never thought I'd say a year or two ago.",
      "author": "MrWildstar",
      "created": 1626113947,
      "upvotes": 2,
      "replies": {}
    },
    "h4y1xk6": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4y1xk6/",
      "text": "Oh man I *loved* living alone on campus. My roommate moved out after a couple of months, and housing didn’t assign a replacement until my sophomore year. All that space and I was able to have a hangout room for some new friends.",
      "author": "vicemagnet",
      "created": 1626112665,
      "upvotes": 1,
      "replies": {}
    },
    "h4y0n8l": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4y0n8l/",
      "text": "I am. I’m gonna keep living with my parents and driving to campus so I’m not worried about that but actually being around all those people is giving me a headache.",
      "author": "KING_COVID",
      "created": 1626112099,
      "upvotes": 0,
      "replies": {}
    },
    "h4xomnt": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xomnt/",
      "text": "I’m scared. I transferred to my school last year, now I’m a senior and stepping onto my college for the first time ever. I have one year to experience college ahhh",
      "author": "thedistancedself",
      "created": 1626106689,
      "upvotes": 3,
      "replies": {}
    },
    "h4xj3x0": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xj3x0/",
      "text": "You'll be fine. Most people will be happy just to see you reaching out. I know I've been hearing from a lot of people I lost contact with as we're getting ready to head back. If you get in touch and make an effort to see people you'll be fine",
      "author": "JohnLeRoy9600",
      "created": 1626104751,
      "upvotes": 2,
      "replies": {}
    },
    "h4xegip": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xegip/",
      "text": "Same. It’s my senior year but it feels like freshman year all over again :/",
      "author": "lazairiaw",
      "created": 1626102578,
      "upvotes": 6,
      "replies": {}
    },
    "h4xbr14": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xbr14/",
      "text": "For me, I'm more nervous about the environment surrounding my campus: NYC. With all the news about businesses leaving the city and it becoming a ghost town and all the horror stories about stabbings/shootings/Asian hate crimes in the streets seemingly every week I've been paranoid that I've signed a death warrant by making the journey to campus from home.",
      "author": "Phant0mz0ne",
      "created": 1626101299,
      "upvotes": 2,
      "replies": {}
    },
    "h4xbqtu": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xbqtu/",
      "text": "I feel like I could’ve ghost written this post. You’re not alone!",
      "author": "_urbanity",
      "created": 1626101297,
      "upvotes": 6,
      "replies": {}
    },
    "h4xbfvm": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xbfvm/",
      "text": "As someone with 11 roommates (none of which I know) you are SO lucky to be alone lol. But, I feel like everyone is going to be in the same boat with feeling nervous/ not knowing people, I wouldn't overthink it too much.",
      "author": "kripplemk",
      "created": 1626101150,
      "upvotes": 2,
      "replies": {}
    },
    "h4x9oee": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4x9oee/",
      "text": "I'm dreading having to figure out work and going to school. I was doing so well doing both from home and taking my time getting assignments done. I hate socializing ugh",
      "author": "cssabs",
      "created": 1626100301,
      "upvotes": 2,
      "replies": {}
    },
    "h4x1lhw": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4x1lhw/",
      "text": "can't wait to start fucking the 19 year olds again xD",
      "author": "Idroppedoutofschool",
      "created": 1626096256,
      "upvotes": -9,
      "replies": {}
    },
    "h4x106d": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4x106d/",
      "text": "Same, I'm so worried that my social skills have completely deteriorated while I was away.",
      "author": "vivelarussie",
      "created": 1626095939,
      "upvotes": 10,
      "replies": {}
    },
    "h4x0a2j": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4x0a2j/",
      "text": "LOL agreed, hence why I’m going to just stay online until they force me back in person 🤷🏼‍♀️ \n\nI did really well online so I think it’s actually better for me. I have ADHD and find it incredibly difficult to sit still and pay attention in person, it’s way easier from the comfort of my own home.",
      "author": "xjulesx21",
      "created": 1626095535,
      "upvotes": 2,
      "replies": {}
    },
    "h4wzxsf": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4wzxsf/",
      "text": "Its not only that at least for me: I am fucking scared to study for an in person test again. Since everything was online, many profs had an exam policy saying open notes, open book. Its not like I haven't studied for online exams because of that policy, its the fact that you had a backup, like your book in front of you. \n\n&#x200B;\n\n3 online semester + 2 online summer semester totally messed up my head.",
      "author": "Omeole",
      "created": 1626095343,
      "upvotes": 65,
      "replies": {
        "h4x9til": {
          "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4x9til/",
          "text": "I feel you. I honestly didn't study at the same level of intensity during the remote semesters because of this and didn't retain as much as I probably should have. Now I'm afraid for in-person because I have to study for closed note exams on top of not having mastered the previous material",
          "author": "ricewinechicken",
          "created": 1626100370,
          "upvotes": 21,
          "replies": {
            "hcpdp0n": {
              "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/hcpdp0n/",
              "text": "This is exactly my situation. Even during the remote semesters I flunked one lesson because I didn't attend enough (attending online classes live wasn't supposed to be mandatory but my professor decided to flunk me anyway) and now that this lesson will most likely be face to face again it's gonna be even harder to pass. I feel like I learned literally nothing the past year with online classes. Remote education is _really_ not our professors' thing. I have no idea how tf I'm supposed to learn new stuff this year. Hell, I major in French translation and I'm still not fluent in french, yet I'm supposed to be learning the translation part. This is so fucked.",
              "author": "HungryLilDragon",
              "created": 1631548929,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h4x9xvu": {
          "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4x9xvu/",
          "text": "Same with the open notes I got used to relying on it. But at the same time since we won’t be basically teaching ourselves maybe it’ll be easier to absorb the information",
          "author": "Loner216",
          "created": 1626100428,
          "upvotes": 12,
          "replies": {
            "h4xb1mo": {
              "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xb1mo/",
              "text": "True. But I honestly wish profs (if able) would record the live sessions to re-watch at home. I found that to be very useful during the online semesters.",
              "author": "Omeole",
              "created": 1626100962,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "h4yg230": {
          "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4yg230/",
          "text": "I made the dean's list but I feel like there's an asterisks next to that since it was while I was online.  I'm just worried for tests getting so much harder than they were last year and feeling like I'm going to fail because of it.",
          "author": "SynthExe",
          "created": 1626119306,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h4wwrr7": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4wwrr7/",
      "text": "I’m just nervous about also starting at a new university 🙈",
      "author": "FreezingDemon",
      "created": 1626093488,
      "upvotes": 1,
      "replies": {}
    },
    "h4wpbkr": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4wpbkr/",
      "text": "I’m very nervous. Last time I was on campus I was a suicidal mess and had to leave before COVID was a thing. I also went through a whole gender journey, so now I’ll be going back as a totally different person quite literally. I also don’t know if I’m going to have strong bonds left with those I was close to like two years ago.",
      "author": "Parking_Pineapple440",
      "created": 1626088323,
      "upvotes": 16,
      "replies": {}
    },
    "h4wpb3a": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4wpb3a/",
      "text": "Yah it kinda feels like the first day of college all over again.",
      "author": "queer_artsy_kid",
      "created": 1626088313,
      "upvotes": 12,
      "replies": {}
    },
    "h4wp2vp": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4wp2vp/",
      "text": "u are not gonna be there forever graduate as soon as u can and leave",
      "author": "ghostmode342",
      "created": 1626088130,
      "upvotes": 1,
      "replies": {}
    },
    "h4wk0h8": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4wk0h8/",
      "text": "I want to blink and it be august already. I’m ready to move into my first apartment. BUT I am anxious of the fact that I have to actually meet people in person. Freshman year was when COVID was a thing (Not that it’s not a thing still). I don’t even know where my classes will be at and I’m a sophomore.",
      "author": "Charming_Wall277",
      "created": 1626083738,
      "upvotes": 3,
      "replies": {}
    },
    "h4wf4sa": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4wf4sa/",
      "text": "Leaving in a few days.....😐😐😐sigh",
      "author": "Maleficent_Dot3465",
      "created": 1626079043,
      "upvotes": 3,
      "replies": {}
    },
    "h4weng9": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4weng9/",
      "text": "Live nervously and you won't go anywhere in life. The hardest decisions require the strongest will which will eventually pay off big in the future. How can you survive in a competitive market without networking and necessary social skills? People will eventually adapt so being nervous is normal.",
      "author": "smc23678",
      "created": 1626078585,
      "upvotes": 1,
      "replies": {}
    },
    "h4watm0": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4watm0/",
      "text": "[removed]",
      "author": null,
      "created": 1626074955,
      "upvotes": 1,
      "replies": {}
    },
    "h4w9j06": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4w9j06/",
      "text": "I really REALLY don’t want to go back on campus. \n\nEven though my building is 6 minutes away and all my classes are on the same floor, I still don’t want to. \n\nI enjoy being alone",
      "author": "DumbHuman53",
      "created": 1626073776,
      "upvotes": 30,
      "replies": {}
    },
    "h4w8v2v": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4w8v2v/",
      "text": "All my classes in the fall are online. I wish I was in your shoes. I’d at the very least would’ve liked to experience college. Only had one full semester and now I’m almost done with my degree. Sucks honestly",
      "author": "microfsxpilot",
      "created": 1626073191,
      "upvotes": 12,
      "replies": {}
    },
    "h4w7sr0": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4w7sr0/",
      "text": "very nervous especially considering i was just told 2 days ago i would be changing dorms to some random building, room, and a possibly diffrent type of room because the building i was at before didnt have enough people to justify keeping it open. g r e a t",
      "author": "KebDoesTheStuff",
      "created": 1626072264,
      "upvotes": 3,
      "replies": {}
    },
    "h4w7gkf": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4w7gkf/",
      "text": "Professor here! I'm nervous too.",
      "author": "Nerobus",
      "created": 1626071968,
      "upvotes": 8,
      "replies": {}
    },
    "h4w69pz": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4w69pz/",
      "text": "This is actually surprisingly common! I saw this video on it a few days ago that I thought was really helpful:\n\nhttps://www.youtube.com/watch?v=2T15crw8hU0",
      "author": "Jagonu",
      "created": 1626070946,
      "upvotes": 36,
      "replies": {
        "h4w8d3c": {
          "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4w8d3c/",
          "text": "This was so helpful thank you so much! I’m definitely gonna watch some more of this guys videos I like his approach to anxiety",
          "author": null,
          "created": 1626072753,
          "upvotes": 12,
          "replies": {
            "h4waleb": {
              "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4waleb/",
              "text": "Glad you liked it! Dr. K is awesome",
              "author": "Jagonu",
              "created": 1626074741,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "h4w5glo": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4w5glo/",
      "text": "I definitely am! Like other colleges and universities, students and staff are required to be vaccinated. However, we all know that the virus can still be spread and with people partaking in indoor dining and such, it makes me uneasy.",
      "author": "DollXIX",
      "created": 1626070260,
      "upvotes": 12,
      "replies": {}
    },
    "h4vyid6": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4vyid6/",
      "text": "I'm going to college in person for the first time this fall and I feel like throwing up about it.",
      "author": null,
      "created": 1626064870,
      "upvotes": 259,
      "replies": {
        "h4wt6x9": {
          "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4wt6x9/",
          "text": "Eyyyy same, it’s gonna be wild to actually be in person for college after a year online",
          "author": "Alternative-Cherry75",
          "created": 1626091154,
          "upvotes": 72,
          "replies": {}
        },
        "h4xiwey": {
          "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xiwey/",
          "text": "ugh same. I feel like a freshman even tho I'm an incoming soph. I'm literally so clueless as to where everything is on campus and only made a few friends.",
          "author": "rollllllllll_",
          "created": 1626104655,
          "upvotes": 55,
          "replies": {
            "h4yaahr": {
              "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4yaahr/",
              "text": "Bro I relate to this sooo hard xD\nI've maybe spent less than 2 months on campus so, it'll be wild to get a whole sophomore year on campus, kinda going mad with anticipation and a little hesitation ngl",
              "author": "basamraja",
              "created": 1626116414,
              "upvotes": 7,
              "replies": {}
            },
            "h4y4wvz": {
              "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4y4wvz/",
              "text": "same here!!",
              "author": "SanjivanM",
              "created": 1626113998,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "h4x20c9": {
          "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4x20c9/",
          "text": "College *can* be some of the most fun years you've ever had, like you hear other people describe their college experiences. It's always other people that make a period more special though, so try and find some good people.",
          "author": "Hateitwhenbdbdsj",
          "created": 1626096474,
          "upvotes": 24,
          "replies": {
            "h4xebz2": {
              "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xebz2/",
              "text": "It can be the best time of our lives.. but for many of us more than a quarter of it has been ruined by covid. Sucks but I guess we just need to make the rest of our college years count",
              "author": "TvaMatka1234",
              "created": 1626102516,
              "upvotes": 18,
              "replies": {
                "h4xjs5b": {
                  "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xjs5b/",
                  "text": "Tbh most of my really good memories didn't come from my freshman year. It was good to get the partying out of my system, and I made some good friends, but the great friends that I'll have for the rest of my life came later, as did the really awesome memories. \n\nGive people a chance, and say yes to more shit than you say no to. I regret the things I passed up, I don't regret a single thing I actually did do though.",
                  "author": "JohnLeRoy9600",
                  "created": 1626105077,
                  "upvotes": 12,
                  "replies": {}
                },
                "h4xjw5o": {
                  "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4xjw5o/",
                  "text": "Yeah exactly! Shitty to say but one of the only good things about that is everyone went through it, kind of reduces the FOMO. What I have noticed though is a LOT of people coming out of their shell now. Basically anyone I message is down to hang out, including me, and I don't think it would be like that now without us being socially deprived for the last year.",
                  "author": "Hateitwhenbdbdsj",
                  "created": 1626105182,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "h4y9d3w": {
          "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4y9d3w/",
          "text": "You really don't have to be worried. Ask me how?",
          "author": "Mysterious_Juice2447",
          "created": 1626115992,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h4vxb08": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4vxb08/",
      "text": "Very ready to be on my own and be busy again (slow summer for me lol) but I’m SO anxious about having enough time to do everything aince I’m not used to commuting or walking to class or traffic or whatever anymore. It’s gonna be rough for a lot of us I’m sure",
      "author": "AStruggling8",
      "created": 1626064023,
      "upvotes": 44,
      "replies": {
        "h4wh141": {
          "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4wh141/",
          "text": "Are you working? Or doing anything for the summer?",
          "author": "jdjdkdjdelo",
          "created": 1626080893,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "h4vu6um": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4vu6um/",
      "text": "Use this experience as an opportunity to grow. Living alone is a great skill that everyone needs to develop at some point. Learn to value spending time with yourself and make your space a place where friends will want to congregate.",
      "author": "Inner-Lab-123",
      "created": 1626061972,
      "upvotes": 87,
      "replies": {}
    },
    "h4ve6wd": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4ve6wd/",
      "text": "Living alone to me is wonderful",
      "author": "TWR3545",
      "created": 1626052756,
      "upvotes": 7,
      "replies": {
        "h4w8kih": {
          "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4w8kih/",
          "text": "Same boat here. No more unwanted mess in my place and unexpected kitchen usage clashes from other roommates. Having said that, it does get lonely sometime so just bear that in mind",
          "author": "bigblackshaq",
          "created": 1626072935,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h4vdlgl": {
      "link": "/r/college/comments/oigw0d/nervous_about_going_back_in_person/h4vdlgl/",
      "text": "Same here friend, i can't even remember my classmates names anymore",
      "author": "Tight_Assignment_949",
      "created": 1626052438,
      "upvotes": 85,
      "replies": {}
    }
  },
  "updated": 1634054966
}