{"sid": "gxp2fs", "link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/", "title:": "Is there any point for me to try to continue college with a 0.80 GPA? Is there even any possibility?", "text": "To put it simply, my college career is completely screwed up. Over the last four years, I’ve taken four semesters of college (2 semesters in physical classes and a 2 semesters of online classes). Somehow, for no good reason other than lack of interest/drive to do the work, I’ve managed to fail nearly every single class I have attempted. At it’s lowest, my gpa was a 0.39. I took 3 classes online last summer in which I managed to achieve 2 Bs and an F. That brought my GPA up to 0.80 and I haven’t given it another run since. \n\nThis is a very different picture than my academic profile in high school: 3.8 GPA, highest SAT score, National Merit Scholar, etc. Needless to say, I lost any and all scholarships I had.\n\nI wish I had a better reason for why I’ve done so horribly in college. My father died shortly after I graduated high school, so I used that as an excuse in the mandatory meetings I had to have with advisors due to being on academic probation. But while that was definitely a very sad experience, I can’t honestly say I felt any depression or sadness that was impacting my desire to do school work.\n\nThe only real reason is that I have been spending my time working on other things, but I know this isn’t a solid justification as I know plenty of people who have excelled in college while working on other business and/or creative ventures on the side.\n\nNow, as I watch all the people from my high school class graduating and getting their degrees, I can’t help but wonder if I should give another pass at this or throw in the towel. I haven’t officially thought of myself as a “college dropout” yet, but I also don’t have any concrete plans of returning.\n\nCurrently, I’m running a small video production company, learning a few instruments and DAW software in hopes of finding success (and skill lol) as a musician, and studying/practicing screenwriting with aspirations to write for (and one day create/executive produce) television shows. \n\nWhile I like to think I’m confident that I can realize my dreams without college, there are times where I can’t help but wonder if I need to give it another shot, just in case. I also feel like I’ve been socially cut off from people in my age group these last few years and worry that it’s negatively impacting my ability to make social connections that could be beneficial in my fields of interest. I’m an introvert so it can be difficult for me to actively place myself in social situations at times. College seems like a bit of an easier way to accomplish this. \n\nBut then I think about how much of a waste of money and potentially time it could be and go back to square one.\n\nI’m not sure what the point of this post is, I guess I just felt like ranting but also would be interested to hear other people’s perspective on if it is even worth trying to go back with my GPA where it is. If you actually read all of this I appreciate you!!\n\nTL;DR: College GPA after 4 semesters is a 0.8. Is it even worth trying anymore?\n\n\nEdit: WOW, this in-my-feelings rant got way more attention than I expected! I appreciate all of the responses, advice, words of inspiration, and reality checks. \n\nTo everyone who suggested I pick up a trade - luckily I’ve managed to make a decently lucrative gig out of the video production thing so far. Had a full time job as video production specialist (ironically for a school district) for a couple of years that I recently quit in favor of doing my production company full time, so I’ve been fortunate enough to at least have that for the time being as an income source while I work on my other passions. \n\nIf I went back to college now, it would likely be the same story. I will focus these next few years on trying on putting my time, money, and energy into the things I’m truly committed to and reassess college a few years down the line. Thank you Reddit!!", "author": "MrManMan11", "created": 1591441749, "retrieved": 1632947734, "over_18": false, "upvotes": 893, "upvote_ratio": 0.98, "comments": {"ftaanx0": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ftaanx0/", "text": "Dont give up. I had a 0.49 gpa due to missing class because of illnesses at my first community college. They didnt care about my medical documents even after i appealed and gave me F's. I had one sympathetic teacher who let me turn in work let and get an A. Last year i transferred to another community college and they didnt accept my failures, only my one class i got an A in. Since then i have maintained a 4.0. Dont give up. Transfer somewhere else and start fresh. I just took a speech exam and got a 96. I am very grateful to my new college.", "author": "confusedsillykitty", "created": 1591550981, "upvotes": 1}, "ft90j9g": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft90j9g/", "text": "Just take one class that you’ll enjoy", "author": "SubstantialGiraffe7", "created": 1591516906, "upvotes": 1}, "ft8ob6u": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft8ob6u/", "text": " [u/MrManMan11](https://www.reddit.com/user/MrManMan11/)\n\nMaybe you weren't passionate about what you were studying for!  \nWhat were you studying? If you were in film, then school probably isn't for you but if not maybe you should have studied that or something similar cause it seems like you are an music/video/art person like me from your gig", "author": "thenera", "created": 1591506063, "upvotes": 1}, "ft85hwu": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft85hwu/", "text": "I just wanna say you're not alone and I can definitely relate. My dad died while I was in college and I almost failed the entire semester. My french professor passed me. I transferred to a 4-year, and my mother suffered a stroke and I failed my first semester as an upper division student.\n\nI was in Academic Probation, I believe you will get through it. Life sucks and school equally sucks. I think there are ways like academic renewal, withdrawal, maybe your college has credit/no credit?\n\nAre there any waivers you can sign or forms that could be filled out to help your gpa?\n\nBut if you feel like taking a break, you should take one", "author": "Awkwardpenguinperson", "created": 1591493870, "upvotes": 1}, "ft8527y": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft8527y/", "text": "Dedicate yourself to your hobby of video and music production, I feel like you'd regret not pouring all of your effort into something that you actually enjoy and are making off of. I actually find your decision pretty inspiring, I got pretty deep into my degree before realizing I have other interests so I decided after graduation I am going to put all of the energy I have outside of my job into pivoting to my favored career.", "author": "Nick_ThePrick_Diaz", "created": 1591493618, "upvotes": 1}, "ft81cbq": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft81cbq/", "text": "Throwaway, because I'm job hunting and I don't really want my full academic history searchable.\n\nYou can do it, if you want to. That's not some bullshit pep-talk. I was in a very similar situation to you. 4.0+ weighted GPA at a nationally ranked public high school, 33 ACT, 1400 SAT, National Merit Finalist, lots of extra-curriculars, etc. I went to the #3 engineering school in the country, and melted down. My lowest GPA there was a 0.2. My highest was a 1.665. I dropped out.\n\nFifteen years later, I'm completing my first bachelor's degree in eight weeks from the same university. My second bachelor's degree will be done in December. \n\nBut you have to decide if you really want it. My first time around, I didn't want it. I was there because I was *supposed* to be there. But I was more focused on having fun and dicking around than I was on actually doing work. I didn't go to class, or do homework. I blew off at least one final exam. In my classes since returning, I've had a 3.8. I'm going to wind up graduating with a decent-ish GPA.\n\nMy advice to you is this: \n\n1) If you go back to school, make sure you're doing it for you, and not for anybody else. If you don't have the internal motivation to do it, it's going to be a LOT harder. \n\n2) Realize problems early, and reach out for help when it's necessary. One of the things that shocked me when I went back is that professors and administrators generally want to see students succeed. Take advantage of the help they offer. If you're having a really tough time with a class, talk to the professor or your advisor. Nobody fails the class in the last week--you almost always know early on if you're at risk of failing. If it gets to that point, take steps to mitigate it, even if that means dropping the class and trying again. \n\n3) It sounds cliche, but go to every single class. Do all the homework. It really does matter. \n\n4) Try doing part-time classes at a community college. Check out Transferology if your school participates, and take classes that will transfer. You can knock a lot of the gen-eds out, and you can take some of the lower-level weed-out classes in a somewhat easier environment. From where you're standing right now, taking a class or two at a time makes your college career look awfully long. But from where I'm standing, if I had taken two classes a semester (including summers), I'd have had my degree a decade ago.", "author": "Snoo_34979", "created": 1591491624, "upvotes": 1}, "ft7u02a": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft7u02a/", "text": "My associates took 8 years. I wasn't doing too hot and I knew I needed to stop. I took years off and when I felt I was ready to prioritize my education, I returned. I brought my 1.something up to a something. I had to retake a lot of classes, but it was a very different story this time. I lost a parent senior year of high school so that definitely affected me not feeling like I'd live long enough for a degree to matter. I just was in my head thinking I could die any second like the sudden death I mourned. \n\nI'm now in a good place, but every time I signed up for classes because I felt I had to, I failed. You know when that switch goes off in your head and you are ready to be serious with school. If it never happens, that's okay. You have the video business to support you and that's great. \n\nJust don't push yourself to do college until you have a change in mindset. You need to be very determined to finish school to actually do well. If you have no strong feelings to get good grades, something will always take your time from school.", "author": "NervousPraline", "created": 1591488582, "upvotes": 1}, "ft7qwaz": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft7qwaz/", "text": "I hear what you are saying. I’m not sure if you are referencing that you go to a university, but I go to community college and it has been a lot more forgiving. I have friends that have failed almost all of their classes with the occasional B or so, and they are registering for classes this coming year.\n\nAt my community college I’ve met parents that have been in and out of school for up to 6-7 years now, but they don’t give up. I’ve talked to them because I was debating on dropping out of college, and they told me the only thing that counts is that you finish if you want to pursue school. Doesn’t matter how long... everyone’s stories are different though! I met this professor and he asked me how school was and I told him I was on the verge of academic probation and he told me that he was too when he was in college, that he went to a JC, dropped out, went to a university for his bachelors and got on academic probation, and now he has his doctorate, he’s a professor, and he works with Olympic athletes. It blew my mind and changed my perspective. Idk I thought I’d share those little stories with you, everyone’s got those own paths and you will find yours eventually! Much love, you got this! \n\nSide note: People at my high school had a contest for who could get the lowest GPA if it makes you feel better...", "author": "sgper18", "created": 1591487493, "upvotes": 1}, "ft7qt05": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft7qt05/", "text": "College isn't for everyone. What do you want to do? What's your passion. Don't waste money on school if you're not going to enjoy your time.", "author": "BennytheMeep", "created": 1591487464, "upvotes": 1}, "ft7qeo3": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft7qeo3/", "text": "College is not for everyone and that's ok. Even if you excelled in high school that doesn't necessarily mean college is the right choice. It's ok, to pursue other things instead of college. You can be just as successful. If you're genuinely not interested in college classes then don't waste time and money.", "author": "Smitty_Jarrett", "created": 1591487346, "upvotes": 1}, "ft7k1yx": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft7k1yx/", "text": "I had some major health crises my first go around at college & it left me with a shit GPA. I thought I was fucked- I left that school, took a few years off and eventually transferred to a new school. My new school just gave me credit for the classes I passed at the old one. My GPA completely reset. I got a fresh start. I wouldn’t be too worried about the GPA in terms of it “killing your college career” or your prospects. After you graduate your GPA does not matter at all. No job will ever ask for it. And remember, you’re paying the college money. There are plenty of colleges that would be happy to take your money if you want to transfer. I take the GPA more as a wake up call, as in “what are you doing with your life right now?” You’re paying for these classes. Are you here because you want to be here or because you feel like college is what you’re supposed to do? \n\nThere’s nothing wrong with taking a break from school and it sounds like you really need to recalculate. Technical school is a great option...actually atm it a technical certification can probably do more for you than a 4 year degree. But I wouldn’t just hop on that path if you’re not ready to take it seriously. Taking some time off & just working and living for a few years was really good for me. A lot of college grads get really anxious about what to do after school. But, personally, I’ve lived & worked in the “real world”...I went back to school because I don’t want to work in restaurants and stuff forever. I’m actually motivated & have a sense of purpose this time around. And I’m taking it part time, because that’s what works better for me, and I don’t feel the pressure I once felt to “have the college experience” and follow the path every high school guidance counselor pushes you toward. I really wish that at that time I’d been equipped with more knowledge about alternatives to college too. College isn’t for everyone and, honestly, there are plenty of opportunities that don’t require it. I feel like I had this idea that I’d never be able to live comfortably or get anywhere in life without a degree & that’s flat out untrue. I know people who left college who, in the meantime while everyone was going to classes, built  up savings and started their own businesses and stuff. I’ve got a friend who was hustling for a few years, working 2 jobs, doing vintage clothing resale, and doing hand-poke tattoos and now she’s just bought an apartment- which she’s gonna rent out soon because she’s moving , has her own tattoo studio, and is flying all over the country to do trades w/ other artists. I think it’d be good to take some time & rethink things. \n\nWhen you’re envisioning the life you want for the future, the further out something is, the more variables & unpredictable elements come into play. I think it’s pretty naive to try & decide today where you want to be career wise in 10 years. It’s impossible to know. I’ve found it a lot more helpful to envision in the mid-term & think more about the lifestyle you want to live & how you want to feel than what specifically you will be doing for money. Like, in the next couple of years, I want to establish multiple streams of income, be consistently putting money into retirement savings, and be in job/career that I feel like I can do everyday without getting burnt out- one where I have time & energy leftover to start building my own business perhaps or where I can work on my passions in my own time. I’m allowing for and watching for any number of opportunities that could get me to that place. Basically, I’ve just started thinking about it like this “I don’t need to decide what I’m going to do for the rest of my life, I just need to decide what I’m doing next.” It’s been really empowering- it helps me focus on goals that I can take action on today instead of focusing on distant dreams. The same applies to you: you don’t need to know what you’re going to do forever, you just need to know what you’re going to do next. And I think you’re heart is telling you that it’s not “enroll for another semester.” And that doesn’t mean you’ll never go back to school. “Figuring our what I want to do next” is a perfectly fine answer to “what are you going to do next” too.", "author": "verytinytim", "created": 1591485550, "upvotes": 1}, "ft7fyn2": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft7fyn2/", "text": "What's GPA?\n\nI'm from Portugal, Europe.....", "author": "MPRF12345", "created": 1591484409, "upvotes": 1}, "ft7bx70": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft7bx70/", "text": "Sounds like you miss the lost opportunity of the “college experience” the parties and socializing. It’s a kind of loss so grieve it as such. Plus the loss of your dad at the same time. That, in itself, isn’t a good enough reason however if you can’t force yourself to do the coursework.\nFocus on your company but also on your social circle. You won’t be able to participate in the nostalgia abt all the crazy parties but you have to accept where you are.\nAlso: if you really wanted to, by taking some classes and getting good grades, you could100% get into college again if you really wanted to.", "author": "Dorothy_Day", "created": 1591483285, "upvotes": 1}, "ft79g49": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft79g49/", "text": "Whether or not you decide to take time off to see if college is for you, if you do decide to take classes, retake the same classes you got F’s and D’s on and do a grade replacement. The grade will stay on your transcript but it’ll replace the points when calculating your GPA. Good luck!", "author": "wismmer", "created": 1591482593, "upvotes": 1}, "ft78okd": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft78okd/", "text": "Best of luck for whatever you do!", "author": "thriftybee123", "created": 1591482357, "upvotes": 1}, "ft787p7": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft787p7/", "text": "I did something similar. I was a 4.0 student in high school. Earned a scholarship and ruined my GPA in three semesters; lots of F's. I didn't go back to school for another 10 years. When I reentered, I was disappointed to discover that my GPA was still frozen in time, as was my academic status at my school. I had to appeal to the financial aid office just to get access to federal loans.\n\nBUT... as it turns out, I've been much more motivated this time around. I earned my AS (CC) after four consecutive semesters with a 4.0 GPA. I was able to get academic forgiveness on a good portion of my grades and repeated a few others to raise my GPA. Even so, my GPA was less than it would have been and I did not get to graduate with honors.\n\nI transferred to a university a few years later. Again, I've managed to maintain a very high GPA. When you transfer they care about your past GPA, but after admissions they mostly keep track of your institutional GPA. I am on track to graduate with high honors this time around and I just got an invitation to join an honor society.\n\nGo live. Try some things. Learn some things. Figure out where you're going and if school ends up being a path to get there in the future, know that you have options. You will have work to do, but you will have options.", "author": "alate9", "created": 1591482206, "upvotes": 1}, "ft75tg3": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft75tg3/", "text": "I was in your position a decade ago.  I ended up dropping out of school and going into the miltary.  Spent six years in the USAF.  When I got out I was fortunate to get let into a good private school that would ignore all my previous failing grades and start at a fresh GPA.  I worked my ass off the last 2 semesters and am sitting at a 3.7 GPA so far.  I would take some time off and mature a little.  Good luck!  Oh and by the way all my schooling is paid for by the military.  Something to think about.", "author": "7up_yourz", "created": 1591481469, "upvotes": 1}, "ft74nad": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft74nad/", "text": "Just a heads up, if you take time a significant amount of time off and in the future want to return back to school there is most likely a program to rid your transcripts of classes you’ve taken in the past with low grades.", "author": "zdro1216", "created": 1591481103, "upvotes": 1}, "ft71ns2": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft71ns2/", "text": "Why go to college without a specific goal in mind?  If you’re not going so that you can achieve something you want for yourself you will not have the motivation to succeed.  In your message you never listed a reason other than a social interaction as a reason to go.  Lots of colleges will let you join clubs on campus without being enrolled.  If social interaction is all you want from college you could probably achieve it through club activities.", "author": "EL-P0YO-L0CO", "created": 1591480220, "upvotes": 1}, "ft70ym3": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft70ym3/", "text": "I would take some time off. I had a 1.2 gpa and took time off to focus on my mental health and personal relationships. I also considered if I even wanted to go back to college. I eventually went back and my last semester gpa was a 4.0. Taking time off to decide what you need and what you actually want to do (college vs something else) helps.", "author": "calculustextbook", "created": 1591480037, "upvotes": 1}, "ft6sszu": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft6sszu/", "text": "You’ve spent so much on college for a .80 GPA that at this point you’re better off maturing, working, and paying that off.\n\nIf you can return to school and flip your grades, you can probably appeal your failed classes/semesters.\n\nMy GPA used to be below a 2.0, I worked, matured, returned to school, and maintained status on the dean’s list ever since my return. I appealed and talked to the dean and many of my early semester classes have been redacted from my transcript and GPA. My GPA right now is at a 3.7 and I graduate next semester.\n\nGood luck!", "author": "dylandoodle", "created": 1591477875, "upvotes": 1}, "ft6rey8": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft6rey8/", "text": "Take a semester off. Work full time and try to find what you wanna do. \n\n- is your major right for you? Don't go into things like STEM if your not interested. Maybe your major isnt what you want \n- academically what's not clicking? Study habits or time management? \n- do you need a therapist?  depression / anxiety /ADHD ? \n\nAs someone who struggles with anxiety and started college with a 2.1. I think you you should stop, reevaluate and go from there. \n\nIf you need someone to talk to I can help as I was in the same boat.", "author": "CuriousDog101", "created": 1591477522, "upvotes": 1}, "ft6qpca": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft6qpca/", "text": "Are you sure your father's death isn't impacting you more than you think it is? Everyone grieves differently and it's not uncommon to loose motivation for certain things and pour yourself into others that provide more/better distraction and instant gratification. It's a common coping mechanism even if you don't actively feel sad about the death. \nThis is not at all on the same scale, but my grandmother died when I was in middle school. My mom, siblings, and I walked in on her dead on the couch in her apartment. The next morning, I got up at 5am and started doing homework like usual (I was homeschooled). My mom was PISSED at me because she thought it meant I wasn't sad and hadn't cared about her. On the contrary, I was so sad my brain couldn't handle it and compelled me to work so I wouldn't have to think about it. I kept up my workaholic tendencies. If I'd had anything else in my life at 12 other than schoolwork or chores, I probably would have distracted myself with something more fun.\nI agree with the advice to take a break and focus on what you've demonstrated the most interest in, but you should still also try to explore how his death is impacting your mental health. Suddenly losing academic motivation is a big red flag for unresolved issues and you might not regain the same level of drive or be able to properly balance having multiple commitments until you process what happened.", "author": "Empowerly-Admissions", "created": 1591477340, "upvotes": 1}, "ft6omai": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft6omai/", "text": "Try transferring to a community college to bust your GPA then transfer back to a four year school.", "author": "Kyenne_Pepper123", "created": 1591476635, "upvotes": 1}, "ft6lmlj": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft6lmlj/", "text": "College isn’t for everybody. If you truly have no interest to do well, then you won’t. College isn’t your only option- do some independent research and some real thinking on where you want your future to go. \nI suggest taking at least a semester off, so that you don’t waste any more money if you decide that you don’t want to continue with that path. You could consider changing your major, going to trade school, networking, etc.\nAlso, while you say you don’t feel depressed, it’s possible that you are and just haven’t realized it. Severe lack of interest and motivation is a huge sign of depression- even if you aren’t “sad”.", "author": "goodAg12", "created": 1591475838, "upvotes": 1}, "ft6aokh": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft6aokh/", "text": "You probably could bring up your GPA, but at this point you are just wasting your money and time. Take time off and figure out who you are and what you actually want to do. Take some MOOCS (like Coursera, Udemy, or Lynda) and figure out what you want to do. Some of them may be available through your local library. Lynda usually is and if you have an Apple product you have access to a thing called ITunes U. Also look up Open Culture. Learn another language. \n\nIt isn’t the end of the world if you’re a little older in college and after age 26 you have better eligibility for FAFSA. Some of the scholarships may not be there but it’s unlikely that with that GPA that you have access to them anyway. \n\nIf you decide that college isn’t the route for you, some people make good money in the trades. Often better than those with college degrees. \n\n\nI’m 32 and I’m currently getting a StratCom degree with a plan towards going into journalism. Only last year (2018/2019) did I figure out that I have a real passion for journalism. I am in college with people age 17 all the way through to 60.  \n\nI thought I was interested in a lot of things through years, but none of them turned out to be things I was willing to work hard enough to get. It took...well, a lot to get to a place where I am today. But it isn’t the end of the world if you don’t graduate at the same time people your age do. So many of them won’t matter to you in several years time, anyway.\n\nGood luck.", "author": "eleven_eggos_friend", "created": 1591473070, "upvotes": 1}, "ft684p7": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft684p7/", "text": "A year ago I had a GPA of 0.200 after years of failing semesters. I have a GPA of 3.00 now and it's going to continue to go up as I right my wrongs and replace the Fs with As. \n\nGPA can be fixed, the question is are you willing to put in the work and go to class every single day and do all this stuff to get that GPA back up. If you are not willing to put in the work then no, college is not for you right now. The next question is will you be in a better place from even doing that? If you won't then why are you considering it? Don't just go for the hell of it, go because you are willing and if it will better your life.", "author": "GBFMarineScientist", "created": 1591472430, "upvotes": 1}, "ft647l3": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft647l3/", "text": "I had a .7 3 semesters ago and retook classes and continued and have raised it to a 3.2. Btw I just got accepted into my universities engineering program. You can get it back but it will take time.", "author": "Danderson0079", "created": 1591471455, "upvotes": 1}, "ft62hdu": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft62hdu/", "text": "College is already hard enough (and expensive, depending where you are) when you’re motivated and love your studies, if you’re not... it’s basically a waste of time, I’d say?\n\nYou don’t sound like someone that enjoyed college and it doesn’t seem like you need it for your trade necessarily. If later on in life you want to go back, you can! But right now it doesn’t seem like you’re willing to commit, and it makes no sense to go then. As many mentioned, college is very different than high school: you have to put in the work. I’m a student at the Master level & I absolutely LOVE what I study (I’m autistic and I’m studying my Special Interest) and it’s still very hard. College isn’t mandatory: if you’re not motivated & willing to commit & into your studies, it’s not worth it. \n\nI understand the fear of missing out, the doubts when you see people tour age graduating (I graduated later than my peers & felt like such a failure) - but your path in life is different than them, and it’s okay! Success & happiness have many faces, and maybe college isn’t your thing (be it right now or ever). You’re not less than, or missing out because you’re not going/graduating college: follow what actually interest you, put in the work where you actually want to, and you’ll find yourself where you want to be, college or not!", "author": "MoonyMisty", "created": 1591471040, "upvotes": 1}, "ft5v6ka": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5v6ka/", "text": "\"It's time for you to look inward and begin asking yourself the big questions... Who are you and what do you want??\" -Uncle Iroh, ATLA\n\nincluding this quote because it's what gave me my first existential crisis in my second semester of college as a I realized I didn't know why I was there.\n\n It's a long story, but I ended up traveling abroad and discovered what I wanted to study, which wasn't really related to the travel so much as I believe it was a change in scenery. My therapist and I also started working together a lot better through my anxiety and depression. My anxiety makes it difficult to turn in homework sometimes! I would check in with a mental healthcare professional and make sure you don't have any underlying conditions being stressed by your circumstances. \n\nYou need to figure out WHY you're there. What do you need a degree for? What goal are you trying to accomplish? I need a bachelor's degree in order to do freshwater conservation work at the level I want to help. I need a master's degree if I ever want to join NASA's astronaut program, and I do want to become a professor. Going for a degree without the passion is going to be immensely difficult. Knowing why I want a degree makes it easier to pick myself up when I fall into slumps. I just look out the window and daydream about space. Or watch the wildlife and feel overwhelmed by the desire to protect it. That kind of thing. \n\nI personally believe nothing is truly impossible once you understand why you failed in the first place. If you want that degree, understand yourself and why you lacked effort the first time. Talk with an academic advisor, there are likely some policies that may help.", "author": "4DozenSalamanders", "created": 1591469034, "upvotes": 1}, "ft5tqmz": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5tqmz/", "text": "Maybe traditional college isn’t for you. Have you looked into trades or technical school?", "author": "uraniumstingray", "created": 1591468634, "upvotes": 1}, "ft5tqae": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5tqae/", "text": "Man. It sucks other kids didn’t get those scholarships that you clearly wasted.", "author": "ExpiredPilot", "created": 1591468631, "upvotes": 2}, "ft5shbe": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5shbe/", "text": "Everyone wants to be a big time musician or screen writer. And everyone says they think they can do it. But not everyone does. In my opinion college for you isn’t worth the money. Learn a trade like welding or plumbing or elevator technician or something that you could lean on financially for a while. Hey you back to moving forward. And then you can work on your dreams on the side. If you make it big , fuck your job! If you don’t you’ve got a gig you can live off of. Trade school is like. 2 years in a lot of cases.", "author": null, "created": 1591468272, "upvotes": 1}, "ft5r99o": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5r99o/", "text": "What was your major? If it was something you weren’t all that interested in that could be a huge reason why. It sounds like you’re into music so maybe try taking one music class (and no other classes) and see how you like that. If you still don’t, there’s no shame – college isn’t for everybody :)", "author": "succulent_samurai", "created": 1591467909, "upvotes": 1}, "ft5pe7l": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5pe7l/", "text": "You absolutely can bring your GPA up, you should be talking to you academic advisor.\n\nBefore you enroll in classes again you meed to figure out why you going to college and why you haven't been focusing on your class. To pass your classes you're going to have to set things aside. Im really surprised that your GPA is that low after 4 semesters, most institutions would put you on academic probation with mandatory meetings with an advisors to help you figure stuff out.\n\nYou have to realize to registering for a course means you're committing x amount of time to focusing on the course, if you're not willing to make that time commitment you should be registering for that course . Otherwise you're just wasting your money and taking a seat that could have been someone else's.\n\nIt's probably worth it to at least complete an associates degree so you have some sort of higher education. But I think you need to take a semester or two off to do some soul searching and maybe see if your other plans work out. Then you can see if you want to continue perusing your degree. Make sure you talk to an advisor about this and they can tell you what your options for the colleges stand point are. They may let take a semester or two off without having to reapply.\n\nTL;DR don't continue with college unless you're willing to commit your time and energy to passing your classes.", "author": "patmorgan235", "created": 1591467214, "upvotes": 1}, "ft5krv0": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5krv0/", "text": "Understand that neither depression nor grief affect everyone in the same way. Others in this thread have suggested that maybe you simply weren't invested or prepared, but perhaps the real reason is that you have been silently struggling while denying your grief unless it helped absolve you of responsibility in a particular situation. Take classes on a part-time basis if you are still interested in advancing your education. But, most importantly, find the time to grieve.", "author": "tspier", "created": 1591465692, "upvotes": 5}, "ft5jv27": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5jv27/", "text": "If you don’t think college is right for you, you can have success without. I left my university after a semester (long story, Hungarian Universities are pretty shit at the moment). I really lacked confidence while all my friends were in University as a result. But I busted ass, worked whatever computer science jobs I could take, from automated testing, IT, analytics, online jobs, contracts, anything. And in less years than it takes to get a degree, I now have a fantastic office job with 0 debt to boot. And all in time for my friends to graduate.\n\nIt wasn’t easy, and I got hella depressed from not doing anything. But that’s what you need to do: Something. Have a schedule, plan what you want to learn, and just learn it. If you apply often and stay determined, it will pay off. \n\nBut don’t think that Uni is necessary. These days it doesn’t even give you that much of a leg up against other people. It can be great if it’s conducive to your work style and you actually want to learn it. But I couldn’t help but feel like my time was being wasted, and that my teachers were completely disrespectful. I couldn’t do 4 years of it.\n\nI guess I am a college dropout, but it doesn’t feel like it. It just feels like I chose a different path. A more fun, cheaper path that I got to choose exactly what I did and didn’t learn. And I feel I learned far more in the same amount of time than in Uni. \n\nIf you want some advice or to bounce some Qs, hit me up! I’d love to help", "author": "Benlemonade", "created": 1591465436, "upvotes": 1}, "ft5jnyx": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5jnyx/", "text": "Disregarding the grades entirely, it sounds like you’re not very invested in college. There is absolutely nothing wrong with that; but you need to come to terms with it like, yesterday. College may be for you someday. But if you want to go purely because you want the experience your friends are having right now, don’t. Try to focus on the achievements you have made yourself in your life and how those felt.", "author": "MrPotato2753", "created": 1591465375, "upvotes": 1}, "ft5jm4p": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5jm4p/", "text": "There is nothing wrong with being a “college dropout” or even not going to college at all. Honestly, I think there is more money to be made in trade schools. If that doesn’t interest you, maybe consider going to community college to get an associates degree. Either way, I think you need to take a semester or two off to think more about what you want to do.", "author": "Pink674", "created": 1591465359, "upvotes": 1}, "ft5huxm": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5huxm/", "text": "If you got the *highest* possible SAT score and were a national merit scholar, you certainly have the talent and have given the hard work before to do college. The only possible way that you've failed that much is by not doing required work, which is on you.\n\nBecause only about 500 students (out of 2 million) get the highest SAT score per year, I am leaning toward this being a troll post honestly.", "author": "IgnoreTheKetchup", "created": 1591464813, "upvotes": 2}, "ft5ha0k": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5ha0k/", "text": "Well, what do you want? Because it sounds like you don't really WANT to be in college. It sounds like you want to work your company - which is a great thing!\n\nTake a break. Work your company, and when you actually have the time / desire, come back again. But for now, don't waste the money and more importantly - the TIME! - that's taking away from the hours / dollars you could be investing in what you actually like.", "author": "KingOfTheLostBoyz", "created": 1591464618, "upvotes": 1}, "ft5f42t": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5f42t/", "text": "My brother was very similar.  He’s extremely smart, but flunked out of college.  It took him several years, but he got himself together, met with a very good experienced advisor, and was able to declare something called academic bankruptcy.   He ended up graduating with a double major in mathematics and computer science with about a 3.8 gpa.  \n\nWe all go through things.  But he had to get himself together and meet with the right people to help him get back on track to show his academic potential.", "author": "snawdy", "created": 1591463916, "upvotes": 1}, "ft5esh8": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5esh8/", "text": "Tech school, become a carpenter", "author": "Reav101", "created": 1591463795, "upvotes": 2}, "ft5eqzy": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5eqzy/", "text": "It may not be for you and that’s fine. You like tech? (a lot of people don’t know that they do) If so, you do not need a degree to become successful in it, just time and dedication everyday on your own time.", "author": "Mysterious_Control", "created": 1591463778, "upvotes": 1}, "ft5eg8x": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5eg8x/", "text": "You should probably take a break.  If you transfer to a 4 year university your GPA resets. But being accepted would be problematic. In Florida if you do two years of community college and get an AA you’re guarantee to get into most 4 year universities even if you don’t meet the GPA requirements.", "author": "JonathanL73", "created": 1591463658, "upvotes": 7}, "ft5cqc0": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5cqc0/", "text": "Hey. I did much of the same after 2 years of college. I was burnt out and doing terribly mentally and physically. Take some time off. Regroup. Get mental health care. Take time for yourself. Dont bother with school until you feel like you can.", "author": "pandaluver1234", "created": 1591463035, "upvotes": 2}, "ft5cpp4": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5cpp4/", "text": "College isn't for everyone. Also, as I learned from my own experience as a college student, what kind of student you were in high school may or may not have any bearing whatsoever on what kind of student you are in college. It's an entirely different ballgame. If you think maybe college isn't for you, I would recommend investing your time (and money) into something that will be more worthwhile for you as a person! College not being the right fit for someone doesn't make you lesser than anyone else around you, and I know from experience that it's no fun to feel like you're doing worse than everyone around you, but that you can't seem to figure out how to fix it. If possible, find something you're passionate about and maybe even turn it into a career! A degree isn't everything!", "author": "itssonotjacky", "created": 1591463030, "upvotes": 1}, "ft5c6pc": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5c6pc/", "text": "I think maybe you are stretched too thin. Why don’t you take a semester or two off? Work on the video thing and then at the end of that reevaluate if college is for you or not. I definitely think you can succeed if you set your mind to it, I just think lack of interest is the issue. Also, have you thought about changing your major? Maybe you’re in the wrong major, which is the reason for the lack of interest! Good luck 😊", "author": "kimayau", "created": 1591462844, "upvotes": 1}, "ft5bzyq": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft5bzyq/", "text": "So not the same situation- \n\nBut it’s taken me 6+ years to graduate. I got sick in the middle of my college and I was in a program that was fall/spring only classes. So if I missed one class it put my graduation date back a whole plus year.\n\nI stayed like this for a while and then I realized that this was stupid- so I transferred in state and now I’m on track to graduate next year. It sucked and I am so happy seeing my friends graduate but I do at times feel like a failure because I didn’t make it to the finish line at the same time.\n\nif it’s anything to you- don’t worry about your time line. If you want it you want it. But I do think maybe figure out what you want first! \n\nTake the hard gen ed classes at community college- you’ll save money and in some cases learn more because you will have a smaller classroom setting. Then maybe finish off at a 4 year college or whatever suits you. That would be a good way to ease back into college in my opinion.\n\nTake it a step at a time if you go back and be proud of any progress you’ve made. College is a lot harder on people with depression, etc. and especially considering the loss of your father- that can offset people for their whole lives. Don’t blame yourself, just help yourself, and get to where you want to be in life on your terms. Your father will be proud of you no matter what!\n\nBest of luck OP", "author": "goldnughet15", "created": 1591462784, "upvotes": 1}, "ft59wjk": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft59wjk/", "text": "Maybe college isn't for you. Go a different route if you can.", "author": "BlackQueerGirl215", "created": 1591462060, "upvotes": 3}, "ft59qz4": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft59qz4/", "text": "If your heart isn't in it, don't go back. This isn't high school who can tell you what to do?", "author": "Jordanwolf98", "created": 1591462010, "upvotes": 1}, "ft58g3g": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft58g3g/", "text": "I think you are trying to find someone to tell you want to do or try to find some sort of validation. I think you already know. You may not need college but you will need additional training and education. It's up to you if you want formalized education or teach yourself via books, YouTube, etc. You can always come back to school anytime if you need. If they drive and the worth is not there, you'll just be wasting your time.", "author": "patri70", "created": 1591461608, "upvotes": 1}, "ft589x0": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft589x0/", "text": "It’s never too late to study. At least imo. I have felt like shit after my bachelor. I didn’t get accepted for my masters and didn’t really know what to do. \n\nI started working as a swimming coach for kids. I’ve done it now for two years. It’s great fun and I’ve learned a lot. Now I got accepted for my masters and feel very ready to continue. \n\nTake it at your own pace. Progress not perfection. One step at a time. Good luck.", "author": "Randolph-", "created": 1591461560, "upvotes": 1}, "ft57lqb": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft57lqb/", "text": "Dude I don’t see how you’re not on academic probation- at my college, anything lower than a 2.0 is automatic academic probation. It seems like you really don’t want to be where you are, and maybe you’re still grieving. You just aren’t in a good headspace for something as strenuous as college. I’d suggest taking a break, maybe take a semester or two to really figure out what you want to do. It’s okay if you’re not ready, but at some point you have to decide what you want to do with your life. Best wishes my man", "author": "totallynot-abot", "created": 1591461362, "upvotes": 3}, "ft579ob": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft579ob/", "text": "As I was reading your post I saw a lot of similarities between you and I. I came into college and absolutely just bombed my first semester, my gpa after that semester was a 1.0. I was almost kicked out but I made my case to stay. I struggled with every semester moving forward, mainly getting C’s or D’s. About a year ago after finishing up another terrible semester something just clicked. I realized what I was doing to myself and I decided that it needed to change. Now I’ve just finished two semesters where I got a 3.6 gpa in both of them. Nothing crazy, but really good for me. I’m now thinking of grad school and am taking the GRE this summer. I wanted to share my story with you because it sounds like you are at the crossroads in your decision making. You have to decide if you are willing to prioritize school and push yourself to get the best grades you can. That’s the only way to make it worth it to go back. I now love school and I think you can get to that point too. It’s up to you to decide what you want, I’m not sure how many course retakes your college allows but that can be a way to increase your gpa significantly. Also another thing to consider if you want to pursue graduate school. Many schools requirements fall upon a certain gpa in the last 60 hour of undergrad classes. From this point if you work very hard and prioritize school then I would say it’s worth it. Again it’s up to you to decide what you want and what will make you happy. Feel free to pm me if you have any questions or just want to talk.\n\nEdit: spelling", "author": "G-of-all-trades", "created": 1591461254, "upvotes": 1}, "ft554on": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft554on/", "text": "I mean.  Maybe your taking too many classes at a time, or your not taking things that are interesting enough for you? College is much less fun when you haven't found what you really want to study and seek higher learning in. A lot of people are telling you that college isn't for you, but you can easily retake those classes and change the grade to raise your GPA. Plus no one says you have to take a full course load every semester. Take a class or two at your community college while you are focusing on your main goals so that your not so spread thin. But if you truly do not want to take the time to listen and finish the hw for the points then you should focus your effort elsewhere. Good luck and positive vibrations!!", "author": "ColtrainWreck5", "created": 1591460548, "upvotes": 1}, "ft52z8o": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft52z8o/", "text": "I’d say it’s pretty clear what the answer is, I think just answering one question would be sufficient:\n\nIf you were to drop other extra curricular activities (your business) for 2-3 years to GRIND and get all A’s in college and “fix” your GPA, would you better off after graduation?\n\nIf the answer isn’t a 150% yes then college is not the answer for you.\n\nNo shame in dropping out. Imagine if you hypothetically stick with it for 2 more years, spend more money and time and THEN drop out. \n\nOr let’s say you do graduate but with a 2.5 GPA (which is your best case scenario unless your school offers grade forgiveness). Would you be satisfied? Would this yield you a great job or further your current business? Probably not.", "author": "Marcellus97", "created": 1591459779, "upvotes": 6}, "ft51uyf": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft51uyf/", "text": "You have to treat college as a full time (even more than full time) job, if you aren’t ready then you should work on other crafts until you feel motivated to treat college as such.", "author": "CornHellUniversity", "created": 1591459425, "upvotes": 1}, "ft51594": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft51594/", "text": "A college degree is not a prerequisite to life my guy. Frankly, I think for you it'd be a waste of time and money to go back. Keep working and grinding, this internet stranger believes in you.", "author": "Demented_Liar", "created": 1591459183, "upvotes": 1}, "ft4w0n6": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4w0n6/", "text": "Is it possible to go to a new community college and start fresh?", "author": "LilReef599", "created": 1591457496, "upvotes": 1}, "ft4v7o8": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4v7o8/", "text": "If you know you aren’t going to do well then don’t waste your time and money", "author": "boanerfard", "created": 1591457245, "upvotes": 3}, "ft4ul9r": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4ul9r/", "text": "I had  1.0 gpa in highschool. My personal shortcoming was that I never did hw. I didn’t get it, I didn’t care, it didn’t get done. That trashed my grades. I ended up taking a gap year because my parents didn’t wanna pay for college if I wasn’t gonna be serious. It was the break I needed and I realized what I had to put in if I wanted to do well in school. Learned a ton actually, but\n\nI’d also agree that it’s worth taking time off and revisiting if you haven’t reached that change in mindset yet. No judgment, everyone takes their own path", "author": "Pedittle", "created": 1591457070, "upvotes": 3}, "ft4tilp": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4tilp/", "text": "No. You don’t have the drive or will for college at the moment. That’s fine not everyone does and they still succeed without it. You can try trade schools or online certifications. Either way, you simply just don’t want to do school which again is fine. Don’t compare yourself to others tho everyone is different and takes different routes. If you feel like you’re doing good without college then keep doing it. Don’t go to college simply because everyone else is", "author": "sadxtortion", "created": 1591456755, "upvotes": 29}, "ft4spp9": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4spp9/", "text": "Theres this book called, \"how to be a straight a student\" go read it. If it sounds possible after that, when you're ready, go do it.", "author": "bitetheboxer", "created": 1591456495, "upvotes": 3}, "ft4skxk": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4skxk/", "text": "I'd say take a break and give it another try in a couple of years. Try to get a job in the field you want without a degree. If you can find something that pays an amount you are comfortable with, great! Maybe there's no need to get a degree. If not, try going back to school, but ONLY if you know you will 100% dedicate yourself to it.\n\nRight now, there's no need to keep throwing money into something you aren't interested in.", "author": null, "created": 1591456449, "upvotes": 8}, "ft4shkp": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4shkp/", "text": "Not until you are sure you can put in the work.\n\nOtherwise it is going to end up in the same route. Idk some people find success in things besides college and regular work streams, if you feel like that’s what you will be more invested into rather than college, do that.", "author": null, "created": 1591456410, "upvotes": 8}, "ft4sbxd": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4sbxd/", "text": "Have you looked into therapy before making a decision on this? I'm not a professional, but it sounds like seeking some support might benefit your decision making process and self-esteem.", "author": "theinvisibleline", "created": 1591456352, "upvotes": 20}, "ft4s9iz": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4s9iz/", "text": "At my college, if you retook a class, then your highest attempt would be your transcript grade. Other schools average the two grades. I’d find out what your school does and maybe you can retake some of the classes? And then take one class at a time and go from there.", "author": "alphierose", "created": 1591456325, "upvotes": 14}, "ft4rxcb": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4rxcb/", "text": "I failed my first year. My GPA was 0.0, sadly. I felt the same way watching my high school classmates graduate. This isn’t a foot race. Everyone finishes at their own pace. Don’t compare yourself to others. I graduated with BS in computer engineering. It took me a long time to finish. It can be done but it’s up to you. Not to the people online!", "author": "radioactiveman88", "created": 1591456207, "upvotes": 19}, "ft4rl5l": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4rl5l/", "text": "My GPA was a 1.3 with a bunch of F's and W's.. I dropped out and started over fresh at a new school after 5 years. In the space of time I was not attending college I was doing trades and just working and building up my hobbies. (I am also a musician and performer) I wouldn't have done it differently.  If you feel passionate about music, just play music while working. Tune out the negativity. College will be there if you want to go back.", "author": "RealmOfObscurity", "created": 1591456095, "upvotes": 12}, "ft4qx0r": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4qx0r/", "text": "[deleted]", "author": null, "created": 1591455824, "upvotes": -11}, "ft4qd98": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4qd98/", "text": "You CAN do this. You have gotten two B's! That said, you will not pull it off until you actually DECIDE to do it. Mine wasn't that low as a freshman, but I wasn't doing well for reasons. I transferred to a CC, dicked around there for a while, took an associate's degree, transferred back to my 4 year school, worked full time while commuting part-time and one day I found myself with a BS( I failed more than a few all the way thru and made bad decisions a few times too!). Took like 8 years, but I did it. 10 years later, went back for my master's and got a 4.0. I made it a priority and I knew I would get more money, so it was worth it. I felt like an impostor for the first master's but when I got my second I was confident AF! When you are ready, you will do it!\n\n&#x200B;\n\nEDIT: More info", "author": "heathers1", "created": 1591455578, "upvotes": 9}, "ft4puwi": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4puwi/", "text": "Honestly, this decision is completely up to you. You can get any opinion you want from some strangers on the internet, but ultimately it’s all based on you. I have always believed that college is a choice. College is not for everyone, by any means. We shouldn’t feel a social pressure to attend college, because I personally know people who are well off without a degree. Right now, any decision you make is for YOU. It isn’t about anyone else. For me personally, college is for ME. I am taking MY classes, I chose MY degree because that is what I wanted. If you personally don’t want to go to college, then there is ABSOLUTELY nothing wrong with that. However, if you truly believe that you can really improve in your classes, and enjoy it... GO FOR IT. This is all based on how you personally feel. I think if you don’t want to continue with college, then you shouldn’t feel pressure to do so.", "author": "notyourbasicdrunk", "created": 1591455311, "upvotes": 3}, "ft4pfdp": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4pfdp/", "text": "Take a break from college and then come back and start fresh, at a new school if possible.", "author": "YouHaveSyphillis", "created": 1591455120, "upvotes": 35}, "ft4pd9r": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4pd9r/", "text": "Have you looked into problems like ADHD? Focusing becomes a hellavu lot harder outside the mandatory walls of HS vs college.", "author": "Rosalles", "created": 1591455093, "upvotes": 99}, "ft4pd2t": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4pd2t/", "text": "You don’t sound like you like college very much. Is your end goal to work in video production? It sounds like you already have experience. Start networking! That is the best way to find jobs. \n\nMy fiancé also bumbled through college. He’s smart, but he didn’t care. Dropped out after 3~ years because he kept signing up for classes and the. Just not going/doing the work. He got an entry level job answering phones. Seven years later, he runs his own department in the company, is well known and respected in his field, and is super knowledgeable about things he never would have learned in college. \n\nI love education. I’m a teacher!! I think higher education can be a wonderful thing for many people...but not for everyone. Sometimes my fiancé gets down on himself for not getting his degree, but the nice thing is that if he ever decides he wants it, there is nothing stopping him from going back. College will be there. I say drop out, pursue what you ACTUALLY want to do, and fuck everyone who makes you feel bad about it. I have a lot of skills I developed in college my fiancé does not have, but he has a lot of on the job knowledge and business experiences I don’t. One is not better than the other.", "author": "bobfoxsky", "created": 1591455090, "upvotes": 281}, "ft4nrfa": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4nrfa/", "text": "Basically what somebody else already posted. Seems you're not cut out for college. Go get a trade or something. Not only are you just wasting your time, but you're also potentially holding up a spot from somebody who wants to be there and do the work.", "author": "dade305305", "created": 1591454562, "upvotes": 23}, "ft4n02k": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft4n02k/", "text": "It doesn’t seem like college is for you", "author": null, "created": 1591454317, "upvotes": 58}, "ft493pq": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft493pq/", "text": "In short probably not, those fails are all on your transcript.\n\nSo unless you are ready to kick it into high gear and make a 180 on them grades. I'd just go into the trades or something and work until you've matured a little.\n\nThen come back later and give it a second go, hopefully you'll be ready by then.", "author": "B0r3d-At-W0rk", "created": 1591449244, "upvotes": 335}, "ft3uqmq": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft3uqmq/", "text": "It seems like you are going off in all directions. Maybe time to focus on one specific thing and be fully dedicated.", "author": "ajt14000", "created": 1591443605, "upvotes": 436}, "ft3tekq": {"link": "/r/college/comments/gxp2fs/is_there_any_point_for_me_to_try_to_continue/ft3tekq/", "text": "[deleted]", "author": null, "created": 1591443050, "upvotes": 1637}}}