{
  "sid": "q1au9q",
  "link": "/r/college/comments/q1au9q/college_is_kinda_hard/",
  "title:": "College is kinda hard :/",
  "text": "Idk if it’s because I’m an engineering student, or if it’s because i’m a freshman, or both, but college is hard. I feel like im getting the material, a lot of it is review from high school, but whenever I take quizzes or tests, I can never get a ‘good’ score and my confidence has seriously faltered and it’s only the first month. It’s starting to make me question why I’m even here when everybody else seems to be doing great. I’m trying not to let it get to me, but I just have this overwhelming feeling of ‘I’m gonna fail this test no matter what I do’ and it’s kind of heartbreaking because I worked my ass off to get to where I’m at now, and it feels like it’s getting shoved right back in my face. I just don’t know what to do anymore. Anybody else?",
  "author": "IllyrianBuzzard",
  "created": 1633370048,
  "updated": 1634084139,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.95,
  "comments": {
    "hfdnp37": {
      "link": "/r/college/comments/q1au9q/college_is_kinda_hard/hfdnp37/",
      "text": "College is hard, and especially in intro engineering courses.\n\nWhether it’s right or wrong, the point is to weed out people who don’t have the grit to get through it.\n\nSpend extra time studying, use office hours, take practice quizzes.\n\nThere’s a line where you can work too much, but I highly doubt you’re near it. College is a big step up in effort, and no one really preps you for it. But you’ve got to give more than you’re used to.",
      "author": "Casual-Economist",
      "created": 1633370727,
      "upvotes": 14,
      "replies": {}
    },
    "hfdm2al": {
      "link": "/r/college/comments/q1au9q/college_is_kinda_hard/hfdm2al/",
      "text": "It’s supposed to be hard.",
      "author": "ComputerizedCash",
      "created": 1633370124,
      "upvotes": 8,
      "replies": {}
    },
    "hfe7h2m": {
      "link": "/r/college/comments/q1au9q/college_is_kinda_hard/hfe7h2m/",
      "text": "Well no one said it was easy.  Did you make it through HS by barely studying and still doing amazing on stuff? I did and found myself having to learn effective ways to study and learn since I couldn't rely on the HS method of cramming notes at lunch before a test. The engineering classes don't get much easier either so focus on learning how you learn material.",
      "author": "NinjaLorian",
      "created": 1633377989,
      "upvotes": 3,
      "replies": {}
    },
    "hfdn274": {
      "link": "/r/college/comments/q1au9q/college_is_kinda_hard/hfdn274/",
      "text": "Do you struggle with tests? You might need to work on your test-taking strategies. Studying with the test in mind and taking tests well are skills you can improve. I wouldn't necessarily trust that 'everyone is doing well,' people probably don't want to admit to struggling so you won't see it. Talk to somebody at your school and see if there are resources to help you! Maybe even your advisor and evaluate if you've taken on too much work.",
      "author": "ConstantlyMiserable",
      "created": 1633370490,
      "upvotes": 1,
      "replies": {}
    },
    "hfha986": {
      "link": "/r/college/comments/q1au9q/college_is_kinda_hard/hfha986/",
      "text": "For me it's not that its necessarily hard but just the work load is too much. I don't have time to do anything else.",
      "author": "09ikj",
      "created": 1633442447,
      "upvotes": 1,
      "replies": {
        "hfhcpht": {
          "link": "/r/college/comments/q1au9q/college_is_kinda_hard/hfhcpht/",
          "text": "I get that. I feel like I’m kinda living the same day over and over. Wake up, go to class, do homework, sleep, repeat. Not much room for going out which kinda sucks. Not to mention having to use your weekend to get caught up and/or get ahead.",
          "author": "IllyrianBuzzard",
          "created": 1633443567,
          "upvotes": 1,
          "replies": {
            "hfhcx1r": {
              "link": "/r/college/comments/q1au9q/college_is_kinda_hard/hfhcx1r/",
              "text": "Exactly. I have the same exact life",
              "author": "09ikj",
              "created": 1633443659,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}