{
  "sid": "q3kkd6",
  "link": "/r/college/comments/q3kkd6/i_have_a_horrible_roommate/",
  "title:": "I Have a Horrible Roommate",
  "text": "I have 2 roommates, K and A. I lived with A last year and we never had any issues at all. K, however, has pushed us to our breaking point. The biggest issue A and I have with K is their hygiene. K showers maybe once a week, does not wash her hands after using the bathroom, does laundry every other week, and doesn’t cover her mouth when she coughs. Our room stinks even when A and I light candles and spray air freshener. K is also incredibly self-centered and irritating. We have had 5-6 meetings with K over the course of the 7 weeks we have been in school, and nothing has changed. We have had these meetings with and without our RA present, and yesterday A and I had a meeting with our hall director because things have escalated to the point where A and I don’t even come back to the room until we’re going to bed. A and I desperately want to move out because our mental health is in shambles. The meeting with the HD felt like it went really well and it seemed like the process of moving was going to be initiated soon. However, the HD had a meeting with K today, and K came back to the room afterwards visibly angry. She said she had no idea we felt this way and that she wished we had communicated more, but we have been doing exactly that for the past 6 and a half weeks. I emailed our HD again this afternoon to update her on the situation, and it sounds like the moving process will not be happening any time soon. I have also been trying to contact Residence Life on campus for the past 2 weeks and have not received a single response. I am so frustrated and upset because it seems like the people who are supposed to be there to help and care about us don’t care in the slightest. I genuinely don’t know how much longer I can take this. There are a bunch of other issues A and I have with K, have talked about them with her, and still nothing has changed. I am so depressed, stressed out, and feeling completely alone in this process. Both A and I need to leave ASAP for the sake of our mental health. This sucks.",
  "author": "clock-destroyer",
  "created": 1633646576,
  "updated": 1634083282,
  "over_18": false,
  "upvotes": 30,
  "upvote_ratio": 0.93,
  "comments": {
    "hft4ool": {
      "link": "/r/college/comments/q3kkd6/i_have_a_horrible_roommate/hft4ool/",
      "text": "I've been in this exact situation. Messy, self-centered,  totally fucked up my mental health. I basically just avoided going home. I took up running, went to movies, the library, etc. Is this an option for you? I know it might not be. I don't have much advice other than feeling sorry for her rather than anger (didn't help much) and to say that every single living situation after this will be heaven.",
      "author": "Nordic-Blue",
      "created": 1633660767,
      "upvotes": 9,
      "replies": {}
    },
    "hft9slj": {
      "link": "/r/college/comments/q3kkd6/i_have_a_horrible_roommate/hft9slj/",
      "text": "Is it about time for midterms? A lot of people quit college around that time and student housing gets a flurry of openings.",
      "author": "tomorrowdog",
      "created": 1633663348,
      "upvotes": 6,
      "replies": {}
    },
    "hftgjqp": {
      "link": "/r/college/comments/q3kkd6/i_have_a_horrible_roommate/hftgjqp/",
      "text": "My roommates freshman year hotboxed the bathroom every night and hella people came over, basically lived in a drug house.  it was cool in the beginning but after staying up till 4am every night I realized I had to get out of there. Spent basically the entire first semester living like that till I got out. Defiantly tell HD it is affecting academics and sleep that’s how I was able to get room switch.",
      "author": "ORCA_OF_WALLST",
      "created": 1633667341,
      "upvotes": 5,
      "replies": {}
    },
    "hftnnve": {
      "link": "/r/college/comments/q3kkd6/i_have_a_horrible_roommate/hftnnve/",
      "text": "Let me just say I lived in a single my freshman year and the guy next door to me had smelly ass feet. He would wear loafers without socks. I guess the sweat contributed to it and these were carpeted floors. My friends would come to my room and think it was me, but they weren’t stupid. So the floor decided to buy him an air freshener. This only magnified the smell. He never changed his bad habits. He was confronted politely many times. I go to shower one morning and someone decided to tape down his door with a black garbage bag and there was a hazard sign on his door. It was hilarious and effective.",
      "author": "kyeelee",
      "created": 1633672233,
      "upvotes": 3,
      "replies": {}
    },
    "hfw3ygz": {
      "link": "/r/college/comments/q3kkd6/i_have_a_horrible_roommate/hfw3ygz/",
      "text": "Roommate K probably is afraid of other people. There's no way for a single room for one person in the dorms/apartment/condo? Its not an easy process to get that.",
      "author": "Cylinder126",
      "created": 1633721670,
      "upvotes": 1,
      "replies": {}
    },
    "hftj70k": {
      "link": "/r/college/comments/q3kkd6/i_have_a_horrible_roommate/hftj70k/",
      "text": "Wish you would've just made up some \"K\" name & some random \"A\" name. It makes the story extremely hard to follow",
      "author": "TragicalKingdom",
      "created": 1633669049,
      "upvotes": -6,
      "replies": {}
    }
  }
}