{
  "sid": "qty1kg",
  "link": "/r/college/comments/qty1kg/suffering_from_success/",
  "title:": "Suffering from \"success\"?",
  "text": "I hope this does not come out as condescending, but I've been academically successful in every level now and something feels off.\n\nI don't know about y'all, but in my country, students usually have this stage where we are finally \"slapped\" by reality; that we are not as good as we thought we were. This is usually in college, where things start to get real. I never had that.\n\nI felt out place among my peers. They are making fun of out of their hardships while I question why I seem to be breezing through what they claimed to be hard. In fact, most of the time I felt like my academic skills are mediocre/normal until I talked about it with someone. I thought it's normal to get perfect scores in homeworks and exams because that's what I've been getting and I can't be that special, right?\n\nI'm at the most elite university in my country so I don't think my peers are bad at all. But for some reason I'm a huge outlier. Getting an almost perfect grade is so normalized to me that it skewed my expectation and perception. It doesn't feel rewarding anymore and I felt like a normal thing to do to be correct every single time.\n\nI'm aware this can have its drawbacks. But it's so weird for me that I'm like this. I'm a math major. Analysis felt like a common sense to me. All weekly expectations of math-intensive courses are just hours worth of topic to me. Something isn't right.",
  "author": "KatharosMatematikos",
  "created": 1636920072,
  "updated": 1637181601,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hkmusx8": {
      "link": "/r/college/comments/qty1kg/suffering_from_success/hkmusx8/",
      "text": "Shitpost?",
      "author": "alligator3692",
      "created": 1636923013,
      "upvotes": 3,
      "replies": {}
    },
    "hkmwcmv": {
      "link": "/r/college/comments/qty1kg/suffering_from_success/hkmwcmv/",
      "text": "> I'm a math major. \n\nI'm a grad student studying math, and despite the fact that many people see math as the \"hardest\" major, I find that it's one of the easiest if you have good intuition. Many people either can't handle or don't understand abstract concepts very well or struggle with logic. However, if you handle those things fine, then math is one of the easier majors. It's not like bio or history where you have to remember a million things-- generally all you have to do is understand the concepts and if you can do that then often (but definitely not always, lol) the proofs will practically write themselves.",
      "author": "HumanDrinkingTea",
      "created": 1636923625,
      "upvotes": 3,
      "replies": {}
    },
    "hkmyro8": {
      "link": "/r/college/comments/qty1kg/suffering_from_success/hkmyro8/",
      "text": "Try to solve these problems:\n\nhttps://www.imo-official.org/problems.aspx\n\nUndergrad is not much really.",
      "author": "aahlp",
      "created": 1636924590,
      "upvotes": 3,
      "replies": {}
    },
    "hknbv20": {
      "link": "/r/college/comments/qty1kg/suffering_from_success/hknbv20/",
      "text": "That’s cool that you haven’t met your limit yet. I would just keep challenging myself till I hit it. Maybe add a full time job and study. Or get a masters or even a PhD. I mean you should always be strategic and go for your goals. But if you never meet a challenge then I guess you were just blessed with an easy life. Maybe overcoming academic challenge wasn’t your lesson to learn.",
      "author": "beanie1816",
      "created": 1636929826,
      "upvotes": 3,
      "replies": {}
    }
  }
}