{
  "sid": "qr69fr",
  "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/",
  "title:": "i need help figuring out if I should drop out college",
  "text": "I'm on my 4th year of architecture school and I wanna just quit it so bad. i feel like I haven't learned anything in these years, I have no interest left and nothing enjoys me anymore. I'm just learning to be a slave of the workload that they put on us, nothing more. I don't know if I will work as an architect in future, I don't see myself capable of but I don't wanna quit bc what will I do after? I don't have much interests in other things and I dont wanna disappoint my family..\n\naside of this, I totally lost my life on it. I don't do anything else and my mind is 90% college stuff I don't have time to do anything else and this is making me feel like shit\n\n\n\n+++thanks to everyone that had the time to answer me, I really appreciate it! I will try to talk to a tutor and to my friends about it and maybe I will realize what I want and what it's best for me",
  "author": "Capital-Elevator7081",
  "created": 1636584074,
  "updated": 1636654730,
  "over_18": false,
  "upvotes": 246,
  "upvote_ratio": 0.98,
  "comments": {
    "hk4o3il": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk4o3il/",
      "text": "You came this far, why would you leave with nothing? At least leave with a degree",
      "author": "CosmoCracker",
      "created": 1636584327,
      "upvotes": 528,
      "replies": {
        "hk5czy1": {
          "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5czy1/",
          "text": "Agree. Finish school as it will give you options.",
          "author": "johnsmith069069",
          "created": 1636595294,
          "upvotes": 151,
          "replies": {}
        },
        "hk5svfi": {
          "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5svfi/",
          "text": "You don’t have to be an architect after you graduate, but you will have a degree which will open up a lot of opportunities!",
          "author": "pumpkinator21",
          "created": 1636602558,
          "upvotes": 87,
          "replies": {}
        }
      }
    },
    "hk4p2cm": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk4p2cm/",
      "text": "Degrees are pretty flexible honestly, if you don't want to work in architecture theres job opportunities elsewhere even if you didn't major in them. A few places just look for a degree in anything to see that you're disciplined enough to finish something without quitting.\n\nLeaving now would be a tremendous waste of time and money, 4 years of schooling with nothing to show if you quit now.",
      "author": "Sermos5",
      "created": 1636584728,
      "upvotes": 220,
      "replies": {}
    },
    "hk50qes": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk50qes/",
      "text": "I felt the same way and sometimes still do but so glad I decided to push through. Having any college degree nowadays opens up a lot of doors by getting you past a lot of useless resume screening and you don’t necessarily have to work in architecture if you don’t want to. Since you already made it this far, just push through and get the diploma. You’ll have plenty of time to figure out what you want to do after you graduate.\n\nI’m not necessarily trying to advocate to stop giving a shit about your classes, but if college stress is all you think about, just remember, C’s get degrees. Try your best to enjoy these last couple semesters and it’s perfectly fine to take on less stress about school work if it makes you happier.",
      "author": "ContributionLower377",
      "created": 1636589805,
      "upvotes": 40,
      "replies": {}
    },
    "hk5ebbj": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5ebbj/",
      "text": "Push through and get it over with. A degree will ensure your employability if you want better and higher positions.",
      "author": "LovelyHoney98",
      "created": 1636595874,
      "upvotes": 20,
      "replies": {}
    },
    "hk4v811": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk4v811/",
      "text": "How far do you need to go to finish the degree? if its less than a year i would definitely push through",
      "author": "Raymond_K_Hessel2000",
      "created": 1636587375,
      "upvotes": 32,
      "replies": {
        "hk4vob7": {
          "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk4vob7/",
          "text": "i don't have a deadline, I will finish it when I will do all of my exams + 1 year of thesis. so it could take me 2 years or 5 idk",
          "author": "Capital-Elevator7081",
          "created": 1636587573,
          "upvotes": 29,
          "replies": {
            "hk4waqw": {
              "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk4waqw/",
              "text": "so its gonna take at least 2 years ?",
              "author": "Raymond_K_Hessel2000",
              "created": 1636587845,
              "upvotes": 13,
              "replies": {
                "hk4wn3g": {
                  "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk4wn3g/",
                  "text": "yeah, at least 2y",
                  "author": "Capital-Elevator7081",
                  "created": 1636587993,
                  "upvotes": 9,
                  "replies": {
                    "hk60cd5": {
                      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk60cd5/",
                      "text": "Do you have something else in mind ? If you do drop out , what course will you pursue ? If it's getting too much , then do what's best for your mental health but be rational don't drop out without knowing where you'll go next ( which other degree you'll do )",
                      "author": "La-Madame",
                      "created": 1636606450,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "hk4x4vx": {
                      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk4x4vx/",
                      "text": "maybe consider dropping out if you really dont want to do it and also dont see yourself at this profession in the future. Its not worth to torture yourself for so long.",
                      "author": "Raymond_K_Hessel2000",
                      "created": 1636588207,
                      "upvotes": 1,
                      "replies": {
                        "hk5jph4": {
                          "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5jph4/",
                          "text": "I dont see why ur getting downvoted, ur not wrong I mean she can push thru 2yrs of what is now suffering and misery for her or she could use those 2 yrs for a new opportunity into finding something else idk.",
                          "author": "Darkrise107",
                          "created": 1636598281,
                          "upvotes": 21,
                          "replies": {
                            "hk5ntgy": {
                              "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5ntgy/",
                              "text": "Ppl don't agree with his comments cuz it's his or her opinion. You'll get down voted over you're own opinions on something and ppl stay down voting.",
                              "author": "Forever_ForLove",
                              "created": 1636600139,
                              "upvotes": 7,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hk60wvo": {
              "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk60wvo/",
              "text": "Once you finish the classwork, can you be part-time while working on your thesis? Give yourself a little breathing room? My BIL dropped out of architecture school and is a draft artist. It pays the bills if you're extremely frugal, but he didn't have a lot of student debt.",
              "author": "alextriedreddit",
              "created": 1636606775,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk5klo1": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5klo1/",
      "text": "I honestly had the same dilemma back in college, which led to me shifting to a different course of study. Surprisingly enough, I became interested in the course I used to be in when I started pursuing writing as a career where I write on topics relevant to that study. While I do not have the interest to continue on that education, I nevertheless found myself liking the subject the more I dabble on it.\n\nDo you play Minecraft or similar games? Try engaging yourself in some creative building, it might spark some interest in your present learning or establish an inspiration that could make you finish your studies.",
      "author": "MickyDYoungBull",
      "created": 1636598685,
      "upvotes": 5,
      "replies": {}
    },
    "hk69jmf": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk69jmf/",
      "text": "You sound burnt out. Don't drop out just yet, talk to your parents and your advisor. A lighter semester or even a semester away might help.",
      "author": "KnowledgeableNip",
      "created": 1636612076,
      "upvotes": 6,
      "replies": {}
    },
    "hk5fcgf": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5fcgf/",
      "text": "Consider the idea of switching to something you find more enjoyable - you have put in a lot of effort and maybe it would be easy to transfer many of those valuable credits. \n\nAs someone above said - you don’t need college to have a successful career. However, since you’re 4 years deep you probably do need to consider a degree as a potential means to give you a pay boost that may make your life easier in regards to affording your college based debt. \n\nWeigh all your options and reach out to your advisor and people you trust and ask them to help you see the full picture. \n\nMost importantly, don’t do it just because you don’t want to disappoint your family. How will dropping out impact YOU beyond what everyone else might have to say? Do you have a direction or plan beyond in regards to what you might do if you drop out? Will you regret it and wish you hadn’t? Consider all these things and make the decision that leaves you feeling most at peace with your decision. I don’t think there is a 100% win/win answer. You will have to sacrifice something in order to achieve either outcome.",
      "author": "mutual-cacophany",
      "created": 1636596333,
      "upvotes": 6,
      "replies": {}
    },
    "hk69xfb": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk69xfb/",
      "text": "Push through! I have a cousin that also majored in Architecture and he felt (key work felt) that he hated it because of the amount of homework college students get. He even worked at McDonald’s for about two years before actually using his degree because he needed to disconnect his negative thoughts of homework from his degree. He works as an architect now and loves his job! What you are feeling is common and frequent, keep pushing you’re almost at the finish line!",
      "author": "doritoburrito_",
      "created": 1636612345,
      "upvotes": 3,
      "replies": {
        "hk6sqz2": {
          "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk6sqz2/",
          "text": "so he worked two years at mcdonals at then as an architect?",
          "author": "Raymond_K_Hessel2000",
          "created": 1636627869,
          "upvotes": 1,
          "replies": {
            "hk79hiq": {
              "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk79hiq/",
              "text": "Yup",
              "author": "doritoburrito_",
              "created": 1636638457,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk5b7jj": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5b7jj/",
      "text": "So…quit if you want to but you’ll be making your life a lot harder. \n\nRemember, a degree is a certificate to say you’re not totally stupid, nothing more. When you apply for a job, you’ll need that certificate to show that you’re worth hiring. That job needn’t be in architecture though. Honestly, you probably need a degree to become a dog walker.",
      "author": "Mattos_12",
      "created": 1636594508,
      "upvotes": 8,
      "replies": {
        "hk5jq10": {
          "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5jq10/",
          "text": "I can confirm you do not need a degree to be a dog walker lol but it's definitely a fun and rewarding post uni job for a little while.",
          "author": "Klutzy-Classroom6756",
          "created": 1636598289,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hk5h5c6": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5h5c6/",
      "text": "Who’s paying your tuition?  If you’re ok with throwing all of that money away, it is your choice.  Do you have a lower degree yet?  Associate’s Degree.  If so you have a very expensive one but at least you have that.  \n\nAlso,  life is hard.  Don’t be the victim.  It won’t get better if you quit.",
      "author": "paulp64131",
      "created": 1636597142,
      "upvotes": 5,
      "replies": {}
    },
    "hk5jjq4": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5jjq4/",
      "text": "but surely you've learned like design fundamentals, technical drawing, etc. etc. those are definitely transferrable skills. (as others have said) I mean you've already come this far, why give up now?  \n\n\nalso if you quit and you decide you'd like to finish it and the cost of tuition has shot up by like 40% down the road, you'd probably be kicking yourself. I know it's hard, sometimes the world feels like a huge dumpster fire, but don't give up! once you finish you'll know you can get through anything!",
      "author": "Klutzy-Classroom6756",
      "created": 1636598209,
      "upvotes": 2,
      "replies": {}
    },
    "hk5r3rf": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5r3rf/",
      "text": "i say you get the degree but after you graduate figure out what you really want to do",
      "author": "Minimum_Outside6167",
      "created": 1636601701,
      "upvotes": 2,
      "replies": {}
    },
    "hk64o34": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk64o34/",
      "text": "I'm in a similar boat (except I'm pretty confident in my degree choice on some level, but I'm not sure what I'm doing either). During the week, I feel drained, robotic, unhappy, miserable, lifeless. I genuinely feel a huge lack of interest in everything, not just school. It hurts so much.\n\nI noticed when we were online and I had more free time, or even during the weekends, I am a million times happier, full of energy, etc. I know the problem is school. I just want to have my life back.\n\nIf you only have one year or less, see it through. If you don't, you will regret it. If you have 2+ years, which I saw you suggest, then I recommend taking the upcoming holiday breaks to think about why you're so unhappy, what you want your future to look like, etc. Because that's 2+ extra years of money and utter misery for something you may not even want.",
      "author": "yellowdaisycoffee",
      "created": 1636608962,
      "upvotes": 2,
      "replies": {}
    },
    "hk68jjt": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk68jjt/",
      "text": "as a 3x college dropout who finally found their passion, reassess what your passions and plans are. \n\nwhat topics and subjects make you happy? things that interest you or that you can talk about forever? do you like architecture & why’d you pick this major? what were your plans then? where do you see yourself in 5 years? what fields or topics can you see yourself enriched in for many years? \n\nwhat right now is making you think you should change course so close to the finish line? is it the structure of school? your major? your university? personal life? mental and/or physical health? is it something you have control over aka something you can change? or is it something completely out of your control that you need to let go?\n\njust some basic questions to ask yourself before dropping out or changing life paths. really dig deep, be honest with yourself. take some deep breaths. allow your emotions to settle before making any big changes. think without distraction. you’ll know what feels right, not out of fear or anxiety but out of a lust for that decision. \n\nalllll my love, hope you shoot for that degree and realize you have complete potential in whatever makes you happy or interests you, but inside you gotta be okay too. it sounds like you’re feeling lost. does your college offer free counseling? I know it’s recommended so much but it’s worth a shot. I know you feel horrible in this moment and trust me, I’ve been there (hence the dropping out 3x) but in the end, you just need to *do what’s best for you.* <3",
      "author": "xjulesx21",
      "created": 1636611386,
      "upvotes": 2,
      "replies": {}
    },
    "hk6c8js": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk6c8js/",
      "text": "Finish school! You’re almost there! It’ll give you some options at least! You can always take some years off afterwards and you pursue your own interests! You got this!",
      "author": "SooshiMoon",
      "created": 1636614021,
      "upvotes": 2,
      "replies": {}
    },
    "hk6gr7g": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk6gr7g/",
      "text": "Try with UI/Ux designer u can get a gr8 job and package plus its the same design process and u will love it my brother wanted to become architect he got 143/200 in nata but due to some financial reason he could not get college now he is doing UI/UX desiging and its fun.... and plz do complete ur degree.",
      "author": "crunkgigglemug_14",
      "created": 1636617587,
      "upvotes": 2,
      "replies": {}
    },
    "hk58pfl": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk58pfl/",
      "text": "You don't need college to have a successful career. Idc what other people say. Certain careers do require college but not all.",
      "author": "Jax_Teller2-0",
      "created": 1636593389,
      "upvotes": 5,
      "replies": {}
    },
    "hk5ndid": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5ndid/",
      "text": "It’s tragic that you seem to don’t have the passion anymore, but since you basically almost finish, just get the degree so you can have more of a job prospect later",
      "author": "NFC818231",
      "created": 1636599932,
      "upvotes": 1,
      "replies": {}
    },
    "hk5tpt0": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5tpt0/",
      "text": "[removed]",
      "author": null,
      "created": 1636602971,
      "upvotes": 1,
      "replies": {}
    },
    "hk5zk94": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk5zk94/",
      "text": "I feel the same way about my major, I know it’s gonna suck but if you can please push through with it. What’s important is that you’ll graduate with some degree even if you don’t want to be an architect. You’ll be able to find jobs in other companies doing other things.",
      "author": "MoodyBoi9",
      "created": 1636606012,
      "upvotes": 1,
      "replies": {}
    },
    "hk617q8": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk617q8/",
      "text": "Pull through don’t drop it. You’ve come so far for nothing if you drop out. Seriously your only best choice is to pull through, wish you the best :) I’m sorry to hear you are having trouble in finding motivation to keep going for it.",
      "author": "QuickDraw1546",
      "created": 1636606944,
      "upvotes": 1,
      "replies": {}
    },
    "hk63oqb": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk63oqb/",
      "text": "Hello - have you considered that maybe you’re depressed? Maybe it’s not your major, or the place you live, or the school you go to, but you? For me, depression often feels like every day is a grind. There’s a fix for that and I bet your school has a counselor that can help",
      "author": "anabaena1",
      "created": 1636608382,
      "upvotes": 1,
      "replies": {}
    },
    "hk63tjd": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk63tjd/",
      "text": "I mean you're in your 4th year. I'd just follow through so the debt doesn't go to waste.",
      "author": "Red234234",
      "created": 1636608462,
      "upvotes": 1,
      "replies": {}
    },
    "hk667is": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk667is/",
      "text": "2 more years is like getting a master's in something else. It doesn't have to be architecture or nothing. Talk to an advisor about what you could do with the credits you already have. Is there a degree through your architecture school that isn't a professional degree you would need to do a thesis for? Architecture schools are a bit odd, some are 4 years plus a 2-year master's, others are 5 years ending in a bachelor's, but are considered a professional degree so you can take the licensing exam with either one. Is there overlap at your school between interior design, or environmental design? A lot of universities offer a bachelor's of general studies. Depending on your core classes you may be able to finish this year or go online to finish. Then you could work, see what you really want to do, and then go for a master's in a different field, or even at a different school.",
      "author": "fawkes_fiesta",
      "created": 1636609883,
      "upvotes": 1,
      "replies": {}
    },
    "hk6esl6": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk6esl6/",
      "text": "The most important thing in life is your mental health. It seems might be struggling with more than just the workload of school. If your school gives you access to a therapist I would take advantage of it. You didn’t spend 3 years in school cause you thought it was cool this is something you wanted and now you don’t seem certain. What made you go after this degree, and why do you feel this way now. I would recommend therapy or just talk to anyone close to you who will listen without any judgment. Good luck 🍀",
      "author": "Xxavier359",
      "created": 1636616003,
      "upvotes": 1,
      "replies": {}
    },
    "hk6fooo": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk6fooo/",
      "text": "Most colleges have free mental health care included through the counseling center. Take advantage of this! I think it’d be a great help for you, like many other stressed/depressed college students.\n\nAlso I don’t think you should drop out. Pushing through my depression and finishing my degree was one of the best decisions I ever made. It opens more doors then you expect and in different fields. Does it make you rich? No, but it gives a huge leg up to getting a job/career that pays a comfortable amount to cover the bills and then some.",
      "author": "Eva-darcie",
      "created": 1636616717,
      "upvotes": 1,
      "replies": {}
    },
    "hk6hz34": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk6hz34/",
      "text": "Do not quit srs. Finish your degree and get that diploma because it is the doorway for a lot of jobs. I finished my degree in another field and felt the same as you. I didnt even know where I wanna work after i received my diploma. All I have learned throughout college doesnt even apply in the job I am doing right now. After college, went through a period of abouth 8 months applying everwhere until I landed on an entry level position. Been in the same company for about 5 years and climbing up the ladder through multiple positions (I am currently a project manager which is not even the field that I  studied)",
      "author": "SelectionMM",
      "created": 1636618580,
      "upvotes": 1,
      "replies": {}
    },
    "hk6lmto": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk6lmto/",
      "text": "If you enjoyed it at first then its probably some kind of anxiety, just power through it, you already got this far, it will give you good opertunities in life for a stable living, even if you hate it now, its still worth it .",
      "author": "NinjaBarrel",
      "created": 1636621710,
      "upvotes": 1,
      "replies": {}
    },
    "hk6npcr": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk6npcr/",
      "text": "Since you’re so close to finishing, I think you might as well finish. However, I don’t suggest working a job you’re miserable in. Take time to discover yourself and what you want out of life. Best wishes :)",
      "author": "Norzilia_M",
      "created": 1636623569,
      "upvotes": 1,
      "replies": {}
    },
    "hk6o35g": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk6o35g/",
      "text": "If you're already on your 4th year just finish your degree just because you came this far. After graduating you can always do something you ACTUALLY enjoy (and who knows, maybe you end working as an architect 🤷🏻‍♀️)",
      "author": "gma2098",
      "created": 1636623910,
      "upvotes": 1,
      "replies": {}
    },
    "hk6yhev": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk6yhev/",
      "text": "Finishing school is the best thing you can do. Once you have the degree you can take a break. It's pretty common for people to finish school and take some time off instead of going straight into a job. \n\nAfter that you can decide if you hate your career or if you were just burned out.",
      "author": "MrGuffels",
      "created": 1636632165,
      "upvotes": 1,
      "replies": {}
    },
    "hk7eo42": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk7eo42/",
      "text": "Just finish out the degree",
      "author": "NoOutlandishness9892",
      "created": 1636640930,
      "upvotes": 1,
      "replies": {}
    },
    "hk7k2l9": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk7k2l9/",
      "text": "Cut it back a bit and see if your school has some kind of online track to complete your degree. Go at it part time and get you a job in the meantime. Something not too stressful, but makes money. Do some class work after you get off work and take only 1 or 2 classes a semester. They may say that your major determines what you go in to but in all honesty employers are looking for higher education and a architecture major could even (possibly) land you a civil engineering manager job if some sorts.  I mean, think about this. Something like 20% of financial advisors have an engineering degree.  You aren’t locked down on whatever major you have man",
      "author": "zebradonkey69",
      "created": 1636643362,
      "upvotes": 1,
      "replies": {}
    },
    "hk7rklp": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk7rklp/",
      "text": "Your in your 4th year but you might consider switching majors. There are plenty of majors with similar requirements to architecture. If you dont want to do that I would at least finish. Even if you dont go into architecture a degree can still get you a better job with better pay.",
      "author": "STINEPUNCAKE",
      "created": 1636646617,
      "upvotes": 1,
      "replies": {}
    },
    "hk80cwj": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk80cwj/",
      "text": "I entered architecture school and two years in and switched majors and it was the best decision of my life. The system is archaic, the pay after a masters is trash, I couldn’t stand the people I was surrounded with. I couldn’t see myself doing this for my life. Leaving that trash was the best.\n\nYou’re kinda in deep. Finishing your degree just to finish it may not be good advice. If you have to get another degree anyway, why mess around for an *additional* year on top of it? Some grad programs and/or careers require a bachelor degree of any type. See if anything like that interests you. If it does, maybe completing the degree just to have a degree as a check in the box is worth it. But if you need a degree in a different major stop right now.\n\nI would suggest taking a year off to work and distance yourself and clear your thought process and vision.\n\nIf you don’t go through with architecture  ultimately it’s going to be expensive and time consuming and you can’t change that. I’d argue living a life you hate will be more “costly”\n\nDon’t get hung up on living a dream job of passion. Your career is to pay the bills. Leave your hobbies as hobbies.\n\nI did two years in arch, hated my life, took a year to work, went to community college, destroyed all the calc, linear algebra, stats, physics, chem etc, got an associate transferred back to big boy school with three semesters to do and I’m about to graduate with a public health major, math minor, and on to grad for epidemiology and biostats and I love all of it.\n\nDon’t give into sunk cost (assuming it’s ultimately the correct decision). It WILL be expensive it WILL be time consuming but it may also be WORTH it.",
      "author": "dh731733",
      "created": 1636650128,
      "upvotes": 1,
      "replies": {}
    },
    "hk89b2f": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk89b2f/",
      "text": "Hang in there. School is draining and can cause disinterest in the career you’ve chosen (quite common actually especially in doctorate and graduate programs) but you’ve come so far. You’ll likely feel worse if you just leave now. You got this!",
      "author": "mike_wazowskis_ass",
      "created": 1636653637,
      "upvotes": 1,
      "replies": {}
    },
    "hk8bxgc": {
      "link": "/r/college/comments/qr69fr/i_need_help_figuring_out_if_i_should_drop_out/hk8bxgc/",
      "text": "I literally had the same thought of dropping out the last few days. I have been so depressed and I'm in my 4th year too.. It sucks cause everyone seems to be so fucking motivated.\nI am studying medical engineering and it seems like the most jobs for this are located way too far away from where I live and I don't wanna leave my family and friends. \nI wish I knew this before I started. \n\nBut I just read a comment on another post which said something like: \" You'll have more job options with this degree than without it\". \n\nAnd it's true. Even if it might be just a little, it's still more. \nWe didn't go 4 years to college for nothing! There are many ways to change our career paths later on. Maybe you could teach math? Nowadays there are so many options. If we drop out now we would have to go through EVERYTHING again. We would be no different than a high school graduate, just 4 years older. In terms of job options.\nDid you ever look at your list with all the exams and papers you have passed? \nI don't come from a family who can support me if I drop out now. \nSo just see if you can afford it or not. If it makes a good difference. Or if continuing with your degree is the better option overall. \n\nWho knows, maybe you find a similar occupation to an architect which you like?",
      "author": "FlounderOpposite2734",
      "created": 1636654680,
      "upvotes": 1,
      "replies": {}
    }
  }
}