{
  "sid": "b1sq05",
  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/",
  "title:": "Someone in my College made a petition to suspend everyone who has been accused of sexual misconduct",
  "text": "A girl in our second year accused someone, but the legal system will take 6 months. So she started this petition, with the goal of getting everyone accused suspended until a verdict is reached. It seems mainly geared towards this one guy, but the title and text still call for all suspects to be suspended.\n\n\nIn the groupchat of my year people are angry, calling for suspension even though no proof has been shown yet. People seem to have done away with the principle of 'innocent until proven guilty'. I want to support victims, but this just seems crazy!\n\n\nOn top of that, one of my best friends had also been falsely accused by a different girl (weeks before). He is having a breakdown, his depression making a swift comeback because of the accusation. I truly believe he is innocent, they hooked up multiple times, she was sober and they even showered together. But she had a boyfriend, as he found out later, so possibly she didn't want to own up to it. He has moved out of our building already on request on the uni, but still studies with us.\n\n\nWhat can I do to ensure people aren't getting suspended based on accusations alone? Is a petition like this even legal? I am personally rather upset by the amount of ire this has elicited. When I defended maybe not punishing someone without evidence I got some angry comments thrown my way.\n\n___\n\n\nEDIT: I want to put this into perspective, there is no physical protests or anything going on, just discussions in the groupchat. However, the petition now has 681 signatures. I assume most of them are just out of solidarity, but the title of the petition is ''MY UNIVERSITY to Suspend Suspects of Sexual Crimes from Education'' so it isn't exactly covert in its intentions. It is only a petition, but still.\n\n\nThere are people speaking out against this luckily, so it isn't as bad as it could be.",
  "author": null,
  "created": 1552744776,
  "over_18": false,
  "upvotes": 859,
  "upvote_ratio": 0.95,
  "comments": {
    "eiqusxe": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiqusxe/",
      "text": "welcome to feminism!",
      "author": "dontbeabitchok",
      "created": 1552845893,
      "upvotes": 0,
      "replies": {
        "eir45fv": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eir45fv/",
          "text": "Don't generalise like this, I am a feminist, and this is not what the movement stands for",
          "author": null,
          "created": 1552852679,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eiqe08b": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiqe08b/",
      "text": "Accuse the woman that made the petition of sexual misconduct.\n\nProblem solved.\n\n&#x200B;",
      "author": null,
      "created": 1552833471,
      "upvotes": 1,
      "replies": {}
    },
    "eiq9ogy": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiq9ogy/",
      "text": "object to it in your chat group. tell peoğle its wrong to suspend people for just being accused.",
      "author": "14b755fe39",
      "created": 1552829727,
      "upvotes": 2,
      "replies": {
        "eiq9y9v": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiq9y9v/",
          "text": "I have sent a few longer messages, but the people arguing out of emotion just ignore them, or nitpick one point \n\n\nThe groupchat has quieted down now, but the petition is still getting signatures. I am sending some emails to higher ups ",
          "author": null,
          "created": 1552829963,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eipzoha": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipzoha/",
      "text": "Find a way to get that shit shut down or else half of the college will be empty because everyone will accuse each other left and right.",
      "author": "Ironwarrior29",
      "created": 1552816376,
      "upvotes": 1,
      "replies": {}
    },
    "eipqlqr": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipqlqr/",
      "text": "Technically it isn't illegal, as a university isn't a court of law and since a university is mostly a business, they are within their rights to throw you out even if you aren't guilty of anything and there isn't much you can do about it. That being said, it isn't like it's the end of the world, if you're suspended or expelled you can simply transfer to a different college, and while you won't be able to hang out with your friends other than that it won't effect you. \n\nIt won't effect your job opportunities as employers are looking for work experience. In the workplace it is all about your experience in the workforce, a university graduate is worthless as while a degree will tell them you know the information, you don't have any experience applying it and using it in a workplace setting, so as far as they know they will have to teach you from the ground up. As worthless as a degree is, obviously your grades, what school you went to, and any trouble you managed to get in really doesn't matter. Since you're fresh out of college, you're pretty much worthless and a student who went Harvard and got straight A's is the same in their eyes as someone who went to podunk college and got C's.",
      "author": "ChaosOpen",
      "created": 1552802089,
      "upvotes": 2,
      "replies": {}
    },
    "eipiv8h": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipiv8h/",
      "text": "Seriously messed up. It’s like burning people at the steak for being a witch. So messed up. Prove what is accused first. Accusations can ruin lives.\n\n& frankly, ya can blatantly suspend males for being accused, the same moment women are a suspended for sexual misconduct/assault, etc. If ya wanted to be a one sided society, despite past generations history of actions, this is the way to do it. The pendulum swings to the other side of the spectrum.",
      "author": "Bullen-Noxen",
      "created": 1552793646,
      "upvotes": 1,
      "replies": {}
    },
    "eipi3ei": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipi3ei/",
      "text": "You just need video content from the girl sent to the cloud every time you have sex. That is all that there is to this.\n\n&#x200B;\n\nNo video record = no consent = no sex.",
      "author": "Nude-eh",
      "created": 1552792895,
      "upvotes": 1,
      "replies": {}
    },
    "eiphy1v": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiphy1v/",
      "text": "Recently, a student organization at my school started a list where anyone could add a name of a sexual predator, and then those people would be unable to attend certain events, parties etc. (as in, students enforcing the list would literally stop a person from entering the event). It's such a scary precedent to set. Democracy without legal processes behind it is terrifying--it feels as though mob rule is taking over my campus.\n\nA kid I know was added to the list--no one knows why or who added him, he's in a happy relationship, doesn't drink or attend parties, but now all of a sudden people tell me to stay away from him because he's a perpetrator. It's absolute slander--who the fuck are we as a student body to judge a persons entire existence based upon one anonymous student report to a student organization?!",
      "author": null,
      "created": 1552792751,
      "upvotes": 8,
      "replies": {
        "eipvrsf": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipvrsf/",
          "text": "Holy shit that's even worse, that's some slander right there",
          "author": null,
          "created": 1552809555,
          "upvotes": 4,
          "replies": {
            "eipw6r7": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipw6r7/",
              "text": "Yeah. It's really bad. I'm kind of going insane with the culture here. Best of luck to you with your school's situation",
              "author": null,
              "created": 1552810272,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "eitpuua": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eitpuua/",
          "text": "Honestly, the only way to tackle this is to add the names of the \"enforcers\" to that list. Eventually everyone realises that list is pretty stupid. ",
          "author": "TotallyNotTheRedSpy",
          "created": 1552938670,
          "upvotes": 2,
          "replies": {
            "eity8jg": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eity8jg/",
              "text": "I think most people are against the list, but don't realize that it's still influencing them. Admin came out against it quite firmly, which was refreshing--I don't think it exists anymore. But yeah, that's not a bad idea actually...",
              "author": null,
              "created": 1552944752,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "eiv32mt": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiv32mt/",
          "text": "\"Shitty media men list\" college edition. ",
          "author": "whoAreYouToJudgeME",
          "created": 1552981900,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eip9p9j": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip9p9j/",
      "text": "Start accusing the signatories.",
      "author": "booyah2",
      "created": 1552785397,
      "upvotes": 1,
      "replies": {}
    },
    "eip60f0": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip60f0/",
      "text": "Petitions only call attention to something, they don't actually mean that something gets implemented. I don't believe the petition will have any real affect, but the voice of the people can be very powerful. \n\n&#x200B;\n\nIf I were you, I'd write an email to a higher up and explain what's going on and why you think that may be a bad idea. If you're really concerned try to find other's with similar opinions and contact those higher ups.",
      "author": "RaNDoM123SaLAd",
      "created": 1552782415,
      "upvotes": 2,
      "replies": {}
    },
    "eip5bat": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip5bat/",
      "text": "Let the petition go through. Have a bunch of men accuse women. Watch them get suspended. Have some tea.",
      "author": "hakoonamatata9",
      "created": 1552781851,
      "upvotes": 1,
      "replies": {}
    },
    "eip0pye": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip0pye/",
      "text": "Guys. Don't have sex in college unless with your girlfriend. \n\nSo many crazies out there looking for attention and to ruin lives. \n\n",
      "author": "JumpyPorcupine",
      "created": 1552778360,
      "upvotes": 0,
      "replies": {
        "eip1mhj": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip1mhj/",
          "text": "That seems a but extreme, you can't let it affect your student life do badly right? Chances of it happening to you are still slim, even though when it happens it is horrible ",
          "author": null,
          "created": 1552779042,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eioxqeb": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioxqeb/",
      "text": "At some point, people are going to have to ask how many of these accusations were just women covering up their cheating or shame. ",
      "author": "ThrowawayGhostGuy1",
      "created": 1552775939,
      "upvotes": 1,
      "replies": {}
    },
    "eiot73s": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiot73s/",
      "text": "Get her name and anonymously accuse her of sexual misconduct.\n\n",
      "author": null,
      "created": 1552772250,
      "upvotes": 0,
      "replies": {}
    },
    "eiormpy": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiormpy/",
      "text": "This girl needs to understand that people are innocent until proven guilty... emphasis on the *proven.* Just because she says something happened does not make it true.\n\nSadly though, it seems like people take the girls side in these situations (whether she was the assaulter or the one being assaulted or neither and just made it all up).\n\nIf I was your friend I would try to have a private conversation with the girl and get to the bottom of it. Honestly, saying sorry and being super sincere may diffuse the situation (if your friend is actually innocent). Often these kinds of people just want to know that they are heard and that you are sorry. Have a rational talk, do not accuse her of anything, but try to see her point of view so it can be refuted.\n\nThat being said, I also think you and your friend need to talk. The truth is, as someone else mentioned, false accusations are pretty rare ( or at least based on some form of truth). Do not go to bat for your friend just because \"he's a really great guy and said he did not do it.\" This could put you in a bad place as well. So I would keep my distance from the situation, if I were you. ",
      "author": null,
      "created": 1552771060,
      "upvotes": 1,
      "replies": {
        "eiowge0": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiowge0/",
          "text": "I have talked in depth with him about what happened and what he could have done that made her feel this way, running through the nights step by step. Unless he is outright lying to me, which I would find very hard to believe, he didn't do anything without consent. \n\n\n\nI also recommended talking to her, maybe with a neutral 3rd party as a mediator. However she already went to the police, and speak rumors, so it's unlikely that's still a possibility",
          "author": null,
          "created": 1552774863,
          "upvotes": 1,
          "replies": {
            "eip7nc9": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip7nc9/",
              "text": "Oh ok, I was not trying to accuse you of anything! Hopefully it did not come across that way!",
              "author": null,
              "created": 1552783736,
              "upvotes": 1,
              "replies": {
                "eipvsm6": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipvsm6/",
                  "text": "You didn't, don't worry :)",
                  "author": null,
                  "created": 1552809592,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "eiorcyk": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiorcyk/",
      "text": "If that were to happen, people could just accuse the smartest students in class of sexual misconduct to lower the curve... I mean coupled with the fact that it would just be wrong in general, this could have horrible consequences.",
      "author": "real-live-adult",
      "created": 1552770848,
      "upvotes": 9,
      "replies": {}
    },
    "eiopbr0": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiopbr0/",
      "text": "She’s calling for suspension not expulsion. I think her call to action is fair. If no one didn’t do anything, they don’t have anything to worry about right? \n\nIf she’s making false accusations, have peace in knowing her time will come. People who make false police reports usually serve time in prison and get a record.\n\nBut as a sexual assault victim of assault and rape, I can empathize with her on making sure her voice is heard and her perpetrators are held accountable. Don’t mix with the wrong crowd next time if you don’t want to be involved in a mess. ",
      "author": null,
      "created": 1552769301,
      "upvotes": 1,
      "replies": {
        "eioxwkq": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioxwkq/",
          "text": "[deleted]",
          "author": null,
          "created": 1552776081,
          "upvotes": 2,
          "replies": {}
        },
        "eirwqxi": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eirwqxi/",
          "text": "You are an idiot. Lost of a semester/s and your name being dragged thru the mud is not something that should happen if you are innocent. Look at what happened with Johnny Depp. He lost acting jobs and got lambasted by everyone, only to find out she was the perpetrator. We live in the US, innocent until proven guilty. ",
          "author": "foxleader81",
          "created": 1552874779,
          "upvotes": 2,
          "replies": {}
        },
        "eior687": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eior687/",
          "text": "Still, a 6 month suspension just for being accused? That gives a lot of power, and could easily be abused to suspend people",
          "author": null,
          "created": 1552770706,
          "upvotes": 2,
          "replies": {}
        },
        "eiovzr6": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiovzr6/",
          "text": "Nothing to worry about except a semester or two taken away from you and your name permanently being associated with sexual assault.\n\n“Don’t mix with the wrong crowd...” is exactly what people tell sexual assault victims. How is this any better?",
          "author": "emma6939",
          "created": 1552774469,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eioomoi": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioomoi/",
      "text": "I would only agree if the accuser was suspended as well.",
      "author": "Litheism",
      "created": 1552768737,
      "upvotes": 0,
      "replies": {}
    },
    "eiooa70": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiooa70/",
      "text": "\"Accused\" not \"convicted \" \n\nThis is how far the MeToo movement has gone to.",
      "author": "Anonymously_Aroused",
      "created": 1552768451,
      "upvotes": -1,
      "replies": {}
    },
    "eionlo5": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eionlo5/",
      "text": "That's a stupid petition. It just boasts the idea that we should presume guilt without evidence. The justice system tells us an accused individual is \"Innocent until proven guilty\", not \"Guilty until proven innocent.\". ",
      "author": "samicmalik",
      "created": 1552767877,
      "upvotes": 1,
      "replies": {
        "eioo1a2": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioo1a2/",
          "text": "It definitely is, which is why I want to get some advice on how to proceed",
          "author": null,
          "created": 1552768243,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eionhwa": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eionhwa/",
      "text": "Get your hands on the petition, make copies and circulate it to employment agencies with a warning:\n\n\"Hiring any of these individuals may result in financial hardship and legal expenses for your organization.\"\n\nAlso, avoid everyone on that list unless you enjoy pain.\n",
      "author": "mgtow-zen",
      "created": 1552767790,
      "upvotes": 4,
      "replies": {}
    },
    "eiola6o": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiola6o/",
      "text": "I hearby accuse everyone in your college of groping me.",
      "author": "Men-Are-Human",
      "created": 1552765992,
      "upvotes": 10,
      "replies": {
        "eip4rxx": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip4rxx/",
          "text": "If you do that and the professor grades on a curve do you automatically pass? ",
          "author": "Aaod",
          "created": 1552781429,
          "upvotes": 7,
          "replies": {
            "eiq5drb": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiq5drb/",
              "text": "Since only the students are left.... yes! Everybody gets a masters degree in being awesome! :D",
              "author": "Men-Are-Human",
              "created": 1552825165,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "eiokyl2": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiokyl2/",
      "text": "Accuse everyone you walk past/dislike of sexual misconduct, then according to their own rules they have to be suspended until a verdict is reached, which could take months or years, so if you make sure everyone directly involved gets accused and suspended, they’ll likely call it off because “I wasn’t talking about *me* I was talking about everyone else?”",
      "author": "microgroweryfan",
      "created": 1552765731,
      "upvotes": 3,
      "replies": {}
    },
    "eiokvun": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiokvun/",
      "text": "This is obviously not going to happen, it would be a huge overreaction. I reccomend staying out of it so you don't end up in trouble or connected in any way. But if you would like to take a stand against it, I would suggest finding out if it isn't possible to be involved in the conversation if a conversation about this ever happens. \n\nAs for your friend. I'm going to be downvoted to hell for this, but false accusations are not very common despite the nonsense and cherry-picked studies you read on reddit. I can talk about this forever if you like, but that isn't the point of what I am trying to say. \n\nStatistically it is more likely your friend might actually be guilty. I don't think you're a bad judge of character, and I don't actually think your friend is guilty. I don't know what happened and I wasn't there. But the reason rapists so often go free is because the people around them absolutely refuse to even consider the possibility that a person they know did something wrong. I want you to take a long look at the situation with unbiased eyes and maybe even ask other unbiased people for their opinions on the details of what your friend says happend vs what the accuser says happened. \n\nThe reason I say this is because if your friend is guilty, you going to the college to speak on his behalf will look very bad. You have an understandable worry here with petetions to suspend people, but if you use your friend as a motivation for this it would absolutely backfire. Either don't mention him if you choose to be involved, and make sure people won't find out about it, or decide for yourself whether or not you can trust what he's told you and go from there.  ",
      "author": "bubblegumpandabear",
      "created": 1552765670,
      "upvotes": 7,
      "replies": {
        "eiowpm0": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiowpm0/",
          "text": "I've talked through what happened that night with him step by step, so unless he is stonecold lying to my face, which I doubt because I do trust him and I've never seen him lie about anything, not even trivial stuff, he didn't do anything unconsensual. But it definitely is worth considering",
          "author": null,
          "created": 1552775081,
          "upvotes": 1,
          "replies": {
            "eip2h8y": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip2h8y/",
              "text": "Ok, then I reccomend keeping your involvement with him quiet if you decide to speak up against the petition. It will only be seen as you standing up for your friend who is in trouble and will stir up more craziness for you. ",
              "author": "bubblegumpandabear",
              "created": 1552779688,
              "upvotes": 6,
              "replies": {
                "eip2xdn": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip2xdn/",
                  "text": "That's a good point!",
                  "author": null,
                  "created": 1552780024,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "eioigau": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioigau/",
      "text": "God damn SJWs and the fucking liberals. ",
      "author": "WhitE-TightE",
      "created": 1552763796,
      "upvotes": -5,
      "replies": {}
    },
    "eiohtzt": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiohtzt/",
      "text": "we want more men to college.University needs fresh meat for cannon fodder.",
      "author": "user_miki",
      "created": 1552763334,
      "upvotes": -2,
      "replies": {}
    },
    "eiof98u": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiof98u/",
      "text": "This really begs the question: who makes it to college never having read To Kill a Mockingbird?",
      "author": "f33dmewifi",
      "created": 1552761409,
      "upvotes": 30,
      "replies": {
        "eiosqc8": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiosqc8/",
          "text": "There is no shortage of morons in college. ",
          "author": "TheRabbitTunnel",
          "created": 1552771901,
          "upvotes": 8,
          "replies": {}
        },
        "eiou7x2": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiou7x2/",
          "text": "He's from Europe, I imagine it's not nearly as common over there as it is here.",
          "author": "Razgriz01",
          "created": 1552773029,
          "upvotes": 9,
          "replies": {}
        },
        "eiogbcs": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiogbcs/",
          "text": "It is still on my way too long 'to read' list sadly enough. It was never in the mandatory reading in my high school (although some really good books were)",
          "author": null,
          "created": 1552762198,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eiof63p": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiof63p/",
      "text": "Guilty until proven innocent ",
      "author": "jdent77",
      "created": 1552761344,
      "upvotes": 1,
      "replies": {}
    },
    "eiof0qf": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiof0qf/",
      "text": "For a young man, going to University is like walking into a mine field. The advantage is that the mines are literally every person there that has a vagina so they're easy to identify. But, you still need to be careful where you step. \n\nWhile you're there, avoid contact with any female that falls outside of the classroom and study groups. Keep everything professional. The women in your class will attempt to character assassinate once they realize that you're not giving them power over you by attempting to date or have consensual sex with them. They'll likely label you an incel or homosexual. That's ok. \n\nThat's fine. Wear it like a badge of honor. Do your partying off campus at unaffiliated residences/bars/whatever.\n\nIf you want to date/have sex find yourself a woman that is 15 - 20 years your senior. Date her while you're going to college. She'll eagerly satisfy all of your carnal needs on demand. She'll pay for most of your dates. She'll also act as a mentor to you and generally have your best interests at heart. Dating a significantly older woman is a completely different dynamic than dating one of your contemporaries. She wants you for sex. She knows you want her for sex. There's little worry about the \"future\" because her life is likely already established and she's using you for physical satisfaction as much as you are her. Each encounter is purely for the enjoyment of the moment. Neither person has the expectation of making a life long partner out of the other so that dynamic is not there there way it is with your contemporaries. ",
      "author": "U21U6IDN",
      "created": 1552761235,
      "upvotes": -9,
      "replies": {
        "eiog33z": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiog33z/",
          "text": "Ehhh, that is a bit extreme. I am dating and sleeping with people my age and never felt threatened by this. I won't let it disturb my student life that much.\n\nAs far as I know there are only 2 people accused at my uni right now, one could very well be legitimate (I do not now the details, it is the one that started the petition) and the other one is my friend. So it definitely isn't as extreme as it might sound because of this stupid petition!\n\n\nAlthough it could be that more cases are being kept close to the chest",
          "author": null,
          "created": 1552762026,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "eiocht9": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiocht9/",
      "text": "> accused\n\n\ntell her that accused != proven guilty?",
      "author": "balne",
      "created": 1552759371,
      "upvotes": 5,
      "replies": {}
    },
    "eio9bos": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio9bos/",
      "text": "Maybe make a counter petition. Instead of waiting on the legal system, many schools will have their own hearing by a board to determine if the claim has any merit. It's a lesser standard in most places than the \"proof beyond a reasonable doubt\" criminal standard because being suspended from school for a time is a lesser punishment than going to jail and being put on a sex offender list for the rest of their life.\n\nSchools do have the right to protect their students and don't have to follow most due process rights. (Right to a hearing and notice of the accusations)\n\n",
      "author": "InTooDeepButICanSwim",
      "created": 1552756956,
      "upvotes": 1,
      "replies": {}
    },
    "eio8v4v": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio8v4v/",
      "text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/mensrights] [I’m a male college student right now and this kind of stuff is so scary.](https://www.reddit.com/r/MensRights/comments/b1uqxn/im_a_male_college_student_right_now_and_this_kind/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "author": "TotesMessenger",
      "created": 1552756600,
      "upvotes": 0,
      "replies": {}
    },
    "eio8hqu": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio8hqu/",
      "text": "They really should watch the documentary called Fantastic Lies. Honestly, in the US some universities do have a policy where being accused of rape can get you expelled, which is stupid considering the fact that not all accusations are true. I don't get why somebody would falsely accuse somebody. I guess it would come from a deep hatred, but I really just can't believe somebody could be so sadistic to ruin somebody's life like that. I mean even when the accusations are proven to be false, the person's reputation remains the same, and their life remains ruined. It just isn't right. Honestly, if you're going to falsely accuse somebody of committing such a heinous act against you, you clearly have no humanity. Whether it's online, to the police, or the media, you're one fucked up individual and there's a very special place in Hell for you. You are ruining lives, and taking credibility away from the true victims, who the majority of the time are already too scared to report rape as it is. So good job, I hope you're happy with the type of person you are.",
      "author": "gonzaliz",
      "created": 1552756309,
      "upvotes": 8,
      "replies": {}
    },
    "eio5utg": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio5utg/",
      "text": "[deleted]",
      "author": null,
      "created": 1552754370,
      "upvotes": 18,
      "replies": {
        "eip0h6s": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip0h6s/",
          "text": "[deleted]",
          "author": null,
          "created": 1552778168,
          "upvotes": 9,
          "replies": {
            "eip3xhv": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip3xhv/",
              "text": "Karen did it",
              "author": "gir6543",
              "created": 1552780785,
              "upvotes": 3,
              "replies": {}
            },
            "eiq464o": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiq464o/",
              "text": "> Who THE FUCK thought passing this law was a good idea?\n\nPoliticians often pass bullshit laws because they either a) barely read it, b) can't politically afford the political fallout from being skeptical of a moral panic.",
              "author": null,
              "created": 1552823581,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "eiobhpo": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiobhpo/",
          "text": "Good idea ",
          "author": "rigbed",
          "created": 1552758625,
          "upvotes": -3,
          "replies": {}
        }
      }
    },
    "eio5oso": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio5oso/",
      "text": "Does anyone not remember mattress girl...? It's like nobody believes false accusations happen.",
      "author": null,
      "created": 1552754250,
      "upvotes": 32,
      "replies": {
        "eio90ch": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio90ch/",
          "text": "I go to Columbia and even here there are still people that unconditionally believe her. Although it’s worth mentioning that like 99% of people don’t care about her anymore, it’s just a crazy small minority. ",
          "author": "Tofon",
          "created": 1552756709,
          "upvotes": 19,
          "replies": {}
        },
        "eiocl8r": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiocl8r/",
          "text": "mattress girl?",
          "author": "balne",
          "created": 1552759442,
          "upvotes": 5,
          "replies": {
            "eiodtpj": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiodtpj/",
              "text": "College student who falsely accused a peer of raping her and then carried her dorm room mattriess that the alleged act took place on around with her to class in protest. ",
              "author": "patmorgan235",
              "created": 1552760364,
              "upvotes": 16,
              "replies": {}
            },
            "eiv3enx": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiv3enx/",
              "text": "Emma Sulkowicz. She accused a boy of sexual assault. He was cleared by college after he provided her friendly texts to him after the said assault happened. Nevertheless, she decided to carry around the mattress on which the \"assault\" happened around the campus as a performance art. She dragged that thing to her graduation too. This all gathered international media attention. The boy then sued the school multiple times for Title IX violation. The school settled with him for undisclosed amount. ",
              "author": "whoAreYouToJudgeME",
              "created": 1552982427,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "eioaewa": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioaewa/",
          "text": "...mattress girl?",
          "author": "windycityfosters",
          "created": 1552757808,
          "upvotes": 7,
          "replies": {
            "eioc8ct": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioc8ct/",
              "text": "google works well",
              "author": "lastlivezz",
              "created": 1552759175,
              "upvotes": 2,
              "replies": {
                "eiocgy3": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiocgy3/",
                  "text": "Come on you know I’m too lazy for that",
                  "author": "windycityfosters",
                  "created": 1552759353,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        },
        "eiobh6l": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiobh6l/",
          "text": "Amen",
          "author": "rigbed",
          "created": 1552758614,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eio3kj8": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio3kj8/",
      "text": "Accuse her",
      "author": "f33dmewifi",
      "created": 1552752714,
      "upvotes": -2,
      "replies": {
        "eio9v4d": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio9v4d/",
          "text": "But only after a policy for this goes into affect.",
          "author": "RacelessSexlessName",
          "created": 1552757383,
          "upvotes": 1,
          "replies": {
            "eioi20e": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioi20e/",
              "text": "I don't expect an actual policy like this, it's only an online petition. However it does bother me that so many people signed this",
              "author": null,
              "created": 1552763497,
              "upvotes": 1,
              "replies": {
                "eioio9w": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioio9w/",
                  "text": "Feels over facts, it's the narrative these days and colleges are dominated by it from the whole Gender Studies departments that wage war on everything else that is normal.  Welcome to the results of opening the floodgates of feelings being more important than anything else and being different/freak/whatever makes you special and when everyone is special... no one will be special.",
                  "author": "RacelessSexlessName",
                  "created": 1552763960,
                  "upvotes": -5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "eio2phk": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio2phk/",
      "text": "this is absolutely ridiculous. I understand her frustration but if it is implemented it could ruin many people’s lives. ",
      "author": "bleedingacrobat",
      "created": 1552752085,
      "upvotes": 15,
      "replies": {}
    },
    "eio2h3d": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio2h3d/",
      "text": "This is the main issue that has plagued campuses around the country.\n\nA minority of college students feel emboldened by social media and political revolutions to engage on subjects that harm the basis of life, liberty, and overall democratic society. \n\nInnocent till proven guilty.\n\nWhy should someone lose 6 months of their life and education for a false accusation. By the end of that ordeal, the falsely-accused would be the real victim in pursuit of actual justice, an ordeal that will come with continuous emotional strains. \n\nI do not know the specificities of her case, but even though a petition in general is legal, her actions can be construed as intimidation and should refrain from attempting to publicize/defame the accused. If he is found not guilty, he rightfully has the option of suing for defamation.",
      "author": "Vestibuleskittle",
      "created": 1552751916,
      "upvotes": 38,
      "replies": {
        "eio5dp1": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio5dp1/",
          "text": "[deleted]",
          "author": null,
          "created": 1552754027,
          "upvotes": 8,
          "replies": {
            "eio65w8": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio65w8/",
              "text": "The same principles indoctrinated into our justice system are meant to act as fundamentals for our society, in criminality or otherwise. The devil’s advocate position doesn’t add to the discourse, but merely amplifies her unjust position whether you truly do feel otherwise or not. ",
              "author": "Vestibuleskittle",
              "created": 1552754584,
              "upvotes": 0,
              "replies": {}
            },
            "eioi1b1": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioi1b1/",
              "text": "Yes.  It’s already that bad and this petition aims to make it even worse.",
              "author": "PanderjitSingh_k",
              "created": 1552763483,
              "upvotes": -1,
              "replies": {}
            }
          }
        },
        "eio2xap": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio2xap/",
          "text": "Also the crucifixion that comes with the accusation. I can guarantee even if they're found innocent they'll always be remembered as \"that guy who was accused of sexual assault\"",
          "author": "SquiffyRae",
          "created": 1552752246,
          "upvotes": 20,
          "replies": {}
        },
        "eio324e": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio324e/",
          "text": "She didn't mention the guy she accuses by name, referring to him as X in the petition, which is at least professional\n\n\nBut if he does get suspended it'll probably come out, even if he turns out to be innocent ",
          "author": null,
          "created": 1552752343,
          "upvotes": 9,
          "replies": {
            "eio3dsj": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio3dsj/",
              "text": "It’s a college campus. This “anonymity” she is attempting to create within the petition is downright BS. There are millions of ways that people will know who is being implied, if they aren’t already (which is highly doubtful) \n\nIf she has informed  any of her peers on the accused identity, she has already engaged in hypocrisy and more importantly slander. ",
              "author": "Vestibuleskittle",
              "created": 1552752580,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "eipn37l": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipn37l/",
          "text": "This is such a clear example of availability bias that plagues reddit every time this subject is brought up. Yes false accusations happen, but reddit seems to focus so much on the rare instances they occur that in a lot of minds they seem common. In truth, false accusations account for a tiny amount of sexual assault cases, nevermind the mindblowing number of sexual assaults that are never reported. Innocence until proven guilty is important, but lets not let biases cause us to jump straight to victim-blaming.\n\nAlso, no, this isn't \"the main issue that has plagued campuses around tre country.\" The main issue is sexual assault.",
          "author": "Joetato14",
          "created": 1552798035,
          "upvotes": 0,
          "replies": {
            "eiprllh": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiprllh/",
              "text": "No one has disputed the minority of which false accusations make up in reporting.\n\nNo one is denying the horrid statistics detailing the prevalence of sexual assault/harassment on college campus.\n\nBut your comment embodies the exact issue that I have detailed in my original comment. Individuals such as yourself are so determined to see a social-Issue addressed and corrected that they neglect to view the consequences to their actions just because it hinders their vision for justice.\n\nJust because the false accusations are a minority, doesn’t mean that they are nonexistent or nor worthy of addressing. No one should have to have the start of their life ruined or dragged in the mud because of a false accusation. It is beyond immoral to say it’s ok or that it’s just a result of justice for that to happen. \n\nWhatever assault may have occurred should be determined to be true or false by the criminal justice system. Just as she maybe wouldn’t like if  the accused in question started a petition saying bar/ban all accusers from campus or campus-activities during an investigation, she shouldn’t seek more publicity and/or undue influence on the matter to occur, ultimately tainting the criminal justice system she supposedly supports. \n\nOn your ridicule of the main campus issue portion of the original comment, there is without a doubt a despicable rise in relentless, unwarranted, and illogically-dangerous protests and cultures developing on campuses throughout the country that degrades the open-forum to which college is meant to function as. These same advocates, SJWs, etc. reject the free speech of others and the presence of facts alike the far-right when they follow feelings instead of logic in shunning people without proper review of their background and views. These same menaces believe that their stances are absolute truths and therefore seek to ban the attendance of speakers that challenge such undeniably biased views through tense protests and chaos. \n\nAlike the minority of cases you mentioned in regards to false-accusers, these same individuals I describe as a minority as well matter and must be addressed promptly and adequately because they matter, even if their population is small. \n\nThat’s a fundamental part of U.S. democracy, we all matter despite controversy or disdain and the only way we function as a community is to engage in proper modes of communication and allow for unabridged justice by the governance we have set in place for the people and by the people. This process in question should not be muddied or scrutinized without just factual reasoning. ",
              "author": "Vestibuleskittle",
              "created": 1552803362,
              "upvotes": 0,
              "replies": {
                "eiq6jc0": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiq6jc0/",
                  "text": "The issue comes when your first reaction is to question the victim's validity in such a noble pursuit of \"facts and logic\" rather than to empathize with her and accuse the assaulter. This is all too common a theme whenever I see this issue pop up on reddit. Although both are not favorable, the truth is it is so much worse to be sexually assaulted than it is to be falsely accused. Whoever denies this simply has zero empathy and is extremely sheltered from people in the real world.\n\nThe miniscule amount of false accusations are a necessary consequence of the greater culture behind sexual assault. I say this because if we continue to focus on the false accusations, condemning victims and telling them to \"think before they speak,\" then they will seldom accuse their assaulters. Not all sexual assaults are cut and dry, raper rapist, black and white cases. Most come at at least some fault to both parties. Maybe they were both drunk, maybe she was leading him on, but no matter what, if she was sexually assaulted, she was still **sexually assaulted.**But if the culture around sexual assaults is to blame the victim, she will overthink herself. She might say, \"no, I can't come out about this, I did lead him on.\" This can't happen. This means that sexual assaulter gets to continue freely without consequence and without learning from his action. This means that another woman will be subjected to this man.\n\nThis is already the case with a lot of sexual assaults. In many instances women do not report their sexual assaults for the exact reason that they are not confident that they will not receive backlash for an action as simple as **reporting their own rape.** If this isn't a human rights violation I don't know what is. ",
                  "author": "Joetato14",
                  "created": 1552826571,
                  "upvotes": 1,
                  "replies": {
                    "eiqcf6g": {
                      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiqcf6g/",
                      "text": "Not wasting my time to discuss any further because you yet again continue to misconstrue details that you are either too ignorant or illogical to comprehend. ",
                      "author": "Vestibuleskittle",
                      "created": 1552832123,
                      "upvotes": 2,
                      "replies": {
                        "eiqdp6g": {
                          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiqdp6g/",
                          "text": "Haha okay buddy nice talking to you",
                          "author": "Joetato14",
                          "created": 1552833212,
                          "upvotes": 0,
                          "replies": {
                            "eiqe3rn": {
                              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiqe3rn/",
                              "text": "Not your buddy and wouldn’t wish anyone to be seeing your ill-informed logic. \n\nGood luck in Elementary School, rooting for you! ",
                              "author": "Vestibuleskittle",
                              "created": 1552833552,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "eio1ftl": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio1ftl/",
      "text": "Are you in the US?  If so, look at your college's Title IX policy & procedures.  They are federally mandated and have very specific requirements for the rights of the accused as well as those of the accuser.  Also your college will have a Title IX coordinator whom you can talk to about your specific questions.",
      "author": "CursorTN",
      "created": 1552751161,
      "upvotes": 74,
      "replies": {
        "eio29tv": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio29tv/",
          "text": "I'm in the Netherlands ",
          "author": null,
          "created": 1552751769,
          "upvotes": 38,
          "replies": {
            "eiob7bz": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiob7bz/",
              "text": "Where in the Netherlands? I’m worried this might concern me actually. This is batshit crazy, we all know how dutch students are and I’m 100% certain your friend got fucked over... \n\nGood luck",
              "author": "herolf",
              "created": 1552758408,
              "upvotes": 22,
              "replies": {
                "eiod2pw": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiod2pw/",
                  "text": "I'd rather not give more details, our country is small enough as it is. As a Dutch student, yes, we are crazy",
                  "author": null,
                  "created": 1552759807,
                  "upvotes": 12,
                  "replies": {}
                }
              }
            },
            "eipl8q8": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eipl8q8/",
              "text": "Also in our country the principle of innocent until proven guilty stands. Mere accusations should not lead to suspensions. See if you can talk to someone in student relations about your concerns. ",
              "author": "a-man-from-earth",
              "created": 1552796089,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "eio4lkn": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio4lkn/",
          "text": "> They are federally mandated and have very specific requirements for the rights of the accused as well as those of the accuser.\n\nI don't think DeVos's new rules have gone into effect yet, which means there's virtually no protection for the accused.",
          "author": "bl1y",
          "created": 1552753457,
          "upvotes": 10,
          "replies": {}
        },
        "eio2boz": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio2boz/",
          "text": "Title IX coordinators are always uber feminists who don't give a rats ass about anyone with a penis.\n\nEdit: it also says on the post that this is Europe.",
          "author": "grahamalondis",
          "created": 1552751807,
          "upvotes": -25,
          "replies": {
            "eiph1zl": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiph1zl/",
              "text": "Found the incel",
              "author": "WeastofEden44",
              "created": 1552791901,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "eio1c3v": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio1c3v/",
      "text": "Maybe I'm wrong, my wife tell me I am often, but a petitions purpose is only to ensure an issue gets heard my the administration, it doesn't automatically make things \"written in stone\" policy.\n\n\nI think that's an important distinction when moving forward with this. Make sure you keep your eye on it and make an effort to maybe address it with someone who might matter in these types of issues. ",
      "author": "HisMajestytheSquid",
      "created": 1552751082,
      "upvotes": 379,
      "replies": {
        "eio27mf": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio27mf/",
          "text": "It's absolutely not binding, but it has 600 signatures now, which is really worrying to me. I get that people want to support her, but this is not the way to do it \n\n\nEDIT: 763 signatures now",
          "author": null,
          "created": 1552751726,
          "upvotes": 136,
          "replies": {
            "eio2h6t": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio2h6t/",
              "text": "Make an opposing petition with a clear argument. Try to make it clear that you are supportive of victims of abuse but that innocent until proven guilty is a protection against false accusations.",
              "author": "peregrin5",
              "created": 1552751919,
              "upvotes": 114,
              "replies": {
                "eiocjmz": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiocjmz/",
                  "text": "it sounds good in words, but be careful that this doesnt kill OP's social life as OP gets rep of 'protecting rapists'",
                  "author": "balne",
                  "created": 1552759409,
                  "upvotes": 105,
                  "replies": {
                    "eiofr2v": {
                      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiofr2v/",
                      "text": "My friends warned me as well, people are very emotional, and some have already told me I have no respect for the victims by taking this stance, but they are the exception, not the rule",
                      "author": null,
                      "created": 1552761776,
                      "upvotes": 59,
                      "replies": {
                        "eiognoj": {
                          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiognoj/",
                          "text": "There's probably no way to adopt the stance you have without people assuming you're protecting rapists. Honestly. I agree with what you said but the way people just make assumptions about everything, there's just no way enough people would think rationally about something so controversial",
                          "author": "LiarVonCakely",
                          "created": 1552762451,
                          "upvotes": 31,
                          "replies": {
                            "eiogwt9": {
                              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiogwt9/",
                              "text": "The real problem is people just skimming the petition and arguments, feeling sorry for potential victims and based on that take a stance. And then they won't be dissuaded from there again, ignoring the possibility of false accusations!",
                              "author": null,
                              "created": 1552762636,
                              "upvotes": 14,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "eiohaan": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiohaan/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1552762922,
                  "upvotes": -6,
                  "replies": {
                    "eioldkh": {
                      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioldkh/",
                      "text": "That's a huge, and likely false, assumption. More likely, the people signing the petition are just getting riled up because of the mob mentality. People are more likely to believe the person who comes out with the story first. That means, often there's a lot of ire and anger towards the accused which stands even after they're proven innocent.",
                      "author": "lacrimosa122",
                      "created": 1552766069,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "eio2m8p": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio2m8p/",
              "text": "I can see how it's concerning if that's how the petition is worded but like I said, it only means to have the administration look at an issue. There is still plenty of time for the administration to compromise and make it feel a little less like an attack against the accused.\n\n\nBesides, there are laws that prevent stuff like violations of people's right to due process.",
              "author": "HisMajestytheSquid",
              "created": 1552752018,
              "upvotes": 20,
              "replies": {
                "eio2xq5": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio2xq5/",
                  "text": "That is true, but what bothers me most is how easily people went with this, and how angry some people got at me for saying we shouldn't punish people before they're found guilty ",
                  "author": null,
                  "created": 1552752255,
                  "upvotes": 19,
                  "replies": {
                    "eio33f5": {
                      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio33f5/",
                      "text": "People get worked up about things and sometimes lose the ability to rationalize the differing opinions of others. Be it confirmation bias or something else the best thing to do is make your point and move on with your life.\n\n\nIf they're not willing to listen you're not going to change their mind.",
                      "author": "HisMajestytheSquid",
                      "created": 1552752371,
                      "upvotes": 11,
                      "replies": {
                        "eioeuno": {
                          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioeuno/",
                          "text": "Yeah, I wonder if those people would be fine with also being suspended for 6 months or until the case ends for making a accusation, if not its more fucked.",
                          "author": "jump101",
                          "created": 1552761112,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    },
                    "eio3e0p": {
                      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio3e0p/",
                      "text": "I am with you there",
                      "author": "PersephoneIsNotHome",
                      "created": 1552752584,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                },
                "eiohoz2": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiohoz2/",
                  "text": "\"...make it *feel* less like an attack...\"\n\nOh that’ll help.  \n\nThere are countless cases of school policies punishing people without due process.  They generally are not required to follow criminal court standards.",
                  "author": "PanderjitSingh_k",
                  "created": 1552763233,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "eiobeel": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiobeel/",
              "text": "Instead of worrying all over, you could just accuse her, and petition for other people to accuse her.",
              "author": "Stanley_224",
              "created": 1552758555,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "eio0v3o": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio0v3o/",
      "text": "Geez whatever happened to innocent until proven guilty ? Hmmm. ",
      "author": "FluffyCorgis",
      "created": 1552750729,
      "upvotes": 30,
      "replies": {
        "eio1kvo": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio1kvo/",
          "text": "Its never existed.",
          "author": "Mayday9158",
          "created": 1552751268,
          "upvotes": 7,
          "replies": {}
        },
        "eio62b3": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio62b3/",
          "text": "That was officially thrown out the window with kavanaugh. ",
          "author": null,
          "created": 1552754515,
          "upvotes": -8,
          "replies": {
            "eiohrrb": {
              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiohrrb/",
              "text": "Kavanaugh is now sitting on the Supreme Court. What are you talking about ",
              "author": "chloapsoap",
              "created": 1552763290,
              "upvotes": 19,
              "replies": {
                "eiois1t": {
                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiois1t/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1552764039,
                  "upvotes": -7,
                  "replies": {
                    "eioj534": {
                      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioj534/",
                      "text": "He was given the presumption of innocence by everyone who matters. He’s not in prison. Far from it, in fact\n\nI personally find him suspect. He was clearly lying in several parts of his examination. But I have absolutely no say, so what does it matter what I think?",
                      "author": "chloapsoap",
                      "created": 1552764318,
                      "upvotes": 17,
                      "replies": {}
                    },
                    "eiom1hc": {
                      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiom1hc/",
                      "text": "Innocent until proven guilty is a court thing.\n\nThe public can do literally whatever the hell it wants.",
                      "author": "Whimsyprincess",
                      "created": 1552766617,
                      "upvotes": 9,
                      "replies": {
                        "eioozit": {
                          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eioozit/",
                          "text": "> The public can do literally whatever the hell it wants.\n\n\nThat is obvious, but not the point. Their argument is that they shouldn’t do ‘whatever the hell they want’. And that person is right.\nAdvocating for a society without principles or morals is insane and when the pendulum swings in a way that you don’t like it, it will come back to bite you too.",
                          "author": "Regencyflw",
                          "created": 1552769030,
                          "upvotes": -3,
                          "replies": {
                            "eiot1n5": {
                              "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eiot1n5/",
                              "text": "People are imperfect. Some people had one interpretation of the situation. Others had a different interpretation. Writing it off as “advocating for a society without principles or morals” is a ridiculous way of framing this conversation. Your perspective on this is not in keeping with reality",
                              "author": "chloapsoap",
                              "created": 1552772138,
                              "upvotes": 3,
                              "replies": {
                                "eip0ojl": {
                                  "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eip0ojl/",
                                  "text": ">The public can do literally whatever the hell it wants.\n\nMy original post remains fairly consistent with reality, although we can switch out ‘advocating’ with ‘permissing if we want to be perfect. In doing so, the argument holds merit as the premise surrounding morals and principles still stands.",
                                  "author": "Regencyflw",
                                  "created": 1552778328,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "eio0i6y": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio0i6y/",
      "text": "Petitions like this are definitely legal. However talk to the department about this growing issue. As another comment said crosspost on r/LegalAdvice. ",
      "author": "JTJWarrior_3",
      "created": 1552750451,
      "upvotes": 114,
      "replies": {}
    },
    "eio06c9": {
      "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio06c9/",
      "text": "Honestly this might get you better advice under r/legaladvice",
      "author": "Brownie_McBrown_Face",
      "created": 1552750206,
      "upvotes": 46,
      "replies": {
        "eio9vuz": {
          "link": "/r/college/comments/b1sq05/someone_in_my_college_made_a_petition_to_suspend/eio9vuz/",
          "text": "I didn’t know why, but I assumed I was in that sub when I read the title of this post ",
          "author": "sal1220",
          "created": 1552757399,
          "upvotes": 4,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054911
}