{"sid": "mmdid6", "link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/", "title:": "What are some dorming tips you’d give incoming freshmen?", "text": "In the fall, a lot more of us are going to be able to return to housing or do it for the first time. What’s some tips you’d give new residents? For me:\n\n1. Don’t just room with your friend because. You might have totally different schedules or habits.\n\n2. Communication is everything. \n\n3. You might not make friends with your roommate but that doesn’t mean you can’t be polite to them.", "author": "CapriciousSalmon", "created": 1617834053, "retrieved": 1632947815, "over_18": false, "upvotes": 788, "upvote_ratio": 0.99, "comments": {"gu31t0l": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gu31t0l/", "text": "Buy a fan. It will be smelly, so you want some air circulation. Same goes for if it gets hot and you have no air conditioning. Also, the fan can double as a white noise machine, particularly for at night so you don't have to listen to your roommate sleeping.", "author": "pumpkinator21", "created": 1618090550, "upvotes": 3}, "gtwfnzg": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtwfnzg/", "text": "Don’t do it. They’re overpriced ugly dumps.", "author": "Crazy_Cry_1257", "created": 1617946944, "upvotes": 2}, "gtuqmdu": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtuqmdu/", "text": "Don’t dorm", "author": "Texas43647", "created": 1617914205, "upvotes": 4}, "gtue9t8": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtue9t8/", "text": "Don’t be afraid to eat alone in the dining hall, it’s completely normal! Or even taking food to go to eat in your room.", "author": "Ok-Blueberry-866", "created": 1617908879, "upvotes": 2}, "gttuae5": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gttuae5/", "text": "I really like your first tip! I know many individuals who roomed with their best friends from high school, and those friendships ended because they were unable to live together properly. Just because you are best friends doesn't mean that you will be good roommates. I went random for my roommate and ended up having a great experience but I understand that it not everyone's experience.", "author": "lddesignsorganizer", "created": 1617900347, "upvotes": 3}, "gttrss1": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gttrss1/", "text": "definitely room with your friends....everyone has different schedules", "author": "Chayse_21", "created": 1617899310, "upvotes": 3}, "gttq21c": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gttq21c/", "text": "Realize that at the end of the day, even if you’re going through something terrible or have a lot on your plate, you’re in college and that means people have expectations of you regardless. Everyone has shit to deal with. Sometimes your roommates will be nice and let a couple things slide here and there, but if someone tells you sth they’d like u to change, don’t get offended and have an open mind.", "author": "Oreo-808", "created": 1617898583, "upvotes": 3}, "gttj7mo": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gttj7mo/", "text": "I'm not giving a roomate ☺", "author": "DeclinedFern68", "created": 1617895677, "upvotes": 2}, "gttbji4": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gttbji4/", "text": "Stay clean. Other than that, learn while you live it", "author": "elags69", "created": 1617892279, "upvotes": 3}, "gttb98c": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gttb98c/", "text": "No matter how good of a roommate/neighbour you are, you'll probably end up around at least some people who bother you. So: choose your battles and set your boundaries. There are a lot of annoyances that will just make you miserable if you let them get to you. Complaining about everything might alienate people from you, or you might end up getting passive aggressive – e.g. they might leave puddles outside the shower, let their alarm ring for too long in the mornings, play music you don't like too loud, have boyfriends/girlfriends that you can't stand, etc. That being said -- definitely set your boundaries. Maybe you decide you have to ignore loud music as long as it's before midnight or not during exams, for example, and speak up when it breaks your boundaries. For me, I grew up in a family of professional cleaners and others' standards of cleanliness drove me crazy, even when they said they cleaned up. (e.g. not rinsing dishes, not cleaning the taps when they clean the bathroom, not mopping after they sweep when the floor needs it, etc.) I realized that as long as my roommates are making an effort, if something isn't clean enough for me, I should clean it myself to my own standards rather than letting the problem irritate me until I resent the people around me.", "author": "DrawnInInk", "created": 1617892149, "upvotes": 3}, "gtt9cgu": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtt9cgu/", "text": "Good ear muffs that are comfortable to sleep with", "author": "HelloMyNameIsErnie", "created": 1617891273, "upvotes": 3}, "gtt8vut": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtt8vut/", "text": "Discuss room temperature with potential roommate. I got along with my roommates for the most part but it drove me nuts when she would put the thermostat to 85", "author": "idkthoughso", "created": 1617891058, "upvotes": 2}, "gtt5eoh": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtt5eoh/", "text": "Make sure to leave your dorm!! Even if you're only doing hw or studying, get out and do it at the library or somewhere. Staying in your room will make you feel sad and secluded. \n\nPatience is key. \n\nDon't rely too much on your friends from back home. I did that my first semester and it really stopped me from making new ones, I didn't feel the need bc I was constantly talking to my old ones.", "author": "MajesticFan4", "created": 1617889421, "upvotes": 5}, "gtszql2": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtszql2/", "text": "-If you like coffee, bring a Kureig. You will waste so much cash if you rely on Starbucks, Dunkin, or whatever chain you like. I know that this sounds like boomer advice but unless you have a job or have a very good plan at the Bank of Dad you will need to learn how to manage money.\n\n-People are nasty. If you have communal showers, bring a pair of flip flops to wear in the shower. People will come back to the dorms on the weekends and do some cursed things in those bathrooms.\n\n-The bathrooms will likely have 1 or 2 ply toilet paper. If you can't handle it, bring your own.\n\n-Bring air freshener. I reccomend the ones you plug into the wall. This is not only to make your room smell good but also to protect against your neighbors. One time the guys across the hallway from me hot boxed their room and the whole wing smelled like weed for a day.\n\n-Bring trash bags for your trashcan. It makes everything so much easier. If you have a smaller trashcan use tall kitchen sized bags. Bring a Swiffer too and do a once over of your floors with a dry pad maybe once a month or so. But in general, just try and be clean, don't be a stereotypical college kid who wrecks their dorm. You are now an adult, start acting like one.\n\n-Join as many clubs as you can handle in the first two weeks and drop the ones you don't like. Many of them were likely virtual for the last year so they will be very welcoming to new people. If you are having trouble making freinds, this is your best option.\n\n-If you have a room mate don't let your expectations get very high.", "author": "Fedora200", "created": 1617886554, "upvotes": 2}, "gtsude3": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtsude3/", "text": "write your name on your shit lol had my old roommate steal my brand new charger", "author": "oiaooy", "created": 1617883649, "upvotes": 3}, "gtstluf": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtstluf/", "text": "ANOTHER ADVICE! Well if your dorm doesn’t have laundry services, have your clothes cleaned at one constant shop. Find a good and affordable one that doesn’t ruin your clothes and make them smell like lavender. (Lol jk on the scent. Any fresh scent works really.) In that way, you can make friends with the owner/workers there and avail discounts!", "author": "creaaamyspinachdip", "created": 1617883216, "upvotes": 3}, "gtssd5e": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtssd5e/", "text": "Don’t bring too much things. Don’t try to start a new “thing” just because you’re moving (I tried to wear makeup everyday and I quit after 3 days). SHOWER SHOES- don’t be cheap you will bust your ass in the community bathroom.", "author": "Impossible_Winner245", "created": 1617882503, "upvotes": 2}, "gtslt5f": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtslt5f/", "text": "Don't have your SO sleep over every damn night like she moved in!  Can't stress this enough. If you wanna play house at least alternate but just know your roommate is gonna hate it and your suite mates sharing a bathroom and gonna time it to walk in on her... yea...  figure out a schedule or maybe get an apartment.", "author": "jetclimb", "created": 1617878139, "upvotes": 3}, "gtsl4qj": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtsl4qj/", "text": "It takes some courage if you're not an extrovert, but definitely make friends in your hall! Try to get to know at least most of the people in your hallway, and if you can, your floor! \n\nJust walk around during the first week or so of dorm living, and introduce yourself to people in your hall, maybe bring a snack or two to share. People need help setting up so if you see an open door and someone struggling to set stuff up, introduce yourself and offer to help!\n\nHaving friends in your hall definitely helps, especially if things don't work out with your room mate!", "author": "WitchcraftUponMe", "created": 1617877627, "upvotes": 3}, "gtsl34t": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtsl34t/", "text": "Fuck every dorm girl while you’re in college", "author": "I_hate-you_already", "created": 1617877593, "upvotes": -1}, "gtsc5lz": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtsc5lz/", "text": "If there is a smoke detector and window in your dorm room, smoke by the window or blow the smoke out of the window.  Noobs setting off the fire alarm in the whole dormitory doesn't need to happen or happen often when smoking something", "author": "RobtheGreat100", "created": 1617870104, "upvotes": 3}, "gts97mw": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gts97mw/", "text": "Nobody gives a fuck anymore or is judging you. You do you.", "author": "smartymarty1234", "created": 1617867468, "upvotes": 5}, "gts92he": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gts92he/", "text": "If you’re living in a dorm (without a kitchen) please try to eat outside your room or open the window when you’re eating. I personally hate the smell of food when I’m trying to sleep & it been to a point where my roommates leftover food smell would get onto my clothes. Also if you don’t have a trash can with a lid I recommend throwing away food containers asap if possible. Again, the smell of leftover food isn’t pleasant for many.", "author": "nrockgood", "created": 1617867333, "upvotes": 6}, "gts3l8l": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gts3l8l/", "text": "Bring shower shoes. You do not want athletes foot. They don’t have to be fancy, some sandals are fine.", "author": "pokemonareugly", "created": 1617862501, "upvotes": 4}, "gts1uhs": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gts1uhs/", "text": "Doesn't matter what you do, you will have roomates from hell your fist year", "author": "bluebayoo3", "created": 1617861067, "upvotes": 3}, "gts1jmv": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gts1jmv/", "text": "Just be a minimalist! Don’t bring more than like 15-25 day outfits and 15-25 pajamas. Always bring an extension cord(s). Ensure you have lots of chargers. I also bought a printer. Bring pictures to stick on your wall with tack. Bring a plunger if you have your own bathroom and plenty of bathroom cleaning supplies. Bring a mini vacuum, this will come in handy if you are a girl/will room with women because hair will get everywhere. Get a lamp with a USB outlet attached for charging! Bring a small book lamp to study at night so you won’t blast roommates with the light of your lamp. Definitely get a laptop/book desk you can set on your lap/bed and a comfy, collapse-able cushioned chair. Bring blanket and pillows. Have a bin to store food or cosmetics. Invest in lots of sticky notes to put on your desk to remind you of assignments. Definitely get a laundry hamper. When I lived at a dorm I brought way too much stuff so it’s great to be a minimalist. You don’t have to overdo it with decor just because all your friends do and post their $2000 room decorations and set up all over tik tok.\n\nAlso for the love of god don’t vape or smoke in the room. So fucking annoying.", "author": "ksswannn03", "created": 1617860828, "upvotes": 3}, "gts0ic6": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gts0ic6/", "text": "Text your roommate before you have sex. We agreed to vacate the room with a heads up, but I forgot once and he walked in to a pretty explicit scene. Also make sure your roommate has similar views on parties, alcohol, and drugs", "author": "PM_ME_UR_GAMECOCKS", "created": 1617860007, "upvotes": 6}, "gts0br3": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gts0br3/", "text": "1) If you’re rooming with a friend, go on a trip together first. YOU MUST DO THIS or that sh!t will hit the fan so quick :,) \n2) Dedicate a day to do laundry. It sucks but you don’t wanna go down to the laundry room with like 5 loads at once and waste your day protecting your machines lol. Just do medium sized loads so it isn’t too much of a burden.\n3) Definitely talk to roommate(s) about your expectations for each other, boundaries, etc. Know if it’s ok to bring other people over, asking for the room for ~privacy~ or whatever. My freshman year roommate randomly locked me out to fuck some 24 year old drug dealer on my futon. Safe to say I wasn’t happy from then on!", "author": "ukeist", "created": 1617859865, "upvotes": 3}, "gtry587": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtry587/", "text": "1. Set boundaries early. Make it clear if you feel uncomfortable with people of the opposite sex sleeping over while you’re around, make it clear if you aren’t okay with alcohol/ weed in the room. Whatever your comfort level with these things is is fine, it’s just that people have varying opinions on these topics. \n2. If you can’t fall asleep without the TV or the light on figure out how to kick that habit before you move in. \n3. If your parents are visiting give your roommate advance notice and don’t expect they’ll have time to make the room perfectly clean with one day of notice. \n4. You will inevitably find something irritating about your roommate. I’ve seen plenty of roommates that let a small difference in cleaning habits drive a huge wedge between them, I’ve also seen friendships that existed before college end because of disagreements when living together. Don’t live with your friend from before college freshman year, wait until you can at least get an apartment with separate bedrooms.  \n5. Every single person needs alone time, even the people who seem to be very social and always partying. If you and your roommate have classes all around the same time plan an hour or two a week at the library or another common area so your roommate will have some time to just relax by themselves in the room, and have them do the same for you. When it comes to romantic interests, don’t be the person who will never let a roommate have someone over. Of course it’s not okay for them to hookup with someone when you have to be up at 7 am, but giving you and your roommate giving each other a couple Friday nights each to have a guest over is reasonable. I guess I’m trying to say don’t be that person who never leaves the room. \n6. Depending on the school you go to it might be common to sign leases for the next school year during the first semester. Be careful about who you sign a lease with, if it’s someone who constantly complains about their current roommate there’s a good chance they are also a problem roommate themselves.", "author": "anonymous_gam", "created": 1617858226, "upvotes": 6}, "gtrwobw": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrwobw/", "text": "Just please be considerate everyone, my roommate is a fucking asshole and will be chatting on discord at about 4 in the morning when he knows damn well we have a class at 10-11 AM that day (he's the same major as me). It does not bother me that he stays up until 4 AM chatting with his friends, it's his choice - what does bother me is that he isn't considerate about it whatsoever, so whoever needed to hear this just put yourself in your roommates shoes and make sure you're not doing something rude like this.", "author": "theepicdoom123", "created": 1617857177, "upvotes": 9}, "gtrvi1e": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrvi1e/", "text": "You and your roommates go and knock on every door in your dorm building best way to meet a lot of people and friends.\nPsa- this is mainly for guys if you're a girl only knock on others girls doors.\nThey are going to be labeled with names \nMost likely", "author": "wowzers6914", "created": 1617856370, "upvotes": 2}, "gtrvat2": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrvat2/", "text": "Don’t drain your cup of noodles into the bathroom sink and leave it there. \n\nNothing you do will actually hide pot smoke.\n\nYou’re not clever for stealing a dinner set from the cafeteria.\n\nDon’t burn candles or try to BBQ in your room thinking open windows are enough.\n\nRespect quiet hours. People in your wing and below you will have different schedules and you will be the asshole/bitch for not thinking of that.\n\nUse the study hall if you find your room too distracting. Seriously discipline yourself on time management to knock out your studies (reading, do a chunk of your paper that is due in a few weeks, etc.) hopefully by Thursday afternoon so when you got that weekend coming up you can really relax. \n\nGet involved with your dorm, be it working the front desk or being part of a resident leadership group. Looks great on a resume even if money is not an issue and you don’t really need a job, and you meet a lot of great people.\n\nFind people in your classes who are also in your dorm. Easy study group in PJs, plus you’ve made a social connection that could translate into good roommates when you finally move to off campus housing.\n\nDon’t be a dick to the RA if you fuck up and they catch you breaking any rules (e.g. drinking and underage, pot, etc.) A good RA will note you were compliant and dumped your alcohol down the drain when asked if they have to write you up, and that could mean the difference between a simple warning from the RD or potentially being kicked out if you try to do some dumb shit and try to fight them. \n\nFinally, remember why you are there. Too many freshman get a taste of freedom and are on academic probation by December and dropped out by the following May because they can’t handle being independent, thinking like a child and the satisfaction of “now” and not as a fucking adult and the future forgetting to go to class or get the work done. When there are parties every weekend, fraternal/sorority membership to consider, or just overall fun things to do it’s easy to fall into that trap. Take care of your business FIRST. There will be another party soon.", "author": "Stardustchaser", "created": 1617856235, "upvotes": 16}, "gtrta95": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrta95/", "text": "i’ve noticed that college dorms tend to hold smell. even if you are just eating a meal it lingers. most campuses do not allow candles or incense, but i’ve found those little small space scent diffusers to be awesome. they smell great, and don’t take up any outlets or use batteries", "author": "Silent_Heron_612", "created": 1617854938, "upvotes": 5}, "gtrsx7j": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrsx7j/", "text": "Get the third or highest floor. People above me are playing basketball with a cinder block, it’s 11:00pm", "author": "OrganicGatorade", "created": 1617854710, "upvotes": 7}, "gtrrpvp": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrrpvp/", "text": "eh, id say its fine to room with your friends if you both communicate what you like from someone as a roommate. i wouldn't suggest doing it for the hell of living with your friend, you should really take into consideration their living habits and whether you could personally be around them 24/7 or not.", "author": "sheekos", "created": 1617853961, "upvotes": 3}, "gtrrdy8": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrrdy8/", "text": "Change your sheets or wash them often. Nobody wants to smell yo stanky ass sheets that reek of college man/woman/person feet", "author": "sistersofshiva", "created": 1617853764, "upvotes": 9}, "gtrqb92": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrqb92/", "text": "Depends on your situation,  dating  may be not worth it and you're better off finding partners after college. Make sure to be comfortable in your own skin before seeking out a partner. A partner should always be a complement in your life. Period", "author": "GPA_Only_Goes_Up", "created": 1617853113, "upvotes": 3}, "gtronln": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtronln/", "text": "Shower shoes are a necessity", "author": "4pelp5-", "created": 1617852161, "upvotes": 3}, "gtromd2": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtromd2/", "text": "If you're thinking of shitting in the shower, you'll usually find toilets nearby which are a lot better to shit in.", "author": "GayGoth98", "created": 1617852142, "upvotes": 28}, "gtro7al": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtro7al/", "text": "Being good friends does not mean they're good roommates, live with someone you're friendly with but can be honest with and are on the same page about what you expect when you live together.", "author": "shaysalterego", "created": 1617851912, "upvotes": 4}, "gtrn3w0": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrn3w0/", "text": "If you need the room to do the dirty ask but pay it foward if a roomate needs the room. Or just buy them lunch or something. Dont just kick them out and be dick.\n\nAlso pack light. You can always bring more things if you need but it's hard to decide what you dont need once your all set up.", "author": "XPurpPupil", "created": 1617851293, "upvotes": 4}, "gtrn09h": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrn09h/", "text": "Clean your area and don't lose sight of what you're goals are. You came to college to study, not party 24/7. Enjoy your time but prioritize it as well.", "author": "ilikepie078", "created": 1617851239, "upvotes": 3}, "gtrldxe": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrldxe/", "text": "Bring less. You won’t wear every shirt and you have a lot less space than you think.", "author": "mcarey3301", "created": 1617850351, "upvotes": 6}, "gtrjtes": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrjtes/", "text": "Get some febreze for your shows and laundry, it will do a little to help your room stay smelling better, as well as doing laundry often especially if you are an athlete. You have a small space it doesn't take much to make it smell bad. I also highly recommend some of the wax melts that you just open up and make your room smell better", "author": "19Riften99", "created": 1617849525, "upvotes": 4}, "gtrjrow": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrjrow/", "text": "If you think to yourself I’d be irritated if he did this, then he’s probably irritated you’re doing it", "author": "Redd889", "created": 1617849498, "upvotes": 4}, "gtrjp27": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrjp27/", "text": "If you have a choice between communal bathrooms and private bathrooms go with communal. You don't have to clean them, you don't have to buy toilet paper, and they're often empty. \n\nAlso do NOT choose a room on the ground floor if you can help it. You get woken up by drunk people coming home at 3 AM.", "author": "hellabender", "created": 1617849460, "upvotes": 7}, "gtrjnb3": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrjnb3/", "text": "I never did college dorms but I did something very similar to dorming for 2 years. \n\n1. Clean up after yourself. No one likes piss (and other bodily fluids) and pubes everywhere. That includes the floor (I hate that I have to say this).\n2. Headphones. Use them. Nothing is more annoying than having to listen to what you’re watching while I’m minding my own business. Also, Step out for your face time or phone calls. \n3. Brush your teeth and shower regularly. Seriously. Stinky ass room mates suck. \n4. Don’t be clingy. Just because I went out with you to get food doesn’t mean I want to spend every waken moment with you.", "author": "ElonMusksColonoscopy", "created": 1617849435, "upvotes": 12}, "gtrjk57": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrjk57/", "text": "3 things make a good roommate\n1. Are they clean/do they keep their mess contained to their half of the room?\n2. Do they shower regularly/have good personal hygiene?\n3. Are your sleep schedules at least somewhat close/even if they’re not asleep will they be okay with when you turn lights off and need them to be quiet?\n\nSure it’s nice to have similar interests and to be able to talk or do things , but you can be friends and hangout with people in the hall or your classes. Those 3 things to me are what’s actually important.", "author": "SkrtSkrt70", "created": 1617849389, "upvotes": 5}, "gtrjf6b": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrjf6b/", "text": "Not really for dorming but If you are moving from a south state to a north state. Wait to buy winter clothes,boots, and gloves. Winters are not that same and you will not be prepared. I moved from  sunny hot texas to Seattle. Invest in some good coats too if you can", "author": "LatterRace", "created": 1617849318, "upvotes": 8}, "gtriyj6": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtriyj6/", "text": "I definitely agree with the not rooming with your friend thing. I roomed with my friend and, since I didn't notice the signs, learned the hard way about how toxic she was. Cut that friendship right off.\n\nI don't regret going to that college though because I met the greatest friends I will ever know.", "author": "arlomilano", "created": 1617849078, "upvotes": 3}, "gtrikvp": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrikvp/", "text": "Go out and sit somewhere with your roommate (or just talk in your room) and have a discussion about pet peeves, rules you would like for the room, schedules, etc. Spend some time getting to know each other and learn about each other. You don’t have to be best friends or even good friends, but being on good terms and willing to talk to each other (Communication and Compromise are key to a healthy relationship!!) will make living together a lot more enjoyable.\n\nDon’t be afraid to talk to them about something they’re doing in the room that’s bothering you. Both of y’all are paying to be there, but the space is SHARED so don’t make yourself uncomfortable just so you “don’t bother” them. \n\nIf you’ve taken the steps to try and come to an agreement with your roommate but they aren’t willing to work with you, go to someone (RA or RD) and if it isn’t handled: KEEP WORKING ON IT! You will be living with your roommate for the year and you shouldn’t be miserable in the one place you should have the most comfort. Don’t be afraid to fight for yourself!\n\nOverall: just remember that you’re living in a shared space with a bunch of people that you didn’t grow up with. There are going to be issues and fights and drama. Don’t let that ruin your dorm experience~", "author": "KitKatVi7", "created": 1617848876, "upvotes": 3}, "gtrgaam": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrgaam/", "text": "The roommate situation is key. There’s a solid 50% chance you will absolutely fucking hate your roommate after Freshman year. Don’t room with your best friend, unless of course you don’t mind possibly hating them by the end of the year. And don’t room with a random either, because obviously there are just to many unknowns in that situation. \n\nIt would be ideal to maybe pick someone you kinda sorta know from your high school, and that you can verify isn’t a total weirdo. That way if it works out, then great, you’ve made a lasting friend. If it doesn’t, then oh well, you didn’t have a lot riding on it to begin with.", "author": "TacoTruck75", "created": 1617847708, "upvotes": 7}, "gtretks": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtretks/", "text": "turn everything in, even if you only have a few things done...a 10% is better than a 0!\n\nedit: just saw you were talking about room tips..I’ll keep this up anyway because it’s still pretty damn important", "author": "WingsofRain", "created": 1617846975, "upvotes": 43}, "gtreqbq": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtreqbq/", "text": "\\- Realize the walls are thin. Don't play music out loud and assume other people can \"just ignore it.\" If you are sensitive to sound (like yours truly) get some noise cancelling headphones (airpod pros aren't too great about it imho)\n\n\\- Might be an unpopular opinion but you can switch friends. The first people you meet for freshman orientation do not have to stay your best friends. If you start to get weird vibes from them or just aren't enjoying their company then you can start to drop the relationship (obviously you can still be nice to them though)\n\n\\- Try to be friends with upperclassman for car rides and advice (and just being friends lol)\n\n\\- Nobody is thinking about you as much as you think they are. People (tend to be) more mature and realize we are all different people. I have seen multiple people wear pajamas to the dining hall. Nobody cares. Look up the spotlight effect. If you made a joke and no one laughed, they probably will forget in less than an hour. \n\n\\- Getting a bad grade on a test is not the end of the world. Talk to to the prof, go to tutoring and try your best to do better next time. \n\n\\- Use your resources! Especially with bigger colleges, they are so many things they offer like free shirts, free tutoring, money advice, libraries, random buildings to study in, free printing, etc. You (or your parents) are paying for this! Use it!\n\n\\- Join an excess amount of clubs in the first couple of weeks then drop out of the ones you're not in love with (i.e. go from 5 to 2 clubs)", "author": "llamaintheroom", "created": 1617846930, "upvotes": 153}, "gtrepd3": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrepd3/", "text": "You don't need to be friends with your roommate. Set boundaries and try not to be passive aggressive.", "author": "WhatIs_Normal_", "created": 1617846916, "upvotes": 3}, "gtre8mv": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtre8mv/", "text": "Don’t bring too much stuff when you move in. My first roommate in my dorm lived nearby and had a truck so she brought nearly everything she owned. I meanwhile was out of state and brought what fit in two suitcases. She didn’t have enough space to store her stuff and had to use most of my closet. She also didn’t use 3/4 of the stuff she brought. You really do not need more than the essentials when you only have a small bedroom to your self. Don’t bring too many clothes, you’ll get a dozen free shirts in your first week at college. \n\nAlso, less stuff = cleaner space. Me and my roommate did not keep the dorm squeaky clean, but she was always way more cluttered than me because of the sheer amount of stuff she had. \n\nAs others said, it’d totally okay not to be besties with your roommate, but I know people who have it work out great. Communication is the bottom line most important thing. Even if people have different lifestyles, keeping each other in the loop keeps everything going smoothly.", "author": "ejmsea", "created": 1617846681, "upvotes": 29}, "gtre4ql": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtre4ql/", "text": "Do not leave a post-it note to a new roommate saying “feel free to move what you need to make room”, because you will get *that* roommate who moves your bed and all of your stuff out of your dorm.", "author": "xWhiteRavenx", "created": 1617846626, "upvotes": 14}, "gtre2mk": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtre2mk/", "text": "Take out the trash! And clean the floor after a night out! You’d be surprised how many roommates don’t follow this rule. And even if you’re not close friends/besties, always be open and communicating with your roommate. I’ve seen many roommate situations where they hold grudges against each other and they constantly “stand off” and not take up apartment responsibilities, then complain.", "author": "CaptPolaris", "created": 1617846596, "upvotes": 4}, "gtrdniq": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrdniq/", "text": "If you’re a STEM major, having a reasonably large whiteboard in your dorm is very useful and eco-friendly for working on problems.\n\nAlso if you don’t want to sleep through class, try to go to sleep and wake up at the same time every day. I usually set alarms even for weekend mornings just so my body can get used to and stay used to waking up at the right time.", "author": "TheLifeOfRichard", "created": 1617846383, "upvotes": 57}, "gtrdbvw": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrdbvw/", "text": "Be fully prepared to lose a perfectly good friendship if you move in together and have different lifestyles or poor roommate communication (which a learning curve comes with, most college freshmen don't communicate well)", "author": null, "created": 1617846218, "upvotes": 26}, "gtrcwxv": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrcwxv/", "text": " Be mindful and kind to each other’s schedule\n\nIf you’re getting housing to find you a roommate, be honest in your personality survey \n\nIf you’re rooming with a friend, know that you could be good friends but not be the best roommates \n\nThemed floors are great \n\nRez is fun but keep a schedule to yourself because you’re there for school after all and don’t lose focus on this", "author": "AAAPAMA", "created": 1617846005, "upvotes": 5}, "gtrcmcx": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrcmcx/", "text": "Make sure you pick the right dorm hall (depending on your school) make sure you pick the one that’s mainly freshman and not one filled with upperclassmen \nIt’s much easier to make friends if everyone else is a freshman too", "author": "daddycakes101", "created": 1617845857, "upvotes": 10}, "gtrcjk0": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrcjk0/", "text": "[deleted]", "author": null, "created": 1617845819, "upvotes": 30}, "gtrcg76": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrcg76/", "text": "Use rate my professor for classes you plan on taking, professors dictate how easy or difficult a class will be. I failed a major class twice and my third time I took the professor everyone recommend and I'm doing less than half the work I did previously and making a B+", "author": "Dylan-the-villan", "created": 1617845773, "upvotes": 7}, "gtrc1kr": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrc1kr/", "text": "lmao, don’t eat a balsamic salad and then leave the empty dish on your desk for an hour, because that’s something that smells super strongly and you share the airspace.\n\nto be more serious, just be conscientious that the things you do will affect someone else most of the time. so be respectful by making sure you keep your space as tidy as possible (ex. make your bed); if my side was getting messy and i didn’t have time to clean it in the moment then i would at least throw everything onto my bed so it wasn’t all over the floor. \n\nset boundaries with your roommate for how late you’ll keep the light on, playing music, friends/partners coming over, etc. because if you’re both on the same page, then you’re way more likely to avoid constant frustration/arguments with each other.", "author": "hannah_nj", "created": 1617845568, "upvotes": 15}, "gtrc0ru": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtrc0ru/", "text": "1. It's alright not to be friends with your roommate. I went practically the whole semester without talking with mine, simply because our schedules and interests were so different. But there was never any conflict between us.\n2. Make sure you talk with your roommate in the beginning of the semester as to your schedule, lifestyle, and what your expectations are for a roommate.", "author": "Scooby-Doo_69", "created": 1617845556, "upvotes": 47}, "gtraude": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtraude/", "text": "Microwave > nasty ass community kitchen", "author": "panda96734", "created": 1617844956, "upvotes": 3}, "gtraqmi": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtraqmi/", "text": "Have something (a trunk, a safe, etc) that you can lock your valuables or important things in.  Some roommates do not respect boundaries.  Some do not lock doors. Etc etc\n\nI had one in particular in college...she would let people sleep in my bed when I went home over the weekends and not tell me.  I liked to change my sheets on Friday when I packed up.  I had to start leaving a sticky note between the sheets.  She also dug through all my stuff and ate any food I had.  It was a nightmare, but thankfully I was able to move between semesters.", "author": "BrandNewSidewalk", "created": 1617844905, "upvotes": 49}, "gtraq2n": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtraq2n/", "text": "I would say communication is key. \n\nManners are big too. \n\nBe respectful and responsible", "author": "Glass-Substance464", "created": 1617844897, "upvotes": 2}, "gtran1h": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtran1h/", "text": "Most people are looking for new friends. It will feel like people paired off and found friends quickly, but that's not true. Keep putting yourself out there.\n\nAlso, find a group to have lunch with and a group to have dinner with.", "author": "Coloradical27", "created": 1617844856, "upvotes": 34}, "gtr9mfd": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr9mfd/", "text": "Here's some general housekeeping advice so your roommate doesn't think you're nasty/advice to offset a nasty roommate:\n\n* (If you have your own bathroom) disposable toilet scrubbers are awesome. They have soap in the scrubbing head so you can just pop one in and then throw it away. Also, clean your toilet. If I had a dollar for every room I've been in with a nasty moldy toilet--\n\n* (If you have a kitchen) just straight-up never leave dishes in the sink. Wash stuff as soon as you're done using them. If everyone does it the sink is always clear, and if you're the only one doing it then you earn the right to nag your roommates.\n\n* Buy a small hand vacuum. Full-sized vacuums are impractical, but you shouldn't not vacuum. They're like $50 (and you can also use them to catch flies and stuff). \n\n* It's a good idea to keep one wastebasket by your desk/bed and one in the common area. You will 100% use both.\n\n* If you like spray-on deodorant/perfume/cologne please use it in the common area or the bathroom. Your roommate will thank you.\n\n* Disinfecting wipes\n\n* Laundry bag to keep your dirty laundry in one place and to make it easier to bring laundry to/from the laundry room. Don't use a basket or a hamper. They suck for dorming.", "author": "kkoiso", "created": 1617844343, "upvotes": 36}, "gtr907d": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr907d/", "text": "Don’t bump uglies with your roommate... ever", "author": "Calintz92", "created": 1617844033, "upvotes": 14}, "gtr8vgw": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr8vgw/", "text": "When it comes to dorm living, I brought WAY too many things and needed things I did not have. Lol. I would also suggest that if you are a big introvert and need your own space, living with another human is going to be hell. I had a roommate, once, and she was nice when we were messaging. However, once we met, she made me want to cry all the time, and I had no place to just get away and recharge. I had to learn the hard way, but having a Jack/Jill style dorm was the best option for me.", "author": "DangerousPlastic7510", "created": 1617843965, "upvotes": 158}, "gtr8l8k": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr8l8k/", "text": "Keep your side clean or at least presentable. Don’t have guests or your SO over all the time it’s not courteous to your roommate. Be mindful of sleep schedules and buy a nice pair of headphones. Also don’t always be in the room.", "author": "joc307", "created": 1617843817, "upvotes": 8}, "gtr8i2y": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr8i2y/", "text": "I've got a few. \n\n1. Set boundaries. Establish rules. Don't make them super strict, but make sure there are rules and have a plan for communicating exceptions to the rules. Make sure cleaning shared space is part of this. \n2. Be friends with your Resident/Community Assistant. This might save your ass at some point. Plus also, if something is happening that's against the rules that makes you uncomfortable...\n3. Don't be afraid to be a narc. A lot of times, if someone is breaking some bigger rules that shit will fall back on you.   \n  \\- If it's something like alcohol, drugs, etc this is especially true  \n  \\- You can also work with residence life to get a room change if needed. \n4. Have a plan for shared resources (TP comes to mind). Genuinely don't do the \"get what's within your means\" thing - if something isn't, communicate with your roommate(s) situationally. \n5. Find an alternative study space that isn't your room, and preferably one that is 24h. Then you won't keep your roommate up, or if your roommate wants people over you have a place to go.\n6. Get a 10 ft charging cable. You're gonna need it.", "author": "BulkBrewFrenchPress", "created": 1617843772, "upvotes": 14}, "gtr7e0t": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr7e0t/", "text": "I was lucky enough (depending on what you want) to get a room by myself because of covid. If you don't want a roommate for whatever reason, it is worth checking with your school to see if they will still allow it next fall. I can't speak on having a roommate, but it is nice coming back from class and be able to have your own space to relax in. Especially your freshman year, when you don't know a lot of people and want to just rest in peace. If it wasn't for covid, I wouldn't have cared but I think it is actually pretty great.", "author": null, "created": 1617843193, "upvotes": 21}, "gtr797n": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr797n/", "text": "Try practicing time management over the summer. It’s a very big difference first semester/quarter", "author": "Saandraa99", "created": 1617843128, "upvotes": 9}, "gtr6otu": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr6otu/", "text": "The sound of your tinder hookups is probably louder than you think, even if you have a private bedroom with only shared living space. I got so tired of hearing my roommate screwing around at 4 am.", "author": "melizabethabel", "created": 1617842846, "upvotes": 187}, "gtr5gkw": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr5gkw/", "text": "If your sharing  a room or an apartment. Please keep your area clean. The things you don't want your roommate  touching. You let them know immediately.", "author": "LegendkillahQB", "created": 1617842225, "upvotes": 35}, "gtr59eh": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr59eh/", "text": "Be cautious of rooming with people you don't know well; they could be faking niceness. My old roommates were terrible despite them acting all nice when we first met. Also, respect the quiet hours! My old roommates caused me to have sleep deprivation and fail 2 classes and the school didn't do anything to help me", "author": "Kaitlin33101", "created": 1617842123, "upvotes": 19}, "gtr56hw": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr56hw/", "text": "Don't be an asshole about the thermostat.", "author": null, "created": 1617842082, "upvotes": 55}, "gtr4yu7": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr4yu7/", "text": "1. Don't dorm lmao", "author": "Niarah", "created": 1617841975, "upvotes": -8}, "gtr42jz": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr42jz/", "text": "Always choose the BOTTOM bunk bed unless you wanna act like a monkey climbing down in the middle of the night just to pee. Also you won’t be anxious in waking up your roomie every time you go up and down. \n\nRespect your roommate’s things and personal space.\n\nBE MINDFUL OF YOUR MESS. \n\n:)", "author": "creaaamyspinachdip", "created": 1617841511, "upvotes": 172}, "gtr3kvm": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr3kvm/", "text": "Dear god just clean up after yourself. This may be more like actual house/apartment living advice, but cleaning up after yourself is part of the cooking process!", "author": "itsNotMythical", "created": 1617841260, "upvotes": 316}, "gtr0yn0": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr0yn0/", "text": "If you are finding a roommate for the first time ask them about their sleeping habits, how they feel about romantic partners staying over, and political beliefs \n\nYour sleeping habits don’t have to be exactly the same but if you usually stay up until midnight and wake up at 9, and your roommate stays up until 9pm and wakes up at 6, that might be a big difference \n\nMake sure they respect your boundaries with inviting over romantic partners. You could end up with someone who is getting it on in the bed right next to you while you’re sleeping and that’s really awkward and uncomfortable. You don’t want don’t random dude or girl over all the time in your room either. A good balance is important\n\nYou can definitely room with someone who has different political beliefs. I am right now. But that difference might be a little too big or make some uncomfortable. It depends how extreme someone is but it’s good to ask just to make sure you aren’t rooming with a white supremisist or someone who is homophobic especially if you are in the LGBT community, etc. \n\nLastly, it’s okay if you don’t make friends on your floor. Be open and try your best but you might just be a loner for a little while and that’s okay. Nobody has it all figured out freshman year.", "author": "earthxtone00", "created": 1617839915, "upvotes": 44}, "gtr05lu": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtr05lu/", "text": "I'll agree with your number 2 but it should have been number 1. Communication is everything. Everybody grows up with a different idea of what normal is, and many college students have never shared space with another person the way you have to do in a dorm room. Growing up with siblings and sharing a bedroom isn't the same dynamic. Don't assume your roommate(s) will think or behave exactly the way you do, even if you are rooming with your friend(s). If something is bothering you, you have to say something about it, preferably right away - don't let all the little annoying habits just build on each other until you find yourself leaving a two-page bulleted list of grievances on your roommate's bed before you leave for spring break. (Ask me how i know.)", "author": "tehzephyrsong", "created": 1617839498, "upvotes": 111}, "gtqsyi2": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtqsyi2/", "text": "Also keeping your area clean... or at least not so messy that your things spill over onto your roommate's side", "author": "Clarinetist123", "created": 1617835815, "upvotes": 458}, "gtqsxjl": {"link": "/r/college/comments/mmdid6/what_are_some_dorming_tips_youd_give_incoming/gtqsxjl/", "text": "I would disagree with #1. I would room with your friend because at least you know their habits and style. If you go random with anyone you have a big chance of getting someone you don’t like, and you’ll have to spend a year with them. Imo dorm with your friend so you’ll at least be comfortable in your room", "author": "WorldofMickeyMouses", "created": 1617835801, "upvotes": 78}}}