{
  "sid": "ql4yy3",
  "link": "/r/college/comments/ql4yy3/qualitative_research_methods_that_dont_require/",
  "title:": "Qualitative research methods that don't require surveys nor interviews?",
  "text": "Hi everyone!\n\nI'm a communications undergrad working on my thesis for senior year. I proposed redefining productivity in the context of the pandemic (comparing productivity before and during the pandemic, studying work hours, etc.). My supervisor suggested approaching this philosophically. He also mentioned being able to pull this off without even conducting interviews nor surveys. \n\nI'm aware these studies do exist, but I'm hoping maybe you could help me further understand?  Feel free to message me too in case you need more information about my thesis topic. Thank you so much!",
  "author": "PinHead_Larry1300",
  "created": 1635861947,
  "updated": 1636184949,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hj0wt0o": {
      "link": "/r/college/comments/ql4yy3/qualitative_research_methods_that_dont_require/hj0wt0o/",
      "text": "Maybe he was referring to analizing processes and tools.\n\nFor example consider the time taken by commute. Versus the time taken to set up a zoom meeting. Variables could be distance to work and age. No need to do an interview, common sense and time should give you the answers.",
      "author": "BaniGrisson",
      "created": 1635868727,
      "upvotes": 1,
      "replies": {}
    },
    "hj1gspe": {
      "link": "/r/college/comments/ql4yy3/qualitative_research_methods_that_dont_require/hj1gspe/",
      "text": ">My supervisor suggested approaching this philosophically. He also mentioned being able to pull this off without even conducting interviews nor surveys.\n\nFrom this description, I get the feeling he was suggesting you do a literature review and form a thesis based on the evidences already available.",
      "author": "AcademicDifficulty",
      "created": 1635876707,
      "upvotes": 1,
      "replies": {
        "hj8m655": {
          "link": "/r/college/comments/ql4yy3/qualitative_research_methods_that_dont_require/hj8m655/",
          "text": "Oh I see :) Please correct me if I'm wrong, but the literature review would be different from the RRL right?",
          "author": "PinHead_Larry1300",
          "created": 1635995829,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj46r9c": {
      "link": "/r/college/comments/ql4yy3/qualitative_research_methods_that_dont_require/hj46r9c/",
      "text": "This sounds a lot like a conceptual work, which would be based on prior literature and your own theorizing.",
      "author": "PhDapper",
      "created": 1635918889,
      "upvotes": 2,
      "replies": {}
    },
    "hjciyor": {
      "link": "/r/college/comments/ql4yy3/qualitative_research_methods_that_dont_require/hjciyor/",
      "text": "If you’re doing it philosophically you’re probably doing a library-based thesis if I’m not wrong? As a few of my friends are doing it too! \nFor qualitative research methods you can collate data from social media discourses or documentaries?",
      "author": "illestheartbreaker",
      "created": 1636067957,
      "upvotes": 1,
      "replies": {
        "hjd1vq0": {
          "link": "/r/college/comments/ql4yy3/qualitative_research_methods_that_dont_require/hjd1vq0/",
          "text": "ooh i see! so what would you call this method? content analysis? :)",
          "author": "PinHead_Larry1300",
          "created": 1636076221,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}