{
  "sid": "qajfr3",
  "link": "/r/college/comments/qajfr3/covid_cancelled_most_of_my_graduate_school_resumè/",
  "title:": "COVID cancelled most of my graduate school resumè opportunities",
  "text": "to preface i am 19 and graduated with a degree in applied mathematics. \n\nFor the summer of my senior year, I had  lined up internships at two great military research labs. Both were cancelled due to lockdowns. I also had an undergraduate research project set up with my advisor for my senior year which was also cancelled due to covid. \n\nI’m finishing my masters this year with literally no research or industry experience and want to apply to a computational mathematics PhD program. i have this programming language (on top of a C++ compiler) that I built for linear algebra applications. other than that, all I have to show is my rocking McDonald’s letter of recommendation. \n\nShould I mention this explicitly in my applications or would that sound a bit sobbish?",
  "author": "unbecoming___",
  "created": 1634550648,
  "updated": 1634654734,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hh3kjo4": {
      "link": "/r/college/comments/qajfr3/covid_cancelled_most_of_my_graduate_school_resumè/hh3kjo4/",
      "text": "I would make a brief mention of your cancelled research opportunities in your personal statement. Don't frame it like a complaint, but rather that you had applied to research opportunities, and if you were accepted which it sounds like you were, definitely include that. Graduate schools like knowing that you have research experience and if Covid prevented those experiences from happening then knowing that you were interested in them and actively pursuing them is the next best thing you can do given the circumstances.",
      "author": "littleboyblue1",
      "created": 1634558541,
      "upvotes": 6,
      "replies": {}
    },
    "hh3nx1v": {
      "link": "/r/college/comments/qajfr3/covid_cancelled_most_of_my_graduate_school_resumè/hh3nx1v/",
      "text": "Only mention what's relevant to the job/opportunity you're applying for. \n\nIf it ain't, don't mention it and just keep on rolling. If they take you awesome and if not, keep trying elsewhere.",
      "author": "SgtGhost57",
      "created": 1634560579,
      "upvotes": 3,
      "replies": {}
    },
    "hh3bn0b": {
      "link": "/r/college/comments/qajfr3/covid_cancelled_most_of_my_graduate_school_resumè/hh3bn0b/",
      "text": "I’m not someone who has gone to grad school so take my advice with a grain of salt.\n\nI personally wouldn’t mention it in the application. It might come off as an excuse. Just apply with what you have. If you get turned down because of that, then maybe you could look for other opportunities for gaining experience and then apply again next year once you have that extra experience.",
      "author": "LibraDust",
      "created": 1634552025,
      "upvotes": 2,
      "replies": {}
    }
  }
}