{
  "sid": "qg9mzu",
  "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/",
  "title:": "I need my GPA to be above 3.5 to keep my scholarship, do you think my professors would understand my situation and bump my grade?",
  "text": "I was unaware of the terms of my scholarship that I needed a 3.5+ GPA. I’m around a 3.4 rn. I’m a low income student and don’t want to be screwed over. Is this something to talk about with my professor if I’m at risk of losing it?",
  "author": "PBAuser102",
  "created": 1635264142,
  "updated": 1635302335,
  "over_18": false,
  "upvotes": 188,
  "upvote_ratio": 0.86,
  "comments": {
    "hi4oz7d": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi4oz7d/",
      "text": "I mean unless you have been visiting them for office hours for help and needed a slight \"bump\", they might do it. I see no reason why they would do it though. It just seems desperate, and wouldn't be fair for other students.",
      "author": "kyeelee",
      "created": 1635264827,
      "upvotes": 281,
      "replies": {}
    },
    "hi4uu0s": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi4uu0s/",
      "text": "That 100% depends on your relationship with the professor. \n\nFor example, we had a professor who was notorious for being a ridiculously harsh grader. Like people regularly failed his courses for work quality that would have garnered a B in other classes. \n\nHe and I had a good relationship. I gave him the time of day, did the readings, was engaged in the classes I took from him and asked for mentorship during office hours. \n\nMy last semester in college I was 3 A’s away from the 3.9 threshold to graduate summa cum laude. I had one of his classes. I felt doomed. But he gave me the A. I didn’t ask, but I think he knew.",
      "author": "The_Nitram",
      "created": 1635267121,
      "upvotes": 237,
      "replies": {
        "hi5ixau": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5ixau/",
          "text": "It’s hard for me to build a relationship with the professor because all my classes are lectures with 100+ students.",
          "author": "PBAuser102",
          "created": 1635276572,
          "upvotes": 69,
          "replies": {
            "hi5lxa7": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5lxa7/",
              "text": "always hit the office hours regularly, they notice. If youre on first name basis with professors, these situations can be helped sometimes.",
              "author": "Johnnyring0",
              "created": 1635277721,
              "upvotes": 89,
              "replies": {
                "hi75nto": {
                  "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi75nto/",
                  "text": "College sounds like a nightmare",
                  "author": "recchie8",
                  "created": 1635301746,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hi60we6": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi60we6/",
              "text": "I get what you mean. Participate, email, or office hours! I realized a lot of students who did this generally excelled. I used to be really shy about it. A lot of it was my own self doubt and insecurities. Some of these professors might get you opportunities, and it doesn't just have to do with grades.",
              "author": "kyeelee",
              "created": 1635283539,
              "upvotes": 8,
              "replies": {}
            },
            "hi5y2ly": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5y2ly/",
              "text": "I got close with a professor who taught a 200+ person class. Go to office hours and try to talk to them before or after class. It’s really that simple since not a lot of people go to office hours",
              "author": "AnnaMak",
              "created": 1635282392,
              "upvotes": 27,
              "replies": {}
            },
            "hi6oc19": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6oc19/",
              "text": "Hi! I’m a freshman and I’m becoming pretty close with a professor in a class of 250-300. If you can, stay after class for a few minutes and ask a few questions about something you’re curious about in the class. I usually stay after my profs lecture for about 5-10 minutes (don’t over do it of course, but he’s really chill with it and encourages it). Also go to office hours! Even if you don’t have questions, you can ask about the prof’s research. Eventually it just becomes a habit to stop by and say hi and talking to them after class. Hope this helped :)",
              "author": "Morbidstudent",
              "created": 1635293868,
              "upvotes": 3,
              "replies": {}
            },
            "hi6rgng": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6rgng/",
              "text": "Sit in the front row if you can. They will see you more often than the other students and you’ll be noticed when you go to the office hours.",
              "author": "Evilkenevil77",
              "created": 1635295290,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hi6lnf9": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6lnf9/",
          "text": "Oh man that reminds me of a prefessor I had who was notorious for being a hard ass.\n\nNo extensions, if you turn your assignment in late he automatically docks 25% of the grade on it \n\nHe never gave out 100% scores. The most he would ever give you is a 98% because \"nobody's perfect\"",
          "author": "natteulven",
          "created": 1635292662,
          "upvotes": 3,
          "replies": {
            "hi72xwb": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi72xwb/",
              "text": "Oof, sounds like a fun time… I will say that I think it can be good to have that experience. Helps when you have extremes on both ends of the professor spectrum. Just as long as it’s not a crucial course :/",
              "author": "The_Nitram",
              "created": 1635300507,
              "upvotes": 1,
              "replies": {
                "hi759et": {
                  "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi759et/",
                  "text": "Yeah, in hindsight it did help me with time management, but jeeze it was it tough. He taught two of my required classes for my major because it was a specialized class. To be fair, he was otherwise a fantastic professor. If I had a dollar every time he stayed late in order to help my dumb ass I could pay off my student loans 😂",
                  "author": "natteulven",
                  "created": 1635301561,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi4u0ty": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi4u0ty/",
      "text": "Did you already take your finals? If it's not the end of the semester you still have a chance of getting better grades",
      "author": "cowfishAreReal",
      "created": 1635266806,
      "upvotes": 42,
      "replies": {
        "hi5jh69": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5jh69/",
          "text": "I’m hoping to do well on the finals but it could go either way",
          "author": "PBAuser102",
          "created": 1635276783,
          "upvotes": 13,
          "replies": {
            "hi61b9a": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi61b9a/",
              "text": "Listen if you have a 3.4 gpa, you probably work hard. Don't doubt yourself and kill that last exam! Don't wait until November or December. Start reviewing the material now. Focus on something new and old everyday.",
              "author": "kyeelee",
              "created": 1635283708,
              "upvotes": 24,
              "replies": {}
            },
            "hi6jedu": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6jedu/",
              "text": "Go to office hours. Make yourself known to the Prof. If there's a teaching assistant in the class, go meet with them as well, since they might do the grading of the exam. If you show them that you care and you're trying, they might be more forgiving during the grading of the final.",
              "author": "Girl-After-Dark",
              "created": 1635291639,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hi5redm": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5redm/",
      "text": "Professor here:  DO NOT ASK FOR A BUMP!  \n\nI cannot stress how hard it will backfire on you.\n\nthey will not do it.   Why?  It could absolutely come and bite them in the ass.  Imagine if you said to a friend “oh, professor Y is so cool! She bumped my grade up a notch so I wouldn’t lose my scholarship!”\n\nThat is a whole can of hell opening up.  Cue the calls to the Dean from other students, potential scolding of the professor.\n\nAsk for extra credit — maybe — but honestly STUDY FOR YOUR FINALS!",
      "author": "emarcomd",
      "created": 1635279810,
      "upvotes": 114,
      "replies": {}
    },
    "hi5bhcz": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5bhcz/",
      "text": "Try reaching out to your schools financial aid office and see if they can do anything for you. I know my schools financial aid has a one semester probation where you still receive financial aid and you have the semester to get your gpa back up",
      "author": "PHUQmentalSTABILITY",
      "created": 1635273674,
      "upvotes": 17,
      "replies": {
        "hi5imeb": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5imeb/",
          "text": "Thanks for the help! I can see if they’ll let me do that",
          "author": "PBAuser102",
          "created": 1635276455,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hi5dhcy": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5dhcy/",
      "text": "PhD student that has taught classes, here. \n\nHonesty, no, your professors are not likely to do this. It would be unethical to bump you to a grade you did not technically earn. Asking for extra credit (or completing extra credit assignments available to the whole class) to boost your grade could totally be a viable option, though!",
      "author": "BiologyPhDHopeful",
      "created": 1635274456,
      "upvotes": 70,
      "replies": {
        "hi5ndwu": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5ndwu/",
          "text": "That last part is an excellent suggestion. \"Prof., I'm borderline on the GPA to maintain my scholarship. I just wanted to check whether you ever offer extra credit assignments, individually or available to a whole class, so that I'd have a shot to earn the last few tenths I need.\"",
          "author": "dcgrey",
          "created": 1635278277,
          "upvotes": 38,
          "replies": {}
        }
      }
    },
    "hi4qcii": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi4qcii/",
      "text": "maybe if you have a legitimate reason for your grade being that low and/or offer to do extra credit work, but if you’re grade is low simply due to slacking then don’t expect much",
      "author": "bigstupid420",
      "created": 1635265371,
      "upvotes": 38,
      "replies": {}
    },
    "hi54xoe": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi54xoe/",
      "text": "It depends. If your grade is teetering on the edge, for example, is a 89%, then your professor might be lenient and bump it up to a 90%. But if your grade is 85%, then chances are they won’t bump you up. This is because it isn’t fair to other students. Just because you have a scholarship, doesn’t give you a right to have good grades. You need to work for them.",
      "author": "JupiterRocket",
      "created": 1635271084,
      "upvotes": 30,
      "replies": {
        "hi5jn9g": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5jn9g/",
          "text": "If I were to be on the edge of a B+ or whatever, what would be the best way to ask for a slight bump?",
          "author": "PBAuser102",
          "created": 1635276846,
          "upvotes": 2,
          "replies": {
            "hi684ga": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi684ga/",
              "text": "The best way would be not to ask. A professor who bumps up an 89% is going to bump up an 89% regardless. Annoying the professor by asking for a grade you haven't earned is not going to help your case. Instead, go to them now and ask how you can actually improve.",
              "author": "Dunyazad",
              "created": 1635286590,
              "upvotes": 10,
              "replies": {}
            },
            "hi5ngsi": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5ngsi/",
              "text": "Perhaps just list your merits? For example, when you ask for a bump, point out that you attended every class, went to office hours multiple times, or always completed the homework on time. Or offer to do an extra assignment. Usually profs are open to bumping up a grade 1% anyways, so as long as you have been a good student thus far, it shouldn’t require too much bargaining.",
              "author": "JupiterRocket",
              "created": 1635278308,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hi4temu": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi4temu/",
      "text": "No, if they bump up your grade then they will have to bump up everyone else’s",
      "author": "ThicccPanta",
      "created": 1635266567,
      "upvotes": 35,
      "replies": {
        "hi59pxt": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi59pxt/",
          "text": "this part. It’s not far to bump up grades for one student and not the rest, we all want high gpas. Most have syllabus policies surrounding this topic.",
          "author": "rynpickles",
          "created": 1635272977,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "hi5hcig": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5hcig/",
      "text": "My aunt had a student do something similar for transfering, but came out she wasnt transfering until another year. She wanted an easy A,  but thats after rejecting her to give her a passing grade. If you dont know it drop the class",
      "author": "nathanielx9",
      "created": 1635275966,
      "upvotes": 5,
      "replies": {}
    },
    "hi65kt8": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi65kt8/",
      "text": "Professor here -  no.  You get the grades you earn.  If you need a 3.5, make sure you get the grades to keep it.",
      "author": "kryppla",
      "created": 1635285487,
      "upvotes": 12,
      "replies": {}
    },
    "hi59pju": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi59pju/",
      "text": "No",
      "author": "WCCobra",
      "created": 1635272973,
      "upvotes": 9,
      "replies": {}
    },
    "hi5escn": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5escn/",
      "text": "No. It's incredibly selfish to ask for a grade bump at all. If you knew the scholarship was so important you should have done the work necessary to maintain it.",
      "author": "orangeblackteal",
      "created": 1635274963,
      "upvotes": 18,
      "replies": {
        "hi5gqc7": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5gqc7/",
          "text": "It’s selfish to want to stay in school?????? Also you know nothing about OPs situation or how they spend their time",
          "author": "pianoloverkid123456",
          "created": 1635275728,
          "upvotes": -15,
          "replies": {
            "hi5s6s8": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5s6s8/",
              "text": "Why is any of that important. Why should a professor be giving free grades just because op needs it?",
              "author": "dade305305",
              "created": 1635280113,
              "upvotes": 6,
              "replies": {
                "hi5u3rt": {
                  "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5u3rt/",
                  "text": "I didn’t say the Professor should be bumping up the grade , I’m just saying the comment I replied to is making a lot of assumptions",
                  "author": "pianoloverkid123456",
                  "created": 1635280855,
                  "upvotes": -1,
                  "replies": {
                    "hi6526t": {
                      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6526t/",
                      "text": "What did my statement assume?",
                      "author": "orangeblackteal",
                      "created": 1635285269,
                      "upvotes": 3,
                      "replies": {
                        "hi691mx": {
                          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi691mx/",
                          "text": "I don’t necessarily disagree with you but your statement assumed OP wasn’t putting in the effort to maintain their grade. OP could very well be putting in lots of effort but not efficiently or might just genuinely be struggling, yk?",
                          "author": "strawberrysweetpea",
                          "created": 1635286995,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hi65t36": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi65t36/",
              "text": "How did you interpret that comment so incredibly wrong?",
              "author": "kryppla",
              "created": 1635285586,
              "upvotes": 3,
              "replies": {
                "hi67who": {
                  "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi67who/",
                  "text": "I did not interpret it incorrectly. They made some rude assumptions",
                  "author": "pianoloverkid123456",
                  "created": 1635286491,
                  "upvotes": -3,
                  "replies": {
                    "hi68ipn": {
                      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi68ipn/",
                      "text": "Not at all, if someone needs grades then they have to make sure they work and get those grades.  If you can’t agree to that simple fact then you are the one making assumptions.",
                      "author": "kryppla",
                      "created": 1635286765,
                      "upvotes": 1,
                      "replies": {
                        "hi6ylm4": {
                          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6ylm4/",
                          "text": "I did not disagree with the statement that someone should work for the grades they need. That is not in fact how the comment was phrased",
                          "author": "pianoloverkid123456",
                          "created": 1635298545,
                          "upvotes": 1,
                          "replies": {
                            "hi72of6": {
                              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi72of6/",
                              "text": "If you knew you needed the grades you should have earned them?  It’s the same thing.",
                              "author": "kryppla",
                              "created": 1635300383,
                              "upvotes": 1,
                              "replies": {
                                "hi73lhy": {
                                  "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi73lhy/",
                                  "text": "It’s not the same thing . The way the comment is phrased assumed OP has not been working to earn the grade they need and attacks them for panicking that they might lose the only source of funding keeping them in school.",
                                  "author": "pianoloverkid123456",
                                  "created": 1635300813,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hi4xqau": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi4xqau/",
      "text": "Unless if you have a track record of being a good student, turning in stuff on time and going to office hours, they won't be too sympathetic",
      "author": "GoldRequest",
      "created": 1635268254,
      "upvotes": 3,
      "replies": {}
    },
    "hi5w6sv": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5w6sv/",
      "text": "It depends. If you are at 89.9% and wants to get to 90%, then I'd just throw in a tiny extra credit assignment for everyone.\n\nBut if you are at 70% and want an A, then definitely no.",
      "author": "AcademicDifficulty",
      "created": 1635281654,
      "upvotes": 3,
      "replies": {}
    },
    "hi5ykew": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5ykew/",
      "text": "College is hard, but trust me unless professors are just bad and the proud about failing most of their students type, you have FULL power to adapt your study styles to accommodate. If you aren’t doing as well in a class, think what works and what can you do different? Go to office hours and talk to your professors for help on that cause maybe they have insight on ways to study specific to their class. Utilize tutors if your school provides it, read supplements, find ways to more effectively manage time to where you can study for less time but retain more than just cramming for hours on end - taking the right steps can ensure you adapt and overcome, a bad test grade here or there isn’t going to doom you to a bad GPA, you got this!",
      "author": "AnnaMak",
      "created": 1635282591,
      "upvotes": 3,
      "replies": {}
    },
    "hi6dqm4": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6dqm4/",
      "text": "Doing this can really hurt your relationship with your professor, and they'll most likely say no.\n\nBut it sounds like your term is not over yet. Go to your professor's office hours and ask them for advice on how to do better and hit your goal mark in their class. You can explain your situation to them and they're likely to work with you on how /you/ can improve your grade.\n\nIn addition to leaving a much better impression on your professor, you'll also likely learn more by doing this. Please don't just ask for a bump.",
      "author": "MArtswad",
      "created": 1635289069,
      "upvotes": 3,
      "replies": {}
    },
    "hi6r7lv": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6r7lv/",
      "text": "Go to office hours.  Ask for help narrowing down what to study for the finals, what to focus on for this project. In this unit. Etc.  work into the conversation where you came from and how you are here on a rigorous scholarship that requires a 3.5 and you’re trying.   But do Not lead with that ask.  Lead with at least 2 visits of asking questions about how to be more successful.",
      "author": "CozmicOwl16",
      "created": 1635295175,
      "upvotes": 1,
      "replies": {}
    },
    "hi4psxq": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi4psxq/",
      "text": "Time to drop parties and activities and study more. Talk to your prof about how to be more productive studying because you need a 3.5.",
      "author": "CindsSurprise",
      "created": 1635265159,
      "upvotes": 34,
      "replies": {
        "hi5ijfk": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5ijfk/",
          "text": "I don’t party/drink/smoke or any of that.\nIm a first year engineering student and I’m still adapting to college.",
          "author": "PBAuser102",
          "created": 1635276424,
          "upvotes": 12,
          "replies": {
            "hi66e1z": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi66e1z/",
              "text": "I don't mean that kind of partying. I'm saying study smarter, more. It's also what you are saying - you're a first year and haven't learned how to cram it all in yet. Engineering is a tough major and it's a huge adjustment. Have you tried the student led study sessions through your student success office or engineering school? People who go to those score higher.",
              "author": "CindsSurprise",
              "created": 1635285833,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hi5gpg4": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5gpg4/",
          "text": "*Things a douchebag says: \n\"Time to drop parties and activities and study more.\"",
          "author": "somethinsomethinmeme",
          "created": 1635275718,
          "upvotes": 5,
          "replies": {
            "hi6puq0": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6puq0/",
              "text": "Are you also under a 3.5?",
              "author": "Swords_Not_Words",
              "created": 1635294559,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hi5of9w": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5of9w/",
      "text": "Hoenstly, discuss with the prof and tell them you’re concerned because of this and ask how you can do better on assignments to bump up your grade. Do not ask for extra credit.",
      "author": "falsecompare_",
      "created": 1635278672,
      "upvotes": 6,
      "replies": {}
    },
    "hi5dzz0": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5dzz0/",
      "text": "No",
      "author": "chadan1008",
      "created": 1635274657,
      "upvotes": 4,
      "replies": {}
    },
    "hi5qejg": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5qejg/",
      "text": "On the basis that you need a high GPA? No.\n\nOn the basis that you came to office hours, participate in class, and show improvement over the course? Yes.\n\nHonestly asking for a grade bump for any reason is usually detrimental to actually getting a grade bump.",
      "author": "hdorsettcase",
      "created": 1635279428,
      "upvotes": 5,
      "replies": {}
    },
    "hi4twzx": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi4twzx/",
      "text": "Office hours maybe",
      "author": "Rickysmalls1010-",
      "created": 1635266765,
      "upvotes": 2,
      "replies": {
        "hi5iqi2": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5iqi2/",
          "text": "Based off of everyone’s comments, I might try to talk to the professor more during OH",
          "author": "PBAuser102",
          "created": 1635276499,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi6856n": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6856n/",
      "text": "It honestly depends on the situation and how you approach the subject. I’m also an engineering major like you and had a professor last semester who bumped my high B+ to an A when I explained to him everything I was dealing with during the semester along with the possibility of losing a scholarship just like you. Although to be fair, my reasoning for struggling so much was the fact that I worked full time at a hospital doing covid vaccinations the entire semester and was also taking taking 17 credits. I also did go to the professor’s office hours fairly often and all my work was turned in on time. So it all depends on the severity and the sincerity of your situation.",
      "author": "tulip-under-the-sea",
      "created": 1635286599,
      "upvotes": 2,
      "replies": {}
    },
    "hi6fdjm": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6fdjm/",
      "text": "No",
      "author": "nwi210",
      "created": 1635289806,
      "upvotes": 2,
      "replies": {}
    },
    "hi6h11u": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6h11u/",
      "text": "Honestly OP, your comments don’t make it sound like you’ve put in the work this semester or are willing to start trying to build relationships with your professors. If your semester ends in December, that’s plenty of time to study hard and do office hours with your professors and get yourself back up. I don’t have much sympathy for you here, and I doubt your professors will either.",
      "author": "Greanbean18",
      "created": 1635290565,
      "upvotes": 2,
      "replies": {}
    },
    "hi6k0z1": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6k0z1/",
      "text": "And here we engineering students are struggling to get a 3.0 GPA lmaoo",
      "author": "redditislife24",
      "created": 1635291921,
      "upvotes": 2,
      "replies": {}
    },
    "hi6ntct": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6ntct/",
      "text": "No",
      "author": "sprinkles1727",
      "created": 1635293643,
      "upvotes": 2,
      "replies": {}
    },
    "hi71iee": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi71iee/",
      "text": "Nope. Your grade is your grade. As others have mentioned, this will open up a can of worms and can bring down a shitstorm in a wide variety of ways. I'm always happy to help students who seek it out, but you need to be proactive.",
      "author": "purple_ombudsman",
      "created": 1635299849,
      "upvotes": 1,
      "replies": {}
    },
    "hi72xed": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi72xed/",
      "text": "Nope",
      "author": "Environmental-Share7",
      "created": 1635300500,
      "upvotes": 1,
      "replies": {}
    },
    "hi73iv9": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi73iv9/",
      "text": "How dare you say that you don’t want to be screwed over.  You are screwing yourself.",
      "author": "johnsmith069069",
      "created": 1635300779,
      "upvotes": 1,
      "replies": {}
    },
    "hi5nxe3": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5nxe3/",
      "text": "No. This was your job knowing you needed higher scores to do better",
      "author": "TragicalKingdom",
      "created": 1635278484,
      "upvotes": 5,
      "replies": {}
    },
    "hi69qmq": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi69qmq/",
      "text": "Time to study and ask for extra credit. You earned the scholarship and it's not the professors job to keep it.",
      "author": "calmbythewater",
      "created": 1635287300,
      "upvotes": 2,
      "replies": {}
    },
    "hi5yych": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5yych/",
      "text": "Is this your first semester? In my experience, there has usually been a warning semester. So you won’t lose your scholarship for the next semester, but if you don’t get your gpa that semester, then you lose it. Check to make sure you know all the details cause this may be the case",
      "author": "omnomonoms",
      "created": 1635282747,
      "upvotes": 1,
      "replies": {}
    },
    "hi63u07": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi63u07/",
      "text": "See if you could get an extra credit assignment",
      "author": "Meloxian",
      "created": 1635284752,
      "upvotes": 1,
      "replies": {}
    },
    "hi67y8q": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi67y8q/",
      "text": "Most will. If you are good in their class. Participate. Are putting in the effort. And respecting them as a teacher. There are some profs who will not in the slightest help and in that case your SOL. But, most if they see your situation and you are a good kid, and you approach early in the semester you should get the help you need!",
      "author": "scorpion252",
      "created": 1635286513,
      "upvotes": 1,
      "replies": {}
    },
    "hi69dsg": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi69dsg/",
      "text": "If you absolutely have to ask, a good way would be visit a lot of office hours and then ask if there is any way to get extra credit in the course because you are this close to losing your scholarship etc. Extra credit opportunities are fairly common, and are definitely ethical enough to be offered to borderline cases like yours. Theres still only a 10-20% chance this’ll work out, but at least it won’t leave the professor startled with an unreasonable and desperate request.",
      "author": "trojanlocos",
      "created": 1635287142,
      "upvotes": 1,
      "replies": {}
    },
    "hi6ft1j": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6ft1j/",
      "text": "Do you have to maintain a 3.5? Or was it just 3.5 at the time you applied to the scholarship? It’s always good to take some freeby classes to boost your gpa like a one unit pe class  give yourself a little bump.",
      "author": "not_mrbrightside",
      "created": 1635290007,
      "upvotes": 1,
      "replies": {}
    },
    "hi6wxi7": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6wxi7/",
      "text": "I work in student affairs - is your scholarship from the university or an outside party? If it’s from your uni, ask to meet with someone in the financial office and talk about it. It’s likely you’ll be put on probation rather than losing it due to one semester, but if that’s not the process ask for that instead of losing it out right. Best of luck to ya!",
      "author": "Tjmagn",
      "created": 1635297787,
      "upvotes": 1,
      "replies": {}
    },
    "hi73atg": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi73atg/",
      "text": "As a TA, I don't think you should ask - I don't see it accomplishing anything other than annoying the teaching staff. The only response you are likely to get is something along the lines of \"Your GPA isn't the response to one homework, one exam, or one single course - it's the collection of everything, and up to you to maintain it\". It's unfortunate, it sucks, but it is how it is - professors need to be fair and unbiased across the board, anything else would be 100% unethical.\n\nNow, I can still offer some advice. \n\n(1) Start going to office hours to clarify any misunderstandings that you may have on any content in the course. After going a few times, you **may** wish to tell your professors that you are trying to improve in their courses because you need to meet scholarship requirements. **Do not, I repeat, do NOT ask them to bump your grade**, however, if you are friendly-ish (to where they would at least recognize you in passing and know your name), then they are likely to be willing to help you pull your own grades up by making sure you really understanding things, and by providing better feedback.\n\n(2) This is complete speculation from me, but check your scholarship requirements again, and maybe call the point of contact for the scholarship. Again, complete speculation, so don't hold me to it, but I would imagine that the GPA requirement isn't a \"one and done\", however, if you fall below the threshold, they will likely put you on a probationary semester to get it together and meet the requirements. One of my old friends from undergrad was in a similar situation, and if I remember correctly, he had a semester to fix it, then a semester later, his scholarship amount lowered, then lowered the next semester, then finally dropped. There wasn't a heartless plummet to $0 of aid after one semester. I will specify that this was a scholarship through the university, I have no idea how it works at other schools or through external funding agencies.\n\n(3) You said you were first-year engineering. I don't know which discipline you study, but there is a good chance that your courses will already be graded on generous scales with some curving. There is a nonzero chance that you are worried about a non-issue that will be fixed upon final grade posting. \n\n(4) The textbooks, office hours, homework assignments, syllabi, and course schedules are your new best friends. Your course syllabus should be under your pillow, right where it belongs, so you will absorb the knowledge as you sleep. Joking aside, it's time to set up shop and have a very boring semester so that you absolutely nail the final exams, since it sounds (per your words) like that is the minimum acceptable outcome. \n\nI am sure you can pull through with this - myself and everyone else on this subreddit are rooting for you, but it's ultimately a problem that will be solved with your own blood, sweat, and tears.",
      "author": "Tall_President",
      "created": 1635300673,
      "upvotes": 1,
      "replies": {}
    },
    "hi73b9f": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi73b9f/",
      "text": "This ain’t high school",
      "author": "J0nhnncrap",
      "created": 1635300679,
      "upvotes": 1,
      "replies": {}
    },
    "hi5j50j": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5j50j/",
      "text": "i’m sorry. this sounds like a stressful situation. but you should at least try, the worst they can say is no.",
      "author": "nonlinearhate",
      "created": 1635276653,
      "upvotes": -3,
      "replies": {}
    },
    "hi5o4dw": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi5o4dw/",
      "text": "I had a professor bump me from an F to a C- because I told them that failing would prevent me from graduating. I also spent a bunch of time in office hours and with TAs but still struggled with the course material. They knew I tried my best even though it didn’t show on exams.",
      "author": "coverletterheadstart",
      "created": 1635278558,
      "upvotes": 0,
      "replies": {
        "hi65yiw": {
          "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi65yiw/",
          "text": "That class must not have been in your major, or that prof stopped giving a fuck.",
          "author": "kryppla",
          "created": 1635285648,
          "upvotes": 2,
          "replies": {
            "hi6edi6": {
              "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi6edi6/",
              "text": "Nope not my major at all. Just a last gen Ed class I took as a senior.",
              "author": "coverletterheadstart",
              "created": 1635289356,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hi73jov": {
      "link": "/r/college/comments/qg9mzu/i_need_my_gpa_to_be_above_35_to_keep_my/hi73jov/",
      "text": "professors typically don't care that much about your scholarship requirements, especially if it is a large lecture class.",
      "author": "beepbopboopbop69",
      "created": 1635300790,
      "upvotes": 1,
      "replies": {}
    }
  }
}