{
  "sid": "q8z3x8",
  "link": "/r/college/comments/q8z3x8/feel_like_im_too_stupid_unmotivated_for_university/",
  "title:": "Feel like im too stupid / unmotivated for university",
  "text": "Ive always felt like im maybe not meant to be at university, and I did consider dropping out first year but then covid hit and I was relying on loan for my rent and now i guess im in third year?\n\nI enjoy the stuff I learn about, but i feel like i dont understand any of it? Everyone on my course is talking about masters and placement schemes theyve applied for or the career they want. I just want to leave my degree with a 2:1 and not lose my job as a barista which I actually really enjoy and plan to work in full time after university.\n\nI come from a family of people who got their undergrad degree, but ended up working in retail and going into retail managment, and I just feel so alien compared to everyone on my course who are from well off familys and whos parents work as doctors / researchers / in finance etc. \n\n&#x200B;\n\nI just feel like a failure for not having a plan / motivation for after uni, but i just feel so drained and im only 3 weeks into third year :/",
  "author": "caffeinatednoctua",
  "created": 1634337126,
  "updated": 1636177048,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hgsyfsq": {
      "link": "/r/college/comments/q8z3x8/feel_like_im_too_stupid_unmotivated_for_university/hgsyfsq/",
      "text": "I guess im confused on why youre getting a degree if you plan on being a barista after you graduate? Also, its really not great to use your student loans for rent",
      "author": "taybay462",
      "created": 1634343069,
      "upvotes": 3,
      "replies": {
        "hgu8tyi": {
          "link": "/r/college/comments/q8z3x8/feel_like_im_too_stupid_unmotivated_for_university/hgu8tyi/",
          "text": "I planned on going into possibly neuroscience research or education when I started my degree, but I've had certain experiences while at university that's put me off these career paths\n\nI dont plan to be a barista forever, but I dont really know what \"professional career\" I want yet, I dont want to rush into further study and be in more debt with regrets\n\nMost people i know use their student loan to live off? Atleast that's how it is here in the uk, but I've always had a part time job while at university for extra income",
          "author": "caffeinatednoctua",
          "created": 1634373115,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgu3lq2": {
      "link": "/r/college/comments/q8z3x8/feel_like_im_too_stupid_unmotivated_for_university/hgu3lq2/",
      "text": "Best advice I can give is that you talk it over with your parents or your loves ones. You may enjoy your barista work but, it's never a bad thing to have a college degree under the belt. Specially if you're in your 3rd year which means you should be one year away from graduating.\n\nStill, don't be afraid of talking about it with your loved ones. Having multiple points of views helps in formulating a decision.",
      "author": "SgtGhost57",
      "created": 1634368572,
      "upvotes": 1,
      "replies": {
        "hgu8zp2": {
          "link": "/r/college/comments/q8z3x8/feel_like_im_too_stupid_unmotivated_for_university/hgu8zp2/",
          "text": "I do plan on finishing the degree, and hopefully getting a 2:1, I'm just finding it hard to feel motivated, I think partly due to not knowing what to do with my degree after I get it.\n\nYeah I might talk to my mom about it, I dont really feel able to talk to my parents about this kind of thing though, but I have a good group of friends in similar positions to mine.",
          "author": "caffeinatednoctua",
          "created": 1634373257,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgvxx3g": {
      "link": "/r/college/comments/q8z3x8/feel_like_im_too_stupid_unmotivated_for_university/hgvxx3g/",
      "text": "College isn't for everybody, don't feel bad about being you.\n\nDr. Grandpa",
      "author": "FreeThinkingGrandpa",
      "created": 1634408150,
      "upvotes": 1,
      "replies": {}
    },
    "hixbwqp": {
      "link": "/r/college/comments/q8z3x8/feel_like_im_too_stupid_unmotivated_for_university/hixbwqp/",
      "text": "if it helps at all, i feel the exact same way and this really helped me feel better just knowing someone else feels that way",
      "author": "Reasonable_Park1868",
      "created": 1635797854,
      "upvotes": 1,
      "replies": {}
    }
  }
}