{"sid": "fh6l6f", "link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/", "title:": "Some tips for online classes", "text": "I saw a lot of stuff on r/college lately from students who have not taken online classes before. Since I teach both online and face-to-face (and have for some time) I thought I'd share some of the tips (and other considerations) with regard to online classes.\n\nTips:\n\n1. First and foremost, it is WAY easier to skip the work when it's online. I plan on having asynchronous lectures for my switch over to online, but even for those faculty hosting live lectures, it will be much tougher to focus. Try to set up an environment where you can stay focused. Wear actual clothes, get your coffee, act like you would if you were in a face-to-face class so your brain doesn't try to switch into \"relax\" mode on you. Try to watch the videos/lectures around the same time your class would have met since you are already in the routine for it.\n\n2. Take notes like you would in a regular class. Again, when it's online (especially recorded) it might feel silly to take notes. But notes help you learn, face-to-face or otherwise.\n\n3. PARTICIPATE! You will not get to hear other students' questions as much (if at all, depending on the format). There is not really an easy way to do discussions so the more you make an effort to participate, the more everyone will get out of it. If you have questions on the material, for the love of God make sure you ask them because no one else is going to ask them for you as often happens in traditional classes.\n\n4. Exams are probably going to be different. You might get a prof that just throws the multiple choice exam online, but most are aware that it is so easy to cheat online that they will format online exams differently. You will see lots more randomization of questions, question order, and answer choice order. You might see online proctor services like Lockdown Browser or Respondus Monitor that literally lock you out of everything but the exam and then record you taking it via webcam. You might end up getting an open book exam that is much more difficult.\n\n5. Usually, you'd be in class about 2.5 hours a week and (hopefully) studying and doing some assignments on top of that. You should keep with that pattern. Assume it'll take you ~2.5 hours just to go through all the learning content. I think a lot of students just erase the class time from their brain and try to just rush through everything, which would not be possible in a face-to-face. This is another way that setting up a \"class time\" for yourself can really help.\n\n6. Editing to add this one: Every prof is going to do this differently. Some might livestream lectures, some might record them, some might not lecture at all. It is really important you keep an eye on your emails, check your notification settings on Canvas/Blackboard/whatever, and get comfortable with 4 or 5 slightly different versions of this.\n\nThe best way I can sum this up is that in a traditional class you are often or at least often can get away with being a passive consumer of the content. In an online class you have to be more of an active participant in your own learning. \n\nOther considerations:\n\n1. Many--MANY--of your professors hate teaching online and have no idea how to do it right. They have never had to before. It is not as simple or easy as it might seem to design a good online learning experience and many faculty have no experience with it and no time to learn. We are all dealing with this change, so try to be patient the best you can. \n\n2. Be open-minded. I teach a topic that can be put online pretty easily, but I have no clue how you would put a chem lab or an acting class online. And neither do a lot of faculty. This will be testing the creativity of many professors. Every course has learning objectives you are expected to be assessed on, and they will have to find a way to do that.\n\n3. Technical issues are going to be rampant, both because of the pressure put on the learning management systems and because of instructor incompetence + poor user interfaces. Don't start stuff at the last minute. It's not a good idea in general but you run the risk of technical issues preventing you from finishing. Your professors are not tech support either and chances are they have no clue what's wrong. You should probably contact your campus tech support folks for help, not your professor, unless you're sure it's something wrong on their end.\n\n4. Editing to add: Everything is going to be just fine. It's going to be weird. It's going to be an adjustment. But ultimately if you pay attention to your profs and keep up with the work this will just have been an inconvenience in the end.\n\nI'm sure others can chime in with more suggestions or comments. Good luck with the transition.", "author": "Dr_Pizzas", "created": 1583969193, "retrieved": 1632947149, "over_18": false, "upvotes": 1652, "upvote_ratio": 0.99, "comments": {"fljj308": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fljj308/", "text": "Do they take attendance?", "author": null, "created": 1585214742, "upvotes": 1}, "fl5xpem": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fl5xpem/", "text": "Guyss if yall don't know how to use the ZOOM online thing like me, my bud made a really nice video explaing how to use it! This should help out anyone about to go into the online courses soon!!\n\n Tutorial Vid: [https://youtu.be/ZlZLBr9on-I](https://youtu.be/ZlZLBr9on-I)", "author": "INeedLogicHelpPlz", "created": 1584848467, "upvotes": 1}, "fl1f8it": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fl1f8it/", "text": "For students taking online classes (Elementary school-High School), here are a few tips!\n\nCreate a schedule with breaks and all\n\nTry to spend a block of time on one class at a time\n\nMake time to relax or even take a nap....yes, that will help you power through\n\nCreate goals for your day\n\nCreate a to-do list\n\nMake sure you are doing things you love- (drawing, singing, biking)\n\nListen to a podcast instead of reading or watching a show\n\n\\*Don’t forget to make time for chores: Your family will need your help during this time.\\* ", "author": "A_College2", "created": 1584727818, "upvotes": 1}, "fkz6jss": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkz6jss/", "text": "Here are tips from a Finance tutor to help you stay ahead on your course material during this transition to online learning; [https://www.bettytutors.com/post/how-students-can-stay-ahead-with-coursematerial-amidst-coronavirus-pandemic-blog](https://www.bettytutors.com/post/how-students-can-stay-ahead-with-coursematerial-amidst-coronavirus-pandemic-blog)", "author": "carah1089", "created": 1584663896, "upvotes": 1}, "fkyb5n7": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkyb5n7/", "text": "Great tips! I also made a video to help people out with increasing productivity. 1) Change out of your pajamas, 2) keep a schedule, 3) Hide your phone, 4) use the Pomodoro technique, 5) listen to music. Check out the video if you’d like \n\n[How to Increase Productivity While Quarantined](https://youtu.be/ohHtC6qKsWI)", "author": null, "created": 1584645247, "upvotes": 1}, "fkvqkvk": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkvqkvk/", "text": "I would just add that if you are getting an online lecture instead of an in-class lecture, prepare for it like you normally would. That means you do the reading before the class -- because you ALWAYS do the readings amiright ;-) -- and be prepared to ask/answer questions and take notes. \n\nIf you take notes with your laptop (you should do this by hand btw; you'll retain way more information), put the lecture on your phone so you can use your laptop as you normally do. \n\nFind out what method the instructor wants to use for you to contribute. Maybe there will be a discussion forum of some kind online. Take advantage of this! It's an opportunity to talk about what you're learning, which is a great way to actually learn! \n\nAlso, minimize distractions. If other people live with you, make sure they know when you are \"in class.\" They should leave you alone as much as they would leave you alone if you were sitting in the lecture hall.  \n\nIn short, don't take this as a chance to do less. In fact, plan to do more. Learning with less structure is an adjustment, but one you can handle if you prepare for it!", "author": "Robert_H_", "created": 1584574654, "upvotes": 1}, "fkvpd3q": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkvpd3q/", "text": "I’m a ResLife Staff member taking classes at a university. I spent a year learning Japanese on my own, and joined Japanese II this semester. It’s been a lot of fun, and in some aspects the students are ahead of me. In many others, they will hear me say something and have absolutely no clue what I’m on.\n\nJust before this all went down, I was planning out an extracurricular Japanese film club, to try and expose them to more Japanese culture that ISN’T anime (it’s as bad as you think, maybe worse). I have the movies on my iTunes account and I was going to meet with the students in a residence hall lounge or one of our lecture halls to have watch parties. We have a GroupMe together, a list of a movies, and finding time will be even easier now.\n\nWith that said: is there a way to stream films I own on my iTunes account in a way that everyone can see and hear it? A few years ago I dated someone long distance and we tried this, but my iTunes movies would never stream through the methods we tried. Now it’s 2020, though, and video communication seems to be the likely way of life for the next few months. Does anyone have suggestions here?\n\nThank you in advance!", "author": null, "created": 1584573930, "upvotes": 1}, "fkttcp8": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkttcp8/", "text": "2.5 hours a week??? Tf? I literally have 4 hours minimum a day besides Fridays", "author": "KroegKind", "created": 1584533968, "upvotes": 1}, "fkm7dfn": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkm7dfn/", "text": "I deeply understand that it's a huge adjustment. Here are some tips to help students in the transition ; [https://www.bettytutors.com/post/how-students-can-stay-ahead-with-coursematerial-amidst-coronavirus-pandemic-blog](https://www.bettytutors.com/post/how-students-can-stay-ahead-with-coursematerial-amidst-coronavirus-pandemic-blog)\n\nAlso feel free to message me if you are taking Finance class and would like a little more help going over the class material. Stay safe everyone :)", "author": "carah1089", "created": 1584322578, "upvotes": 1}, "fkjk2dc": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkjk2dc/", "text": "Thank you!", "author": "fxuk", "created": 1584248373, "upvotes": 1}, "fkjdnlo": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkjdnlo/", "text": "If they do exams with monitoring, what if you don't have a webcam? My laptop is pretty lack luster, but had a webcam, and would hopefully run whatever it is I have to do.\n\nBut if not, my desktop doesn't have a webcam and I don't really have the means to buy a webcam unless I can find one really cheap?", "author": "SaeInsanity45", "created": 1584242934, "upvotes": 1}, "fkja9fp": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkja9fp/", "text": "i actually have questions about respondus: is it free? i really don’t have the money to pay for something else right now, especially something i’ll never use again\n2. i keep my webcam covered, is that going to be an issue and will i have to uncover it? ALSO i’m technically ccp student, so wouldn’t it technically be an invasion of privacy or something like that considering i’m under 18?", "author": "brit_666", "created": 1584240312, "upvotes": 1}, "fkgvgpq": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkgvgpq/", "text": "[deleted]", "author": null, "created": 1584176291, "upvotes": 1}, "fkgsmov": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkgsmov/", "text": "Thank you for this!!! It’s my freshman year(what a way to end my first year of college am I right lol) and I never had the opportunity to take online classes in high school. I will def keep this in mind and use it the best I can.", "author": "I_Am_Confusionn", "created": 1584172329, "upvotes": 3}, "fkg840h": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkg840h/", "text": "Thank you for posting this.  I just came here because all of my classes (including a microbiology lab) have been moved online and I am feeling lost.  I appreciate you being here to help me not freak out.", "author": "kimareth", "created": 1584152352, "upvotes": 1}, "fke99xd": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fke99xd/", "text": "[deleted]", "author": null, "created": 1584108246, "upvotes": 1}, "fkd6gi1": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkd6gi1/", "text": "Any tips for online college algebra class? Im making a low B right now..the material is still a little hard to understand. I have never taken an online class.", "author": "gabmary79", "created": 1584069585, "upvotes": 1}, "fkd54ef": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkd54ef/", "text": "common sense but online classes are not a break!!! you have to work insanely hard", "author": "Carl2011", "created": 1584068611, "upvotes": 3}, "fkat621": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkat621/", "text": "i'm wondering if labs are going to be online labs. i remember using a website in my high school physics class that had online labs", "author": "crankthatshane", "created": 1584018848, "upvotes": 1}, "fkaihtz": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fkaihtz/", "text": "Any idea what these colleges are doing about the students that paid for room and board? Will that money paid be transferred to next year?", "author": "superking75", "created": 1584009448, "upvotes": 2}, "fka5jgn": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fka5jgn/", "text": "What I don’t get is online exams. Unless they’re gonna use video recorders(which is hard to set up for classes with hundreds/thousands of people in a few days), everyone will simply cheat. I can just have two PC’s and use the other PC to look up answers. A video recorder might not even solve that tbh.", "author": "nwi210", "created": 1583993304, "upvotes": 14}, "fka4m4u": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fka4m4u/", "text": "Is this like video lectures? If so, are they captioned? I've done online schooling in high school through a program designed for disability so I don't know how other online programs work (except MVS which sucks ass).", "author": "arlomilano", "created": 1583992328, "upvotes": 4}, "fka1qtr": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fka1qtr/", "text": "@Mods\n\nCan this get pinned please? 💙", "author": "_34_", "created": 1583989522, "upvotes": 5}, "fka1ert": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fka1ert/", "text": "Wait so even taking an online class you still have to attend to campus?", "author": "_readyforww3", "created": 1583989220, "upvotes": 1}, "fk9ziqc": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9ziqc/", "text": "I’m glad that my classes are going to be fine in an online format and that I did high school 100% online so I’m more used to online classes than face to face but I go to a community college and my school has technical degrees like wielding and I’m just like... how can you teach wielding online? Nursing? Any degree that requires hands on learning is going to be v fucked.", "author": "extrasmallbillie", "created": 1583987636, "upvotes": 4}, "fk9v0on": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9v0on/", "text": "Going off of all of the comments about non-lecture courses (labs, acting, art) we have to realize that it does not help to panic or stress about the classes as a student. Hundreds of universities are now moving online and many professors are going to have to figure out what will happen. Everyone is going through the same thing though so everyone will be understanding.", "author": "somecreativename101", "created": 1583984256, "upvotes": 43}, "fk9uy4c": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9uy4c/", "text": "[deleted]", "author": null, "created": 1583984206, "upvotes": 23}, "fk9ufbr": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9ufbr/", "text": "My major is carpentry. All of my classes besides one are entirely lab time. I’ve got no idea how this is going to work as I do not have almost any of the tools at my disposal at home as I do at campus.", "author": "iamnotajeww", "created": 1583983852, "upvotes": 16}, "fk9rt7v": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9rt7v/", "text": "I'm really concerned for my uni's upcoming switch to online classes as I go to an art university and ALL of our studio work is physical and done in class. How on earth are we supposed to showcase our massive module furniture assignment through skype??????????", "author": "nicoliravi0li", "created": 1583982143, "upvotes": 26}, "fk9q9zc": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9q9zc/", "text": "I'm taking my entire degree online, some from schools that are mostly traditional, so I can totally confirm the \"some professors have no idea how to teach online\" thing.\n\nThis is going to be a bit of a disaster for a lot of people because online school requires so much more self-control. Also, schools that suddenly switch to online-only are going to have problems with lack of online curriculum. I question how they are handling that.\n\nHow I handle school, even a full-time course load, is to do school in the morning and evening and leave the afternoon for my own stuff. Gives you a break and prevents burnout.", "author": "Kalsifur", "created": 1583981180, "upvotes": 65}, "fk9gtxi": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9gtxi/", "text": "Thank you for posting this:)", "author": "Kouglove", "created": 1583975790, "upvotes": 6}, "fk9acvy": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk9acvy/", "text": "although I am also currently experiencing this transition I have my fair share of experience with online classes as well, and I have a few suggestions to add. they may be common sense, but I'm hoping I can help some people out!\n\n1. many students may feel confined to their home after being on campus and being able to go to different study spots/locations/outdoor areas. don't let this limit you! go to your local coffee house, sit on your porch, find a quiet area at your local park, etc. just because you may not have that 'on-campus feel' doesn't mean you have to go stir crazy sitting in your house! \n2. from my experience, if you are a morning person log into your online classes first thing in the morning to check discussion posts and send out some replies or questions and if you are a night person sit down after dinner/before bed and crank out your schoolwork. you may not be in class, but sitting down with your usual cup of coffee, a snack, and your study materials will make you feel more inclined to focus just as you do in lectures.\n3. keep. a . calendar. whether it is a desk calendar, phone calendar, planner, etc. many people may already do this but they may feel a little more frazzled and unorganized due to the sudden transition. I personally use google calendar and a desk calendar. this will help you easily be able to map out your week. online classes usually have specific timed deadlines just like your in-person classes do so make sure to detail the times. set up reminders to notify you a day before a homework or paper is due, or if a bigger project is due set reminders up to a week in advance. check your due dates often as they could change due to the transition to online courses. \n4. lastly, just because you have online classes doesn't mean you can surf the web for half of the day while you should be doing your schoolwork. although online classes might make you more inclined to shift over to playing your favorite video game or shopping for clothes during your schoolwork, think of it as you would when you're attending lectures: if you spend your time surfing the web the whole class time, you're going to be completely lost when it comes to exams/quizzes/papers/general content. just as op says in #5, set aside some \"class time\" and the rest of the day  you can do whatever your heart desires. \n\nfrom one student to another, good luck everyone!", "author": "stephbisnette", "created": 1583971994, "upvotes": 145}, "fk98pir": {"link": "/r/college/comments/fh6l6f/some_tips_for_online_classes/fk98pir/", "text": "This is very sensible advice.\n\nIf I might add, as your professors send out information of software you need and instructions you need to follow, don't wait till the last minute to see if it works.\n\nDon't just read the instructions on your phone as if it was a text from a friend.", "author": "PersephoneIsNotHome", "created": 1583971016, "upvotes": 297}}}