{
  "sid": "qgdkw5",
  "link": "/r/college/comments/qgdkw5/how_do_i_tell_my_mom_that_im_not_ready_for_college/",
  "title:": "How do I tell my mom that I'm not ready for college?",
  "text": "I've been raised by parents who went to college for 4+ years and now it's \"my turn\". I graduated from high school this past spring and I started classes this fall. I took four classes and I just dropped one due to stress. I just got my second job and I love working. I have more fun working than I do in college. I really want to tell my mom that I want to take the next quarter off but she's the kind of person that really really wants her kids to go to college and already judges my friends who aren't currently in college. I've had no motivation to study or do assignments and I feel like I'm a failure to my parents. I haven't told her anything about me dropping one of my classes or that I haven't turned anything in for the past two weeks. I already suffer from depression and ever since I've started college my mental health has been going down hill and the only thing I actually look forward to is work. Trust me, I do want to go to college but I don't want to when I know I won't put effort into it.",
  "author": "babypandagod",
  "created": 1635274949,
  "updated": 1635302343,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hi5iq7x": {
      "link": "/r/college/comments/qgdkw5/how_do_i_tell_my_mom_that_im_not_ready_for_college/hi5iq7x/",
      "text": "You’re an adult. You make the decisions now. College isn’t required to be successful.",
      "author": "Spicybooiii",
      "created": 1635276496,
      "upvotes": 11,
      "replies": {}
    },
    "hi5j8td": {
      "link": "/r/college/comments/qgdkw5/how_do_i_tell_my_mom_that_im_not_ready_for_college/hi5j8td/",
      "text": "Try saying \"mom I'm not ready for college\"",
      "author": "IntelligentHuman_237",
      "created": 1635276693,
      "upvotes": 6,
      "replies": {}
    },
    "hi5mm2l": {
      "link": "/r/college/comments/qgdkw5/how_do_i_tell_my_mom_that_im_not_ready_for_college/hi5mm2l/",
      "text": "I'd come up with a game plan for how you're going to make the most of your time off college. Get a job that has better career prospects than retail. Try jobs or volunteer opportunities that help you determine what you might want to go to college for. Make a linkedin account and start networking with people about careers. Basically show that you are trying to develop your potential and self sufficiency, because that's probably why she goes you'll go to college.",
      "author": "Thelton26",
      "created": 1635277982,
      "upvotes": 2,
      "replies": {}
    },
    "hi5n9fk": {
      "link": "/r/college/comments/qgdkw5/how_do_i_tell_my_mom_that_im_not_ready_for_college/hi5n9fk/",
      "text": "It's a waste of time and money to be in college if you don't really know why you want to be there. Try having a conversation with your mom about it. You don't have to have a decision yet maybe start by telling her how you are currently feeling. If your parents are paying for your college use that- tell them they would be better of paying later when it will really be useful than paying now when you don't know what you are really doing there.",
      "author": "gegolive",
      "created": 1635278230,
      "upvotes": 2,
      "replies": {}
    },
    "hi6tog4": {
      "link": "/r/college/comments/qgdkw5/how_do_i_tell_my_mom_that_im_not_ready_for_college/hi6tog4/",
      "text": "Screenshot this and show it to your parents.",
      "author": "2Browneyes2",
      "created": 1635296302,
      "upvotes": 1,
      "replies": {}
    },
    "hi76d35": {
      "link": "/r/college/comments/qgdkw5/how_do_i_tell_my_mom_that_im_not_ready_for_college/hi76d35/",
      "text": "common trap that students fall into, because they get immediate returns (their hourly wage) and job is much easier than studying. delay your gratification for bigger reward.",
      "author": "wobbletelescope",
      "created": 1635302073,
      "upvotes": 1,
      "replies": {}
    }
  }
}