{
  "sid": "q0to4e",
  "link": "/r/college/comments/q0to4e/im_taking_english_101_later_this_year_and_ive/",
  "title:": "I’m taking English 101 later this year and I’ve never written a high school essay. What should I do?",
  "text": "\nI have a big problem. I’m dual enrolling at a local community college later this year but I’ve never written any kind of essay before. For context, I go to a very small school ( around 60 kids ). Because of this, my school only has the resources for 2 English classes, which students are placed in depending on grade level. These classes are almost entirely focused on reading comprehension. For writing assignments, students are typically only required to write a few paragraphs. While in high school, I’ve never written more than a page for any of my classes.\n\nI’m afraid that I won’t be prepared at all for my classes. I know college papers are supposedly far more difficult to write than high school papers. I doubt I’ll be able to handle a multi-page essay. What steps should I take to prepare myself for my class, and how can I ensure I don’t fail? Any help would be greatly appreciated.",
  "author": "Sparkiritezii",
  "created": 1633304538,
  "updated": 1634089617,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfaj7gn": {
      "link": "/r/college/comments/q0to4e/im_taking_english_101_later_this_year_and_ive/hfaj7gn/",
      "text": "I think you'll be fine, generally speaking. I was nervous taking my first College writing class also, but *most* Writing 101 classes usually teach you how to write and go step by step on the process.  I had a horribly rated professor and he still tought well enough for me to get a low A in the class. Most high school writing teachers don't actually teach the college-way correctly anyways.",
      "author": "Yeezyhampton",
      "created": 1633306371,
      "upvotes": 2,
      "replies": {}
    },
    "hfawbc9": {
      "link": "/r/college/comments/q0to4e/im_taking_english_101_later_this_year_and_ive/hfawbc9/",
      "text": "English 101 should help ease you into writing college essays. But to prepare, the best thing you could do is practice writing essays! \n\n*How do you do this?* Pick a subject you’re learning in your current classes and practice writing an essay that summarizes the key information you learned that week. Try to set a word count to meet the page length requirement, such as 500 words. When you do this also practice using MLA or APA format.\n\n*But that doesn’t tell me how to really write it?* There are tons of books at the library that can guide you to the key things you should include, definitely check those out! Looking at example essays is also useful in seeing how people tie ideas together and add length through the use of quotes, explanations, and ideas.\n[Here is a resource you can use!](https://owlcation.com/academia/How-to-Write-a-Summary-Analysis-and-Response-Essay)\n\nFeel free to PM if you need any extra help :)",
      "author": "shoelaceys7373",
      "created": 1633312782,
      "upvotes": 2,
      "replies": {}
    }
  }
}