{
  "sid": "qgjrxw",
  "link": "/r/college/comments/qgjrxw/should_i_transfer_to_get_the_college_experience/",
  "title:": "Should I transfer to get the “college experience”?",
  "text": "I’m 22 and currently have 2 semesters left after this one to graduate. I’m a commuter student because I’ve gotten a free ride to the state school I attend so far, so I haven’t had to pay any tuition at all. I’m pretty dedicated to my studies and have been able to keep up a 4.0 GPA so far, but I feel like my while entire experience in college so far has been soul-crushing.\n\nI’ve never had the traditional college experience of dorming, partying, & meeting lots of new people. My school is really small & there are barely any events that go on (it also has zero party scene). I already regret not going to a big out-of-state party school straight out of high school. I’m not going to lie, being a commuter student 25 mins away from home really sucks.\n\nI have to say that while being a commuter student tho, I’ve been able to work & have saved up almost $30k. The school that I want to transfer to is around that same amount a year for tuition. \n\nDo you think it would be a wise decision to transfer to this bigger party school that has around 50k students? I’ve been accepted to already but I didn’t go this fall because I was afraid of getting into debt. There’s also the possibility that they won’t transfer all of my credits in, forcing me to delay graduation. I don’t wanna regret wasting my youth with a boring life so I wanna know your thoughts on the matter.",
  "author": "vexophobic",
  "created": 1635292888,
  "updated": 1635302340,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hi6metn": {
      "link": "/r/college/comments/qgjrxw/should_i_transfer_to_get_the_college_experience/hi6metn/",
      "text": "Honestly seems like a dumb decision. College isn’t the end of fun.",
      "author": "wolfangggg",
      "created": 1635293008,
      "upvotes": 17,
      "replies": {
        "hi6mv69": {
          "link": "/r/college/comments/qgjrxw/should_i_transfer_to_get_the_college_experience/hi6mv69/",
          "text": "I’ve planned to travel through Europe for a month next summer but I don’t think that’d be a comparable experience",
          "author": "vexophobic",
          "created": 1635293213,
          "upvotes": 4,
          "replies": {
            "hi6sosr": {
              "link": "/r/college/comments/qgjrxw/should_i_transfer_to_get_the_college_experience/hi6sosr/",
              "text": "The “college experience” is nonsense. It’s just something teenagers use to justify tremendous debt when they know it’s not the right decision.",
              "author": "wolfangggg",
              "created": 1635295849,
              "upvotes": 1,
              "replies": {
                "hi71uu1": {
                  "link": "/r/college/comments/qgjrxw/should_i_transfer_to_get_the_college_experience/hi71uu1/",
                  "text": "The college experience isn't nonsense, and it's reasonable to want to experience it but at this point that ship has sailed. He chose to focus on his career/ studies instead of the social aspect which is fine, it's not like your social life ends after college",
                  "author": "thebronzejohnson",
                  "created": 1635300007,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi6ooze": {
      "link": "/r/college/comments/qgjrxw/should_i_transfer_to_get_the_college_experience/hi6ooze/",
      "text": "Nah, focus on your studies and finances, then once you have settled in and start to figure out your young life, then I highly suggest you make time for social events and what not.",
      "author": "SaleSubstantial9962",
      "created": 1635294029,
      "upvotes": 5,
      "replies": {}
    },
    "hi6x64m": {
      "link": "/r/college/comments/qgjrxw/should_i_transfer_to_get_the_college_experience/hi6x64m/",
      "text": "No, this makes no sense especially at this point in your academic career. You have no debt, made good financial decisions thus far and are ahead of most students with $30k saved up. Use that to travel or put a down payment on a house/apartment. Plus it’ll be a real pain in the butt if they don’t transfer all your credits. Don’t mess that all up for two semesters of a “college experience” As a fellow commuter, I understand where you’re coming from but, ultimately, college is for studying and as the other redditor said, fun doesnt end here.",
      "author": "danielr088",
      "created": 1635297899,
      "upvotes": 1,
      "replies": {}
    },
    "hi6owes": {
      "link": "/r/college/comments/qgjrxw/should_i_transfer_to_get_the_college_experience/hi6owes/",
      "text": "I am a commuter as well, I understand where you were coming from. However a lot of colleges are just what you make of them. If you want to go party I suggest going to clubs/bars in your nearest big city. You could also join a very close relationship club at your school or form your own! I think the most fun is when you are traveling with your friends. Use the money you saved to travel, invest, maybe even start up some thing.",
      "author": "Diligent_Tea3364",
      "created": 1635294122,
      "upvotes": 3,
      "replies": {}
    },
    "hi6yigw": {
      "link": "/r/college/comments/qgjrxw/should_i_transfer_to_get_the_college_experience/hi6yigw/",
      "text": "This is one of the more crazy things I’ve read on this sub. You want to throw away 30k so you can party at college? Which will also mean your GPA will probably slip as well. College isn’t about partying. It sounds super immature tbh. You have a chance at a fully paid school experience that others would kill for, and you wanna transfer and dump money into another school so you can party. You also said it might delay your graduation if the credits don’t all transfer. Why would you ever delay graduating for partying? You can make friends at your current school and party with them. There’s also no guarantee that moving to a new school will mean you get to party all the time. Use that nice nest egg you saved up for something awesome. I think you will highly regret throwing away all that money to school when you didn’t have to, just to be able to party. Just my opinion.",
      "author": "caligirlthrowaway104",
      "created": 1635298508,
      "upvotes": 1,
      "replies": {}
    }
  }
}