{
  "sid": "pwsfsa",
  "link": "/r/college/comments/pwsfsa/i_am_unsure_about_going_to_college/",
  "title:": "I am unsure about going to college.",
  "text": "I am a senior in high school, and school stress is crazy. I know that college courses are harder than high school courses, so my stress would probably shoot through the roof. For that reason, I don’t want to go to college, but I don’t know what I would do without it. Any tips/help?",
  "author": "JAk36804",
  "created": 1632782326,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hekdcge": {
      "link": "/r/college/comments/pwsfsa/i_am_unsure_about_going_to_college/hekdcge/",
      "text": "Take community college classes to figure out your interests and strengths. It’s cheaper and an easier workload.",
      "author": "syng626",
      "created": 1632809586,
      "upvotes": 1,
      "replies": {}
    },
    "hejqudu": {
      "link": "/r/college/comments/pwsfsa/i_am_unsure_about_going_to_college/hejqudu/",
      "text": "If there's a career you're passionate about pursuing that requires a college degree, go for it; I'm sure you can make it happen.\n\nIf not, though, the stress and financial burden might not be worth it. Community college, trade schools, etc. are great options to get a stable, well-paying career without the unhealthy level of stress.\n\nEdit: And you can always go back later to get the college degree if you want it once you figure out your goals and plans more. It's never too late.",
      "author": "91p348",
      "created": 1632796210,
      "upvotes": 1,
      "replies": {}
    },
    "hejnf0c": {
      "link": "/r/college/comments/pwsfsa/i_am_unsure_about_going_to_college/hejnf0c/",
      "text": "college is and is not harder than highschool. Yeah the rigor is more intense but you are taking classes you enjoy so most don’t mind having to put in the work. Keep that in mind.",
      "author": "rynpickles",
      "created": 1632794601,
      "upvotes": 1,
      "replies": {}
    },
    "hej3jkd": {
      "link": "/r/college/comments/pwsfsa/i_am_unsure_about_going_to_college/hej3jkd/",
      "text": "When I graduated from high school I took a semester off and just worked for a bit. I then went to the community college in my town because I didn’t feel ready to go to a four year school. I honestly recommend community college to everyone because it’s the best way to go if you don’t know what you want to do or study. Also the courses prepare you for when you go off to college and they are challenging but not too overwhelming. I also struggle a lot with anxiety and I started off going to community college part time to ease into it and now I’m full time and it’s going okay. Just take it slow and do what you are most comfortable with. It’s easy to feel anxious when all of your friends are going away to school, but it’s not for everyone and there are so many paths one can take even without a college degree.",
      "author": "Anxiousqueen97",
      "created": 1632785342,
      "upvotes": 4,
      "replies": {}
    },
    "hej2eef": {
      "link": "/r/college/comments/pwsfsa/i_am_unsure_about_going_to_college/hej2eef/",
      "text": "ok. i was in the exact same boat, especially after quarantine. but I’m genuinely saying that college isn’t that bad. i HIGHLY recommend going to a JC, it eases you into the sort of curriculum nicely (personally it did for me). Honestly college stress is pretty intense but if you just do the work it dies down- and if you take easy professors ur golden. If u end up not going, there r also many jobs that don’t need a college degree. But JC was the best decision I’ve ever made… highly recommend!!!",
      "author": "More_Ad4661",
      "created": 1632784785,
      "upvotes": 1,
      "replies": {}
    },
    "heiy7hk": {
      "link": "/r/college/comments/pwsfsa/i_am_unsure_about_going_to_college/heiy7hk/",
      "text": "I would recommend to take a year off for before going to college so you can see where you are in another year. I’m a new college student and I wish I could’ve taken another year off. I don’t handle stress well and I recently had a breakdown and now I feel like I can’t do anything and now I’m struggling with schoolwork. It’s completely fine if you don’t immediately go to college. College will always be there and your health and your mental state matters more.",
      "author": "Not__-__Real",
      "created": 1632782763,
      "upvotes": 6,
      "replies": {}
    }
  },
  "updated": 1634054159
}