{
  "sid": "qdbxv3",
  "link": "/r/college/comments/qdbxv3/what_can_i_write_on_my_door_to_get_my_neighbors/",
  "title:": "What can I write on my door to get my neighbors to shut up?",
  "text": "I go to a very small university, our residence is about 300 people. Everyone on my dorm floor is pretty quiet and respectful except for 7 people. These 7 people are some of the loudest human beings on earth (and I grew up with 4 brothers, I’m used to noise)\n\nI don’t care how loud they are on the weekend or at what time they are loud on the weekend, it’s weeknights that I care about. Our walls are paper thin and if anything the doors just amplify the sound into my dorm. All of the boys shower together at 11:30 at night, running down the hall in shower shoes, yelling to each other. Around 1 a.m. they slam the doors and go around to each others rooms, then run down and yell down the hall a little more. The biggest issue is, I can hear them through my earplugs. \n\nThey aren’t even my direct neighbors, they are 3 and 4 doors down.\n\nI have asked them to keep it down a few times, one time I finally snapped after pulling a 36 hour all nighter (I promptly apologized for snapping). Nothing has changed, every night just as loud.\n\nCan I write on the whiteboard on my door “I will pay you to shut up” or “please stop stampeding after 11”?\n Anyone got any ideas? \n\nAlso, no, my university doesn’t have quiet hours, quiet hour are supposed to be always here so there is no specific time.",
  "author": "Anon2144553",
  "created": 1634888945,
  "updated": 1635184758,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhlux70": {
      "link": "/r/college/comments/qdbxv3/what_can_i_write_on_my_door_to_get_my_neighbors/hhlux70/",
      "text": "Do you have an RA or some type of form advisor or really anyone who can talk to them and threaten them with a write up?",
      "author": "coraline_button_",
      "created": 1634901927,
      "upvotes": 4,
      "replies": {}
    }
  }
}