{
  "sid": "qw4pzq",
  "link": "/r/college/comments/qw4pzq/all_my_writing_is_bad_in_my_mind/",
  "title:": "All my writing is bad in my mind",
  "text": "No matter what I tell my myself I cant accept my writing as on the level of a college student. It is not the writing itself, i can write just fine but each time i critique it to hell and tell myself it looks like something a middle schooler wrote. How to get out this rut and not worry about how ill do on my writing and be confident in my ability to write? I have a paper due tommorrow and I can't stop mentally beating myself up over how it is going so far.",
  "author": "321ECRAB123",
  "created": 1637171236,
  "updated": 1637398791,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hl0i60y": {
      "link": "/r/college/comments/qw4pzq/all_my_writing_is_bad_in_my_mind/hl0i60y/",
      "text": "Have you been to the writing center at your school? Talked to your professors? What do others say?",
      "author": "Laurasaur28",
      "created": 1637171443,
      "upvotes": 1,
      "replies": {}
    },
    "hl1cufu": {
      "link": "/r/college/comments/qw4pzq/all_my_writing_is_bad_in_my_mind/hl1cufu/",
      "text": "Seconding the mod's advice as far as seeking outside input. Those are resources that would improve your writing if it *does* have room for improvement, but it can also give you this objective external voice to weigh against what you're feeling, to see if what you feel is realistic.\n\n&#x200B;\n\nI also find that, if you can, it can help to twist that anxiety into something productive -- in this case, the drive to continue improving your writing. So, if you don't like your writing, what *specifically* is bothering you about it? Breaking it down beyond \"this is shit\" can be really helpful. Then doing things like reading stuff you *do* like and thinking about why it works so well, or reading more things about writing in your discipline, seeing how more established folks write, etc. At the end of the day, writing is a skill, and like any other skill, time and practice will always make it a little better.",
      "author": "torgoboi",
      "created": 1637183638,
      "upvotes": 1,
      "replies": {}
    }
  }
}