{
  "sid": "qi4vbw",
  "link": "/r/college/comments/qi4vbw/wanting_to_become_a_cs_major_in_college/",
  "title:": "Wanting to become a CS Major in college",
  "text": "When I get to college level I went to become a Major in CS what classes/AP classes should I take to become this in high school? I’m already in AP CSP",
  "author": "Pumpkinhead3125",
  "created": 1635482501,
  "updated": 1635779889,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hih5io7": {
      "link": "/r/college/comments/qi4vbw/wanting_to_become_a_cs_major_in_college/hih5io7/",
      "text": "the best thing you can do for yourself is to take dual credit classes over AP.",
      "author": "rynpickles",
      "created": 1635482847,
      "upvotes": 1,
      "replies": {
        "hih5oqu": {
          "link": "/r/college/comments/qi4vbw/wanting_to_become_a_cs_major_in_college/hih5oqu/",
          "text": "For my school dual credit only goes for Jeffco what’s the point for them if i dont go to that college?",
          "author": "Pumpkinhead3125",
          "created": 1635482956,
          "upvotes": 1,
          "replies": {
            "hih5vgl": {
              "link": "/r/college/comments/qi4vbw/wanting_to_become_a_cs_major_in_college/hih5vgl/",
              "text": "I don’t know what jeffco is. Some schools may only *partner* with a specific college but those will still count towards other schools unless jeffco is unaccredited or they only offer dual for associate programs.",
              "author": "rynpickles",
              "created": 1635483073,
              "upvotes": 1,
              "replies": {
                "hih640h": {
                  "link": "/r/college/comments/qi4vbw/wanting_to_become_a_cs_major_in_college/hih640h/",
                  "text": "It states “In cooperation with Jefferson College, students enrolling in designated classes during the normal school day can receive both high school and college credit.“ Jeffco Is Jefferson Community College",
                  "author": "Pumpkinhead3125",
                  "created": 1635483228,
                  "upvotes": 1,
                  "replies": {
                    "hih6933": {
                      "link": "/r/college/comments/qi4vbw/wanting_to_become_a_cs_major_in_college/hih6933/",
                      "text": "Sounds to me like they would still transfer to whatever college you want to attend. Ask the coordinator for the program. It would benefit you more.",
                      "author": "rynpickles",
                      "created": 1635483318,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hihhdhk": {
                      "link": "/r/college/comments/qi4vbw/wanting_to_become_a_cs_major_in_college/hihhdhk/",
                      "text": "Ask an advisor at Jeffco and/or your school if those dual credit course credits would transfer to other institutions, possibly even specifying whichever college you might plan to attend.",
                      "author": "NoDryHands",
                      "created": 1635491610,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hih7rxz": {
      "link": "/r/college/comments/qi4vbw/wanting_to_become_a_cs_major_in_college/hih7rxz/",
      "text": "Make sure you have all your gen eds. Look into a math class. If your hs offers it, take AP Calc, maybe even AP Stats. You can always look at schools you’re interested in and see their requirements for the CS major. You don’t really need specific classes necessarily to get into the major after graduating highschool, but obviously taking AP level courses in highschool can count for credit so you don’t have to take them in college. I’m sure CS majors might require physics and a science course. So maybe AP Physics or AP Bio/Chem. Keep your class schedule pretty rigorous and do well in the APs so your GPA stays up! Good luck",
      "author": "alwaystrivenprosper",
      "created": 1635484345,
      "upvotes": 1,
      "replies": {}
    },
    "hii681q": {
      "link": "/r/college/comments/qi4vbw/wanting_to_become_a_cs_major_in_college/hii681q/",
      "text": "The hardest thing about CS imo is the math requirements aside from actually learning to program. So be prepared to learn Calc 1-3, Discrete mathematics, Linear Algebra, or physics. In my experience, they generally have you do Calc 1-2, and then give you the option of what higher-level maths you wanna take that I stated.\n\n&#x200B;\n\nEDIT: As for science, choose bio over chemistry. Easier IMO and more interesting.",
      "author": "LeadingYogurtcloset8",
      "created": 1635510609,
      "upvotes": 0,
      "replies": {}
    }
  }
}