{
  "sid": "puas3m",
  "link": "/r/college/comments/puas3m/does_my_roommate_have_way_too_much_stuff_or_am_i/",
  "title:": "Does my roommate have way too much stuff or am I overreacting?",
  "text": "My roommate and I moved into our college dorm earlier this week and I’m really worried about what I’ve gotten myself into.\n\nHer large car was stuffed full of boxes. Luckily they stayed on her side of the room, or at least there was enough space for me to get from my desk to the door. But every inch of the floor was covered in piles of clothes, boxes, and miscellaneous items. Her desk and bed are also completely covered in stuff. \n\nEvery day she said she was going back to the dorm to unpack, but would go straight to her computer and game for hours before being “too tired” to put things away. Laundry was literally all over the floor. I also offered to help unpack numerous times but I wasn’t going to do it unless she was also unpacking.\n\nMy previous roommate was a bit like this but to a much lesser extent but it didn’t bother me that much. Today the clutter really started getting to me and I told her we were going to unpack. We started and not five minutes later she suggested we leave and go get dinner. I said no, let’s get some stuff done instead.\n\nWe also have a TON of storage space in our dorm. Our closets have eight large drawers and a ton of hanging space inside. Large shelves are over our desks. It’s not like there is nowhere to put anything.\n\nI unpacked every single one of the 10+ boxes that were sitting on the floor. We have lofted our beds and there is also a lot of things already stuffed under hers (duffel bags, suitcase, a large plastic tub filled with shoes, drawers) so it wasn’t like we could shove the boxes under there until she got around to it.  Unfortunately she had to show me every single item she thought was cool or cute while I did the unpacking.\n\nI got so overwhelmed that I stopped helping which she seemed a little upset by. There were empty water bottles lying all around even though she is the one who brought a recycling can. I had to do most of her desk and there were nail polish flecks and fingernails all around it, but I can’t vaccum because I can’t get to it.\n\nShe left for dinner and asked me to flatten all of the boxes and put them under the bed. As soon as she left I broke down crying because clearly she thinks this is also my responsibility to help her unpack. I know I did most of it but that’s because I couldn’t handle stepping over boxes to reach something not close to my side of the room. I haven’t folded these boxes and don’t plan to. They are still piled in front of the door.\n\nAlso apparently her parents are coming up next month to bring up more of her stuff :/\n\nI’m going to wait a few weeks and see how things get when classes start. If things don’t improve even after I talk to her about this, would I be overreacting to switch rooms?",
  "author": "lovefromruth",
  "created": 1632451862,
  "over_18": false,
  "upvotes": 36,
  "upvote_ratio": 0.93,
  "comments": {
    "he32b09": {
      "link": "/r/college/comments/puas3m/does_my_roommate_have_way_too_much_stuff_or_am_i/he32b09/",
      "text": "Should’ve thrown the boxes on her side just dash them on her bed. If u don’t set boundaries with people they will step all over u",
      "author": "SnooDoughnuts2936",
      "created": 1632487413,
      "upvotes": 2,
      "replies": {}
    },
    "he2wdhb": {
      "link": "/r/college/comments/puas3m/does_my_roommate_have_way_too_much_stuff_or_am_i/he2wdhb/",
      "text": "Oh what I'd give to have a cluttered gamer girl roommate 😔",
      "author": "Djunga",
      "created": 1632484119,
      "upvotes": -7,
      "replies": {}
    },
    "he2pym7": {
      "link": "/r/college/comments/puas3m/does_my_roommate_have_way_too_much_stuff_or_am_i/he2pym7/",
      "text": "Stop doing shit for her. Seriously, you were trying to be nice and I think that's really great of you but she's taken advantage of it. As freshmen a lot of people don't know what to bring, I once saw someone bring a whole mini U-haul trailer on move-in day. Where the hell is she going to put all this stuff her parents are bringing? Does she really need all those shoes? I'd see how things are in a couple weeks but stop letting her take advantage of your kindness. It's not fair to yourself. Treat yourself with more respect.",
      "author": "ctrldwrdns",
      "created": 1632479832,
      "upvotes": 15,
      "replies": {
        "he44m2s": {
          "link": "/r/college/comments/puas3m/does_my_roommate_have_way_too_much_stuff_or_am_i/he44m2s/",
          "text": "Yeah I won’t be doing anything for her again. My motivation was really so I could get around my room but I’ve done as much as I can so I’m not helping anymore.\n\nAlso she isn’t a freshman and I would have a lot more sympathy if that was the case … she’s a senior.",
          "author": "lovefromruth",
          "created": 1632504095,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "he1wqwg": {
      "link": "/r/college/comments/puas3m/does_my_roommate_have_way_too_much_stuff_or_am_i/he1wqwg/",
      "text": "Honestly, you've been so patient and generous already that I don't think you're overreacting at all. Your roommate needs to take responsibility, accept the consequences she brought onto herself, and realize that her lack of action negatively affects someone else. It's one thing to help each other out, but it seems like she's putting the expectation onto you to do her work. She should already be doing things herself, whether you help or not.",
      "author": "yourangleoryuordevil",
      "created": 1632456932,
      "upvotes": 27,
      "replies": {}
    },
    "he1s5rt": {
      "link": "/r/college/comments/puas3m/does_my_roommate_have_way_too_much_stuff_or_am_i/he1s5rt/",
      "text": "No, you have every right to switch roommates because it's not your job to put her stuff away for her. She knew what she was getting herself into when she agreed to have a roommate. She should've known better not bring all her stuff if she couldn't put it away herself. It's not fair for you to live in a messy environment just because she wants to bring too much stuff. So switch roommates before it's to late because I think you might regret it later on in the semester.",
      "author": "No_Regular7274",
      "created": 1632454331,
      "upvotes": 49,
      "replies": {}
    },
    "he1o4ze": {
      "link": "/r/college/comments/puas3m/does_my_roommate_have_way_too_much_stuff_or_am_i/he1o4ze/",
      "text": "[removed]",
      "author": null,
      "created": 1632452216,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634055450
}