{
  "sid": "qk3prv",
  "link": "/r/college/comments/qk3prv/i_dislike_my_school/",
  "title:": "I dislike my school",
  "text": "does anyone else dislike the college they attend, especially the location? I live in the southern region and was planning on transferring to a school in the northeast, but was not given much financial aid (even though I’m from a low-income family), so I’m stuck in my mundane hometown. many of my friends attend college out-of-state and I’m happy for them because they love it, but I can’t help feeling sad. I want to “make the most of it”, but it’s hard because I commute and live only 8 min away from campus and it’s a religious school, so nightlife is very restricted. idk how to make the most of my time here ..",
  "author": "cutii3mochii",
  "created": 1635731181,
  "updated": 1635779364,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hiu6aey": {
      "link": "/r/college/comments/qk3prv/i_dislike_my_school/hiu6aey/",
      "text": "A major reason for my depression right now. I’m in my first semester at my local CC in a town and state I loathe. I’d give anything to transfer now, but that would be a dumb move because I’m able to attend for free. I’m planning on transferring out of state once I graduate, but it’s still difficult. \n\nA good reminder to tell yourself is that you’re in it to leave in the long run. Your friends who attended out-of-state schools are going to be stuck at home for a few years due to little money and a huge amount of debt. Meanwhile, you’ll be in a better position financially that will allow you to move wherever you please.",
      "author": "kizeltine",
      "created": 1635732338,
      "upvotes": 4,
      "replies": {
        "hiua3nf": {
          "link": "/r/college/comments/qk3prv/i_dislike_my_school/hiua3nf/",
          "text": "thank you for your comment! it made me feel much better about the current position I’m in",
          "author": "cutii3mochii",
          "created": 1635734345,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hiu9jmd": {
      "link": "/r/college/comments/qk3prv/i_dislike_my_school/hiu9jmd/",
      "text": "I dislike my school too. I got a 1 hour commute by train and it's hella annoying.",
      "author": "Croyorosca",
      "created": 1635734053,
      "upvotes": 3,
      "replies": {}
    },
    "hiux6l8": {
      "link": "/r/college/comments/qk3prv/i_dislike_my_school/hiux6l8/",
      "text": "I don’t know what career plans you’ve got, but, graduate school is not the end of the road. If you plan to continue on with graduate school, you can go to an out-of-state university for graduate school.",
      "author": "2Browneyes2",
      "created": 1635749922,
      "upvotes": 1,
      "replies": {}
    }
  }
}