{"sid": "pxeu09", "link": "/r/college/comments/pxeu09/how_can_i_stop_messing_around_and_become_a_better/", "title:": "How can I stop messing around and become a better student??", "text": "I was supposed to start  my third year of college (Junior Year) this Fall but I didn't because I realized that I have to get myself better overtime and to stop messing around because I have to get straight A grades to improve my GPA completely. I have been slacking off a lot since I was a child in school and it has caused me to have multiple issues in my life. I need to have some sort of guidance but I have an issue with studying and college. I have been slacking off and because of lack of maturity, my GPA is below 3.0 and I am about to be a junior in the future. The MAIN problem is that I don't seem to give a damn about collegework and that's extremely bad for my future. I have extremely bad study habits and I can't stop this massive procrastination no matter what I do. I am willing to try to fix my life situation but it's too late. I also don't know what to major in at all because I feel extremely lost. I can't study and do well anymore. How screwed am I? I wish to do well but I keep procrastinating every single minute. Any advice?", "author": "Critical-Paper", "created": 1632860264, "retrieved": 1632945383, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"henfvs3": {"link": "/r/college/comments/pxeu09/how_can_i_stop_messing_around_and_become_a_better/henfvs3/", "text": "I think the first thing is to figure out what major/direction you're going to go. Talk to the advisors at the college, and once you narrow it down, talk to the specific degree advisors (College of XX Subject) since each department usually has ones that just deal with everything about their colleges majors. Recovering from that GPA is going to suck, I wont sugar coat it...but it is possible. I had under 3 for a bit and recovered it to over 3 after 2 really good semesters over the pandemic. Employment-wise being under 3 isn't going to be the end of the world but you might miss out on certain opportunities because of it. Work on soft skills and other experience in lieu of GPA.\n\nHaving the attitude of \"my parents are making me go\" is probably going to hamper your drive too. You have to approach it with more of a \"my parents are giving me the chance to go\" since there are plenty of people who would love to be in your spot.", "author": "NinjaLorian", "created": 1632867639, "upvotes": 5}, "henc4s4": {"link": "/r/college/comments/pxeu09/how_can_i_stop_messing_around_and_become_a_better/henc4s4/", "text": "Well, the first thing to do is to understand your goals.\nWhy are you going to college? What do you plan to major in? Are you going for any certificates?\n\nWill a college education benefit your planned career, or is it a requirement for it?", "author": "ThoughtCenter87", "created": 1632865950, "upvotes": 1}}}