{
  "sid": "r4xc0u",
  "link": "/r/college/comments/r4xc0u/i_overslept_for_my_exam_and_im_so_angry_at_myself/",
  "title:": "I overslept for my exam and I‘m so angry at myself",
  "text": "Here‘s some backstory: My university has the system that you can sign up for exams on the date that best fits for us. If we sign up for a date and don‘t show we‘re locked from taking it on the next date. The exam I‘m talking about was Bioethics and it was at 12pm (which is so not early) But I couldn‘t sleep until 5am the night before and when I woke up at 9am on the day of I fell asleep again without noticing and only woke up again at 2pm.  I feel so god damn stupid and now I don‘t know if I should tell my professor what happened or what I should do in general. (It wasn‘t an important one gladly but still) I feel like not telling him and just dealing with the consequences since this is in fact totally my fault.",
  "author": "FlyingLettuce27",
  "created": 1638197076,
  "updated": 1638206387,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hmjbuyo": {
      "link": "/r/college/comments/r4xc0u/i_overslept_for_my_exam_and_im_so_angry_at_myself/hmjbuyo/",
      "text": "It might be too late. But if you’re unable to sleep I wonder if you could talk to a doc about insomnia? Maybe you could get accommodations next time? I’d probably not say anything to the prof and would set a couple alarms on the days there’s exams.",
      "author": "battyeyed",
      "created": 1638197757,
      "upvotes": 11,
      "replies": {
        "hmje27d": {
          "link": "/r/college/comments/r4xc0u/i_overslept_for_my_exam_and_im_so_angry_at_myself/hmje27d/",
          "text": "I‘ve thought about that a lot recently but I don‘t really know where or how I could get that diagnosed. It could be a possibility though",
          "author": "FlyingLettuce27",
          "created": 1638198768,
          "upvotes": 4,
          "replies": {
            "hmjpkaj": {
              "link": "/r/college/comments/r4xc0u/i_overslept_for_my_exam_and_im_so_angry_at_myself/hmjpkaj/",
              "text": "Talking to a primary care doctor is the best start",
              "author": "BMOEevee",
              "created": 1638203724,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmjj82q": {
      "link": "/r/college/comments/r4xc0u/i_overslept_for_my_exam_and_im_so_angry_at_myself/hmjj82q/",
      "text": "Info: Is this the only time youve done this? Was that date and the date you are locked from the last days you have to take the exam?",
      "author": "Mushy-froug",
      "created": 1638201058,
      "upvotes": 1,
      "replies": {
        "hmjkqjv": {
          "link": "/r/college/comments/r4xc0u/i_overslept_for_my_exam_and_im_so_angry_at_myself/hmjkqjv/",
          "text": "I‘ve missed exams because of being sick before, but that was fine since I brought a doctors notice. \nI think there is another date after the one I‘m locked from, it‘s just half a year from now and I‘m sure I‘ll have everything I studied forgotten until then, so that kinda sucks a little",
          "author": "FlyingLettuce27",
          "created": 1638201700,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmjpjwq": {
      "link": "/r/college/comments/r4xc0u/i_overslept_for_my_exam_and_im_so_angry_at_myself/hmjpjwq/",
      "text": "Yea you’re right it is your fault but that doesn’t mean you can’t ask your professor what you can do. I’ve missed a final before and asked to take it but couldn’t, who knows he/she might let you!",
      "author": "flycessna02",
      "created": 1638203720,
      "upvotes": 1,
      "replies": {}
    }
  }
}