{"sid": "p12tmb", "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/", "title:": "Classes that are nothing but textbook reading are BS", "text": "I was in all online classes for this past summer semester, and 2 out of 5 of my classes were nothing but textbook reading, exams on the reading, and half-assed discussion boards that the professors did not participate in. To top it off, the reading in both classes was far from engaging. The professors of the classes never reached out, emailed, or made any attempt to connect with the students. I just find this method of \"teaching\" really lazy and I like to feel engaged when I'm learning something. I understand that Covid puts a monkey wrench in everything, but 3 out of 5 of my teachers made themselves available via weekly Zoom meetings - just that little amount of effort made a huge difference in how i both regarded and performed in the classes. \n\nPlease correct me if I'm wrong, but I find this method of not teaching but essentially monitoring a class not only lazy but especially not worth the thousands of dollars I'm putting in to my schooling.", "author": "jaarmaar", "created": 1628520181, "retrieved": 1632802661, "over_18": false, "upvotes": 720, "upvote_ratio": 0.99, "comments": {"h8ahkqv": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8ahkqv/", "text": "AutoModerator detected the \"textbook\" keywork in your post.  \n/r/college does not support or condone the unlawful duplication or sharing of electronic textbooks.  \nThe unlawful sharing or duplication of Intellectual Property is a bannable offense.  \nDiscussions of how to find the best deals & lowest prices on textbooks are encouraged.  \nWe recommend:  \n[BookFinder.com](https://www.bookfinder.com/isbn_search/)  \n[Project Gutenberg](https://www.gutenberg.org/)  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/college) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1628520182, "upvotes": 1}, "h8qrn0l": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8qrn0l/", "text": "You're absolutely right. I just finished my summer calculus course. Every week we had to watch 3-4 video lectures, complete a lab and sit for an exam. The craziest part.... the lectures were all youtube links. I kid you not. Why am I paying for youtube university?! \n\nAlso, labs were just graded on completion not correctness.", "author": "Ill_Ad7158", "created": 1628826599, "upvotes": 2}, "h8dsmfu": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dsmfu/", "text": "God I hate it when they just dump you with textbook readings. Don't be afraid to share your knowledge professors.", "author": "Eddie_078", "created": 1628577853, "upvotes": 2}, "h8drnrv": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8drnrv/", "text": "100% agree with this post.", "author": "wawabubbzies", "created": 1628577071, "upvotes": 1}, "h8d865u": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8d865u/", "text": "hahahhahahhaha literally anyone can simply assign readings and give instructions", "author": "SevenThirtyTrain", "created": 1628564466, "upvotes": 2}, "h8d69rs": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8d69rs/", "text": "I agree with you. Last year in 2020 summer term, my college offered calculus which is worth 4 credits. As a student who is taking STEM for his future studies, I willingly took it. Notice here that I was very willing to learn. However, it was the first term for my college to organize an online based program, and they ridiculously only had inquiry sessions and no teaching sessions, meaning there are only Q&A meetings with the professor on zoom and they are not supposed to teach us! Our Biology and Human Geography professor noticed the terrible idea, so he taught us during the inquiry sessions anyways, like explaining the chapter and stuff which was helpful. However, we were stuck with the math professor who we only met in inquiry sessions and taught us almost nothing. He would talk about weather and COVID in his country and then sign off. We had to do our homeworks which was really tough with no explanations, experience and being taught nothing! All we had was YouTube links that he provided. We complained the school, and that made him upload more videos and find more sources only. Overall, though I do not wish to blame the professor, I feel like the effort was very poor. I dropped math and left it behind. I'll only take it when I tranfer to the US again.", "author": "SaintJay41202", "created": 1628563487, "upvotes": 2}, "h8cy5k5": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cy5k5/", "text": "Trust me, most professors also hate this style of teaching. But we have to do it because higher education is at a stage of self-destructive competition. If I'm to offer a summer class, one with face to face format will struggle to fill, and one that's online asynchronous will fill immediately. And at the university level, if my university doesn't offer online classes, then the students will simply enroll at other places. **In this sense, online classes are actually destroying higher education.**\n\nOn the other hand, it isn't really a case of professors being lazy. The half-assed discussions you mentioned? Those are the result of semester after semester of us trying to facilitate discussions to no avail. At some point, we gave up trying to make online asynchronous classes entertaining.", "author": "AcademicDifficulty", "created": 1628559474, "upvotes": 5}, "h8coksv": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8coksv/", "text": "this is literally both of the econ classes i've taken. what's worse about econ is that many of the classes use an outside program for assignments (such as McGraw-Hill connect) that we have to pay for...", "author": "ble22ed", "created": 1628554864, "upvotes": 4}, "h8cm999": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cm999/", "text": "I'm a psych major and my internship seminar this semester was asynchronous. My professor started with recorded lectures (about 45 minutes at most), which lasted the first two weeks (of an 8 week class). There was essentially no engagement after that, no feedback on discussion posts/journal entries, and what pissed me off most is absolutely no feedback on the research topic proposal and paper outline she required, she graded them after I turned in my final paper. I felt like I was in the dark the entire semester. She had two required textbooks on the syllabus, and neither were used at any point in the semester. It was extremely frustrating and I'm glad it was my final course so I don't have to do an online course through my school ever again.", "author": null, "created": 1628553750, "upvotes": 3}, "h8cbpb7": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cbpb7/", "text": "The most annoying part is these professors literally copy and paste material from probably the first online semester they did and all they do is half ass grade the homework. They’re getting paid to do nothing essentially. I just finished a public speaking class and the video lectures all talked about the presidential debates as current events. Like is it that hard to make a new video for the semester?", "author": "disgoesintrash", "created": 1628548687, "upvotes": 7}, "h8c2es3": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8c2es3/", "text": "All but one of my classes are still online this semester, and of the remaining four only one is synchronous. This means another semester of bullshitting discussion posts. I hate this, why am I going $30k/yr into debt for this?", "author": "OFS_Razgriz", "created": 1628544478, "upvotes": 3}, "h8bzjnm": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bzjnm/", "text": "Depends. Yes it's annoying that some professors just give out text to read, but at the same time, u get used to it. I just wish some professors made reading more engaging with the rest of the class.", "author": "Oro-Lavanda", "created": 1628543211, "upvotes": 1}, "h8buwzf": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8buwzf/", "text": "You so right. This sounds like my class that’s about to end this week. And the worst part is you really don’t know what to study until you get the study guide, a week before one of three test. It’s dumb and feels like I learned nothing.", "author": "ClayDolfin", "created": 1628541242, "upvotes": 2}, "h8bowpv": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bowpv/", "text": "This. There is 0 reason I should have to pay $90 on top of it for a tech fee in 2021. \n\nImo the costs should be a hell of a lot less and the teachers should at least be available at office hours at least once to twice a week. Imo there should also be an open question board to help everyone. Bare minimum. Ofc there are better ways to teach and learn online, but not even expecting that there are better ways such as the mentioned to do online.", "author": "LPKKiller", "created": 1628538682, "upvotes": 9}, "h8bgey4": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bgey4/", "text": "At least with books, your not wading through hours of poorly recorded video nested in multi-gb PowerPoints, buried in lists of stuff to download. I am so tired of virus infested luddites pooping out every passing thought as a complex lecture with Easter eggs for test answers. There's always a happy medium, but a lot of professors are just as disenchanted with their life choices as we are.", "author": "SemanticBattle", "created": 1628535087, "upvotes": 11}, "h8besc4": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8besc4/", "text": "Ex-squeeze me, you took five summer classes? You crazy bastard, gotta admire that level of dedication.", "author": null, "created": 1628534401, "upvotes": 28}, "h8bde2y": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bde2y/", "text": "My favorite class this past semester was one where the professor actually recorded a lecture for each section and then had exams partially on her lectures as well. It was refreshing in an online environment and actually made me feel I was using my brain instead of just blindly playing Q&A with the textbook.", "author": "GoStars817", "created": 1628533814, "upvotes": 25}, "h8bdbs9": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bdbs9/", "text": "This is college, not high school.", "author": "JosephMichael023", "created": 1628533789, "upvotes": -15}, "h8b9eat": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8b9eat/", "text": "If it is an Asynchronous class then there is no meeting.  When I have tried to hold a regular weekly meeting at a set time, perhaps 5 students out of 100 turn up and even then it is 1 or 2 students asking the questions.\n\nI am also willing to meet students for Office Hours at a time that suits them and me - again perhaps 2 or 3 students out of 100 are interested enough to ask to meet with me.\n\nI would be more than willing to meet with students but those who sign up for Asynchronous classes appear to have little interest in meeting with me.\n\nEdit: I do send out a weekly Announcement but based on some of the emails I receive students do not read them.", "author": "SlightScholar1", "created": 1628532123, "upvotes": 49}, "h8alyd2": {"link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8alyd2/", "text": "You’re absolutely right from my perspective. People absolutely have to read as part of education - it has so many benefits that lecture alone can’t provide - but near-total lack of contact is not helpful. When I teach asynchronous course, I always send out 2-3 announcements per week and have a few “town hall” meetings throughout the semester because that line of communication needs to be open. Hardly anyone ever reciprocates, which is a separate issue, but for those who are looking for more than the bare minimum, those touchpoints are helpful.", "author": "PhDapper", "created": 1628522149, "upvotes": 182}}}