{"sid": "fdgm65", "link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/", "title:": "Have you ever been at a point of stress where you can't be stressed anymore?", "text": "Because that's where I am now. I have a final exam Friday morning I don't know why, I just can't study. The last 3 days I just didn't have the mental energy for it. I know most of the basics from the content, but I can only half-ass studying. It's almost 7 pm now and I haven't done anything today yet. I want to study but I'm just tired of exams.\n\nThese stupid exams are completely draining me out, I really feel like I'm a zombie.\n\nwhat should I do? send help.", "author": "LemonMelissa", "created": 1583343728, "retrieved": 1632802603, "over_18": false, "upvotes": 792, "upvote_ratio": 0.98, "comments": {"fjlbjpd": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjlbjpd/", "text": "Yes it’s called hysteria!", "author": "Hoffyshh", "created": 1583443655, "upvotes": 1}, "fjiltqo": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjiltqo/", "text": "Flash cards are good. Go through them once, pick out the ones you know immediately, pick them out, set aside. The harder ones, rotate more frequently. I am talking handwritten flash cards, not an app. You are far times more likely to remember your handmade flash cards and in your own handwriting. Keep 10 in your back pocket. Rotate them out. Go through them every single moment you have downtown. The subway, grocery line, etc. \n\nThen: topics on one side of the page, fold it over, develop that topic into short essay on the folded side. Flip those back and forth to quiz yourself. You can use the back of the paper up this way as well, without killing trees. \n\nIf it’s a new language, try drawing a picture to represent that idea. Write “tree” (in the target language) on one side of the flash card, draw a tree on the next. Even better for names of family members. Draw a family tree and write in your own names with the titles in the new language.\n\nDefinitely go home and take a short break, then spend at least 1 or 2 hours re-reading and filling in your notes with more detail on the daily. Leave space in your notes day to day or line by line to do that. \n\nMath, make example problems and make yourself pretend to teach them out loud to yourself or a study group. Highlight where you typically get confused or stuck, make up rules or a formula to help you stay on track. Same for grammar. Math is like grammar- and they’re both like following a recipe. Do it enough and it’s second nature. \n\nBest of luck! Don’t forget to sleep and drink plenty of water", "author": "anonthrowaway1984", "created": 1583370469, "upvotes": 1}, "fjil9n0": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjil9n0/", "text": "First don’t browse reddit", "author": "xxslaying", "created": 1583370122, "upvotes": 1}, "fjil09c": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjil09c/", "text": "Two days ago. When I wasn’t sure if I had screwed up my graduation date by falling a class.", "author": "imharrypottertrash", "created": 1583369958, "upvotes": 1}, "fjikr9m": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjikr9m/", "text": "Classes that require you to regurgitate information via exams are not fun. However, I’ve had my fair share of them during my undergrad and masters degree. Because I am an online student both programs have been fast paced and have required me to alter the way I study for exams to be able to take weekly tests on 2 chapters per class (in addition to assignments that are due). \nI used to write all the bolded and italicized information in a notebook and then highlighted or added information from accompanying materials (live lectures, power points, assignments, self-assessment quiz etc). By the time I was done with all the weekly work I had a list of information that was likely to be on the exam. I did that for about the first year and got tired of writing that much, so I color-coded word documents with the same info for quick reads before exams. Brought my exam grades up from Bs to As for the most part (a few professors snuck random questions in there on occasion that you had to have memorized the entire chapter to remember). \nI came across quizlet while practicing for my dsst exams and that website has games for common chapters from textbooks that you can use to learn the info with as well.\n \nHang in there and figure out how you can best learn and retain info. The classes get better the higher up you go in course numbers. Early classes are all about memorization and then you get to apply it later.", "author": "Svenska80", "created": 1583369803, "upvotes": 1}, "fjie6l1": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjie6l1/", "text": "If you were prepared you wouldn’t be stressed", "author": "damsus121", "created": 1583365697, "upvotes": 1}, "fjidrkv": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjidrkv/", "text": "Yes.", "author": null, "created": 1583365445, "upvotes": 1}, "fji9ass": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fji9ass/", "text": "Me right now", "author": "RobloxGOTY", "created": 1583362814, "upvotes": 1}, "fji8hbg": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fji8hbg/", "text": "Oh you ain't seen nothin', my friend.\n\nAsk a soldier, ask a day trader, ask a CEO what it means to be at a point of stress where you can't be stressed anymore.", "author": "dragonrider0601", "created": 1583362398, "upvotes": 1}, "fji415u": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fji415u/", "text": "My is to do word splat on a piece of paper-- everything and all things you remember from class write it all out-- everything you can remember.\nExplain everything- write diagrams whatever get it all out on paper.\nFrom there go over the stuff you're not confident in-- and the things you cant remember: focus on those.\n\nAs for studying worry about UNDERSTANDING; people always stress and say \"USE fLASh cARDs;\" what are you learning? What is an exam anyway? It's a test on UNDERSTANDING- go over the things your done get and get over the idea of shoving your brain with random information that float around.\n\nFocus on putting it down on paper and understanding your content;\nI go through so many note books a semester and so much paper just because I write everything I know of something and connect the dots-- flashcards and quizlette never helped me as it's just about memorizing vs recalling.\n\nI write notes in class- from books- and then after each chapter I'll word vomit and go through stuff I missed and address it the week of... so when exams happen I'm not LEARNING I'm REVIEWING ;;\nI listened to so many people telling me this and that but these are the things that work for ME- so u gotta explore it my friend.", "author": "boots1994", "created": 1583360242, "upvotes": 1}, "fji3fzt": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fji3fzt/", "text": "I attempted to do engineering for a while with my mediocre intellect so I know exactly how you feel. I'd study 8-10hrs a day, go to office hrs, get tutoring and I was still getting bad results consistently. This may be cliche advice but get in the habit of going to bed no later than 10 every night. It really helped reduce stress and anxiety. Now I just put down my work and go to bed at 10 and save it for tomorrow. It feels like procrastinating but you'll be able to maximize your study time on a fresh brain.", "author": "glitterpumas", "created": 1583359973, "upvotes": 1}, "fjhydzr": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhydzr/", "text": "I got to a point where I was thinking of leaving the country and planned out where I could escape to. Prices, currency exchange rates, foods, plane tickets. I was researching everything about traveling while writing my reports and studying. I desperately wanted to escape but I was and still am a broke college student who can't afford to go home on breaks because the train ticket is too expensive.", "author": "SuperSpartan177", "created": 1583357341, "upvotes": 1}, "fjhxe3n": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhxe3n/", "text": "Thats my secret. Im always stressed.", "author": "Lakural", "created": 1583356813, "upvotes": 2}, "fjhw367": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhw367/", "text": "classic burnout. you mentioned that you're only 2 finals away from your degree so don't give up now, but do give yourself some time to decompress. have some me time and get back to studying later.", "author": "iamfearformylife", "created": 1583356131, "upvotes": 2}, "fjhs5rw": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhs5rw/", "text": "I get stress paralyzed. It's when I'm so stressed I cannot focus or do anything productive", "author": "zestyprophet", "created": 1583354063, "upvotes": 1}, "fjhrrht": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhrrht/", "text": "Meditate, just take like five minutes to focus on every single breath in and out. Nothing else just focus on your breathing and you’ll feel much better :)", "author": "YZZKS", "created": 1583353856, "upvotes": 1}, "fjhr3ft": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhr3ft/", "text": "Yes. It exacerbates my schizophrenia. I had to drop this semester due to hallucinations.", "author": "AthanasiaStygian", "created": 1583353514, "upvotes": 1}, "fjhqcbe": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhqcbe/", "text": "That’s where I am right now except I can’t be bothered it feels amazing because I’m no longer having panic attacks but I am not studying like I should be", "author": "nemo1261", "created": 1583353110, "upvotes": 1}, "fjho9ee": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjho9ee/", "text": "With daylight savings fast approaching it’s only gonna get worse.\n\nJust wish they would stop this crap of moving the clock forwards and backwards 1 hour", "author": "SilentJon69", "created": 1583351967, "upvotes": 1}, "fjho503": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjho503/", "text": "With daylight savings fast approaching it’s only gonna get worse.\n\nJust wish they would stop this crap of moving the clock forwards and backwards 1 hour", "author": "SilentJon69", "created": 1583351900, "upvotes": 1}, "fjhns7c": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhns7c/", "text": "I like to go on a run when this happens, it helps", "author": "CandideAussi", "created": 1583351704, "upvotes": 4}, "fjhn4c5": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhn4c5/", "text": "You need to take a break literally studying at this point is useless for you", "author": "Newfypuppie", "created": 1583351337, "upvotes": 2}, "fjhn3wr": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhn3wr/", "text": "Fight, flight, FREEZE. I was at that point with my thesis. I just froze, I had no idea what to do until I reached out to my professor! Reach out to different offices on campus, friends, professors.\n\nIt’s totally normal to feel stress this time of year. Please reach out to those who can support you. No one is going to make fun or anything, everyone’s been there. Just be open and honest!", "author": "Realistic_Pass", "created": 1583351330, "upvotes": 2}, "fjhmts0": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhmts0/", "text": "College is a one time entry. Once you get passed this college, you’re in. Take it one test at a time and keep trying to remind yourself of all your past tests that u took to get to this point. No backing down now!", "author": "VIllainLife", "created": 1583351170, "upvotes": 8}, "fjhmlgk": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhmlgk/", "text": "Sounds like burnout; i'm going through the same thing. \n\nLast week I was at school 7 days straight (I commute 1 hour both ways) from 8:30am to literally 8:00pm to finish a project. Sat on my ass for hours at a time. Thankfully, I had my friends and we were all working together but I'm really feeling the tiredness this week. I have  one final on Friday and had one this Monday; barely fucking studied over the weekend for it because I could be hardly arsed to care. \n\nSleep. A lot. Don't talk to people if you have to (burnout causes me to snap at people for the slightest things). Eat a good meal and take a walk. It's a slippery slope to recover from burnout but you'll get there.\n\nGood luck.", "author": null, "created": 1583351038, "upvotes": 12}, "fjhme5d": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhme5d/", "text": "In high school my body adapted to the sheer levels of stress I have, and now I don’t have any motivation to do anything unless I’m stressed. There’s pros and cons of that mindset, but with a little self control I actually thrive on stress now.", "author": "TooFarFromComfort", "created": 1583350922, "upvotes": 1}, "fjhl1rb": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhl1rb/", "text": "It sounds like you lack a pleasure/work balance. Study for two hours, do something you enjoy for an hour. Once that starts working for you, tweak it a bit to your liking. Or tweak it now.", "author": "sherblovestheganja", "created": 1583350186, "upvotes": 4}, "fjhkuvk": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhkuvk/", "text": "[deleted]", "author": null, "created": 1583350081, "upvotes": 19}, "fjhk65l": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhk65l/", "text": "I've experienced this so many times throughout college and even some in high school. Its like a part of what I expect to happen in stressful times at this point: I shut down. This may not be the best advice, but what has worked for me is to accept that I won't be accomplishing anything (its really hard—near impossible—to come back from that point in my opinion) and do what I can for my mental state. This would include relaxing, sleeping, etc. Anything that puts me in the best place mentally to take the exam even though I haven't studied.", "author": "kkitkat6996", "created": 1583349703, "upvotes": 27}, "fjhjkku": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhjkku/", "text": "A couple of things: make sure you are taking care of your body; eat regularly and healthy, hydrate, get some sort of exercise (even if it’s just a walk), get plenty of sleep. personally, I also make meditation and journaling a priority in times of high stress, even if it’s only 10 minutes a day. As far as studying specifically, take frequent breaks (I usually do 50 min of studying, 10 minute break, then a longer one every few hours, if you can walk away from your desk during these breaks even better), change up your study location, study with/around friends (you don’t have to be collaborating, just being around someone you feel accountable to will keep you a little more focused), keep a variety of snacks/drinks nearby, when your brain starts getting worn out you can “jump start” it with a new sensation, a different flavor of gum, switching to a sports drink from water, some chips and/or nuts. along a similar vein, you can do the same thing with the music you are listening to; I’ve had the most success switching between high energy songs that I know very well, gentle instrumentals and movie or video scores", "author": "stitch-in-the-rain", "created": 1583349368, "upvotes": 2}, "fjhjdug": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhjdug/", "text": "Cant you just go to a doctor and call in sick so you dont loose a try? Always wondered how that stuff works in the US.... Sometimes I am very lucky with beeing sick so i have 2 more month to study...", "author": "__freaked__", "created": 1583349263, "upvotes": 1}, "fjhjcbl": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhjcbl/", "text": "Yeah. That's me now", "author": "Scooby-Doo_69", "created": 1583349240, "upvotes": 5}, "fjhiesn": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhiesn/", "text": "Happy cake day!! Dealing with a similar thing", "author": "nitrogenousbases", "created": 1583348720, "upvotes": 1}, "fjhbibx": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhbibx/", "text": "Optimal performance happens at medium stress.\nLow stress and high stress situations decrease your performance.\nTry to relax just a bit, (but not too much), and you will have optimal performance for academics.", "author": "r8cobra", "created": 1583344924, "upvotes": 29}, "fjhazx1": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjhazx1/", "text": "Firstly, go to bed early (not on time, but early). As for studying, it depends on the subject, but flash cards are amazing. Look at them in the elevator, in line, or any time you have a couple of minutes. It's the most efficient study technique I know. Also, while this is probably not instantaneously helpful, a teacher/college grad said that the best thing to do is to read through all of your notes from time to time over the span of the whole semester. Not only does your brain absorb it over this time and you have a better understanding of it, but you won't have to cram at all during finals week. I have tried this, and the results are fantastic.", "author": null, "created": 1583344645, "upvotes": 127}, "fjh9ni1": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjh9ni1/", "text": "This is why I quit college. Just got sick of the constant hamster wheel of having to study for exams, didn’t even feel like I was there to learn. It felt like I was just trying to learn the exams so I could get my degree.", "author": "CraftsmanshipnDanger", "created": 1583343908, "upvotes": 187}, "fjh9hes": {"link": "/r/college/comments/fdgm65/have_you_ever_been_at_a_point_of_stress_where_you/fjh9hes/", "text": "Happy day of cake", "author": "somerandommemelord", "created": 1583343817, "upvotes": 6}}}