{"sid": "imtowf", "link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/", "title:": "Does anyone feel like they can't write a paper over the span of a few days, but instead do much better by writing it in one day?", "text": "I feel like when I come back to papers in English that are half-finished, I re-read it and decide to trash it so I can stay in one mindset while writing it so my feelings are more consistent.  My style of writing is influenced by my thoughts/emotions, and those change per day if not every few hours.  When my styles merge, they don't always match the same order of thoughts or make sense.  Is this common or not so much?\n\nEDIT:  Thank you everyone for the advice!!!!\n\nEDIT 2:  I also want to clarify because I think a few people misunderstood.  I'm not writing it all in one day as an act of desperateness or procrastination, but rather that I just prefer this way.  I almost never start late on something.  ", "author": "ButtFuel", "created": 1599274359, "retrieved": 1632801992, "over_18": false, "upvotes": 1461, "upvote_ratio": 0.99, "comments": {"g4ap1at": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g4ap1at/", "text": "I tend to do the same. If I do it over multiple days, it's usually because I'll draft my outline first, and then write the paper.", "author": "JafarsPomeranian", "created": 1599448491, "upvotes": 1}, "g487oaz": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g487oaz/", "text": "I blitz write in one sitting, ignore it for a week, and then edit it. Spacing stuff out is really helpful for me. I’m one of those people who get As even if I write it at 4am the day it’s due, but at a certain point it isn’t about the grade anymore. You get the most out of improving yourself when you pace yourself and treat the first thing you come up with as a draft.\n\nThis might help you find some more consistency and uniformity in your writing style - at least it did for me. Good luck!", "author": "twofunfeet", "created": 1599397857, "upvotes": 1}, "g481urd": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g481urd/", "text": "I have always, since high school, written papers in one sitting. I’ve been forced at points to do the professor-preferred method of breaking it into several days and using an outline and all that - but it doesn’t work for me. I have found that the flow of my papers is significantly better when I just sit down and write it all in one go. I saw an earlier comment that said they also do this, then read it again the next day to catch any mistakes. This is often what I do as well. For my English comp 2 course, I wrote a 24-page heavily medically based research paper in one night, in one sitting. And it may have been one of my best papers yet in my now four year, never ending collegiate career.", "author": "klgroth", "created": 1599392881, "upvotes": 1}, "g46kf0m": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g46kf0m/", "text": "im the opposite lol i take at least a week to write a paper. if its a big one then ill take 2 weeks to draft and revise over and over again until i am sick of it. i often cant get more than a few paragraphs out during one sitting so i start my assignments very far in advance", "author": "snerdissweating", "created": 1599350123, "upvotes": 2}, "g46is77": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g46is77/", "text": "The hard part of college isn’t the material, it’s actually sitting down and doing the studying and assignments. I swear no matter how hard I try I just can’t make myself sit down and get work done.", "author": "KING_COVID", "created": 1599349436, "upvotes": 1}, "g461yoa": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g461yoa/", "text": "I write most of my papers an a few hours, but if it's a long paper, it could take maybe 5-6 to crunch out. I found that I've gotten progressively better at structuring my thoughts naturally without having to lay out a plan for essays, and I very rarely have to change words or fix grammar because I've gotten so used to checking my work as I write. Of course, I'll still read over it a couple times before I submit it, but my point is mainly that I do the best when I crunch it out in a matter of hours with no breaks. That way I don't lose concentration or have any change in the way I want to write. I've done a good handful of finals like this and gotten As on most of them, but in the past when I've taken a few days to write essays, they end up getting lower scores. As an aside, I also don't go through multiple drafts with my papers, but instead write the final draft immediately. It saves a lot of time for me, and I've always had an easier time skipping to the final draft instead of doing a rough draft. Perhaps it's just the way that I write that facilitates it, or maybe I've just developed that skill over years of taking shortcuts; who knows?\n\nSurprisingly, the same thing happens to me for studying. When I study for multiple days before a test, I do worse. It's probably because I'm trying to remember information for multiple days, or I'm trying to remember things that are ultimately irrelevant to succeeding in the class. On all my AP tests in high school and my tests on college, I've done best if I just study the night before and get enough sleep.", "author": "para_lyzed", "created": 1599341329, "upvotes": 0}, "g461ixy": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g461ixy/", "text": "Throughout my later years of undergrad and all of grad school I pretty much averaged 10–13 pages a sitting. Like others have said here, I’d spend a day thinking through and researching, maybe sketching out some ideas. Then I’d take a day to bust out 10-13, which is the average length of most non-term papers in my field. After that I’d spend a day editing which consisted of rereading what I wrote and doing syntactic and diction edits, restructuring, and even sometimes straight up rewriting sections or adding/ subtracting sections. My prep day and editing day were never full days mostly part of an afternoon and evening, but on days I wrote I’d get up early have breakfast and write through the day and evening. \n\nThe key to this is first and foremost making sure our shit is together with ideas and evidence. How you do your writing won’t make an impact if you’re trying to prove the sky is green. The other thing is being willing to utilize writing resources. Anytime I had long stints of writing I ALWAYS used grammarly or similar software and asked others to read my work. Remember if you’re too embarrassed to have a friend read your paper you need to think long and hard why you’re about to give it to a professor. But the most important thing about procrastination, or doing a lot of work at once, is to just plan for it and give yourself time for fuck ups. I’d give myself personal due dates just to give myself the artificial urgency to get it done.", "author": "Climboy55", "created": 1599341120, "upvotes": 2}, "g460ah6": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g460ah6/", "text": "I usually write the paper in one go, and then go back and edit it 2-3 days later so the mistakes are more obvious to me.", "author": "quantum_complexities", "created": 1599340530, "upvotes": 2}, "g45xrtk": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g45xrtk/", "text": "I swear I do better on my papers when I do them last minute. I wrote a 10 page paper about 8 hours total, over 2 days. And got an A. Idk why it works for me, but thank god it does.", "author": "mgraces", "created": 1599339315, "upvotes": 1}, "g45t0l0": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g45t0l0/", "text": "After I had turned in multiple papers where I’d span it out over a few days(revised, have others look at it, etc.)  I had received a low B/C average on the papers. So I stopped and just went ‘fuck it’ and procrastinate along with save it all for one day to do. Suddenly got A average. It hasn’t bitten me back so far (in my sophomore year.) Not something I recommend but if doing it in a day works for you then it works.", "author": "Kintaro402", "created": 1599337064, "upvotes": 1}, "g45fkyd": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g45fkyd/", "text": "Just graduated and procrastinated the whole way through, but man do I always regret doing it the last minute.", "author": "Dezthegrunt", "created": 1599330457, "upvotes": 2}, "g4568bi": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g4568bi/", "text": "For me personally, the hardest part was always the introduction. Once that came out the rest of the paper flowed naturally to me", "author": "Davidrlz", "created": 1599325904, "upvotes": 2}, "g452atn": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g452atn/", "text": "That's not how I typically do it. I prefer grinding out a first draft in a couple days and then taking more to look it over and talk to my teacher/prof about it. Sometimes your brain just can't function and you start having the IQ of a potato as you're writing, and in those cases, you're better off putting the laptop down and relaxing with some tea/coffee and netflix and trying again tomorrow.", "author": "SlowResearch2", "created": 1599323711, "upvotes": 6}, "g450w3b": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g450w3b/", "text": "depends on how your brain works because some people work really well under immense pressure while others simply ✨ die ✨", "author": "hedislimaneismydaddy", "created": 1599322974, "upvotes": 10}, "g44yrwa": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44yrwa/", "text": "For me, I have found that I write papers a whole lot better under a time constraint. I know it may seem stupid, but for that reason, if a paper is due on the 10th at 11:30pm, I normally don't start until the morning of the 10th. I do a ton of reading and gathering sources (most of the time) the week before, and then don't actually start trying to write until the day before at the earliest. It may sound odd, but I just write papers better, closer to a deadline. Its not like that with everything though. For example, math and physics, taking timed tests, stressed me the crap out. I \"can't\" do it (air quotes bc I can, it just stresses me), but with papers, I work way better closer to the deadline. It may be in part because I like to procrastinate, and it may just be in part that I actually do write more information dense and better papers when I have a deadline to beat. Not sure if I subconsciously take it as a change or what, but thats just how I write. Sometimes I would have a major paper due on the 13th at 8:00am, and I would start writing it 9:pm on the 12th. Most of my good papers are written in the span of a few hours. I feel like if I start a paper in the beginning of the week it just isn't formed right and it doesn't flow good. I can't keep my mind on it, and just drift to other subjects that I have. So I am 100% with you on that!!!!", "author": "MichaelRast13", "created": 1599321968, "upvotes": 6}, "g44w20s": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44w20s/", "text": "Yes I always write my papers like an hour before they’re due and always do so good on them. It makes no sense to me but I guess procrastination adds a little spice to my writing", "author": null, "created": 1599320711, "upvotes": 2}, "g44vc8z": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44vc8z/", "text": "I create a rough draft, take an hour off, then just copy the rough draft to another document and try to fix grammar and spelling. I then read it to see if it’s coherent, follwed by getting rid of my outlining color coded text. Then one final reread and edit, change everything to TNR 12font Double spaced, and download a pdf copy to submit. getting a paper done in a few hours.", "author": "Topazz410", "created": 1599320385, "upvotes": 1}, "g44umud": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44umud/", "text": "For me it's more like procrastinate for days and pretend I'm doing something useful > write some crap that can't even be called an outline > Write A LOT OF CRAP leaving references and example out > Curse because I can't remember which reference and examples I wanted > Finish first draft > cry > send to supervisor > have to rewrite everything", "author": "Murderous_squirrel", "created": 1599320039, "upvotes": 2}, "g44uiq7": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44uiq7/", "text": "I've always written my papers in one day because it improves my consistency in tone and wording as well as improving my ability to more easily segue from one point or aspect to another. It also makes me far less likely to procrastinate in the sense of \"I have two hours scheduled for today - I'll just do four tomorrow\". Dedicating the day to the paper tends to make it easier for me to stay in the mindset that I should do this *now* so I have more time later.", "author": "-LuciditySam-", "created": 1599319982, "upvotes": 5}, "g44tfrm": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44tfrm/", "text": "I’m the same way. I’ll do all my first drafts in one sitting. Then go back to revise it for the final draft. But I feel like I can’t work on one draft for more than one day because I’ll forget what my original plan was. That’s mainly because I skip the brainstorming part and just start writing", "author": "Jaybenoit", "created": 1599319473, "upvotes": 2}, "g44s8cv": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44s8cv/", "text": "Wh sometimes but I’m know I’m better off not waiting until the last minute", "author": "TheJazmineRose", "created": 1599318975, "upvotes": 2}, "g44rao8": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44rao8/", "text": "I've found that my best work is when I just sit down, blast through most of not all of the paper (depending on how long it is) in one sitting, then going back later, re-reading it and editing it.", "author": "WWalker17", "created": 1599318609, "upvotes": 2}, "g44m16x": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44m16x/", "text": "I take a day to write an outline in bullet points with slightly fleshed out ideas. Then another day or two to string together an actual paper, then another to proofread. Then again, also depends on how close the deadline is.", "author": "xthiKKx", "created": 1599316466, "upvotes": 2}, "g44jw0r": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44jw0r/", "text": "I usually write my papers the day it's due because I tend to procrastinate or just flat out don't like the topic I have to write about. I have done it tipsy too. Never made below a 90 on any of my papers. But I chalk it up to working well under pressure and the fact I've been creatively writing since I was a teenager.", "author": null, "created": 1599315490, "upvotes": 0}, "g44iqyn": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44iqyn/", "text": "Yes and no. I write all (or most) in one sitting. Next day come back, tweak it. Add stuff. That kind of thing. Do it again the next day. And the next day. Until you have the paper you want.", "author": "Raymx3", "created": 1599314982, "upvotes": 2}, "g44f3hn": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44f3hn/", "text": "Yeah but you do it early so that if you get writer's block about a certain part you don't have to stress", "author": "Blutrumpeter", "created": 1599313255, "upvotes": 2}, "g44c16c": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g44c16c/", "text": "I do too. I find the stress helps me", "author": "Trip4Life", "created": 1599311788, "upvotes": 1}, "g449k28": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g449k28/", "text": "I'll never understand how everyone says they write better right before the due date or all in one sitting. I take the full time given between the assign date and the due date to write, and once I finish, I revise multiple times. And for piece of mind, I have to finish before the day it's due. People look at me like I'm crazy when I explain how much time I put into writing lmao", "author": "kfergie311", "created": 1599310561, "upvotes": 3}, "g449jqf": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g449jqf/", "text": "Make an outline!", "author": "sandrakaufmann", "created": 1599310555, "upvotes": 2}, "g441h35": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g441h35/", "text": "Usually most people get their ideas flowing on the first day with a rough draft and then later on expand and finalize it with the real actual paper", "author": "mareo187", "created": 1599305729, "upvotes": 2}, "g43mulw": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g43mulw/", "text": "Yep I almost always write whole papers in an evening. They turn out better that way.", "author": null, "created": 1599295749, "upvotes": 5}, "g43hht4": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g43hht4/", "text": "Same. I had a rough draft of 500 words due for an intro comp class. Wrote that shit 3 hrs before the deadline", "author": "ApsSuck", "created": 1599292467, "upvotes": 3}, "g43djqt": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g43djqt/", "text": "Back in community college, I had a class at 2 pm. Every single paper I'd camp up in the cafe around 8 am (drove friends to their morning classes) and finish before 2.\n\nAdrenaline rush", "author": "Awkwardpenguinperson", "created": 1599289990, "upvotes": 11}, "g43c0yz": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g43c0yz/", "text": "I wrote my senior thesis over three days without sleep or breaks. I did the research and planned out the basic structure beforehand, but holy shit that sucked.", "author": "grumpy_flareon", "created": 1599288828, "upvotes": 5}, "g43bt8p": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g43bt8p/", "text": "When taking a couple days to write a paper I feel like at some point I start rambling. When doing it in one day, I write it straight to the point, just concretely slapping my ideas onto the paper. I always get better grades on the 1 day papers than the couple day ones but that may just be me.", "author": "DjSzymek", "created": 1599288666, "upvotes": 4}, "g43bqij": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g43bqij/", "text": "Even for a 3 page paper I do a sketch/outline on a paper. I write down ideas and thoughts and then group them into paragraphs or topics to write about for the paper.\nThe next day I might spend looking for quotes and such and editing the outline.\n\nThe last day ( or still the second)I can spend just powering through it. I can spend a couple days on this as I can just follow my outline and initial thoughts with adjustments here and there.", "author": "Adadave", "created": 1599288610, "upvotes": 4}, "g43aq3y": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g43aq3y/", "text": "I usually have some sort of plan or brief outline in mind a few days prior to writing it, then I write it in one day, and then review / proofread the next day (the day it's due).", "author": "SGKurisu", "created": 1599287878, "upvotes": 9}, "g4397bn": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g4397bn/", "text": "My composition teacher hates you. I'm still on the fence.", "author": "MajorlyUnhappy", "created": 1599286795, "upvotes": 4}, "g437pdp": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g437pdp/", "text": "Prep work for the paper is where I’ll take my time and figure out what I’m writing about. I’ll do the research and gather quotes and for each quote I’ll get the reference for that source. All on one document. Then I’ll sit down and write my paper and if I use a quote I found, I’ll put it in the references section properly (alphabetically). But yeah, I write my papers in about half a day, generally a day before it’s due. Or the day it’s due, I write better under that stress. \n\nLiterally, I get solid As on those papers vs ones I do over time, I generally get Bs or sometimes even high Cs on.", "author": "fanficaholic", "created": 1599285742, "upvotes": 7}, "g433v6n": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g433v6n/", "text": "Personally it depends how long the paper is and if its easy or hard. If its a short, easy 2 page paper then yeah I can probably do it in a day. If its a long, hard 6 page paper that requires a lot of research then I certainly can’t do it in a day.", "author": "RandomRedditor44", "created": 1599283082, "upvotes": 9}, "g433fpi": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g433fpi/", "text": "Writing prof here: I know it feels that way but you’re wrong, and we can always tell. Not all your teachers are reading your papers, but the ones who are can tell when you started it last night.", "author": "that_tom_", "created": 1599282798, "upvotes": 53}, "g432xx9": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g432xx9/", "text": "[deleted]", "author": null, "created": 1599282478, "upvotes": 71}, "g43051r": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g43051r/", "text": "I typically write a paper and revise it at the same time all in one go. In highschool I got used to procrastinating which forced me to write papers in one go, but now I am just used to writing it all at once when the paper had just been assigned. Sometimes there is paper or two that may have needed more revision", "author": "chili_cheese_dogs", "created": 1599280512, "upvotes": 12}, "g42ymzp": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g42ymzp/", "text": "Definitely, and I then I revise it", "author": "Strawberry500", "created": 1599279374, "upvotes": 3}, "g42vg1n": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g42vg1n/", "text": "I’m best at writing in as few sittings as possible. Idk what it is but if I can sort of ‘get in the zone’ I’m able to spit out much of an essay at one time. Most often right before it’s due and I have no other options", "author": "bagofjudgement", "created": 1599277156, "upvotes": 31}, "g42va24": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g42va24/", "text": "I remeber writing a 10ish page research paper in English about water purification and proper levels of lead and mineral deposits in about 48 hrs. I think that's when I  figured out that procrastination is bad. Although I got a A on that paper I was up for 2 days straight", "author": null, "created": 1599277047, "upvotes": 121}, "g42socd": {"link": "/r/college/comments/imtowf/does_anyone_feel_like_they_cant_write_a_paper/g42socd/", "text": "I usually write papers in 1 day, then wait another day and go back to it and revise it because when you first create the \"rough\" draft... its rough, but it has most of your ideas fleshed out, so doing it a second time just polishes it up. I definitely get where you're coming from though, I hate losing my place and train of thought by having to do a paper over multiple days, but sometimes with massive papers you have to do that anyways so its better to learn how to do it. If it helps, create an outline of your paper before writing it so you know where you left off and where to pick it up.", "author": "CK_003", "created": 1599275417, "upvotes": 374}}}