{
  "sid": "q1adqd",
  "link": "/r/college/comments/q1adqd/most_efficient_way_to_get_a_bachelors/",
  "title:": "Most efficient way to get a bachelors?",
  "text": "Hi all. I'm a 29 year-old real estate appraiser, working full time, who needs a bachelor's degree to move on to the next level of certification in my field. From what I understand, the degree can be in any field and from any accredited school. While I'd love to get a business management degree in a perfect world, I don't have much free time in reality. For that reason, I don't particularly care where I get my degree or what field it's in.\n\nDoes anyone have any advice on obtaining a bachelor's degree as efficiently as possible? I've considered things such as applying to University of the People (tuition free-ish) or trying to find a university where I can test out of courses.\n\nThank you for any info!",
  "author": "ChaseVernon",
  "created": 1633368799,
  "updated": 1634084162,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hfdosbt": {
      "link": "/r/college/comments/q1adqd/most_efficient_way_to_get_a_bachelors/hfdosbt/",
      "text": "You should look into CLEP/DSST exams. I was able to test out of 12 classes (36 credits) for my business management degree going that route. ModernStates.org has free classes to prep you for the CLEP exams and provide you with a voucher so you don't have to pay for the exam.",
      "author": "jenboas",
      "created": 1633371133,
      "upvotes": 10,
      "replies": {
        "hfdri61": {
          "link": "/r/college/comments/q1adqd/most_efficient_way_to_get_a_bachelors/hfdri61/",
          "text": "That's super good info! Thank you!",
          "author": "ChaseVernon",
          "created": 1633372145,
          "upvotes": 4,
          "replies": {
            "hff7kxt": {
              "link": "/r/college/comments/q1adqd/most_efficient_way_to_get_a_bachelors/hff7kxt/",
              "text": "You're welcome!",
              "author": "jenboas",
              "created": 1633393451,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfdvzjg": {
      "link": "/r/college/comments/q1adqd/most_efficient_way_to_get_a_bachelors/hfdvzjg/",
      "text": "You can also check out schools like WGU. It’s fully accredited, online (so you can do classes during your free time), you work at your own pace but can test out of anything. Essentially you start a course, then take the final when you feel ready. You also pay per term instead of per class, but can take as many classes as you want per term. It’s not unheard of for people with experience in the field already to complete their bachelors in 3-6 months. The faster you complete the degree, the less you pay.",
      "author": "BestEstablishment223",
      "created": 1633373802,
      "upvotes": 5,
      "replies": {
        "hfeihkl": {
          "link": "/r/college/comments/q1adqd/most_efficient_way_to_get_a_bachelors/hfeihkl/",
          "text": "I really appreciate the insight - we have a WGU near where I live, so I'll have to check it out. Thanks!",
          "author": "ChaseVernon",
          "created": 1633382028,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}