{
  "sid": "r4yjnw",
  "link": "/r/college/comments/r4yjnw/is_college_worth_it/",
  "title:": "Is college worth it?",
  "text": "I’ve seen so many instances where people have gotten degrees- masters even- that don’t even really use them. What’s the point of college? Am I better off getting a certification for something to make a living off of ? Any insight is greatly appreciated!! I’m 18, and just want to turn my life toward something. I already have lots of experience working with children, and I love doing art.",
  "author": "skdimu",
  "created": 1638200624,
  "updated": 1638206395,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmjj940": {
      "link": "/r/college/comments/r4yjnw/is_college_worth_it/hmjj940/",
      "text": "It depends what you want to do and how much time and money you’d have to spend to do it",
      "author": "to_walk_upon_a_dream",
      "created": 1638201071,
      "upvotes": 1,
      "replies": {}
    },
    "hmjplao": {
      "link": "/r/college/comments/r4yjnw/is_college_worth_it/hmjplao/",
      "text": "If you have a solid plan that will get you lots of money and make you successful go for it. \nIf you have a hidden talent that will get you a good job/wage go for it\nIf you don’t, go to university. \nAfter high school I wasted 1.5 years (long story) then i enrolled in university not knowing what i wanted to major in so i just chose marketing. When i finished turned out there aren’t any demands for marketing grads so i studied accounting (double bachelor).",
      "author": "Money_Phase_7086",
      "created": 1638203735,
      "upvotes": 1,
      "replies": {}
    },
    "hmjjkng": {
      "link": "/r/college/comments/r4yjnw/is_college_worth_it/hmjjkng/",
      "text": "Well it depends what you want to do\n\n\n\nBased on your interests: Don't go to college for art lol\n\n\nAnd for early childhood idk much about",
      "author": "elkfn2",
      "created": 1638201208,
      "upvotes": 1,
      "replies": {}
    },
    "hmjkgr0": {
      "link": "/r/college/comments/r4yjnw/is_college_worth_it/hmjkgr0/",
      "text": "The question you should always ask is, what goal that I want to achieve is made possible by this choice?\n\nFrom your post, I might think you’d enjoy a career in early childhood education.  What would that pay in your area? What would the required degree cost?  Reading the upper level course descriptions for the major, does it sound interesting?\n\nWhat job would you get without the degree? Perhaps at a daycare, or as a Paraprofessional.  What do those jobs pay in your area? Do those jobs have retirement plans & stable growth? What would those certifications take?",
      "author": "NoFilterNoLimits",
      "created": 1638201586,
      "upvotes": 1,
      "replies": {}
    },
    "hmjmn0x": {
      "link": "/r/college/comments/r4yjnw/is_college_worth_it/hmjmn0x/",
      "text": "> Is college worth it?  \n\nThe answer depends on the career field, and respective industry expectations of education within that field.  \n\nThere is no universal answer to this question.",
      "author": "VA_Network_Nerd",
      "created": 1638202502,
      "upvotes": 1,
      "replies": {}
    },
    "hmjpjac": {
      "link": "/r/college/comments/r4yjnw/is_college_worth_it/hmjpjac/",
      "text": "Whether or not college is worth it is a hard question with many unknowns. The upsides of college are lower unemployment rate, and typically more career progression/salary increase. However, it is expensive and it can be years before you actually see the benefits of college because student loans are using any extra money you make.\n\nHowever, there is the aspect that a college education makes you more likely to have cushy office jobs, instead of customer service or manual labor jobs. More regular hours, being around other college educated professionals, and possibly more able to follow your passion. I sent you a DM with some longer info you might want to check out.",
      "author": "Thelton26",
      "created": 1638203713,
      "upvotes": 1,
      "replies": {}
    },
    "hmjsdmg": {
      "link": "/r/college/comments/r4yjnw/is_college_worth_it/hmjsdmg/",
      "text": "Simple, do the research on what you want to do. I’m not a psych major because it’s an over saturated, underpaid field. I’m an electrical engineer instead because it has strong job prospects and is work I enjoy. Also the price is variable. I applied to 20 schools and went to the cheapest. Some colleges offered me to go at $60k/yr, but I got a scholarship to go to a great school for free. So it really comes down to it’s a waste of time if you don’t treat it like it’s your life on the line, because that’s what it really is",
      "author": "harry01772",
      "created": 1638204870,
      "upvotes": 1,
      "replies": {}
    }
  }
}