{
  "sid": "q8ifii",
  "link": "/r/college/comments/q8ifii/how_can_i_concentrate_in_my_classes_knowing_that/",
  "title:": "How can I concentrate in my classes knowing that I can’t afford a 4-year institution?",
  "text": "I’m on my last stretch of community college, I know what school I want to transfer, and I’m currently filling out my transfer application. I never thought on the cost of college, I only concentrated on maintaining a good GPA throughout community college so I would be able to transfer. Now, I have realized that once I transfer, each semester would cost me double than my annual gross income. This is before financial aid, I haven’t filled out FAFSA, but even then, I know aid won’t cover all. This has lead me to be anxious and unmotivated. I’m underperforming in my classes, I’m a mere shadow of the student I used to be. I haven’t talked about this to anyone. I don’t know how to cope with these feelings. I know I can’t afford it, I know I will probably be in massive debt, I know my family does not posses the financial power to afford it, nor the power to get me out of debt.",
  "author": "2Browneyes2",
  "created": 1634279365,
  "updated": 1634583497,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgppe3s": {
      "link": "/r/college/comments/q8ifii/how_can_i_concentrate_in_my_classes_knowing_that/hgppe3s/",
      "text": "If your family can't afford to save you from debt and the cost of tuition is higher than your current income it seems almost likely you will get a sizable amount of aid. In addition aid is proportional based on institution You will most likely have to pay some (I did) but I was massively reduced where working part time enabled me to pay off the rest without resorting to loans. It was a hard 2 years but I made it through and I am sure you can too.",
      "author": "safespace999",
      "created": 1634283485,
      "upvotes": 4,
      "replies": {
        "hgu35sw": {
          "link": "/r/college/comments/q8ifii/how_can_i_concentrate_in_my_classes_knowing_that/hgu35sw/",
          "text": "Thank you for your encouragement. Knowing that I can’t pay for college is a mental weight that I have to carry around with me every day. It really does suck knowing that I will be in debt if I don’t do something.",
          "author": "2Browneyes2",
          "created": 1634368197,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}