{
  "sid": "qf7tlb",
  "link": "/r/college/comments/qf7tlb/how_can_i_effectively_study_for_multiple_courses/",
  "title:": "How can I effectively study for multiple courses at once?",
  "text": "Hello friends!   I’m currently a junior at uni and my classes have finally began to toughen up a bit to the point where I have to actually study consistently to maintain a solid gpa.   \n\n This is my first time in my academic career where I’ve realized the value of studying effectively as the results it yields are nothing short of sweet.   \n\nMy question to you guys is, how can I efficiently and effectively study for two main lecture classes that are both intensive in material in terms of quantity and quality of work. For the past semester I’ve been studying the weeks prior to the exams (2-3 weeks exclusively) & then I fall in an endless pit where I’m basically playing the endless catch up game between both courses. Thankfully it’s been working so far as I’ve been getting great grades but I feel like there is probably a better technique to Yield the same or similar results. \n\nI’m going to experiment this week by attempting to divide my study time between both courses daily for example 4-4 on an 8 hour day, & dynamically adjust based on comfort/knowingness.   \n\nPlease let me in on your secrets as I have my next two upcoming exams in about a month and am looking to improve my study habits!   Thank you guys!",
  "author": "jmario123",
  "created": 1635131738,
  "updated": 1635184302,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhy3rj3": {
      "link": "/r/college/comments/qf7tlb/how_can_i_effectively_study_for_multiple_courses/hhy3rj3/",
      "text": "1. The biggest thing that helped me was to use the Pomodoro method to effectively study. You can adjust how long you study and how long you take breaks to suit whatever material you are studying for (for example, I would have different intervals for a biochemistry exam vs a research paper). Once you know the interval that is good for you, chances are you can study along with pomodoro timing videos on youtube where other people use the same interval.\n2. Set discrete goals each day for your hard classes. Setting manageable goals can help you keep up and possibly ahead. If it is possible, anticipate how long each objective for the day will take. It can be easier to procrastinate 1 task if you give it the whole day vs if you anticipate it taking 3 hrs and trying to finish it in that time. \n3. Find an accountability buddy in both of your hard classes. You don't need to be friends with them long term, but it is helpful to have someone you can bounce ideas off of/study with/ask questions. Make sure this person is reliable and doing well in the courses.",
      "author": "infiniteheart908",
      "created": 1635133939,
      "upvotes": 2,
      "replies": {
        "hhy3wgc": {
          "link": "/r/college/comments/qf7tlb/how_can_i_effectively_study_for_multiple_courses/hhy3wgc/",
          "text": "Thank you !!",
          "author": "jmario123",
          "created": 1635134021,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}