{"sid": "p5lem8", "link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/", "title:": "Anyone else feel like they haven’t found “their people” yet at college?", "text": "Covid definitely has something to do with this. But so far as a junior in college, I feel like I haven’t found “my people” in college, or people I vibe with. I have my hs friends who are there, but in terms of new people, I’ve met maybe 6-7 scattered people every where, from clubs or other events and they are cool to talk to, but I couldn’t see myself hanging out with them because they aren’t my kinda people. For example I’m in a data science club at my school, and while those people are cool, and we talk, outside of data science they don’t talk about anything else or have hobbies/interests like mine so it’s like I can’t be friends with them because there’s simply no commonalities. The other extreme is my hs friends who like to binge drink every weekend. Or another group whose kinda introverted and don’t do much but sit and play video games. It just seems hard to find a solid group of people who share similar interests as me. I only really know like a handful of people from different things, and while we have great conversations nothing grows from it because they aren’t my kind of people. Wondering if anyone else has felt this way.", "author": "NoOutlandishness9892", "created": 1629136780, "retrieved": 1632947761, "over_18": false, "upvotes": 850, "upvote_ratio": 0.99, "comments": {"h9gcb3i": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h9gcb3i/", "text": "Yep, I definitely feel this way as a 3rd year student. I had a \"group\" that I hung out with freshman year, but I've lost contact with all of them except one person who transferred. I do have one friend and many acquaintances who are great people, but they're all going to be graduating very soon, so I'll probably lose contact with them...I plan on joining clubs and activities this fall, so that I can meet new people.", "author": "aanuma", "created": 1629320746, "upvotes": 2}, "h9c90tl": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h9c90tl/", "text": "Hey, I'm totally in the same boat as you! Hopefully, this year will be the year I can find people I vibe with. I'm just gonna trust in the process and reach out as much as I can. :D", "author": "KGurlYY3", "created": 1629237331, "upvotes": 2}, "h9bngbn": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h9bngbn/", "text": "It happens. You may never find them or this may be the year. I recommend going to like the clubs that interest you. I have a hard time because I’m a total gamer of “sit back and do nothing but game or read because I hate going out” but video game clubs and book clubs help find people. All you need is one friend to introduce you to their friends", "author": "KingBlackthorn1", "created": 1629228254, "upvotes": 3}, "h9bfoj4": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h9bfoj4/", "text": "Graduate this fall and never found them. I really tried being social my first two years and just never connected with anyone.", "author": "brucewayne1935", "created": 1629224922, "upvotes": 2}, "h9b82vg": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h9b82vg/", "text": "Last year, by the end of the 1^(st) semester, as the signs of the virus started showing, I was already nearing the peak of the worst period of my life.\n\nWe quickly found ourselves in quarantine, yet schools kept on running in 'capsule' formats. I've had to do a group project with two of my classmates, one of which was struggling with dedicating herself to school --seemingly almost the same way that I did, at times she was worse due to traumatic private matters-- and the second one just didn't want to work as a part of the team. That second student brought me to the peak of my depression. It was the 2^(nd) time I've done that course, and I took with these guys another main course.\n\n In my first year, I've felt I was extremely lonely. With my homies it seemed that all ties were cut, due to mismanagement on both sides, and due to all of us being students in different cities --do keep in mind that Israel is a tiny country. I've also barely seen my family and wasn't good at maintaining phone connections with them. \n\nIn addition to all of that I've felt like I've had no one in my class to socialize with. \n\nI have to admit, I was mostly correct, but not totally, in believing that I've had a possibility to properly socialize on my 1st year, all of my classmates (#40 students), didn't seem suitable for *\"one reason or another\",* **so I didn't even try**. Only at the beginning of my second year I've decided to be much less disconnected and to try to build fertile grounds for connections with everyone, considering we were to study 5 years together, I didn't feel a need to rush any relationship. But soon enough I've felt oh so alone, **again**, gradually all hopes were eliminated, and prospect friendships never formed.  \n\nIt was only when I reached the end of my 2^(nd) year that I've discovered a strong friendship with **a** student from my 1st.\n\nThe first-ever (and only) academic study that I've ever read was [Long-Term Health Implications of Students’ Friendship Formation during the Transition to University](http://www.awhillans.com/uploads/1/2/3/5/123580974/klaiber_et_al-2018-applied_psychology_3a_health_and_well-being.pdf). I really recommend it for new & prospective students, the study mentions that a huge chunk of students feel alone, and their perception of their classmates' socialization is skewed. I really recommend anyone who's read this far to not think too much on finding many friends or being a part of any group, but to find themselves academically, to be kind to others, know when to ask for help and how to do so, how to manage to carry their heads above water in this scary scary scenario that is the academy and friendships will form with the proper social intentions and actions. Do not chase, but don't ever give up.\n\nThat being said this is my personal experience, I'm not taking as no expert and I really just hope you would manage to find your best selves to aid you in this journey, this really isn't an easy step to make for many if not most yet it's so empowering once you're past it, I now realize why my dad said \"when you'd go study \\[it doesn't matter what\\] you will find benefit from the experience\" when I was contemplating what to study.", "author": "HebrewDude", "created": 1629220022, "upvotes": 3}, "h9auq4t": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h9auq4t/", "text": "It took me about a year or two at college to really find a consistent, close friend group", "author": "BeardedBassist21", "created": 1629214444, "upvotes": 2}, "h9arsa8": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h9arsa8/", "text": "I’m a senior. I found my people freshman year and they all either got kicked out or transferred by junior year. There were 8 of us. I had never had so many friends at one time.", "author": "WickedPuffin", "created": 1629213257, "upvotes": 5}, "h99xwz9": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h99xwz9/", "text": "Last year was my first year of college, so I haven’t had any real interactions with peers. This year I’m doing virtual too, but I think I might try signing up for a club or group. I never really had friends like myself growing up, so in high school I hoped that I would meet other people I could bond with and enjoy spending time with. That never happened.", "author": "snortbag123", "created": 1629198633, "upvotes": 3}, "h99x91e": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h99x91e/", "text": "The single biggest thing that helped me was getting a dog and going to the dog park almost every day. It turns out, that most people who have dogs are also depressed/anxious/stressed and we have all bonded over how much we love our dogs and we have a tight knit group of people who are fairly close friends. This may not work for everyone though.", "author": "anon_throwaway13579", "created": 1629198171, "upvotes": 4}, "h99s2ir": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h99s2ir/", "text": "I never did bro", "author": "MarshMallow1995", "created": 1629194259, "upvotes": 2}, "h99pp1m": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h99pp1m/", "text": "Yeah us class of 2023ers got fucked over.\n\nMy closest friends are still my high school and even middle school friends.\n\nEveryone says your freshmen year friends are the ones who were convenient, but likely not people you truly connect with.  Sophomore year is where you narrow it down and find your friends, for a lot of people.  Our second year of real college is probably going to be our senior year at this point, if even. \n\nWell RIP.", "author": "blahblahplahpoo", "created": 1629192310, "upvotes": 11}, "h99hssi": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h99hssi/", "text": "Hey! I had this feeling so intensily during my 2nd year of university that it actually spiralled into me getting depressed. That might be because I'm naturally a very extraverted person so I really started doubting myself. What helped for me was that I kept trying out new stuff and new experiences. I tried out a bunch of different clubs and I went volunteering but I only found my people when I went to a MUN Conference for the first time. So I would really recommend to keep getting yourself out there and not giving up on trying new things.", "author": "ibemibem", "created": 1629185763, "upvotes": 2}, "h997gxn": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h997gxn/", "text": "[deleted]", "author": null, "created": 1629178041, "upvotes": 4}, "h996q70": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h996q70/", "text": "Bruh i graduated and now theres no people left to find 😂", "author": "rank_willy134", "created": 1629177539, "upvotes": 3}, "h993urf": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h993urf/", "text": "I went two months without friends. Turns out you need to talk to people.\n\nSilly me 🤡", "author": "YourAverageThinker", "created": 1629175716, "upvotes": 4}, "h992u9g": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h992u9g/", "text": "Thanks for sharing! I didn’t know that many people were in that position! It sucks honestly!", "author": "Small-Button-2308", "created": 1629175114, "upvotes": 3}, "h991nik": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h991nik/", "text": "Graduated last year. I never found \"my people.\"", "author": "Fitz_Henry", "created": 1629174419, "upvotes": 2}, "h98zgko": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98zgko/", "text": "Same here. I understand how you are feeling. If you cannot find friends at your university, you can develop your network outside via part-time jobs, short course, outside clubs, etc.", "author": "dandy-2902", "created": 1629173152, "upvotes": 2}, "h98uncd": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98uncd/", "text": "Yeah. I did join a photography club so hopefully that works out.", "author": "MaterialDazzling6017", "created": 1629170570, "upvotes": 2}, "h98ue9v": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98ue9v/", "text": "I went to community college for 2 years, transferred to a 4-year school to finish my bachelors, and just finished a 1-year master program (all online due to covid) at the same school.\n\nAfter all this time, I've come to realize that I wasn't intentional enough in finding a group of people in college. Each semester, I found a couple people here and there that I'd talk with off and on, but never really committed to seeing any of them through by keeping up with texts or suggesting hanging out.\n\nI think I let social anxiety get the best of me because I felt like I was imposing and convinced myself they already have friends and wouldn't want to hang out with me or just thought I was strange.  \nNow I'm trying to rationalize that the worst that can happen is I get ignored/rejected, realize it wasn't a right fit, and move on.", "author": "SpinachOk6018", "created": 1629170438, "upvotes": 6}, "h98ofpg": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98ofpg/", "text": "Life is about compromise. Don't have to be disney mate. Enjoy the small things. They add up", "author": "AsimpleLegoPiece", "created": 1629167452, "upvotes": 2}, "h98nm36": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98nm36/", "text": "Aside from my roommates I really haven’t made a group like I have at home either. I’ve made other friends from different things but never really established a group.", "author": "zestyrigatoni", "created": 1629167051, "upvotes": 2}, "h98k5hr": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98k5hr/", "text": "I graduated this year after 5 years.\n\nI never did find \"my people\"\n\nsure, I had a ton of people I knew and I was super social, but I never had that core group of friends like others had. I was always left out of plans and forgotten about.", "author": "Equivalent_Current_3", "created": 1629165418, "upvotes": 5}, "h98ilml": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98ilml/", "text": "Interests change so I would suggest doing activities where you find people who share the same values you do. Those are much deeper. So political organizations and volunteer organizations maybe. Also, please don’t think there’s anything wrong with you for struggling with this. ♥️", "author": "strawberrysweetpea", "created": 1629164708, "upvotes": 5}, "h98iksd": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98iksd/", "text": "Join Greek Life. Best decision I’ve made", "author": "nhaire123", "created": 1629164698, "upvotes": 2}, "h98gfw6": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98gfw6/", "text": "Why does it matter to you that you haven't found your people?", "author": "perpetualdriven", "created": 1629163712, "upvotes": -2}, "h98gflg": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98gflg/", "text": "I’m a fifth year and it’s just me and my dog lol, I’ve given up on finding my people 😅🙃", "author": "AStruggling8", "created": 1629163708, "upvotes": 7}, "h98dh1h": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98dh1h/", "text": "I haven't seen anyone who seems similar to me either.", "author": "Royal-Progress", "created": 1629162342, "upvotes": 3}, "h98b6us": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h98b6us/", "text": "I’m going into my sixth year and I’m so so lonely", "author": "kapbear", "created": 1629161284, "upvotes": 3}, "h985pc0": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h985pc0/", "text": "I managed to make two friends last year but one works like 40 hours and the other works two different jobs. So it's basically like having no friends (except for the Second Friday after a full moon on an odd date- also know as when somehow we are free at the same time) \n\nI'm hoping to make more this year, but i'm basically in the same boat as you :/", "author": "Javret", "created": 1629158744, "upvotes": 3}, "h984h06": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h984h06/", "text": "I guess  those students who aren't given a chance to attend classes in the physical school can relate to this so much. Online classes just keep them going, listening, and responding without the reality of immersing to other students from another class and someone they just come across the university ground. I myself, miss the hustle in the morning, having to wait with someone that eventually turned into friendship, or to think about other people there– that some of them are a character opposite to their appearance, oh the simple fact of being able to converse with someone without having to know their names😆. Actually, I didn't remember when was the time I was gifted of the circle I have now but mostly because I get to talk with them, our interests and interaction. At our school you can see factions of students and where they mostly like to stay..", "author": "Forward-Resolution71", "created": 1629158169, "upvotes": 5}, "h984578": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h984578/", "text": "Do what I did in college and call groups of two or more “You people” Best way to make friends", "author": "B5GuyRI", "created": 1629158015, "upvotes": 3}, "h983hi4": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h983hi4/", "text": "I finished college 2 years ago and still haven't found my people", "author": "BunchMox20", "created": 1629157707, "upvotes": 10}, "h981gtw": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h981gtw/", "text": "Took me until well into my third year to find my people. I had made a friend or two by asking dudes that seemed cool if they wanted to grab a beer, and one of the fellas in my wedding party was met this way. But the vast majority of people I know today were not met until at least halfway through my third year, whom I got to know via volunteering and working in various offices on campus. I met my best man when I accepted a research assistant job just before my fourth year. Pretty much everyone I know is from some college era. And it took a while to find them. My first two and a half years were spent thinking it was going to be a bust.", "author": "purple_ombudsman", "created": 1629156777, "upvotes": 12}, "h97zgt5": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97zgt5/", "text": "Well I only have 4 friends 3 from highschool one I met at college we like anime & video games sadly this year  is the time I get to hang out with him because he will graduate December.\n\nAlso I'm not a social Butterfly and mostly some people piss me off so it's hard for me to make friends.", "author": "SassyHoe97", "created": 1629155877, "upvotes": 2}, "h97w2bz": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97w2bz/", "text": "Yes. I feel so lonely :(", "author": "ishperson", "created": 1629154354, "upvotes": 9}, "h97uxoj": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97uxoj/", "text": "You don’t need to have the same interests to be friends. I do this all the time. I have a variety of friends but only speak with 4-8 people or so that are close to me.", "author": "StereoFood", "created": 1629153862, "upvotes": 3}, "h97tfuc": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97tfuc/", "text": "Definitely. I’m in community college and made zero friends in my 3 years here.", "author": "tha_oz", "created": 1629153206, "upvotes": 5}, "h97opxj": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97opxj/", "text": "I never found \"my people\" I became the individual among the groups. Made friends of all sorts of stereotypes.", "author": "guy_with-thumbs", "created": 1629151171, "upvotes": 4}, "h97ks2a": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97ks2a/", "text": "I did during the 2019 semester as a freshmen had my roommates and friends there but ya know Covid split us all apart and everyone went elsewhere", "author": "ButterscotchJust4", "created": 1629149537, "upvotes": 3}, "h97kr17": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97kr17/", "text": "same dude, I'm also in data science perhaps I need to join that club in my uni. I have been playing sports (volleyball, soccer, basketball) at my uni and made some acquaintances? lol just cause we haven't hung out after and nor do they seem like my type idk, perhaps I should join them for that chick-fil-a run they do occasionally", "author": "Kerisma123", "created": 1629149526, "upvotes": 3}, "h97kdf8": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97kdf8/", "text": "Yeah and unfortunately it doesn't become that much easier in the adult life, aside from maybe your workplace and SO. And if you're lucky, mutual friends.\n\nYou aren't exactly feeling alone, friendships in adulthood have reached [an all time low according to this study.](https://www.americansurveycenter.org/research/the-state-of-american-friendship-change-challenges-and-loss/). 49% of Americans reported having less than 3 close friends in 2021, a 2/3 increase when this wat 27% in 1990.\n\nOnly 13% have a group of 10 friends or more.\n\nSo don't be to hard on yourself and don't blame yourself for not making friends in college. I've said before that college is full of independent people doing their own thing and sometimes it may feel discouraging to try to break their bubble because lord forgive you if they find you annoying. Sometimes you just don't gel with others. Trust me, the college experience is overrated. Even before COVID, I wasn't able to make many friends through no fault of my own.\n\nI yearned for friends as well but now I just sort of take pride in my own things and hope to make at least some acquaintances along the way. It's not high school anymore and that's what sucks about growing up.", "author": "Athragio", "created": 1629149372, "upvotes": 26}, "h97kaan": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97kaan/", "text": "At 26 I'm just realizing that I might have ASD or ADHD -- maybe both -- therefore I don't really have IRL friends due to being socially deficient and not fitting in with either age groups. 😅", "author": "mental_dissonance", "created": 1629149337, "upvotes": 14}, "h97k1um": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97k1um/", "text": "I had a whole friend group my first year, I felt great. Some stuff came up and I had to take a gap year, after that I realized they were not my people and now I'm thinking about transferring as a junior. \n\nI'm a girl and love to play video games and being at a preppy school, this does not fly well with other girls. I think it does take trial and error and I've heard from a lot of people that you don't necessarily meet your best friends at college.", "author": "louthefrenchie", "created": 1629149241, "upvotes": 21}, "h97jvjl": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97jvjl/", "text": "You should hang with your high school friends more. Also don’t say “binge drinking”. You don’t have to go as crazy as them, but they sound like they are socially involved and would probably help you get out of your shell.", "author": "EvilBob_RapePants_", "created": 1629149170, "upvotes": 3}, "h97iqkb": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97iqkb/", "text": "Feel like I ghost wrote this. I'm also a junior. I had a group of friends, transferred schools last year with covid restrictions, and still haven't found a new group of friends that I vibe with. I'm hoping since my school is having more events this year I'll find more people I like, but with me really getting into my major this year, I fear I won't have time to make those connections", "author": "Foreverdiva", "created": 1629148702, "upvotes": 37}, "h97fnyp": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97fnyp/", "text": "I never found my people. I used to have a lot of friends when I was new to college because I thought that's the most important thing. But as time goes by, a lot of my friends went on to their separate ways. Some took a gap year, others took different classes and few dropped out. \n\nNowadays, I only interact or socialise with people for group projects or studies. I do miss hanging out with a group of friends.", "author": "SnooPickles2204", "created": 1629147476, "upvotes": 18}, "h97dk51": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97dk51/", "text": "I graduated in May and you will not know your people until you have separated yourself from them over several months and years.", "author": "nugsandbug", "created": 1629146652, "upvotes": 3}, "h97d5tk": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97d5tk/", "text": "College isn't for making friends or for learning. It's simply so you can get the entry requirements to apply for jobs + utilize any college services they have for helping you get a career.", "author": "Pinglewingle", "created": 1629146499, "upvotes": -3}, "h97c1da": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97c1da/", "text": "4th year, 0 irl friends, 1 online friend. I had an irl friend my 2nd year but I didn’t meet her at school, we met on Bumble. We don’t talk anymore. I have no clue how people make legit friends in school", "author": "chadan1008", "created": 1629146060, "upvotes": 52}, "h97brfe": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h97brfe/", "text": "I think this upcoming semester will have a lot of people in the same position looking for friends considering most of us haven’t had in-person classes in a while. It’ll probably be pretty easy to put feelers out there and find people that you’d like to spend time with.", "author": "claymore93", "created": 1629145955, "upvotes": 83}, "h978nna": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h978nna/", "text": "Yeah I found my group right away. Big group of 10 of us. We all played D&D and video games together. But through a series of stupid events they kinda became assholes and now I only have two left. I’m on my fourth year now and had it all just to start all over again. But it’s fourth year so everyone already has their little groups and whatnot.", "author": "Tuckertcs", "created": 1629144747, "upvotes": 18}, "h978man": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h978man/", "text": "I was at my first university for three years and never made any lasting relationships. I’m starting at my new transfer university next week and I don’t know if I’m optimistic, but I’ll try to put myself out there.", "author": "FreezingDemon", "created": 1629144733, "upvotes": 39}, "h978h1t": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h978h1t/", "text": "i'm going into senior year of college now and I'm in the same situation. I meet people in classes, clubs, etc. but I haven't found anyone that I would actually hang out with outside of that. It sucks honestly", "author": "chocopromise", "created": 1629144678, "upvotes": 70}, "h975kom": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h975kom/", "text": "I don't expect to. It sucks though because I'll occasionally see someone who I feel belong to my \"tribe\" but it's just based on style and whatnot and we never actually meet", "author": "unholymanserpent", "created": 1629143537, "upvotes": 54}, "h974ojo": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h974ojo/", "text": "2nd year student here, was just thinking about this today when I realised I have literally nobody to hang out with nor do I enjoy anyone's presence in particular (except my boyfriend's on whom I can't rely my entire social life 'cause that would be unfair to him). I've talked to like 2 or 3 people here and there, was actually starting to think I like one until hanging out with said person started feeling like a chore and overall not enjoyable. so we kinda stopped talking. then I even tried hanging out with a group (well, it was 3 other people), but that was probably my most uninspired choice ever. I was thinking that maybe I'm too picky. dunno man, I'd just like to have some girlfriends to hang out with after work sometimes and with whom I can actually talk about stuff. it's hard out there.", "author": "bibicicimici", "created": 1629143187, "upvotes": 68}, "h96t6a0": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h96t6a0/", "text": "I think a lot of college is about learning to connect with people who you don’t naturally mesh with. It’s a valuable skill to have in the real world. \n\nHaving said that, I understand what you mean. I am an introverted guy who doesn’t care anything about sports, so that cuts me out of a lot of folks’ hobbies.", "author": "115machine", "created": 1629138581, "upvotes": 371}, "h96sumx": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h96sumx/", "text": "Yep same here, going into my 3rd year of college and haven’t really made any friends. Definitely because of COVID as I’ve already started to make more friends electronically over the summer.", "author": "taa20002", "created": 1629138451, "upvotes": 130}, "h96oyze": {"link": "/r/college/comments/p5lem8/anyone_else_feel_like_they_havent_found_their/h96oyze/", "text": "ehhh most of my friends annoy the fuck out of me. don’t think you can really get “your people” at college, it’s all about adjusting and being open.", "author": "anonanon1489", "created": 1629136893, "upvotes": 30}}}