{
  "sid": "hu1qwr",
  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/",
  "title:": "How are your colleges tackling COVID-19?",
  "text": "It sucks that every office has every call to them go to voicemails and emails take a week long to get a response. As of right now, this is how things are looking for me at school.\n\n\\- Roommates are required to wear masks when in their rooms -\\_-\n\n\\- People from other dorms can't come into your dorm and vice versa\n\n\\-Automatic suspension for people who party (lol)\n\n\\- If you decide to go online, you lose your housing assignment and will be homeless in spring\n\n\\- If you go online, you're on your own. You have to contact each professor and find out how they are doing online classes.\n\n\\- Dining halls, fitness centers, everything are closed. Daily life will be Room, Class, get food, Room.\n\n\\-The best part is that there are 39 people on my floor this year and we have 2 bathrooms for all of them!!!!\n\nThere are so many other things but it's just going to make me sad lol. I wish I could do this semester online but my school is making it so difficult that it's not even worth it. What are your schools doing? \"Additional details will be provided in the coming weeks\" is my school's plan and I wanted to know if your schools have better plans for this fall.\n\nEDIT: Btw, my school never sent out an official email saying that there is an online option. I only found out that we do by emailing an advisor and asking if there is an option.\n\nTheir plans for bathrooms are - basically extra cleaning and mask to and from bathroom\n\nSeems like everyone is in a similar boat as me and time will only tell. I wish good luck to everybody and hope that everyone stays safe.",
  "author": "Hazelstat",
  "created": 1595170517,
  "over_18": false,
  "upvotes": 785,
  "upvote_ratio": 0.98,
  "comments": {
    "fyw6h65": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyw6h65/",
      "text": "Today, 3 weeks before move-in, they told us they’ve decided to cancel returning to campus for fall semester...",
      "author": "anaco16",
      "created": 1595439948,
      "upvotes": 1,
      "replies": {}
    },
    "fyqgq3i": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyqgq3i/",
      "text": "Start Classes September 2nd\n\nIn person classes until Thanksgiving break\n\nOnline classes after Thanksgiving till December 19th",
      "author": "ImpulseDecider",
      "created": 1595305708,
      "upvotes": 1,
      "replies": {}
    },
    "fyp9c3x": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyp9c3x/",
      "text": "I go to a CC the next county over. For fall, all lectures will be online, but most labs will be on-campus. \n\nLet's see how long it last until an outbreak occurs. \n\nI just feel like taking off a year tbh...",
      "author": null,
      "created": 1595280879,
      "upvotes": 1,
      "replies": {}
    },
    "fyo09do": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyo09do/",
      "text": "I think mine is being pretty fair. \n- We house lots of low income and international students with no where to go so dorms and food are still open. \n- You are able to request an online version of any class if you want to stay home. (Awesome!)\n- A lot of classes were made available with online classes. \n- The negative is that they still charges us building and dining even if we don’t plan to come on campus.\n- The positive is that if you stay home and take online classes you get a small stipend to combat the online fees. They also gave everyone who stayed this semester a $100 book scholarship.\n\nI’ve fell in love with online classes so I’ll take advantage of putting classes that weren’t online, online.",
      "author": "StarFizzle",
      "created": 1595258848,
      "upvotes": 1,
      "replies": {}
    },
    "fynurun": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynurun/",
      "text": "E-school at UCF, unless you have an art class , or a history class or humanities or something with a really small capacity that can be put in a 300 person lecture hall and be social distancing with 33 to 50%. \n\n\n•mask wearing in the building for those class sections that are literally face to face. \n\n\n•Professors can reserve the right to have a class partitioned (I can’t think of another term) like having a full class be cut into different sections showing up on M/W/F in the lecture hall (I’m not sure what class that would be for). \n\nI’m not sure about residence halls as I live 2-3 miles from campus.\n\n• Fitness/rec centers are open at a modified schedule.",
      "author": "jameskishtok",
      "created": 1595255948,
      "upvotes": 1,
      "replies": {}
    },
    "fynrxl5": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynrxl5/",
      "text": "1) Option for single room dorms but majority of campus live in suite-style dorms \n\n2) Designating 300 rooms for ‘quarantine rooms’ incase someone shows symptoms/tests positive \n\n3) Option to do online for any class at any time\n\n4) Some classes are ‘multimodal’ so they will have in person components/online components and other classes are fully online\n\n5) I’m fairly certain we will be ordering food from dining halls on an app and then picking it up \n\n6) Not allowed to congregate in the dorm hallways/common areas \n\n7) Can’t go into dorm buildings other than your own \n\n8) No Guests \n\n9) All Sports Cancelled \n\n10) The gym will be open but they’ve moved everything to space it out \n\n11) Library/Rec Center are limited capacity and designed for social distancing \n\n12) Option for students to stay home and take online \n\n13) Masks to be worn everywhere except dorm room",
      "author": "reveluvs",
      "created": 1595254370,
      "upvotes": 1,
      "replies": {}
    },
    "fynrsyu": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynrsyu/",
      "text": "My school seems to be handling it pretty sane, although I don't dorm so I have no idea how that situation is gonna be. Basically every class that doesn't need to be in person is online or hybrid, so everything except a lab and senior design for me, although I think even those will be mostly distanced. Probably just gonna sit in my apartment and do my classes there.",
      "author": "epicblob",
      "created": 1595254297,
      "upvotes": 1,
      "replies": {}
    },
    "fynl5k6": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynl5k6/",
      "text": "Only about 30% of students will be dorming. We are an art, fashion, and business school so the 70% of classes that don’t require studios are not in person. We will also be having an A and B schedule, in which half of the studio class attends in person for one week and the other watches from dorm or does their work remotely in another studio. The next week these groups swap.",
      "author": "maebird-",
      "created": 1595250144,
      "upvotes": 1,
      "replies": {}
    },
    "fyn4b4u": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyn4b4u/",
      "text": "Holy shit defer a year. My school is doing nothing of the sort. Granted only 6 cases in the county. But regardless that is bullshit and not college you should definitely tell them to kick rocks and go to a CC for a year or just take a gap year.",
      "author": null,
      "created": 1595234755,
      "upvotes": 1,
      "replies": {}
    },
    "fymuq2o": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymuq2o/",
      "text": "My college has basically admitted they don't have a concrete plan, especially as far as housing goes. Yesterday, actually, I heard from someone whose parent works in admissions that the school made deals with local hotels so students could have singles because we don't have enough on campus. I know we'll have to wear masks on campus (not sure if we'll be required to do so while in dorms) and that visiting other dorms will be limited (although I wonder how exactly that'll be enforced because that would require more security especially at night). Also apparently dining will be more/mostly take out. I really don't know how they're going to enforce everything as far as living on campus. I go to a small school so it's going to be hard because we already have such a small campus. I'm predicting it's going to be a mess lol, especially when it comes to partying on weekends because that all happens at houses off campus, which my school has no control over, and even if they did, I doubt the students would follow any rules. I genuinely have no clue how this year's gonna happen.\n\nLuckily (or maybe not so luckily), I signed a lease in January before everything went down. Only 2 out of my 5 classes went fully online so it isn't too bad, but if all of my classes go fully online it's gonna kinda suck to be paying rent when I'm not required to be in the area. At the same time, though, I like having my own space and I've been in my childhood bedroom since March so I appreciate the opportunity to be someone else lol. Also luckily all of the rules for living on campus and the precautions they take for the dorms won't apply to me, so that's a bonus and has put my mind at ease since I won't be having to share a bathroom with many people/worry about coming into contact with so many people for the entire day.",
      "author": "xmilanomacaroons",
      "created": 1595225428,
      "upvotes": 1,
      "replies": {}
    },
    "fymntgn": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymntgn/",
      "text": "For some background: I attend a small, prestigious, VERY RICH (seventh-highest endowment per student of any college in the United States) liberal arts college in the northeast. The college is extremely residential; 97% of students live on-campus, and all students are guaranteed on-campus housing all four years. Living on-campus is an important part of social life. Here is what’s happening:\n\n- First-Years, sophomores, seniors who studied abroad last year, new AND returning transfers, and international students invited back. Seniors doing a thesis which would be very hard/impossible to do without off-campus materials, students with circumstances that make remote learning very difficult, and any student who feels they have extreme circumstances that require them to be on-campus were allowed to apply for permission to return. \n- All students are living in singles \n- All students required to wear masks everywhere except their dorm rooms. \n- All students have the option of continuing remote learning, and all faculty + staff members have the option of returning. Virtually all classes can be accessed by students who continue studying remotely.\n- ~2/3 of classes in a “HyFlex” mode, where the class is taught in-person for everyone on-campus and people off-campus can tune in simultaneously. ~1/3 of classes fully remote, as a result of classes with over 35 students (not very many of those) and professors who opt to teach remotely. \n- Students don’t have access to dorms other than the ones they are living in (and they are not allowed to go into other dorms) \n- All areas will be frequently sanitized \n- Student-To-Bathroom ratio reduced to 7:1\n- All students will be tested twice a week, there are multiple hundred quarantine/isolation rooms across three dorms and two local hotels (including one the college owns) for only 1200-1250 students on-campus\n- Students are not allowed to leave campus except in emergencies or to pick up prescriptions/something of that nature (all students must notify Student Affairs and develop a plan; they are putting a convenience store in the campus center to minimize need to travel off-campus)\n- You can’t gather in groups of more than nine. \n- All students have to physically distance and wear masks everywhere\n- All students must download a contact tracing app\n- Dining is on a grab-and-go model where you place your order in advanced and select a pick-up time\n- There is plexiglass virtually everywhere where contact between students and faculty/staff is necessary, etc. \n- 20 outdoor tents equipped with special technology for classes, since the virus has a much harder time spreading outdoors (this is why we did not see significant COVID-19 spikes with the BLM protests, but we see many cases pop up from bars). All students encouraged to study, socialize, and eat outside with friends.\n- Classes starting two weeks earlier than initially planned, ending the week before Thanksgiving. Reading Period (week of no classes before finals) + Finals Week held remotely. This allows for them not to have to deal with the logistical issue of sending all students home and bringing them back, and allows for outdoor interactions to be maximized (much less time in cold New England weather).\n\nAnd I do think there will be measures to prevent students from breaking the rules besides honor code, because they have invested so much in reopening (they have taken $110 Million from the endowment, which is roughly $60K per student), and hired many individuals to help keep campus life safe, that I would think they have invested too much to have it all thrown away by students who break the rules. It would have been much cheaper for them to have just continued remote learning entirely or open without precautions and deal with a potential lawsuit later. They have hired several nurses/doctors, a contact tracing manager, several contact tracing professionals, and an infectious diseases expert.",
      "author": "Tillytilly10",
      "created": 1595219820,
      "upvotes": 2,
      "replies": {
        "fyok1ry": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyok1ry/",
          "text": "Are you sure it is costing them $110 million and not $10 million? It doesn’t make sense to me because my college is doing basically the same things with $10 million",
          "author": "I-am-a-pepper",
          "created": 1595268549,
          "upvotes": 1,
          "replies": {
            "fyokf43": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyokf43/",
              "text": "Yes I’m sure: $110 Million. Not a typo or a mistake. $110 Million out of a $2.5 Billion (now $2.4 Billion) endowment. Cited in several sources as the most my college has ever withdrawn from their endowment. A lot of it could be our HyFlex classes, because I read in an Inside Higher Ed article that most universities rejected it because it cost roughly $8K PER CLASS to implement.\n\nAlso, they are partnering with an outside organization called 2U to significantly increase remote learning quality, so that could also contribute to it.",
              "author": "Tillytilly10",
              "created": 1595268729,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fymkjdw": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymkjdw/",
      "text": "By raising the price.",
      "author": "stainless_steel702",
      "created": 1595217475,
      "upvotes": 1,
      "replies": {}
    },
    "fymcbc0": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymcbc0/",
      "text": "Been online since March 15th till at least Jan 2021. Canada BTW",
      "author": "iSpeezy",
      "created": 1595212077,
      "upvotes": 0,
      "replies": {}
    },
    "fymbuk4": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymbuk4/",
      "text": "Name and shame your college. You could be a plaintiff in a class action lawsuit.  Furthermore, I see intentional infliction of emotional distress here as well, and ask for a remedy of free tuition for life.",
      "author": "tsmithfi",
      "created": 1595211781,
      "upvotes": 1,
      "replies": {}
    },
    "fymaac7": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymaac7/",
      "text": "My college closed the dorms and sent us all home. From Philippines btw. The following academic year will be online.",
      "author": "pythadzuki",
      "created": 1595210798,
      "upvotes": 1,
      "replies": {}
    },
    "fym8scr": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym8scr/",
      "text": "Most of our classes are in person/hybrid with a few online. Our campus will be closed to the public and students will be tested twice a week. Bagged lunches. Outdoor classes. Mandatory masks and social distancing. They have a separate building for people who are sick. Almost everyone indicated they’ll return to campus (a couple thousand people).",
      "author": "I-am-a-pepper",
      "created": 1595209868,
      "upvotes": 1,
      "replies": {}
    },
    "fym5wu2": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym5wu2/",
      "text": "my college doesn’t even know how they’re going to handle it",
      "author": "bad-habibi",
      "created": 1595208132,
      "upvotes": 1,
      "replies": {}
    },
    "fym40sv": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym40sv/",
      "text": "Making us do online classes and then charging us more for it",
      "author": null,
      "created": 1595206991,
      "upvotes": 1,
      "replies": {}
    },
    "fym1ewk": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym1ewk/",
      "text": "My son’s college still says they’ll hold in person classes this fall. I doubt it to the point that he’s staying at home rather than in the dorms (saving the $11k the college wants to charge makes it an easy decision). We expect a virtual fall, hoping for a transition in the spring to in person instruction. It’s a 20 minute drive to class.",
      "author": "vicemagnet",
      "created": 1595205417,
      "upvotes": 0,
      "replies": {}
    },
    "fylznbs": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylznbs/",
      "text": "Prison with class basically",
      "author": "mihelic8",
      "created": 1595204350,
      "upvotes": 1,
      "replies": {}
    },
    "fylz6uu": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylz6uu/",
      "text": "Since we’re in a state that has been dealing with it well, and it’s a university in a small-ish town, we’re going back to campus with in person classes\n\nSure it could be worrying but our town has only had a handful of cases and we were the town that dodged the Spanish flu so I’m not overly worried",
      "author": "shawnglade",
      "created": 1595204080,
      "upvotes": 1,
      "replies": {}
    },
    "fyly7on": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyly7on/",
      "text": "My college is only allowing 50% of the student body back to campus at any time (we run on a quarter system) \n- Freshman get priority for fall and spring in-person\n- Seniors get priority for spring \n- Juniors get priority for fall\n- Sophomores get priority for summer (a lol wtf moment, but at my college it’s a requirement to be on campus your sophomore summer)\nNo one gets priority for the winter quarter and I’m not sure how many will want to be on only for the winter anyways. The other half of the student body will end up taking online classes. \n\nWe have to quarantine for two weeks on arrival and take a COVID test, wear masks at all classes and dining halls, gym and sports centers are closed. We’re restricted to groups of 8 or less and 6 feet of distancing between everyone. \n\nAlso, contact tracing and daily check ins with an app the college has created is required. This is the most invasive step of the process.\n\nYou won’t see me being a guinea pig towards this new updated fall term.",
      "author": "gabezillaaa",
      "created": 1595203495,
      "upvotes": 1,
      "replies": {}
    },
    "fylup7n": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylup7n/",
      "text": "My college is starting testing for all students and staff/faculty tomorrow morning. We have 4 testing locations (and 1 or 2 for locals). On campus we will have to wear a mask, i havent heard anything about our dorms. My town has recently re-closed the bars due to an increase of cases locally. When the students come back my areas population will double, my friend and I give it a 3-5 week timeline until the university is completely online again.",
      "author": "minimantate",
      "created": 1595201427,
      "upvotes": 1,
      "replies": {}
    },
    "fyluk36": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyluk36/",
      "text": "What school is this? It sounds a lot like my school.",
      "author": "turd_farts",
      "created": 1595201344,
      "upvotes": 1,
      "replies": {
        "fylvihw": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylvihw/",
          "text": "Syracuse University",
          "author": "Hazelstat",
          "created": 1595201895,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fyluggr": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyluggr/",
      "text": "We're in person until Thanksgiving. Then we go online unless you have a lab that requires you to show up in person the entire time.\n\nDorms are normal as far as I know.",
      "author": "Zerobeastly",
      "created": 1595201285,
      "upvotes": 1,
      "replies": {}
    },
    "fyltjzh": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyltjzh/",
      "text": "“We are going to be having in person classes”, idk who they think they’re fooling. Also, since they technically won’t be kicking anyone out of the dorms, they can justify not refunding people if (when) they decide to do all classes online.",
      "author": "_theatre_junkie",
      "created": 1595200774,
      "upvotes": 1,
      "replies": {}
    },
    "fyltazw": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyltazw/",
      "text": "The biggest thing my school is doing that I haven't seen mentioned here is changing when/how our already registered classes are going to be held. They're scheduling classes so that they're held from 7am-9pm every M-F, with the possibility of dipping into Saturday if necessary.\n\nI'm a little pissed about this because I only have 3 lecture classes this semester, and only 2 are on campus. They already shortened classes to give us 5 extra minutes traveling between classes, which is great. I'm mad because my 2 classes on campus already have an hour of separation between the end and start time, so I don't know what else could be done without screwing up my schedule completely. If anything major changes it could impact my work availability and availability for practicum field work that still needs to be assigned. Changes are supposed to begin in 2 hours and I'm pretty worried tbh",
      "author": "crazychica5",
      "created": 1595200631,
      "upvotes": 2,
      "replies": {}
    },
    "fyls8l6": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyls8l6/",
      "text": "This is making me dread college next fall...",
      "author": "Aquarius_00",
      "created": 1595200011,
      "upvotes": 1,
      "replies": {}
    },
    "fylptqn": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylptqn/",
      "text": "Mine is arguably worse. Firstly, all classes are gonna be in person (but they said they could possibly make some hybrid classes part online part in person), they did mandate masks but only in public, they’ve been very avoidant of the question about how people in dorms and stuff should stay safe. They mentioned that students are gonna have to take a daily survey about any possible symptoms (there’s no way to enforce this or to make people not just lie). They said if you get it that you have to quarantine but that would be hard in dorms. They also have not mentioned anything about parties at all and people sure as hell aren’t gonna be masking up there lmao. A lot of people on my college’s subreddit believe that they’re gonna have in person classes for a few weeks just so they could bait us into paying full price then move everything online. \n\nIf that doesn’t happen then there are gonna be big spreading events, halloweekend is gonna be the worst. Students from colleges all over the state and some out of staters coke to my school for Halloween, not to mention that thanksgiving break is just a few weeks later where people will take it home or maybe even bring it back for the 2 weeks we come back to school till winter break. It’s gonna be absolutely awful honestly. But Oxford seems confident the vaccine they’re working in will be done in September and mass produced by oct-nov so I guess we’ll see",
      "author": "NeverForgetEver",
      "created": 1595198670,
      "upvotes": 1,
      "replies": {}
    },
    "fylpchv": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylpchv/",
      "text": "we are doing “hybrid“ for lectures @ 50% cap one week we will show up in person and the other online",
      "author": "princess_carolyn7",
      "created": 1595198413,
      "upvotes": 1,
      "replies": {}
    },
    "fylnls0": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylnls0/",
      "text": "All my classes are online. I’m not going to school in the fall. I don’t even have a dorm room as they prioritized upperclassmen.",
      "author": "Meredith232",
      "created": 1595197450,
      "upvotes": 1,
      "replies": {}
    },
    "fylnjk6": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylnjk6/",
      "text": "Not well, that’s all I’ll say.",
      "author": "rainydayinmay9",
      "created": 1595197416,
      "upvotes": 1,
      "replies": {}
    },
    "fylm1om": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylm1om/",
      "text": "I just graduated but I'm still paying attention to what my former school is doing. Basically all that they've said is that \"classes will be in person\". 🤷‍♀️ they'll be starting a week earlier and will be done a week earlier. No breaks, just go straight through for 11 weeks. No notice on sports, rooming situations, dining, activities, etc. I think they're just going to wing it lol. I believe that they'll be at full capacity too because I know that all staff is back on campus.",
      "author": "thriftybee123",
      "created": 1595196587,
      "upvotes": 2,
      "replies": {}
    },
    "fylkxhi": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylkxhi/",
      "text": "My school finally sent out its full (and mostly-complete) plan, and IMO it's looking about as solid as it could be without just going fully online.\n\n- We're not required to wear masks in our own dorms (seriously what on earth!?), but masks are on anytime we're outside them, whether that's in a common area, somebody else's dorm, or even outside if we're not certain that we can maintain a six-foot distance.  The exceptions to the mask rule are when we're actively eating (the dining hall will be open, but with severely limited capacity, extended operating hours, and an expanded to-go option), or in certain classrooms which are large enough to keep a six-foot distance (There's only like three of those on-campus though, and they're generally pretty packed when class is in session, so I suspect this won't be as helpful as it would be otherwise.)\n\n- All classes are in-person by default, but people with high-risk medical conditions have had the opportunity to inform people about them to get their classes switched to hybrid or fully online, with the Provost determining if a class needs to take further measures as the semester continues.  Students are expected to be in-person as much as is safely possible, though.  \n\n- The campus library and the various lounges are all staying open.  They haven't said anything about the fitness center, but I could honestly see it going either way.  They're also setting up a bunch of outdoor tents for an additional place to socialize.\n\n- We'll be taking our temperature and submitting a screening checklist every day before leaving the dorms.  I don't imagine that the checklist will actually do much, but the mandated temperature screenings will make me feel a little safer assuming somebody's actually keeping track of who's doing them and who isn't.\n\n- The college is providing hand sanitizer and Lysol wipes for us to clean our desks and whatnot with before and after classes - I'll appreciate this more if it's actually enforced, but honestly I feel like it'll be pretty 50/50 as to whether or not a professor cares enough to bother with it.\n\n- All students are being told not to come if they've been in contact with someone who's tested positive in the last two weeks (unless they got a negative test), and are being requested to self-isolate for one week before returning.  Students from the most highly-infected states must have a negative test result from within 7-10 days of returning to campus, and must self-isolate from the time the test was conducted to the time they arrive on campus.\n\n- As with a lot of other schools, our schedule has been compressed; we're beginning the semester a week earlier than was planned, they've eliminated fall break, and we're all going home after Thanksgiving to do finals online in the first week of December.  This one is honestly the worst part for me; three months straight is going to *suck*.",
      "author": "Chickengun98",
      "created": 1595195981,
      "upvotes": 3,
      "replies": {}
    },
    "fylk69w": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylk69w/",
      "text": "Mine hasn’t released anything except their will be a quarantine area for sick students. That’s literally it.",
      "author": null,
      "created": 1595195571,
      "upvotes": 1,
      "replies": {}
    },
    "fylcoxp": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylcoxp/",
      "text": "I go to a small college in NY with about 3000 people. Currently, we are still going for in-person/hybrid classes. They remodeled campus to put in glass/hand sanitizers everywhere. Masks are required everywhere besides the dorm rooms. If you test positive, you have to quarantine in another building for two weeks. Tested periodically throughout the semester. Gym is closed as of now and dining hall will be limited capacity.\n\nHonestly, I think my college has been pretty good about coronavirus. Around 80% of my college is from NY and NY as a whole has been doing very well with case numbers. I am cautiously optimistic that I'm going to have an uninterrupted semester. The combination of going to a small school in a state with good numbers is giving me some good vibes.",
      "author": null,
      "created": 1595191492,
      "upvotes": 2,
      "replies": {}
    },
    "fylcgax": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylcgax/",
      "text": "Fall semester online rip",
      "author": "jsb028",
      "created": 1595191359,
      "upvotes": 1,
      "replies": {}
    },
    "fylc1vs": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylc1vs/",
      "text": "Im going to start college in fall 2023, do you think it will have any restrictions then? i hope not and it feels unlikely. If i have to go to college with this stuff, then ill just not go to college lol.",
      "author": "jbot-",
      "created": 1595191148,
      "upvotes": -1,
      "replies": {
        "fylfnd1": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylfnd1/",
          "text": "bruh",
          "author": "LeastKarmaonReddit",
          "created": 1595193114,
          "upvotes": 5,
          "replies": {
            "fylfrxg": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylfrxg/",
              "text": "what? Im just curious.",
              "author": "jbot-",
              "created": 1595193183,
              "upvotes": 0,
              "replies": {
                "fylfxhq": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylfxhq/",
                  "text": "I doubt there will be any restrictions in Fall 2021, let alone 2023",
                  "author": "LeastKarmaonReddit",
                  "created": 1595193267,
                  "upvotes": 5,
                  "replies": {
                    "fylgc0t": {
                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylgc0t/",
                      "text": "True, i bet by then ther'll be a vaccine. Sucks for the people going into college this fall tho, they have to pay for online classes, and not get to have fun and party.",
                      "author": "jbot-",
                      "created": 1595193486,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fyljzyp": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyljzyp/",
          "text": "It's changing week by week. No one has any idea what will happen this August, much less years from now.",
          "author": "acm2033",
          "created": 1595195482,
          "upvotes": 1,
          "replies": {
            "fylp7jc": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylp7jc/",
              "text": "Yeah ig",
              "author": "jbot-",
              "created": 1595198343,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fylbscp": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylbscp/",
      "text": "The masks on in your dorm rule sounds really unpleasant. At my college if we’re completely alone, eating or in our dorm room, we can take our mask off.",
      "author": "the_strangling_fruit",
      "created": 1595191010,
      "upvotes": 2,
      "replies": {}
    },
    "fylb3b6": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylb3b6/",
      "text": "At my university:\n- All dorm rooms are single-occupancy by default. Having a roommate requires both students signing a waiver. Overflow rooms are in the local hotels.\n- Masks on in every public space. Apparently this includes living rooms of dorm suites, though I doubt that'll happen.\n- No guests who live in a different building.\n- One of the smaller dormitories is a designated quarantine area.\n- Dining halls will be open as usual but will have greatly expanded take-out options.\n- Class sizes are reduced and more online options are offered.\n- The entire Pennsylvania State Athletic Conference (which includes schools in Ohio and West Virginia, such as mine) is planning to have football, marching band, and other fall activities in the Spring.\n- Complete sanitation in all facilities will be happening daily.",
      "author": "zaxophone_bswv",
      "created": 1595190627,
      "upvotes": 2,
      "replies": {}
    },
    "fylan6j": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylan6j/",
      "text": "Is it really worth it to go to school this semester?",
      "author": "inkdrops",
      "created": 1595190378,
      "upvotes": 3,
      "replies": {
        "fylcokx": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylcokx/",
          "text": "For sure, the social opportunities and activities are as important to college as the academics are. For me, going back would depend on the quality of life among all the restrictions. I'm going ahead for this semester because, at my university, public spaces such as dining halls and cafes will still be open, just requiring masks, and the School of Music is creating new music activities to replace marching band (which is planned to happen along with football in the Spring). However, reading the other comments here, some schools seem to be putting much tighter restrictions and closures in place, and at that point I think I'd just take the semester off, or even the whole year. College only lasts a few years, and I want to get the most out of it that I can, and there's a certain point at which it would feel like a waste to me - a waste of time, money, and happiness - to be spending a whole semester or whole year in college with none of the enjoyment that is supposed to come with it. I'm not going to college so I can sit around in my dorm all day, and I wouldn't be going to college if the most I could get out of it were comparable to the least.",
          "author": "zaxophone_bswv",
          "created": 1595191486,
          "upvotes": 5,
          "replies": {
            "fyle6jw": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyle6jw/",
              "text": "Personally, its not worth it to go back to school right now because you're damned if you follow restrictions (lose out on the college experience we pay so much for) and damned if you don't (outbreak of deadly virus).",
              "author": "inkdrops",
              "created": 1595192313,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "fylalz7": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylalz7/",
      "text": "Damn what the hell kinda college you going to? I go to Spalding and they’re giving everyone a room to themselves to social distance. And they said if we don’t feel comfortable going to class, they’ll have video of each class that we can watch in real time.\nAnd I’ve already had one of my professors send us our syllabus and plans for class. I believe our grab-and-go food will be open, but I’m not sure about dining hall.\n\nMy college has said we’ll get move-in info on Aug 1 and we can choose one of 3 days to move in.\n\nAlthough I do agree about emails and stuff. I can’t purchase a parking pass and no one’s been replying back to me.",
      "author": "Vincebae",
      "created": 1595190360,
      "upvotes": 9,
      "replies": {}
    },
    "fyla0ld": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyla0ld/",
      "text": "Masks in their own dorms? So sleeping with masks, etc? by being in such close contact, if your roommate has it you probably will too hah, no matter if you wear a mask or not. Masks outside I totally understand thoigh",
      "author": "alexaplaydespacito2",
      "created": 1595190034,
      "upvotes": 2,
      "replies": {}
    },
    "fyl9tn8": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl9tn8/",
      "text": "My college plans on having hybrid classes (or completely online, up to the professor) they actually lowered the cost of room and board since we’re being kicked out on November 22nd. But also there is more single rooms available and no 4 person rooms. There will be less people on each floor so there will be less people per bathroom. But yeah, you gotta have a mask every but in your room.",
      "author": "TricksterSprials",
      "created": 1595189927,
      "upvotes": 1,
      "replies": {}
    },
    "fyl8i3d": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl8i3d/",
      "text": "Wow suspended for partying? My college in my area is known for partying and we have no rules enforcing that . Since you asked I’ll share my university rules for COVID :\n1. We have to wear masks when inside except for outside.\n\n2. Day visitors are allowed aslong they’re registered. No overnight visitors.\n\n3. Students who comes from hot spots from corona, must be tested. Nasal swabs (not nasopharyngeal swabs\n\n4.  We open up early so students don’t have to return back to campus from Thanksgiving break.\n\n5. Classes with maximum capacities of 50 and above will be moved to an online format. \n\n6. Large events are canceled.\n\n7. Classrooms are reconfigured . So for an example  a lecture hall that previously accommodated 100 students may now be able to seat 42 students after being reconfigured to allow physical distancing.\n\n8. The buffet locations are being changed from self-serve to staff-served in order to reduce common touch areas.\n\n9. Employees and students will be asked to monitor their health on a daily basis.\n\n10. Students living on campus who test positive for the virus will be quarantined for a minimum of 14 days at an off-campus location",
      "author": "Tina_reformed",
      "created": 1595189198,
      "upvotes": 7,
      "replies": {}
    },
    "fyl82mm": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl82mm/",
      "text": "Hybrid education. Online cause possible. Phyical when possible.",
      "author": "Sadsuh",
      "created": 1595188964,
      "upvotes": 1,
      "replies": {}
    },
    "fyl7j5r": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl7j5r/",
      "text": "* Masks required everywhere on campus except for your dorm room. You put on a mask when you leave your dorm room. School will provide masks for everyone on campus. \n* Temperature check for when you enter and exit your dorm and enter other buildings. \n*  Hybrid classes. I only have one fully online class and most of my classes are on Tuesday and Thursday. One class just on Monday and one just one MWF class. I really love my schedule for this semester. \n* Social distancing in dining areas. To go and online ordering available. No buffet. \n* School Events will be on multiple locations across campus. Social distancing at events.  Big events will have live streams. \n* The semester will end when we leave for Thanksgiving break.  \n\n&#x200B;\n\nI'm glad they aren't doing regular testing because I am very afraid of getting tested for COVID. I feel like I would have a bad reaction (e.g get a bad nosebleed) if I get the swab test.   Also, my school has less than 4,000 students and I go to a small public school in the south if that helps.",
      "author": "extrasmallbillie",
      "created": 1595188670,
      "upvotes": 5,
      "replies": {}
    },
    "fyl6pq8": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl6pq8/",
      "text": "They are using the best method, that is >!not_opening_the_colleges.lol!<",
      "author": "its_kaushik19",
      "created": 1595188219,
      "upvotes": 0,
      "replies": {}
    },
    "fyl6l34": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl6l34/",
      "text": "Only freshmen and some seniors on campus, everyone gets their own room, only class online is the first year writing seminar, once we get on campus testing every other day, then it will slow down to just twice a week, we aren’t allowed to leave the state until Thanksgiving Break, No parties, Gyms open after 2? weeks",
      "author": "memeqween101",
      "created": 1595188148,
      "upvotes": 4,
      "replies": {
        "g13e9sx": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/g13e9sx/",
          "text": "What school do you go to?",
          "author": null,
          "created": 1597147613,
          "upvotes": 1,
          "replies": {
            "g14st05": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/g14st05/",
              "text": "a LAC in the northeast",
              "author": "memeqween101",
              "created": 1597174074,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fyl68cn": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl68cn/",
      "text": "My college is making all Juniors and Seniors live in a nearby hotel, one floor for women and one for men. Though we get to use the pool, taking the local bus to my 8:00 AM is gonna suck. (-_-;)",
      "author": null,
      "created": 1595187954,
      "upvotes": 1,
      "replies": {
        "fyltkai": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyltkai/",
          "text": "[deleted]",
          "author": null,
          "created": 1595200778,
          "upvotes": 1,
          "replies": {
            "fyp1mbw": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyp1mbw/",
              "text": "Apparently they plan to open it, the state is far beyond most.",
              "author": null,
              "created": 1595277077,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fyl5nwo": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl5nwo/",
      "text": "not sure why 39 people to 2 bathrooms is a problem unless they're not normal dorm bathrooms with stalls. anyway my college is doing all online until they come out with a vaccine",
      "author": "iamfearformylife",
      "created": 1595187643,
      "upvotes": 2,
      "replies": {}
    },
    "fyl5mod": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl5mod/",
      "text": "My school is pretty much resuming as normal. Given we're in one of the lowest covid states and an extremely rural part of that it isn't much of a big deal honestly. I think after Thanksgiving we go online.",
      "author": "Gamerred101",
      "created": 1595187625,
      "upvotes": 0,
      "replies": {}
    },
    "fyl4mbz": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl4mbz/",
      "text": "I know half of the rules on your list are exaggerated but I understand due to your frustration. There is no way school can enforce you to wear masks in personal living space. Don’t make up rules man. But Covid is gonna kill us all. No college student is gonna follow these regulations.",
      "author": "Near_River21",
      "created": 1595187073,
      "upvotes": 0,
      "replies": {}
    },
    "fyl41a6": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl41a6/",
      "text": "My uni keeps emailing us conflicting things. They sent an email recently where they said, and I quote, “Health and safety is a priority, but not the priority. We know people will test positive, will get sick, even deathly ill.” This whole situation makes me sick and the people in charge making these decisions are tapped in the head man smh",
      "author": "EbicEngineer",
      "created": 1595186758,
      "upvotes": 2,
      "replies": {}
    },
    "fyl40lx": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl40lx/",
      "text": "They aren't",
      "author": "theblurryboy",
      "created": 1595186748,
      "upvotes": 1,
      "replies": {}
    },
    "fyl40kc": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl40kc/",
      "text": "My campus is still going through Greek Recuriment .... it’s going to be mostly through zoom but I’m at a lost for words why we are doing it when no activities  will be going on",
      "author": "MCR5ever513",
      "created": 1595186748,
      "upvotes": 1,
      "replies": {}
    },
    "fyl33ym": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl33ym/",
      "text": "All of my labs went to online only",
      "author": "HighwayToThe________",
      "created": 1595186262,
      "upvotes": 1,
      "replies": {}
    },
    "fyl2k8k": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl2k8k/",
      "text": "I cannot get over the masks in your own rooms. I imagine the RA breaking the door down at 3 AM and tasing anyone asleep without a mask on \n\nI go to a “party school” so I imagine it’ll be a Hunger Games of immune systems by mid-September. Nothing is going to stop Becky and Katie from rushing for OmegaPiAlphaPiOmega, global pandemic be damned!",
      "author": "tstarkslut",
      "created": 1595185973,
      "upvotes": 10,
      "replies": {}
    },
    "fyl1pzz": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl1pzz/",
      "text": "Wait, they want you to sleep with a mask on?",
      "author": "Tannercheck",
      "created": 1595185537,
      "upvotes": 3,
      "replies": {}
    },
    "fyl11sw": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl11sw/",
      "text": "My school wants to do it in person hybrid and require masks which might be doable since it's a small school with small classes anyway, if they weren't right in the middle of a city. \n\nAlthough they just sent out an email yesterday that basically said \"yo we really really wanna be in person but the city won't let us reopen yet but we're trying to appeal that\" so it's very possible that it'll be all online this year. \n\nI understand that online is safer and definitely the smarter move, however I am on day 128 of being stuck at home and at my absolute limit. If I can't get out of here by the end of the year I'm done. The depression has already been creeping back in and it's reached the point where something has to change soon or I'm gonna lose it completely.",
      "author": "IaniteThePirate",
      "created": 1595185181,
      "upvotes": 4,
      "replies": {}
    },
    "fyl0lne": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl0lne/",
      "text": "1.) honestly, as someone who HATES party culture, the suspension for parties is a dream for me. if my school did that i would finally get a full nights sleep!\n2.) masks in your room?? that’s a bit ridiculous😂",
      "author": "carolineekelleyy",
      "created": 1595184947,
      "upvotes": 0,
      "replies": {
        "fymb4ua": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymb4ua/",
          "text": "People go to parties half naked in 8 degree weather. Aint nothing stopping them.",
          "author": "Hazelstat",
          "created": 1595211332,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fyl0hcw": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl0hcw/",
      "text": "Mine let the professors choose what they want to do with their classes, so a lot are remote and theres a good chunk of in person hybrids too. I lucked out and every single one of my classes is remote, so I’m rescinding my room assignment and I’m really sad. Oh well",
      "author": "bcyega",
      "created": 1595184884,
      "upvotes": 1,
      "replies": {}
    },
    "fyl0d1m": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl0d1m/",
      "text": "Our school is saying that if your housing (off campus included) doesn’t have at least 1 bathroom for 2 people they can’t come on campus. They decided this after most students signed their leases in a city where most apartments are 3 or 4 to a bathroom:",
      "author": "morganf74",
      "created": 1595184822,
      "upvotes": 3,
      "replies": {}
    },
    "fykzyjq": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykzyjq/",
      "text": "Honestly this doesn't even sound worth it. I'm so glad I graduated last spring right when everything went to crap because this year is going to be a cluster.",
      "author": "squirrel8296",
      "created": 1595184610,
      "upvotes": 5,
      "replies": {}
    },
    "fykzpgl": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykzpgl/",
      "text": "Not applying to me currently as I'm on leave, but in addition to a lot of the stuff from this list students (not online I don't think, just campus) will also be required to fill out an app questionnaire every single day, including temperature and has location tracking, even if you are off campus (i.e. took a trip over the weekend). Needless to say a good amount of people don't like this, especially the location tracking",
      "author": "InfernalArtist",
      "created": 1595184480,
      "upvotes": 3,
      "replies": {
        "fyldku0": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyldku0/",
          "text": "That's dark. There's no way I would let my university constantly track my location, I would go on leave for the semester if my school used something like that.",
          "author": "zaxophone_bswv",
          "created": 1595191979,
          "upvotes": 1,
          "replies": {
            "fym541o": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym541o/",
              "text": "It's not constant I don't think. No idea if it gets your location when you fill it out every day but there is a qr code system tracking every building you're entering on campus (and exiting? Some wording is pretty vague)",
              "author": "InfernalArtist",
              "created": 1595207647,
              "upvotes": 2,
              "replies": {
                "fyma5xb": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyma5xb/",
                  "text": "Hmm interesting. My university hasn't announced anything like that yet. I guess we'll see.",
                  "author": "zaxophone_bswv",
                  "created": 1595210722,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fykzb7t": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykzb7t/",
      "text": "Unless you and your family are in a financial situation  where you have to either finish in four years or not graduate at all, I would highly recommend just taking a gap year.",
      "author": null,
      "created": 1595184278,
      "upvotes": 1,
      "replies": {}
    },
    "fykz9nn": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykz9nn/",
      "text": "I’m transferring to a college closer to home and I haven’t been able to schedule my classes yet because my advisor won’t contact me. Everyone else has but me and I feel neglected, which doesn’t help my already low self esteem",
      "author": "Burt_Sprenolds",
      "created": 1595184257,
      "upvotes": 2,
      "replies": {}
    },
    "fykyzxe": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykyzxe/",
      "text": "They’re having hybrid classes up until thanksgiving break where it will be online for the rest of the semester. I assume this is so they can justify full tuition",
      "author": "xthatguy339x",
      "created": 1595184121,
      "upvotes": 1,
      "replies": {}
    },
    "fykya3e": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykya3e/",
      "text": "So hands on classes and specific majors get to be in school while everyone else has to be online. But most of my classes are online as I’m an art major and I have a BIO class this semester but all mine is online. I don’t know how I’m supposed to do ceramics either lmao.",
      "author": "DucksOnQuackYo",
      "created": 1595183746,
      "upvotes": 1,
      "replies": {}
    },
    "fyky9dt": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyky9dt/",
      "text": "My school is having everyone in single rooms (very small school lmao), mandatory masks at all times, when not in your room, and we're all leaving before Thanksgiving and having finals online. I am curious how bigger universities are doing things...",
      "author": "awayfromyonder",
      "created": 1595183736,
      "upvotes": 1,
      "replies": {}
    },
    "fykxfth": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykxfth/",
      "text": "Full tuition for online classes, which is a really shitty thing to do. Full tuition for pdfs and video lectures of 3 classes that seem like they should be minor classes. Online classes do not have the same quality as regular classes. Majority of us failed the midterm, an exam that was not properly made or checked by faculty. I'm studying a health care major and the teachers had to post YouTube tutorials steps for performing  health assessments. \n\n\nA few have been opting to drop out from the next semester (which is next month) because it seems like it's going to be online. They're planning to take a gap year to work. I am seriously doubting enrolling if it's going to be online, faculty and students are already struggling with the three online classes, it's going to be harder with a full set of classes with the likes of Kinesiology.",
      "author": "succaro",
      "created": 1595183303,
      "upvotes": 10,
      "replies": {}
    },
    "fykx4k0": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykx4k0/",
      "text": "We have to wear masks everywhere but our assigned rooms, I don’t know anything else though, despite having an on campus job \n\nLibrary? Dining halls? Guests @ the uni/outside of it? Classes (all of mine are in person...as far as I can tell...) \n\nI’m going to be moving in August 3rd...that date is rapidly approaching and I know nothing, other than how to safely move in.",
      "author": "BumbleBlooze",
      "created": 1595183135,
      "upvotes": 2,
      "replies": {}
    },
    "fykwuff": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykwuff/",
      "text": "Tbh it amazes me how colleges expect their plans to work without failure. I get how things are hard but there is no way rules will not be broken. People are already talking about partying (there are mid summer parties), people have to share bathrooms, and no one, NO ONE (especially in the US) will go to campus just to study, most people expect or plan on taking parts in events (parties, group stuff, Greek life, etc.)",
      "author": "ElBarro69",
      "created": 1595182987,
      "upvotes": 12,
      "replies": {
        "fyle0kb": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyle0kb/",
          "text": "Here in West Virginia, Morgantown just had a major spike in cases among people in the 20-29 age group. The cause is confirmed to be major midsummer partying among WVU students.",
          "author": "zaxophone_bswv",
          "created": 1595192222,
          "upvotes": 3,
          "replies": {}
        },
        "fyljicm": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyljicm/",
          "text": "I think every college and university expects their plans to have flaws and change. For public schools, they have to also navigate difficult political issues, since they're tax supported... none of these decisions are made in a vacuum and none of them are made are without intense scrutiny.",
          "author": "acm2033",
          "created": 1595195225,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fykwtnl": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykwtnl/",
      "text": "- Dining hall is no longer buffet style\n- Got rid of roommates so it’s one person per room unless you fill out a special form\n- Option to go online (most classes are hybrid)\n- Require masks when indoors\n- Contact tracing\n- Fill out a symptoms questionnaire every day to be allowed to go to class\n- No visitors from other dorm buildings \n- No outside visitors\n- Social distancing in rooms (visitor must be from your building)\n- Still coming back after Thanksgiving\n- Will get a refund on housing if campus shuts down again\n- Dorm cleaning people now come on weekends and twice a day\n- Every other bathroom stall is in use\n- Cancelled Homecoming\n- Spreading out move-in times\n- Only two people can help you with move-in, and there are no professional helpers this time\n- Can only use main entrance to residence buildings\n\nThere’s probably more but that’s what I remember off the top of my head. We’re a pretty small school so we have more flexibility.",
      "author": "Eyrmia",
      "created": 1595182976,
      "upvotes": 10,
      "replies": {
        "fylj646": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylj646/",
          "text": "My school is continuing after Thanksgiving, but we’re not allowed to go home for it.",
          "author": null,
          "created": 1595195040,
          "upvotes": 4,
          "replies": {
            "fym051c": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym051c/",
              "text": "I guess that's understandable, but kinda lame. I'm probably not going home for Thanksgiving anyway just because it's such a long drive.",
              "author": "Eyrmia",
              "created": 1595204646,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fyllpsx": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyllpsx/",
          "text": "Wait, so they’re forcing more students to use less toilets?",
          "author": null,
          "created": 1595196406,
          "upvotes": 4,
          "replies": {
            "fym01ar": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym01ar/",
              "text": "Well, there are fewer students in general because all the rooms are singles now, so I think it sort of evens out.",
              "author": "Eyrmia",
              "created": 1595204583,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fykwne9": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykwne9/",
      "text": "I go to college in Arkansas, let me just say, I plan on getting corona and dying this fall",
      "author": "sirpumpington",
      "created": 1595182885,
      "upvotes": 1,
      "replies": {
        "fylm30h": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylm30h/",
          "text": "Harding?",
          "author": null,
          "created": 1595196608,
          "upvotes": 1,
          "replies": {
            "fylmilr": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylmilr/",
              "text": "UCA",
              "author": "sirpumpington",
              "created": 1595196848,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fykwmqm": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykwmqm/",
      "text": "Hybrid with a lot online unless they require “in person experience” ie. labs. They announced that they were setting up cameras in each classroom so lectures could be live steamed 🥴 but announced this week the vendor was having supply issues lmfao. But also announced that tuition will remain the same. If i didn’t only need 1 more class to graduate i probably would be deferring. This is a shit show.",
      "author": "thot_bryan",
      "created": 1595182875,
      "upvotes": 2,
      "replies": {}
    },
    "fykwghn": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykwghn/",
      "text": "Right now we're being told masks on at all times on campus in public areas, but that classes will be on-campus as normal.\n\n\nBehind the scenes... Practically every class but labs and essential classes that simply cannot operate online have been switched to online-only without notice. Only reason I found out was cause I went and checked the descriptions of all my classes and noticed they all were now labeled as online-only.",
      "author": "walterdog12",
      "created": 1595182784,
      "upvotes": 1,
      "replies": {}
    },
    "fykw6j8": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykw6j8/",
      "text": "No visitors that are not students, masks only enforced in academic and common buildings, hybrid classes, and cafeteria is only open to students. Limited student activities",
      "author": "ArtemisTater",
      "created": 1595182640,
      "upvotes": 2,
      "replies": {}
    },
    "fykvvef": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykvvef/",
      "text": "You should just go to a community college. It doesnt sound like you will get any college experience over there so there is no point shelling out thousands for a restricted and isolated time. Just make sure you credits transfer. \n\nChances are, if someone over there gets sick they may shut the whole school down and it will just be a repeat of spring semester. I was lucky because I was already living at home going to a community college and honestly the only difference between my quarantine education  and my university friends is that mine is cheaper.\n\nI dont want to scare or discourage you, but I dont want you to waste money on a terrible college experience and end up getting sick by some chance anyways.\n\nRight now, my community college is giving us the option hybrid classes. Because its a community college only like 6-10 students will be in a classroom social distanced with masks. Then the other half show up another day while the other half watches online. This is mostly for the science lab students, technical students like welding and stuff, and maybe dancing and other stuff thats hard to do at home. Non Stem classes like history and english the majority are online with one or two hybrid courses, in case one absolutely cannot function in an online class. All hybrid courses have virtual lectures, though I often find myself struggling to pay attention.\n\nCurrently, Im a student tutor there, so I tutor virtually through zoom. Took some time getting used to, but hey, it works.\n\nTo wrap things up I say seriously consider going to a community college. Like even in social terms its better, because its not like you live there. You can do whatever you want inbetween or after classes because the RA will not be watching you (Since there is no RA!) Mind you we are in a pandemic so dont go crazy, but if you social distance, wear your MASKS, and be mindful you should be okay.\n\nTips: Take stairs to avoid touching elevator buttons and standing in a covid petri dish. Bring disinfectant wipes, you dont know how healthy the guy sitting in your seat previously was. Bring an extra mask just in case you lose or drop yours. Wear gloves when necessary, like if im walking down the stairs i must absolutely hold on to the stairwell so I dont trip and die not sure about you. BE CAREFUL AROUND BATHROOMS, like touching stall doors and handles, and entrance doors. HAND SANITIZER! Becareful around your friends, you dont know where they been, its not like everyone is being careful or else Covid would not be this bad in the first place. If you have barely been outside like me then I recommend practicing or going over how you will function outside (like getting gas, shopping, etc), not sure about you but I havent done any of these since March when I was allowed outside my neighborhood unsuperivsed\n\nHey, im starting my second year of college this fall. I know decisions like these are not easy. I wish you a smooth as possible college year and hopefully spring or next college year will be lit.",
      "author": "TheRapidTrailblazer",
      "created": 1595182488,
      "upvotes": 3,
      "replies": {}
    },
    "fykvonn": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykvonn/",
      "text": "all of this sounds like actual hell, i'm so glad i graduated",
      "author": "ctrldwrdns",
      "created": 1595182388,
      "upvotes": 6,
      "replies": {}
    },
    "fykvhyj": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykvhyj/",
      "text": "- Everyone is tested upon arrival and quarantined until results come back  \n\n- Random testing every two weeks\n\n- Freshman and sophomores are here in the fall, juniors and seniors here in the spring (for reference, my school has about 1.6k people) So I know I will be online in the spring \n\n- Groups of 20-30 People are in clusters that don’t have to social distance from each other, as determined by our classes and our dorms\n\n- No one can help us move in, since we haven’t been tested yet\n\n- The semester system has been split up into a quarter system with two classes each term. Same amount of classes total \n\n- Minimal parties (hosts large gatherings will cause suspension or expulsion)\n\n- Mandatory masks \n\n- Students aren’t allowed to leave the surrounding area (town of 5k people) unless it’s an emergency \n\n- Clubs and stuff are online, at least since half the campus will be away each semester. Small social gatherings still allowed though\n\n- Dining hall has staggered times to eat, determined by the clustered groups above. Lunch is to-go",
      "author": null,
      "created": 1595182289,
      "upvotes": 1,
      "replies": {}
    },
    "fykvddv": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykvddv/",
      "text": "For arrival:\n\n- If you're travelling in a multi passenger vehicle (plane, train, bus, etc), then you have to quarantine in the state in a hotel or house or on campus (not your dorm though) for 2 weeks before moving in. You get a test when you arrive and another in 7 days, and if you are negative on day 7 then you can stop quarantining.\n\n- If you come from a county with 400 cases per million or more then you have to quarantine at home for 2 weeks. You also get tested upon arrival or in your home state within 48 hours of coming to campus, then again in 7 days.\n\n- If you come from a county with less than 400 cases per million and you come in a personal vehicle then its only on day 7\n\n- But everyone is also getting tested randomly throughout the semester, or so they claim\n\nFor classes:\n\n- Some classes are fully remote, some are hybrid, and some are in-person\n\n- 6 feet between seating in classrooms\n\n- New seating/occupancy arrangements for labs/theaters/outdoor areas\n\n- They're turning some buildings into classrooms in order to have more space to spread people out\n\n- Office hours are either outside or inside in a larger space\n\n- Some labs/theaters are going to be outdoors when possible\n\n- Masks are required and some faculty might be wearing face shields too\n\n- Actual classes are supposed to end right before we leave for Thanksgiving break, then we take our finals online rather than going back on campus for exams\n\nDorms:\n\n- My school still hasn't said anything about housing yet, but my guess is that parties and large gatherings are not allowed (but they're still likely to happen, just more lowkey).\n\n- We also can't have visitors on campus, and they got rid of our October break and split it up into single days off so we don't go home. They want us to stay in the general area and not go home",
      "author": "Rbxyy",
      "created": 1595182222,
      "upvotes": 9,
      "replies": {}
    },
    "fykuvp4": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykuvp4/",
      "text": "No masks in dorm room, but wear them in the dorm hall.  Masks at all times in public.  No visiting other dorm halls.  Extremely discouraged from leaving campus and parties result in disciplinary action.  Students can switch online at anytime.  Dining halls, etc are still accessible.",
      "author": "chilicheesedoggo",
      "created": 1595181964,
      "upvotes": 2,
      "replies": {}
    },
    "fykufyt": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykufyt/",
      "text": "Colleges should just encourage gap years for those that are concerned and have classes like normal for everyone else.",
      "author": "infinitecitationx",
      "created": 1595181740,
      "upvotes": 4,
      "replies": {}
    },
    "fykufic": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykufic/",
      "text": "My school said they'd be entirely online except for labs and arts, but apparently the labs and arts are online too. So I don't know if anyone will actually be there in person.",
      "author": "OkayKatniss413",
      "created": 1595181734,
      "upvotes": 1,
      "replies": {}
    },
    "fyktb37": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyktb37/",
      "text": "Dorms are going to be one person per room for the next academic year.",
      "author": "bextie",
      "created": 1595181170,
      "upvotes": 3,
      "replies": {
        "fymkm2z": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymkm2z/",
          "text": "Haha my college is having 8 man suites.",
          "author": "Im_Mehed",
          "created": 1595217527,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fyksgjw": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyksgjw/",
      "text": "The out of city students are asked to stay home. The few students that live in the dorms this whole year since the majority are international & didn't want to risk the journey. From what I'm reading only bio & chem majors are commuting for their labs courses. My uni has communicated really well actually but the student population voted to stay online besides sci majors.",
      "author": "Kotes-",
      "created": 1595180732,
      "upvotes": 3,
      "replies": {}
    },
    "fyksb7e": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyksb7e/",
      "text": "They are not.",
      "author": "elkj13",
      "created": 1595180655,
      "upvotes": 3,
      "replies": {}
    },
    "fykry25": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykry25/",
      "text": "mine is online except for classes that need to be in person like lab courses and art courses",
      "author": null,
      "created": 1595180462,
      "upvotes": 3,
      "replies": {}
    },
    "fykrmxe": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykrmxe/",
      "text": "I have online classes until fall of next year lol",
      "author": "Zao17",
      "created": 1595180300,
      "upvotes": 13,
      "replies": {
        "fykv0bd": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykv0bd/",
          "text": "Damn dude I’d take a gap year if possible unless you have some kind of scholarship",
          "author": "Etrau3",
          "created": 1595182031,
          "upvotes": 10,
          "replies": {
            "fyl7sdb": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl7sdb/",
              "text": "I'm in a CC and I'm planning on transferring in 2 years so it doesn't bother me a lot",
              "author": "Zao17",
              "created": 1595188811,
              "upvotes": 8,
              "replies": {
                "fyl801j": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl801j/",
                  "text": "Oh that’s good!",
                  "author": "Etrau3",
                  "created": 1595188927,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fykrgre": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykrgre/",
      "text": "My school is doing it almost 100% online for the fall semester. A few lab courses might take place in person, but they consist of a small number of students. The following semester will almost certainly be online too.\n\nAll residence rooms will be single occupancy. I guess partying is \"technically\" allowed because our health officials are going to eventually allow gatherings of <50 people.\n\nGyms and some restaurants on campus will be open, following social distancing recommendations.",
      "author": "Giant_Anteaters",
      "created": 1595180210,
      "upvotes": 2,
      "replies": {}
    },
    "fykqpls": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykqpls/",
      "text": "Man I’m deciding to just work and take a semester off bc I don’t trust my campus to enforce quarantine rules",
      "author": "JediJoshy1",
      "created": 1595179811,
      "upvotes": 20,
      "replies": {
        "fyl106o": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl106o/",
          "text": "i was going to do that but i would lose my scholarship :(",
          "author": "carolineekelleyy",
          "created": 1595185157,
          "upvotes": 11,
          "replies": {}
        },
        "fyksr3q": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyksr3q/",
          "text": "This is honestly the best move for you - just save and when you're safe mind & body you should register. Getting that degree definitely isn't a race now considering nearly big corporations & office jobs cease to exist at the moment.",
          "author": "Kotes-",
          "created": 1595180883,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fykqejo": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykqejo/",
      "text": "My universities plan for this is such scummy bullshit. Basically, they're allowing professors with <50 students to decide whether or not they will be in person, hybrid, or online. At the very least they're limiting dormitories to one person per room--although, given how contagious covid is that wont do jack shit if a cluster begin--and limiting in person operations to only 1,200 a day? Don't worry though, they're supplying all students who return to campus with a free thermometer--hopefully the rectal type--and expect them to self diagnose symptoms.\n\nOkay, so now that I've explained the plan which wont work. Where I live we are currently accepting COVID patients from two separate states because they're both going full blown YEEHAW instead of listening to professionals. We are slowly depleting ICU capacity and will likely result in a shutdown again. My university made this \"plan\" such that they can just \"shutdown\" and blame it on the governor. They're making it look like the professors have the decision but that decision must be passed onto admin for \"approval\". This is their \"plan\" to shift the blame and hopefully get away with a quick money grab.\n\nSo to sum it up, there is no plan for the virus. They had 4 months to implement better telecommunication and utilize innovation to ensure students can return in the fall. They're trying to act like we're so \"strong\" or \"resilient\" but overall they spent more time describing how their budget is being cut instead of having a legitimate plan.",
      "author": null,
      "created": 1595179651,
      "upvotes": 9,
      "replies": {}
    },
    "fykponj": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykponj/",
      "text": "lol you got ripped off. My college experience was a dream of the past. Now at r/gradschool idc about anything except twinks.",
      "author": "Orthadondist_nothere",
      "created": 1595179275,
      "upvotes": 1,
      "replies": {}
    },
    "fykpoh5": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykpoh5/",
      "text": "My school just recently announced moving to online class (💀). A few classes are in-person/hybrid BC of the subject (ex: labs). As for on campus living, it’s still available, but we can opt out and not pay the housing fee. \nWe don’t have a mask-roommate rule haha. But my school promises they are going to sanitize everything in the Res halls (laundry, elevators, doors, etc. . And if someone in the dorm gets Covid, we won’t close. No no no, the student is going to quarantine for two weeks in their room and residence life is going to provide them laundry, food, and school services to them so they don’t have to leave their room. The question is: who’s doing that job! Our campus RA’s are still going back to campus so schools kinda being shady rn. \nGym and food halls are still open but limited service. \nWe have to wear masks on campus but they don’t have any repercussions if someone doesn’t wear masks 💀💀 but yea. That’s what my schools doing.",
      "author": "cxitln",
      "created": 1595179272,
      "upvotes": 13,
      "replies": {
        "fyl0hcc": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl0hcc/",
          "text": "Your school’s plan is not perfect from a health perspective but at least it’s something the school can realistically enforce.\n\nI am not sure how the OP’s school is gonna enforce wearing masks 24/7, even in dorm rooms. Are there gonna be cameras in dorms that monitor what students are doing?",
          "author": null,
          "created": 1595184884,
          "upvotes": 7,
          "replies": {}
        },
        "fylcn71": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylcn71/",
          "text": "I wonder what Ohio Colleges are doing.",
          "author": "jbot-",
          "created": 1595191465,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fykpl9s": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykpl9s/",
      "text": "Wtf where do you go?? Your school is definitely in debt and can’t afford to go fully online and is scared of that happening so they have to go full precautions",
      "author": "charlesdickinsideme",
      "created": 1595179226,
      "upvotes": 22,
      "replies": {
        "fymazbm": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymazbm/",
          "text": "Lol my school is NOT in debt. They have so much fking money. College is a business and at the end of it, students AND staff (they never get mentioned) will be the ones affected.",
          "author": "Hazelstat",
          "created": 1595211235,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "fykphyf": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykphyf/",
      "text": "My school gave people the option of doing hybrid online/in person classes, all online, or taking a gap semester. I chose the hybrid option.\n\nI have to be tested once a week, wear a mask at all times, social distance, and I can't visit my friends dorms anymore as a commuter.\n\nNot how I saw my senior year starting, but I'll make do.",
      "author": "nonconformistnugget",
      "created": 1595179176,
      "upvotes": 80,
      "replies": {
        "fykro1d": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykro1d/",
          "text": "Please tell me they’re getting some form of funding for the tests and they’re not making students pay for it or taking it out of the money that goes towards improving the school....",
          "author": "tea-times",
          "created": 1595180317,
          "upvotes": 33,
          "replies": {
            "fykrr5u": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykrr5u/",
              "text": "Nope, we have to pay for it ourselves. A lot of people are pissed about it.\n\nCan't do online classes because I'm doing thesis in the fall, and for some reason that's not online.",
              "author": "nonconformistnugget",
              "created": 1595180362,
              "upvotes": 37,
              "replies": {
                "fyksado": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyksado/",
                  "text": "Ohhhh that is *so* dumb. Can you get them for free at testing sites that often and have results sent to the school? I don’t know how much it costs, but I’d assume the cost is going to add up significantly with testing ~20 times...",
                  "author": "tea-times",
                  "created": 1595180643,
                  "upvotes": 11,
                  "replies": {
                    "fykuaek": {
                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykuaek/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1595181661,
                      "upvotes": 1,
                      "replies": {
                        "fykxg1m": {
                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykxg1m/",
                          "text": "I’ve heard that places where you donate blood will test you. It might just be a thing where my college is at but it’s worth a shot. Not sure how healthy giving blood every week is, though.",
                          "author": "Eyrmia",
                          "created": 1595183306,
                          "upvotes": 5,
                          "replies": {
                            "fylgtmf": {
                              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylgtmf/",
                              "text": "You can’t give blood every month, let alone every week. I believe the amount of time you have to wait for your body to remake all of its blood is about 6 months. \n\nMy health department is doing free curbside testing, but I’d assume they’d start refusing you once you started coming in frequently. They don’t even have enough gloves to spare (I got a teeth cleaning recently, and they were reusing GLOVES. That were in my *MOUTH* and other’s...)",
                              "author": "tea-times",
                              "created": 1595193754,
                              "upvotes": 3,
                              "replies": {
                                "fym09pz": {
                                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym09pz/",
                                  "text": "Ummm if this is true find a new dentist... like actually",
                                  "author": "fizzysocks21",
                                  "created": 1595204726,
                                  "upvotes": 5,
                                  "replies": {
                                    "fym264h": {
                                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym264h/",
                                      "text": "It’s the only place nearby covered by my insurance, and I’ve been going to this place every 6 months since I was an infant. This is the first time they’ve ever done this, and it looked like they didn’t even have glove boxes. They were probably prioritizing giving gloves to those testing for COVID... but still, goes to show how broke the US is...",
                                      "author": "tea-times",
                                      "created": 1595205874,
                                      "upvotes": 1,
                                      "replies": {
                                        "fym85zr": {
                                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym85zr/",
                                          "text": "The insurance is a problem but dentists need to be worried about more than just COVID. If they aren’t prioritizing protecting their patients from all diseases (especially blood borne illnesses) I wouldn’t go there. Of course they totally could have just gotten new gloves from a box outside the room and you didn’t notice. I don’t want to worry you but if they’re truly reusing gloves you should definitely say something because it puts your health and others at risk!! The US is definitely not handling this well and I hope your dentist actually does have enough gloves!",
                                          "author": "fizzysocks21",
                                          "created": 1595209493,
                                          "upvotes": 1,
                                          "replies": {
                                            "fymi4qt": {
                                              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymi4qt/",
                                              "text": "There was a plastic box where they used to have the actual glove boxes, and in it were  three pairs of gloves, all different colors, and I saw him take the gloves from that box and then put them back in the box when he was done. They smelt terrible...",
                                              "author": "tea-times",
                                              "created": 1595215842,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "fylun8z": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylun8z/",
              "text": "My college told students to take their own temperatures every morning lmao",
              "author": "Zerobeastly",
              "created": 1595201395,
              "upvotes": 8,
              "replies": {
                "fylzk0o": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylzk0o/",
                  "text": "My college (community college) is blocking off certain entrances and they’re going to screen us all as we come into the building.... don’t know how that’s going to play out, but okay.",
                  "author": "tea-times",
                  "created": 1595204295,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fykpeqe": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykpeqe/",
      "text": "You forgot \"all food will be take-away bag lunches, dining halls are closed\" OP.",
      "author": "SnowblindAlbino",
      "created": 1595179129,
      "upvotes": 51,
      "replies": {
        "fylkxvj": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylkxvj/",
          "text": "Ugh I wish. My school is probably going to stay doing buffet",
          "author": null,
          "created": 1595195987,
          "upvotes": 5,
          "replies": {
            "fym2zrb": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym2zrb/",
              "text": "Yikes! That seems like a Very Bad Idea. Even the state directional near us has declared they are removing all but one chair at each table in the dining hall and encouraging take-out.  Buffets aren't even *legal* in many states at this point.",
              "author": "SnowblindAlbino",
              "created": 1595206367,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "fynnahl": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynnahl/",
          "text": "In this case though... Does that mean they're giving every dorm a microwave? Because I know a lot of people that did not have microwaves in their dorms and food gets cold so hopefully there's a solution for that.",
          "author": "abnormallyme",
          "created": 1595251563,
          "upvotes": 2,
          "replies": {
            "fyntscu": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyntscu/",
              "text": "It may start *out* cold-- think bag lunches 3x a day.",
              "author": "SnowblindAlbino",
              "created": 1595255403,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fymaevh": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymaevh/",
          "text": "Yeah I did forget it. However, that's not so bad in my opinion compared to the other points i mentioned.",
          "author": "Hazelstat",
          "created": 1595210876,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fykozy3": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykozy3/",
      "text": "Can't even get to the country where I was supposed to do college. Probably gonna lose a year and shit tone of money.",
      "author": null,
      "created": 1595178910,
      "upvotes": 13,
      "replies": {}
    },
    "fykoruh": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykoruh/",
      "text": "I get the part about waiting for a response on your email. I've sent a bunch of emails to my professor about the course that I failed and still haven't gotten an answer. Also waiting until my college responses to email about my internship (its almost been 3 weeks)",
      "author": "High-_-Roller",
      "created": 1595178791,
      "upvotes": 6,
      "replies": {}
    },
    "fykofkb": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykofkb/",
      "text": "My university in the UK is doing well, from my perspective - my school (which is like a subsection of the university for my subject and a couple of others) cancelled all 1st and 2nd year exams and changed them to pass/fail so they wouldn't affect our grades. \n\nFor 3rd and 4th year students, they still kept the exams but you only received a grade if if raised your average - otherwise you could ignore it. \n\nIn terms of next semester, they're encouraging us to be on campus if possible, but if not they've said they'll accommodate all timezones. They had to cancel some courses but they're putting last year's material up so we can still teach ourselves if we want.",
      "author": "ambient-toast",
      "created": 1595178610,
      "upvotes": 18,
      "replies": {
        "fykze23": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykze23/",
          "text": "Edinburgh?",
          "author": null,
          "created": 1595184317,
          "upvotes": 5,
          "replies": {
            "fyl0wxa": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl0wxa/",
              "text": "Yes haha",
              "author": "ambient-toast",
              "created": 1595185109,
              "upvotes": 3,
              "replies": {
                "fyl1yk2": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl1yk2/",
                  "text": "pm me",
                  "author": null,
                  "created": 1595185659,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fyknk91": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyknk91/",
      "text": "I’m at a commuting campus so no dorms here. We’re going on campus in the fall but masks are required. They’re ending the semester after fall break (thanksgiving, people travel and expose themselves to others and all) and after that final exams are online. No idea how they will enforce social distancing on campus. Most likely all communal areas will be closed but they haven’t disclosed that. And I would bet big money (if I had it) that after the first month or so we will be back online to jolt us out of our routine yet again just like spring semester. It’s a good theory on paper but I feel a second outbreak and shit hitting the fan again. But hopefully they’re more prepared...",
      "author": "Fallen_Sheep",
      "created": 1595178146,
      "upvotes": 38,
      "replies": {
        "fym4aer": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym4aer/",
          "text": "[deleted]",
          "author": null,
          "created": 1595207155,
          "upvotes": 8,
          "replies": {
            "fym955o": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym955o/",
              "text": "Yeah I agreed with that one.",
              "author": "Fallen_Sheep",
              "created": 1595210085,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fymehd1": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymehd1/",
          "text": "This is exactly my school, until NOPE.. online only now😡absolutely utterly ridiculous. I mean basically an F U to all the people who took on leases.",
          "author": "offroad6901",
          "created": 1595213450,
          "upvotes": 3,
          "replies": {
            "fyns7ru": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyns7ru/",
              "text": "That’s some bullshit to the nine there. I’m sorry you have to deal with that. I hate online learning, for especially my major too I rely on my professors and hands on learning. I feel cheated with online classes. I hope you have luck in your semester though. I know how shit online can be, but unfortunately we just have to make the most of it in the best way we possibly can.",
              "author": "Fallen_Sheep",
              "created": 1595254529,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fyknikm": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyknikm/",
      "text": "Basically masks on whenever you are not in your room. I see civil disobedience on the horizon",
      "author": "Jefferson-not-jackso",
      "created": 1595178120,
      "upvotes": 23,
      "replies": {
        "fykzpon": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykzpon/",
          "text": "Yeah, I’m happy that my college is trying to give everyone their own rooms. I finally got a single room after 3+ years in college. I’m in a suite with one other girl. We have a small living space and share a bathroom, and have our own rooms.",
          "author": "Bmoresgoddess",
          "created": 1595184484,
          "upvotes": 9,
          "replies": {
            "fylg22d": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylg22d/",
              "text": "That is nice. I already have a single room with one other suite mate but that is a nice thing about being a senior. My school has a dorm reserved for covid cases only. It is an old dorm that never was refurbished. I bet that there will be folks that would hide the fact that they are sick, if they get sick at all.",
              "author": "Jefferson-not-jackso",
              "created": 1595193338,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "fykn1p5": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykn1p5/",
      "text": "I’m so fucking lucky to be graduating this summer.",
      "author": "wielderofFire1051",
      "created": 1595177868,
      "upvotes": 48,
      "replies": {
        "fyllox8": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyllox8/",
          "text": "[deleted]",
          "author": null,
          "created": 1595196393,
          "upvotes": 15,
          "replies": {
            "fylqfyr": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylqfyr/",
              "text": "Just 4 months ago, I was walking to and from university every day, going at that grind hard but enjoying it, going to the gym every other day, spending most of the day working in the library, spending lots of time with my then girlfriend. I had finally gotten to the point where I was truly living that college life. \n\nNow I’m stuck at home, just grinding to finish without having any fun and single. Coronavirus has robbed me of the last several months of the college lifestyle I only so briefly tasted.",
              "author": "wielderofFire1051",
              "created": 1595198985,
              "upvotes": 9,
              "replies": {}
            },
            "fyme9fg": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyme9fg/",
              "text": "Same 😢😭 RIP 2020",
              "author": "offroad6901",
              "created": 1595213309,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "fykqunt": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykqunt/",
          "text": "I was supposed to, then got depressed and covid-19 didn't help, and only took 2 classes in winter. FML.",
          "author": "Kalsifur",
          "created": 1595179884,
          "upvotes": 18,
          "replies": {
            "g1xgv4j": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/g1xgv4j/",
              "text": "SAMe IM SO MAD ABOUT IT BUT WHAT CAN YOU DO",
              "author": "A_A_A_A_AAA",
              "created": 1597709593,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fykmga3": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykmga3/",
      "text": "They switched to online last minute and nearly 40% of students dropped all their classes so they are scrambling to find a solution to a problem they can’t really fix. People just aren’t gonna go to school this semester myself included. Parents aren’t paying private school level fees for all online so my parents pulled the plug on me understandably so. I can only imagine how many others are in my shoes",
      "author": "ChefBoyarDingle",
      "created": 1595177555,
      "upvotes": 101,
      "replies": {
        "fylphti": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylphti/",
          "text": "My school announced fully online back in beginning of May. I’d say a good 75% of my non-fraternity friends have either dropped or transferred out. Shit sucks.",
          "author": "Cowguypig",
          "created": 1595198492,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "fykljhy": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykljhy/",
      "text": "My university here in Chile went 100% online, all classes via zoom, all in one platform called canvas. Pretty solid, boring but effective, we still pay the same amount of money but fuck it.",
      "author": "Fuba301",
      "created": 1595177063,
      "upvotes": 51,
      "replies": {
        "fyl0g9r": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl0g9r/",
          "text": "this is exactly what my school was like in the spring. i’m going back to campus, but all but 2 of my classes are online. the others are hybrid",
          "author": "carolineekelleyy",
          "created": 1595184869,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "fykk34k": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykk34k/",
      "text": "Do they expect you to... sleep with your mask on? 😅",
      "author": "RadioactiveBees",
      "created": 1595176284,
      "upvotes": 145,
      "replies": {
        "fykuj2e": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykuj2e/",
          "text": "For real. That’s dumb as fuck. People are honestly just gonna have to either accept the risk, or do it online imo.",
          "author": "Scorpia03",
          "created": 1595181783,
          "upvotes": 54,
          "replies": {}
        },
        "fylnikk": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylnikk/",
          "text": "And brush your teeth, and eat snacks, and drink coffee. . .",
          "author": "Violet_Plum_Tea",
          "created": 1595197401,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "fykj6nq": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykj6nq/",
      "text": "If this many people live in community with each other long-term, no restrictions the put on people will work. It'd be better to just quarantine us all on campus for two weeks, and then lift restrictions in common areas around the school and focus more on protecting professors from students than protecting us from ourselves. If I know my friends, they're breaking all those rules anyway, no matter how closely I follow them",
      "author": "nolan13ify",
      "created": 1595175794,
      "upvotes": 21,
      "replies": {
        "fykp81u": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykp81u/",
          "text": "I’ve never understood some of the schools that are testing all their students when they come back. Like ok that’s great but the second they leave campus to go to a bar or a restaurant or the movies they’re being exposed so what’s the point in testing them all anyways. It would have to be like a lockdown situation for it to even be beneficial past the 2 weeks class mark.",
          "author": "bamlaw",
          "created": 1595179030,
          "upvotes": 20,
          "replies": {
            "fykuok1": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykuok1/",
              "text": "For my college, everyone is tested upon arrival, but we also have randomized testing every two weeks, and students aren’t allowed to leave the campus and  surrounding town (5k people in town, 1.6k students) unless it’s an emergency, until the end of the semester.",
              "author": null,
              "created": 1595181862,
              "upvotes": 7,
              "replies": {
                "fykuwgm": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykuwgm/",
                  "text": "My school is small as well in a small town but how are they enforcing you not leaving? I mean are there like police at exits? Seems good in theory but most college people don’t take well at being cooped up and told what to do.",
                  "author": "bamlaw",
                  "created": 1595181975,
                  "upvotes": 7,
                  "replies": {
                    "fykvof3": {
                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykvof3/",
                      "text": "I doubt they’ll be enforcement, but if caught we could get punished and I doubt students will want to deal with that",
                      "author": null,
                      "created": 1595182385,
                      "upvotes": 3,
                      "replies": {
                        "fyly95o": {
                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyly95o/",
                          "text": "Ban Uber and Lyft from picking people up and dropping them off? Also, they could require your car keys to be locked in a box and if you need them you can unlock it whenever but the school gets notified that you left campus. If you bring a second set of keys and use them to prevent your school from finding out if you left campus or not they could kick you out.",
                          "author": "turd_farts",
                          "created": 1595203520,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fyl7aj4": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl7aj4/",
              "text": "It would be cool if a college rented out a cruise ship and made sure everyone was clear first for 2 weeks then lifted all the restrictions for the semester. That way there's no risk of outside contamination",
              "author": null,
              "created": 1595188538,
              "upvotes": 3,
              "replies": {
                "fyl7uf7": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl7uf7/",
                  "text": "Very cool idea but my school is so cheap they don’t salt the roads when it snows lmao. Now maybe like a Harvard or a Yale that get billions in endowment 🤔",
                  "author": "bamlaw",
                  "created": 1595188842,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fykig1u": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykig1u/",
      "text": "Mine doesn't have much of a party life anyway but they are keeping classes really small. My one class has 3 people in it.",
      "author": "randomfandoms2001",
      "created": 1595175395,
      "upvotes": 12,
      "replies": {}
    },
    "fyki7k8": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyki7k8/",
      "text": "My college is continuing to have online work while letting those who have labs go to school.",
      "author": "Kingmir1",
      "created": 1595175267,
      "upvotes": 15,
      "replies": {}
    },
    "fykgefo": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykgefo/",
      "text": "This is stupid. Colleges should be focused on protecting older professors and staff who work there, as well as students with secondary conditions. Healthy students aren’t in danger from covid.",
      "author": "McChickenFingers",
      "created": 1595174276,
      "upvotes": -17,
      "replies": {
        "fyklpnv": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyklpnv/",
          "text": "You protect the vulnerable by protecting everyone. You really think if all the young healthy kids get sick the outbreak won’t spread to anyone else? Not to mention there may or may not be lasting long term effects on people that get the virus",
          "author": "BylvieBalvez",
          "created": 1595177155,
          "upvotes": 17,
          "replies": {
            "fyksu92": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyksu92/",
              "text": "Again, that’s why we protect the vulnerable. Look, a lot of people will get this no matter what we do. I’d rather it be me and my friends in college than my parents and grandparents.",
              "author": "McChickenFingers",
              "created": 1595180928,
              "upvotes": -1,
              "replies": {}
            }
          }
        },
        "fykoi3d": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykoi3d/",
          "text": "If a healthy student gets it they will spread it to vulnerable populations, so its not ok if a healthy student gets it",
          "author": "Gallinaz",
          "created": 1595178648,
          "upvotes": 8,
          "replies": {
            "fyks9r9": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyks9r9/",
              "text": "It isn’t okay, but it is also not something we should be worried about if we protect the vulnerable.",
              "author": "McChickenFingers",
              "created": 1595180633,
              "upvotes": -4,
              "replies": {}
            }
          }
        },
        "fykmta0": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykmta0/",
          "text": "Thats a common misconception, young have been just as impacted",
          "author": "Cminor141",
          "created": 1595177743,
          "upvotes": 14,
          "replies": {
            "fyks7gt": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyks7gt/",
              "text": "Young people are getting it, yes, but they aren’t dying from it.",
              "author": "McChickenFingers",
              "created": 1595180600,
              "upvotes": 2,
              "replies": {
                "fyl62vp": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl62vp/",
                  "text": "They actually are. A baby got it and died, and many 20-somethings are getting it and dying. Now, assuming you have a half decent immune system you can probably recover, but they ARE able to die from it",
                  "author": "Cminor141",
                  "created": 1595187872,
                  "upvotes": 1,
                  "replies": {
                    "fynhseu": {
                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynhseu/",
                      "text": "Yes, they are able to die from it. Less deadly =/= not deadly at all. The flu kills kids every year. But the number of kids dying from this, while tragically not zero, is extremely small. A vast majority of cases in young people are asymptomatic, which is why the actual morality rate for this thing is so dam hard to pin down.",
                      "author": "McChickenFingers",
                      "created": 1595247697,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fyllqhe": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyllqhe/",
              "text": "Lol what? In my state people over 70 make up 56.78% of deaths and 25.32% of hospitalizations despite only making up 6.87% of cases.",
              "author": "xxplantjaysonxx",
              "created": 1595196416,
              "upvotes": 1,
              "replies": {
                "fylqevf": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylqevf/",
                  "text": "You said: They’re not dying from it at all. Hell, even your OWN stat proves thats not true. If 56.8%of people who die are 70 and older, then by basic deductive reasoning, there have to be SOME  young people who make up that remainder. It’s pretty basic stats",
                  "author": "Cminor141",
                  "created": 1595198969,
                  "upvotes": 1,
                  "replies": {
                    "fylqpgh": {
                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylqpgh/",
                      "text": "No I didn't say that you are thinking of the other guy who commented. \n\n\nAnd you are exactly right but \"some\" is not the same as \"just as impacted\" like you said.",
                      "author": "xxplantjaysonxx",
                      "created": 1595199137,
                      "upvotes": 1,
                      "replies": {
                        "fylrfel": {
                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylrfel/",
                          "text": "Oh I apologize! I thought I was sending that to that dude lol. Idk man, seeing as we’re making up 20% of COVID deaths, I’m not about to downplay it even if we’re pretty likely to recover.",
                          "author": "Cminor141",
                          "created": 1595199547,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fykr3jc": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykr3jc/",
          "text": "That's not true at all, you have been misinformed.",
          "author": "Kalsifur",
          "created": 1595180014,
          "upvotes": 3,
          "replies": {
            "fyksqfx": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyksqfx/",
              "text": "How so? If you are under 25, you are more likely to die from the flu than from coronavirus. You all seem to misconstrue my comment and assume I’m advocating for going back to normal; that isn’t an option. But the science suggests it will be more effective to accommodate vulnerable populations instead of disrupt the entire population.",
              "author": "McChickenFingers",
              "created": 1595180874,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fykhhpe": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykhhpe/",
          "text": "[deleted]",
          "author": null,
          "created": 1595174876,
          "upvotes": 7,
          "replies": {
            "fyks0yq": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyks0yq/",
              "text": "If anything, healthy students are the rats of this plague. They will be the ones unknowingly bringing it in and not wearing masks because they want to get it to have immunity.",
              "author": "tea-times",
              "created": 1595180505,
              "upvotes": 2,
              "replies": {
                "fykskg7": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykskg7/",
                  "text": "Yes; and the idea should be to spread it to other rats instead of to vulnerable populations.",
                  "author": "McChickenFingers",
                  "created": 1595180787,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fyksh4l": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyksh4l/",
              "text": "Nor is there any way to know. From what we know right now, the flu is deadlier than covid for people under 25. And operating under that, there is absolutely no reason to treat college students the same way we should treat college professors and staff when it comes to working to minimize coronavirus impact.",
              "author": "McChickenFingers",
              "created": 1595180740,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "fykfkka": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykfkka/",
      "text": "Mine is making everyone wear masks in all common spaces (classroom, bathroom, hallways, etc.) and making us seat 6 feet apart. No idea how they’ll do that though as they didn’t decrease class sizes and there’s no room. There’s also supposed to be 15 feet between the prof and the students (also not gonna happen). They also said they’d evacuate the entire building if someone with COVID was inside or someone with symptoms reports them. No way that’ll happen evacuating 2k kids and finding alternative learning spaces. I see us going back online anyways it’ll spread but 🤷🏼‍♂️",
      "author": "bamlaw",
      "created": 1595173820,
      "upvotes": 118,
      "replies": {
        "fymk2o6": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymk2o6/",
          "text": "How will you brush your teeth or shower w a mask\n?",
          "author": "Im_Mehed",
          "created": 1595217157,
          "upvotes": 1,
          "replies": {
            "fynwt0u": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynwt0u/",
              "text": "Obviously they'll take it off when they're doing that. People aren't starving at restaurants because of mask mandate either.",
              "author": "SadAdhesiveness6",
              "created": 1595257039,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fykf307": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykf307/",
      "text": "By lying to us saying we were having hybrid online/in person classes but right when everyone signed their leases, they decided to make 95% of classes online!",
      "author": "pennypupper",
      "created": 1595173556,
      "upvotes": 426,
      "replies": {
        "fykg1x4": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykg1x4/",
          "text": "Bingo. Not to mention they justify charging 100% of student fees (nearly $5k) because “classes are in person”! Yeah... *at most* 1 in 10 classes are in person...",
          "author": "blink1-8-2",
          "created": 1595174084,
          "upvotes": 155,
          "replies": {}
        },
        "fyl037r": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl037r/",
          "text": "my school said that 75% of all classes would be hybrid. 6 out of my 7 are online.",
          "author": "carolineekelleyy",
          "created": 1595184678,
          "upvotes": 54,
          "replies": {
            "fylbc6n": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylbc6n/",
              "text": "I truly think the week before the semester starts, most colleges are going to announce 100% online. They’re just playing a game with us. They already knew we were going to have to be mostly online but they just once their money so have to wait until majority of people are fully committed to announce it all",
              "author": "pennypupper",
              "created": 1595190763,
              "upvotes": 33,
              "replies": {
                "fym8nfg": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym8nfg/",
                  "text": "Which is why I’m not paying a dime that’s not necessary until I’m there. I’m not getting scammed for private school tuition again that’s online. I’d sooner take a gap semester",
                  "author": "amazinggrace725",
                  "created": 1595209787,
                  "upvotes": 3,
                  "replies": {
                    "fyub1x1": {
                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyub1x1/",
                      "text": "I just wanted to say that your major(s) sound(s) amazing!! Can you tell me more about it?",
                      "author": null,
                      "created": 1595392359,
                      "upvotes": 1,
                      "replies": {
                        "fyue2m4": {
                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyue2m4/",
                          "text": "Sure! So Public Health and International Affairs are my two separate majors. Public Health is basically studying healthcare and how healthy the public is in the general. Access to medical care, preventing diabetes, and educating the public are all areas of public health. International Affairs is the study of how different countries work together in many different aspects such as politically, socially, and economically. My ultimate goal in double majoring in these two subjects is to become an epidemiologist, which is someone who studies the spread of diseases. Specifically, I’d like to look at how diseases spread between countries around the world and the policies that we have to prevent that and help fill in the gaps.",
                          "author": "amazinggrace725",
                          "created": 1595394630,
                          "upvotes": 1,
                          "replies": {
                            "fyue9p9": {
                              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyue9p9/",
                              "text": "that's really awesome :)\nI'm currently majoring in Global Public Health at my college (starting in the fall) and considered double majoring in IR since both majors are major only\n(no equivalent minor), but I might do public policy instead. Happy to hear that things are going well, and that you have such a ocol plan for college!! Out of curiosity, are you also INFJ?",
                              "author": null,
                              "created": 1595394787,
                              "upvotes": 1,
                              "replies": {
                                "fyvnfi2": {
                                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyvnfi2/",
                                  "text": "No I’m an INTP. Good luck starting college in the fall! If you’re not uncomfortable sharing, where are you going to school?",
                                  "author": "amazinggrace725",
                                  "created": 1595430720,
                                  "upvotes": 1,
                                  "replies": {
                                    "g04mvzj": {
                                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/g04mvzj/",
                                      "text": "i'll be going to school in nyc!",
                                      "author": null,
                                      "created": 1596393448,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "fymdut3": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fymdut3/",
              "text": "I know it's no consolation, and we are all currently at each college's mercy, but our school said we were doing in person as of 9 days ago and then decided to announce that they would be changing to mostly online (besides internship, clinicals, art, etc.). It's unfortunate that our colleges run like the Russian ГУЛАГ.",
              "author": "offroad6901",
              "created": 1595213051,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fyl2byg": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl2byg/",
          "text": "Yep that’s how mine is! I have one class in person that will only be once a week bc my prof is splitting up classes. So less than 20 students in a big lecture hall. I wouldn’t be surprised if even that moved to 100% online",
          "author": "tigerpioneer",
          "created": 1595185853,
          "upvotes": 10,
          "replies": {}
        },
        "fyl5ozv": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl5ozv/",
          "text": "The college I'm attending did the same thing. Said they would let the students pick which learning format they wanted for their classes. Then sent out an email saying \"surprise go check your schedule, all the professors have decided how they'll be teaching class and you no longer get a say!\" Conflicted as to how I'll teach myself Italian online",
          "author": "MyNeverland27",
          "created": 1595187660,
          "upvotes": 6,
          "replies": {}
        },
        "fyl5sw1": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl5sw1/",
          "text": "My school did this exact thing. Some people even got outright removed from classes.",
          "author": "Zelow202",
          "created": 1595187721,
          "upvotes": 2,
          "replies": {}
        },
        "fylqvho": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylqvho/",
          "text": "Same here. All except for one of my classes are online. And that class is a lab for calculus that only meets for 50 minutes on Wednesdays",
          "author": "microfsxpilot",
          "created": 1595199234,
          "upvotes": 1,
          "replies": {}
        },
        "fyn0u2q": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyn0u2q/",
          "text": "Sounds like you go to my uni...",
          "author": "itsjosh18",
          "created": 1595231180,
          "upvotes": 1,
          "replies": {}
        },
        "fyngfyk": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyngfyk/",
          "text": "My university is almost certainly doing this. There was supposed to be a big town hall talking about the semester last week, but after the huge spike in cases and orders to shut everything down again here, they pushed it a week... to the day after tuition is due. Nothing shady going on there!",
          "author": "NeoNoireWerewolf",
          "created": 1595246615,
          "upvotes": 1,
          "replies": {}
        },
        "fynl6mo": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynl6mo/",
          "text": "I had a class that was listed as my only class remaining in person. I found out that this was actually still a zoom call. You can either stay in the dorm and join the call, or go to a room in our building (with small occupancy limits) and watch the zoom call with a couple other people. It's a total scam.",
          "author": "deja_blues",
          "created": 1595250166,
          "upvotes": 1,
          "replies": {}
        },
        "fym89f1": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym89f1/",
          "text": "The fact that everyone commenting to this goes to different universities shows how common this response was... a total dick move that most universities saw coming. I'm jealous of those colleges that decided in June to do mostly online and were transparent for it and tried their best to prepare for better fall instruction that way.",
          "author": "conceptalbums",
          "created": 1595209552,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fykelzo": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykelzo/",
      "text": "Um...... Your school is doing to much. Masks......in your room......",
      "author": null,
      "created": 1595173305,
      "upvotes": 53,
      "replies": {
        "fykfn2a": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykfn2a/",
          "text": "Yea I don't even know anymore. There's no mention of a refund policy as I don't think they're even considering sending us back at all.",
          "author": "Hazelstat",
          "created": 1595173857,
          "upvotes": 22,
          "replies": {}
        }
      }
    },
    "fykbx7n": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykbx7n/",
      "text": "[deleted]",
      "author": null,
      "created": 1595171817,
      "upvotes": 235,
      "replies": {
        "fykjav1": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykjav1/",
          "text": "Mine's doing the opposite.  No information whatsoever.  The school's homepage hasn't been updated since mid March. No emails or letters at all.\n\nI knew my final semester was going to be online regardless, but I was still active in clubs.  On of my professors wanted me to be our club's president and I had to tell her no because the school isn't communicating with us and I don't feel comfortable going to campus unnecessarily.  So far, there are no mask requirements or changes in class sizes.",
          "author": "Inactive_Account",
          "created": 1595175857,
          "upvotes": 115,
          "replies": {
            "fykrp97": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykrp97/",
              "text": "LOL I had no idea what cryptozoology was and I was like \"Wow, this person must be studying something really cool, I wonder what it means\".",
              "author": "Giant_Anteaters",
              "created": 1595180334,
              "upvotes": 26,
              "replies": {
                "fyksn10": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyksn10/",
                  "text": "Assuming you googled it, just know that it's a joke.  If that degree actually exists, I'm pretty sure that the only job I could do with it would be answering questions as a \"bigfoot expert\" on the History Channel.",
                  "author": "Inactive_Account",
                  "created": 1595180824,
                  "upvotes": 23,
                  "replies": {
                    "fyktkqi": {
                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyktkqi/",
                      "text": "Really? I think your degree would also give you the necessary qualifications to get into the White House!",
                      "author": "Giant_Anteaters",
                      "created": 1595181306,
                      "upvotes": 22,
                      "replies": {
                        "fylbm5m": {
                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylbm5m/",
                          "text": "I don't know about that... It's an imaginary science, so would my input be disregarded like real science? Or would it be taken more seriously?",
                          "author": "Inactive_Account",
                          "created": 1595190918,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fykbg0k": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykbg0k/",
      "text": "One thing my university has done is to put up live chats on their websites for financial aid and registrar and others, and there's usually someone available to talk. Financial aid emails are a week or two behind but they have staff doing their regular drop ins via chat. Everything else sounds the same except masks in rooms??? That would suck and seems like something the RAs won't enforce so it's probably what the university is saying to avoid blame when the inevitable happens.",
      "author": "mssmish",
      "created": 1595171543,
      "upvotes": 54,
      "replies": {
        "fykfroi": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykfroi/",
          "text": "Yeah, impossible to enforce tbh.",
          "author": "Hazelstat",
          "created": 1595173928,
          "upvotes": 13,
          "replies": {}
        },
        "fyl7e1v": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl7e1v/",
          "text": "My school is using cranium cafe and it’s the worst. There’s no ticket system so you must have to hope you’re staring at the chat button when they finally come online. Damn near impossible to reach anyone.",
          "author": "introvertedbassist",
          "created": 1595188592,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fykaprl": {
      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykaprl/",
      "text": "Lol how are they going to enforce the masks in dorm rooms?",
      "author": "casual-reddit-man-",
      "created": 1595171123,
      "upvotes": 653,
      "replies": {
        "fykasgi": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykasgi/",
          "text": "¯\\_(ツ)_/¯",
          "author": "Hazelstat",
          "created": 1595171168,
          "upvotes": 235,
          "replies": {
            "fykqktt": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykqktt/",
              "text": "Man, that's rough and so stupid. Are you sure you are interpreting that correctly? They can't possibly expect you to wear a mask while sleeping!!!!!!! What the actual f.",
              "author": "Kalsifur",
              "created": 1595179742,
              "upvotes": 161,
              "replies": {
                "fyl6ecv": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl6ecv/",
                  "text": "It sounds like a liability minded policy. If a student gets sick from their roommate in the dorms, they can just say “well how did you get sick if you were wearing a mask?” to try to limit their own liability.",
                  "author": "zeph_yr",
                  "created": 1595188045,
                  "upvotes": 88,
                  "replies": {
                    "fym41di": {
                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fym41di/",
                      "text": "That's pretty much the mindset of all these policies when dealing with a generally unaffected population that college students make up. I wouldn't be surprised to see many of these policies ignored by students and administrations ignoring the reality as long as they aren't held responsible.",
                      "author": "OkSpeaker0",
                      "created": 1595207001,
                      "upvotes": 13,
                      "replies": {}
                    }
                  }
                },
                "fyl5uy8": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl5uy8/",
                  "text": "I cannot physically facepalm any harder.",
                  "author": "_34_",
                  "created": 1595187751,
                  "upvotes": 34,
                  "replies": {}
                },
                "fyma7h2": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyma7h2/",
                  "text": "One of my friends is an RA and in a video call, it was mentioned that roommates will have to wear masks but didn't go into detail whether this would be enforced. Would be hard to even if they did enforce it though.",
                  "author": "Hazelstat",
                  "created": 1595210749,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "fykq24x": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykq24x/",
          "text": "they can’t. they can’t enforce a lot of the rules that they’re putting in place. i’m not saying that these rules aren’t warranted or shouldn’t be followed, just that they inevitably won’t be followed which will likely lead to an outbreak.",
          "author": "pastelxbones",
          "created": 1595179475,
          "upvotes": 88,
          "replies": {
            "fykqotn": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykqotn/",
              "text": "I'm not really sure how a rule saying to wear a mask in a small room where you sleep is reasonable lol.",
              "author": "Kalsifur",
              "created": 1595179800,
              "upvotes": 62,
              "replies": {
                "fykxchc": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykxchc/",
                  "text": "it’s not exactly reasonable to put hundreds/thousands of people together on a college campus in the middle of a pandemic either",
                  "author": "pastelxbones",
                  "created": 1595183253,
                  "upvotes": 43,
                  "replies": {
                    "fyl5s17": {
                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyl5s17/",
                      "text": "Sounds pretty reasonable to me as long as some ground rules are placed. Can't just shut down everything until it's completely gone.",
                      "author": "Gamerred101",
                      "created": 1595187707,
                      "upvotes": -5,
                      "replies": {
                        "fylatkp": {
                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylatkp/",
                          "text": "Hence online classes.",
                          "author": "inkdrops",
                          "created": 1595190477,
                          "upvotes": 11,
                          "replies": {
                            "fylf2u1": {
                              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylf2u1/",
                              "text": "Online classes are ass and a poor substitute for real classes",
                              "author": "Gamerred101",
                              "created": 1595192803,
                              "upvotes": 10,
                              "replies": {
                                "fylmik9": {
                                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylmik9/",
                                  "text": "Maybe so, but it’s a health and safety issue",
                                  "author": "SquareEarthSociety",
                                  "created": 1595196847,
                                  "upvotes": 6,
                                  "replies": {
                                    "fyluq74": {
                                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyluq74/",
                                      "text": "Don't go to in person college classes if it's something you're personally worried about getting would be my solution, let the millions who don't care go",
                                      "author": "Gamerred101",
                                      "created": 1595201442,
                                      "upvotes": 1,
                                      "replies": {
                                        "fynct5n": {
                                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynct5n/",
                                          "text": "What about professors and staff who don’t have another option without being fired?",
                                          "author": "dogfanatic24",
                                          "created": 1595243453,
                                          "upvotes": 2,
                                          "replies": {}
                                        },
                                        "fyn4ekn": {
                                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyn4ekn/",
                                          "text": "Shh, you aren't allowed to have thoughts that go against the hive mind.",
                                          "author": null,
                                          "created": 1595234856,
                                          "upvotes": 2,
                                          "replies": {
                                            "fyn5p60": {
                                              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyn5p60/",
                                              "text": ";)",
                                              "author": "Blackdragonworship",
                                              "created": 1595236231,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        },
                                        "fynwatz": {
                                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynwatz/",
                                          "text": "That would be great if the virus isn't spread by people, but that is not the case.",
                                          "author": "SadAdhesiveness6",
                                          "created": 1595256773,
                                          "upvotes": 0,
                                          "replies": {
                                            "fyoagyr": {
                                              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyoagyr/",
                                              "text": "It's great either way",
                                              "author": "Gamerred101",
                                              "created": 1595263915,
                                              "upvotes": 0,
                                              "replies": {
                                                "fypa7hh": {
                                                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fypa7hh/",
                                                  "text": "Asshole",
                                                  "author": "SadAdhesiveness6",
                                                  "created": 1595281307,
                                                  "upvotes": 0,
                                                  "replies": {
                                                    "fypads6": {
                                                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fypads6/",
                                                      "text": "Can't shut down everything just because people are scared",
                                                      "author": "Gamerred101",
                                                      "created": 1595281394,
                                                      "upvotes": 0,
                                                      "replies": {
                                                        "fypbrsr": {
                                                          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fypbrsr/",
                                                          "text": "How could you be so callous to disregard the tens of thousands that have died and the hundreds of thousands that will suffer unknown health consequences as a result of this virus? Europe and many other places have crushed the curve, and now things are returning to some semblance of normalcy. They did that by not rushing to open while the virus was still raging on. \n\nGoing to classes in person is by no means essential when an alternative, while not perfect, exists. Yes, I agree it sucks. But it’s a small sacrifice to make to protect the lives of others, much like how you and I don’t smoke indoors or drive at 150 mph. \n\nOf course, all of this isn’t likely to convince you. But it’s worth a shot.",
                                                          "author": "SadAdhesiveness6",
                                                          "created": 1595282075,
                                                          "upvotes": 0,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fykvr62": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykvr62/",
                  "text": "I wonder if they want you to wear it while sleeping too...",
                  "author": "ctrldwrdns",
                  "created": 1595182425,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fylnrgs": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fylnrgs/",
          "text": "[deleted]",
          "author": null,
          "created": 1595197540,
          "upvotes": 17,
          "replies": {
            "fyn0sg9": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fyn0sg9/",
              "text": "Got strep from my roommate last year...funny enough the same week I was talking to a girl. That was a long 72 hours",
              "author": "itsjosh18",
              "created": 1595231133,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fykmy82": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykmy82/",
          "text": "Dude I don’t have an issue wearing a mask in public but I’m not about to start wearing one in the isolation and privacy of my living space. You have any idea how much it fogs my glasses and gives you bad breath and lip sweat? It’s grows and discomforting and I’m not going to basically live inside one.",
          "author": "wielderofFire1051",
          "created": 1595177816,
          "upvotes": 92,
          "replies": {
            "fykogla": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykogla/",
              "text": "how does a mask give you bad breath?  \n\n\nyou're just smelling your already-bad breath, lol",
              "author": "OGInkbot",
              "created": 1595178626,
              "upvotes": 74,
              "replies": {
                "fykol1u": {
                  "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykol1u/",
                  "text": "It stops the air from your mouth from dispersing into the environment, and it just creates this warm, moist insulation around your oral cavity.",
                  "author": "wielderofFire1051",
                  "created": 1595178691,
                  "upvotes": 20,
                  "replies": {
                    "fynwkms": {
                      "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fynwkms/",
                      "text": "[That's not how masks or biology works.](https://www.scmp.com/yp/discover/lifestyle/health-fitness/article/3086125/why-do-i-have-bad-breath-when-i-wear-face-mask)",
                      "author": "SadAdhesiveness6",
                      "created": 1595256916,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fykpopq": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykpopq/",
              "text": "I don't mind wearing a mask on the dorm floor or in the residence hall, but in my own dorm room would be a bit of a stretch to me. To be fair though, I always try to get a room entirely to myself. The extra money has always been worth not putting part of my own safety in the hands of another person.",
              "author": null,
              "created": 1595179276,
              "upvotes": 33,
              "replies": {}
            }
          }
        },
        "fykr1k6": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykr1k6/",
          "text": "I don’t even understand how they came to this rule.... are we supposed to wear masks in our family homes? Are you supposed to wear them in your sleep where you have absolutely no control over how many droplets you let in the air? Honestly sleeping around other people is probably worse than going into the store without mask... you snore, you drool, you might cough, you might yawn, you probably wipe your nose without care whether or not you’re spreading mucus everywhere...\n\nEvidently your faculty needs to go back to school if they don’t even understand that you’re still touching the same surfaces and breathing the same air for extended periods of time.",
          "author": "tea-times",
          "created": 1595179985,
          "upvotes": 26,
          "replies": {}
        },
        "fykjxkk": {
          "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykjxkk/",
          "text": "Basically peer pressure",
          "author": "StardustNyako",
          "created": 1595176200,
          "upvotes": -3,
          "replies": {
            "fykk2rc": {
              "link": "/r/college/comments/hu1qwr/how_are_your_colleges_tackling_covid19/fykk2rc/",
              "text": "Peer pressure will lean in the opposite direction.",
              "author": "Wizard_Nose",
              "created": 1595176278,
              "upvotes": 42,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634052357
}