{"sid": "acr2jj", "link": "/r/college/comments/acr2jj/i_have_lost_my_personality/", "title:": "I have lost my personality", "text": "I am a Computer Science major. I met with some of my classmates from high school recently and found it incredible how I've completely lost my \"flow\" with them. In high school, we had very similar personalities and were able to joke around with each other easily. However, this time it didn't feel like I was the same person. I thought high school Me was going to magically come back out again, but this time I acted just like college Me - Socially awkward, no sense of humor, difficulty paying attention to what was happening, constantly thinking about schoolwork, etc. It's like college has killed the old me and replaced it with an automaton who only exists to study for exams, work through assignments, etc. \n\nI miss the old me. I feel like college has ruined who I am by isolating me from other people for so long. I thought the reason I was so serious all the time was because college is just a serious place and as soon as I was out I would be normal again. It's starting to piss me off because I don't want to just be a robot for the rest of my life. I feel like I'm no longer a real person. I don't know how to recover the old version of me or if it's even possible. Is there anything I can do to have a personality again?", "author": "awesomega14", "created": 1546665206, "retrieved": 1632947871, "over_18": false, "upvotes": 732, "upvote_ratio": 0.98, "comments": {"edc8icq": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edc8icq/", "text": "You might just be maturing down a different path. After a few years of college I returned home to find out that my personality just doesn’t match up with my bestfriends like it used to. At first I thought it was my fault and then I realized that we just didn’t share the same mindset anymore. My best advice is to look for people within your major that have similar personalities to you", "author": "apginge", "created": 1546732332, "upvotes": 1}, "edbvvs7": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edbvvs7/", "text": ">I feel like college has ruined who I am by isolating me from other people for so long. \n\nWhaaat? College didn't isolate you.\n\n**YOU isolated you.**\n\nA lot of your talk ITT is passive and helpless.  \"I can't help it.\"  \"This is the situation, there's no changing it.\"  \"This thing happened TO me.\"\n\nI'm gonna jump on the wagon with everyone else to tell you to seek help.  [THERAPY!](https://imgur.com/a/Dj46t4B)\n\nYou need to grab control and start directing your life, or it's just going to get worse.  SEEK HELP.", "author": "cardinal29", "created": 1546723927, "upvotes": 0}, "edbs5pj": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edbs5pj/", "text": "There’s a natural progression as you mature. Did it occur to you they may not have grown up? ", "author": "FreshPepper88", "created": 1546721424, "upvotes": 1}, "edbr3f2": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edbr3f2/", "text": "Same problem here with mechanical engineering major. I think part of the problem is because most classmates i encountered are serious and not as going as high school ", "author": "gilgamesh_99", "created": 1546720771, "upvotes": 1}, "edbqhqt": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edbqhqt/", "text": "I was talking to an old high school friend who I keep in touch with about something similar. I said how it would disappoint me if I were to run into some old high school chum I haven’t seen in a while and have him say that I haven’t changed. I’d think, really? I don’t seem smoother, effortlessly charming and full of humor, maybe even a little more playful and rakish? You’re saying I’m no wittier than I was in high school?\n\nAnyway, I catch your disappointment. It happens. It’s happened to me. If I were you, I wouldn’t worry about it too much. You’re busy trying to get your shit together like responsible people do. Plus you’re evolving. You’re in this sort of pupa developmental stage where your interactions can be a little awkward. Maybe you’re ahead of your old friends in this regard. \n\nIt’ll pass. Just tough it out a little longer and don’t stray too far from your path...unless it’s the wrong one ;)", "author": "pacg", "created": 1546720399, "upvotes": 1}, "edbirh0": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edbirh0/", "text": "Why did you go into computer science to begin with? Maybe the why you went to college can help bring out the who. Finding your reason for your actions in life can be eye opening. Sometimes self reflection can really make a difference.", "author": "Cheizes", "created": 1546715299, "upvotes": 0}, "edbipa6": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edbipa6/", "text": "It could be that you’re evolving past what you used to enjoy or used to find funny. I moved off to Guam when I was in the Navy and found I really had nothing in common with my old friends when I moved back 6 years later. Now that I’m in college and they are all mothers, I have even less in common with them.\n\nI saw you posted that you don’t have much spare time, but I highly recommend getting into podcasts and standup comedy. It has helped me rediscover what I find to be funny and be able to relate to other people, even if they aren’t there with you. It also gives me talking points when I’m with other people. A good podcast can make for excellent background noise while studying if you can tolerate stuff like that without getting distracted.\n\nBest of luck to you! It’s also okay just to be a cynical asshole if that’s how you feel. Some of the best people are like that. It makes Bill Burr one of my favorite people!", "author": null, "created": 1546715259, "upvotes": 1}, "edbfyi2": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edbfyi2/", "text": "I feel very similar except ive also lost the will to live", "author": "destructor_rph", "created": 1546713469, "upvotes": 1}, "edb6lvp": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edb6lvp/", "text": "tell me about it. i left california for college wearing flipflops and board shorts and came back in sperries and button downs oops", "author": "beepybeetle", "created": 1546707589, "upvotes": 2}, "edb5qmm": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edb5qmm/", "text": "I don’t have any advice but just wanted to say that this is *exactly* how I feel ", "author": "bcgroom", "created": 1546707049, "upvotes": 1}, "edb43xo": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edb43xo/", "text": "What if you're just not likable to the particular small group of people you're now usually around even though there's nothing wrong with you? Grin and bear it and just relax and let yourself be yourself.\n\n I can't get along with most people in my home country - I choose to not drink myself into a coma and choose education and work to have a better life. I get along fine with people who have similar interests to mine wherever they're from.\n\nI also can't get along with most people in the country where I currently study - I'm clearly not local and don't speak the local accent, don't go out to drink and slut around, don't smoke pot and actually study and work and have a family. I get along fine with anyone from anywhere who doesn't have their head up their ass and is open to anyone who has similar priorities to mine.\n\nAm I a bad person to be around? Fuck no. Was I at times surrounded by shit people? Quite often, yes lol", "author": "vechedubov", "created": 1546706021, "upvotes": 1}, "edb2d9m": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edb2d9m/", "text": "It could be that over time both of your personalities have changed. I find this is very common as people have new life experiences. I’m very lucky to have a few good friends from high school still but I live with one (same college), one I’ve known since I was 7 and we work at the long distance thing, and the others go to different but local schools. I’m still very close with these people but our relationships have definitely changed over time. That being said it sounds like you are struggling with college. Not necessarily the grade aspect but certainly from a stress management and social perspective. Try not to beat yourself up college is hard. I graduated cum ladue in high school came to college to find I had no friends, recently divorced parents, a major I hated and was doing badly in, too many credits (19 &18 yr 1) and failed a course.  College can be bumpy, but hang on to it and pick yourself up. I believe in you! College isn’t easy for me and I don’t think it ever will be, but I’m back on my feet and it’s manageable. The things I found the most helpful were:\n1. Getting a therapist \n2. I suck at making friends so going on trips with our outdoor resource center where I would be forced to be with strangers for extended periods\n3. On a similar note I went to Australia with ISV (international student volunteers) and studied abroad in Italy with a group of students from the art department at my school (I’m a marketing and arts management major with art and art history minors)\n4.Scheduling my own classes (this sounds dumb but my uni tries to tell us what to take when and schedules for you freshman year... this royally fucked me over)\n5. Again since I suck at making friends taking courses like SCUBA that are fun and not a ton of extra work can be a way to raise GPA and meet people with similar interests\n", "author": "dancingbigfoot", "created": 1546704870, "upvotes": 1}, "edb1e44": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edb1e44/", "text": "Is there anything I can do to have a personality again?\n\n&#x200B;\n\nUnfortunately you are stuck this way and have become who you are. There is no way back- tried everything, doesnt work.", "author": "RandomStudentHere", "created": 1546704213, "upvotes": 2}, "edayyuc": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edayyuc/", "text": "First of all, I know you’ve already gotten a lot of support from the sub already, but I have some things to say because I’m in the same boat (or at least was this time last year.)\n\nLife is tough out there for us CS majors, and the significant change in lifestyle from HS can have a lot of people feeling like you do. I’ll share a bit about my own experiences too; hopefully, they’ll help you out a bit.\n\nMy parents are both incredibly talented and successful in software, and I kinda grew up in the culture of being extremely analytical and calculating, but to me that was more messing around than anything else (things like trying to hack League of Legends so I could DDoS people in game - shitty, I know, but entertaining to do when you have nothing better to do.) It never really manifested to me as doing work until college, and once it did, I felt really out of touch with my HS friends - they were all too concerned with smoking weed and playing video games like we did in HS, and my life was different. Eventually, I started hanging out with them less and less, and now I see them at the library maybe once a month (doesn’t have to be that way for you, necessarily, but it was for me.)\n\nWhat I eventually did was make new friends in CS who valued being successful in classes and all, just like I did, and that made me feel a lot more like I had a personality because I was surrounded by people doing the same thing. Eventually, I (tentatively) found my place in it and developed a clearer definition of what I want to do with my life.\n\nTo talk about you now, it doesn’t sound like you’re losing yourself so much as it sounds like you’re changing - that’s OK, and in fact is encouraged. Life only gets harder and harder for people who are trying to maintain the same version of themselves throughout their lives, because the problems that they deal with and the things that they’ll need to be happy are always changing - especially in CS, a field that changes every 10 minutes on a slow day.\n\nSome others mentioned finding a new group of friends, and while that’d work too, I also think there’s something to be said for striking out alone (if you’re the kinda person who that’d be useful for.) \n\nI’m all about  people moving through their phases in life; sometimes, when people are struggling to define themselves in a rapidly changing lifestyle, they’re going to feel alone and as if they have no personality (I sure did.) The trick is to not be afraid of becoming someone new. Case in point, your personality isn’t lost - just changing.\n\nHope that helps!", "author": "tldrthestoryofmylife", "created": 1546702462, "upvotes": 3}, "edawemb": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edawemb/", "text": "You should walk around alone pretending you’re a gremlin that is hooked on smelling dish soap and your personality will improve ", "author": "pooptasticalpossum", "created": 1546700517, "upvotes": 1}, "edavhmr": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edavhmr/", "text": "Gosh, it's like you've grown up.", "author": "wolf2600", "created": 1546699790, "upvotes": 0}, "edaqf0p": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edaqf0p/", "text": "This is super relatable. Once your out of college I think you will readjust. That's what I'm hoping for myself.... Between work and full-time school (im studying IT) I start to feel like a robot going through the motions. I usually have major anxiety issues at the end of every semester. Then I kinda recover during the break and then it repeats. College can honestly suck the life out of you in my opinion. Cramming information into your head constantly and dealing with money problems, balancing work and sleep, and having no social life. Im glad im pursuing my degree, but my personal goal is to finish well with my sanity intact. My relationships are definitely strained right know.   \n\n\nAlso, most people change a lot after highschool. Its not surprising to realize you have changed and cant relate to your old friends a much anymore. Thats normal. ", "author": null, "created": 1546695146, "upvotes": 7}, "edap1hw": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edap1hw/", "text": "[removed]", "author": null, "created": 1546693590, "upvotes": 1}, "edag5t1": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edag5t1/", "text": "I can relate to this way too much. Any advice / ideas would be helpful . Also , I'm indian so things are a bit different here but I'm still willing to hear advice as I need it.", "author": "lucithepussy", "created": 1546680742, "upvotes": 1}, "edag55f": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edag55f/", "text": "I feel you man. Same exact for me right now. I miss when we could all just joke around fluently. Now we just awkwardly talk and watch tv. Sad hours. ", "author": "victorious_doorknob", "created": 1546680714, "upvotes": 1}, "edafigh": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edafigh/", "text": "I think it's pretty natural to have a small identity crisis when you're back in the environment you grew up in - but (not to sound too patronizing) you still have the same humor, intellect and character that you left home with. College can be an enormously stressful transition, and you have to be patient with yourself if it takes you a while to unwind and relax around your friends when you get home (after all, they've probably changed too.) ", "author": null, "created": 1546679757, "upvotes": 8}, "edaf118": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edaf118/", "text": "It could be that your personality is changing, and you can't connect them as much as you used to. Another user talked about it earlier and that was pretty good. Joining another organization might help too (like someone else mentioned).\n\nBut I've definitely been where you are in terms that I feel college has drained my personality out of me. One thing I learned this semester is when it's okay to prioritize my mental health over school. I'm a biochem major who used to be pre-med, so I was studying a fuckton to the point where I barely saw anyone, even my roommate, unless I studied with them. Its so, so draining. One night I was like \"fuck it, I'm going out instead of writing this paper and I'll do it in the morning.\" I did pretty shitty on that paper, but because I was able to spend time relaxing the night before I was more focused on other work that I got a good grade on. You claim to not have time (as I often do too), but sometimes you need to be like \"fuck it, I know I don't have time but I need to take a break. I'm taking the L on this assignment because I need me time.\" \n\nI'm not sure what your grades are (no need to share), but irl it probably won't matter past you getting your first job. Most employers won't give too much of a shit about it. My dad works for a computer company as a manager (and has done so for 25+ years), and he once told me a story of someone who had a D or two in his classes, but was an A/B student otherwise. My dad still hired him despite others not wanting to hire him because my dad saw that although he didn't get the best grades in a few classes, he had the attitude of success. That dude turned out to be an amazing addition to the team and is now a manager also. The point is, one or two or even three bad grades won't kill you. \n\nYou also have mentioned feeling that guilt of doing something non-school related...I understand that wayyyy too well. I'm the exact same way! Its a hard feeling to de-program yourself from feeling that way. I don't have too much advice for this cause I'm still struggling with this guilt, but my \"fuck it\" attitude helps a bit. \n\nYou seem to not be in a great spot with your mental health. Like I said earlier, you need to say \"fuck it\" and go to counseling. Mental health is still health! If you ignore some symptoms of a cold, it might not affect your schoolwork now and so you don't take time out of your day to see a doctor. But when it turns out that its the flu and you need to be rushed to the hospital, you will lose more time for schoolwork than if you just said \"fuck it\" and went to the doctors earlier on. Same way with mental health! At the very least, start a journal. That has helped me in ways that I don't think a therapist ever could. You don't need to do it every day, but if you ever get anxious or stressed just say \"fuck it\", take a break for a few minutes to write down your feelings, and then get back to work. \n\nAre you even happy with your major? Something you're doing for the rest of your life absolutely shouldn't make you feel this miserable. You're so damn young, you have time to rediscover another pathway. \n\nAlso, I seem to have noticed that you go to A&M. May I suggest the safe ride program there as an activity to do? I am currently involved in the one at my college and its fucking great. I met a dude who was a part of both the one at A&M and my college's, and he said they're pretty similar. Don't let the fact that its a sober ride program into fooling you that the people are all conservative, non-drinking students...the ONLY people I go out to bars with are the ones who I met through that organization! It occurs at night so you'll be sacrificing a night of partying or whatever, but I find it worth it. Plus, it gives you a fantastic thing to talk about on your resume to make you as a person (not your grades) seem more interesting. I have so many people ask me about the program and are always impressed. This type of program isn't for everyone though as it sometimes can be a bit intense with driving late at night.\n\nAaaannddd thats the end of my wall of text. It was really long, but thats because I related too much. Idk if it helped, but I hope you takeaway at least one thing useful from this. \n\nEdit: grammar ", "author": "AceOfRhombus", "created": 1546679021, "upvotes": 24}, "edadty4": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edadty4/", "text": "I know this seems like a generic response, but try talking to a therapist or a psychiatrist about it. They can really help a lot.", "author": "Thirtyfourfiftyfive", "created": 1546677278, "upvotes": 20}, "edadihy": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/edadihy/", "text": "I'd say a large part of this might be due to the fact that you have changed as a person, and your friends have as well. The thing is, we don't simply settle into a fixed personality and mindset as soon as we hit 17 or 18. We continuously change—as do others around us. You value different things now, and that's just part of who you're becoming, and your friends might have different goals and mindsets as well. It's normal and healthy if anything, but if you feel like you're incessantly oriented around school try to make some more leisure time to hang out with other friends or establish a new connection with your older friends from high school. ", "author": null, "created": 1546676835, "upvotes": 69}, "eda3p43": {"link": "/r/college/comments/acr2jj/i_have_lost_my_personality/eda3p43/", "text": "I’ve noticed that I’ve picked up a lot of the personality traits of my friends at college and the same has happened to my friends from high school. It’s all about who you surround yourself with. You’ll end up talking and acting just like the people you surround yourself with", "author": "Bidiggity", "created": 1546665535, "upvotes": 407}}}