{
  "sid": "qfw17b",
  "link": "/r/college/comments/qfw17b/did_anyone_else_have_a_mediocreunfullfilling/",
  "title:": "Did anyone else have a mediocre/unfullfilling college experience?",
  "text": "I can't have been the only one. I graduated right before COVID hit the world so I was going while it was still normal. I was majoring in electrical engineering and it ran me to the bone. All four years I struggled with it and worked part time jobs. I didn't go to a state party school which probably makes a difference. I went to local university with around 8000 students where most commuted even though there were dorms for international students. I have a good job lined up but I feel like I missed out on something and I can't get those years back. Anyone else feel similar or did I do something wrong?",
  "author": "Same_Confusion_9201",
  "created": 1635213531,
  "updated": 1635302732,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hi2l43r": {
      "link": "/r/college/comments/qfw17b/did_anyone_else_have_a_mediocreunfullfilling/hi2l43r/",
      "text": "I feel the same but literally went to business school to get a job at enterprise car lol",
      "author": "ChickunTendies",
      "created": 1635218409,
      "upvotes": 1,
      "replies": {}
    },
    "hi2p1n0": {
      "link": "/r/college/comments/qfw17b/did_anyone_else_have_a_mediocreunfullfilling/hi2p1n0/",
      "text": "I’m a LOT older than you but had a similar college experience. Commuter school, worked a lot, didn’t really get involved in the school’s social scene. But got a good job and still work at the same company several decades later. \n\nIt all turned out fine in the end. College helped me get where I wanted to go, and some of the best years of my life were the years immediately after college. In time, you won’t look back with regret, and the best is likely yet to come. Good luck.",
      "author": "SavvyCheetah",
      "created": 1635220594,
      "upvotes": 1,
      "replies": {}
    }
  }
}