{
  "sid": "q5nadd",
  "link": "/r/college/comments/q5nadd/what_are_your_college_tips/",
  "title:": "What are your college tips?",
  "text": "What are your top college tips for high school seniors/upcoming freshmans on passing classes, balancing schoolwork and social life, things to know, etc?",
  "author": "AnxiousInvestigator2",
  "created": 1633923198,
  "updated": 1634582321,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hg6shu6": {
      "link": "/r/college/comments/q5nadd/what_are_your_college_tips/hg6shu6/",
      "text": "Join organizations. Get involved. That’s a good way to make friends and meet people especially if you aren’t living on campus. \n\nAny time you have midterms or finals coming up, do NOT try to pull all nighters. Please make sure you study well in advance, and make sure you study enough to thoroughly understand the material. If you have an exam on Friday, staying up Thursday into Friday morning is not going to help you. If you don’t know the material by Thursday night, 12 AM at the latest, then you’re not going to know much more by staying up all night. Plus you’re just going to be very tired which will hurt you when you’re taking the test\n\nGo to office hours and tutoring sessions. Try to form a study group for each class you’re taking. \n\nQuizlet note cards saved my life. \n\nTry to bring your own lunch from home instead of buying lunch on campus or from the student union. You’ll save money. A lot of money in the long run. \n\nEnjoy college. Go out. Have fun. Go to sporting events. Go to bars or clubs. But don’t party too hard to the point where you’re flunking out of school.\n\nAlways remember “C’s get degrees” 🙃",
      "author": "2lit_",
      "created": 1633923554,
      "upvotes": 2,
      "replies": {}
    },
    "hg6xd05": {
      "link": "/r/college/comments/q5nadd/what_are_your_college_tips/hg6xd05/",
      "text": "It helps to start reading and taking notes like you would in college. When I was in high school I started learning college studying skills from my sibling. I also attended information sessions and workshops at universities I was interested in. I can share some resources with you on how you can prepare for your college freshman year.\n\nI would suggest reading journal articles now. The Journal of Emerging Investigators offers free access to journal articles. The articles are written by middle and high school students, but you can start training your skills in reading articles. \n\nI have a study with me playlist on my YouTube channel that focuses on helping students study better in college. This playlist includes:\n\n\\- 5 effective study habits (I introduce my overall studying style)\n\n\\- How to read a textbook\n\n\\- How to read a journal article\n\n\\- How to take notes (lectures, readings, project and exams)\n\n\\- How to prepare for and take exams (I talk about ways you can tackle different types of exams)\n\n\\- 5 books that can help you build your vocabulary, improve your reading, writing, presentation skills and life skills for college\n\n\\- School supplies that I found to be useful during college\n\n\\- College freshman advice \n\nMy playlist link is: [https://youtube.com/playlist?list=PLdkoToKBS\\_VQo0\\_2eyB09tZGzfNYgyEum](https://youtube.com/playlist?list=PLdkoToKBS_VQo0_2eyB09tZGzfNYgyEum)\n\nI also have a College Freshman Starter Kit. This is useful for getting you familiar with how to transition from high school to college.\n\nLink to the kit:\n\n[https://docs.google.com/document/d/1AeO1X4u0ZWQCkDk3zALoDUPV\\_W7K9wV5HvoFWK\\_Es2E/edit](https://docs.google.com/document/d/1AeO1X4u0ZWQCkDk3zALoDUPV_W7K9wV5HvoFWK_Es2E/edit)",
      "author": "irisy211",
      "created": 1633926220,
      "upvotes": 2,
      "replies": {
        "hg6z5lb": {
          "link": "/r/college/comments/q5nadd/what_are_your_college_tips/hg6z5lb/",
          "text": "Thanks!",
          "author": "AnxiousInvestigator2",
          "created": 1633927239,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg6tlpz": {
      "link": "/r/college/comments/q5nadd/what_are_your_college_tips/hg6tlpz/",
      "text": "Faculty here.\n\nThe number one academic tip by far is to *go to class*.  That's it.  You'd think this would be obvious, since (i) learning something is the main point of going to college, and (ii) you or somebody else is paying a substantial amount of money for these classes, but even after years in academia it's still surprising to me how many students don't show up to class regularly and then seem confused as to why they earn such low grades.  So, go to class!  Even if the class meets early in the morning.  Even if you were up late last night doing homework.  Even if it's cold outside and you don't want to get out of your warm bed.  And so forth.  It's very clear that students who attend class regularly do better, on average, than students who do not.\n\nSecond tip: keep up with your work on a day-to-day, week-to-week basis.  Unsurprisingly, the vast majority of students cannot slack off for a whole semester and then miraculously master the whole content of the class in the final three days before the exam.  Once you fall behind, it's much, *much* harder to catch up than it would have been to just study and do the work as it came from week to week.\n\nGood luck.",
      "author": "ChemMJW",
      "created": 1633924154,
      "upvotes": 1,
      "replies": {}
    },
    "hgi9x0f": {
      "link": "/r/college/comments/q5nadd/what_are_your_college_tips/hgi9x0f/",
      "text": "Learn how to manage your money as soon as possible know how to budget and find a system that works for you like an app. By doing this you will be able to feel more relaxed and not worried about your expenses and focus more on school if you know where your money is going.",
      "author": "saammm2222",
      "created": 1634146150,
      "upvotes": 1,
      "replies": {}
    }
  }
}