{
  "sid": "q1fzf4",
  "link": "/r/college/comments/q1fzf4/do_stem_majors_know_what_they_want_to_do_with/",
  "title:": "Do stem majors know what they want to do with their lives?",
  "text": "i’m a poli sci major so i’m mostly looking in from the outside on this one. but can it be that this many people are passionate about stem labor?? lot of people I know seem to be majoring in stem because they think it’s the right choice or less risky than a humanities degree. yet it seems like a lot of hard work and sacrifice for something you don’t even know if you like.",
  "author": "12-A",
  "created": 1633383611,
  "updated": 1634084135,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.87,
  "comments": {
    "hffuk79": {
      "link": "/r/college/comments/q1fzf4/do_stem_majors_know_what_they_want_to_do_with/hffuk79/",
      "text": "Short answer: NOpe",
      "author": "chillierTEA",
      "created": 1633405171,
      "upvotes": 10,
      "replies": {
        "hffunzh": {
          "link": "/r/college/comments/q1fzf4/do_stem_majors_know_what_they_want_to_do_with/hffunzh/",
          "text": "upvote",
          "author": "limegreenporcupine",
          "created": 1633405231,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfeodit": {
      "link": "/r/college/comments/q1fzf4/do_stem_majors_know_what_they_want_to_do_with/hfeodit/",
      "text": "There are many, many people with no interest in STEM but major in it because they think it will get them a good paying job. In my experience, the vast majority of these people eventually change majors to something they actually like or they drop out altogether. Among the people who actually do complete the degree, they often either 1) can't find one of those \"well paying\" jobs because their grades were mediocre and they never really learned the material all the well, or 2) they're entirely capable of finding a good paying job, but don't because they've realized they hate it, or 3) find that good paying job and suffer miserably because they hate their job but feel stuck because they make good money and no one wants to leave a good paying job. These people usually change careers eventually or, if they're lucky, they're able to make a lateral move within their place of employment to a job they like better and that they'd be better suited for.\n\nRegardless of how it plays out, I have never once in my life met a person in STEM who hated their job but stayed there.\n\nOf course, many people who get into STEM for the money eventually find out that they actually like it, in which case they end up doing just fine. The ones that don't like it never last, in my experience, but to be fair, if someone doesn't know whether or not they like it I see no reason not to at least try it out.\n\nEdit: I should be clear that I'm mostly talking about CS and engineering here, because other STEM majors don't have the marketability or pay with just a BS that CS and engineering have so it's not really the same.",
      "author": "HumanDrinkingTea",
      "created": 1633384248,
      "upvotes": 12,
      "replies": {}
    },
    "hfen7wn": {
      "link": "/r/college/comments/q1fzf4/do_stem_majors_know_what_they_want_to_do_with/hfen7wn/",
      "text": "Like any major, some know and some don't. Some go into their major because of passion, some money, some just assume that anything stem is \"safe\".",
      "author": "hemehime",
      "created": 1633383800,
      "upvotes": 3,
      "replies": {}
    },
    "hffpv3x": {
      "link": "/r/college/comments/q1fzf4/do_stem_majors_know_what_they_want_to_do_with/hffpv3x/",
      "text": "Some definitely don't. A good friend of mine who went to my college majored in CS, but the whole time he was in college he put in basically just enough work to do OK in his classes, and it never seemed like he had much interest in computer science or programming. As a result he is still having a hard time figuring out what to do/getting a job after graduating. I think in general it's a bad idea to major in something you don't find interesting, unless your end career path is considerably different from you major, e.g a stats major who wants to go into finance. Ultimately, I think people should major in what they want, but also have a plan for what to do after graduation.",
      "author": "postmaloneismediocre",
      "created": 1633402652,
      "upvotes": 3,
      "replies": {}
    },
    "hfewfsv": {
      "link": "/r/college/comments/q1fzf4/do_stem_majors_know_what_they_want_to_do_with/hfewfsv/",
      "text": "I want to be a Nurse 👩🏾‍⚕️",
      "author": "TragicalKingdom",
      "created": 1633387799,
      "upvotes": 2,
      "replies": {}
    },
    "hfeprcb": {
      "link": "/r/college/comments/q1fzf4/do_stem_majors_know_what_they_want_to_do_with/hfeprcb/",
      "text": "Personally I went with MechE since it's broad with what you can do with it. There's a bunch of different industries and functions that I can take my degree. So I know I like problem solving in general and I know there's lots of directions I can utilize it besides nasa and tesla.",
      "author": "NinjaLorian",
      "created": 1633384815,
      "upvotes": 1,
      "replies": {}
    },
    "hffbbrp": {
      "link": "/r/college/comments/q1fzf4/do_stem_majors_know_what_they_want_to_do_with/hffbbrp/",
      "text": "I don't know what I want to do with my life but I do know that I love stem! I'm a biology major and I'm loving all the classes and all the things I'm learning! It's all so cool!",
      "author": "SnapdragonPBlack",
      "created": 1633395342,
      "upvotes": 1,
      "replies": {}
    },
    "hffzoxy": {
      "link": "/r/college/comments/q1fzf4/do_stem_majors_know_what_they_want_to_do_with/hffzoxy/",
      "text": "I initially wanted to be a neurologist but I decided senior year of HS I wanted to do environmental science instead, with the hopes of doing environmental toxicology later. Turns out I was right. I’ve loved my major so far. I’m getting into more Data Sci and GIS work within my major which I’m hoping to market to a graduate school for ETOX in my next and last upcoming semesters. I found a way to blend my two topics of interest and have been chasing and living the dream ever since. \nI know a lot of stem majors start out strong and find out they either a) don’t like their major and switch or b) end up getting “weeded out” by god-awful programs. For which, I’d argue that the latter could be resolved by much smaller class sizes overall with either a MUCH larger TA network for help and office hours, or simply much smaller class sizes in general. In which STEM majors could feel supported and get more one on one help than they could receive in a class of hundreds of individuals where one TA may oversee 62 to 100+ students.",
      "author": "AimlessFucker",
      "created": 1633408245,
      "upvotes": 1,
      "replies": {}
    }
  }
}