{"sid": "n14nzl", "link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/", "title:": "Group working is ruining my grades", "text": "First of all, I'd like to apologize if this isn't the right place to post.\n\nI'm a sophomore student, really interested in Literary Studies. I try my best and study really hard, since I want to join the Academia at some point. I got straight A's last semester and was trying to get a 3.7-3.8 GPA, but after a bunch of team projects I'm really struggling. One subject was always an A+ for me, but we got a D because another group member didn't do much. I tried not to care, because we were friends so I just thought 'bad luck, s\\*\\*t happens'.\n\nToday, we had another group presentation. We split the work between 5 people. I read 5 papers and explained my part (we had to record the audio, so the teacher only had to press 'play'). Expected same from the rest (you know, I don't want to bother other people telling them what to do, it wouldn't be nice). The teacher asked a question to another member and nobody answered (camera off, micro off). This person was online, talking with us on another chat and suddenly shut up. Like, pretending we wouldn't notice. So the teacher said like 'OK, you're 5 people, who can answer my question?' And the other 3 said (privately) they didn't know what to say, since they didn't even look at that part of the project. I had, so I offered myself and improvised something, while browsing Wikipedia as quick as I could.\n\nOverall, I feel tired and a bit sad. I worked a lot, and today it was a complete disaster (other projects were much better and people answered perfectly). Have you ever been in a similar situation? What can I do next time I have to cope with this? Would appreciate any advice or tricks...\n\n(I don't want you to believe I'm the *i-know-everything* person, I like group projects and being able to work with others is such a basic skill, but it sometimes is a bit difficult...)", "author": "EinerIstGunther", "created": 1619703899, "retrieved": 1632802705, "over_18": false, "upvotes": 669, "upvote_ratio": 0.99, "comments": {"gwgkfp9": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwgkfp9/", "text": "Working with other people is not only part of college but of life in general. For college purposes, I foudn out that you have to be assertive you must tell people what you need from them and make yourself available on what you are willing to do. You cannot leave it to somebody else, you must be on top of a group constantly, and don't become the person who does everything either that will not help you later in life.\n\nFor me, I do team contracts for group projects, and I send the team contract to all the members and the professor, and make my teams sign the contract so they all know what is expected from them and I spell out the consequences of not doing your part. \n\nI like group projects now because I am assertive, so my recommendation literally is to be assertive. Use tools at your disposal to make them do their part, and be unforgiving when they miss a due date otherwise you end up doing it all on your own and become bitter.", "author": "metalsd", "created": 1619810262, "upvotes": 2}, "gwepko0": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwepko0/", "text": "Group work is rough. If you are a good student you are often paired with bad students based on the belief, it seems, that you will pick up the slack. It's fucking brutal. I am in my last year now and had a major group project to do. I more or less just accepted that my grades would be subpar and just did my own part and some editing. Spoiler alert, we didn't get a good grade. But I was sick of doing other people's work.", "author": "maexx1983", "created": 1619777386, "upvotes": 2}, "gwdse8o": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwdse8o/", "text": "Sounds like your going about group projects all wrong. \n\nSo say you're given a group project and a group of 4 people. The total amount of work required will be about 4 times the work for one person. So yeah, you split the work. But you need a team leader, and everyone on the team should have some knowledge about what the other people are doing. And everyone needs to review everyone else's work and make suggestions, make sure all of the work is \"up to snuff\" and that the different parts will flow well together, whether it's a group paper or group presentation. \n\nAnd yeah, sometimes, everyone just wants to do \"their share\" or not even their share. And both of those cases suck. But yeah, a presentation/project that's compartmentalized to the point where everyone just does their part is likely worthy of a 'D'. If you want an 'A' project, you have to make sure everyone is completing everything properly, with good flow, and make sure that if someone drops out at the last second, their \"part\" will still be covered (that goes for being able to answer questions as well.) \n\nIt sucks that that's what you have to do to get a good grade on a project, cause I always end up doing WAY more than my share of the work, but I don't want the group project to hurt my grade, so that's what I gotta do.", "author": "symmetrical_kettle", "created": 1619752754, "upvotes": 3}, "gwdkn98": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwdkn98/", "text": "Group work can suck but it does teach you how to CYA and cordinate a group which is a useful skill in the workplace. My advise is to #BeTheAssHole. Make a schedule come up suggest milestones, assign people slices of the project to do and make a record of that. Then follow up and try to hold them accountable. Set clear reasonable expectations (i.e. attend every group meeting or communicate confilts ahead of time, complete you work to the best of your ability or reach out to group members for help if you struggling). Don't be unreasonable or dictatoral but get people to commit to deadlines and document if they meet them or not . Get people to commit to meetings and document of they attened or not. Don't assume people keep up with their work unprompted, ask for updates at meetings.\n\nThen at the end it you project you have evidence if a group member didn't pull there weight or ghosted you,etc. \n\nAlso communicate with your prof early if you're have issues with a group member so it doesn't luck like your just throwing people under the bus at the end.\n\nTLDR take initiative and organize the group, don't be mean but bring the receipts.", "author": "patmorgan235", "created": 1619748863, "upvotes": 2}, "gwcv20t": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwcv20t/", "text": "I got one of the lowest marks in peer evaluation even though I'm the one doing the longest part, the most of the slides, etc. Even my friend and our leader got low scores even tho they always initiated the discussions.\n\nSomehow, the ones who barely responded in the gc, did the bare minimum AND made many mistakes that we had to redo their works, scored the highest among us. What infuriated me the most was I gave them all full marks because i expected them to do the same!", "author": "blackshawler", "created": 1619736755, "upvotes": 1}, "gwch7e0": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwch7e0/", "text": "My roommate is a geology student and recently had 2 separate presentations for 2 separate classes where he was the only person to work on them.  The other people in his group either didnt show up to the presentation, or showed up and didnt talk so he could do the entire thing.  Idk how to fix that grade-wise, I know he just talked to his professor and they graded each member separately", "author": "Don_Macaroons", "created": 1619730570, "upvotes": 1}, "gwcg3jr": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwcg3jr/", "text": "Group presentations are always shitty especially when you get yourself irresponsible people. I'm sophomore too and after around 2 presentations with shitty brats during my freshman year, i decided to first look around the people in my class and be \"judgy\", and when I know for sure this person WILL BE a responsible person, I get that bitch no matter what and stay with him/her for the rest of the semester. Another thing is to ask my professor/instructor the minimum number of people, usually it would be 2, and i stay with 2 only because it will be easier to work in pair, from my experiences. But now due to covid, it's like gambling lol", "author": "attuneflows", "created": 1619730120, "upvotes": 3}, "gwcfsjo": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwcfsjo/", "text": "First of all I want to say that it sucks that you have a bad group and I know how frustrating that can be. I currently study hospitality management and as you might guess almost all of our assignments are group project and reports. They are 10,000+ words long sometimes which makes them very difficult to do by yourself if you have a horrible group. However, I've got a few tips if you need to continue working with them or have bad groups in the future!\n\n1. Sign a contract with them that enables you to kick them out if they are not pulling their weight (this is a common practice in my uni). Sometimes threatening (especially with really lazy free riders)  group members with being kicked out motivates them.\n\n2. Meet together as a team before working on the assignment to discuss what each of you are aiming for (grade wise) and how you can adapt to each others aims, what your strengths and weaknesses are, ground rules and a schedule of deadlines that you all agree on(this is especially helpful for rigorous assignments)\n\n3. Try and sit down with them and discuss problems that you are seeing, please document meetings in some sort of way so you have evidence of what happened in case they are rude or uncooperative \n\n4. Talk to your professor in charge, the likelihood that they have encountered a group problem before is high and if not they may still be able to help you (maybe even assign you a new group)\n\n5. If all else fails you might have to do it by yourself/with the absence of one or more group members and sometimes you just need to do the work because it is your grade. (I know this sucks but sometimes you gotta do what you gotta do)\n\n6. Remember it's okay to be frustrated and make sure to take care of yourself!", "author": "IIIMochiIII", "created": 1619729993, "upvotes": 2}, "gwcdttd": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwcdttd/", "text": "My grandson is now a junior in college, and until this semester group projects were always a problem for him.  That includes in high school.  He is a serious student, and often wound up doing the vast majority of work on group projects himself.  Of course, the group goof-offs received just as high a grade as he did.\n\nThis semester he had 4 group projects. He just took over as the unofficial leader of each group.  The results were surprising.  With my grandson gently prodding everyone and ensuring deadlines were met with time to spare, 2 of the 4 projects went very well.  That was despite normally unmotivated students as group members.  The 3rd group featured extreme goof-offs, who required my grandson to assume a management style closer to that of King Joffrey.   The final group had (thankfully) all good students who worked on time and efficiently.  \n\nThe bottom line is good students should adapt a management style for group projects.  Its good practice for a career, and it prevents the bad students from lowering the grades of serious students.", "author": "taxref", "created": 1619729178, "upvotes": 3}, "gwcdtjz": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwcdtjz/", "text": "Group work never works especially not virtually", "author": "deathworld123", "created": 1619729175, "upvotes": 1}, "gwc7y5f": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwc7y5f/", "text": "This is why I’m glad my professors are understanding of things like this. Group work either counts as extra credit or as completion. And in the rare case it does count for our grade, we do group evaluations where if enough people write negative things about you, you get a 0% on the assignment. \n\nUnfortunately, not every professor is smart enough with this. If I had a professor kill my grade because of group work, I’d destroy them in the evaluation and on RMP.", "author": "microfsxpilot", "created": 1619726748, "upvotes": 3}, "gwc7in9": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwc7in9/", "text": "The most obvious thing I got from this is that you've never really done a group project, or at least you haven't in any of the examples you gave. Instead of working as a group, you've each just done independent work that's hurriedly frankensteined together at the end.\n\nSometimes, if the group is full of people who are interested and motivated to do the work then no one has to be \"bossy\" and you can all just work together, everyone putting in the effort, everyone giving feedback on all the other parts, everyone equally skilled at the subject.\n\nBut most of the time you're going to need a leader. Someone (or a couple of people) has to assign work, organise meetings, follow up on things, help the stragglers, and generally make sure you're going to hit your targets. And if you're the person with the highest standards then you are the one who has to be the manager and tutor. You can't expect the others to do A-level work all on their own if they're happy to take a D or C.\n\nYou have to work *with* people, not just adjacent to them. And that means being bossy sometimes, and *not* just \"if needed\". By the time you figure it's needed, it's going to be way too late to get everyone organised. It has to be sorted out on the very first meeting, which should be immediately after you form the group.", "author": "officially_anxious", "created": 1619726570, "upvotes": 3}, "gwc3q4s": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwc3q4s/", "text": "group work online is a bitch", "author": "nghigaxx", "created": 1619725116, "upvotes": 1}, "gwc3hku": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwc3hku/", "text": "I notice that you said you don’t like telling people want to do. Well, here’s thing, if you are striving for a perfect GPA, you are going to have to take the lead and delegate the group work. Arrange a meeting once the project is assigned and divvy up the work early. The reality is, not everyone in college cares about their grades. Some people are willing to do the bare minimum required for the degree and that is their choice. But if you are striving for a great GPA, in order for group work to not damage your grade, you have to tell the others what you expect them to do. And you have to break up the work according to what will get you the best grade. Even if you are working with your friends. \n\nTake into consideration their work ethic and whatever situations that are going on that may inhibit them to be able to do the A quality work you need them to for your grade and provide their assignments accordingly. You can also volunteer to edit after if you really think you need to, depending on what the project is. (I’ve always volunteered to edit group presentations and papers)\n\nSource: just graduated Summa Cum Laude with a 3.96 GPA. I was the group leader in every group project I’ve done. I was not going to let other people’s poor performances hinder my grade.", "author": "roganwriter", "created": 1619725034, "upvotes": 5}, "gwc0t6a": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwc0t6a/", "text": "I've been ruining my own grades at least", "author": "KING_COVID", "created": 1619723991, "upvotes": 1}, "gwbzt46": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbzt46/", "text": "I know it sounds kind of shitty, but you need to become a dictator when it comes to group projects because often no one else will step up to lead because they don't care, and while that is okay, you just have to accept it. I am also not super confrontational, but I just try to keep in mind that I am probably never going to interact with a lot of my group mates again, so it doesn't really matter all that much if I nag them into doing their work as long as it gets done in the end.", "author": "TheLongJon", "created": 1619723602, "upvotes": 5}, "gwbzilg": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbzilg/", "text": "Reading this now as a senior in high schools angers me and scares me, but I have experience this in high school too last year as a sophomore. We was a group of three and had to do a presentation, they both ended up making excuses and leaving the classroom having me to present all of the work.Also I forgot to mention I pretty much did the work because they was just playing computer games on the laptop.Anyways as I was presenting I could see them both outside smirking and laughing at me.😑", "author": "gokujr1347", "created": 1619723488, "upvotes": 3}, "gwby8e6": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwby8e6/", "text": "Group work is so annoying. College is not about teamwork. It’s all about valuing individual achievement and learning with grades. We’re not making massive projects for big companies, we shouldn’t be penalized if chad from sigma apple pie wants us to do the entire final project or waits until the last minute to do a shit job on their part.", "author": "Nyy0", "created": 1619722994, "upvotes": 3}, "gwbtiwq": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbtiwq/", "text": "I feel that. I’m probably gonna have to retake a hard class because of useless group members.", "author": "darned-if-you-do", "created": 1619721140, "upvotes": 3}, "gwbq5st": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbq5st/", "text": "Unfortunately it seems that no one in your group took a leadership position and that is likely why this happened since many college students need direction when it comes to group projects simply because they will hope that someone else will pick up the slack. \n\nSome one should have taken charge and divvied out sections to work on since it is sadly rare to find a group where everyone is going to do their own work and not slack off", "author": "nemo1261", "created": 1619719777, "upvotes": 5}, "gwbq0lo": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbq0lo/", "text": "There’s a pretty small chance you’ll talk to any of these losers after college. Stand up for yourself. Don’t let these lazy people drag you down. If you do, you only have yourself to blame. Get on their case, talk to your professor, switch groups. Do what YOU need to do.", "author": "GoodDog2620", "created": 1619719719, "upvotes": 8}, "gwbmaeq": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbmaeq/", "text": "I think that most professors are aware of the nature of group work. I think every group has that one person who does fuck all, and the one frantically trying to do -everything- and manage -everyone-. \n\nSo, I think your best bet is to talk to your professor. Explain what you contributed to the project, and see if they will consider adjusting your grade to reflect the part that you contributed. It’s worth a shot. \n\nAnd yeah, like others have said, I get that you’re not trying to bother your friends, but they are kinda acting like assholes if they don’t pull their weight and fuck up your grade. Don’t be afraid to poke them about it a bunch in the future.", "author": "Feigned_Muay", "created": 1619718193, "upvotes": 3}, "gwbjb5l": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbjb5l/", "text": "I don't trust most other students. I can somewhat trust the people in my major, since it's a little bit smaller and more competitive, but even then I usually choose not to. I think a lot of kids let themselves get steamrolled by difficult work and tend not to take charge. It's frustrating, especially if there is a diffusion of responsibility. I don't care what anyone's reasons are, when you're on a team you need to work harder so you don't fuck everyone up. Instead of feeling an obligation to their classmates, a lot of people see this as an opportunity to get carried on the back of harder working students. I generally ask my teacher prior to group assignments \"listen, I know this would be a lot of work to do by myself, but I have had poor experiences with group work and I'd prefer to fly solo on this one. I'll deal with any amount of work that forces me to do\". Either A) they say yes or B) they take that as a reason to put me with the weakest students so I can \"balance it out\" AKA do all the work.", "author": "ItsReallyVega", "created": 1619716988, "upvotes": 4}, "gwbfi93": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbfi93/", "text": "This happened to me and today was the final day that team, feel so relieved now, it was just bad luck, when we were in break out rooms no one would talk and no one would want to do the assigments. Thankfully the teacher we got on that subject weren't strict ones.\n\nI don't ask much, but seriously, copying and pasting from Wikipedia it's on another whole level.", "author": "raylolSW", "created": 1619715905, "upvotes": 4}, "gwbf2ne": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbf2ne/", "text": "I had to learn the hard way that being \"that guy\" is sometimes the only way to get a good grade with group projects. I've had so many group projects this school year. I hate being that guy, but sometimes you do have to babysit your teammates to make sure you get a good grade. \n\nTry and have written, constant, and consistent communication with your team members. If they fail to respond or go back on what they said then you have a paper trail that you can present to the professor. A reasonable professor will hear you out. But not all professors are reasonable, so sometimes you're justified in being \"that guy\" in your group. It's the only way to save your grade sometimes.", "author": "TheLordDongus", "created": 1619715772, "upvotes": 17}, "gwbdwzm": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbdwzm/", "text": "Dude I completely understand. I'm currently going through some bullshit with a group research project. Literally half of the group never responds to the group-texts and don't show up for the zoom meetings. It's so ridiculous. They're going to end up causing the couple of us that show up to do a lot more work. I hate group work", "author": "unholymanserpent", "created": 1619715295, "upvotes": 2}, "gwbdlro": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbdlro/", "text": "I have noticed that people are noticeably tired and down after a summer with barely anywhere to go and it's our third online semester... Group work quality has dropped down noticeably, nonetheless we all still do our part, but you can easily tell that everyone's fed up at this point :(", "author": "Fuba301", "created": 1619715168, "upvotes": 6}, "gwbckrk": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbckrk/", "text": "Yea same here. I really care about my grades and I always try to give the best work i  can do. So when I noticed that none of my groupmates are not giving a shit about the project I started to annoy them. Always updating them, \"Hey, I'm almost done in my part, how about you guys?\". If I noticed that they have not seen the message  I talk to them one-on-one. \n\nI feel like I am a babysitting them. They're mf college students not a toddler.", "author": "MsMaryTudor", "created": 1619714747, "upvotes": 4}, "gwbcdat": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwbcdat/", "text": "In my opinion this sounds like a group without a leader. You seem to be the best candidate at this point. I know you don’t want to be the person who dictates, but if you care about your grade at all you’ll take the reigns. \n\nOn the next project, take the lead. Assign your group members their sections and follow up with them every other day to see where they are at, what issues they are facing, what their timelines are looking like. You can’t expect to just evenly divide up work and not check in on people until the day it’s due. You need to be the one holding people accountable, and if they aren’t pulling their weight you need to correct them or report them.\n\nMy best advice to you would be to stop believing people are going to do the work of their own accord. You’ll find in both your school projects and work projects in your future career that other people will almost always let you down in one way or another. It’s up to you to demonstrate leadership ability and hold people accountable.\n\nGood luck!", "author": "DontTrustMe-", "created": 1619714661, "upvotes": 9}, "gwb88je": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwb88je/", "text": "Ok, I have the same issue and I think in situations like this it’s really important to communicate with the teacher. Talk to them and tell them that you tried really hard and your group mates did not pull their weight.", "author": "Away_Insurance_4267", "created": 1619712987, "upvotes": 4}, "gwb6b54": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwb6b54/", "text": "Just do all of it. 5 years of college, countless group projects and I've never had a group member that gave a shit about any of the projects we've worked on. They wait till the 11th hour and try to bust out the project at the last possible second and put forth the lowest quality BS imaginable.\n\nI'm currently working on a project where we have to design a battery for an EV. I'm 40 pages into the report and my partner hasn't written a single sentence. He doesn't go to class, doesn't pay attention, and has given me every excuse under the sun as to why he can't work on the project. But I really DGAF because at least I can put together a quality report and get a good grade. Yeah itd be nice to have a partner that could actually make a meaningful contribution and lighten the load for me but those people just dont exist, at least not in any group I've been in. So I'll stay up till 1AM every night working on this stupid project.", "author": "Red-Stoner", "created": 1619712191, "upvotes": 17}, "gwb4zd2": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwb4zd2/", "text": "I am going thru something similar- as a transfer student I have each class weighting into my GPA so much more than if I were a full 4- year student.\n\nA recent project was truly awful with my group members literally doing the powerpoint 5 mins before presenting and not telling anyone (I had interviews that week and I was too busy preparing for that to be chasing other people around telling them to do their work). I tried to loop my professor in separately by email and fortunately now we are doing team member ratings. I hate involving authority because I would rather settle things myself, but sometimes you just have to to save your grade. If you tell your professor like I did, try to take responsibility and ask for them to help you help yourself, rather than asking them to figure it out for you.\n\nSo for example, \"i wanted to bring to your attention that our group is having trouble sticking to deadlines and i want to take responsibility in keeping the project on the rails, can we discuss how we can approach these situations\" vs \"my group mates arent doing anything i dont know what to do\".", "author": "intl-uni-help-please", "created": 1619711640, "upvotes": 19}, "gwb3n9y": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwb3n9y/", "text": "I dropped two online classes after reading the syllabus because having to do multiple group projects a semester online is a death sentence. For my classes that just had one, I still did more than half the work and offered to present the whole thing alone. I can't understand why teachers try to make group work a thing online.", "author": "noimdirtyd4n", "created": 1619711092, "upvotes": 32}, "gwb2pfd": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwb2pfd/", "text": "As a person with a very high GPA(3.8), if I don’t take over the group project, it’s going to drop my mark. I’m literally forced to do 80% of it because the average classmates’ quality of work isn’t up to par with my grade in the class.", "author": "DemonRDT6", "created": 1619710700, "upvotes": 11}, "gwb1uv5": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwb1uv5/", "text": "I feel that pain.   \nI bother the shit out of my group members undtil they do their shit so I stop annoying them.   \nIn one case they still didnt do shit and didnt even KNOW HOW to do stuff or what to do. So in that project, after telling them so mayn times I resorted to give them precise instructions because if I dont take care of things turning out well no one will.   \nAnd I always look over the other peoples parts so if they mess up during presenting I can just take over. Its super frustrating", "author": "happyfrosch123", "created": 1619710344, "upvotes": 6}, "gway1d9": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gway1d9/", "text": "I've had a lot of group projects (part of my major) and I had one group project go south causing me to work for 12 hours nonstop on a 20 page document. After that I'm pretty much done with peoples' bs. \n\nI initiate/facilitate discussion, set meeting times and due dates, call people out when they miss it, whatever needs to happen to get a smoother group project.  I don't assign tasks or tell people what part of the project to do, people choose what they want to contribute and then I try to make sure it gets done. \n\nIf it's seriously getting bad and you care about your grade then you need to take action. Either by privately talking to them or contacting your professor. But definitely don't do nothing and just pray they know exactly how you're feeling. That's also not fair to your friends if you get upset with them and they don't know why.", "author": "DisappointedLunchbox", "created": 1619708747, "upvotes": 80}, "gwaqymh": {"link": "/r/college/comments/n14nzl/group_working_is_ruining_my_grades/gwaqymh/", "text": "i also have had terrible experiences with group work and am also a bit unassertive as you seem to be in these situations. the best advice i can give is\n1. bother the shit out of your group members. does annoying them really matter more than a good grade, which you really seem to value?\n2. throw them under the bus. seriously. if the prof asks a question about a specific topic that someone was supposed to review, say “i believe that was the topic so-and-so focused on, maybe they have some input?”\nit may sound petty to do this shit, but these people need to learn responsibility anyway and it shouldn’t be your problem if they don’t do their shit.", "author": "Healthy_Combination3", "created": 1619705691, "upvotes": 372}}}