{
  "sid": "qqf85m",
  "link": "/r/college/comments/qqf85m/gen_ed_requirements_and_auditory_processing/",
  "title:": "Gen Ed Requirements and Auditory Processing Disorder",
  "text": "I'm considering reaching out to the disability services and seeing if my severe auditory processing disorder means I could have the requirement altered or waived entirely.  Has anyone had experience needing any gen ed requirements changed due to a disorder or other issue? I was officially diagnosed and have all the paperwork. \n\n\nAPD makes it almost impossible to understand what the German speakers are saying, let alone even attempt to say it myself. It's week thirteen and I couldn't tell you how to say hello in German. I'm passing the class because it's alot of written work, which I can do. But everything speaking, I can't really do.\n\n\nEDIT: Forgot to mention I need three years of foreign language because I didn't do it in high-school. I can't see myself passing those classes.",
  "author": "We_AllFloatDownHere",
  "created": 1636497371,
  "updated": 1636655197,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "hjzw00g": {
      "link": "/r/college/comments/qqf85m/gen_ed_requirements_and_auditory_processing/hjzw00g/",
      "text": "I have auditory processing issues, so I also suck at languages. Fortunately my school offered Latin, which doesn't require speaking/listening skills, and I took it and passed. They also offered sign language, which should also do the trick for someone with auditory processing issues. \n\nI have known people who are deaf to get language requirements waived, but I don't know if they'd do the same for you. If your school doesn't have something like Latin or sign language, see if they're willing to allow you to take one of these types of languages at a school that does offer it and accept the credits. \n\nIn the end, you'll have to discuss it with disability services-- different schools have different rules and are more likely to work with students than other schools are.\n\nAlso, not all schools/majors require a language, so your worst case scenario might be to change majors or transfer, but you should certainly try the other routes first, of course.",
      "author": "HumanDrinkingTea",
      "created": 1636498500,
      "upvotes": 9,
      "replies": {}
    },
    "hk1bl1j": {
      "link": "/r/college/comments/qqf85m/gen_ed_requirements_and_auditory_processing/hk1bl1j/",
      "text": "they can alter the requirement or find a course that you can complete for the requirement, but i highly doubt they will eliminate it completely.",
      "author": "wobbletelescope",
      "created": 1636523295,
      "upvotes": 4,
      "replies": {}
    },
    "hjzy9u2": {
      "link": "/r/college/comments/qqf85m/gen_ed_requirements_and_auditory_processing/hjzy9u2/",
      "text": "I did this. They were receptive. You don't know until you try!!",
      "author": "castilina",
      "created": 1636499471,
      "upvotes": 1,
      "replies": {}
    }
  }
}