{
  "sid": "qw25eg",
  "link": "/r/college/comments/qw25eg/good_outofstate_transfer_schools/",
  "title:": "Good out-of-state transfer schools?",
  "text": "\nI’m in my freshman year at a community college in Florida but I want to transfer as a sophomore somewhere else (preferably out of state) however, I realized that most schools (especially prestigious ones) don’t give financial aid or scholarships to students out of state and/or transfers. I was always a good student but in high school (even though I had a 3.5 GPA UW and 4.3 weighted) I was rejected to all the universities I applied to (it was my fault because I applied to ones that were more prestigious like Ivy leagues, NYU, BU, etc.) and I had my senior year during the pandemic in Florida so I was not able to take the SATs or have extracurriculars since I was online the whole year. \n\nI still want to go to a “prestigious” university but I’m a first generation student with a family of 7 and living with a poor income. The reason I want out of state is because I dislike Florida and the reason I want to transfer now as a sophomore standing instead of junior standing is because as the oldest, I’m made to take care of my four younger siblings while being a full time college student and a part time worker at a warehouse. I’m tired and this is damaging my mental health so I want out of my house as soon as possible.\n\nI’m looking for any schools or opportunities/scholarships I can apply to so that I will be able to go to a good school out of state asap.\n\nI’m a business major but want to minor in psychology. I‘m still in the fall semester but as for now I have all As in my classes. I wanted to transfer to Boston University since it was my dream university back in high school but its very expensive and they don’t give financial aid to transfers and they have no scholarships for out of state. Please help me out :(",
  "author": "Downtown-Strategy-42",
  "created": 1637164126,
  "updated": 1637395010,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hl047xs": {
      "link": "/r/college/comments/qw25eg/good_outofstate_transfer_schools/hl047xs/",
      "text": "Florida is a huge state, you can always just go to a university a few hours away and get the same feeling of being away from home. If you're strapped for cash and don't have any scholarships to go to a prestigious private school like Boston University it wouldn't make much sense to pursue it. Tuition there is like $50k a year on top of whatever living expenses and books you're required to buy. \n\nThe glitz and glamor of a \"prestigious\" university go away the longer you're there unless if its a specific major with a famously excellent department for your major.",
      "author": "Sermos5",
      "created": 1637165997,
      "upvotes": 2,
      "replies": {}
    },
    "hl00mu0": {
      "link": "/r/college/comments/qw25eg/good_outofstate_transfer_schools/hl00mu0/",
      "text": "Temple University in Philly -  https://admissions.temple.edu/apply/transfer-students",
      "author": "templeufrank",
      "created": 1637164557,
      "upvotes": 1,
      "replies": {}
    },
    "hl028eq": {
      "link": "/r/college/comments/qw25eg/good_outofstate_transfer_schools/hl028eq/",
      "text": "nice",
      "author": "lerobinbot",
      "created": 1637165202,
      "upvotes": 1,
      "replies": {}
    },
    "hl0qzam": {
      "link": "/r/college/comments/qw25eg/good_outofstate_transfer_schools/hl0qzam/",
      "text": "I transferred to BU last semester and receive decent financial aid",
      "author": "Acrocane",
      "created": 1637174869,
      "upvotes": 1,
      "replies": {
        "hl12ubp": {
          "link": "/r/college/comments/qw25eg/good_outofstate_transfer_schools/hl12ubp/",
          "text": "Were you in-state or out-of-state?",
          "author": "Downtown-Strategy-42",
          "created": 1637179579,
          "upvotes": 1,
          "replies": {
            "hl18bqw": {
              "link": "/r/college/comments/qw25eg/good_outofstate_transfer_schools/hl18bqw/",
              "text": "Out of state from NY",
              "author": "Acrocane",
              "created": 1637181772,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}