{"sid": "h7ideg", "link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/", "title:": "I just graduated from high school. I’m barely starting college and I need advice. I don’t know how college stuff works.", "text": "okay guys so I have registered to a community college in my city. For fall 2020. I haven’t registered for my classes yet. I want to major in biology or chemistry. I currently work at a mcdonald’s close to my house and reason being is because it helps pay for college. I do graveyard on weekends and weekdays I go in at 3 pm. I never work in the mornings. \nI’m thinking if I work in the afternoons, I should go to school early in the morning (this college is pretty far from my house and I want to avoid traffic, you know typical lunch hour rushes)\nI live in the state of texas, and we are required to take some stupid exam called a TSI in sophomore year in high school. Math, Reading and Writing. I only passed writing and failed the other two. Its stupid because if you fail you have to take remedial classes and its a waste of money for classes you receive no credit for. Like why are you letting some exam that I took as a 16 yr old affect my college classes? \n\nI overthink. What if i’m too stressed? What if it gets in the way of my job? I need the money. What about my mental health? What if its too much homework? etc etc", "author": "arxbgxddess", "created": 1591958370, "retrieved": 1632948348, "over_18": false, "upvotes": 548, "upvote_ratio": 0.97, "comments": {"fuoae4t": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fuoae4t/", "text": "I’m about to graduate but when I started college I was literally in the exact same boat. I lived in a rural town about a 45 minute drive from my college, living at home, working full time at McDonald’s exactly like what you’re describing. Here are some bullet points I’d really recommend that worked for me:\n\n-\tDon’t be afraid to go down on hours. I don’t know how your McDonald’s is but at mine you only needed to average 15 hours a week to qualify for the Archways scholarship.\n-\tit’s fine to take the remedial classes. College isn’t a race, even though everyone is going to make you feel like it is.\n-\tIt’s okay to take less credits. You’ll hear about people taking 15 or 18+ credits a semester, that doesn’t have to be you. Just 9 or 12 credits is fine to help with the load.\n-\tDo not be afraid to eventually quit McDonalds. I understand that job can be a surprising amount of stress and can leave you exhausted. Keep the job in the beginning while the classes are easy but if you need to consider switching to an on-campus job that’s more flexible with your schedule and less exhausting. You’re commuting anyway, might as well make money while you’re in that town.\n\nIn the end I really want you to understand you can and should go at your own pace. That was a huge hurdle for me because I felt like I was slacking/falling behind/etc but all I did was push myself too hard for too long. You’ll get a better quality education and feel happier/healthier if you just take a breath and slow down. A good medium of 12 credits and 20-30 hours a week can put you on the path to graduating without much debt (if any at all) and less stress than trying to smash together 15+ credits and 40 hours.", "author": null, "created": 1592023179, "upvotes": 2}, "funm10c": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/funm10c/", "text": "Hi! I saw this post and being a college adviser, I wanted to give you some recommendations! \n\nSo to begin, you want to make sure some administrative work is completed this month! Here are some tasks to focus on:\n-send in your final high school transcript to your CC\n-set up your CC student portal \n-finalize any financial aid you may have been given\n-schedule orientation \n-take placement tests if needed\n\nEnrolling in college can be a lot of paper work and most of it is pretty easy BUT very forgettable. So it’s good to get it out of the way ASAP.\n\nYou bring up very valid concerns about work and school, and just general college anxieties. It’s important to recognize that while it will be challenging and stressful at times, it is doable! As a college student, you have to become an advocate for yourself and ask questions. You don’t need to develop relationships with every adult on campus but having one solid person you can go to will go a long way. \n\nIn terms of your specific work question, I recommend getting in touch with an academic adviser. In my experience, CC will make you meet with one at orientation. If that’s not the case, then you should contact admissions (email is fine) and ask who can help you plan your schedule. Once you get connected with an adviser, bring up your work schedule and figure out a plan to balance school and work! \n\nIn case you don’t know this, in college you typically take 15 credits a semester. So that is normally 4-5 classes. A typical schedule looks like 3 classes on MWF, and 2 classes on T/R (R means Thursday). Freshman fall is usually just gen Ed’s and remedial courses (if needed). As someone else mentioned, if you plan to transfer to a 4 year school, once you get in touch with an adviser, ask about “transfer agreements”. It might be easier to transfer to some schools if theirs is an agreement, and they might be able to show you exactly what classes to take at the CC so it will transfer to a 4 year school. \n\nHopefully that answered some of your questions and feel free to reach out with any other questions! I currently advise 200 students who will be attending college in the fall and they also have these exact questions so you are not alone and you are on the right path!", "author": "hcwhitma", "created": 1592007533, "upvotes": 2}, "fumyiiu": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumyiiu/", "text": "Make an appointment (or walk-in) at the advising office. An advisor will have you in and out the door in no time with a concrete plan. You'll have to take certain classes, and those classes will be offered at certain times per quarter. \n\nA few examples are: \nEnglish 101, DAILY 8:30am - 9:20am\n- This means you'll be in class every day during that time. \n\nMath 094, Hybrid, MW 12:15pm - 1:20pm\n- Hybrid means the class is partially online, meaning you'll have to be in class on Monday and Wednesday but the rest of the work can be done remotely. \n\nAccounting 121, REMOTE/ONLINE/ARRANGED\nThis means your coursework will be fully online. You'll still have deadlines every week and have to participate, but on your own time and whenever. \n\n*ZOOM classes ARE held at specific times, and are not the same as an online class. You'll have to be present at the time, on Zoom. My college is entirely remote through Fall quarter so we are offered Zoom classes in lieu of in person classes. \n\nNot every class is offered every quarter. Only a few classes you'll need for your program will be offered, and sometimes you'll struggle to find the right classes that fit with your work schedule. These quarters it would beneficial to do class online if possible. \n\nPro tip: College isn't as hard as people tell you. Get that idea out of your head and take your work as it is. I struggled so much my first couple quarters because I put so much unnecessary pressure on myself. \n\nPro tip 2: Your college will have tons of services available to you, use them if you need them and even if you don't. Apply for scholarships, join clubs, and utilize services and resources. My school has a food pantry, bus vouchers, store vouchers to use for books. If you ever feel backed into a corner, just talk to someone. They are there to help you and have tons of ways to do so that most people don't even realize. We have a counseling center with free mental health services, a women's center with free services for women, veterans center with free services for veterans. See what your school has to offer and use all the things you can. I wish I had done this, that's what those programs are there for, and I struggled a bit at the beginning when I really didn't need to. \n\nAlso, every school has a payment plan so get on that for tuition. \n\nOh, and in my state, every credit after 10 credits is half price. This means you can take 1 credit classes for only $50. My school has sports classes, yoga, fitness, dance, music, and art classes all for 1 or 2 credits. If you take something fun while you take the hard classes, it makes everything a whole lot better. Totally worth the extra $50 or so.", "author": "soomanytomatoes", "created": 1591994702, "upvotes": 2}, "fumx3dk": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumx3dk/", "text": "I’ll say this. Highschool was a breeze for me, honors, AP, the works. Thought college was going to be a beeeze just like highschool. I was wrong. I was able to skate by with the occasional A, Bs and majority Cs up until my sophomore year. Then it hit me. You can without a doubt just get by without trying too much, but it will pay dividends to put youre all into it and receive at minimum B+s and up in all classes. If you are not confident that you can put atleast 15 hours a week into school work and achieve good grades, I would highly suggest taking a semester or 2 off after highschool and grinding at your job;however, if you can manage work and school together without a doubt get into school.", "author": "checkyblecky", "created": 1591993979, "upvotes": 2}, "fumwymq": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumwymq/", "text": "Online classes!! \n\nSomething I did at community college was that I took some classes on campus that I knew would work with my schedule. And the other classes I took online. It allows you to work at your own pace and at your schedule. Teachers in online classes in my experience give students weekly assignments, and as long as it’s done by the end of the week you’re good. \n\nI would look into doing this when you register for your classes! Good luck!", "author": "abft59", "created": 1591993912, "upvotes": 2}, "fumv91s": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumv91s/", "text": "I live in Illinois, and I go to a community college. I just turned 20, and will be heading into my junior year. I would say picking a community college over a university was the best decision I made so far in my life. I would say before you choose your schedule, talk to a academic advisor. You typically do your major classes after your sophomore year, but I completed most of mine in my first 2 years simply because I knew that was the degree I wanted. If you know biology is 1000% what you want to do then you can also do you major classes ahead of schedule. Mainly for my 2 years my schedule started at about 9 or 10 and ended at like 3 or 4. This schedule I think will work good for you if you are able to make your classes lineup. Also i had to take a math placement test, I hate math. I failed and had to take one extra math class. If you fail do not feel ashamed. There were so many people in my math class that were much older than me. You got this, and if you feel overwhelmed or lost ask a counselor that is why they have a job. Also idk how your CC is but mines have a 3+1 program so all four years I take classes at the CC but the 4th year the professors from the university comes to the CC to teach the class and the other 3 I’m registered at the CC. That’s just for clarification because I know some people may be reading this, and be like how the hell did he take his major classes early at a CC lol.", "author": "Impossible-Pace", "created": 1591993047, "upvotes": 2}, "fumukxc": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumukxc/", "text": "I live in Texas as well and transferring to UH from CC. I worked my way through CC with a full-time job and depression. It’s hard work but definitely possible. What I did was take a combination of in person and online classes. I would take all of my in person classes on the same 2 days of the week, leaving the other 5 days to work. It was also easy for me to get all of my work done needed for class on the same days. You could then study on other days before your shift and nap midday before going in. I found it best to take  the online classes in subjects that I felt comfortable in and didn’t require a lab, such as history, english, math. Courses I knew would be intensive and hands on, I took in person. To manage my mental health, I didn’t take a lot of courses at once. 4 at the most. It takes longer to finish you degree of course, but know you will. I’ve never put my school and job over my mental health. When I needed to take a semester off or couldn’t handle as many courses, I did so. I graduated hs in 2016 and will now be transferring to uni. I wish all the best luck and success for you :) You can do it.", "author": "lbrownii", "created": 1591992710, "upvotes": 2}, "fumsrqx": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumsrqx/", "text": "Talk to advisors, state-by-state the rules for retesting abilities in college are different. I personally went to a not great HS and bombed the math portion of the SAT- if the reason you failed the math/science parts of the test is because you don’t know them well, remedial classes aren’t that bad. I had to take remedial math in community college and I actually learned a lot my HS never taught me. So it depends on your situation whether remedial classes are a waste of money or not. \nGood luck, most of my community college classes were pretty good quality and with the price- it makes a much better investment than going straight to university (unless you somehow get great scholarships).", "author": "annirosec", "created": 1591991815, "upvotes": 2}, "fumskxk": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumskxk/", "text": "My McDonalds pays for $2,500 towards college a year and it really helps. If you’re able to become a manager or an MIT you get more than that. Personally morning shifts work best for my school schedule but depending on when your classes are availible you may have to change your availability. Perhaps you can retake the tests or attempt to test out of classes to decrease the credit hours you’ll need.", "author": null, "created": 1591991724, "upvotes": 2}, "fumnepo": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumnepo/", "text": "You should be able to retake any sort of placement test to keep from taking remedial classes. I would strongly suggest only taking a couple of classes your first semester to see how it is. If the work load seems okay then maybe add another class the next semester. Beware that more the more credit hours a class is worth, the more often it meets and usually more homework is involved. I’ll be honest, working and going to college can be overwhelming, but as long as you don’t take too many credit hours you can manage it! Many of my friends in college worked at the same time and several of them just graduated! It’s definitely possible, you got this!", "author": "sunflowerpeony", "created": 1591989154, "upvotes": 2}, "fumjn0y": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumjn0y/", "text": "Hi! I'm currently a college student in Texas and have taken classes both at a CC and a state school here. My biggest piece of advise is talking to an advisor at whatever school you are going to.\n\nHave you already applied/been accepted to a school? You can probably make most any schedule work. Keep both work and school in mind, but try and plan out classes first, if you can. You might be able to take online classes too, one of my friends does that at UH VICTORIA. I would only reccomend doing online, if the format works for you and you can keep your self accountable.\n\nAlso, once you get settled in on school stuff, look at scholarship opportunities. They give out scholarships for many different things, like just being tall! \n\nAnother tidbit is to wait until class starts to see if you really need your textbook. Sometimes you can find them online, other times you are required to pay over $100 to just access homework via these textbooks. If you only need the book, look for deals. Try and buy used if you can.\n\nI hope this helps.", "author": "abbyabb", "created": 1591987267, "upvotes": 2}, "fumiavi": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumiavi/", "text": "Community college prof here. Here are some thoughts on this:\n\n1. Consider starting small. Instead of signing up for a full load, sign up for a class or two and see how it goes (or whatever the minimum is for financial aid, if you are using that).\n2. Developmental classes are ideally there to keep you from failing the required classes and then having to retake them. If you think that you genuinely have improved since you took the class in the subject area, consider talking to someone in advising about if there are other options or other tests you can take to place at this point.\n3. Any progress is better than no progress. Even if you just take a couple of developmental classes in the Fall (so that you don't overload yourself), you'll be further towards your goal than if you took nothing. If you keep doing a little at a time, you'll have graduated before you know it.\n4. And finally, for mental health. You'll want to ask at your CC, but many schools actually provide resources and counselors! So, you may have more mental health resources available to you than if you weren't in school. In general, students who make use of the services offered (tutoring, counseling, etc) do better and are more likely to finish. So, don't forget there's a whole network of people at any community college there to help you reach your goals.\n\nGood luck! :-)", "author": null, "created": 1591986596, "upvotes": 3}, "fumfedh": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumfedh/", "text": "First of all congrats fellow 2020 grad, we did it!!!! I killed the reading and writing section my junior year but couldn't pass math to save my life (the first time I literally got a 349), so I'm taking a basic math class. Thankfully my school (WT (go Buffs)) has two remedial math classes split by scores and my degree allows me to take both college algebra and intermediate algebra. I'd suggest taking the TSI again, and if you pass awesome if not buckle down and kill the classes.", "author": null, "created": 1591985135, "upvotes": 2}, "fume34m": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fume34m/", "text": "Getting to campus early is a good idea, because parking can be a hassle. What makes it worse is parking enforcement may give you tickets. That can be costly and discouraging. It is a good idea to spend extra time on campus in quiet places such as the library to go over your notes and find time to read. It’s also nice to make new friends and hang out in the student union or cafeteria. The whole college experience is a great thing, but make sure you do the requirements for each class. You may decide to drop some classes if you feel the workload is going to be too much, but you need to do that before the deadline that allows for a partial refund, or not have it affect your GPA.", "author": "armandoare", "created": 1591984539, "upvotes": 2}, "fumcz9p": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumcz9p/", "text": "I’m also in Texas. You should be able to take the TSI again. I would talk to the counselor at the school and see what your options are if you feel you shouldn’t be in remedial classes", "author": "Canadia_213", "created": 1591984047, "upvotes": 2}, "fumbpi2": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumbpi2/", "text": "Just some advice for college in general here. You should always show up to every single class, and always do the homework. If the homework is part of your final grade (which it is in most classes), it is an incredibly easy way to boost your grade. On the contrary, not doing it can mess up your grade really quickly. Finally, always follow the professor’s directions, and keep the syllabus handy. Hope this helps!", "author": "thefourthEG", "created": 1591983471, "upvotes": 2}, "fumbbgj": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumbbgj/", "text": "if you haven’t yet, try speaking to an advisor on campus. when i was registering for the first time last year they reached out and told me i had the option to retake the TSI or go into some remedial classes for the sections i didn’t pass. not sure if your campus will reach out to you too, but go ahead and ask around the time registration happens to sort things out and you can get a better idea on how your schedule will be and what classes you’ll have to take", "author": "summergem", "created": 1591983296, "upvotes": 2}, "fumb1js": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fumb1js/", "text": "The amount of homework depends on how many classes you're taking ( and what kind of classes), and of course yourself.  Usually homework in college gives you more than a day to turn it on ( or the next time you have that same exact class), unlike high school. I sometimes get a week to turn it in, but I highly do not recommend doing it at the last minute because it just builds up. If you build it up, it'll feel like a mountain full of homework.   \nAlso, I think what kind of professor you have changes the amount of homework. Some professor might do it with you during class periods and some other professor might make you do the same work at home. I highly recommend you to look at a website  [https://www.ratemyprofessors.com/](https://www.ratemyprofessors.com/)  to search your professors. Not all professors will be on the site, but I would say more than half of the professors will definitely be on there.\n\nIf it is overwhelming you, I would probably start with just two classes the first semester to just get the feel if it, and increase it to 3-4 the next semester.\n\nAlso talk to your counselor/ advisor if you can.\n\nYou got it. Good luck!", "author": "pineapple0223", "created": 1591983175, "upvotes": 2}, "fum7oro": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fum7oro/", "text": "You should be able to retake the TSI several times so I’d look into that if you don’t want to be stuck in remedial courses.", "author": "thedamfan", "created": 1591981617, "upvotes": 2}, "fum5fbj": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fum5fbj/", "text": "Look into the online classes they offer so you don’t have to drive to the campus often. Take one at first and see how it works out and once you get comfortable take more than one. Also, learn how to manage your time with work, school, and hobbies. Dedicate a certain amount of time each day for your classes. When I was your age I was leaving everything at the last minute stressing out.", "author": "GirthyBread", "created": 1591980517, "upvotes": 2}, "fum47cf": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fum47cf/", "text": "Real truth here. First, check with your CC to see if they have a placement test. Sometimes you can retake these tests and test out of the class. If you don't test out, just trust and accept that you need to take the class and that it is in your best interest for success in future classes. They have this system in place because they know from tons of data that if you are not at a certain level, you won't pass. The fact that it doesn't count toward your GPA is good, not bad; yes you have to pay for the class, but you are receiving value in return. You must reframe this to a positive, or you are at high risk for failure. If you have to take one of these classes and you spend the whole class with a negative vibe, you will struggle. I have experience with this!  Also, I'm gonna be honest, full time work and full time student is VERY DIFFICULT but not impossible. If you must work full time, I recommend part time student load to start and see how you do. You absolutely must make classes your top mental priority or you will struggle greatly. Think of it as #1 job and #2 job, #1 being school. If you harbor resentment and blame outside circumstances, you will struggle greatly. There will be a lot of homework, but there is also tutoring and help at your school. Number one is communication with your professors and taking 100% responsibility for your performance. It's good that you are preparing yourself for this now and asking the right questions. You can do it, but the biggest help will be a positive, growth-oriented mindset.", "author": "i_m_mary", "created": 1591979967, "upvotes": 2}, "fum1ik2": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fum1ik2/", "text": "Best part about CC is that it’s cheap and gives you credits. You’re going to your pre-requisite classes first. Basically two years of repeating bullshit classes from high school before you apply to go into the major you want to be in.", "author": "ExpiredPilot", "created": 1591979017, "upvotes": 2}, "fum15ik": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fum15ik/", "text": "I’m not sure if this is related to your situation, but here’s some really basic college advice if you’re confused on where to start. \n\n1. Figure out your college major and plan for obtaining your associates degree for transfer to a 4 year. \n\nIf you are undecided, try knocking out some of your gen-ed requirements in your first semester. My community college lists a detailed pathway for each major on their website, providing a scheduled class plan for each semester. If you still need help figuring out which classes to take, please visit your college’s counseling department. Make an appointment ASAP; they are always busy. \n\n2. Keep your registration date in mind. \n\nNormally when you apply, they give you a registration date. This date and time is when you register for classes, so have your class schedule ready before then. Some colleges let you register online or in person, but I suggest doing it online because it was faster for me imo. Remember seats fill up fast, and you really don’t want to be on a waitlist. \n\nThe college will also have a class list available before registration stating all the classes and the professors who will be teaching for those classes. Use rate my professor to avoid getting shitty professors. This part will be vital to your success in that class, so please plan  your class schedule ahead. \n\n3. Find programs to join. \n\nI’m not sure if your college is doing in person lectures (my college will only being holding online lectures due to COVID), but normally there is a specific date for something called club rush. Club rush is just like how it is in the name lol, they pretty much set a date and time where you can sign up for different clubs. \n\nSince my CC isn’t really having any club rush, I decided to join a few programs. It still may not be late for you to do too. I joined the honors program, which is pretty much like the college version of AP classes. Taking honors classes shows that you can handle the rigor of universities, and looks good to universities you want to transfer to. They also provide you with many transfer resources as well as research opportunities to showcase your abilities as a scholar. Some universities might even have agreements with your college’s honors program that allows for priority consideration for transferring to their university. \n\nSome other programs that you might be interested in are Puente, UMOJA, Student Exchange Program, Student Body, etc. \n\nThey might even have work programs that can set you up with a job at the college. This is easier bc after work you can go straight to class or vise versa. Normally these jobs include working at the front office or maybe working the lunch line. These programs normally can promise you a guaranteed set of hours you can work for the week. \n\n4. Buy/Rent Used Textbooks\n\nCollege textbooks can be expensive. When you get your class syllabus, it has the name of the textbook you need for the class. You can buy off of used bookstore sites (Amazon, thriftbooks, etc.) or you can buy from people who have already taken the class before. If you look up your college on Facebook, you may find that some students may have created Facebook groups to sell their old books to new students taking the class. You can also try checking out the textbook from your college library. Normally these are gone pretty fast, but it’s worth a shot. \n\n5. Sucking up to Professors through Office Hours (especially for the LORs lmao)\n\nAlways try to be in good kahoots with your professor. Professors have so many students, so they may not even know your name. Always try to drop a “Good morning” here or a “How are you doing today?” there. \nIn addition, professors love when students attend their office hours, especially when you seem to have a strong interest in their subject. Office Hours is always good too if you need help in a subject. But anyways, if you are good to your professor, it may be helpful in getting LORs (letters of recommendation) especially if your transferring to a more prestigious school. \n\n6. Invest in a IPad for Better Notes\n\nI hate carrying ten notebooks for each subject. Buying an ipad with the Apple Pencil was one of the best things I have done for my notes. Two great apps for taking notes are good notes and notability. These apps provide many features to make note taking more efficient. There’s videos all over yt explaining the features of these apps so you might wanna check those out. \n\n7. CLEP Exams Can Save You Time & $$$\n\nCLEP test stands for College-Level Examination Program. Instead of taking a class for a whole semester you can have the option to test out of it. A CLEP is a test that measures how much you know about certain academic subjects. You can earn college credits by getting a qualifying score on their CLEPs. This is a great way to test out of some of your gen-ed and save some money. Tests and testing site fees would normally be like around $200, but with modern states it can be free. Modern States is a website that offers free exam prep and even pays for your exam and fees! You can also find other exam prep online for free as well. \n\nThousands of colleges and universities accept CLEP test scores (which are administered by the College Board). Most likely your community college will accept it, but they normally cap out around 30isb credits. In addition, make sure the university your transferring to can accept it too. \n\n\nAnd thats about it! This took me a while to type out, so I really hope it helps. Anyways, good luck on your college journey :)", "author": null, "created": 1591978878, "upvotes": 2}, "fulyg42": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulyg42/", "text": "Most colleges will waive the TSI requirement for a high enough SAT/ACT score - check their website for that policy. Also, you should be able to retake it now given that it was last taken a while ago.", "author": "aruneswara", "created": 1591977587, "upvotes": 3}, "fulxvx7": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulxvx7/", "text": "I'm also in Texas and I am also majoring in biology. \n\nMy tip to you would be to learn how to study. \nWatch YouTube videos on how to take notes and effective studying techniques. \n\nYou WILL WANT TO PRESRUDY FOR THE CLASSES YOU WANT TO TAKE THIS FALL. \nEspecially math. STUDY YOUR MATH, MATH IS THE BIGGEST HEADACHE EVER\n\nMy school posts all previous syllabi so I can easily just look at the syllabus and download the textbook and read ahead of time, that's my advice", "author": "CorrodedRose", "created": 1591977360, "upvotes": 3}, "fulwg02": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulwg02/", "text": "I'm going to be honest with you here:\n\nYour habits as a high school student reflect perfectly how college will go for you.  If you can't pass high school Math and basic Reading exams; remedial classes are the least of your worries.  You need to toss Biology and Chemistry right out the window.  I was an honors & AP English, Biology, and History high school student.  However, very weak in Math.  I started out in pre-Nursing and it kicked my butt for my first degree (graduated with Mortuary Science instead), then tried Biology for my second (graduated with a BS in Business).  The level of Math they both require and high school Biology/Anatomy knowledge is insane.\n\nYou may not like remedial classes, but they are necessary if you can't grasp the material quick enough, have testing anxiety, or feel you didn't have the best instruction in high school.  I'm glad I was encouraged to take them in Math because it provided the foundation I needed to get up to speed.  You either have to take them, or get super serious about studying and adjust your study habits.  You literally have no other choice if you want any kind of degree.", "author": "xmarketladyx", "created": 1591976768, "upvotes": 1}, "fulvxxx": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulvxxx/", "text": "Do you cook or cashier at McDonald’s? I would highly suggest getting a different restaurant job, like at a nice sit down restaurant. If you think you could be a server that is 100% the move. The best shifts are in the evenings and on weekends, which is why it’s perfect for students. I’d guess in Texas, servers make $18 - $20 and hour at any popular restaurant, if not more. I had to support myself through college and I would never have been able to go to school and afford to pay my bills without getting into the industry.", "author": "yeehawsharknado", "created": 1591976565, "upvotes": 2}, "fulu7y3": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulu7y3/", "text": "I live in Texas too. You can take the exam until you pass it I think.", "author": "Alpha_0ne", "created": 1591975841, "upvotes": 2}, "fulth2e": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulth2e/", "text": "I'm not sure how it is in CC in Texas, but I live in MD and when I started CC, I could take a placement exam. I also didn't take SAT or anything, so maybe that has to do with it. You should check in with the counselors to see if you can do anything like that.\n\nI'll be honest with you, your first semester might be rough. And I mean it *might* be, which doesn't mean it will be the case for you. This is just coming from my personal experience. The structure is so different from high school. In high school, I was one of those students that just floated by with good grades in a few classes but very average in all others. With that attitude in CC, I failed all of my classes. And I mean literally failed. I didn't know what I wanted to major in, and treated classes like something I could put minimal effort into and still do okay. Don't fall into this trap! The next semester I pulled myself together and managed to raise my GPA by a whole lot, but that first semester was a wake-up call. It can be tempting to put things off or skip a few classes, but make sure you put as much effort as you can into your school work. \n\nIn terms of your mental health, please look out for yourself and notice how you're feeling. College can be a little overwhelming, but it's often completely do-able. Do you enjoy school in general? Studying could be something that can help you de-stress, as weird as it sounds. And build a network of people who will support you and talk with you when you need it. If you end up needing a professional (which I did throughout my whole college career), seek them out. There's absolutely nothing wrong with seeing a therapist. They might even have school therapists in your CC that could help.\n\nHave you looked into financial aid? That might help a lot with making college more affordable and allowing you to work less to adjust to your school schedule.\n\nI swear I'm not trying to freak you out! I think you've got this a lot more than you think you do. When you start to overthink, just take a step back and think of the reality of it instead of all the problems you think you'll face. And once you start school, you can adapt to your new life as a college student since you'll know how your experience will really be. I hope this helps, even if only a little bit!", "author": "Pink_alpaca13", "created": 1591975534, "upvotes": 10}, "fult8v4": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fult8v4/", "text": "Sounds like you're more just worried about your school/work balance than general college stuff. I personally found anything over 20 hours a week to be disruptive to my homework and classes. I'd recommend trying to get something that pays a bit better so you can afford to cut back on your hours more. I'm assuming you don't make much because McDonald's infamously underpays their workers. You could make significantly more working in a sit-down restaurant as a food runner or busser maybe, where you'd get tipped out. Many restaurants will give you the option of working up to a serving position as well, which is where the really good money is. But just take a breath and remember you're doing the best you can and that's all you can ask of yourself. It'll work out", "author": "atheistart3mis", "created": 1591975444, "upvotes": 4}, "fulsw62": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulsw62/", "text": "Some would argue to avoid college, for now, to have some savings in place before entering college so you can have some kind of safety net (and more work experience if college does not work out because that is a possibility and any accumulated debt ). And then some would argue you dont need college anymore, or at least college does not seem that necessary in many cases. Only for specialized positions that require a degree (duh). Some employers care more for experienced candidates than your academic background to say the least.\n\nIts great to see you have an idea of what major you will purse, but the question is how will the job market be by the time you graduate? Both of the subjects you mentioned are very difficult in academia, lots of HW, and have few positions in the job market to begin with. You'll be competing against the other hundreds of students with the same major(s) for a handful of jobs. Im not saying dont do it, im saying think about it carefully. It sounds like you are in a rush by the many questions you asked and you won't have a good time in college by doing that. May continue working so you can have some money on the side. START INVESTING FOR GODS SAKE, start small though ($100). That way you can see how the market works and how you make money from investing. \n\nFor the most part, you should try to answer your own questions. You sounds too stress by your own words but I can't be the judge of that. It will get in the way of your job but still doable, hopefully your employer is willing to work with your school schedule. Mental health? What is that? Any subject in STEM has a lot of HW so there's that. \n\nAnd you answered your own question about why you had to take those dumb tests in the beginning. Its because many students forget what they have learned in HS and will have a BAD time if they were just placed at college level courses. In california, at least where i live, they passed a bill that allows students to place into college level courses and many struggled to keep up. Especially in mathematics and so they dropped the classes and had to start relearning fundamentals again. \n\nI swear, we need to change how schooling is done. Its so inefficient. I think it does more harm than good now, imo.", "author": "eatright909", "created": 1591975267, "upvotes": 2}, "fulsjf3": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulsjf3/", "text": "At the community college, are you just taking classes or getting the associates degree? In the second case, you’ll likely get an associates in arts, and transfer to a 4 year school. With the entire degree, everything is wrapped up and transferred nicely. You have decide what you’re doing there, and then also get set up for biology and chemistry if one of those is your major later. You have a lot to do before you need to worry too much about which classes you’re taking. Just do whatever your advisor suggests for your first semester. Take a it slow getting into it", "author": "Bekah_grace96", "created": 1591975095, "upvotes": 3}, "fulrp4d": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulrp4d/", "text": "You’ve still got all summer to get things straightened out so don’t give yourself too much anxiety just yet. But! It’s good that you’re trying to start now. I agree with everyone recommend starting with a counselor at the college you’re going to. They’ll know how to best help you. If you have a bad experience with one, make another appointment but with someone else in their office (that’s totally okay). They may also be able to help you find employment on campus to make your life easier. You should also visit financial aid (through the school) to find out if you can get any grants or scholarships!\n\nEdit: RANT - the standardized test you mentioned is probably fucking bullshit. Most of them are. Don’t let it shape the idea of your future, that shit is wide open baby! Chemistry is awesome, it’s my degree too! You’re going to achieve whatever you truly prioritize and work toward. GPA starts over in college and you have a totally fresh start. Make the most of it, work hard, and you’re going to be a superstar 💫", "author": "hellyabruther", "created": 1591974770, "upvotes": 4}, "fulr7pi": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulr7pi/", "text": "Literally like high school but with independence. You are going to have to begin making decisions on your own and that’s what will overwhelm you. So much responsibility but it’ll build you up into a more defined person than who you currently are. It’ll be easy if you focus and set your priorities straight. Also, YOU CAN STILL HAVE FUN AND GET GOOD GRADES!", "author": "thispostisaboutyou2", "created": 1591974586, "upvotes": 3}, "fulqwnc": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulqwnc/", "text": "What I’ve done though out my past few years in college is schedule all of my classes for two days a week, either MW or TR and work on my off days. This way, I’m still available to work 4-5 days a week and can devote 100% of my school time to school.", "author": "theoreticalpigeon", "created": 1591974475, "upvotes": 6}, "fulq5wf": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulq5wf/", "text": "Work 3 days a week, school 4 days a week. For me, 17 hours a week is the max I can work without seeing a negative response in my grades. the 4 days of school includes time for studying, papers, homework etc. I’ve done this motto and I’m a junior and I have a 4.0 GPA", "author": "DarkHumor258", "created": 1591974197, "upvotes": 4}, "fulp6ul": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulp6ul/", "text": "You could take placements tests at the cc.", "author": "Odin16596", "created": 1591973695, "upvotes": 8}, "fulosgx": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulosgx/", "text": "Think of how many classes you had to take in a semester in high school. In college you have more flexibility. As you are a commuter student, I suggest maybe starting out with just 2 classes and see how you adjust to that. \n\nAs for why did you score affect your college classes, its because it shows those concepts might not come as easy for you so the college wants to ensure you learn and are successful. (My son got a D in chemistry in high school, his tech school automatically put him in the \"remedial\" chemistry class and it counted towards his required course for his degree). \n\nIt will be very hard to take a full course load and work full time. Thus if you have to work a set amount of hours, you will need to stretch out your college timeline accordingly.", "author": "RNProfMom", "created": 1591973490, "upvotes": 22}, "fulo0tv": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulo0tv/", "text": "If you took the TSI in highschool then you should be able to retake it now. If you fail three times you will have to do the remedial classes. I am also from Texas and i went to LSC then transferred to UH. Pm if you want some specific advice or someone to talk to.", "author": "what2d0i", "created": 1591973083, "upvotes": 75}, "fulnz63": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulnz63/", "text": "Try to plan ahead and look at the degree requirements for the four-year University you'll be finishing up at. That should give you an idea of what classes your going to want to take at CC.", "author": "casual-captain", "created": 1591973059, "upvotes": 14}, "fulnet0": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/fulnet0/", "text": "You might have to change your work hours slightly to fit with your commute. For example most days I would work 4-11 or 5-11, and go to school 8-3 or 9-4. But it’s definitely doable. You have a work schedule that already fits around most class times", "author": "crystalliite", "created": 1591972759, "upvotes": 42}, "ful3o56": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/ful3o56/", "text": "Have you spoken to any of the counselors at the CC? In California we have placement tests for Math and English and depending on how you do, you will be put into the correct math and english class for your level. And with your work schedule, maybe start with a few Gen Eds which you can take online (English, humanities, social sciences are all good to take online) and see how you go from there.", "author": "calidora5678", "created": 1591959314, "upvotes": 191}, "ful39us": {"link": "/r/college/comments/h7ideg/i_just_graduated_from_high_school_im_barely/ful39us/", "text": "[deleted]", "author": null, "created": 1591958950, "upvotes": 15}}}