{"sid": "iq7t55", "link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/", "title:": "Does anyone else feel as if they can't keep up with their professors this semester?", "text": "College has always been fast paced, I know. But this semester especially, I can't keep with my Professor at all.\n\nHis synchronous classes are just him experiencing technical issues and just showing videos. He's not really teaching. We'd be better off just watching the videos if he just posted the links on blackboard and told us what pages to read.\n\nAnd then his asynchronous class is him speeding through the entirety of what we were suppose to learn on the previous class + today.\n\nAm I just complaining over nothing? Yes I should be productive instead of writing this. I already work twice as hard to even stay up to date with my classes in general every semester, but now I feel like I'm working 10 times as hard. \n\nBeing basically forced to teach myself with the textbook, and needing to attend his lectures which are just a collection of YouTube videos that he doesn't even cite thus making me having to take time to archive them myself for later studies", "author": "CandleEmpress", "created": 1599758558, "retrieved": 1632947017, "over_18": false, "upvotes": 1808, "upvote_ratio": 0.99, "comments": {"gaky82u": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/gaky82u/", "text": "Dont you read the textbook and do homework outside of class anyways? STOP COMPLAINING!!!! I agree the synchronous and other stuff are annoying but stop complaining about the homework! you have to do them at home after class anyways!", "author": "GrapefruitOk4660", "created": 1604045713, "upvotes": 1}, "g5eu0jw": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g5eu0jw/", "text": "I totally feel you. Something I've been noticing is that professors are so desperate for students to come to class they are actively trying to make it difficult to access the material if you don't come. Despite the fact that the professor takes a video of each class, she won't distribute the recording unless a student has a written note from a prof! Why do that, why not just make the recordings accessible?", "author": "pinkpostcards", "created": 1600209313, "upvotes": 1}, "g4xpj5n": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4xpj5n/", "text": "Yeah also some professors seem to think that since they are decided to just upload video lectures that they don't have to adhere to a time restriction like normal (despite the class being listed as synchronous they don't do live lectures). So the 1 hour 15 minutes course I signed up for twice a week has almost 4 hours of video lectures posted each week when it should be at most 2 1/2 hours. Just because a prof isn't doing live lectures doesn't mean they should be allowed to upload more content then their allotted time. Its not fair for us to have to do more than what we signed up for, some of us have jobs and other responsibilities and other classes. I could use those extra hours to study for other classes and all that extra material they now suddenly \"have time to teach\" isn't differentiated from the usual material so I feel like I have much more info to review for tests than I should. Some profs have no consideration, if you're going to upload more content then you're supposed to at least differentiate what is important test material and what is just extra material that you want to talk about.", "author": "JayAggRev", "created": 1599923545, "upvotes": 1}, "g4xmi8d": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4xmi8d/", "text": "I definitely feel this. Last semester online in the spring was way better than this semester. All what most of my professors are doing is recording or hosting lectures. Other than that they are just grading a few written assignments. Most other assignments and activities are online assessments from the lectures and readings. Last semester I had discussions and other fun activities that I actually learned from. This semester it’s just lectures where no one else speaks but the professors, followed by an exam or quiz and the occasional essay. Professors don’t do much, and they just steam roll us with their daily loads of work.", "author": "ElBarro69", "created": 1599922106, "upvotes": 1}, "g4vmkd1": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4vmkd1/", "text": "We live in a weird time, so the answer is very likely yes, but I would encourage you to look on the bright side. Honestly, college is pretty pointless for many degrees. You learn the basic shit that will get your body into an interview and thats about it. The rest of your life will require you learn how to teach yourself everything and, even though it sucks, this semester will do far more good for you than any previous semester because you have to hone that skill. If you don't learn that skill and you are in a degree like CS then you know you will probably still be able to get a mediocre job, but you will never go beyond mediocre. If you aren't in a great job market like CS and don't learn that skill, good luck.", "author": "Region_Many", "created": 1599866882, "upvotes": 1}, "g4v4ot8": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4v4ot8/", "text": "I’m struggling because I don’t feel like I learn anything with the online lectures that are posted. I only have one class that has a requirement to meet for half an hour for a group discussion. I learn better in person, or reading and my professors don’t close caption their lectures. It’s difficult to keep up.", "author": "TheUnimportant", "created": 1599857908, "upvotes": 1}, "g4uoldn": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4uoldn/", "text": "Oh my god, I feel like I’m drowning. I have like 3 quizzes every week over the 1-2 chapters we have to learn each week (each chapter roughly 30 pages of super dry material, i have 3 classes, basically 6-7 chapters a week) 3 lab assignments every week + homework + discussions + 2 end of semester projects\n\nIt’s getting really overwhelming really quick. I spend all my time reading the chapters and taking notes for each class, I hardly find the time to be able to re-read those notes due to all the other extra stuff before the test shows up.\n\nI can hardly retain what I’m learning because I’m trying to keep my grades up rather than understand the material.\n\nAnd the professors are just like “Theses are hard times for everyone...Anyways, quiz 4, lab 4, and homework 3 is due tonight at 11:30pm and the test is tomorrow. Have a good weekend.” \n\nLike I feel like I’m complaining so much but I literally am having trouble staying on top right now. I’m also a senior.", "author": "neversleepingever", "created": 1599850749, "upvotes": 2}, "g4u2971": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4u2971/", "text": "As someone who has had to do nearly the entirety of my last 3 years of school online, I have one thing to say...\n\nAs much as it sucks, there is great merit to learning how to teach yourself. It usually involves having access to answer keys for problems (prof should give them to you after the homework isn’t due).\n\nWalking through the process for many problems enough times will really drive the points home that a teacher in person otherwise may have done. \n\nAs for the lame YouTube videos. If they aren’t helpful, maybe work on homework during class and count on the true learning being on your own time.", "author": "Wittyjesus", "created": 1599839829, "upvotes": 3}, "g4td5at": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4td5at/", "text": "One class is syncrhonous/asynchronous. You have to know what we're doing this week. \n\nOne class is hybrid, so we're supposed to meet MWF. Every other day we meet is in person on campus. Plus we have to use a different platform to do the readings.\n\nAnother class, completely asynchronous. Except it's LAW, so professor has powerpoints with voice overs.\n\nOne more class, synchronous. But you had to choose to attend either t/th. And the way the assignments are listed are so hard to understand. I've missed 3 already. \n\n\n\nSorry for the rant. I just completely understand how you feel. I'm getting so lost and all I do is work now. I also work from home full time. It's been brutal. But keep hanging on, don't think about the struggle now, think about what you will have achieved 20 years from now.", "author": "billysus", "created": 1599825401, "upvotes": 2}, "g4t6zci": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4t6zci/", "text": "Yep I totally feel this. I have a biology test on 7 chapters next week... all contain dense material and tons of new terms. I’ve been studying 10 hours a day this week everyday and I still think I will fail.", "author": "lovingtolive", "created": 1599819635, "upvotes": 1}, "g4t32zn": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4t32zn/", "text": "I stopped trying to even watch half the lectures. It’s pointless anyways and I’m wasting my time", "author": "ToxicColeslaw", "created": 1599815281, "upvotes": 0}, "g4t2m0w": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4t2m0w/", "text": "I’m in the same boat. First day of class on zoom, my physics 1 professor just started writing down formulas and (what seemed like) random numbers. No introduction to the topic(s), no definitions. His handwriting is awful!! Everything is just so unclear. I’m struggling because I feel like I need someone to explain the material to me in order for me to understand. Teaching myself just isn’t enough especially for physics. I am currently searching for a tutor though. \nAlso, I have so many assignments, and I’m still (grateful to be) working during all of this. Just so beyond overwhelmed", "author": "sassycatinahat", "created": 1599814740, "upvotes": 1}, "g4t234v": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4t234v/", "text": ">Am I just complaining over nothing? Yes I should be productive instead of writing this.\n\nComplaining is productive always. Getting something that's bothering you off your chest is good for your mental health, at the bare minimum", "author": null, "created": 1599814149, "upvotes": 1}, "g4t14zu": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4t14zu/", "text": "Yeah. One of my professors (for my capstone internship course, no less) is terrible at concise clarity in assignments and that combined with the online format is making me want to bang my head against the wall. I feel like this semester is a damn hamster wheel and it’s pissing me off. I hate being a senior during a global pandemic.", "author": "binarystar45", "created": 1599813077, "upvotes": 1}, "g4szfcv": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4szfcv/", "text": "I'm not struggling with the workload, but I am having a difficult time keeping track of due dates and such. I feel like two out of four of my classes are behind and unorganized.", "author": null, "created": 1599811164, "upvotes": 1}, "g4ssty7": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4ssty7/", "text": "Me with you. But I was that way even before the online classes period..\nclass start-listen to the prof. like 5 minutes-start to drift away-highlight some important points. \nBut there are professors who can keep me focused for 45 minutes. So I’d say it’s the prof. to blame hahaha, they are not interesting enough. And I guess some blackboard writing could help keep up with the teacher. Though few teachers will make notes when they are online…All in all, online class sucks", "author": "HoshinoHakumei", "created": 1599804699, "upvotes": 1}, "g4son7a": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4son7a/", "text": "Yes", "author": "JazzlikeSpinach3", "created": 1599801223, "upvotes": 1}, "g4soj0i": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4soj0i/", "text": "Same...one class I have, the professor is behind and I guess she rushed through the slides thinking we already went through them, and nobody wanted to speak up. She spends the rest of the time rambling about the things that aren’t in the chapter we’re talking about. So I had to spend two hours, and still have to go through the slides slowly on my own, because the slides have things not in the chapter too", "author": "fullofregrets2009", "created": 1599801132, "upvotes": 1}, "g4soihz": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4soihz/", "text": "Real talk me here.  How many hours of outside of lecture work is expected per credit hour in the before times and now?  I find it really easy to fall behind, but maybe I'm just not managing expectations accurately?", "author": "WriggleNightbug", "created": 1599801121, "upvotes": 1}, "g4sj2lg": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4sj2lg/", "text": "I get a lot of \"make sure you read this before class and watch my videos beforehand\". Then I attend class, and they assign a bunch of homework because of all the time I have at home..", "author": "M1A1Death", "created": 1599797165, "upvotes": 3}, "g4sj0jv": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4sj0jv/", "text": "My math and microecon classes are both like this. Prof thinks that just writing the equation then doing example after example is actually learning", "author": "DrPorkchopES", "created": 1599797127, "upvotes": 1}, "g4sizud": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4sizud/", "text": "YES. god, i feel like i am barely keeping up despite being on track for all of my classes.", "author": "meetmeinVienna", "created": 1599797114, "upvotes": 1}, "g4siw1g": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4siw1g/", "text": "I’m in high school and I totally understand what you’re saying. I literally feel like I’m drowning rn. It’s exhausting. I can only imagine how bad it is for you when I’m only in high school and it’s already taking a toll on me and rn we’re still in the slow phase. The big assignments and tests will start rolling in very soon", "author": "VTDMAN7", "created": 1599797041, "upvotes": 1}, "g4shnr6": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4shnr6/", "text": "I totally feel this! My school removed all breaks so that we ended the semester on November 20th and we’d limit student travel that way. Now it feels like everything flies by! I mean seriously... I think the 3rd week of september is the halfway point for my school. HALF WAY!!! I mean we usually go into the second week of december with finals... this is NUTS", "author": "kenziestardust", "created": 1599796238, "upvotes": 1}, "g4shlot": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4shlot/", "text": "I am on the other side of this - and you are spot on. Most Profs were so unprepared for this. I believe students in your position are having the hardest time - because you are a good student who cars and wants to learn. That’s why you enrolled! It sucks that this is the best we have come up with for you. My first thought is that your professor goes off the rails without a live audience who, if they were there, they might get a sense that they were moving too fast to be effective. I’d see if you can meet with your professor during office hours. If they care about education, they will appreciate the feedback.", "author": "Vintage_IKEA1918", "created": 1599796202, "upvotes": 1}, "g4shcxo": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4shcxo/", "text": "Felt this so much. I’m learning more from YouTube than the class.", "author": "lexiroseof", "created": 1599796046, "upvotes": 1}, "g4sf96t": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4sf96t/", "text": "I feel like I'm not keeping up at all because apparently I don't know how Canvas works and I keep missing deadlines because they don't show up in the assignments tab until I miss them... For some reason. \n\nAnd then my home life is pretty hectic so I can't concentrate in lectures, so I get into the mentality of \"Oh, I'll just watch the lecture later\" and I *never* do. \n\nSo now I got two test coming right up next week, and I have no idea what I've been learning for the past like.. month.", "author": "NoodleEmpress", "created": 1599794737, "upvotes": 1}, "g4scvtc": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4scvtc/", "text": "I totally agree w you! Most of my classes are asynchronous but two decided to have synchronized class. The only 2 class that’s actually helping and does the Backboard Collaborate thing correctly is my Marketing Professor and my African History classes that is on top because even though he emails us constantly since he doesn’t do BB Collaborate or zoom he keeps us updated with all the due dates. \n\nMeanwhile my other Textile and another History not so much... I bought the textile kit thinking we need it bc she made us to buy it but we’re not even doing anything in the class.\n\nAnyways, lmao i’m rambling i’m sorry lol. Obviously I like the in class version better but maintaining 4 classes and online is a lot of work and i’m getting less weeks because of due dates and amount of papers due. \n\nIt barely even started, I mean it’s been 1 week and half ish and I’m mentally exhausted and keep in mind that we have 3 more months....", "author": "kwonbh", "created": 1599793334, "upvotes": 1}, "g4sajeb": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4sajeb/", "text": "I think I'm taking hard classes and having difficulty finding cohesion between in person and online classes. This semester is going to take the most dedication ever. I'm going to switch to full online. \n\nSpreadsheet analytics \nMicro econ\nStatistics\nAccounting\nAbnormal psych", "author": "bendadestroyer", "created": 1599792032, "upvotes": 2}, "g4s6ksv": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4s6ksv/", "text": "I hate online. Im literally failing at least one class literally *just* because of the stupid fucking website my school uses.", "author": "deprimada", "created": 1599789894, "upvotes": 1}, "g4s3l51": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4s3l51/", "text": "All my professors seems to just be zooming (lol) through the material. Its kinda scary how fast they go and never slow down when we ask them too. I just watch live without notes and then do them by myself later", "author": "fitzthetantrum", "created": 1599788338, "upvotes": 2}, "g4s04wn": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4s04wn/", "text": "I have one professor who was MIA for the first week of class, then sent us one announcement to tell us to do the assignments on Canvas. No lectures, no Zoom meetings, just reading the instructions for the assignments and doing them by the end of the week. Granted, it's not a difficult class, but I can't believe I'm paying this much money to just do homework.\n\nAlso I have another professor who actually teaches this class in an online setting normally, but she's probably the least accommodating professor out of all of the ones I have this semester. We just had a big storm that caused major power outages in my area that lasted for a few days and I simply emailed asking for an extension on the assignment that was due, since I couldn't use my computer and had limited phone battery, and she told me no because I would be \"missing out on student interaction\" because it was a discussion board. I luckily got my power back the day it was due, but I was pretty pissed regardless.", "author": "Curiositea_", "created": 1599786512, "upvotes": 3}, "g4rvjv8": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4rvjv8/", "text": "it's somehow the second week already and I feel like I'm so behinddd", "author": null, "created": 1599784097, "upvotes": 3}, "g4rup3d": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4rup3d/", "text": "We do modules instead of semesters. 8 weeks covering this stuff before moving on to the next. First module after states shutdown, they front loaded all the tests in the first 4 weeks of the module. We lost 10 people in a 40 person class, *just* on test grades, before anything else is even taken into account. It's been rough.", "author": "Beanakin", "created": 1599783659, "upvotes": 3}, "g4rr6cf": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4rr6cf/", "text": "They are the smartest people in the zoom meeting but the dumbest people when it comes to technology", "author": "International_Army43", "created": 1599781741, "upvotes": 6}, "g4ro5pq": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4ro5pq/", "text": "God I feel this so much. I’m taking Organic Chemistry and I picked a specific Professor because of his reviews. Now that we’re taking hybrid classes I feel so lost. He doesn’t really teach anything on his Zoom meetings, and will tell us to watch his videos which are just the same thing but he has less distractions. I’m *very* close to dropping out because I feel like a failure.", "author": "QueenLatifahClone", "created": 1599780281, "upvotes": 5}, "g4rlwqs": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4rlwqs/", "text": "One of my professors decided it would be a great idea to assign 3 homework assignments and 2 quizzes in one day. Granted, we have a week to do them, but I also have to juggle 3 other classes that have assignments due that day as well...", "author": "kakokapolei", "created": 1599779035, "upvotes": 9}, "g4rkxd8": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4rkxd8/", "text": "Agreed. I don’t mind reading the text to learn but absolutely /none/ of my psych courses have recorded lectures or anything of the sort, which is the best way for me to learn. On top of that doing discussion board posts feel unnatural and awkward and I feel consistently behind even though I’m technically not? I’m slowly adjusting, but I had a minor meltdown the other night because it felt like the expectations for students were raised instead of understanding this is an unprecedented situation. Sorry this is super ramble-I but yeah.", "author": "RollingScone93", "created": 1599778600, "upvotes": 6}, "g4rk4jv": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4rk4jv/", "text": "I have 5 classes this semester. One of my professors never posted the book we needed, so we asked her what to do since we had a quiz on the first chapter. She said we’d be fine with just the lectures until we can get the books. She did not upload any lectures and did not upload anything again until the end of the 2nd week. Now I’m trying to catch up for 3 weeks worth of her class and also stay on top of my other classes. I’ve never been so stressed with school, and we just started 😭😭", "author": "MariasGalactic", "created": 1599778206, "upvotes": 7}, "g4rhvcp": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4rhvcp/", "text": "I’ve been teaching myself this whole semester too and it’s so unbelievably hard not knowing if you’re getting the most out of it. I feel like I’m honestly only learning 30-40% of the material being offered", "author": "moonsunbaenim", "created": 1599777126, "upvotes": 6}, "g4rg7by": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4rg7by/", "text": "1.\t Not everyone has acclimated or is especially disposed to learning or teaching in the online format. \n2.\televated stress and unique circumstances are inevitably going to give a bias towards thinking “there’s more work”. \n3.\twithout scheduled class time, it takes a lot of self management and commitment. As a result, that creates more work just in figuring out how to manage time. \n\nI’ve noticed that even though I’m assigning the same quantity of work, and same or easier level of difficulty on tests, students are saying the workload is more. \n\nI think we are used to dividing up “going to class” from “doing homework”. So when everything falls into the home work category now, it feels like work has doubled. I, sure many students, especially in lectures, were accustomed to passively sitting in class. Having to set a time to watch videos isn’t the same, and in a way can be more difficult to stay engaged. \n\nAlso, classes often inherently get more difficult as one progresses in college. So a lot of sophomores or juniors probably are taking harder classes than last year, but that would have been the case anyway. So the virus and online learning isn’t to blame.  Unlike faculty teaching, students don’t have a large sample of years in college to draw from for reference.", "author": "urnbabyurn", "created": 1599776399, "upvotes": 16}, "g4rdym0": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4rdym0/", "text": "I'm seriously depending on YouTube to teach me everything this semester.  The lectures I receive on zoom are less adequate than the well made YouTube videos I can view on the same topics. Basically all my professors do right now is assign me work", "author": "unholymanserpent", "created": 1599775486, "upvotes": 2}, "g4r77ym": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4r77ym/", "text": "*laughs in quarter system*", "author": "Laxattack36", "created": 1599773639, "upvotes": 2}, "g4r6xwy": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4r6xwy/", "text": "I have been looking for a post like this for the past 3 days and I found none, which led me to the conclusion that I was overreacting and being a lazy bum. It has been a real hassle to keep up with even individual assignments, let alone group work this semester.\n\nSome of these subjects and projects just don't translate as well virtually as they would in a physical lecture, imo and it doesn't help that the online resources are ALL over the place. I'm particularly worried about the fact that we aren't having any breaks this year, so there will be no chance to \"reset,\" which is going to make this semester even more challenging than previous ones. And I swear that professors are assigning more work to make up for the lack of face-to-face interactions. \n\nI hope and pray that I'll be able to catch up soon and everything will end up being okay, but navigating through the storm that is this semester has definitely been a difficult process.", "author": "morejamsthanjimin", "created": 1599773559, "upvotes": 12}, "g4r6big": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4r6big/", "text": "YES! My calculus class is four times a week, but only once over zoom. Our class times got shortened to 45 minutes long so I feel as if my professor is cramming too much into each class period. I just can’t seem to keep up, and I took precalc 1 & 2 and did perfectly fine, so I’m not sure if it’s just me or if anyone else in the class is struggling.", "author": "oceanscrub", "created": 1599773402, "upvotes": 1}, "g4r3tfb": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4r3tfb/", "text": "For me things have improved thanks to Covid. My all-online classes were profoundly \"phoned-in,\" but now they're actually holding decent lectures for us.", "author": "PyrocumulusLightning", "created": 1599772760, "upvotes": 4}, "g4r1oo0": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4r1oo0/", "text": "Yes, all of my professors are....not really teaching? I don't know if it's the platform, their morale, idk, but all classes have a one hour group segment once a week about what we need to study, the day before testing a they have a one hour group call for questions, then testing, then repeat. For some reason everything has such a major lack of....effort compared to  prior online classes.", "author": "Thermic_Aarvdarc", "created": 1599772216, "upvotes": 6}, "g4qydnt": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qydnt/", "text": "I feel like I’m fucking exhausted at the end of every day. On Tuesdays, Wednesdays and Thursdays I have three hours of classes in a row, and I get a lot of homework in each of them. I tried to tell them that I’m stressed out, but they always say “this is college.”", "author": "RandomRedditor44", "created": 1599771401, "upvotes": 8}, "g4qy0e1": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qy0e1/", "text": "I just started college this year and I am already like 4 chapters Behind! Teachers probably think that we have all of the time in the word since we are at home most of the time.  I asked other upperclassmen students if they feel this way too. It they said I’ll get used to it. All of my classes want us to study at least 9 hours each week but if I do that for every class do I even have time to sleep? But I hope we can get through this together. Next thing we know we have winter break. We can do it!!", "author": "Lizzie567", "created": 1599771307, "upvotes": 5}, "g4qsxyi": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qsxyi/", "text": "Imagine being me taking a professor with RMP score of 1.5 doing it all online. I feel like crying everyday.", "author": null, "created": 1599770065, "upvotes": 8}, "g4qruwi": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qruwi/", "text": "Yes and it all feels so impersonal too.", "author": "blueeyedbeauty123", "created": 1599769825, "upvotes": 3}, "g4qri2i": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qri2i/", "text": "My classes were supposed to be 4 on Monday and Wednesday and 1 Tuesday, but now my professors have all made them Monday through Friday and one even has things due on the weekend.\n\nIt feel insane trying to mange everything like I have way more work than what I was supposed to have now, or at least less time. I’m honestly just super confused this semester and have been try to come up with a schedule but it just never happens.", "author": "UnsoughtDawn", "created": 1599769725, "upvotes": 10}, "g4qpxdv": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qpxdv/", "text": "Same here. \n\nI’m terrified of my accounting exams this semester. The teacher is basing the first exam on 5 chapters and the second on 10 chapters.... online, proctored , closed book exams... each exam is 30% or more of the total grade. There are no quizzes, no online zoom classes. Just a couple pdf per chapter and hundred of youtube videos covering the entire course. The youtube videos are him simply reading and highlighting/underlining parts of the pdf. \n\nI’m sorry to rant. But to answer your question, yes. I’m worried i won’t be able to keep up and one of these classes is going to blow up in my face", "author": "AwesomeBlue98", "created": 1599769283, "upvotes": 10}, "g4qowyh": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qowyh/", "text": "Yep, had to drop a class because this so called professor was a 25 year old grad student and posted in nothing but run on sentences.  She was suppose to be an English 101 teacher and it took over an hour to figure out what are assignments were.\n\nTOTALLY FRUSTRATING!", "author": "GreyMatter399", "created": 1599769022, "upvotes": 8}, "g4qjc9l": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qjc9l/", "text": "From the number of posts I've seen like this it seems like this semester/school year is going to be a wakeup call to both higher education and k-12 about not only the technology they are requiring instructors and students to use as well as a wakeup call about the technology skills of their instructors.\n\nAll I can say is fill out the evaluation at the end of the semester and make sure you are honest on it.", "author": "squirrel8296", "created": 1599767561, "upvotes": 21}, "g4qhzcw": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qhzcw/", "text": "So I’m teaching an asynchronous class for the first time this fall.. what would you suggest i do to make it as productive as possible? 😰", "author": "whatinthewhattttt", "created": 1599767223, "upvotes": 8}, "g4qh9ci": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qh9ci/", "text": "I have a professor who’s answer to every email I sent is, “ GeT wItH yOuR sTuDy bUdDy” even though the website says contact professor to unlock/release report. He won’t acknowledge the issue till the day of the lecture which is once a week. So yea it’s more annoying than hard, I apologize for the rant.", "author": "Traditionallyy", "created": 1599767024, "upvotes": 14}, "g4qghjl": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qghjl/", "text": "You are paying a lot of money to learn and be challenged. It sounds like your doing a good job and using study/organizational skills to cope. These are skills that teachers try to teach at all grades because you don’t just get them over night.  \n\nRemember when your teacher gave you a bad grade for having a disorganized notebook? That was preparation for now. \n\nCollege is supposed to be hard, it’s not like K-12 where many schools just pass you along. I know it sucks because you feel like you are working more than you ever have in your life. Sorry, welcome to the new normal. \n\nThe good news is that means you will be ready for whatever job gets thrown at you. These self teaching skills your talking about are incredibly important. After college there are no more teachers and you will have to be able to teach yourself whatever you need to be good at your job.", "author": "Kinkyregae", "created": 1599766845, "upvotes": -3}, "g4qg9kx": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qg9kx/", "text": "Same! My professors can’t even keep up with their own lectures. I’ve been getting assigned powerpoints with hundreds of slides for each class. My two video lectures are just them reading off said powerpoint as slow as they can, or getting caught up with questions in the chat. My other online classes don’t even follow a schedule, due dates are wrong, professors are assigning homework that starts and is due a day that the original classes weren’t even signed up for. I have work those days. It’s all so difficult to keep track with and my professors don’t even email back.", "author": null, "created": 1599766768, "upvotes": 16}, "g4qg7bc": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qg7bc/", "text": "Yeah feeling this big time", "author": "Ayy23", "created": 1599766749, "upvotes": 2}, "g4qfzog": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qfzog/", "text": "A lot of my classes are “we need to go fast in case it goes back to being online I want to cover as much as I can just in case”", "author": "AbundantiaTheWitch", "created": 1599766673, "upvotes": 4}, "g4qedh0": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qedh0/", "text": "Ugh yes ! One of my classes im basically teaching my self. My prof said she typically responds to emails once a week, and gives us random PowerPoints and handouts then asks us to \"discuss what we learned\" for that unit.... uh I haven't learned anything. Im still waiting for a response to an assignment question that I reached out to my peers about and nobody knows what to do. Another class I have an essay due tomorrow and for the past week my prof was rescheduling his zoom meetings. We were suppose to submit an intro and two body paragraphs and then with the zoom meeting he'd help us. He rescheduled it for today and the essay is due tomorrow, yet graded my intro and body paragraphs and gave me a 16/20... yet if he would have helped me when I needed those zoom meetings I might have knew wtf to write ? And now i got an essay due tomorrow and im rushing to fix it all lmaooo you're definitely not alone. This is a very difficult and confusing time for all of us.", "author": "msmflovely", "created": 1599766241, "upvotes": 7}, "g4qdnr5": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qdnr5/", "text": "Online classes have been around for many years and for some reason a lot of college teachers refused to adopt that model. It used to be mandatory for online teachers to build their courses in a similar manner and the schools offered trainings to teach them how to do it. \n\nI’ve taken several over the years at different schools and they all looked almost the same: most work due on a single day of the week (Monday by 8am was popular and so was Friday by midnight). The best classes kept two modules open at a time so we could work ahead. Usually there was a weekly quiz, a discussion post/response, two midterms, a final, and a paper. Each module had a lecture of some sort, assigned reading and any other materials were included in the module. It was all so simple.\n\nI don’t know why more teachers didn’t just go that route. Synchronous lectures are stupid. Students should be able to “attend” on Zoom if they want to discuss the material or ask questions but there is no reason for it", "author": "VROF", "created": 1599765991, "upvotes": 23}, "g4qao48": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4qao48/", "text": "My university faculty admitted that they’re front-loading the semester so if we’re sent home again, they can let us kind of ride out the semester since we’ll have had so many assignments already", "author": "ArtEdInTraining", "created": 1599765171, "upvotes": 26}, "g4q9iap": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4q9iap/", "text": "I think part of it is feeling like everything we have to do is homework (I mean it is technically if your all online). Like usual it's a couple hours of classes where you do the learning than some hours of hw to really get it down/ do projects. Now it's just all hw it's so tedious especially if your boxed into your dorm all day like me. \nGood luck though", "author": "Lithean1", "created": 1599764824, "upvotes": 16}, "g4q7fp3": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4q7fp3/", "text": "Thank god my Mac let’s me have different desktops that I can easily navigate between. I have like 5 of them open.", "author": "_Joba_", "created": 1599764311, "upvotes": 3}, "g4q7332": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4q7332/", "text": "Yup. My professor is old and can’t utilize tech well. At first, he refused to screen share at all. So he’d print out the PowerPoint and lecture off of there. Then people complained, so now he screenshares the PowerPoint occasionally. \n\nBut most of the class is doing examples, and he refuses to show work. Like he’ll verbally go through problems without writing them down, which is how most people learn things involving numbers. Instead of writing it out, he’ll just say “500,000 times 10% times 6 years.” If you miss him saying one number, you basically miss the entire problem. You can’t keep up. But it’s too much work for him to write on a piece of paper in real time “$500k x 10% x 6 years”. He has us keep our video off, so now I just turn on the zoom meeting and go do something else. At least that way it’s not a complete waste of time. I don’t learn in that class anyways.", "author": "Slothfulness69", "created": 1599764207, "upvotes": 18}, "g4q6i2x": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4q6i2x/", "text": "I feel like my professors are compensating for not having normal classes by giving more work than usual plus homework and it’s been killing me especially since I’m a senior now.", "author": "Dansii", "created": 1599764052, "upvotes": 35}, "g4q6gum": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4q6gum/", "text": "A lot of my classes switch of the schedule every other week and it’s really hard to keep track of when I have each class.", "author": "grapesandpears", "created": 1599764043, "upvotes": 3}, "g4q674i": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4q674i/", "text": "This is what happens when teachers who aren’t taught how to teach online classes try to do, and it doesn’t work. Next semester if you’re still doing online learning, if possible, check to see if your professors have taught online classes pre-COVID, whether that’d be seeing if they’re an adjunct at a different school somewhere a ways away, or ask advisors if they know. The “online” classes that professors are teaching are not actual online classes, and they’re trying- and failing- to copy the exact class format for in-person to online.\n\nIf you can, try to get in contact with some of your classmates to try and reason with him and explain your concerns. There’s power with the masses.", "author": "tea-times", "created": 1599763963, "upvotes": 29}, "g4q4cic": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4q4cic/", "text": "Fucking yes, I’m literally teaching myself and I can’t stand it. The big problem in my opinion is the shitty school website I use, teachers can customize way too much of it, and this leads to every class having a different layout, and no easy or consolidated way to find all the work I need to do. So for example, one class has a “Homework” tab, where the teacher posts all the homework due, but a different class has all the homework in Lessons -> Week x -> Homework. This leads to me having to basically search through EVERY class site in order to find the work I need to do, it’s infuriating and I’m genuinely terrified I’m missing shit every day.\n\nI wish it was all just the same, every teacher would get a website with the same basic layout, and they’d put all the homework in the Homework tab, all the quizzes in a Quiz tab, all the tests in a test tab, etc.", "author": "chadan1008", "created": 1599763512, "upvotes": 110}, "g4q10wf": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4q10wf/", "text": "I’m currently taking 4 courses and they’re all 8am online classes. I oversleep through most of the zoom lectures and I could tell my professors are slowly giving up. Online classes are the worst lol", "author": "Bk_Grizzly", "created": 1599762589, "upvotes": 98}, "g4q0upw": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4q0upw/", "text": "Each week is a new theme and it starts on Thursday. We have the weekend to submit our discussion boards and group projects followed by additional discussion on tuesday and Wednesday. Wednesday is a quiz for that theme. Now before having any group discussions we have three to four chapters to read research that go along with the discussion boards, and every every other week is a essay. It is a lot and I'm losing the weekends.", "author": "tillD2t", "created": 1599762543, "upvotes": 176}, "g4pvav9": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4pvav9/", "text": "I was having almost this exact same problem this last week. What I did was find a friend who had taken the class with the same teacher in a previous semester and asked if they would share the notes they took. That way, I have everything written down and can follow along with my prof's lectures without getting bogged down trying to take notes.", "author": "badoopshadoop", "created": 1599761041, "upvotes": 26}, "g4pqu18": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4pqu18/", "text": "[deleted]", "author": null, "created": 1599759906, "upvotes": 448}, "g4ppw4j": {"link": "/r/college/comments/iq7t55/does_anyone_else_feel_as_if_they_cant_keep_up/g4ppw4j/", "text": "Honestly, any concerns you have about this semester are entirely valid. Nobody in college right now has taken classes amid a global pandemic, recession, and climate crisis happening all at once. Even if classes were delivered in the exact same way as last fall, things would still feel different and more challenging. Don't be so hard on yourself.\n\nIf it makes you feel any better, I'm having similar issues. My lectures have been okay, but my professors have been bombarding me with Zoom links, Google Drive folders, and assignment files, and it's definitely been more difficult for me to be organized and feel 'on top' of things.\n\nWhat's been helpful for me is connecting with classmates. I'm part of a Discord server and GroupMe chat for one of my classes, and many people in them are just as lost and overwhelmed as I am. You're definitely not alone.", "author": "a_wagen", "created": 1599759703, "upvotes": 108}}}