{"sid": "pu8a5x", "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/", "title:": "Girlfriend just barely failed a class final; class condition caused failed class (TLDR @ bottom).", "text": "As the title says, my gf failed a written final exam; but just barely. The class condition is she has to pass the final (though her final grade would be a 78% if that wasn’t the condition). I feel really bad for her cause this program is something she’s waited years for (waiting list) getting into and she’s gonna have issues with her second term cause this one class. \n\nI wanna send a message to her professor and ask them about any grace/leeway he could have but I’m worried it’ll make her look bad or may be considered unprofessional. I’ve always been professional and charismatic so I’m certain I could get to this professor and have him come up with some options for her that won’t jeopardize her from moving on. But like I said I’m concerned about how it’d look on her, considering this is her battle with her class and her professor doesn’t know me.\n\nWhat do you think redditors?\n\nTLDR: girlfriend failed class and I wanna talk to her teacher about accommodations for her, is it a bad idea?", "author": "vinni8989", "created": 1632442709, "retrieved": 1632946143, "over_18": false, "upvotes": 0, "upvote_ratio": 0.25, "comments": {"he1guph": {"link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he1guph/", "text": "Professors do not like it when the students themselves come groveling for a grade change. It is far, far worse when someone who isn't the student does the groveling on their behalf. Do not do this.", "author": "patrdesch", "created": 1632448641, "upvotes": 8}, "he184ht": {"link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he184ht/", "text": "Bad idea, if it was a big problem she can be a big girl and bring it up to the professor herself. It basically make her and you look bad and like someone in the comments said it's essentially a FERPA violation so don't even expect an answer.\n\nAlso it's not like she didn't know the importance of the exam. It seems like that is a day one syllabus review item so the ability for grace/leeway is probably zero (I've had that experience with several classes and it was very clear from the professor point of view.)", "author": "safespace999", "created": 1632444492, "upvotes": 5}, "he16hoc": {"link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he16hoc/", "text": "Holy smokes! What is wrong with you? Emailing your gf's professor? Are you out of your mind? What next? Contact professor's mother? Honestly, if I were your GF, and you suggested/did this, I would probably dump you.", "author": "Nyquil_Jornan", "created": 1632443718, "upvotes": 7}, "he151oy": {"link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he151oy/", "text": "[deleted]", "author": null, "created": 1632443026, "upvotes": 18}, "he15073": {"link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he15073/", "text": "Absolutely DO not email on her behalf. It’s college, your girlfriend is expected to be adult enough to be able to send an email on her own if she feels its necessary. Sending one on her behalf would not make a good case for how she is able to handle the program. You could help draft a letter with her, or help her find different strategies for studying and different supplementary resources for learning for her next attempt at the course but omg please don’t email for her.", "author": "InsulinBlue", "created": 1632443007, "upvotes": 16}, "he14vt3": {"link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he14vt3/", "text": "Do not message your girlfriend's professor. That is the worst thing you could do. \n\nIf something needs to be done, she needs to talk to them herself and see if there's anything she can do. They will not take either of you seriously if you reach out for her, and professors are not allowed to talk about their students to anyone but that student. \n\nIt's also possible that the professor could tell others about it and that will look bad on her for all time.", "author": "dyorknine", "created": 1632442948, "upvotes": 37}}}