{
  "sid": "quclsc",
  "link": "/r/college/comments/quclsc/its_been_three_months_and_i_finally_got_hit_with/",
  "title:": "It's been three months and I finally got hit with the homesick feels.",
  "text": " I talk to my parents a lot over the phone at least 3 hours total every week, but it's been getting close to the end of the semester and I just want to go home already.  \nI've been watching some old videos of my family and me, and songs that my dad overplays and sings a lot.  \nAnd boy did that mentally break me, and when I think about it I can't help but realize that things won't be the same way they used to be every day.",
  "author": "__St_Andrew__",
  "created": 1636968437,
  "updated": 1637181536,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkpkywg": {
      "link": "/r/college/comments/quclsc/its_been_three_months_and_i_finally_got_hit_with/hkpkywg/",
      "text": "I'll chime in as a 32 year old. Things change drastically as you get older. \n\nI remember longing to go back home every weekend to see my parents. It was built in. It was something I needed because I was young and still needed their advice. That worked for a long time through my early to mid 20's. \n\nWhen I was 26, I moved 3 hours away to the other side of the state. I still saw them but nowhere near as much as I'd used to. It didn't affect me a ton, I'd been working a few jobs for a while and I'd been on my own. Although, this was definitely the furthest I'd ever moved away. I saw them maybe once every month or two. I didn't have a place for them to sleep really. \n\nNow, I'm 32. I want to say at 28 I moved to 4.5 hours away, 29 I was 5 hours away and at 31 I moved 5.5 hours away. \n\nMy relationship with my parents has changed quite a bit. I still see them once every so many months but the relationship itself is a lot different. There's even some things happening through my group of friends who are all the same age group that is kind of strange. Our parents are starting to lose their fucking minds. I'm not sure what's up. \n\nMy dad has started introducing TONS of drama between my brother and I. Complaining about how my brother doesn't want to see them and a bunch of other paranoid shit. Meanwhile, my girl friend's mom is doing the same shit. It's getting far enough that they are literally starting to shut out their kids. My girl friend's brother has two daughters and they are simply asking that her mom doesn't invite everybody over to see his kids. I know that she'll not listen and fuck it up. There's only so many times they'll let her get away with it. Last time they required the parents to get covid tested and these dumb dicks got tested, FLEW TO FLORIDA with a bunch of unvaccinated people, then went to their house. \n\nMy dad is similar. Doesn't seem like he listens at all. When I tell them not to show up before 4:30 when they come down because my girlfriend works from home, they show up at 2:30 no matter how much I stress them not being here. \n\nBleh, early 30's are strange man. The empty nest syndrome is setting in and my parents opinion couldn't matter less to me. It's a really strange feeling. \n\nThere will be a day that you go home and it's no longer your home. You'll walk into the house you grew up in and you won't feel welcomed any more. Even more years will pass then you'll start forgetting the streets in your town and your town will change more than you ever thought. It's crazy. When I drive to my hometown, it feels absolutely no different than going on a road trip and passing through one of those little podunk towns on the way to your destination. It's no different than any ole little town. \n\nCherish what you've got now, it'll eventually change into something else.",
      "author": "Awkward_Mail_2786",
      "created": 1636977544,
      "upvotes": 1,
      "replies": {}
    }
  }
}