{"sid": "ptuuxy", "link": "/r/college/comments/ptuuxy/what_does_a_college_counselor_do/", "title:": "What does a college counselor do?", "text": "So I’ve been having a rough go of it lately and I’m considering going to my college counselor about it. I’m just not sure if I should be going to them or taking the steps to see a therapist. Stress has really been beating my ass lately and it’s getting in the way of me finishing my degree. I have a senior project due in November and I just can’t seem to work on it cause every time I even think about it, I start having a panic attack and ignore what I need to be doing. I even have a hard time sending emails to my professors asking for help on it. It seems like such a simple thing, but I can’t seem to do it…", "author": "WickedPuffin", "created": 1632402414, "retrieved": 1632946165, "over_18": false, "upvotes": 2, "upvote_ratio": 0.75, "comments": {"hdzae6c": {"link": "/r/college/comments/ptuuxy/what_does_a_college_counselor_do/hdzae6c/", "text": "Colleges can have different terms for these jobs. An academic advisor (sometimes called college counselor) is there to help you choose classes, plan your career, and can help with when you're struggling in a particular class. A mental health counselor (also sometimes called college counselor, I know it's confusing) is a therapist and is there to help you through stress, anxiety, depression and any other mental health needs you have. Most college's have this service included in your tuition so you don't have to use insurance or pay out of pocket because you're already paying for it. Search for your counseling services center on campus and you can make an appointment. Most counseling center's even have group therapy if you want to be a bit more passive in the beginning.", "author": "thehelpfulprof", "created": 1632413936, "upvotes": 2}, "hdyu6jj": {"link": "/r/college/comments/ptuuxy/what_does_a_college_counselor_do/hdyu6jj/", "text": "An academic counselor is there to help you choose classes and navigate academics-related questions. If you want support for mental health issues, that's something you'd get from a therapist. Your college may have a mental health center where you can see someone for free or for a reduced cost.", "author": "clearwaterrev", "created": 1632407085, "upvotes": 5}}}