{
  "sid": "q93zc1",
  "link": "/r/college/comments/q93zc1/teammate_wants_to_do_lab_report_work_by_herself/",
  "title:": "Teammate wants to do lab report work by herself",
  "text": "I’m working in a team of three for my biology lab reports. For our first four lab reports, one of my teammates insisted she do all the lab report work by herself. I offered my help a few times but she said it was alright and didn’t need any assistance. The only time she did ask for my help was the day right before the lab was due, and she wanted me to answer the trickier and more important questions of the lab report, meaning that there was barely anything done. This was during midterms week, when I had like 3 consecutive tests and 1 essay to submit. \n\nWe had an entire week to work on the assignment, yet she only bothered to contact my other teammate and I when there was little time left to submit it. I brought this up to her, saying that we should manage our time better as a team, and she left me on read. The next day whenever I glance in her direction she looks at me weirdly and walks away.\n\nAm I in the wrong? What can I do to make things better between us?",
  "author": "naaooonnnngh",
  "created": 1634355027,
  "updated": 1634423825,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hgtlhlr": {
      "link": "/r/college/comments/q93zc1/teammate_wants_to_do_lab_report_work_by_herself/hgtlhlr/",
      "text": "I would communicate that if she had allowed you to help in the beginning, this situation occurred. But you’re also in the wrong for not standing up to her and demanding to take part in the project.",
      "author": "shedobefunny",
      "created": 1634355660,
      "upvotes": 5,
      "replies": {}
    },
    "hgtmha6": {
      "link": "/r/college/comments/q93zc1/teammate_wants_to_do_lab_report_work_by_herself/hgtmha6/",
      "text": "Unless you guys aren't lab partners anymore, the only thing you can do is to tell her that there is blame to be shared between both of you and work on this next lab together.",
      "author": "Traaaaaaaaap",
      "created": 1634356254,
      "upvotes": 2,
      "replies": {}
    }
  }
}