{"sid": "pr4q4t", "link": "/r/college/comments/pr4q4t/should_i_tell_my_teachers_about_finding_things/", "title:": "Should I tell my teachers about finding things difficult at home?", "text": "I procrastinate and don't really give my 100% effort in assignments because I never give myself enough time. But I've just not done incredibly well as I hope to. I've got Cs in all my subjects- I do one A Level and 2 BTECs. I have until May for my final exams and I want to get As or Bs at least, but my depression is just getting worse, I'm still grieving for my Dad who passed away last year, trying to help my mum take care of my grandma who is receiving chemotherapy. My family want me to do well, they know I have the potential but my confidence just isn't there. I don't want my teachers to feel sorry for me or that im owed anything, and I don't like to appear struggling", "author": "Magenta-Bunny", "created": 1632043411, "retrieved": 1632801462, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"hdhdu2d": {"link": "/r/college/comments/pr4q4t/should_i_tell_my_teachers_about_finding_things/hdhdu2d/", "text": "You should definitely let your professors know you're struggling. They want you to do and be ok, you might be surprised at how much support you get. I know opening up and being vulnerable is scary, but it's so brave. I think you're brave for writing your post. \n\nI'm sorry you're going through such a difficult time. I'm no stranger to depression myself. Keep putting one foot in front of the other, try to celebrate even the smallest success. And take each day as it comes. Remind yourself you're doing a good job, because you really are.", "author": "LizzipuBethiepie", "created": 1632070660, "upvotes": 2}, "hdh79o8": {"link": "/r/college/comments/pr4q4t/should_i_tell_my_teachers_about_finding_things/hdh79o8/", "text": "Yes! Please do this. I struggled in high school for months while dealing with a mother going through cancer and ended up failing a few classes that semester just from stress. I finally broke down to my health teacher when he was asking about missing work and he ended up letting me get away with passing in less assignments and talking to other teachers.\n\nMost were really empathetic and helpful. Did have one teacher who didn’t give me an extension for a major project. Mom was having 16 hour surgery on Monday so I asked for an extension until Wednesday on the weekend before. I wasn’t only spending all weekend with my mom, but I had senior prom Friday night too. He said I’d get 20 points off for each day it was late either way. Fuck that guy. But everyone else was helpful", "author": "casey4190", "created": 1632067949, "upvotes": 3}}}