{
  "sid": "r4axy6",
  "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/",
  "title:": "Is political science a good degree?",
  "text": "Ive always loved politics but idk if its a good degree to financially support me",
  "author": "toxicfox0121",
  "created": 1638124381,
  "updated": 1638206784,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.71,
  "comments": {
    "hmglwwy": {
      "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmglwwy/",
      "text": "It depends what you want to do, how good you are at political science, and where you live/want to live.\n\nWant to be an analyst for a political organization/think tank and live near D.C.? Plenty of jobs! Some pay well, others do not. Regardless, the connections would open new opportunities.  \nWant to become a diplomat and are academically talented in Poli-Sci? That's possible too (but be prepared to move across the globe), and pay is pretty decent (I have many friends who went into the diplomatic service).  \nWant to work for an NGO and live near D.C. or NYC or are unafraid of living in 3rd world countries? That's also possible. You won't be a millionaire but you will live an interesting life.  \nWant to aid politicians, be they local, state, or federal? Make the right connections and it's possible, pay varies.  \nWant to work in policy and live near D.C. or a state capital? Those jobs are also in constant demand. Again, pay varies.\n\nAre there those Poli-Sci majors who end up in completely different fields? Absolutely, I know unemployed CS, IT, and Engineering majors though also. Is Poli-Sci a quick way to be a millionaire? No. If you love it though, it might be worth it, putting a value on passion is famously impossible.",
      "author": "DrAlawyn",
      "created": 1638141049,
      "upvotes": 5,
      "replies": {
        "hmhuc8m": {
          "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmhuc8m/",
          "text": "I do want to be apart of the government",
          "author": "toxicfox0121",
          "created": 1638161302,
          "upvotes": 1,
          "replies": {
            "hmj620g": {
              "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmj620g/",
              "text": "Then job-wise this field is not for you.\n\nIf you just want to study a thing to study it, have at; but if you want to *do*something with a degree that's not it Jack.",
              "author": "SamSeebourne",
              "created": 1638194909,
              "upvotes": 2,
              "replies": {}
            },
            "hmj9e0n": {
              "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmj9e0n/",
              "text": "If you like Political Science , do Political Science. Jobs exist out there for every major, some majors have more jobs than other majors. I know many Poli-Sci majors who ended in government, although admittedly they either went to D.C. or a state capital for a job. Best of luck!",
              "author": "DrAlawyn",
              "created": 1638196584,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmh0mph": {
      "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmh0mph/",
      "text": "My original degree was in Political Science.  I had wanted to work in the public sector, and after graduating I worked for 13 years in a large state social services agency.  Consequently, it was a good degree for me.  I did return to college in my 30s, however, for a mid-life career change.\n\nBased on your message, I would have to say its not a good degree for you.  Political Science has very little to do with current issues or political campaigns.  Rather, its the study of government and its related institutions.  Students who expect \"liberals v. conservatives\" or \"Democrats v. Republicans\" style discussions are often disappointed.",
      "author": "taxref",
      "created": 1638147451,
      "upvotes": 3,
      "replies": {
        "hmhul1b": {
          "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmhul1b/",
          "text": "I love political theories and how government operates",
          "author": "toxicfox0121",
          "created": 1638161429,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hmfwo1b": {
      "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmfwo1b/",
      "text": "STEM and business majors for jobs.. sucks but those are the skills that generate revenue today",
      "author": "INeedAYerb",
      "created": 1638130789,
      "upvotes": 2,
      "replies": {}
    },
    "hmfh6ci": {
      "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmfh6ci/",
      "text": "It’s a great all purpose degree that will qualify you for a wide variety of jobs thst just want a BA\n\nIf you have an aptitude for Stats, that makes you more marketable (I didn’t)\n\nIn and if itself it’s not a direct path to a career like most applied majors, but it served me well.",
      "author": "NoFilterNoLimits",
      "created": 1638124611,
      "upvotes": 2,
      "replies": {}
    },
    "hmfu7aj": {
      "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmfu7aj/",
      "text": "I know 3 people with political science degrees and none of them are doing anything even close to what their degree is for.",
      "author": "metolius640",
      "created": 1638129781,
      "upvotes": 2,
      "replies": {
        "hmg27i6": {
          "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmg27i6/",
          "text": "Yea same here. I know a couple and they are working at as a waiter LOL",
          "author": "elkfn2",
          "created": 1638132968,
          "upvotes": 1,
          "replies": {}
        },
        "hmh992e": {
          "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmh992e/",
          "text": "My ex is a political science major and she's working a regular job, so add another her to your list lol",
          "author": "Harajuku_Aj",
          "created": 1638151378,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmgrcab": {
      "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmgrcab/",
      "text": "Not really- unless you plan on pursuing professional or grad school programs. Degrees like economics, finance or data science/stats would probably be better than political science.",
      "author": "Equivalent-Hat5388",
      "created": 1638143373,
      "upvotes": 2,
      "replies": {}
    },
    "hmfrn41": {
      "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmfrn41/",
      "text": "I would ask compared to what? If you have no other interest or aptitude it might be fine. It’s not highly respected but that wasn’t your question.",
      "author": "pimpco888",
      "created": 1638128752,
      "upvotes": 1,
      "replies": {}
    },
    "hmfsinm": {
      "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmfsinm/",
      "text": "Depends on what you want to do with your life.  I know someone with a Master's in it who had issues finding work after they graduated.",
      "author": "1976Raven",
      "created": 1638129110,
      "upvotes": 1,
      "replies": {}
    },
    "hmfknjj": {
      "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmfknjj/",
      "text": "No",
      "author": "elkfn2",
      "created": 1638125975,
      "upvotes": 0,
      "replies": {}
    },
    "hmh22l6": {
      "link": "/r/college/comments/r4axy6/is_political_science_a_good_degree/hmh22l6/",
      "text": "Getting a polisci degree doesn't guarantee you'll win elections.",
      "author": "GenXtreme1976",
      "created": 1638148115,
      "upvotes": 0,
      "replies": {}
    }
  }
}