{
  "sid": "qgmr8f",
  "link": "/r/college/comments/qgmr8f/graduate_early_or_no_i_have_to_decide_by_friday/",
  "title:": "Graduate Early or No (I have to decide by Friday and I don’t know)",
  "text": "I (20F) don’t know if I should graduate college early (I’m in my 3rd year in college and can graduate). I play D1 volleyball for TCU and I found out a couple days ago that I have 17 hours left to graduate. I am kinda done with volleyball but I don’t want to regret not playing all 4 years. I want to go to grad school so it would be nice to be able to start working on my PhD early and to not have to pay another year at tcu (scholarships help but it’s still expensive). I missed the deadline to apply for my dream grad school but I could go to a different one that I also like and play my senior year of volleyball there. I’m also in a long distance relationship and the grad schools I’m looking at are near my boyfriend. I can give more detail if necessary but I really don’t know what to do.",
  "author": "BelSwaff",
  "created": 1635302793,
  "updated": 1635457102,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hi7atsv": {
      "link": "/r/college/comments/qgmr8f/graduate_early_or_no_i_have_to_decide_by_friday/hi7atsv/",
      "text": "I don't really see any reason not to graduate. If the main concern is playing another year of volleyball, and you can do that at grad school, then what are you losing by moving on with your life? Saving lots of money and living closer to your boyfriend seem like significant benefits, and there's almost no downside.",
      "author": "Dunyazad",
      "created": 1635304216,
      "upvotes": 4,
      "replies": {
        "hi7cyyy": {
          "link": "/r/college/comments/qgmr8f/graduate_early_or_no_i_have_to_decide_by_friday/hi7cyyy/",
          "text": "Hey! Thank you and you’re pretty much right haha. To clarify, some of my worries about graduating early are missing out on senior year fun and not being able to apply to my dream school which I would be able to do if I didn’t graduate early (but I could always transfer there!) so I think you’re right- thank you!",
          "author": "BelSwaff",
          "created": 1635305300,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hi7c31o": {
      "link": "/r/college/comments/qgmr8f/graduate_early_or_no_i_have_to_decide_by_friday/hi7c31o/",
      "text": "Graduate Early",
      "author": "GoldRequest",
      "created": 1635304844,
      "upvotes": 3,
      "replies": {}
    }
  }
}