{
  "sid": "jzcqlv",
  "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/",
  "title:": "I got an 0% on an essay I thought I did pretty okay on and now im devasted.",
  "text": "\nWhen I was in highschool and middle school I didn’t really care about my grades. I flunked classes and didn’t really mind if I got a D or C. In college I have been trying more and learning how to study. My grades aren’t perfect but they’ve been mostly higher than the classes average which made me feel good about myself.\n\nBut this one class, my professor is super confusing and with online learning its harder for me to grasp information not to mention that he’s an older guy that doesn’t understand technology. I’ve been doing okay in his class but we had this one essay that was super confusing. It wasn’t very typical and the instructions were strange. \n\nHe’s “clarified” before but it didn’t make it any easier. I wrote the essay and it definitely wasn’t worth a A+ but I fulfilled all the requirements and did everything needed. So today I opened my grade book and saw I got a 0% on the essay worth 20% of my grade.\n\nI now have a 57% in my class. I am devastated and don’t understand how I could get a grade that would be the same as someone handing in a blank piece of paper. I wrote him an email but I’m scared for his response and can’t help if it really was worth a 0. Im doubting myself and failing this class is really bad for me for other reasons other than just school.\n\nEdit: apparently i got a 100. He was sleepy when putting in grades. Wtf this was hell for me especially since i have severe anxiety but thank you everyone\n\nAnother edit cuz everyone is so supportive 🥺: Thank you everyone!! I definitely learned my lesson and wont automatically think I fucked up and got a 0. I guess due to the fact that I was such a bad student in highschool, I have low self esteem when it comes to grades that even when I try super hard on an assignment and it doesn’t make sense that I got a bad grade, I immediately doubt myself and wonder if I deserved it.",
  "author": "acitruscandle",
  "created": 1606114201,
  "over_18": false,
  "upvotes": 596,
  "upvote_ratio": 0.98,
  "comments": {
    "gfbwisk": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gfbwisk/",
      "text": "LMAOO U ENEDED UP GETTING 100",
      "author": "likeyecutg",
      "created": 1607641680,
      "upvotes": 3,
      "replies": {}
    },
    "gf36xf4": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gf36xf4/",
      "text": "Super late to the party, but something like this happened to me.\n\nI turned in a project that I worked really hard on and consulted the rubric really well as I was getting it done. I got the grade back and saw I got a 17% on the project. Really confused and super anxious, I emailed the prof asking why I got the grade. Turns out that was someone else's score and I got an 100. \n\nThen I thought, who got a 17% on this easy ass project??",
      "author": "crazychica5",
      "created": 1607458118,
      "upvotes": 1,
      "replies": {}
    },
    "gdgjdnr": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdgjdnr/",
      "text": "Lesson learnt: check and clarify with the relevant people before freaking out when something doesn't seem right. Congrats on your 100 anyways.",
      "author": "parrothawk",
      "created": 1606236763,
      "upvotes": 2,
      "replies": {}
    },
    "gde0be4": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gde0be4/",
      "text": "I saw that this was an error on the professor’s part, but I wanted to say this happened to me too. It was one of my first classes and I worked hard on the paper. Like you, I didn’t think it was a 100% paper, but definitely not a failing grade either. When I got my grade back it was listed as 10%, which of course was upsetting when you work hard on it. I emailed the professor to ask why my grade was only 10% when I had fulfilled all the listed criteria. She came back to me and said the paper was 100%, but that she had entered the points rather than the percentage (the paper was worth 10pts). She promptly went in to fix it. \nErrors do occur and after that I’ve always made a point to email and ask why there’s a discrepancy of that magnitude when all the criteria has been met. Odds are it’s human error and they simply don’t double check before submitting.",
      "author": "Svenska80",
      "created": 1606177947,
      "upvotes": 2,
      "replies": {}
    },
    "gddmiz9": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddmiz9/",
      "text": "LMAO CONGRATULATIONS",
      "author": "HungerMobile",
      "created": 1606170745,
      "upvotes": 3,
      "replies": {}
    },
    "gddmh2i": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddmh2i/",
      "text": "Well, that was a roller coaster of emotions, glad you got the grade you wanted.",
      "author": "Discarded1066",
      "created": 1606170719,
      "upvotes": 3,
      "replies": {}
    },
    "gddljsv": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddljsv/",
      "text": "This happened to me too. My prof failed me and my group on a 20 page paper because a few paragraphs in he decided he hadn’t seen any critical thinking said he was going to read a few more paragraphs and if it didn’t turn around he would stop reading. He stopped reading. It was frustrating because he only made it through on person’s section of the paper.",
      "author": "kk4749",
      "created": 1606170256,
      "upvotes": 2,
      "replies": {}
    },
    "gddgxbe": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddgxbe/",
      "text": "[deleted]",
      "author": null,
      "created": 1606167983,
      "upvotes": 2,
      "replies": {
        "gddnte2": {
          "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddnte2/",
          "text": "Omg thank you sm! I’m so proud of myself bc I thought I would do horribly on it",
          "author": "acitruscandle",
          "created": 1606171401,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gddg191": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddg191/",
      "text": "> apparently i got a 100. He was sleepy when putting in grades \n\nCongrats on the 100%. Keep up the good work!",
      "author": "_The_Professor_",
      "created": 1606167555,
      "upvotes": 4,
      "replies": {}
    },
    "gddfxpb": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddfxpb/",
      "text": "I think the kids would call this a \"0 to 100 real quick\" moment",
      "author": "OtherGandalf",
      "created": 1606167506,
      "upvotes": 9,
      "replies": {}
    },
    "gddfsm7": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddfsm7/",
      "text": "What a roller coaster of a post. Glad it was all cleared up!",
      "author": null,
      "created": 1606167439,
      "upvotes": 3,
      "replies": {}
    },
    "gddf8sl": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddf8sl/",
      "text": "I see the update, but for the future, getting a zero on an assignment you turned in and didn't plagiarize on isn't a thing. May be there was an issue in receiving it, or the system picked up plagiarism where there wasn't, but if this happens again, it's a misunderstanding, not a fuckup.",
      "author": "TrekkiMonstr",
      "created": 1606167172,
      "upvotes": 3,
      "replies": {
        "gddnrf9": {
          "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddnrf9/",
          "text": "Yup definitely learned my lesson. I just couldn’t help but think it was my fault since I have low self esteem when it comes to my school work. I knew that it was impossible for me to get a 0, but somehow I convinced myself that I was a failure and that I did it wrong 😭😭",
          "author": "acitruscandle",
          "created": 1606171372,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gddcdlr": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gddcdlr/",
      "text": "i saw your edit that you got a 100 and thats awesome, hard work gets good grades. one thing with writing assignments, im unsure the class but they are hard. i took a writing a research class last year and the professor was very strict on her grading criteria and i did not do well. she suggested i visit the writing center and i did and she still failed my works. she accused me of plagiarism for my citations and more. he opinion is biased just like every other professors, they are all going to grade different with writing assignments\n\n&#x200B;\n\nbest advice try to look at the grading criteria while you work on an assignment and try to make sure you follow it as you write, after you can say well at least you did what they asked and if they give a bad grade you can meet with them and discuss and ask questions on why they felt differently so in the future you can fix it",
      "author": "carminehk",
      "created": 1606165781,
      "upvotes": 6,
      "replies": {}
    },
    "gdd6suu": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdd6suu/",
      "text": "Oh fuck I’m so glad you added the update because I was baffled. Usually only a blank page or just not turning it in will get you a zero but if you try you’ll get something even if it’s an F.",
      "author": "uraniumstingray",
      "created": 1606163095,
      "upvotes": 12,
      "replies": {}
    },
    "gdd0yif": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdd0yif/",
      "text": "Yayyy!! What a wonderful update! I’m so happy for you!  Such happy news!",
      "author": "inflewants",
      "created": 1606160371,
      "upvotes": 12,
      "replies": {}
    },
    "gdcujue": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdcujue/",
      "text": "Good thing you asked. I'm sure he would have caught the error when posting final grades, but it is imperative that students check their grades.",
      "author": "Piglet03",
      "created": 1606157366,
      "upvotes": 23,
      "replies": {}
    },
    "gdcqveq": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdcqveq/",
      "text": "Congrats on the 100!",
      "author": "RedditIs4ChanLite",
      "created": 1606155624,
      "upvotes": 40,
      "replies": {}
    },
    "gdck91o": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdck91o/",
      "text": "damn that was a turn of events lol",
      "author": "sleepy_scav",
      "created": 1606152456,
      "upvotes": 72,
      "replies": {
        "gdd3a3f": {
          "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdd3a3f/",
          "text": "Ikr lol I couldn’t believe my eyes when I hoped his email this morning",
          "author": "acitruscandle",
          "created": 1606161442,
          "upvotes": 33,
          "replies": {}
        }
      }
    },
    "gdc6n21": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdc6n21/",
      "text": "I will assign a zero when a key piece is missing, but always allow students to resubmit with that key piece added.  Did you get any feedback from the professor?  If not, reach out.  Clearly you're either missing some crucial piece of information or the professor made an error.",
      "author": "FamousCow",
      "created": 1606145608,
      "upvotes": 3,
      "replies": {
        "gdc7syo": {
          "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdc7syo/",
          "text": "Actually apparently I got a 100 and because he was sleepy when he typed in grades, he put in a 0. This was an emotional rollercoaster.",
          "author": "acitruscandle",
          "created": 1606146230,
          "upvotes": 27,
          "replies": {
            "gdc91td": {
              "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdc91td/",
              "text": "You are super lucky, add an edit to the post.",
              "author": "fgweuyifh89y48",
              "created": 1606146896,
              "upvotes": 16,
              "replies": {}
            },
            "gdc7vna": {
              "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdc7vna/",
              "text": "It happens!  Sorry you had to go through that stress.",
              "author": "FamousCow",
              "created": 1606146269,
              "upvotes": 6,
              "replies": {}
            },
            "gdcra3y": {
              "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdcra3y/",
              "text": "glad to hear this",
              "author": "General_practicee",
              "created": 1606155823,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gdc27xv": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdc27xv/",
      "text": "I would reach out to him and ask to go over the assignment",
      "author": "ekaplun",
      "created": 1606143145,
      "upvotes": 2,
      "replies": {}
    },
    "gdb6v7d": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb6v7d/",
      "text": "I’m not sure why you would get a 0 for something you handed in. Maybe this was a mistake. I would suggest discussing this with your instructor ASAP.",
      "author": "TGMPY",
      "created": 1606115062,
      "upvotes": 98,
      "replies": {
        "gdb6z4o": {
          "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb6z4o/",
          "text": "Yeah even if I handed in an absolute shit essay, if i did all the requirements I figure i’d at least get some points. Even if its like a 20%.",
          "author": "acitruscandle",
          "created": 1606115165,
          "upvotes": 46,
          "replies": {
            "gdb7lke": {
              "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb7lke/",
              "text": "Exactly. I’m an instructor. I only give a 0 when directions aren’t followed at all.",
              "author": "TGMPY",
              "created": 1606115745,
              "upvotes": 35,
              "replies": {}
            },
            "gdbn51i": {
              "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdbn51i/",
              "text": "Relax. You didn't get a 0% on it. He just hasn't graded it yet.",
              "author": "SquigglyHamster",
              "created": 1606131924,
              "upvotes": 5,
              "replies": {
                "gdc5t9m": {
                  "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdc5t9m/",
                  "text": "He graded it. Everybody else got their grades as well.",
                  "author": "acitruscandle",
                  "created": 1606145162,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gdb6nhm": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb6nhm/",
      "text": "Maybe it didn't go through correctly and he didn't get it, or he thought you plagiarized when you didn't? I've never heard of anyone getting a 0% on an essay just because it was bad. \n\nI mean, it is possible that he's an insanely harsh grader and if you didn't follow the directions you get nothing, but most professors would still give you at least some points if you completed it, even if it was bad or didn't follow directions exactly.",
      "author": "SatelliteHeart96",
      "created": 1606114861,
      "upvotes": 271,
      "replies": {
        "gdb6tpd": {
          "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb6tpd/",
          "text": "He told us to attach another assignment with it and I got a grade on that a week ago. So he definitely got it. It’s just mind boggling to me if it was just him harshly grading because I did all the requirements even if maybe I misunderstood for some things. But I’m reading the guidelines and everything seems right except maybe a few things I didn’t do well? But I still did it. Idk",
          "author": "acitruscandle",
          "created": 1606115023,
          "upvotes": 58,
          "replies": {
            "gdbav2h": {
              "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdbav2h/",
              "text": "Definitely contact your professor. Ask him if you really got a 0% on the assignment or if the website perhaps had some kind of error (blame the website not him).",
              "author": "Damnaged",
              "created": 1606118811,
              "upvotes": 78,
              "replies": {}
            },
            "gdbek1h": {
              "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdbek1h/",
              "text": "Well, I wish you luck and hope everything works out. It most likely is some sort of mistake or misunderstanding. Even the harshest professors I've had still wouldn't have given out a 0 for a completed essay, especially if you did follow most of the directions",
              "author": "SatelliteHeart96",
              "created": 1606122616,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "gdb6c6z": {
      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb6c6z/",
      "text": "I think this is completely unreasonable. Did he give any feedback on the assignment? Perhaps he could have overlooked it and truly thought you didnt turn it in?",
      "author": "kendledean123",
      "created": 1606114573,
      "upvotes": 3,
      "replies": {
        "gdb6ij3": {
          "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb6ij3/",
          "text": "Nope, he didn’t say anything. And perhaps he didn’t see it? But I sent it in on time and labeled it my assignment. He has never done this before so I’m confused. He’s also a harsh grader so it wouldn’t be completely out of the question that I got a bad grade but a 0? Even when I wrote 1000 words and did all the requirements? Even if i did absolute shit with bad grammar (which i didn’t), shouldn’t i at least get a 20%?",
          "author": "acitruscandle",
          "created": 1606114736,
          "upvotes": 2,
          "replies": {
            "gdb6ndf": {
              "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb6ndf/",
              "text": "Yea something seems off. Hopefully he just made a mistake. Did he email you back?",
              "author": "kendledean123",
              "created": 1606114858,
              "upvotes": 5,
              "replies": {
                "gdb73vg": {
                  "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb73vg/",
                  "text": "Not yet. He should tomorrow but I’m so nervous and get sm anxiety waiting for emails from profs lol",
                  "author": "acitruscandle",
                  "created": 1606115288,
                  "upvotes": 3,
                  "replies": {
                    "gdb7tw0": {
                      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb7tw0/",
                      "text": "Seems like you and I are in the same boat with waiting for profs to email us back!! I’m having the same anxiety. I hope you’re professor gets back to you and that your grade goes back up!!",
                      "author": "kendledean123",
                      "created": 1606115955,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "gdb7v9x": {
                      "link": "/r/college/comments/jzcqlv/i_got_an_0_on_an_essay_i_thought_i_did_pretty/gdb7v9x/",
                      "text": "I wish you luck ;3; hopefully its a mistake",
                      "author": "ratsratsracoon",
                      "created": 1606115990,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634051144
}