{"sid": "bcfisq", "link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/", "title:": "I think my professor has actually lost it", "text": "I apologize as this is going to be quite long but I actually think this woman has gone crazy; We had lecture on Wednesday and it seemed to be a normal class, the only thing different was she said she had to cover for a colleague so she couldn’t have office hours that day. Fine by me. After the class she sent out a class wide email explaining that the whole class she had never seen us being so disrespectful and we made her day worse because of some “Tragic/traumatizing news” she received regarding a colleague. She had also individually emailed me asking me about a question I had in class that day. I tell her i’ve understood it now and thanked her for helping. She then emails me back saying that she had already explained why the exponent was negative 20-30 times and me asking that question had completely thrown off the flow of the lecture and told me I need to pay attention more and that it “can’t/won’t happen again.” Yesterday, We had lab without the professor and apparently she had done this to several other students as well. She has also sent several other class wide emails that just said “there will be a pop quiz on Friday with no equation sheet. be prepared.” Am I wrong for thinking that this woman has lost it? What happened to no stupid questions? Is this an okay thing to say/do?", "author": "shittyscrewdriver", "created": 1555086266, "retrieved": 1632802594, "over_18": false, "upvotes": 790, "upvote_ratio": 0.99, "comments": {"ekw2pg5": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekw2pg5/", "text": "You should reach out to the department head. One of my previous professors committed suicide... You never know when stepping in could help.", "author": "seekhappy2", "created": 1555270510, "upvotes": 1}, "ekrtbu0": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekrtbu0/", "text": "You’re lucky she sent that to you as an email. Now you have a record just in case.", "author": "TheManicMonocle", "created": 1555124663, "upvotes": 2}, "ekrs3by": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekrs3by/", "text": "I didn’t read any comments because this immediately reminded me of a story I was told. My dad had a professor who acted bizarrely and tested students on nothing that was assigned/taught. It got so bad they went to the dean. \n\n\n\n\n\n\n\nTurns out the professor had a brain tumor and died very shortly after that semester. If her behavior is erratic express your concern to the department chair. Could be a sign of something bad.", "author": "kiwimag5", "created": 1555123591, "upvotes": 3}, "ekrom28": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekrom28/", "text": "Maybe something happened and she snapped?", "author": "Digiatl_Pear", "created": 1555120662, "upvotes": 1}, "ekrld0u": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekrld0u/", "text": "I would firstly notify the school officials formally via email. Dont engage with her directly in the meanwhile. Save your questions for after class so it's not disruptive to class time which is short. While its rude the way she responded I cant say I dont blame her. My math class has 2 very loud disruptive students that regularly ask questions which were clearly defined previously. Dont be THAT person. Notify the school asap of your uncomfortable position to begin setting up a clear record in case there is questionable problems later.\nFor the record - this is not even close to some of the poor behavior I've witnessed. When the professor tells the class everyone who is conservative wants to kill every person of color - that's outrageous. Telling students that their behavior is unacceptable is well just honest. \nGood luck. Remember, not everyone will like you. But it's not a permanent problem.", "author": "yUmmmmmie", "created": 1555118059, "upvotes": 0}, "ekrko90": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekrko90/", "text": "She has no right to tell you off about asking a question. Even the smartest dude in my Calc class still ask to repeat shit. \n\nA really good prof is needed for Math. It just makes life so much better. And my prof is on top of making sure everyone is comfortable about asking any kind of question. \n\nMaybe she is going through some personal stuff and that’s fine. But to put down a student for not getting something is fucking absurd and I lost all respect for her.", "author": "GotoSenpai", "created": 1555117517, "upvotes": 3}, "ekrereb": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekrereb/", "text": "no matter what is going on in their personal lives, teachers and professors are getting paid to help students learn. yes, if someone is intentionally disruptive during class, it makes sense to tell them that they shouldn’t be in lecture if they’re going to act that way, but asking questions? sometimes the professor moves to quickly or you zone out for a second or don’t fully understand what they said before moving on, so out of concern for your education and dedication to the class, you ask the fucking question because otherwise why are you even there and why is the professor there?", "author": null, "created": 1555113040, "upvotes": 3}, "ekrbdod": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekrbdod/", "text": "I'm a professor. We all have bad days, us and you. This is my input:\n\nIf this is very atypical for her based off the rest of the semester, let it go. She may have had a bad day. \n\nIf she is a continuing problem, I would email the chair of her department and express concern. It's unfortunate but true, none of us are immune from mental health problems. It sounds more like that than anything else, IMO.", "author": null, "created": 1555110637, "upvotes": 11}, "ekr8n1i": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekr8n1i/", "text": "Professor had her hubby observe a class last semester. I thought he was great. Very quiet, just curious about the class, not an interruption. \n\nSome girls questioned why he was there (I'm the only Male so I know it was girls)\nThis led to our next class having her confronting students in front of others. \n\nHer contract was not renewed. \n\nInvolve administration and make sure you verbalize it. Maybe she needs a break. But you PAY to be able to question and learn.", "author": "Patrol720", "created": 1555108752, "upvotes": 6}, "ekr48v7": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekr48v7/", "text": "I've got nothing better to add than lol man", "author": "lifebidder", "created": 1555105812, "upvotes": 0}, "ekr1bm3": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekr1bm3/", "text": "You should totally bring it up to higher-ups. What worries me is that if you are interpreting this right, she is forgetting information and sending emails or continuing on with life not understanding why people aren't doing things in the way they would if they too did not have that information. Completely forgetting multiple conversations and emails or class times is not \"personal problems.\" It's \"did she have a stroke\" level of odd if she is not usually like this. \n\nDon't ask the higher-ups if she is mentally fit or be patronizing, just say that you and several other students are super confused about your interactions with her and you're worried about her and bring evidence of these interactions.", "author": "bubblegumpandabear", "created": 1555103911, "upvotes": 4}, "ekqy7sb": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekqy7sb/", "text": "I would contact someone - your academic advisor, the department head, another trusted professor.  If this is different than her normal behavior, it's possible that something happened, or that she is a danger to herself and/or others.  My institution has a \"tell someone\" hotline, you could do something like that too - it's more anonymous, but will help people who care look into that person's safety.", "author": "trustmeiknowthings", "created": 1555102038, "upvotes": 11}, "ekqxap2": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekqxap2/", "text": "I think she is taking her anger out on her students because due to the “tragic/traumatizing” event she has gone into complete disorder and doesn’t want to be teaching so she’s taking it out on y’all. And with your question if she really thought that simple of a question was that big of a deal she could have asked you nicely to come to office hours to discuss but she’s obviously out of line. Doesn’t make sense if you are specifically on that topic and have a question relating to it that’s unacceptable.", "author": "frenchfried5", "created": 1555101482, "upvotes": 10}, "ekqt719": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekqt719/", "text": "Email her department head and cc in the office of your college’s dean or president. If she is truly acting erratic, she poses a danger to herself and/or others.\n\nYou don’t have to write “she’s lost it!”, but something along the lines of “both my peers and I have some concerns regarding our professor...[details of incident, student witnesses, etc.].”", "author": "Vestibuleskittle", "created": 1555099107, "upvotes": 60}, "ekqs8mx": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekqs8mx/", "text": "I'm assuming you can't drop the class or change sections at this stage of the game. It might not be the most satisfying course of action, but I recommend just staying the hell out of her way til the end of the semester. Do the absolute best you can. Don't ask her any questions or send her any emails. You could complain, but I doubt it'd help. In my experience, the dean and the higher-ups always take the prof's side, and the complainer stands out even more as a grade-grubbing nuisance. Pour your frustrations out into your course eval and move on with your life.", "author": "wiskey_tango_foxtrot", "created": 1555098568, "upvotes": 23}, "ekqmmgm": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekqmmgm/", "text": "That's very unprofessional. Take it to the higher ups", "author": null, "created": 1555095383, "upvotes": 24}, "ekqhwfe": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekqhwfe/", "text": "[removed]", "author": null, "created": 1555092699, "upvotes": -24}, "ekqhppw": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekqhppw/", "text": "She sounds like she finally cracked and has been fighting/rejecting some clinical issue for years and she finally is too tired/old to keep it at bay with 0 tools.\n\nChange instructors if possible, if not keep all communications as I’m sure this will end up with the dean to save a good grade.", "author": null, "created": 1555092596, "upvotes": 6}, "ekq7yyw": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekq7yyw/", "text": "Id bet she has some personal things going on. If its becoming a big issue id suggest talking to her department head.", "author": "abimarie512", "created": 1555087113, "upvotes": 600}, "ekq7ud6": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekq7ud6/", "text": "In any case it's in emails/writing forever. If anyone's having a meltdown, try not to send emails to multiple people like this.", "author": "29in5months", "created": 1555087036, "upvotes": 242}, "ekq793b": {"link": "/r/college/comments/bcfisq/i_think_my_professor_has_actually_lost_it/ekq793b/", "text": "Sounds like she is going through some personal stuff, give her some time and it will get better, work might be an outlet for anger. It sucks but try to be understanding. If it persists for more than a few weeks and is affecting students grades and maybe talk to other professors in the department and try to see what is going on and let them know whats happening.", "author": "StableSystem", "created": 1555086677, "upvotes": 93}}}