{
  "sid": "qda8w7",
  "link": "/r/college/comments/qda8w7/indecisive_for_spring_four_year_undergraduate/",
  "title:": "Indecisive for Spring. (Four Year Undergraduate Journey)",
  "text": "I would really appreciate some suggestions for what to do this spring semester (or sharing your story will be appreciated as well.) \n\n\nBasically, I started my undergraduate journey in 2017 and I’ve transferred to so many cc’s and universities since then. I’ve taken involuntary breaks and changed majors in between each transition, which has obviously prolonged getting my bachelors degree. Due to multiple circumstances, I withdrew from the university I’ve attended for the past year this September. It has really been messing with me that I am once again not in school. This mostly happens due to the financial aspect of college that makes pursuing a degree seem impossible. I currently have 89 credit hours towards a media production degree. Unfortunately, I don’t plan on going back to my university. Beside being unable to afford it, I don’t like the education the university provides. I enrolled back to a cc I absolutely love in a desperate attempt of not doing anything for a semester, but it is too far into the semester to start there. I don’t know if I should apply for spring semester to now pursue an associates in anything else at this point but I don’t know if I should because I feel like I’m going backwards. I feel incredibly lost. I don’t know what to do anymore and I’m not good at math or science to top it all off.",
  "author": "generation_feelings",
  "created": 1634881136,
  "updated": 1635184745,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hhl6naw": {
      "link": "/r/college/comments/qda8w7/indecisive_for_spring_four_year_undergraduate/hhl6naw/",
      "text": "So you may already know this, but in case you don't, a certain number of the credit hours in your major must be obtained from the university you graduate from. It didn't apply to gen eds at my school so that may hold true for other schools as well, but the major credits are by and large true across most places.\n\nYou need to stop transferring schools. If you are set on a media production degree, it is possible you may be locked into your last school based on number of credit hours you have. Pick a school and stick with it. Work with admissions office and/or academic advisors to figure this out.",
      "author": "SouthernRhubarb",
      "created": 1634881993,
      "upvotes": 2,
      "replies": {
        "hhl97vg": {
          "link": "/r/college/comments/qda8w7/indecisive_for_spring_four_year_undergraduate/hhl97vg/",
          "text": "Thank you so much for your response. I definitely need to do so.",
          "author": "generation_feelings",
          "created": 1634884005,
          "upvotes": 1,
          "replies": {
            "hhmlspe": {
              "link": "/r/college/comments/qda8w7/indecisive_for_spring_four_year_undergraduate/hhmlspe/",
              "text": "Good luck!",
              "author": "SouthernRhubarb",
              "created": 1634914793,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}