{
  "sid": "qssc2j",
  "link": "/r/college/comments/qssc2j/how_to_deal_with_fomo_social_anxiety/",
  "title:": "How to deal with fomo / social anxiety?",
  "text": "I just missed out on this dance/dinner that’s happening tonight hosted by a club at my university.  Basically, the tickets for it sold out and a few friends I know are going and I feel bad that I didn’t ask them if they were going.  I wasn’t really trying to go alone because that was gonna be kinda pointless.  I feel bad because like I don’t really have much to do this weekend anyways.     \n  \nHowever, I did end up biting the bullet and asking them if they were going to this one other concert in a few weeks and they said yeah and I got a ticket for that so I’m excited.  However, I still feel bummed about missing out on the stuff going on tonight, especially since I could have just asked and got the ticket a couple days ago.  🙁   \n  \nIdk, I just feel like I haven’t hung out with my uni friends at all outside of eating dinner with them and just talking in clubs.  Also, is it bad that I don’t want to go alone?  Usually I can recognize people. But, I don’t want to just join my friends if they are with people idk, especially if they are coupled up.  But whatever.  I need to catch up with sleep anyways.",
  "author": "Bugler2",
  "created": 1636774349,
  "updated": 1637182013,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkf2mm5": {
      "link": "/r/college/comments/qssc2j/how_to_deal_with_fomo_social_anxiety/hkf2mm5/",
      "text": "One of my biggest regrets from college is how much “FOMO” stressed me out. As someone who is now done with college, let me just stress how much it doesn’t matter. Don’t waste your time regretting how you missed out on x event, it’s not productive and really doesn’t bring anything positive to your life. If it’s really stressing you out, just try and attend an event next time you have a chance (which it seems like you did with the concert!). \n\nAlso, I don’t think it’s weird to not want to go to things alone. I’ve been to a few events alone before and I only didn’t regret one of them- most of them sucked and I have a much better time going to things with at least one person I know. I admire people who can attend events alone but it’s not for everyone and that’s fine.",
      "author": "ludgatedwyer500",
      "created": 1636775166,
      "upvotes": 2,
      "replies": {
        "hkf3h0i": {
          "link": "/r/college/comments/qssc2j/how_to_deal_with_fomo_social_anxiety/hkf3h0i/",
          "text": "Hearing it from you, it does sound stupid to stress out about FOMO.  Like, the ship has sailed and there’ll be something else that I can go to, if I really want to.  \n  \nAnd, I’m a freshman.  That event is gonna be held again in 12 months so I can go then.  Also, now I’ll be aware of it and I already have some guys I can hit up ready to go 12 months in advance.  \n\nThanks for the insight!",
          "author": "Bugler2",
          "created": 1636775619,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkfmeld": {
      "link": "/r/college/comments/qssc2j/how_to_deal_with_fomo_social_anxiety/hkfmeld/",
      "text": "Honestly, I wanted to go out tonight, joined the pre-party, and they took too long to get going. You’re not missing out on much honestly.. I became bored and left. \n\nFrankly, it’s different if you’re hot and socially outgoing but I don’t really care honestly.",
      "author": "elpresidentdeusa",
      "created": 1636787869,
      "upvotes": 1,
      "replies": {}
    }
  }
}