{"sid": "7mm5ol", "link": "/r/college/comments/7mm5ol/my_guide_to_a_40/", "title:": "My guide to a 4.0", "text": "**Background:**\n\nI graduated somewhat recently in physics and applied maths with a cumulative GPA of 4.00. I've seen a lot of posts here on r/college over the last few years of people freaking out over their grades and/or looking for advice on how to do well, and maybe some of what I've learnt could help others. Obviously, this stuff is aimed towards STEM since that's all I really know, but general tips map over to the humanities. These tips are in no particular order, just whatever comes into my head. Most are probably (very) obvious, and it's long. I've also TA'd for numerous classes, so if you have more specific questions r.e. maths or physics study or heading into grad for either, I can answer in comments or PM. This is certainly not an exclusive list, it's just a general one.\n\ntldr: \n\n - Go to class\n\n - Pay attention in class\n\n - Do the work\n\n - Put effort into the work\n\n - Plan ahead\n\n - Read the goddamn syllabus\n\n - Get help early\n\n - If you need accommodations, get them\n\n - Be nice to the professor\n\n - Be extra nice to the department administrator/receptionist/etc\n\n - Study to the tests/exams\n\n - Don't say you'll do better \"next time\"\n\n - Know how you learn best\n\n - Have your priorities straight\n\n - Be prepared to let it all go\n\n\n--------\n\n**Go to class**.\n\nIt shouldn't need to be said, but there it is. Even if the class is boring as all hell and you think you already know it all, go anyway. Some classes take attendance, some give pop-quizzes, some offer extra material not available online or in any recordings/notes, but it's just a good idea to be present regardless. Our brains form associations really quickly, so you'll learn better in the lecture hall that you always learn in rather than sitting at the desk you regularly play computer games at. You'll also be able to ask for clarification in real time, which no recording or personal study will ever afford you. Plus, it gets you in the professors good books, or at least helps keep you out of the bad books. That's incredibly important. \n\n**Pay attention in class**.\n\nOnce you're there, you need to actually listen. No browsing on your phone, no checking twitter on your laptop, no chatting with your neighbours, and no work from other classes. You should be paying such ardent attention that you are exhausted at the end of a 1-hour lecture. You will undoubtedly fail occasionally, but you need to force yourself to refocus every time. Do whatever you have to in order to keep paying attention. For me, that meant always taking notes by hand even if notes were printed and handed out to us by the professor before class. I never revised by my own notes, but it was important to take them anyway. The more effort you put in to learning it the first time around, the less work you need to do outside of class.\n\n**Do the work**.\n\nAgain, should be pretty clear why, but this is the biggest reason why people fail IME. It's actually really *hard* to fail a class if you give every assignment a proper try and hand them all in on time. Even if you know you've left it way too late and can't possibly get it completed, a half-assed 50% is magnitudes better than a 0%. \n\n**Put effort into the work**.\n\nNever hand in any piece of assessment as \"good enough\". Your final-copy 5-page assignment in maths should originally be a 20-page draft when you include your additional derivations and long-working. Don't skip steps: it doesn't make you look smarter, it just makes mistakes easier. I will happily expand out factors term by term if it avoids a mistake. Do your work neatly and follow standards in setup/layout. Chicken-scratch ramblings don't get a prize; the less pleasant your work is to mark, the less lenient markers will be. Remember that there is a human marking your work, so intersperse the maths with some words explaining what you're doing and why. You can still be awarded marks for correct reasoning even if you make a foolish mathematical error somewhere. This also applies to exams and tests: if you make a mistake somewhere but can't find it or don't have time to fix it, make a note of it on the paper. If you really run out of time, list the steps you *would* have taken. That'll get you something too. Also do sanity checks on your results: you've probably made a mistake if the ball is travelling faster than c.\n\n**Plan ahead**. \n\nLife is shitty, and shitty things happen unexpectedly. Maybe your car breaks down, maybe your neighbours keep you up with loud music all night, maybe your dog is sick, maybe your computer fails spectacularly, maybe the power gets cut off, and maybe you just plain forget something. Have reasonable contingencies for these sorts of events. Leave a little earlier to account for any delays in travel, finish your work a day or two earlier, keep backups in multiple places, email yourself copies of important documents, set copious alarms, and have some kind of planner. Know when difficult weeks are coming up and start things earlier than usual to reduce workload later on. Being organised is probably the *most important* thing you can do to ensure success. Your memory and ability to react quickly and reasonably to complex situations is really not that great, so craft these safety nets ahead of time. It's enough to simply have a plan that you are aware of. Fix problems *before* they are problems. \n\n**Read the goddamn syllabus**.\n\nDon't get caught out by participation marks after you've already missed half of the lectures. Know how much different sections are worth and roughly when they are due (some due dates may change). Be aware of minimum requirements, especially for lab classes. All of my classes had rules that you had to get >45% in all of the lab, homework, and exam portions in order to pass the class. If you got 70% overall but 40% in the lab portion, too bad - you fail. A syllabus is not a legally binding contract, but they are quite important nonetheless. Also, **keep the syllabus**. Partly in case you need to dispute something, but also, in some situations when transferring credits, universities will ask for the syllabus from your classes to judge equivalency. They are usually required to be from the correct semester/year as well IME, so no sneakily grabbing a newer one.\n\n**Get help early**.\n\nIf you struggle to understand something in week 1, get help for it in week 1. Not week 2 and not week 13, *week 1*. Your problem with the content doesn't go away once the class moves on, it just starts festering under the surface and jeopardising everything you learn past that point. This also applies to mental health or other extreme personal circumstances. Professors and administrators can do a lot to help you early on in semester with medical withdrawals and the like, but they can't do much at all to help past a certain point. Don't look at asking for help as \"begging\", but rather as taking agency over your own learning and your own life, and recognising when you need more information/support to work at your best. You cannot control what happens to you, but you *can* control how you deal with it. \n\n**If you need accommodations, get them**.\n\nIf you know you have ADHD or are prone to mental illness like Depression, get the required documentation and get accommodations from your university. It isn't some dick-measuring contest to see how long you can go without your meds and there's no gold star for foregoing all treatment. University life is *tough* for a lot of people. If you try to go it alone and fail, *you* are the one who suffers from that sort of hubris. I had accommodations for issues with concentration and processing speed. My internals and labs were great, but my early tests were consistently 20% lower; having accommodations simply levelled the playing field and made my grades more regular. Real life is not like an exam and you do not need to sit under the same conditions. If you need an extra 30 minutes or a quiet room to work in, get it. Having these accommodations can also help with requests for extensions or leniency in marking if you suddenly fall ill. It certainly saved my ass a few times. \n\n**Be nice to the professor**.\n\n(Assuming they're a reasonable human being, of course) In many classes, the professor has a lot of power. They set the rules of their class and they are also free to bend those rules as they see fit. If the professor likes you, they may give you an extension when you're stressed out or simply forget homework, will invest more time and energy into your learning, offer you extra opportunities in their field, act as great letter writers later on, and simply be a great addition to your network. Many of the things I achieved during undergrad came from my contacts with professors, who then pointed me towards friends with good opportunities in national labs and prestigious universities. The person with the personal contact wins every time. \n\n**Be extra nice to the department administrator/receptionist/etc**.\n\nProfessors are actually kinda clueless when it comes to the running of the department, but the local head administrator knows all. Befriend the person who's actually in charge and you'll never be stuck in endless loops of administration bullshit ever again. Hiring opportunities inside *and* outside of the department flow through this person first, as do many applications afterwards. Forms you need to fill out will pass this point as well, and they are often the ones with a tight hold on the money-strings. They also know their equivalent in other departments, and can get you priority meetings/appointments. They are typically well-known and very well-liked, and their seal of approval on you carries weight. \n\n**Study to the tests/exams**.\n\nDon't do 100 problems out of a dusty textbook your professor has never used as the format and method of solution will be slightly different. When you're first learning something, using multiple distinct methods can throw you off and you gain nothing from the exercise. Look at previous exams if available through your library to get a feel for the general format, as questions tend to be similar over the years. If these are not available, then use previous questions set to you or other questions from the same pool. Study strategically to match. \n\n**Don't say you'll do better \"next time\"**.\n\nSo many of my friends would get 60% in an assignment, brush it off immediately, and say they'd just make up for it next week. They never did. Assume your grades will *decline* over the course of the semester as you become stressed and burnt out, so put effort in early. If you get a poor mark, organise to discuss your mistakes with the professor ASAP. For the next assignment, ask to have it checked a day or two *before* you submit it. Professors and TAs are usually more than happy to review drafts of substantial work before submission, you just need to ask and be willing to hear criticism. It is not an attack on your character, they are literally just telling you what you need to do to earn a higher grade by the rubric they have. \n\n**Know how you learn best**.\n\nIf you do your best work between 7pm-9pm, then save tough things for that time. If you find it hard to get up and pay attention in 8am classes, try to avoid signing up for classes at that time. If you know which professors teach to the style you like to learn in, take their section if available and suitable. But always be reassessing these methods. If the evidence of your results isn't backing up your statements, you need to figure out what's going wrong and fix it ASAP. Keep your fingers on the pulse at all times and be ready to adapt. \n\n**Have your priorities straight**.\n\nKnow how important your grades are to you from the beginning and stick to that. After a terrible run in high school, I decided that I wouldn't settle for any kind of mediocrity and whenever I lost focus, I reminded myself of that goal. Don't say that you want top grades and then act completely opposite to that statement. But don't go too far the other way either: if you get to the end of your degree and have nothing but a 4.0, then you've wasted a lot of your time. You need to have experience in your field and other things going for you. Know what is important/necessary and what is not for your specific goals and living situation. If you need a supermarket job to pay the bills, keep it. If you really don't need the money, find something more constructive and relevant to do with your time. \n\n**Be prepared to let it all go**.\n\nGetting \"good\" grades is a matter of effort, planning, and natural aptitude in some measure. Graduating with a 4.0 specifically is pure luck. Even a headache on the day of an important exam can send things down the drain, and no matter how well you plan ahead, random events *will* affect you. I failed in plenty of the above tips over the last 3 years. I skipped out on weeks of classes because I thought I knew everything, I didn't plan ahead properly and had horrible all-nighters, I tried to get through without disability accommodations, I allowed myself to get so ill as to not hand in assignments, and I crammed for exams. Blind luck and the curve pulled me through every time, but it could easily not have. Finishing with a 4.0 is nice, getting that sweet medal is cool, but it means next to nothing the day after grades are released. After you land that first position, it really won't mean anything at all. Keep the achievement in perspective and don't lose sight of the things that really matter at this point in your life, whatever that point is. But if you want that 4.0 just as a personal goal and keep sight of everything else, don't let people dissuade you from it or convince you that you should care less. If you want to set the bar high, make sure it's feasible but then hold yourself to it. ", "author": "NoxiousQuadrumvirate", "created": 1514461716, "retrieved": 1632802736, "over_18": false, "upvotes": 636, "upvote_ratio": 0.97, "comments": {"dsuymm6": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/dsuymm6/", "text": "Why is s 4.0 important? I can get 3.0 for scholarship reasons and grad school,  but unless you're at ivy league school digging for complete mastery,  don't put yourself through this shit.", "author": "wordsworths_bitch", "created": 1516263646, "upvotes": 1}, "drw9z8j": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drw9z8j/", "text": "[deleted]", "author": null, "created": 1514522964, "upvotes": 0}, "drvvvtb": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drvvvtb/", "text": "I want to add a few things:\n\nGET MENTAL HEALTH TREATMENT.  like, NOW.  Social anxiety, panic attacks, depression, binge drinking, eating disorders and a whole lot of other shit begin to manifest in college.  If you don't demand help and follow a treatment plan-your fucking yourself over.\n\nGet tested for learning disabilities.  Figure out a treatment plan, and stick to it.\n\nFor the love of god, figure out what direction you want to go.  Volunteer.  Join some clubs.  Try out different jobs.  Start talking to a career planner.  Talk to a temp agency about trying to find some temp work in what you think you want to major in.  Volunteer at some non profits.  Remember that English, Psychology, Liberal Arts and History Majors can, have and often score good, decent paying jobs-just like the STEM majors do after gradation.  It comes down to the connections you make NOW.  Do NOT wait to make connections with employers until summer before Senior year and you bust out on internships (it happens, even to the brightest) but if you have volunteered, done temp work or other projects, that should can and has made up for the lack of college based internships.\n\nGetting drunk/party harder-If you are attending a \"party school\" to party, get wasted and drunk-go home.  Get your own apartment and get wasted with your friends back home.  Why the hell are you stupid enough to spend $40+ grand a year for the change to drink all weekend?  If the only reason your at college is for the party scene, your here for the wrong reasons.\n\nSometimes, no matter how hard you try, no matter how much you do everything right-a  D+ is the best your gonna do.  Take me for example-I can handle my own personal finances, I can do my own taxes, manage my bills ect.  Sit me down in a Pre-Cal Class?  All the tutors in the world, all the wanting in the world, tears, pleading and holding my hand writing the stuff down on the paper-I'll still get a D+ if I score a hail mary.", "author": null, "created": 1514505011, "upvotes": 8}, "drvucy2": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drvucy2/", "text": "One of the biggest for me has been researching professors before selecting their class. ", "author": "Catswagger11", "created": 1514503181, "upvotes": 9}, "drvr8ev": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drvr8ev/", "text": "Are you going to apply to graduate school, if so what program?", "author": "_PharmStudent", "created": 1514499530, "upvotes": 1}, "drvo808": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drvo808/", "text": "Wait, I don't see blackmail or sleeping with your prof on here? What kind of list is this anyway?", "author": "Dante472", "created": 1514496203, "upvotes": 25}, "drvnjm4": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drvnjm4/", "text": "Basically this is everything you learn to do on your own aside from college. I'm 30 and going back to college, instead of blowing it off like 10 years ago, all I do is what is in the syllabus and I get A's. It's that simple. Just like with a job, you show up on time do what your told and you don't lose your home and food. If you aren't going to school to escape this kind of life then it will probably be difficult feeling motivated. Just do the work, its that simple, don't learn the hard way.", "author": "-Kaneki-", "created": 1514495472, "upvotes": 5}, "drvn7wd": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drvn7wd/", "text": "I’m going to guess you don’t have a job OP? Because having a job certainly puts a strain on a GPA. \n\nAnd I personally don’t see how people can struggle in school when they have no job considering that takes a lot of time out of people. Try and argue with me if you want, but if you have no job and have a decent good GPA, I wouldn’t be surprised or amazed.\n\nEspecially people who work 40 hours a week and go to school. That’s difficult. Having no job and doing school is easy.", "author": null, "created": 1514495118, "upvotes": -1}, "drvl2jk": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drvl2jk/", "text": "Sadly though at my University the second you say you have a mental illness even if you provide diagnosis they require you to get tested with a test that is 700-1,000 and it's not covered by insurance. ", "author": "tmbrown7", "created": 1514492745, "upvotes": 7}, "drvh8xf": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drvh8xf/", "text": "This is good advice but some people just aren’t as smart as others and take longer than a semester to grasp the material.\n\nI put in crazy amounts of work for my linear algebra class and still ended up with a C+. \n\nI studied every day for hours using notes, practice exams, flash cards, office hours, math labs. \n\nNo matter what there was no way I could remember every formula or theorem that was on the final. Class averages were 60% mid 40% mid2 and 50% final.\n\nI spoke with students that did well in class and their answer was that they were either taking the class a second time or they had already learned it from high school in their native country (usually China).", "author": "ChimpVision", "created": 1514488555, "upvotes": 28}, "drvgqe9": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drvgqe9/", "text": ">Go to class.\n\nA thousand times this. It's so simple, but people fall in the trap of being lazy and skipping. Some people almost see it as a point of pride: \"hah man I've only been to like 2 classes this whole week lol!\" They think it's \"cool\" and \"edgy.\" \n\nIt's just idiotic. You're an adult now. Show up.", "author": "Chi_FIRE", "created": 1514487998, "upvotes": 22}, "drverli": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drverli/", "text": "Sometimes it doesn't matter how hard you try. My school grades on a curve, 6/50 students received a 4.0 in my computer science class between two sections. Professors get in trouble if the class average beind too high, thus exams get harder and work gets graded more harshly.\n\nDid you get below a 90 on a midterm/exam/major project? Kiss that 4.0 goodbye.", "author": "kitpanda", "created": 1514485881, "upvotes": 14}, "drve8yi": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drve8yi/", "text": "I've tried for a 4.0 every semester and it never happens. There's no point even trying anymore.", "author": "SoulfulYam", "created": 1514485327, "upvotes": 5}, "drvc4gg": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drvc4gg/", "text": "Great post! I would add: get enough sleep! People tell me that they can survive on 4 hours of sleep a night but their grades would disagree. If someone does pull a 4.0 sleeping 2-4 hours a night, they are the exception and not the rule, and more sleep doesn't hurt.\n\nAlso, try to create a daily or weekly routine or schedule. For example, if you have four classes, devote 1-2 hours each day per class, or if you have specific recurring tasks like lab write-ups or problem sets to complete, schedule them for particular time-slots on particular days. This is called time-blocking your tasks. When you develop this routine it makes it easier to stick to it rather than blow it off or procrastinate. And in many cases you can create it so that you regularly finish your important work far ahead of the deadlines so you rarely feel rushed to finish work.\n\nFind your work space. Your workspace is simply the place that you are objectively the most productive. NOT the place where you THINK you will be the most productive. Measure how much work you get done at various places, and choose the place where you accomplish the most as the place to go when you need to finish work. For me, that is a coffee shop. For others it might be the library. It rarely is at home where you have your TV, video games, and bed softly calling to you while you try to concentrate.", "author": "peregrin5", "created": 1514483036, "upvotes": 33}, "drv7t99": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drv7t99/", "text": "[deleted]", "author": null, "created": 1514478289, "upvotes": 1}, "drv6o2j": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drv6o2j/", "text": "Additional note; getting great grades isn't as important as having a great understanding of the material. Usually they're the same but not always. Make sure you grasp the subtleties and nuances of your studies.", "author": "1millionbucks", "created": 1514476992, "upvotes": 153}, "drv6jhw": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drv6jhw/", "text": "Actually my professor said don't just study to the exam. At least if you're going into a healthcare profession. However most of us don't have time for that I suppose ", "author": "crasheredall", "created": 1514476843, "upvotes": 6}, "drv63jb": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drv63jb/", "text": "I get so nervous talking to my professors. How do you talk to them and get them to remember you?", "author": "Bluish-green", "created": 1514476329, "upvotes": 9}, "drv5c72": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/drv5c72/", "text": "This makes me so happy to know that people succeed in the Major that I dropped since the first day.", "author": null, "created": 1514475416, "upvotes": 56}, "druy4iy": {"link": "/r/college/comments/7mm5ol/my_guide_to_a_40/druy4iy/", "text": "Great post OP. I would add a section on maintaining one's physical/mental health. It's Equality important when it comes to doing well in college. Thank you! ", "author": null, "created": 1514463287, "upvotes": 19}}}