{"sid": "pww8xp", "link": "/r/college/comments/pww8xp/should_i_feel_bad_for_wanting_to_switch_majors/", "title:": "Should I feel bad for wanting to switch majors because of a bad experience with a teacher as a freshman?", "text": "So first off I'm a freshman, first semester this year at a local community college, major is computer science, and my question may sound dumb, but I'm rather self conscientious about things relating to college. (For reference, I'm not currently taking any computer science related courses as none were offered this semester fully online)\n\nSo I had to have a advising meeting with the professor who oversaw computer related degrees (I would find out later I would did not have to actually).  A person before me came on and asked how long it would take for him to graduate. He listed his courses he was taking, all remedial, and the professor starts yelling at him saying have you thought at all about this major? The professor continues, berating the kid, who was also a freshman in his first semester. He barked, This major is tough, it is not for stupid people! You are taking remedial courses, even by taking summer and winter courses you may not graduate on time! You need to think about your major before you even go into college! You cannot so easily just change your major halfway through! \n\nI thought this was really inappropriate for him to do and may have honestly disheartened the dude to the point where he may not continue with college.\nAfter the professor finishes yelling at the student, he calls me up. I have mic issues at the time and he yells at me, Fix your microphone! I can't help you if I can't hear you! I will come back to you later.\nSo I message him in the chat since my mic isn't working, but he rebukes me telling me that he can't help if my microphone isn't working. \n\nSo I sign off for now and look up the guy online. Apparently, he teaches , for some reason, almost all the computer science related courses. I'd have to tip toe around semesters to avoid him. I then looked him up on some rate your professor sites and he's rated like a solid 2.5/5. It was an even mix between 5* and 1*. I really don't want to go near him at all. \nThe reason I chose computer science is because I have a reasonable understanding of C++ and had enjoyed learning it and could see myself working in I.T. or as a coder, but now I don't want to at all. I can't help but feel bad that I don't want to pursue this career at all. I also feel conflicted because I'm not sure what else I'd major in (not that I'm deadset on computer science, it's just I don't know what I want to do). Also some of his words kind of sting because they feel true, such as you should've really thought about your major before picking it.\n\nShould I feel bad about wanting to change majors? Or should I try out a class with him and go into computer science?", "author": "SilverHammerFrank", "created": 1632795027, "retrieved": 1632945537, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hek3qyu": {"link": "/r/college/comments/pww8xp/should_i_feel_bad_for_wanting_to_switch_majors/hek3qyu/", "text": "Assholes are everywhere, you can’t escape them. STEAM professors tend to be a bit more arrogant tho (I’m a 4th year chemical engineering student). Don’t drop out, toughen up 🙂 (I’m not saying that to be rude or condescending, but people like your professors don’t go away. If you don’t find them in STEM, you’ll come across them in arts and so on.) \nComp sci is a very good program and graduates make good money… think long term.", "author": "East-Willow6341", "created": 1632803056, "upvotes": 1}, "hek0ogs": {"link": "/r/college/comments/pww8xp/should_i_feel_bad_for_wanting_to_switch_majors/hek0ogs/", "text": "If the issue is genuinely just with the one teacher then there’s no need to change your entire major. But maybe there’s an issue with the teacher because of some issues with your engagement with the material or the discipline’s expectations which could mean that the major is not right for you. So you need to be very honest with yourself.", "author": "renebeca", "created": 1632801241, "upvotes": 1}}}