{
  "sid": "prmhfj",
  "link": "/r/college/comments/prmhfj/im_done_tonights_my_deadline/",
  "title:": "I'm done. tonight's my deadline...",
  "text": "Well tonight was my deadline for final papers. I can save 1 class. But it's too late for the others. Between evacuation from the wildfires, and then myself and my kids getting covid, and i started a new job. All within 5 weeks, I'm exhausted. And sad, and stressed af. I think i need to apply for a hardship or something, any suggestions? I'm looking for validation or something. Have any of you had to just let go of school for a bit and just accepted an \"F\" because well, you're just sick of all of it?",
  "author": "nonya33",
  "created": 1632107534,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hdkcmen": {
      "link": "/r/college/comments/prmhfj/im_done_tonights_my_deadline/hdkcmen/",
      "text": "[removed]",
      "author": null,
      "created": 1632122168,
      "upvotes": 1,
      "replies": {}
    },
    "hdjvymf": {
      "link": "/r/college/comments/prmhfj/im_done_tonights_my_deadline/hdjvymf/",
      "text": "Yah it may seem hard, But there should be recourses to help.",
      "author": "npcterraria",
      "created": 1632110403,
      "upvotes": 1,
      "replies": {}
    },
    "hdjtlpd": {
      "link": "/r/college/comments/prmhfj/im_done_tonights_my_deadline/hdjtlpd/",
      "text": "Email your professors right now. This is why the incomplete grade exists. It allows you to negotiate finishing the coursework at a later time due to hardship.",
      "author": "SouthernRhubarb",
      "created": 1632109066,
      "upvotes": 1,
      "replies": {}
    },
    "hdjsadi": {
      "link": "/r/college/comments/prmhfj/im_done_tonights_my_deadline/hdjsadi/",
      "text": "First, I’m sorry this has happened. Sounds like you have been through Hell and back. \n\nEmail your professors right away. Explain the situation and that you tried your best. If they don’t help then go to either the department head or dean of the college.",
      "author": "TC_Knight",
      "created": 1632108367,
      "upvotes": 4,
      "replies": {
        "hdjwkfk": {
          "link": "/r/college/comments/prmhfj/im_done_tonights_my_deadline/hdjwkfk/",
          "text": "I emailed them when we got evacuated. I got extensions for midterms, and i did pretty well on the midterms, but then we all got sick and I feel like a shit bag emailing them again. Should i just ask for an incomplete? I start a training seminar tomorrow and i won't have time to do finals. One week to fix this and I don't think I have the motivation to force myself to even try.",
          "author": "nonya33",
          "created": 1632110760,
          "upvotes": 1,
          "replies": {
            "hdk00fm": {
              "link": "/r/college/comments/prmhfj/im_done_tonights_my_deadline/hdk00fm/",
              "text": "You can ask the professors directly, but your probable best first step is to speak to the Dean of Students about advocating for the incompletes you may need (this is a different office from the academic dean of the particular college). Then, they can help reach out to professors to validate your situation and indicate that you’ll be reaching out to them if you haven’t already. The sooner you do this, the better.\n\nThe department chair and/or academic dean most likely won’t get involved as this is an issue between you and your professors. You can try escalating if one or more won’t work with you, but it’s ultimately up to each professor as to how it’s handled for each course.\n\nSo, to recap, contact the office of the Dean of Students immediately to discuss your situation and attempt to get formal advocacy from them. Then, you will be better situated to work things out with each professor.\n\nGood luck!",
              "author": "PhDapper",
              "created": 1632112872,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634056757
}