{
  "sid": "qyn1rr",
  "link": "/r/college/comments/qyn1rr/thinking_of_getting_an_online_degree_from_a/",
  "title:": "Thinking of getting an online degree from a public college but",
  "text": "This may seem like a strange question, but if I get a degree from a public college online like Florida or Arizona State (strictly using as an example) would it be weird for me to act as a proud alum of that college or would I seem weird supporting my university and when people ask me where I went to college and have to follow up with “I did it online”\n\nA big motivation for this so I can be a part of a community, networking and expanding knowledge my overall knowledge. I know a lot of you may say who cares what other people think but I guess I want the university experience without the social aspect of it and once I graduate I want to be a big supporter of that university. Is that weird if I am just an “online student”?",
  "author": "RanchWilder88",
  "created": 1637468930,
  "updated": 1637689184,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlh6rn1": {
      "link": "/r/college/comments/qyn1rr/thinking_of_getting_an_online_degree_from_a/hlh6rn1/",
      "text": "I’m going to get my masters online it’s perfectly fine however it fits for you",
      "author": "arcanelove13",
      "created": 1637472942,
      "upvotes": 5,
      "replies": {}
    },
    "hlh2ty9": {
      "link": "/r/college/comments/qyn1rr/thinking_of_getting_an_online_degree_from_a/hlh2ty9/",
      "text": "It'll seem less weird as time goes by because more and more people will do it, esp. at a place like ASU. When people ask \"where did you go to school,\" they're asking about an institution, not a location. You would say \"I went to ASU\" and that would be true.",
      "author": "trunkNotNose",
      "created": 1637470541,
      "upvotes": 3,
      "replies": {}
    },
    "hlhe6bm": {
      "link": "/r/college/comments/qyn1rr/thinking_of_getting_an_online_degree_from_a/hlhe6bm/",
      "text": "Not weird at all! Once you get into your major you'll notice the same people in your classes as you interact and it builds a relationship without even trying. On that level also, you interact quite a bit with professors through Zoom. I have even had a professor in an online class have us make flipgrid videos for discussions instead of normal discussion boards. I don't take all of my courses online, but you have just as much right to feel like a proud alum than anyone else!",
      "author": "Mammoth-Title-2102",
      "created": 1637478109,
      "upvotes": 4,
      "replies": {}
    },
    "hlhn6fd": {
      "link": "/r/college/comments/qyn1rr/thinking_of_getting_an_online_degree_from_a/hlhn6fd/",
      "text": "I have school pride for all the schools I went to. Doesn’t matter if they were online you are part of that community. I think it would be weird to have a flag or some thing at your front door if you got a certificate but some people are fans of a university and never went or got a degree so maybe it’s not off base.",
      "author": "beanie1816",
      "created": 1637484837,
      "upvotes": 2,
      "replies": {}
    },
    "hlh0gzs": {
      "link": "/r/college/comments/qyn1rr/thinking_of_getting_an_online_degree_from_a/hlh0gzs/",
      "text": "Yes",
      "author": "Shankens",
      "created": 1637469138,
      "upvotes": 1,
      "replies": {}
    }
  }
}