{
  "sid": "imild0",
  "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/",
  "title:": "Too stupid to do basic math but too embarrassed to ask for help",
  "text": "I've struggled with math since high school, but have never gotten tutoring or been able to improve my skills. Now that I'm in college, I only need to do one simple math class to graduate. Though I thought it would be easy, I've started to struggle, but I'm embarrassed to ask my instructor or other classmates for help because, as I've said, the content is really simple, and I seem to be the only person struggling with it. What should I do?",
  "author": "Adam_Drivers_Ass",
  "created": 1599235198,
  "over_18": false,
  "upvotes": 1120,
  "upvote_ratio": 0.99,
  "comments": {
    "g45bd8n": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g45bd8n/",
      "text": "I second all of the suggestions in this thread and also especially second looking into dyscalculia. If you think you may have that, please contact your student accessibility/disability office! Chances are that they may have some recommendations for tutors who have worked with this case, course substitution offerings, more time on the tests, etc. You are not alone in this and should not feel embarrassed at all. The people at your college will want to see you succeed and will help you to do so, but they only can if you ask.  Good luck with your class!",
      "author": "petiterunner",
      "created": 1599328419,
      "upvotes": 2,
      "replies": {}
    },
    "g453je8": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g453je8/",
      "text": "You’re in college to learn. Ask for help, you are paying for it after all. You’re probably not the only person struggling but pride is a tough thing to combat. Your school should have tutoring available. Also if you want some practice freerice.com has different subjects and will give you questions and every one you get right rice is donated to third world countries.",
      "author": "CatMurphy16",
      "created": 1599324405,
      "upvotes": 3,
      "replies": {}
    },
    "g43a4nb": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g43a4nb/",
      "text": "Asking for help is nothing to be ashamed of! I’m a math tutor & I specifically tutor calculus. You would be surprised how many calc students struggle with the basics. Shoot, when I started I couldn’t even do the basics myself! It’s all part of the learning process. Math is hard no matter the level. Go to tutoring, we love helping other students & get just as excited when they do well (:",
      "author": "CaptainJules11",
      "created": 1599287456,
      "upvotes": 2,
      "replies": {}
    },
    "g438mvp": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g438mvp/",
      "text": "There’s no shame in asking for help. No ones perfect. Talk to your teacher privately if you’re embarrassed to talk to them in front of the class, or attend the office hours/TA sessions",
      "author": "EmCeeIndieBoi",
      "created": 1599286389,
      "upvotes": 2,
      "replies": {}
    },
    "g438gyz": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g438gyz/",
      "text": "This can help, not only with getting work done, but explanations.\nhttps://www.mathway.com",
      "author": "chrisbensch",
      "created": 1599286276,
      "upvotes": 2,
      "replies": {}
    },
    "g437etw": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g437etw/",
      "text": "Idk, I’m in a top engineering school studying some fancy sciency thing and just completed calc 3 before stepping on campus. But that doesn’t mean I don’t struggle with math. I have dyscalculia which is like dyslexia for math. Not really a specific diagnosable thing, just a general term meaning a learning disability specifically in math. For me it’s arithmetic. I still struggle with the times table but can explain differential equations and integrals to you. For some it’s remembering numbers, I know I used to have trouble counting properly, when counting I might repeat numbers so at 79 go back to 60 and not notice till it’s too late. Like you wouldn’t say a dyslexic person is bad at writing, it just takes a bit longer to read(yea I know about rearanging letters, dyscalculia does that too but with numbers, it’s hard for me to differentiate 9 and 6 often. Cards and dice are tough for me). But none of this is to say your bad. And even if you don’t have this, what I’m trying to say is ask for help. No one is too stupid for anything. It’s about will, it’s about determination. Determination to do what you need to do, forget about anyone else. They don’t care enough to look down upon you. Sometimes the only advocate for you will be you, unless you seek out help, but to seek out help you must first, well... seek help. Even if it’s the fundamentals, they’d be happy to help you. Sometimes teachers recognize you understand the material but not the basics and can help you from there",
      "author": "aDragonqc",
      "created": 1599285532,
      "upvotes": 2,
      "replies": {}
    },
    "g435ihw": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g435ihw/",
      "text": "I'm a math tutor. I've worked with everything from algebra up to calculus. I'll help you for free, PM me.",
      "author": "stastnygetnasty",
      "created": 1599284208,
      "upvotes": 2,
      "replies": {}
    },
    "g4308f0": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g4308f0/",
      "text": "I'm in the same boat. I failed algebra 2 in high school like SUPER failed. Now I'm taking a liberal arts math class thinking it was going to be like high school business math and I was SO wrong. Last week's homework, I had to re read the chapter a good 13 times to somewhat understand it enough to do the homework. Ask for help, don't be stubborn about it. It's better to embarass yourself and ask for help than to keep your pride and fail a class + lose the money",
      "author": "fallenlatest",
      "created": 1599280584,
      "upvotes": 2,
      "replies": {}
    },
    "g42zo8r": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42zo8r/",
      "text": "OP, I know this will get buried but this is what sunk me in school. I was too proud and and suffered massive for it eventually leading to me dropping out. Dont be like me just do it.",
      "author": null,
      "created": 1599280154,
      "upvotes": 2,
      "replies": {}
    },
    "g42zjrm": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42zjrm/",
      "text": "I want to add that I started college with the lowest math class. Like, it doesn't count as credits towards a degree yet.\n\nAnyways, I felt embarrassed about that fact. I decided to get help. I went to the tutoring services twice a week. \nI felt embarrassed going but i have noticed other people going and attending. Soon, it felt great going. My grades were improving, I was learning, and I wasn't asking for so much help. Just going felt like a good investment.\nI have met great people which in turn made going even more better. \n\nI know times like this much more harder but all i know is that you got this!\n\n\nI am not great at writing. Academic writing anything. I am afraid of writing and essays. Because it seems like my thoughts are not my own unlike math... It's discouraging.",
      "author": "tillD2t",
      "created": 1599280060,
      "upvotes": 2,
      "replies": {}
    },
    "g42y9rx": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42y9rx/",
      "text": "I had to take a placement test for math today for my college. I needed a 90 to pass. I got a 53 and the only reason I even got that score was because half way through I just a started using an app that gave me all the answers. So I totally relate. \nI did graduate high school in 2011 though so it’s been a long time since I’ve used math.",
      "author": "B0ring-T0mat0",
      "created": 1599279103,
      "upvotes": 2,
      "replies": {}
    },
    "g42tep0": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42tep0/",
      "text": "Khan academy was my fucking savior, it had been 5 years since my last math class going back to college and had to do a math placement test and within 2 days of khan academy and doing the practice tests my college gave for the placement test, I placed exactly where I needed to be. Before that I had forgotten the basics, was really embarrassing",
      "author": "SpaggettiBill",
      "created": 1599275860,
      "upvotes": 2,
      "replies": {}
    },
    "g42qvvq": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42qvvq/",
      "text": "You should read Barron's EZ Algebra 2 book if you are behind on that.",
      "author": "DieSchungel1234",
      "created": 1599274289,
      "upvotes": 2,
      "replies": {}
    },
    "g42pzl8": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42pzl8/",
      "text": "You should get the fuck over it and ask for help.",
      "author": "lucianbelew",
      "created": 1599273726,
      "upvotes": 2,
      "replies": {}
    },
    "g42pe0z": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42pe0z/",
      "text": "Rough because I’m so late to the party so hopefully you get this message. But first of you can do it, you just have to put your mind to it. I used to be bad at math as well. In middle school I failed the advancement for math so I was a year behind all of my friends in highschool. I failed algebra 2 in HS, then went on to fail college algebra 2 times and finally got a C at my local community college. Somewhere along the way I decided that I loved to create things, work with my hands. This led me to choosing mechanical engineering as my major. It is now my senior year and I haven’t failed a class yet and I use math daily. The best way to learn math is to talk to your professor, don’t crutch on your calculator to solve problems, try to learn the theory behind math and why it functions the way it does. Remember PEMDAS, your order of operations, figure out trig rules, you only have to learn it once to remember it forever. However, don’t go in exams, barely get by and then dump all the info you learned. Basic mathematics is the hardest to grasp as it’s your foundation. Once you learn these fundamentals everything else is simply adding pieces to the puzzle. Hope this helps.",
      "author": "GlobalSpark",
      "created": 1599273366,
      "upvotes": 2,
      "replies": {}
    },
    "g42owka": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42owka/",
      "text": "Colleges have free tutoring services. Use that and use it early ! The tutors want to help.  My daughter used the college services for math and for her anatomy class.  She got so comfortable with the concept that she had a tutor proofread some of her papers.  Made her a better student for it.",
      "author": "nooutlaw4me",
      "created": 1599273071,
      "upvotes": 2,
      "replies": {}
    },
    "g42onkt": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42onkt/",
      "text": "I always go on YouTube for a breakdown. They will usually give you step by step guidance and explain how they are getting to each step. There are also equation solving websites.",
      "author": "doshi333",
      "created": 1599272913,
      "upvotes": 2,
      "replies": {}
    },
    "g42ldk2": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42ldk2/",
      "text": "Go to the tutering center and hang out. Then ask for help with something else, english/science w/e. Just get used to it. Then when you need math help, its not intimidating. \n\nI paid a tutor and he was over 70. He had all the time in the world, and he meant it when he said he just wanted to help. Id get distracted as heck and he'd just wait for me to come back around.",
      "author": "bitetheboxer",
      "created": 1599270885,
      "upvotes": 2,
      "replies": {}
    },
    "g42lbkj": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42lbkj/",
      "text": "You simply need to ask for help from your professor--and also get a tutor. It sounds like you'll benefit from more one-on-one, ongoing assistance. You should not feel embarrassed. I have noted that a lot of really smart people go to tutoring. You know the one's that break the curves in difficult courses and whatnot. Half of it is because they realized there's no shame in asking for help. It's how they conquer their classes so successfully. You would not be taking these courses if you already knew everything. Free your mind of this shame. It's not energy well spent. And also note that you are in good company. A lot of people struggle with math. Another beneficial strategy is to work in a study group, if you can form or get into a good one through your class. Good luck! You can do it!",
      "author": "Hot-Pretzel",
      "created": 1599270851,
      "upvotes": 2,
      "replies": {}
    },
    "g42kto9": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42kto9/",
      "text": "They get payed to help you not to judge you, just remember that.",
      "author": "trunks111",
      "created": 1599270542,
      "upvotes": 2,
      "replies": {}
    },
    "g42k9r7": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42k9r7/",
      "text": "If you're not comfortable asking anyone Kahn academy is pretty good, its already been suggested. Just remember you gotta actually do math to get better at it, not just watch people doing it.",
      "author": null,
      "created": 1599270205,
      "upvotes": 2,
      "replies": {}
    },
    "g42hov2": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42hov2/",
      "text": "It really helped me to ask questions exclusively after class where no one else could judge me for my 1 brain cell worth of math skills.",
      "author": "theveterannerd",
      "created": 1599268644,
      "upvotes": 2,
      "replies": {}
    },
    "g42fkjs": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42fkjs/",
      "text": "1 on 1 tutoring from the tutor center is.the only reason I passed calculus. Give it a go",
      "author": "Cythuru",
      "created": 1599267417,
      "upvotes": 2,
      "replies": {}
    },
    "g42d6xl": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42d6xl/",
      "text": "I ALWAYS recommend Professor Leonard on youtube. Best math teacher I've ever seen. I went from not knowing any college math to aceing calculus 3. The dude is a fucking legend.",
      "author": "remain_vigilant",
      "created": 1599265994,
      "upvotes": 2,
      "replies": {}
    },
    "g42czbo": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42czbo/",
      "text": "Math TA here. No question a student has ever asked me has made me look down on them or think they’re stupid. In fact I’m more worried for them and want to help them because they showed they care. Please ask for help! You deserve to be able to do well.",
      "author": "ihatemathematica",
      "created": 1599265871,
      "upvotes": 6,
      "replies": {}
    },
    "g42bn6c": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42bn6c/",
      "text": "Ask for help. Seriously. It doesn't even matter if the basic math you're struggling with is addition. Go get help. That is what you're paying for by taking the class (even if a scholarship or financial aid is paying for it.)\n\nI signed up for a math class that I probably wouldn't have tested into if they had required me to take the test (they didn't, because my high school exam grades were good enough, but high school had been a decade earlier and I had forgotten everything. I felt so embarrassed being the one student to speak up about not knowing how multiplying exponents worked, but I did (for that, and other \"simple\" concepts - \"simple\" is relative! and your teachers and tutors know that) and guess what? since I asked for help, I was able to understand it, and since I understood it, I was able to pass the class. \n\nAlso, I found that when I spoke up, it helped some of my classmates who were apparently struggling with the same thing.",
      "author": "symmetrical_kettle",
      "created": 1599265056,
      "upvotes": 2,
      "replies": {}
    },
    "g42bknq": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42bknq/",
      "text": " Check if your school has a tutoring center or math center. The service is free at my school. They’re there to help.",
      "author": "sharetan",
      "created": 1599265014,
      "upvotes": 5,
      "replies": {}
    },
    "g42be8h": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42be8h/",
      "text": "Your college probably has a tutoring center or additional help sessions that you can go to outside of class. That way you can still get help if you don't feel comfortable talking with your professor or classmates. The internet always has resources too",
      "author": "absolutelyyyy",
      "created": 1599264906,
      "upvotes": 2,
      "replies": {}
    },
    "g426a25": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g426a25/",
      "text": "If you’re going to pay that much (time and money) To go to college and not get as educated as you can while you’re there, then you’re not very smart. \n\nThere is no shame in asking for help.  That’s literally why schools exist.",
      "author": "BullsAtBuffalo",
      "created": 1599261957,
      "upvotes": 2,
      "replies": {}
    },
    "g425jsv": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g425jsv/",
      "text": "Let me quote a book by one of my favorite authors: \"For my whole life, art and writing were my steady ground. Grandma Ann always said I was born with a pencil in my hand. I draw when I'm upset, when I'm bored, when I'm sad. My parents let me draw directly on walls, inking sumo wrestlers crawling out of chimneys, eggplants with long arms. On physics tests when I blanked on an answer, I'd draw a man shrugging, saying *I simply do not know,* using the test time to shade the bags beneath his eyes.\" - Chanel Miller, *Know My Name* (p.71, hardcover)\n\nI recently attended a virtual book tour event with Chanel and Rebecca Solnit and Rebecca remarked that she loved this concept of Chanel drawing on a physics test. She said that it showed that while Chanel didn't know the answer to a physics problem, she showed the teacher she had a multitude of other important skills or talents. I agree. Physics wasn't her strong suit, but illustration and writing are.\n\nAll of this is to say that you needn't define yourself as \"too stupid\" because you can't do maths. While I do recommend you seek out help (I find forcing myself to ask at least one question each class to be useful), your mathematics abilities do not define you. I am sure that you are great at plenty of other things. Don't let this bring you down.",
      "author": "helluvahoop",
      "created": 1599261613,
      "upvotes": 2,
      "replies": {
        "g4262yf": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g4262yf/",
          "text": "Thank you for the great advice. I’ve never heard of that book but that is an excellent quote. While I definitely don’t feel too defined or limited by my mathematical abilities, I’m mainly concerned with them holding me back. After reading this thread, I’m definitely going to try and seek out help, and talk to my professor. Again, thanks for the kind words :)",
          "author": "Adam_Drivers_Ass",
          "created": 1599261859,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g423pwh": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g423pwh/",
      "text": "it’s always better to ask for help sooner than later! i know how it can feel when it seems like everyone gets it but you and i know that sucks but asking the professor is usually the way to go! it’ll be a lot easier to let them know you’re struggling now than when they realize you’re struggling later on when it midterms/tests happen. good luck!",
      "author": "snickerpicker",
      "created": 1599260793,
      "upvotes": 2,
      "replies": {}
    },
    "g422p00": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g422p00/",
      "text": "1. Ask for help from your teacher / TA \n\n2. Your school has tutoring services available. You might have to find out how you access them.\n\n3. I can guarantee you are not the only student in your class who struggles. Find other people and form a study group. \n\n4. Do not wait for any of these or other things you do. College classes go by very quickly. You will be expected to know this material soon, to build on in later lessons.",
      "author": "acm2033",
      "created": 1599260287,
      "upvotes": 2,
      "replies": {}
    },
    "g4222f8": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g4222f8/",
      "text": "> I seem to be the only person struggling with it.\n\nYou're not.",
      "author": "wolf2600",
      "created": 1599260043,
      "upvotes": 2,
      "replies": {}
    },
    "g420jtm": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g420jtm/",
      "text": "Hello! According to my experience, it might be good to ask your friend first. They are more likely to help and will not say you're bad and math or so. \n\nAbout few years ago I was study in a new country and I did not know anything about calculator (my home country does not allow students use calculator). I was so stressed first because I could not figure it out and it was like two days before the exam. Everyone else in the class know it since middle school, but me. On that they the teacher allowed us to practice a bit, I was so embarrassed trying to use that calculator since I really had no idea how to use the graphic section, making solving some of the questions impossible. The girl next to me just began to teach me how to use it. I knew her a month before and we became friends because she speaks the language I speak in my home country. She never got mad or disappointed(I know she is not always at foot temper!) even if it took long to teach me. 😁Good friends are really helpful and they are less likely to make you feel uncomfortable to ask.",
      "author": "itsaubreycumin",
      "created": 1599259478,
      "upvotes": 2,
      "replies": {}
    },
    "g41zzbs": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41zzbs/",
      "text": "what math course??",
      "author": "long_crab",
      "created": 1599259290,
      "upvotes": 2,
      "replies": {
        "g4267ws": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g4267ws/",
          "text": "It’s an intro to math course designed for people that are historically bad at math but need it for their degree (haha).",
          "author": "Adam_Drivers_Ass",
          "created": 1599261927,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g41x384": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41x384/",
      "text": "The best advice I can give is to get tutoring or go to SI or LA sessions even if you don't need them. I tell my students it's like staying healthy as opposed to getting sick and needing antibiotics. I hope you get the analogy. \nIt's a common misconception that tutoring is only when you need help. That's such a stressful way to learn too! Use of tutoring should be sharpening skills as much as building ability. \nGood luck!",
      "author": "Existangel",
      "created": 1599258159,
      "upvotes": 2,
      "replies": {}
    },
    "g41vfzn": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41vfzn/",
      "text": "First of all, don’t be embarrassed, but if you have any close friend in your class, ask them for help before you go to the teacher.",
      "author": null,
      "created": 1599257450,
      "upvotes": 2,
      "replies": {}
    },
    "g41unf7": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41unf7/",
      "text": "Go to your professor's office hours and explain that you've always struggled with math and that you need extra resources to pass the class. If you're too embarrassed to do it in person, write it in an email.\n\nI understand that it's hard. I was good at math in highschool, but struggled my senior year with AP Calc. I studied my ass off and still failed the AP calc test and I took a year off from school, so now I'm retaking a class that already took in highschool. It was a blow to my ego, but at the end of the day I'm just not as strong in the subject as I used to be and that's ok. You can build skills if you put in the effort. You may not get 100% on every test, but I'm confident that with practice, you'll pass!",
      "author": "icyhot09",
      "created": 1599257141,
      "upvotes": 2,
      "replies": {}
    },
    "g41retk": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41retk/",
      "text": "I tutored math at my university for the past 2 years, and I helped grading tests and finals both years. Honestly, when someone doesn't understand a basic concept and asks for help, I gladly help, and it just feels normal. I know that the teachers usually feel the same (at least the ones I talked to). But when at the end of the semester someone gets even the most simple questions wrong I just think \"where the hell was he/she all year? why didn't they just ask for help?\". It's okay to not understand stuff and ask for help from your teachers and tutors. Most of them will be happy to help. (there are some rude ones who'd tell you that you should have learnt this years ago, but ignore them and find someone else)",
      "author": "blackrainbows76",
      "created": 1599255683,
      "upvotes": 2,
      "replies": {}
    },
    "g41qc8f": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41qc8f/",
      "text": "I recently got hired as a math tutor. We are here to help anyone from the most basics of algebra all the way up and through calculus. Our job is to help you out the best we can so you can succeed. If we fail at that we likely lose our jobs or get moved out of that area so if you're afraid your tutors might judge you, that is not the case. We have a vested interest in seeing you succeed so that we may succeed. As a result we will do everything in our power, short of paying off the professor, to help you out to the very best of our ability. \n\nThis may sound self centered but I dont think it is. I think it is important that students that need help seek it and that they are not burdening the tutors.",
      "author": "wherearetheturtlles",
      "created": 1599255365,
      "upvotes": 2,
      "replies": {}
    },
    "g41px4h": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41px4h/",
      "text": "Khan Academy has coursework for all levels of math. It's free and they have a mobile app too. Saved me a lot of headaches.",
      "author": "Blitzkriek",
      "created": 1599255215,
      "upvotes": 2,
      "replies": {}
    },
    "g41mrej": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41mrej/",
      "text": "Honestly try taking an intro stat- often accepted as a math credit but less math.",
      "author": "MrPotato2753",
      "created": 1599254266,
      "upvotes": 2,
      "replies": {}
    },
    "g41mf36": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41mf36/",
      "text": "PLEASE reach out to your tutoring center! Even as someone who enjoyed math, I learned so much going to them often to check my answers and help me since it’s not easy to apply and remember every concept!",
      "author": "jt1818",
      "created": 1599254150,
      "upvotes": 2,
      "replies": {}
    },
    "g41m32x": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41m32x/",
      "text": "One class to graduate?!   Man you better ask for help and stop fucking around",
      "author": "Redd889",
      "created": 1599254037,
      "upvotes": 2,
      "replies": {}
    },
    "g41m2df": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41m2df/",
      "text": "Khan academy has some amazing online, free, and comprehensive videos that could help.  Also, this of all semesters ever is one that has an abundance of resources and accommodations for you.  \n\nCheck your class syllabus.  I teach college literature and Im required to have have the math lab tutoring information in my syllabus.  Your college should also have a math lab or tutoring center that can help you.  Reach out and ask; you’re already paying for it in your tuition.  \n\nGood luck to you!",
      "author": "Hedwigbug",
      "created": 1599254031,
      "upvotes": 2,
      "replies": {}
    },
    "g41iv86": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41iv86/",
      "text": "I pretty much did all my math homework in the math help centers in both my Junior college and major University math days. There's absolutely no reason not to check and see if your school has a math help center and get help that way (I know it'll be more difficult due to coronavirus but you need to try)",
      "author": "noobtube228",
      "created": 1599253069,
      "upvotes": 2,
      "replies": {}
    },
    "g41h385": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41h385/",
      "text": "OP sounds like he is karma fishing. There is no way of him getting a GED without elementary algebra. \n\nIf he meant “basic math” as in (23-5) he’s so full of shit.\n\nThere’s no way he made it to college without a basic math skill. Even y highschool drop out buddies that have GED can do algebra.",
      "author": "Xiscis",
      "created": 1599252558,
      "upvotes": -1,
      "replies": {
        "g41hz1b": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41hz1b/",
          "text": "I didn’t phrase it properly, I guess. I can do algebra and arithmetic to a degree, I just struggle with times tables, cross multiplication, etc. I got through most of my high school math classes with a lot of help from my teachers (namely geometry, which was very hard) but I’ve kind of forgotten those skills as time has gone on.",
          "author": "Adam_Drivers_Ass",
          "created": 1599252780,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g41f7zb": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41f7zb/",
      "text": "You’re smart enough to goto a college, smart enough to go on Reddit and ask for help. But you’re not smart enough to go on YouTube and literally type in “pre algebra?”",
      "author": "Xiscis",
      "created": 1599252034,
      "upvotes": 2,
      "replies": {}
    },
    "g41f66e": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41f66e/",
      "text": "I've struggled my whole life with Math.  I learned that it's a common problem and I had to ask for help.  If I wanted to get anywhere, tutoring was going to happen.  I tutored people in other courses who probably felt just as insecure.  Trust me, nobody thinks you're stupid or whatever.",
      "author": "xmarketladyx",
      "created": 1599252019,
      "upvotes": 2,
      "replies": {}
    },
    "g41ewm4": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41ewm4/",
      "text": "I tutored a lot of people who needed to pass their one math class to graduate. You should know you are not the only one. If your prerequisite knowledge is really lacking, it might make sense to take a step back and learn the things you should have learned before taking your current class. And then sign to for the class again. Never give up.",
      "author": "lemma_qed",
      "created": 1599251932,
      "upvotes": 2,
      "replies": {}
    },
    "g41eujw": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41eujw/",
      "text": "khanacademy.org for sure",
      "author": "Lloydster",
      "created": 1599251913,
      "upvotes": 2,
      "replies": {}
    },
    "g41ej63": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41ej63/",
      "text": "As someone who has also struggled in math in high and had to take one math course last year, you shouldn’t be embarrassed to ask for help. You’re school will have a tutoring center that you SHOULD use! I’m terrible at math and found that they helped me get through the class! The feeling of embarrassment will go away as you keep going. Getting help should never be embarrassing, in fact it’s healthy to ask for help. 😀",
      "author": "Rahmbomb13",
      "created": 1599251834,
      "upvotes": 2,
      "replies": {}
    },
    "g41cuys": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41cuys/",
      "text": "Better to shyly ask for help than to waste your money",
      "author": "CorrodedRose",
      "created": 1599251259,
      "upvotes": 2,
      "replies": {}
    },
    "g41c4n4": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41c4n4/",
      "text": "I'd much rather have a student ask stupid math questions at the start of the semester/quarter than for grade forgiveness at the end of the semester/quarter.\n\nAsk for help, and you'll most likely improve!",
      "author": "TBDobbs",
      "created": 1599251012,
      "upvotes": 2,
      "replies": {}
    },
    "g41bvcy": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41bvcy/",
      "text": "I can assure you that by no means are you alone. At my institution, math has always been the course that hinders Degree completion. Go to your advisor, find out what resources they offer. And just be straight with them. You’re paying for these resources and no one will look at you as less than if you are honest about your math struggles. Assuming your institution is like mine, your advisor will be focused on assisting you with the right tools and NOT judging you.",
      "author": "OHmyblueberries",
      "created": 1599250923,
      "upvotes": 2,
      "replies": {}
    },
    "g41b6u2": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41b6u2/",
      "text": "I am a physics professor. I teach mostly pre med students, who as a general rule are very smart but often not great with math. Poor math skills doesn't equal stupid, but just lacking in some particular skills. \n\nI get so annoyed when students make the same math mistakes over and over and never ask for help. Just ask. That's why I am here. \n\nIf I have 2 students who are each half a point from a B, I am far more likely to round it up for the student who tried hard and got the help that was needed.",
      "author": "PoetryOfLogicalIdeas",
      "created": 1599250695,
      "upvotes": 2,
      "replies": {}
    },
    "g41a5ex": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41a5ex/",
      "text": "YouTube is your friend",
      "author": "PureScience385",
      "created": 1599250343,
      "upvotes": 2,
      "replies": {}
    },
    "g418ulp": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g418ulp/",
      "text": "Use khan academy! It's a free website with videos, lessons, and quizzes about all sorts of k-12 subjects",
      "author": "TheProdigyReagan",
      "created": 1599249901,
      "upvotes": 2,
      "replies": {}
    },
    "g418rb3": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g418rb3/",
      "text": "cant know for sure if others are struggling though",
      "author": "zarnonymous",
      "created": 1599249870,
      "upvotes": 2,
      "replies": {
        "g41hxfv": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41hxfv/",
          "text": "op is full of shit. No one struggles with basic math. Basic math isn’t a mathematics skill, it’s a life skill. If you don’t know how to do basic math, college should not be a place where you should be at 18+.",
          "author": "Xiscis",
          "created": 1599252767,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "g415caz": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g415caz/",
      "text": "Get the help. Literally none of your tutors or instructors is going to judge you for you.\n\nI work in ESL, so it's a little different, but I have students who are twice my age or better who come to ask me for help on basic addition because they can't even do that math. I just help them and remind them that if they get much further in their math career, the math tutors are going to be way more helpful than someone who majored in nouns.\n\nAnd from a personal stance ... when I was forced into stats for my anthropology degree, I understood *nothing*. Everything was just a jumbled mess of who the heck could understand this??? I was at the teacher's office hours every day. I was in the math tutoring center every day. I was getting outside help, reading other books, asking friends, Googling ... I still didn't get it. Only class I ever failed because I just couldn't do the math. Nobody ever judged me for it (and honestly it's nice to be able to tell my own students now that it's not the end of the world to ask for help when you can't understand it).\n\nBut for real, nobody who's actually a decent human is going to judge you for asking for help.\n\nI see you figured it out for this time, but use the resources available to you! That's what they're there for!",
      "author": "bgbwtp",
      "created": 1599248687,
      "upvotes": 2,
      "replies": {}
    },
    "g413f0f": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g413f0f/",
      "text": "Same. But, ask for help. Once you get help and understand, it’ll get better. This week we did fractions (yes, fractions). And I’ve struggled a lot with it since. What I started doing was studying. Never really studied my entire school career. While different, once you master the concept of it, keep studying. And I can guarantee you’ll do good. By me practice and study, I got a 16/20 on my math quiz today. Not the best. But better if I wasn’t trying. Good luck",
      "author": "Jsmith4523",
      "created": 1599248004,
      "upvotes": 2,
      "replies": {}
    },
    "g413e9o": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g413e9o/",
      "text": "Please don't do that. I used to tutor freshmen in high school and noticed that even if they didn't know the basics, they would never ask for help. It's actually sad because some think that's a shameful thing. I would love to explain math problems over and over again till all of them would understand it perfectly. In my country, we have a proverb that sounds like this: [https://ibb.co/h7mXF1z](https://ibb.co/h7mXF1z)\n\nSorry for my broken english, I hope you got the right idea",
      "author": null,
      "created": 1599247997,
      "upvotes": 2,
      "replies": {}
    },
    "g411zra": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g411zra/",
      "text": "Have you tried Khan Academy or looking up videos on youtube? Those were life savers for me when I was learning accounting",
      "author": "rlovesnamjoon",
      "created": 1599247526,
      "upvotes": 2,
      "replies": {
        "g412hay": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g412hay/",
          "text": "I haven’t done khan academy since I was in high school, but I’m planning to start getting back into it again",
          "author": "Adam_Drivers_Ass",
          "created": 1599247689,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g411wfc": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g411wfc/",
      "text": "Gonna expose myself real quick- I went through basically every khan academy math course there was to help me with math. Like from 4th grade up. No shame in asking for help or rebuilding foundations.",
      "author": "pwoko",
      "created": 1599247493,
      "upvotes": 20,
      "replies": {
        "g41fj9w": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41fj9w/",
          "text": "Yep, I just had to relearn how to do long subtraction for my computer architecture class. Everyone needs to review and learn things, no shame!",
          "author": "SirensToGo",
          "created": 1599252121,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "g411kt5": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g411kt5/",
      "text": "Ask for help, man. I was also pretty embarrassed to ask for help when I started college, but I forced myself to ask as many questions as I needed to in my tutoring center. They were all really kind and helpful, no judgement at all.\n\nI truly believe that I only passed Statistics because I asked questions and got help. Never be too embarrassed to grow and learn.",
      "author": "Autumnleaves201",
      "created": 1599247382,
      "upvotes": 2,
      "replies": {}
    },
    "g411g4z": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g411g4z/",
      "text": "Same. I've always struggled in math, and in order to graduate I had to pass 1 math and stat class\n\nI re-took the math class 5 times and stat 2 times because I kept on failing. If there's something I'd advise to someone like me is to take math seriously. Like don't just think of it as your enemy and that one roadblock to graduation.\n\nPractice really pays of so start solving even just a few problems when you can. It helps you understand the process better. \n\nI was also embarrassed to ask for help in solving basic stuff too, so I asked my really close friend to help me. If you really can't, then try reading books or watch YouTube videos like khan academy.\n\nLastly, don't instill in your brain that you can't do it. Because that's a guaranteed way to make you feel like a failure and try less. Just think of yourself as a late bloomer and as long as you're trying, you can overcome it and learn :) good luck!",
      "author": "agroteraminor",
      "created": 1599247338,
      "upvotes": 2,
      "replies": {}
    },
    "g4115bd": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g4115bd/",
      "text": "When I go to grocery stores, I have to use my phone calculator to do extremely basic calculations. I struggle to see numbers in my head. Then I had to take a stats class with a pretty bad teacher who made everything way more confusing than it had to be. \n\nSo I swallowed my pride, went to the free tutoring service and booked an appointment. I asked for help from my friends when I could. \n\nEnded up with an A+! More people than you think are absolute shit at math, and something I always keep in mind is that things that seem basic to me (e.g. grammar, music) are way hard for other people. We're all built different. All the best!",
      "author": "wouldwalk500more",
      "created": 1599247238,
      "upvotes": 2,
      "replies": {}
    },
    "g410tcg": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g410tcg/",
      "text": "There is no shame in asking for help. Good luck with finding some help with math. There will definitely be someone with the college that can help.",
      "author": "Open-Tomato",
      "created": 1599247126,
      "upvotes": 2,
      "replies": {}
    },
    "g410crd": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g410crd/",
      "text": "If you need help, I can help you. What kind of math we talking about here. I have an engineering degree so I’ve done up to differential equations. \n\nBut, don’t be scared to ask for help anywhere else. There’s usually tons of online resources for these kind of things. YouTube can be your best friend!",
      "author": "Armanullah",
      "created": 1599246971,
      "upvotes": 2,
      "replies": {
        "g411ljg": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g411ljg/",
          "text": "It was just cross multiplication (we did unit conversions today) and I think I more or less figured it out after watching my instructor do a few problems, but thanks for the offer. :)",
          "author": "Adam_Drivers_Ass",
          "created": 1599247389,
          "upvotes": 2,
          "replies": {}
        },
        "g416bpt": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g416bpt/",
          "text": "If you need math help let me know it’ll be no problem.",
          "author": "Armanullah",
          "created": 1599249037,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g410bop": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g410bop/",
      "text": "I was the guy in my calculus 2 class that asked why a square root couldn't be split up like a parenthesis. I also asked many other very basic algebra/geometry questions because I had gaps in my knowledge. The professor explained everything and I finished with an A. \n\nMath makes everyone feel stupid, asking questions is how you learn and improve.",
      "author": "Boss99",
      "created": 1599246960,
      "upvotes": 2,
      "replies": {}
    },
    "g4108jb": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g4108jb/",
      "text": "I had a similar problem my first semester at college while taking a physics class. I didn't understand the material and didn't understand the math that was supposed to be prior knowledge. Because of this I was thinking \"its not the professors' responsibility to be teaching me these things. This is supposed to be prior knowledge.\" By the time I asked for help, it was too late; the material had advanced to a point where the stuff we learned, in the beginning, was being used VERY heavily for more and more complicated problems. Because I never understood the base material I didn't have enough time in the semester to re-learn all the material and start to understand the current material. The professor met with me and we discussed what office hours are for. I found out that even if I somehow forgot what 2+2 equals, it is their job to teach me anything that has to do with the class. I made a big mistake not asking for help earlier, and had to drop the class as it wasn't possible for me to get anything other than an F. However, I also learned a valuable lesson in the process. Please don't make the same mistake that I did. Also, Im guessing that since you are writing this post you know that you should go and ask for help. You can do that by going to office hours, or, if your school has a tutoring program, you can get a tutor. Both of those things will help you. One last thing, you are not stupid, no one goes through school without having trouble with the material. High schools in the US also teach different things to students/have different standards for what is taught. In high school for me, I took a physics class and never once talked about vectors. My friend graduated without learning about sin, cos, or tan. Everyone is different.\n\n&#x200B;\n\nEdited to add that the app \"Photomath\" has saved me numerous occasions and works as a great study tool. You show the math problem up to your phone's camera and it tells you the answer while showing all the work step-by-step. It even worked for my pre-calculus class.",
      "author": "Kinky_Zebra",
      "created": 1599246929,
      "upvotes": 2,
      "replies": {}
    },
    "g40zni4": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40zni4/",
      "text": "You just gotta ask for help if you not down to teach yourself the content via youtube/research.\n\nThere are also people on Reddit who can help you as well. I forgot the sub name, but they have tutors. Just beware of people that scam.",
      "author": "Kingmir1",
      "created": 1599246735,
      "upvotes": 2,
      "replies": {}
    },
    "g40zach": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40zach/",
      "text": "Ask your friends for help, your best friends will probably not mind and would want to help you get better.",
      "author": "Avidestroyer",
      "created": 1599246612,
      "upvotes": 2,
      "replies": {}
    },
    "g40y03g": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40y03g/",
      "text": "So I REALLY struggled with math - I to take college algebra (B), Pre-calc (C), calc 1(C), discrete math(D, C), calc 2(D, C), linear algebra(C). \n\n&#x200B;\n\n(#letter) = my grades I got first and second time if I needed to take it again. \n\n&#x200B;\n\nI didn't go for help for except for calc1, and linear, some of calc 2 but not enough - my schedule was quite hectic that semester. \n\nI went to every single one of my calc 1's office hours - most of the time I was the only one there, I got to know my teacher on a personal level and they really helped me out, most of the time I was able to complete my homework by going to the office hours and getting help, and for exam reviews - personally it gave me a better preparation when you're learning directly personally with the person who writes the exams. She never gave me the questions but she was gearing more towards more specific topics that I'd need to know for the exam. She knew I was trying and struggling with a lot and she definitely saw that. \n\n&#x200B;\n\nMath teachers are really awesome and really bright people and for the most part don't want you to fail. Math is one of those subjects that you really have to love if you plan on becoming a teacher with it. And it definitely showed in nearly all of my math teachers. \n\n&#x200B;\n\nHonestly going to office hours and working one on one helps a lot - don't feel stupid because you're just going to hurt yourself in the long run, and thats being stupid. Getting help is being the opposite of stupid.",
      "author": "GennaroIsGod",
      "created": 1599246258,
      "upvotes": 2,
      "replies": {}
    },
    "g40xp3w": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40xp3w/",
      "text": "I sympathize completely. I chose a science major that would require me to do math because I love it (the science, not the math). It’s a challenge though. Don’t be afraid to ask for help! It’s ok to admit you need help with something. It’s ok to not be good at everything. At least that’s what I tell myself. That’s why you’re in school anyway!",
      "author": "ijustwantpiroshki",
      "created": 1599246154,
      "upvotes": 2,
      "replies": {}
    },
    "g40xmi8": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40xmi8/",
      "text": "If a stupid person pretends to be smart, he will stay stupid,",
      "author": "SackOfFlesh",
      "created": 1599246130,
      "upvotes": 2,
      "replies": {}
    },
    "g40xfze": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40xfze/",
      "text": "Definitely ask for help. \n\n&#x200B;\n\nAlso, have you ever been tested for dyscalculia? It's like dyslexia with numbers. I thought I was just particularly dim when it comes to numbers but it turns out I have reasons it feels like maths is just memorisation without logic. Your college might have a testing programme to help get diagnosed if it applies to you.",
      "author": "Vantavole",
      "created": 1599246070,
      "upvotes": 2,
      "replies": {
        "g42420r": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42420r/",
          "text": "This! I'm actually a 34-year-old professor and I only found out this past year that I have dyscalculia. Try this test:\n\n [https://www.additudemag.com/self-test-for-dyscalculia-in-adults/](https://www.additudemag.com/self-test-for-dyscalculia-in-adults/)  \n\nI really regret the way I grew up around math. I was an diligent student, \"gifted\" in most areas, but the fact that this didn't transfer to the subject of math caused me great shame and probably closed some study/career avenues I could have been very successful in with the proper diagnosis and a bit of coaching. Bad math teachers and shaming from my parents exacerbated the issue. I have quite a block about it now, which feels embarrassing after all these years. \n\nIt was very vindicating to learn that I'm *not dumb,* but I have a brain that doesn't get numbers. Maybe this knowledge can start shifting your mindset, too.",
          "author": "brownidegurl",
          "created": 1599260934,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g40wzay": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40wzay/",
      "text": "What exactly about math is difficult? I find it hard to believe you were able to graduate high school without some sort of understanding of it.\n\nIs it arithmetic, algebra, geometry, calculus?\n\nEither way, you need to get over your insecurities and get the help you need. It’s better to ask when you don’t need it than to be in a situation where you do need it, you’ll look a lot stupider in the latter scenario.",
      "author": "jookibajumba",
      "created": 1599245914,
      "upvotes": 2,
      "replies": {
        "g40xdln": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40xdln/",
          "text": "It’s hard to explain, but whenever I see a math problem my brain freezes up. Like, I’ll look at it, recognize the parts, but I won’t have any idea of how to put them together or why they connect. Then I sort of panic and start chastising myself for not being able to solve it (since more often than not the problem is very easy) and I get increasingly distressed until I give up. I don’t really know how to explain it, but it’s like the whole idea of math just doesn’t make sense to me.",
          "author": "Adam_Drivers_Ass",
          "created": 1599246046,
          "upvotes": 3,
          "replies": {
            "g413h6e": {
              "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g413h6e/",
              "text": "There’s a big difference between solving for 2+2 vs. solving for x when x^2+2x+1=0.\n\nAgain, it surprises me that your high school allowed you to graduate without having some base knowledge in math. I don’t say that to pick on you but your school should have done a better job on making sure you understood, at least, the basics.\n\nEither way, it sounds like your anxiety seriously induces your knowledge, especially when you feel like you’re being put on the spot. I would get tutoring to build a foundation in math and use that as your building blocks.",
              "author": "jookibajumba",
              "created": 1599248025,
              "upvotes": 1,
              "replies": {
                "g417vxu": {
                  "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g417vxu/",
                  "text": "Yeah, to be fair I got my most of my math classes with c’s or b’s (thanks to a lot of excellent teachers) and I kind of gamed the system by taking a super easy financial algebra course during my senior year haha.",
                  "author": "Adam_Drivers_Ass",
                  "created": 1599249570,
                  "upvotes": 3,
                  "replies": {
                    "g418gsj": {
                      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g418gsj/",
                      "text": "Well if you could pass financial algebra then you have some sort of knowledge in math.",
                      "author": "jookibajumba",
                      "created": 1599249770,
                      "upvotes": 3,
                      "replies": {
                        "g41gijy": {
                          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41gijy/",
                          "text": "He sounds like he’s full of shit and wants karma. \n\nHe didn’t once answer your question of whether he can do 2+2 or algebra. \n\nDude talks like he is caught red handed and tries too hard to explain why he sucks at math.",
                          "author": "Xiscis",
                          "created": 1599252382,
                          "upvotes": 2,
                          "replies": {
                            "g41m44c": {
                              "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41m44c/",
                              "text": "Yeah I was questioning whether he was really stupid or simply trolling.",
                              "author": "jookibajumba",
                              "created": 1599254047,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g40w5ou": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40w5ou/",
      "text": "Online resources. Khan Academy, the organic chemistry tutor, and professor leanard will help alot! (all on youtube). And if you are real desperate you can get a chegg subscription too. What math is this btw?",
      "author": "tha_oz",
      "created": 1599245635,
      "upvotes": 2,
      "replies": {}
    },
    "g40vqq4": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40vqq4/",
      "text": "Start on khan academy. Assess what level you’re on by taking their quiz and work from there :) I find it really helpful for all levels of math (even used it to touch up on algebra for tutoring).",
      "author": "Overlord2020",
      "created": 1599245494,
      "upvotes": 6,
      "replies": {}
    },
    "g40uxnh": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40uxnh/",
      "text": "same with computer science. Whenever I ask my professor for help, he's like \"This is CS 115 not 114.  Please review what you learned in CS 114 asap.\" and he doesn't even answer the question I'm asking. I'm totally stuck on my project, and have no idea how to fix it. I don't know my classmate's emails and phone numbers. Heres the thing: if you're a teacher you shouldn't tell the student \"hey you were supposed to learn this last semester haha go fuck yourself\". because a. you're a TEACHER, you're supposed to help the student and b. its been six months since I last looked at Java code and I definitely forgot a lot\n\n(side note: if someone knows Java can you please DM me?)",
      "author": "RandomRedditor44",
      "created": 1599245222,
      "upvotes": 2,
      "replies": {}
    },
    "g40uo0r": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40uo0r/",
      "text": "Same",
      "author": "yeahmorgs",
      "created": 1599245132,
      "upvotes": 3,
      "replies": {}
    },
    "g40u4nu": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40u4nu/",
      "text": "I promise you that everyone in that class isn't breezing through the content, if they were they wouldn't be in that class. I'm a tutor and I see people with this fear all the time, that the whole class gets the material except for them. I've done enough grading to promise you that is not the case lol.",
      "author": "Str8_up_Pwnage",
      "created": 1599244951,
      "upvotes": 4,
      "replies": {}
    },
    "g40sskk": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40sskk/",
      "text": "Saying you're too stupid is already a problem/mistake you've made. No one that's good at math has an aptitude for it. It's just practice and being able to follow again, like instructions for anything. Trust me. I did awful in math in highschool but math is currently my favorite subject in college (CS major). I'm not gonna sit here and say it's just in your head or bla bla bla, but also not reaching out for help is just another mistake you're making. \n\nPeople are *in love* with helping and teaching others. It's why we have professors, teachers, tutors/tutoring centers etc. I'll bet you ain't the dumbest person to walk through some doors or shoot an email asking for help. I probably am lol. Point is, build up some courage and ask for help, and don't compare yourself to others. Patience and baby steps. You're not stupid. No one is\n\nAdd on/edit: I think the best thing for you to do is muster up the courage to get some help. It'll help in the long run for your confidence and determination to do better in math or at anything in which you're intimidated. Don't try to go around it, and don't even try to cheat. It's a popular consensus across the dang globe that math is hard, no matter how simple sometimes, you're not the only one. My dad doesn't even remember how to do division lol. It's alright no one will judge you",
      "author": "iamzerothree",
      "created": 1599244501,
      "upvotes": 3,
      "replies": {}
    },
    "g40o3hn": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40o3hn/",
      "text": "I was the same way and ended up getting a math degree recently, imagine that. \n\nMy best suggestion is sign up for a powerhomeschool account for high school. It’s $25 a month. They have EVERY subject on there & it’ll help you fill in the gaps. Also ochem tutor has math classes on his YouTube and he takes it very slow.",
      "author": "gabbagabbalabba",
      "created": 1599243001,
      "upvotes": 2,
      "replies": {}
    },
    "g40mdec": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40mdec/",
      "text": "What kind of stuff are you learning right now? I could brush up on some stuff. I've always had some eclectic study methods that my friends said have helped them. I could brush up on some stuff if you need. I've taken up to Calc 2 in college.",
      "author": null,
      "created": 1599242491,
      "upvotes": 2,
      "replies": {}
    },
    "g40m93f": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40m93f/",
      "text": "Math is hard for me, too. I do better in English. I hope you find the courage to ask someone for help. I am getting tutoring soon for basic ALgebra. I have to at least pass college Algebra to get my degree. I feel ya! :)",
      "author": "galsandgamers42",
      "created": 1599242452,
      "upvotes": 3,
      "replies": {}
    },
    "g40i4vv": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40i4vv/",
      "text": "Asking for help is nothing to be embarrassed about. I use to work in my school's math tutoring center, and I have so much respect for the people who would come in often, have a ton of questions, and need a lot of help. And to be honest, it was more impressive to me when someone would come in for help with arithmetic or basic algebra than advanced calculus. Why? Because someone who's studying advanced calculus is probably naturally pretty good at math, they probably like it, and maybe they've finally gotten to the level where it's not \"easy\" anymore, but they're more likely to find the challenge kind of fun. On the other hand, someone needing help with pretty \"low level\" math probably doesn't enjoy math, maybe even dreads it, and just wants to get through the class so that they can graduate. I guess my point is I find the attitude of, \"I'm bad a this, I hate it, it makes no sense to me, but goddamn I am going to learn it.\" pretty impressive really. \n\nDoes your school have a tutoring center? Maybe you would feel more comfortable going there knowing that if you come out totally embarrassed you can just never go back and probably never even see the person who tutored you again. That obviously wouldn't be a great outcome, but keeping the option in mind might help you get your foot in the door (or the zoom room). Alternatively, I'm sure your teacher would much prefer that you come to office hours constantly and ask all your \"stupid\" questions and pass than to have you just quietly fail. And if you can't bring yourself to do either of those, or try them and can't make either a regular thing, there's youtube videos on literally everything, and often hearing the same concept explained a couple of different times by a couple of different people can help a lot, so there's always that.",
      "author": "charlie6282",
      "created": 1599241105,
      "upvotes": 23,
      "replies": {}
    },
    "g40eor5": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40eor5/",
      "text": "google khan academy. You can go through math from grade 1 to grade 12. Fill in all the holes and set up a solid foundation. \n\nIf you are fine with that and your current material is the only issue then go and force yourself to ask. \nYou are in college to learn not to already know stuff. \nAlso you are paying fat money for the class and that includes having your questions answered.",
      "author": "Relrik",
      "created": 1599239964,
      "upvotes": 70,
      "replies": {}
    },
    "g40dybl": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40dybl/",
      "text": "Talk to your instructor or TA about the fact that you might need extra help because you've struggled with math since high school. More often than not, they're very accommodating. If they are, they won't mind spending some more time helping you out.",
      "author": "colourcodedcandy",
      "created": 1599239721,
      "upvotes": 7,
      "replies": {}
    },
    "g40ay45": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g40ay45/",
      "text": "Ask for help you are not the only one struggling everyone else is also just too scared to ask questions. Ask questions",
      "author": "bald_butte",
      "created": 1599238691,
      "upvotes": 20,
      "replies": {}
    },
    "g403ctw": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g403ctw/",
      "text": "Ask for help. If you need it, you need it. There's no shame in that.\n\nYour school should have tutoring available that you can look into and I'd really encourage you to do so. You're definitely not the only person who struggles with math. It's a barrier for a lot of people which is why schools put things like tutoring or office hours in place so that you can reach out and get the help you need. \n\nI found using khan academy to be really helpful in math courses. They should have some videos on whatever subject you're struggling with. Sometimes just having someone explain things in a different way can help.",
      "author": "MelodicThing",
      "created": 1599236066,
      "upvotes": 536,
      "replies": {
        "g4112ee": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g4112ee/",
          "text": "Adding to this, see if your school has SI instruction, too. I don't know what your institution does but they should have this or tutoring like this redditor mentioned. \n\nThere's no shame in it. My strategy was to go to SI and have them help me with homework problems that I couldn't do or struggled with and get it done there. The plus side is I got my homework done three times as fast, understood it coherently, got all the points for it, and averaged really well on my test. Got all A's throughout University in this system. Great system for getting it done and understanding. Also don't feel bad if a graduate student isn't as communicable as another one in the room. Just do what you can and if it's really not happening don't feel rude to try someone else.\n\nFAU was awesome in that every day of the week essentially had an open block for us. But if there's no time for you (work), definitely email the professor and or find a friend in class. Good luck!",
          "author": "FractalLyfe",
          "created": 1599247212,
          "upvotes": 43,
          "replies": {}
        }
      }
    },
    "g4024s3": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g4024s3/",
      "text": "I will help you if you want. I am a maths major at a good university who also struggled with maths. I still struggle, but now I understand high school maths\n\nDo not be embarassed to talk to your teacher. They want you to succeed",
      "author": "Expensive_Material",
      "created": 1599235619,
      "upvotes": 212,
      "replies": {
        "g412bw0": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g412bw0/",
          "text": "Thanks for the offer of help, but I got it after a few tries haha. It was just cross multiplication, and I was confused since I haven’t done it in so long. I’m definitely planning to talk to my teacher at some point.",
          "author": "Adam_Drivers_Ass",
          "created": 1599247639,
          "upvotes": 65,
          "replies": {
            "g417hvj": {
              "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g417hvj/",
              "text": "That’s how it goes, trust me. You’ll start to get it, then it’ll just get easier. Also, Chegg.com is another great resource if you can afford it.",
              "author": "Scorpia03",
              "created": 1599249441,
              "upvotes": 27,
              "replies": {}
            },
            "g41i4du": {
              "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41i4du/",
              "text": "As someone who teaches mathematics, I can absolutely guarantee you are not the only one who is struggling in the class (unless maybe your class has one student in it). The others are just being quiet about it (like you are) and probably for the same reason. \n\nPlease ask!",
              "author": "jessamina",
              "created": 1599252820,
              "upvotes": 22,
              "replies": {}
            },
            "g41tvgf": {
              "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41tvgf/",
              "text": "Don't wait. Math is a building subject- to understand tomorrow's lessons you have to already know how to do today's. If you're having problems ASK FOR HELP. That math is a required course so you have to pass it and I doubt you want to pay for the course a second time. No one cares if you're struggling because they're all busy struggling too. Maybe with the same math, maybe with other things but everyone has something. If you don't wantbto ask the teacher then maybe ask a classmate that seems to know what's going on. Or see if there are some tutoring hours- some classes have a set time you can show up and ask about work you might have trouble with.",
              "author": "mommy2libras",
              "created": 1599256734,
              "upvotes": 14,
              "replies": {}
            },
            "g41jq70": {
              "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41jq70/",
              "text": "> I’m definitely planning to talk to my teacher at some point.\n\nThat point should be RIGHT NOW.\n\nGet a tutor set up so that when you need help you have the resource ready to go. Otherwise you're going be stuck in a situation, without time to arrange for a tutor and nothing but a time machine will save you.",
              "author": "Violet_Plum_Tea",
              "created": 1599253312,
              "upvotes": 8,
              "replies": {}
            },
            "g41ujce": {
              "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g41ujce/",
              "text": "Khan Academy might be able to help you out too",
              "author": "BylvieBalvez",
              "created": 1599257104,
              "upvotes": 5,
              "replies": {}
            },
            "g42bugy": {
              "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42bugy/",
              "text": "Cross multiplication is annoying! I was trying to teach it to some middle schoolers and I legit had no clue what was going on with that magic, even though I remembered it being easy when I was in middle school.",
              "author": "symmetrical_kettle",
              "created": 1599265181,
              "upvotes": 2,
              "replies": {}
            },
            "g42s9x4": {
              "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g42s9x4/",
              "text": "keep going! Don't stop.",
              "author": "Expensive_Material",
              "created": 1599275167,
              "upvotes": 2,
              "replies": {}
            },
            "g43bs8f": {
              "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g43bs8f/",
              "text": "No lie, I had the exact same problem this week. I am 24 and am in school for my second degree— I haven’t done cross multiplication since high school. I’m a nursing student and I had to look up some refreshers on how the fuck to cross multiply so that I can properly learn drug dosing. \n\nNo shame in admitting your weaknesses. It’d be more shameful to try and fake your way through college if these math skills are something you’re going to use regularly. Your school probably has tutoring available, but if not, there are tons of online resources that help to refresh or teach math at various levels.",
              "author": "rachelleeann17",
              "created": 1599288646,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g4015tm": {
      "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g4015tm/",
      "text": "Mathisfun.com helped me",
      "author": "kaiju_kim",
      "created": 1599235284,
      "upvotes": 29,
      "replies": {
        "g421eck": {
          "link": "/r/college/comments/imild0/too_stupid_to_do_basic_math_but_too_embarrassed/g421eck/",
          "text": "Coolmathgames.com for me",
          "author": "Zorpha",
          "created": 1599259866,
          "upvotes": 12,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634051395
}