{
  "sid": "d8lc56",
  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/",
  "title:": "Has college been easier/more fun than highschool?",
  "text": "I feel like college has been a 10x life improvement over highschool, which might be an unpopular opinion. I see a lot of people in my classes complain a lot.\n\nI feel like I have much more time, much more freedom, much more control over what I want to do and who I want to become/discipline, and for some reason not really depressed anymore.\n\nI enjoy my major classes (just one gen ed left), I have a friend or at least good acquaintances in most classes, and I just feel happier in general. I don't feel shit everyday like I did in HS\n\nalso, fuck waking up at 6am, when marching band kept you till like 10pm\n\nedit: seems pretty split even",
  "author": "9th_Planet_Pluto",
  "created": 1569321403,
  "over_18": false,
  "upvotes": 1179,
  "upvote_ratio": 0.99,
  "comments": {
    "fhzpthi": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/fhzpthi/",
      "text": "I agree with this. I think it’s a combination of how much more free time you have because you aren’t at school 8 hours a day + sports. The biggest thing for me though is I pay attention in class now because my friends that I used to mess around with in class in hs are at different colleges so I only see them on weekends. Also my workload is not very hard right now because I am in prerequisites and an easy math class that is just a review of what I learned in highschool.",
      "author": null,
      "created": 1582006947,
      "upvotes": 1,
      "replies": {}
    },
    "f59fmbp": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f59fmbp/",
      "text": "No homework,program alot more flexible and easier,totally fine,except the classmates are the same like in hs,but again i love the schedule,program",
      "author": null,
      "created": 1572087322,
      "upvotes": 1,
      "replies": {}
    },
    "f4m9783": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f4m9783/",
      "text": "Absolutely not. At least not right now. To me this is no different than high school. Same environment, same kind of students, same kind of teachers, etc.",
      "author": "LordAndSaviorMoloch",
      "created": 1571675749,
      "upvotes": 1,
      "replies": {}
    },
    "f4f4fgw": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f4f4fgw/",
      "text": "Life is much harder but the classes are easier.",
      "author": "118arcane",
      "created": 1571566529,
      "upvotes": 1,
      "replies": {}
    },
    "f1zslyo": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1zslyo/",
      "text": "College has been absolutely horrid for me. Both my gpa and social life was much better in high school.",
      "author": "Mr_FakeNews",
      "created": 1569849128,
      "upvotes": 1,
      "replies": {}
    },
    "f1in9f5": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1in9f5/",
      "text": "i’m a college freshman this semester. there’s still the same amount of work, but i’ve had a lot more fun in college than high school. in high school everyone is concerned about popularity and stuff that doesn’t matter, but in college everyone is chill and always down to meet new people.",
      "author": "dillyparr",
      "created": 1569512586,
      "upvotes": 2,
      "replies": {
        "f1iqfpg": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1iqfpg/",
          "text": "I feel like I’ve gotten better at meeting new people too. I was lonely first year since I never talked to anyone, but after attempting it with strangers once or twice (and making friends that way), I’ve been talking to a lot more strangers now.\n\nJust now on my dog walk I went over and talked to a guy for about 15 minutes, because he was chilling outside with his dog. I would’ve never done that last year",
          "author": "9th_Planet_Pluto",
          "created": 1569513733,
          "upvotes": 1,
          "replies": {
            "f1iruet": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1iruet/",
              "text": "yeah i’d say in college it’s been much easier to talk to new people and i’m not sure why. that’s alright tho because it’s not a bad thing",
              "author": "dillyparr",
              "created": 1569514213,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1h2tgs": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1h2tgs/",
      "text": "To be honest, they’re both the same for me. But I liked high school because everywhere that went there live relatively close to where I lived. So  in a way, it’s like a community",
      "author": "GumballGB",
      "created": 1569484159,
      "upvotes": 1,
      "replies": {}
    },
    "f1gvak1": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1gvak1/",
      "text": "WAY harder. WAY more fun.",
      "author": null,
      "created": 1569478621,
      "upvotes": 1,
      "replies": {}
    },
    "f1fm05v": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1fm05v/",
      "text": "wouldn't say easier, but 10x better than high school, your no longer surrounded by your hometown classmates and acquantainces who can't forget the time you were a weird loser in grade school. In college you can reinvent yourself. I did better academically, mentally, and socially.",
      "author": "Carloverguy20",
      "created": 1569447427,
      "upvotes": 2,
      "replies": {}
    },
    "f1eaaph": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1eaaph/",
      "text": "I don’t like that I’m able to actually fail college whereas that wasn’t an option in highschool",
      "author": "stuart0613",
      "created": 1569417279,
      "upvotes": 1,
      "replies": {}
    },
    "f1e95zi": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1e95zi/",
      "text": "There's more freedom, but overall it is much harder than high school. Depends on your major really.",
      "author": "guyinhisroom",
      "created": 1569416397,
      "upvotes": 1,
      "replies": {}
    },
    "f1e7ps1": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1e7ps1/",
      "text": "I think I'm a more fun person. But college is leagues more difficult than the hardest high school years.",
      "author": null,
      "created": 1569415240,
      "upvotes": 1,
      "replies": {}
    },
    "f1dya6a": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dya6a/",
      "text": "Its a lot harder making friends, I am already shit at it But I had a close group lf pals in hs and now am alone, so can genuinly not wait for classes to start in oktober",
      "author": "datascream11",
      "created": 1569405539,
      "upvotes": 1,
      "replies": {}
    },
    "f1dpmf1": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dpmf1/",
      "text": "Surprisingly it was a bit easier considering you get subjects you picked",
      "author": "TeamCaspy",
      "created": 1569393518,
      "upvotes": 1,
      "replies": {}
    },
    "f1do9f4": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1do9f4/",
      "text": "I went to a hard ass high school. In college my workload was cut in half and things got so much better. I got out of the small town I was living in and all the senselessness that goes with living in a small town.",
      "author": "ComfyFucker9000",
      "created": 1569391801,
      "upvotes": 1,
      "replies": {}
    },
    "f1dnp95": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dnp95/",
      "text": "I'm doing more school work in college than I did in high school (that's me anyway, I took mostly k level class and only a few of them were AP/Dual Credit), but every other aspect of college is so much better than high school. Like you said, we decide on our schedule. We don't have to wake up at 6 or 5:30 in the morning, we don't have to eat at a specific time, AND we don't need to ask for permission to go to the bathroom during class. Plus it's so much easier to make new friends. Maybe that's just because we're older and therefore feel less awkward when it comes to making new friends, but also it's because we're meeting people outside of the school zoned district where we're stuck with almost the same kids for 13 years, so you get a chance to meet more people. Plus you're meeting people of different ages, whereas everyone in your high school classes is roughly around the same age as you. \n\nI just couldn't go back to high school. I don't understand why people say that high school is better than college. It's not like I had a terrible experience in high school either. I was bullied a little bit in my sophomore year, but apart from that, even that year wasn't so bad for me. I had a good amount of friends, I was a B average student, and I have some funny memories from my four years. Regardless, as a sophomore in college, I'd say that my time in college was a whole lot better. I have better friends than I did before, and I'm slightly less tired, but still stressed and tired.",
      "author": "MeeMooHoo",
      "created": 1569391140,
      "upvotes": 1,
      "replies": {}
    },
    "f1dnlvn": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dnlvn/",
      "text": "I'll put it this way:\nI'm broke. I'm exhausted. I'm 1000× happier in college than I was in high school.\nCollege is awesome. I'm learning lots and Living life.",
      "author": "helioscielo",
      "created": 1569391033,
      "upvotes": 1,
      "replies": {}
    },
    "f1dng2d": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dng2d/",
      "text": "I wonder what do you major? I’m a video game addict and I major physics, I haven’t played a single game in 2 weeks cos I’m studying everyday just to be on track. Workload is insane.",
      "author": null,
      "created": 1569390847,
      "upvotes": 1,
      "replies": {
        "f1jhwem": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1jhwem/",
          "text": "I haven't played a single game of LoL in about 2 months either, but that's because I'm learning multiple languages and working on making a video.\n\nI'm majoring in Political Science with 5 classes, and there's a lot of reading but I can usually finish it between classes. It's gonna get a lot busier when I have to start working on essays and projects though later in the semester",
          "author": "9th_Planet_Pluto",
          "created": 1569523412,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1dk96m": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dk96m/",
      "text": "College makes me feel more free, I am good with time management, as well as being fine with the work load, classes are interesting, and engaging.... Only downside is I personally feel very alone in school. Everyone is very selective with their friends and groups at my school.         I often find that despite being told that In highschool I used to \"electrify the room\" and that \"everyone knows you because of how charismatic you are!\" that in college, it just isn't the same for me. I do fine in my classes, I'm in my second year, and I just feel like... I can't click with anyone. I don't know what it is, but I also have no interest in making friends in school now that I'm in college. \nAll in all, indifferent about school, it has its pros and cons, but they cancel each other out for me and I'm indifferent towards it.",
      "author": "Ravenarm80",
      "created": 1569387167,
      "upvotes": 2,
      "replies": {}
    },
    "f1dj5qv": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dj5qv/",
      "text": "I’m still a high schooler, but that’s what it seems every time you go up. Middle school was insane compared to elementary, and highschool was crazy freedom coming from middle school. I’m excited for next year when I go to college, it sounds great",
      "author": "IndecisiveShape",
      "created": 1569385990,
      "upvotes": 1,
      "replies": {}
    },
    "f1didb1": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1didb1/",
      "text": "Depends on your major largely, but I found the first 2 years to be about equivalent to highschool but hard in different ways (e.g. you're competing with more people), but then junior year and probably (going into it now so we'll see) senior year are not even comparable in difficulty, they are way harder. For sure more fun though.",
      "author": "OGMagicConch",
      "created": 1569385174,
      "upvotes": 1,
      "replies": {}
    },
    "f1dgq8q": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dgq8q/",
      "text": "I wouldn't say it's been easier but it been a lot better.  College is a lot better to me because there is more freedom, I don't have to wake up at 5-6am, don't have to be in one building for 7 hours with people I don't like, and I'm learning stuff I care about except for a majority of the Gen Eds.  Those reasons alone are why its a lot better.\n\nThe first two years were a struggle like the Gen Ed classes almost made me drop out. I didn't care about those classes in high school and I really wasn't motivated to take those in college but I did them.  The one 1 AP class I took in High school was harder than most of the Gen Eds but I just wasn't motivated for them. Once I got past those and started taking classes for my CS degree, I really started enjoy it.",
      "author": null,
      "created": 1569383546,
      "upvotes": 1,
      "replies": {}
    },
    "f1dgn8w": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dgn8w/",
      "text": "College is a million times better than high school except for exam weeks. They're a million times worse",
      "author": "sidnfhej",
      "created": 1569383468,
      "upvotes": 1,
      "replies": {}
    },
    "f1df99y": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1df99y/",
      "text": "In terms of material, college has been a lot harder than high school for me. However, I do not understand when people say “omg I wish I can go back to high school life it was a lot better”. I personally think college is much more entertaining, offers a lot of freedom, independancy, no drama, and various life experiences. There is no comparison tbh.",
      "author": null,
      "created": 1569382195,
      "upvotes": 1,
      "replies": {}
    },
    "f1dejfv": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dejfv/",
      "text": "More fun, orders of magnitude harder.",
      "author": "wakato106",
      "created": 1569381568,
      "upvotes": 1,
      "replies": {}
    },
    "f1dc0oc": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dc0oc/",
      "text": "I was so stressed out every single day in high school and made no time for friends or family outside of when I just happened to be around them. I was honestly so lucky to even have friends. Now, I get to get food with my friends even when I'm super stressed or just study with them in the same room. I call my family on the way to and from classes. On top of all that, and I know this will change because half my schedule is gen eds right now, tonight is the first night I've been stressed and I've been in classes a month. Until tonight I've been a week ahead in all my coursework so I get to take tons of breaks to practice my instruments, watch Youtube, hang out with friends, etc. during the week. I also love the freedom of choosing where I go and when I go. There just isn't the same pressure to stay involved in the same activities every single year like there was in high school, so all I have right now is being on pit crew for the marching band (though I plan to add more). It's so much more relaxed and I'm a much healthier person overall. Though the one downside is my stress management is out of practice. Source: I have three tests and a book report next week and I'm on Reddit.",
      "author": "DoublyBubblyMe",
      "created": 1569379441,
      "upvotes": 1,
      "replies": {
        "f1dfadw": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dfadw/",
          "text": "Pit is so fun, what do you mainly play? I played xylophone and loved having melody parts throughout the entire shows I played in. Was the best part of highschool before some drama ruined it",
          "author": "9th_Planet_Pluto",
          "created": 1569382222,
          "upvotes": 1,
          "replies": {
            "f1fmk0l": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1fmk0l/",
              "text": "Oh sorry, I meant pit crew! I play alto sax for marching and oboe for concert, but I got rejected from the band so I'm a \"manager\", or glorified pit crew. I love it but yeah. We mostly move water, music stands, and percussion stands. My college's band doesn't have a pit haha",
              "author": "DoublyBubblyMe",
              "created": 1569447794,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1darqn": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1darqn/",
      "text": "Harder in some, better overall. HS was boring after a while since it was repetitive.",
      "author": "Fckmylyfeinsomeways",
      "created": 1569378439,
      "upvotes": 1,
      "replies": {}
    },
    "f1daks9": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1daks9/",
      "text": "College has been less fun but has been easier than Highschool was for me. Not many of my friends went to college so I dont get to see them all the time but I am enjoying going to school because Im learning about something I enjoy",
      "author": "JobyC4",
      "created": 1569378284,
      "upvotes": 1,
      "replies": {}
    },
    "f1da3g7": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1da3g7/",
      "text": "For me, its been a lot more fun! Less drama, with more people to meet that are from different areas. Im very aware though that some people get very very stressed about grades through it all though",
      "author": "Daemon1530",
      "created": 1569377907,
      "upvotes": 1,
      "replies": {}
    },
    "f1d9kua": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1d9kua/",
      "text": "Excluding overpriced textbooks and others I would say its better since you have more control over your schedule",
      "author": "Crankycarrotparrot",
      "created": 1569377507,
      "upvotes": 1,
      "replies": {}
    },
    "f1d9axg": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1d9axg/",
      "text": "so far college has been a lot harder than high school, academically. i didn't do any work in high school and still got straight a's and b's. i actually have to put in a lot of effort in college, but i don't mind at all. i enjoy the subjects. even gen eds are so much more interesting to me than the classes i was taking in high school. and it's really gratifying to put hard work into something and see the positive results. i used to be severely depressed and bored, but now i'm a generally happy, mentally stable person. plus the people here are amazing. for the first time in my life i actually feel like i have friends that i love and trust completely.",
      "author": "hiccupbb",
      "created": 1569377289,
      "upvotes": 1,
      "replies": {}
    },
    "f1d8pr4": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1d8pr4/",
      "text": "College has been a much better and actually easier experience for me. I’m not forced to take classes I suck at every day for a whole year and I get to leave and go home in between classes so I’m not stuck in one building not allowed to leave for 7 hours. College is way better than high school ever was for me",
      "author": "gt_potson",
      "created": 1569376834,
      "upvotes": 1,
      "replies": {}
    },
    "f1d6x7x": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1d6x7x/",
      "text": "I enjoyed high school a lot more, and high school was a lot harder. I liked the small class sizes of high school and my teachers really cared about us, so everything felt very tight-knit. I really liked the diversity of my high school too. I get that this is specific to just my experience, but these are the reasons I prefer high school over my college experience. In college, professors don't give a shit about us, massive class sizes, zero diversity, and classes aren't that interesting. Also no ECs that interest me like there were in high school, surprisingly. I know I'm in the minority, but this goes to show there are people that think hs is better lol. High school also gave me a lot more drive and determination- I was a much harder worker back then.",
      "author": null,
      "created": 1569375471,
      "upvotes": 1,
      "replies": {}
    },
    "f1d66vl": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1d66vl/",
      "text": "I’ve only been here for 4 days and class hasn’t even started yet, but so far it’s much better. I don’t have any close close friends yet but everyone’s so chill here and freedom is amazing.",
      "author": "josephinesmiles",
      "created": 1569374921,
      "upvotes": 1,
      "replies": {}
    },
    "f1d4xgi": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1d4xgi/",
      "text": "A lot of people on Reddit think college is a lot better than high school.\n\nI hated high school but college is far worse, more awful and terrible.",
      "author": "-Sky_Nova_20-",
      "created": 1569373988,
      "upvotes": 2,
      "replies": {}
    },
    "f1d0q0s": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1d0q0s/",
      "text": "It honestly depends on what you’re studying and how hard you’re willing to push yourself. For some, college is much easier than high school; for others, it’s the exact opposite.",
      "author": "Nickvec",
      "created": 1569370822,
      "upvotes": 1,
      "replies": {}
    },
    "f1cz8t7": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cz8t7/",
      "text": "the course work is rigorous in a jump and swim kind of way. I can see why students drink to unwind.",
      "author": null,
      "created": 1569369709,
      "upvotes": 1,
      "replies": {}
    },
    "f1cxv4d": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cxv4d/",
      "text": "Overall better, but not as easy, at least curriculum-wise. \n\nIn high school I didn't have a name for my anxiety. I didn't even have the vocabulary to talk about how I was feeling or why big expectations/answering phone calls/answering doorbells/being spontaneous made me want to cry. On the other hand, I had a very large network of friends and a group where I felt I belonged (band). Also, the work was a cakewalk (except for calc). I'm not saying I'm smart or anything, it's just that public educators are neutered from asking anything of their students that challenges them. It fucks with graduation rates which fucks with grant money. \n\nCollege work is actually work. For me (history major) it's a fuck ton of reading and writing. I love it. I also really figured out a lot about myself, my relationship with my family, and anxiety. It took a couple of huge missteps in my senior year, but I'm glad it happened. I had to take a year off, but now I'm back at my last semester and feel really self-equipped. One downside is my friend group from HS didn't stay super close. I had a falling out with my longtime best friend, and coming in to university as a transfer student made being social a little harder. I have a really wonderful friend I met by chance, and a couple of nice acquaintances, but nothing like the network I had in high school. No biggie, but it's very different! \n\nAs far as personal enjoyment and satisfaction, I love college so much more. The work is so rewarding and genuinely interesting. I love the discussions I get to have with my professors and having the freedom to make my own schedule.",
      "author": "alligator124",
      "created": 1569368676,
      "upvotes": 1,
      "replies": {
        "f1czsqm": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1czsqm/",
          "text": "I'm glad you're having a better life now!",
          "author": "9th_Planet_Pluto",
          "created": 1569370121,
          "upvotes": 2,
          "replies": {
            "f1gmxic": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1gmxic/",
              "text": "Thank you so much!",
              "author": "alligator124",
              "created": 1569471207,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1cwnmg": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cwnmg/",
      "text": "I'm graduating soon and I think college is way easier than high school. The classes specifically might be harder in college, but what makes it easier is the ability to have free reign over your time and priorities. Being able to make your own schedule, pick class times that work best for you, meet new groups of people from all over, being responsible for yourself, etc.. in high school, everything is very one sided and controlling, everyone has the same schedule, classes, and it makes an overall environment that isn't best for everyone's learning",
      "author": "Ddqvfx",
      "created": 1569367781,
      "upvotes": 1,
      "replies": {}
    },
    "f1cvqtb": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cvqtb/",
      "text": "Easier? Yes. More fun? Hell Noh.",
      "author": "notlostinchina",
      "created": 1569367112,
      "upvotes": 1,
      "replies": {}
    },
    "f1cvnfi": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cvnfi/",
      "text": "So much better. Can manage your own time and energy, there is very little social pressure, all and all you just have more freedom. If you know how to manage your time, it's amazing.",
      "author": "herr_leutnant",
      "created": 1569367044,
      "upvotes": 1,
      "replies": {}
    },
    "f1cubfc": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cubfc/",
      "text": "I agree 100%",
      "author": "wives_nuns_sluts",
      "created": 1569366064,
      "upvotes": 1,
      "replies": {}
    },
    "f1ctnyt": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1ctnyt/",
      "text": "High school was a motherfucking JOKE. I hated every second of high school. I absolutely loved college though. You were treated as an adult and the students took it seriously (most of them). You paid to be there, so the majority of students didn't fool around during lectures.",
      "author": "zzzrecruit",
      "created": 1569365594,
      "upvotes": 1,
      "replies": {}
    },
    "f1ctnu3": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1ctnu3/",
      "text": "It definitely has been for me!",
      "author": "swimmindawg",
      "created": 1569365592,
      "upvotes": 1,
      "replies": {}
    },
    "f1csx7e": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1csx7e/",
      "text": "Honestly, for me college has been better. My high school overworked what was known as the AP kids (Honors kids basically), and I was one of them. They had also put a much higher standard on us than what my current professors do right now. I'm mad that they did that to us, but not completely ungrateful because now college is easy to me while others are struggling.",
      "author": "Erest01",
      "created": 1569365058,
      "upvotes": 1,
      "replies": {}
    },
    "f1cpkxv": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cpkxv/",
      "text": "It's way harder for me. I think it partly depends on what you're studying and your overall environment though.",
      "author": "HorsesFlyIntoBoxes",
      "created": 1569362719,
      "upvotes": 1,
      "replies": {}
    },
    "f1cpics": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cpics/",
      "text": "If my shitty 2.0 gpa represents anything is that I hated high school for how stressful it was.\n\nIf my 3.8. And 3.7 cc and university gpa represents anything its that I found college to be way easier. \n\nI was a history major but to be fucking honest I only pulled good grades because I love history. If I didnt this shit would be omega hard. \n\nAlso fuck my teachers in high school except for a few. Esp the ones that gave me Fs... fucking hell I got one every semester in HS. Compared to one in community college and none in university.",
      "author": "PossiblyAsian",
      "created": 1569362669,
      "upvotes": 1,
      "replies": {}
    },
    "f1cp3zu": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cp3zu/",
      "text": "For me, it was more fun but definitely harder. I found it more fun because it’s not like high school where there’s cliques, lunch tables for certain groups, and all that nonsense. Sure there’s friend groups but there’s much more freedom in who you can be and less confinement. Workload was difficult (I was a CS major) but that probably depends on what you plan to major in and what school you go to. Regardless, I think the workload will be difficult either way just because it’s an adjustment from high school",
      "author": "tinyjava",
      "created": 1569362399,
      "upvotes": 1,
      "replies": {}
    },
    "f1conx2": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1conx2/",
      "text": "I absolutely agree!!!! College has been more enjoyable than high school by a freaking landslide!",
      "author": "maddswonderful",
      "created": 1569362104,
      "upvotes": 1,
      "replies": {}
    },
    "f1cn0s7": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cn0s7/",
      "text": "Not easier but the social experience is much better. I’m more willing to do the work too because for the most part I’m taking classes that interest me",
      "author": "legaljoker",
      "created": 1569361029,
      "upvotes": 1,
      "replies": {}
    },
    "f1clkmc": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1clkmc/",
      "text": "Not easier but deff more fun",
      "author": null,
      "created": 1569360135,
      "upvotes": 1,
      "replies": {}
    },
    "f1clj0z": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1clj0z/",
      "text": "Wayyy better! I love it so much! I haven’t made friends yet, but at least I’m not getting bullied like I was in HS!",
      "author": "northphotograph",
      "created": 1569360109,
      "upvotes": 1,
      "replies": {}
    },
    "f1ck7bq": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1ck7bq/",
      "text": "College was way better than high school for me\n\n1. Pseudo-independence from your parents (well you may still be financially dependent but at least you can do whatever the hell you want). Can seems scary at first with more responsibility but at the end of the day this is a positive net change \n\n2. More people (in high school you may be limited to whoever goes to your school as far as making friends. College usually presents a much larger sample size, better chance of “finding your group”)\n\n3. Study what you want \n\n4. More free time",
      "author": null,
      "created": 1569359295,
      "upvotes": 1,
      "replies": {}
    },
    "f1ck6fy": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1ck6fy/",
      "text": "I have  loved college so much more than high school and I was average or just below average, and my first two years I managed a 3.9 GPA. I have so much more time to actually learn material instead of memorizing for a test. I feel much more supported by my professors as well.",
      "author": "lucy995",
      "created": 1569359280,
      "upvotes": 1,
      "replies": {}
    },
    "f1cgu80": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cgu80/",
      "text": "College >>> highschool. College is way harder, but I've learned a lot of things (academically and practicality-wise) compared in highschool. In addition, there are a lot of great people you'll meet in college. \n\nEdit: grammar and punctuation.",
      "author": "Pannikii",
      "created": 1569357323,
      "upvotes": 1,
      "replies": {}
    },
    "f1cg6d3": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cg6d3/",
      "text": "I come from a crappy high school so college has been 1000x harder. That being said, there is more freedom, but I’d give it back 😂",
      "author": "CreationsofMine1999",
      "created": 1569356940,
      "upvotes": 1,
      "replies": {}
    },
    "f1cebb8": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cebb8/",
      "text": "I felt like college was 20x harder in terms of workload, stress levels, etc. But it was also 20x more fun.",
      "author": "TheAnteatr",
      "created": 1569355819,
      "upvotes": 1,
      "replies": {}
    },
    "f1ce2hs": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1ce2hs/",
      "text": "I feel more trapped and alone than ever.",
      "author": "Adadave",
      "created": 1569355668,
      "upvotes": 3,
      "replies": {}
    },
    "f1cdcln": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cdcln/",
      "text": "Definailty not easier",
      "author": "MerK-x-VeNoOm",
      "created": 1569355228,
      "upvotes": 1,
      "replies": {}
    },
    "f1ccru7": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1ccru7/",
      "text": "I definitely had a smoother time in college than high school.",
      "author": "DerpyArtist",
      "created": 1569354881,
      "upvotes": 1,
      "replies": {}
    },
    "f1c96ow": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c96ow/",
      "text": "Not easier, but definitely less annoying. MOST people act more mature, not so childish like in high school",
      "author": "Mexican-Spider-Man",
      "created": 1569352686,
      "upvotes": 1,
      "replies": {}
    },
    "f1c7wqu": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c7wqu/",
      "text": "For me, college has definitely been easier and better than high school, and I was shocked at this because I was told my whole life that high school was easy compared to college. I don’t have to get up at 6 AM, I go to class like 13 hours a week compared to 35, I have tons of time to do homework, my profs aren’t miserable, and I’m not treated like a baby. My mental health has never been better, and I actually get 8-9 hours of sleep a night. Not to mention I’m not bored and miserable all day everyday. I have a lot of time to myself, and I’m treated like an adult. I actually enjoy learning again, and it’s so great! I don’t miss high school at ALL. Not sorry.",
      "author": "rainbowharmony",
      "created": 1569351887,
      "upvotes": 1,
      "replies": {
        "f1cdzhu": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cdzhu/",
          "text": "Hell yes to the mental health\n\nGlad to not be miserable anymore",
          "author": "9th_Planet_Pluto",
          "created": 1569355617,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f1c60ry": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c60ry/",
      "text": "High school is easier, college is more fun.",
      "author": "PotRoastMyDudes",
      "created": 1569350687,
      "upvotes": 1,
      "replies": {}
    },
    "f1c599t": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c599t/",
      "text": "I’ve had my ups and downs, but in general, university is better than high school, especially if you know what you are doing and you are in a major that you like. “Easier” depends on the major you are in.",
      "author": "BooksLoveTalksnIdeas",
      "created": 1569350203,
      "upvotes": 1,
      "replies": {}
    },
    "f1c4pbq": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c4pbq/",
      "text": "College isn’t easier in terms of academics but just overall a better environment because you don’t have to deal with annoying students/people like you would in HS. You have a choice of who you are around at any time. Also college weeds out problematic students meaning actual class time is more productive. There’s more friends to choose from and you meet a lot of people that share the same interests as you by default if you have a major or play a sport joins club etc.",
      "author": null,
      "created": 1569349847,
      "upvotes": 1,
      "replies": {}
    },
    "f1c2wjk": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c2wjk/",
      "text": "Academically much much harder than high school, and my personal life hasn't honestly changed much, I have a different group of friends at uni than at home but other than that it's pretty similar.",
      "author": "Epicsauce1234",
      "created": 1569348684,
      "upvotes": 1,
      "replies": {}
    },
    "f1c24tm": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c24tm/",
      "text": "College is miles better than highschool\n\nI cant think of a  way its worse, i see some people say its easier but for me Uni is way easier due to the subjects being things i enjoy rather than subjects i had to endure",
      "author": "astonaidan",
      "created": 1569348188,
      "upvotes": 1,
      "replies": {}
    },
    "f1c0i28": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c0i28/",
      "text": "I’m a senior now and I feel so much pressure to find a job. It’s like I’m at the end of the plank.",
      "author": null,
      "created": 1569347132,
      "upvotes": 1,
      "replies": {}
    },
    "f1bzjii": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bzjii/",
      "text": "Easier? Yeah, for sure, at least for me. I actually find myself way less challenged by my work in college than high school for the most part- it's more about getting it done for me than actually struggling with it.\n\nMore fun? That one's up for debate. I've had a rollercoaster of a social life, so I'm still not sure.",
      "author": "standardbluejay",
      "created": 1569346509,
      "upvotes": 1,
      "replies": {}
    },
    "f1bzcco": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bzcco/",
      "text": "All in all I prefer high school. I had so many friends in high school. We all lived around the same area because you had to live within a certain boundary line to go to certain schools. I also lived super close to my school so friends could just come over whenever they wanted since it was within walking distance. Now I’m at a commuter campus where everyone lives in random places and since it’s the only university in this part of my state, people can live up to like an hour or more away sometimes. You’ll meet someone in class and kind of click but never get to chill on your own time because they live so far away. Each year I probably meet 1 person who lives close enough to actually be friends with. In high school you’re all on the same schedule so once 2:30 hits you’re all free. In college you could meet someone cool in your last class of the day and learn that it’s their first class of the day. It’s just hard to make things work socially in my college rather than high school. Also academia were way easier in high school. (I also didn’t have the typical high school experience that a lot of other people did so that could definitely come into play)",
      "author": "theonefuckedupchick",
      "created": 1569346381,
      "upvotes": 2,
      "replies": {}
    },
    "f1bz1vj": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bz1vj/",
      "text": "HELL YES, College for me has been the best learning experience I ever had in my life. Everything is just way better. I don’t miss high school at all. College has been the best thing that ever happened to me. Everything just feel more easier and most students I meet want to better themselves just like me. People is all around more positive, and less no drama. And high school was a shitshow every day.",
      "author": "RangerMain",
      "created": 1569346193,
      "upvotes": 1,
      "replies": {}
    },
    "f1bz0n1": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bz0n1/",
      "text": "I absolutely loved college more than high school. I loved having freedom, respect as an adult, and studying abroad. It was truly some of the best years of my life!",
      "author": "geezelaweez",
      "created": 1569346171,
      "upvotes": 1,
      "replies": {}
    },
    "f1by2g3": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1by2g3/",
      "text": "From my personal experience, college was a tad bit easier than high school. Between the light work load, being able to create your own schedule and having more independence, my college experience was definitely  easier than my high school experience. Plus I lived in a dorm throughout my 3 years in college, so I was able to learn how to live on my own whereas I wasn’t able to do that when I was in high school. \n\nAs far as social life, socializing in college was pretty hard for me because of how shitty my high school experience was in regards to socializing with my peers. Not to mention that I was an out of state student (for context, I’m from New York and I went to college in North Carolina), so I felt a little bit of college shock even though I’ve been to the South numerous times before in part because my dad’s family lives in/are from the Carolinas.",
      "author": "MiketheKing2",
      "created": 1569345555,
      "upvotes": 1,
      "replies": {}
    },
    "f1buldl": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1buldl/",
      "text": "Socially it's been about the same. I see my friends in class and in school but other than that I'm working on homework or studying. It's unfortunate but not uncommon. \n\nAcademically it's been more difficult I would say. I'm staying up later than I did before to do homework. \n\nI had some awesome teachers in both and I have some great friends from both. It honestly just feels like a continuation at this point. \n\n(Hopefully it gets better though. I want to enjoy college rather than just study through it like I do now)",
      "author": "TheGhzGuy",
      "created": 1569343314,
      "upvotes": 2,
      "replies": {}
    },
    "f1btt7z": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1btt7z/",
      "text": "yes 100% the only difference is there is more hw. i go to a top college and i was worried that it would be way harder but it’s way easier. all ur friends live max 30 mins away, u can walk everywhere, sports practices are harder which is way more fun, classes are better, and teachers r cool. the only thing that is worse is the quantity of hw. i am a political science psychology double major and the only bad thing is the 60-150 pages of reading a day per class. but if u can time manage it’s totally doable.",
      "author": "snekhoe",
      "created": 1569342813,
      "upvotes": 1,
      "replies": {
        "f1bvcq3": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bvcq3/",
          "text": "damn, double major sounds rough. I have to read a lot too for polisci, but at least it's content I like and not meaningless worksheets",
          "author": "9th_Planet_Pluto",
          "created": 1569343803,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f1btms7": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1btms7/",
      "text": "Not at all. Work hasn’t been hard but I’m not sure how to make new friends. Idk anyone here",
      "author": "Stealthkillerftw",
      "created": 1569342699,
      "upvotes": 1,
      "replies": {
        "f1buujh": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1buujh/",
          "text": "It was hard for me at first to make friends too, and I'm sure it's significantly harder to make friends if you have anxiety or something. I was very lonely my first year until I gathered the courage to talk to two people, who luckily ended up becoming friends. It'd probably have been hard if they rejected me or were toxic in some way.\n\nReally the only way to make friends in college is to initiate. You have to initiate the conversation with a completely random stranger (classmate). Sometimes they become good friends, sometimes they just stay an acquaintance you'll forget after that semester. The first time is hard, but after a few times it should become easy to talk to strangers.",
          "author": "9th_Planet_Pluto",
          "created": 1569343478,
          "upvotes": 2,
          "replies": {
            "f1c0ihe": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c0ihe/",
              "text": "I appreciate it man. I do have a little bit of anxiety but I’m never really sure how to make the first move for talking to someone. I’m good with holding a conversation but can never start it. I might try and join a club to maybe meet some new people.",
              "author": "Stealthkillerftw",
              "created": 1569347140,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1bt4gi": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bt4gi/",
      "text": "I decided to attend community college and so far it has been significantly easier and less fun than high school. One of the disadvantages of community college is that everyone is a commuter, so there is a lack of student life. In most of my classes the workload is light compared to the AP classes to took in high school. I’m almost two months in and I’ve done most of my work for the entire semester already, minus a few tests and essays.",
      "author": "bryden-",
      "created": 1569342374,
      "upvotes": 1,
      "replies": {
        "f1bv1ct": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bv1ct/",
          "text": "Do you have plans of transferring? I did my first 2 semesters at a CC and I feel it really helped me prepare for a full on university workload/experience.",
          "author": "samslayer68",
          "created": 1569343598,
          "upvotes": 1,
          "replies": {
            "f1c4467": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c4467/",
              "text": "Yes, I’m already transferring to a university in the spring! I do feel like it’s helping me transition from the high school mindset though. I do value the education I’m getting, I just feel high school was better for me.",
              "author": "bryden-",
              "created": 1569349468,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f1bv2av": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bv2av/",
          "text": "I'm a commuter and never attend clubs, but I've found time to hang out with friends between classes, be it sitting down for an hour or talking while we walk to our next class for 5 minutes.\n\nOr just texting at home.",
          "author": "9th_Planet_Pluto",
          "created": 1569343615,
          "upvotes": 1,
          "replies": {
            "f1c65vx": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c65vx/",
              "text": "Yeah I’ve been doing that too. I feel like it’s harder at a community college to be social but once I go to uni it will change.",
              "author": "bryden-",
              "created": 1569350777,
              "upvotes": 1,
              "replies": {
                "f1c6mmw": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c6mmw/",
                  "text": "Hopefully. Good luck man",
                  "author": "9th_Planet_Pluto",
                  "created": 1569351073,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f1bsfrh": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bsfrh/",
      "text": "I feel this depends a lot on your major/career goals. As a pre-med student college blows. My curriculum is not flexible at all and I am constantly searching for ways to make myself more competitive for medical school.",
      "author": "Phoenixsoccer15",
      "created": 1569341938,
      "upvotes": 1,
      "replies": {
        "f1bv8tz": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bv8tz/",
          "text": "I can't imagine going into premed or law. STEM too. My brother's a business major and his courses are predetermined with very little flexibility, it's too linear of a progression for me.\n\nWhereas I'm polisci and after my first polisci class, I've had freedom choosing any class in my major in any order. I can balance my workload every semester with a mix of easy and hard classes.",
          "author": "9th_Planet_Pluto",
          "created": 1569343734,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f1bsejb": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bsejb/",
      "text": "Graduating this upcoming spring, and it has been FAR easier. I don't think I've had a single class in the two colleges I have attended that gave as much homework as the average class at my high school. Plus, more genuine people, more flexibility with schedule, etc.\nETA: Classes in high school felt more rewarding as they were more challenging. I've only taken a couple of challenging classes in college, and those were on niche subjects (entomology, soil science). Though niche literature courses in college were easier than high school literature courses.",
      "author": "kspinner",
      "created": 1569341916,
      "upvotes": 1,
      "replies": {
        "f1bunef": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bunef/",
          "text": "holy moly the amount of useless homework highschool gave\n\nCollege is a lot better, though I do spend a lot of time reading the textbooks now. But at least I care what the textbook has to say now. And it only gets busy homework-wise if there's a huge project coming up",
          "author": "9th_Planet_Pluto",
          "created": 1569343350,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1br5hg": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1br5hg/",
      "text": " College is all about you the student and less impact from the professor. Most of the learning you can do on your own from reading the text and studying. Tbh the professor is there to give me random facts that the text won’t, or a source for questions. It’s about how you manage your schedule and your time, instead of the school district telling you how to. I think it’s way better.",
      "author": "imbrownbutwhite",
      "created": 1569341102,
      "upvotes": 1,
      "replies": {}
    },
    "f1br1rq": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1br1rq/",
      "text": "For me it's a definite yes. I become soulless when I'm forced to wake up early and become chained to a desk for 8 hours. People in college appear to be more smart and understanding of others instead of brats who think they're better than everyone else. The main thing high school taught me was how to deal with bullshit. \n\nMost of college work for me has just been reading a textbook and I like reading :)",
      "author": "FlameofOath",
      "created": 1569341034,
      "upvotes": 2,
      "replies": {}
    },
    "f1bqyzk": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqyzk/",
      "text": "Highschool was infinitely easier but I still like college better.",
      "author": "Zerobeastly",
      "created": 1569340982,
      "upvotes": 1,
      "replies": {}
    },
    "f1bqs3s": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqs3s/",
      "text": "From personal experience, college has had its pros and cons, but overall, I found it to be way better than high school.\n\nThe work load isn't too much easier, but at the same time, I've had more time to do it since I don't have the same classes every day (I was at a high school that, to my disappointment, didn't implement a block schedule). I've had to get used to checking the syllabus every day to know exactly what's happening, but it's surprisingly calming because you're not being reminded of the same project every day like a countdown and like you're running out of time minute by minute. So even with those sort of \"cons,\" they've been pretty manageable and not too big of problems.\n\nMy professors, have been awesome people and doing all in their power to help, usually preferring their first names. They're also much more relaxed in conversation so it makes for some interesting days. I, by far, prefer my professors over most of my high school teachers; I have maybe about 2 or 3 that, to this day, I really talk to. \n\nSocially, I'm doing **so. much. better.** I was that awkward emo kid in high school that lost basically most of their friends to an abusive relationship in mid-Sophomore year to very early Senior year. I was also pretty consistently bullied in high school, and in high school, it sucks because more people are more likely to at least put the name to the face. Now, I'm somehow making friends left and right, in and outside of classes. Somehow, not sure how, but it feels like the whole bully problem I had went away once college hit, which is kind of funny, since one of my bullies goes to my college and I have no doubt she's seen me. Plus, goofing off on campus is fun af.\n\nOh, and not to mention that colleges are more willing to discuss more taboo subjects, and that openness is helpful for starting a conversation if, for example, someone is seeking support for being sexually assaulted, and for taking action against it. That alone is helpful since I was never able to bring up nearly being assaulted (by someone I thought I could trust) to my family.",
      "author": "FallingBackToEarth",
      "created": 1569340859,
      "upvotes": 2,
      "replies": {}
    },
    "f1bqi0s": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqi0s/",
      "text": "For me not living at home has been incredible and I’m much much happier, however I can’t slack off and get As like I did in high school. So I guess it’s an even trade off",
      "author": "ALFanator34",
      "created": 1569340678,
      "upvotes": 1,
      "replies": {}
    },
    "f1bqhv3": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqhv3/",
      "text": "Absolutely",
      "author": "FrigidArrow",
      "created": 1569340675,
      "upvotes": 1,
      "replies": {}
    },
    "f1bq23q": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bq23q/",
      "text": "Mine is easier than high school but mostly because I actually care and so do my classmates. We’re not required by law to be here so it’s actually enjoyable and the professors seem to care more and work with us more often.",
      "author": "brig517",
      "created": 1569340391,
      "upvotes": 1,
      "replies": {
        "f1bqba9": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqba9/",
          "text": "gen eds have the worst classmates (rude x300) and most people don't want to be there, whereas the major classes have been much nicer and small (~20 people)",
          "author": "9th_Planet_Pluto",
          "created": 1569340557,
          "upvotes": 2,
          "replies": {
            "f1bqhwm": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqhwm/",
              "text": "True! I’m past my gen eds (junior) so I kinda forgot how awful they are.",
              "author": "brig517",
              "created": 1569340676,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1bppct": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bppct/",
      "text": "i agree with this  ! i generally have loved college sm",
      "author": "mindlesscat01",
      "created": 1569340160,
      "upvotes": 1,
      "replies": {}
    },
    "f1bpi3r": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bpi3r/",
      "text": " I mean the work is so much more difficult\n\nBUT my social life generally improved. Mostly because bullies didn’t follow me to uni :p and here if someone upsets me, I don’t have to associate with them. We’re not locked in the same space for 8 hours a day.",
      "author": "nun_the_wiser",
      "created": 1569340030,
      "upvotes": 1,
      "replies": {
        "f1bqmnm": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqmnm/",
          "text": "I'm glad to hear you're doing better. It's nice to be able to choose who we associate with",
          "author": "9th_Planet_Pluto",
          "created": 1569340761,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1bp1mb": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bp1mb/",
      "text": "Definetly college is much harder for me. However, material is much more interesting.",
      "author": "BenardoDiShaprio",
      "created": 1569339736,
      "upvotes": 1,
      "replies": {}
    },
    "f1bp1lk": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bp1lk/",
      "text": "I have to say it’s easier because most of the time you can create your own schedule, granted that the classes you need are available when you need them to be. As far as the work load, the people, and the general demand of time and attention spent is just as difficult as high school. Of course the demand of time and attention will vary class to class. I, personally, am very antisocial though. I hate having to work and converse with people, and sadly that’s a huge requirement for success in college... They say high school never ends!",
      "author": "97nobody",
      "created": 1569339736,
      "upvotes": 1,
      "replies": {
        "f1bqkc5": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqkc5/",
          "text": "Creating own schedules helps a lot, I lined my classes up so I only go in 3 days a week.\n\nGroup projects suck when you don't know your classmates though, and group discussions feel pretty useless and bs'd by most people",
          "author": "9th_Planet_Pluto",
          "created": 1569340719,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1bo3fp": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bo3fp/",
      "text": "Hey we go to the same school.\n\nIve found college work to be easier objectively,  but I put a lot more effort into it now so I spend about the same amount of time doing work, maybe more.\n\nI think Ill end up enjoying it more but for now I'm still in the process of meeting new people and stuff",
      "author": "Connor1736",
      "created": 1569339112,
      "upvotes": 3,
      "replies": {}
    },
    "f1bo31x": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bo31x/",
      "text": "Academically it’s easier but also MUCH easier to procrastinate which can be a big problem. In my experience the social life has been disappointing. My floor is one big group and we hang out all the time but I just don’t feel similar enough to them and I miss friends who I’m close with. I feel like everyone’s established their groups and I don’t have any friends in my classes really",
      "author": "BostonConnor11",
      "created": 1569339106,
      "upvotes": 1,
      "replies": {}
    },
    "f1bnzmv": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bnzmv/",
      "text": "I have so much less free time and I’m tired a lot but i actually enjoy what I’m doing, so overall I’m a lot happier",
      "author": "kmn19999",
      "created": 1569339044,
      "upvotes": 1,
      "replies": {}
    },
    "f1bntgb": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bntgb/",
      "text": "Easier during freshman year, and gets harder and harder as you go from there. Junior year was the hardest/most intense. First semester senior year My hair started going gray when I was on page 43 of my senior thesis lol\n\nBUT, Much more fun than high school, by far. You can better choose your friends and enjoy new interests, you have more freedom, and it’s the sweet spot between being a teenager and being an adult where you can just go wild (with or without partying)",
      "author": "uhbnoxious",
      "created": 1569338931,
      "upvotes": 1,
      "replies": {}
    },
    "f1bn7jd": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bn7jd/",
      "text": "It’s nice to have night classes and sleep till mid noon",
      "author": "Blackarican45",
      "created": 1569338530,
      "upvotes": 1,
      "replies": {}
    },
    "f1blmg5": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1blmg5/",
      "text": "I never found college to be any harder, if anything it was easier for me. I guess I can attest this to the AP credits I got from high school so starting my freshman year, I was able to jump into my core classes which I found much more interesting than having to take calculus or history all over again. In terms of freedom, it's amazing. I go to school out of state and for my it was a smooth transition of \"leaving the nest\" I felt absolutely ready to leave home and I actually felt annoyed any time I had to go back home. It's good having people around you who are actually smart (if not smarter than you) and it's great to have conversations with them about politics or movies. So yes, i have definitely felt that way as well.",
      "author": "wilinouthere",
      "created": 1569337481,
      "upvotes": 5,
      "replies": {
        "f1bm0se": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bm0se/",
          "text": "AP credits helped me too, had half my gen eds done and the other half blitzkrieged in freshman year. No more hard sciences or english essays to bullshit for me, for life.\n\nI live at home but it's fine because I'm not really extroverted and don't have friends who come over or a gf atm anyways. Having my own private room feels good, compared to if I needed to dorm or apartment.\n\nHaving smarter people definitely helps motivate me. When people say they are learning a language in college, they are sometimes even better than me in Japanese (I'm a heritage speaker). Whereas I've been slacking on German for a long time now, got motivated to start studying consistently again.",
          "author": "9th_Planet_Pluto",
          "created": 1569337744,
          "upvotes": 2,
          "replies": {
            "f1bmium": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bmium/",
              "text": "Definitely the case for me lol I was so happy to not have to take any english writing courses anymore. Although I'm currently in a math class and wish I had done it earlier since I don't remember math at all! I think I was lucky in that I had a single room my freshman year so I had all the privacy in the world (although now I wish I had someone with me and that I had made more friends since I spent most of the time behind my closed door) but I guess there's a downside and an upside. I am a heritage Russian speaker and it's incredible how bad I am lol! I hear others speaking it and it's pretty bad how good they are. I'm on the Spanish track although I'm lacking motivation this year because of how much better others are than me/how much they actually care about the culture and language.",
              "author": "wilinouthere",
              "created": 1569338072,
              "upvotes": 1,
              "replies": {
                "f1boc86": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1boc86/",
                  "text": "Do you enjoy r/languagelearning? (There's some good resources on there regardless).\n\nI like it (doing Russian at school, German on my own), and seeing other people who are monolingual able to speak a language they dedicate to is inspiring for me. I've even started learning Japanese kanji again so I can get better at my heritage tongue, because I've forgotten a lot of it since I just type it most of the time",
                  "author": "9th_Planet_Pluto",
                  "created": 1569339274,
                  "upvotes": 1,
                  "replies": {
                    "f1bopsf": {
                      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bopsf/",
                      "text": "I think I've just lost my interest in it although I am learning ASL this semester. Definitely still trying to get used to it. I haven't actually looked at that sub so maybe I will now but I minored in Spanish essentially so it would look good on my resume and all. I don't really enjoy what I'm learning and that's why it's been demotivating for me to see other students who actually care about it. I am a speech therapy major so there's a lot of linguistic type topics involved so I became more interested in Russian since it's my first language and Italian since my brother in law is from there. I find Italian so cool.",
                      "author": "wilinouthere",
                      "created": 1569339524,
                      "upvotes": 1,
                      "replies": {
                        "f1bqgjs": {
                          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqgjs/",
                          "text": "Italian does seem cool. I'm minoring in Russian studies.\n\nI wish we had linguistics at my college. Would've definitely taken classes from that as I like languages, but unfortunately not. Speech therapy does sound fun though (and stressful)",
                          "author": "9th_Planet_Pluto",
                          "created": 1569340651,
                          "upvotes": 1,
                          "replies": {
                            "f1bqpiq": {
                              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqpiq/",
                              "text": "There's always the future lol my mom always tells me \"get your degree and get a job and once you want to go back to school to learn something new, you'll be able to.\" Speech therapy's pretty cool lol not very stressful as of now since I'm only in undergrad but I'm applying to grad schools this semester and, let me tell you, THAT is stressful lol",
                              "author": "wilinouthere",
                              "created": 1569340812,
                              "upvotes": 1,
                              "replies": {
                                "f1brvgt": {
                                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1brvgt/",
                                  "text": "FIRE (/r/financialindependence) might interest you if you want to go back and learn something you want to do.\n\nI'll probably not do grad school, so godbless for that",
                                  "author": "9th_Planet_Pluto",
                                  "created": 1569341574,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "f1gu1wq": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1gu1wq/",
          "text": "Man this is insane. I have the exact opposite experience, in every way. I hate college, and long to go back home at any opportunity. The people here are so much less intelligent than in high school; I went from the number 1 high school in my state (also a full-time gifted school) to a normal state college. \n\nIt’s so hard to make new friends. Leaving behind my tight-knit group of amazing people from high school (as well as my family) is THE HARDEST thing I’ve had to do in my entire life, no joke. \n\nIt’s all sent me spiraling into a deep depression. I have no motivation to do anything. I hate college. I hate my life. I just want to go back in time. I would give anything for that.",
          "author": "Crusty_Gerbil",
          "created": 1569477347,
          "upvotes": 1,
          "replies": {
            "f1ikd5h": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1ikd5h/",
              "text": "If it helps in any case, I had a falling out with my high school friend group (they booted me right out of the group and basically started saying every bad thing they thought about me to just about everyone in my high school) so when I come home, I have no one to really hang out with since I became so isolated. It always makes me so jealous seeing others hanging out with their old friends and enjoying their breaks. I was in a realllllyyyy low mood when I started summer vacations since I didn't have a job yet and was stuck at home for a month. I agree making friends in college is harder than a lot of people make it seem like. I go to a big 10 and greek life/ parties are a huge part of the culture and I'm not into any of that. I isolated myself freshman because i had a boyfriend back home (HORRIBLE idea), then my second year when I tried making friends, I got booted out of another friend group yet again so trust me, I'm not that happy. But in terms of the transition in general for me, it was fine.",
              "author": "wilinouthere",
              "created": 1569511539,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1bldtd": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bldtd/",
      "text": "College is much more difficult. In high school I had access to tutors if I ever needed help. I’m not saying you’re guaranteed to pass but in high school if you put in the effort you’ll do fine.  In college we have tutors but it’s near impossible to schedule an appointment. Socially it’s about the same. I go to a small college and we hardly have any organizations.",
      "author": "Krosusbeamhurts",
      "created": 1569337322,
      "upvotes": 1,
      "replies": {}
    },
    "f1bkzma": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bkzma/",
      "text": "Unpopular option: I liked my teachers more in high school\n\nTeachers in college are mcuh older, and a couple of them seem like they want to get money. \n\nThe teachers in my high school were really bice. They didn’t give that much homework, and I liked talking to them during lunch.",
      "author": "RandomRedditor44",
      "created": 1569337060,
      "upvotes": 1,
      "replies": {
        "f1bldgq": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bldgq/",
          "text": "It is easier to get much closer with a teacher in highschool yes. You see them for an hour every day in a classroom of 15~30, whereas in college you have anywhere from 30~300 people and as little as 3 hours a week.\n\nIt's still possible to get close to your professors (go to office hours, be in a small class size) but it's not really pushed onto you to be close anymore.",
          "author": "9th_Planet_Pluto",
          "created": 1569337315,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1bkvmw": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bkvmw/",
      "text": "Oh my its both was easier and more fun. Im a cyber forensics major. I have minimal homework and fun assignments. Our professor made a fake crime scene and made us do a mock court case and ripped us to shreds. Ive broken into phones, computer, email servers, ect... The most work Ive ever had to do was in gen eds classes that i knew were shit. Ive never written a paper over 6 pages (in senior year). Fuck high school classes. those teachers didn't know shit about college workloads. What was the point of all those 10 page english papers and some dead poet? idk but I dont care and it didnt help me.",
      "author": "Killself98",
      "created": 1569336988,
      "upvotes": 1,
      "replies": {}
    },
    "f1bknnu": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bknnu/",
      "text": "Workload is the same. But muchhhh more time to do it. Mondays and Wednesdays I have school for less than an hour and then I have band for two hours afterwards. Even with marching band I still have plenty of free time compared to high school.",
      "author": "microfsxpilot",
      "created": 1569336843,
      "upvotes": 1,
      "replies": {}
    },
    "f1bk4th": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bk4th/",
      "text": "There can be more work, but if you are in a major you like then it shouldn't be as daunting as high school.",
      "author": "dyvrom",
      "created": 1569336494,
      "upvotes": 1,
      "replies": {}
    },
    "f1bk472": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bk472/",
      "text": "Tbh, i actually like college. This would have been much more fun if i dont have 7 am classes and i wasnt a shitty student back in hs (so i dont have to go and learn the basics that i should have learnt by now from high school). I think the biggest takeaway from college aside from the degree is how much you'll grow afterwards. I'm already feeling it tbh.",
      "author": null,
      "created": 1569336482,
      "upvotes": 1,
      "replies": {}
    },
    "f1bjk7e": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bjk7e/",
      "text": "I thought my undergrad was going to be much harder than it was.",
      "author": "Elastichedgehog",
      "created": 1569336113,
      "upvotes": 1,
      "replies": {}
    },
    "f1bj6kh": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bj6kh/",
      "text": "College was the worst time of my life and I would never go back. The constant 168 hour weeks of stress was like a full-full-time job. I couldn't do anything without anxiety over tests and assignments due. \n\nThe feeling of never being good enough and having anything I do land me in the same exact spot of not knowing over and over again. 2 hours to do one problem that ended up being wrong. At least at work even if I do nothing, I get paid.",
      "author": "buttmunchman",
      "created": 1569335858,
      "upvotes": 1,
      "replies": {}
    },
    "f1bj2xo": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bj2xo/",
      "text": "Yes, college has been easier in terms of social life. \n\nThe work I would say is more or less the same compared to my senior year of high school (I am a freshman in college this year).",
      "author": "CapaTheGreat",
      "created": 1569335790,
      "upvotes": 1,
      "replies": {}
    },
    "f1birbc": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1birbc/",
      "text": "High school is awful because everyone is immature. College is better in that aspect. People are way more mature. But college is super stressful which leads me into a pit of depression. So... can't win either way",
      "author": "Scadeau101",
      "created": 1569335571,
      "upvotes": 1,
      "replies": {}
    },
    "f1binu6": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1binu6/",
      "text": "Easier yes, more fun. No",
      "author": "kshebdhdbr",
      "created": 1569335504,
      "upvotes": 1,
      "replies": {}
    },
    "f1bimo7": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bimo7/",
      "text": "My life has been been so easy in college compared to high school.\n\nAll my profs actually care about the classes they teach and life on res is easy with my life style",
      "author": "Karsen777",
      "created": 1569335483,
      "upvotes": 1,
      "replies": {}
    },
    "f1bik6l": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bik6l/",
      "text": "High school was social hell so college has been much better in that aspect. The classes in college are miles harder though.",
      "author": "NoChannel1",
      "created": 1569335437,
      "upvotes": 3,
      "replies": {}
    },
    "f1bi767": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bi767/",
      "text": "I hated high school so I'm probably biased. But I agree I definitely have MUCH more time. I have two days of classes Wednesday and Friday 9-4 which isn't the most fun but I have full time credits and only have to drive to class 2 days.",
      "author": "NotThatGirl217",
      "created": 1569335186,
      "upvotes": 3,
      "replies": {}
    },
    "f1bi194": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bi194/",
      "text": "academically it feels like my brain is being slowly roasted over a fire everyday and every year it gets more n more burnt and more pieces r falling off\n\nother than that i enjoy the freedom ig",
      "author": "Peanut_ButterPenguin",
      "created": 1569335074,
      "upvotes": 14,
      "replies": {}
    },
    "f1bhzpz": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bhzpz/",
      "text": "high school was definitely more fun. you have responsibilities in college, in hs actions don’t have many consequences, you learn from mistakes. i’m trying to get a degree and it’s hard, but it also really depends on your major. i find science and math majors to have more coursework and less free time.",
      "author": "anaova",
      "created": 1569335045,
      "upvotes": 2,
      "replies": {
        "f1bj78y": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bj78y/",
          "text": "What high school did you attend where your actions had no consequences? Did your parents not have consequences for you either?",
          "author": "babyshark8",
          "created": 1569335872,
          "upvotes": 2,
          "replies": {
            "f1bjq40": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bjq40/",
              "text": "i skipped class and got stoned sometimes but i still had an A in my classes. if you skip class in college you will be ridiculously behind and be wasting thousands of dollars. my parents also trust me and know that punishing a teenage girl will cause her to lash out instead making sure she knows the effects of these actions as an adult. they also gave me the resources to do well in school from a young age so i eventually got mentally exhausted from the pressure of a very hard high school. being depressed in high school is easier than being depressed in college\n\nEDIT: i never answered your question; i skipped classes that didn’t take attendance and we were allowed to leave campus during free periods",
              "author": "anaova",
              "created": 1569336222,
              "upvotes": 1,
              "replies": {
                "f1bkdut": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bkdut/",
                  "text": "I hated being depressed in both and to both are hard. And isn't that a huge generalization; speaking about the punishing a teenage girl thing?",
                  "author": "babyshark8",
                  "created": 1569336664,
                  "upvotes": 1,
                  "replies": {
                    "f1bkrz5": {
                      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bkrz5/",
                      "text": "from my personal experiences and those of my friends,  grounding and taking away devices and such does not work at all for punishment. everyone ik that had strict parents that did things like that are now wild in college. they don’t know how to handle their alcohol, get too high, and end up in unsafe situations. whenever i was caught with alcohol, my parents lectured me on safe drinking strategies and never punished me. since they never punished me, when i felt unsafe or too drunk in high school i called them to pick me up and take me home. i would get another lecture on what i did wrong and what i did right. i now drink once a month tops in college and drink with water and such.",
                      "author": "anaova",
                      "created": 1569336921,
                      "upvotes": 3,
                      "replies": {
                        "f1bl2jw": {
                          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bl2jw/",
                          "text": "Imo grounding and taking away devices are normal punishments unless taken to extremes like every day, for the littlest of things like a B on a test or just really unnecessary things, that's the only time I could see that not working. As the saying goes strict parents create good liars. But I feel like there's more there parents did if they went wild in college but their punishments only consisted of grouting and taking away devices.",
                          "author": "babyshark8",
                          "created": 1569337115,
                          "upvotes": 2,
                          "replies": {
                            "f1blcww": {
                              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1blcww/",
                              "text": "ya ofc, im just summarizing, everyone’s experiences are different. i’m referring to strict parents in general who did not let their kids go out and hang out with friends much and etc. they didn’t drink or party in hs so they do a lot in college, but i am the opposite. i drank too much in hs that i dislike it now. as for grounding and devices, i guess it’s okay if the child understands WHY it was taken away, otherwise it’s pointless and they will just try not to get caught in the future",
                              "author": "anaova",
                              "created": 1569337305,
                              "upvotes": 2,
                              "replies": {
                                "f1blndq": {
                                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1blndq/",
                                  "text": "Ya that definitely sounds more like the parents who cause their child to go buck wild in college.  Also I definitely agree about understanding but also if it's valid reason. It helps no one if their phone is taken due to them being 1 minute late for curfew.",
                                  "author": "babyshark8",
                                  "created": 1569337498,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f1bhtnc": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bhtnc/",
      "text": "My parents were pretty strict growing up. So I didnt really go out in high school. So definitely, I was more social in college and had wayyyyyy moreeeeee fun.\n\nHowever, college has so much work to be done. So in terms of academics, its definitely harder.",
      "author": "illrekyam8",
      "created": 1569334926,
      "upvotes": 4,
      "replies": {}
    },
    "f1bhk7c": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bhk7c/",
      "text": "Reading these comments I guess I’m in the unpopular opinion that college is way easier for me. I think it’s an independence thing combined with the fact that I only take most of my classes twice a week instead of everyday of the week. Somehow it just works for my brain better that way.",
      "author": "SuspiciousChip8",
      "created": 1569334740,
      "upvotes": 5,
      "replies": {}
    },
    "f1bhfqq": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bhfqq/",
      "text": "College, Starting a career, learning to manage money is so much harder then Highschool. Sure you have more freedom, but much more responsibility. Regardless I hated highschool. I have way more motivation in College. The goal is to make a livable wage. I'm about to graduate and can not wait to finally make a livable wage, but even still if feels far away. I used to think that things would be easier after college, but I'm starting to think the first year out of college may be the hardest year of my life.",
      "author": null,
      "created": 1569334653,
      "upvotes": 2,
      "replies": {}
    },
    "f1bh7ma": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bh7ma/",
      "text": "I totally agree. While it isn't easier per say, I enjoy it thoroughly. It gives me that challenge I was craving for.",
      "author": "cravewing",
      "created": 1569334495,
      "upvotes": 3,
      "replies": {}
    },
    "f1bh4n2": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bh4n2/",
      "text": "Easier, no. More challenging and engaging, yes. I would never trade my college experience for a more highschool experience.",
      "author": "ayojamface",
      "created": 1569334435,
      "upvotes": 3,
      "replies": {}
    },
    "f1bh1kv": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bh1kv/",
      "text": "I mostly agree with you. I’ve made acquaintances but no real friends yet, so I cant really say I prefer the social life of college. Academically, I’m definitely having a better time. I was also in marching band in high school, and now that I’m in college with less class time and less commitments, it feels much more manageable.",
      "author": "trumpetpizza1",
      "created": 1569334376,
      "upvotes": 2,
      "replies": {}
    },
    "f1bglev": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bglev/",
      "text": "Just started university after a year of college and a break year.  \nGotta say, informationwise it's easier because I'm actually interested in what I learn.  \nSocial wise it's easier because I've gotten better with my social anxiety.  \nBut when it comes to how much I have to do now, it's harder. I have to study a lot more.  \nBut it's not that bad since most of the things I actually find interesting.  \nAnd social wise it's also in one aspect harder because I don't have my old friends with me and I suck at making new friends. But I find it easier to talk to people in general if they start the conversation so it's easier and harder? It's weird.  \nBut I like it better because there are not really the contests about popularity and stuff anymore.",
      "author": "ThatsTits_Janis",
      "created": 1569334058,
      "upvotes": 3,
      "replies": {
        "f1boiwm": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1boiwm/",
          "text": "I agree with the social stuff. It was also easy for me to get by highschool without studying at all, but now if I didn't study I'd probably be screwed.\n\nThe concept of popularity doesn't even exist anymore. Highschool class presidents and student government were purely popularity contests. College class presidents? I have no clue who any of them are",
          "author": "9th_Planet_Pluto",
          "created": 1569339396,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f1bge0r": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bge0r/",
      "text": "Class-wise, high school was easier but imo not by much. The main difference is the amount of freedom you have. High school puts you in an all-week 7-2 (maybe more) routine that you *have* to follow. College you don’t *have* to do anything, except for maybe attending classes. But most people only have classes for 15-20 hours a week, a far cry from the 30 hour slog of high school. And yes, high school classes are easier, slower and less dense, and college classes can require a lot of work outside class, but again it’s up to you if you do this work, how much of it you do, how often you do it, etc. The main difference is still freedom. \n\nWhether this freedom is a good thing or a bad thing depends on the person I think. A lot of people (me included) have been dying to have it since high school. But a lot of other people aren’t ready for it because they’re so used to the structure of high school where there’s just fewer decisions to make.",
      "author": "mysuperusername7689",
      "created": 1569333910,
      "upvotes": 8,
      "replies": {}
    },
    "f1bg7z5": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bg7z5/",
      "text": "So far the classes themselves are more difficult, but them only being twice or thrice a week really helps. That and only having class maybe 3 hours a day is super nice. Everything is just better than highschool, but not necessarily easier.",
      "author": "GeniuzGames",
      "created": 1569333792,
      "upvotes": 6,
      "replies": {}
    },
    "f1bg6ew": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bg6ew/",
      "text": "I wrote a short essay about this for an economics class that I can post later. Long story short though people have conducted studies that track the on average free time a typical college student has and the trend is college has gotten easier over time.",
      "author": null,
      "created": 1569333760,
      "upvotes": 2,
      "replies": {}
    },
    "f1bg0er": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bg0er/",
      "text": "Can definitely be easier if you had a particularly difficult high school. I think enjoying the *lifestyle* more is pretty universal, most people love the new freedom and openness",
      "author": "LordoftheNetherlands",
      "created": 1569333639,
      "upvotes": 9,
      "replies": {
        "f1gtktf": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1gtktf/",
          "text": "I absolutely HATE the lifestyle. Not knowing anyone here, not having family, having so much responsibility sucks shit imo. In high school I had a group of friends that was like a family. We would hang out EVERY day, and have massive insane sleepovers EVERY weekend. Going from that to the void that is college flung me into a crippling depression. I hate it here. I just want to go home.",
          "author": "Crusty_Gerbil",
          "created": 1569476886,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1bfnrx": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bfnrx/",
      "text": "I liked the gen ed courses in high school but in college I just cant get motivated enough to give a shit about them. It's only my first semester ever though so maybe my mood will change eventually. I also find the professors in the courses related to my major (Polisci) incredibly boring. Whereas my gen ed profs are more lively and animated.",
      "author": "Fedora200",
      "created": 1569333385,
      "upvotes": 3,
      "replies": {}
    },
    "f1bf6u9": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bf6u9/",
      "text": "Classwork is harder for sure. But now that I’m no longer living with my psycho parents things like sleeping and eating enough are no longer challenges. I even have some time left over to work out a couple times a week",
      "author": null,
      "created": 1569333044,
      "upvotes": 4,
      "replies": {}
    },
    "f1bemmv": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bemmv/",
      "text": "Yes, it's alot more fun. That is all.",
      "author": "Flairtor",
      "created": 1569332623,
      "upvotes": 1,
      "replies": {}
    },
    "f1beghd": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1beghd/",
      "text": "I guess my college career was different than most! I think it was waaaay easier for me than High School. Less homework to deal with, easier access to help from tutors/professors, professors who actually *care*, everything just seemed easier to me. \n\nSocially, agreee with everyone else, way better.",
      "author": "PraedythTheMad",
      "created": 1569332494,
      "upvotes": 382,
      "replies": {
        "f1bemfb": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bemfb/",
          "text": "I do feel immature being at college, everyone else seems stressed and what not while I'm having a good time",
          "author": "9th_Planet_Pluto",
          "created": 1569332619,
          "upvotes": 137,
          "replies": {
            "f1bkj5p": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bkj5p/",
              "text": "I always see people stressing out because of their lack of time management. It's like oh I have an essay due in 3 weeks I'll wait till the last day to do it. College is difficult but with good time management anything is possible",
              "author": "StandInShadows",
              "created": 1569336761,
              "upvotes": 81,
              "replies": {
                "f1bvt13": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bvt13/",
                  "text": "Part of it is class workload. I definitely have an issue with time management and I've started using an hourly planner so I am less stressed about getting homework done on time, but now I see that sometimes there is not enough hours in the day to get enough sleep, relax, cook your own meals, keep your apartment clean, work, satisfy your social needs, study, participate in extracurriculars, volunteer, perform your leadership roles, apply to grad schools or jobs, and do homework. It's definitely possible but can be hard and draining at times",
                  "author": "AceOfRhombus",
                  "created": 1569344090,
                  "upvotes": 51,
                  "replies": {
                    "f1d8x5f": {
                      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1d8x5f/",
                      "text": "I feel this. It just feels like there isnt enough time in the day to do everything I need to do.",
                      "author": "LordofTheNords",
                      "created": 1569376990,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f1c3cbb": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c3cbb/",
              "text": "It doesn't mean your immature, you just may have a better situation ATM and that's fine, make the most of it! For me, high school and first year or so of college was smooth sailing due to only having PT job for a few hrs for extra cash.\n\nNow however, I've moved from a CC to my state Uni, and due to my parents poor financial planning I've got to pay myself. So I have to work full-time, 5-6 days a week, have to get up around 5am to be at work by 7am. Usually work from 7am to 3pm, then get changed and clean up in my car, commute back to the school (about 30 mins one way) and have classes from around 4pm to 8pm. Back to my room around 830-9pm, quickly shower, grab a bite, clean up for the next day, watch an episode or two of Spongebob to lift my spirits, then bed around 10:00-11:00pm. Rinse, repeat. Yea, I'm extremely stressed tbh...\n\nBut because you aren't doesn't mean your doing anything wrong or that anyone is looking down on you (some may, but THEYRE the immature ones then). Try to utilize that extra free time (im assuming that you have) to put 110% effort into your work, projects, assignments, ect. Try to expand and network your social circle. Spend time doing things you enjoy, hobbies, if you like to game than game! If you like nature than go on some hikes or something. You do you man!",
              "author": "MentalLemurX",
              "created": 1569348968,
              "upvotes": 12,
              "replies": {
                "f1c4z64": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c4z64/",
                  "text": "It also doesn’t help that many people I associate with are older people too. I’ve got 21, 24, 28 year old friends while I’m just 19. They certainly don’t look down on me, but I do feel like they are superior to me. Many people seem to be working towards a career while I don’t know what I’m going to do after I graduate. College is just a buffer for now. And that’s just the mental side.\n\nPhysically, I’m skinny and not fit (working on that) and with a bright red backpack, just a tshirt and cargo pants everyday. Lots of people (even professors in 3000/4000 courses) I meet initially think I’m brand new to college",
                  "author": "9th_Planet_Pluto",
                  "created": 1569350022,
                  "upvotes": 8,
                  "replies": {
                    "f1cdn2o": {
                      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cdn2o/",
                      "text": "If you start dressing better, people will respect you more. You don’t have to dress preppy or anything but a kid wearing cargo pants every day is a less than ideal look.",
                      "author": "sjmilty",
                      "created": 1569355403,
                      "upvotes": 7,
                      "replies": {
                        "f1ce49m": {
                          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1ce49m/",
                          "text": "Yeah haha\n\nIt’s something on my list to figure out once I get some other priorities sorted\n\nI’ve been wearing cargo shorts and a shirt for the last 6-7 years, it’s hard to switch from such a comfortable/useful attire",
                          "author": "9th_Planet_Pluto",
                          "created": 1569355699,
                          "upvotes": 2,
                          "replies": {
                            "f1dvr8g": {
                              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dvr8g/",
                              "text": "Make the switch. I was surprised how quickly I adapted to being comfortable in 'nicer' clothing. It's not like you have to go full formalwear either. Pants, a tucked-in shirt (even a t-shirt) and a nice jacket will go a long way.",
                              "author": "Spikearoonie",
                              "created": 1569401971,
                              "upvotes": 1,
                              "replies": {
                                "f1jh9u6": {
                                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1jh9u6/",
                                  "text": "anywhere you suggest I can learn about dressing nicer?",
                                  "author": "9th_Planet_Pluto",
                                  "created": 1569523196,
                                  "upvotes": 2,
                                  "replies": {
                                    "f1kyqdn": {
                                      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1kyqdn/",
                                      "text": "/r/malefashionadvice is my go-to. Start by going through the basic advice guides in the sidebar.",
                                      "author": "Spikearoonie",
                                      "created": 1569542893,
                                      "upvotes": 1,
                                      "replies": {
                                        "f1kzwja": {
                                          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1kzwja/",
                                          "text": "thanks",
                                          "author": "9th_Planet_Pluto",
                                          "created": 1569543499,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "f1c3tiz": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c3tiz/",
              "text": "UCF gang. I kind of feel the same way but everyone handles stress differently. Some people get nervous/ anxious, while I seem to be more calm about stress. That doesn’t mean you’re immature. You just handle it differently than others.",
              "author": "mrnarwhal1",
              "created": 1569349279,
              "upvotes": 5,
              "replies": {}
            },
            "f1cuejk": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cuejk/",
              "text": "i mean if you're doing well in all your classes, then yay!",
              "author": "ISpeakWhaleDoYou",
              "created": 1569366128,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f1bvavp": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bvavp/",
          "text": "[deleted]",
          "author": null,
          "created": 1569343770,
          "upvotes": 9,
          "replies": {
            "f1cv8w1": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cv8w1/",
              "text": "I honestly don’t know how I woke up knowing I’d have eight hours straight of classes to go to. Even though there’s more work in the classes ive enjoyed the short scheduling",
              "author": "JohnD1451",
              "created": 1569366747,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "f1c5ni4": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c5ni4/",
          "text": "What's your major that allows less homework than high school...",
          "author": "InsaneTeemo",
          "created": 1569350453,
          "upvotes": 10,
          "replies": {
            "f1c744t": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c744t/",
              "text": "Graphic Arts lol. Did more projects than homework that were easily done in the 2.5 hour class",
              "author": "PraedythTheMad",
              "created": 1569351381,
              "upvotes": 2,
              "replies": {
                "f1c7yvq": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1c7yvq/",
                  "text": "I'm jealous honestly. CS has so much homework.",
                  "author": "InsaneTeemo",
                  "created": 1569351924,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "f1ccmh8": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1ccmh8/",
          "text": "I actually agree with you and I'm a science major. Sure, the content in college has been way for harder than high school for me but the way it's presented is so much better. \n\nMany of my college classes didn't even collect homework and only assigned problems for us to do on our time to prepare for exams. I like the freedom in my college classes to study how I want and how there's a greater emphasis on doing practice to succeed rather than just doing graded work every night. \n\nHigh school on the other hand, constantly assigned us busywork and long tedious homework every night that never gave me time to study on my own terms. I was also always worried about getting good grades on the homework even when I hadn't fully grasped the material yet.\n\n\nI also liked the easy access to tutoring and extra resources for students in my university. We have tutors and supplemental instruction for almost every subject whereas my high school only really had the occasional math tutoring.",
          "author": "jupiter78",
          "created": 1569354791,
          "upvotes": 9,
          "replies": {}
        },
        "f1cud0i": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1cud0i/",
          "text": "same for me.",
          "author": "ISpeakWhaleDoYou",
          "created": 1569366097,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f1be2i9": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1be2i9/",
      "text": "It’s 10x harder and more fun",
      "author": "pastelxbones",
      "created": 1569332200,
      "upvotes": 1,
      "replies": {}
    },
    "f1be0fd": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1be0fd/",
      "text": "I went to a really hard high school so college is easier compared to that hell hole. \n\nMore fun? Should be but still find my place. I was pretty free to do whatever in high school. I will say however that im loving not having 7 hour days",
      "author": "wtfyuh",
      "created": 1569332157,
      "upvotes": 28,
      "replies": {
        "f1be4f7": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1be4f7/",
          "text": "hell yeah on the time part\n\n7 hours a day + 15 hours a week extra for band, I didn't have much time in highschool\n\nNow it's 15 hours a week for school, and maybe 5 hours commuting. Literally half (even a third) of the time I was in highschool, even though I have a part time job now",
          "author": "9th_Planet_Pluto",
          "created": 1569332241,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "f1bdv5a": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bdv5a/",
      "text": "I don't think the content is necessarily harder, covering the class in a semester vs a full school year is the tough part\n\nI also did marching/jazz band in HS, and while waking up at 6am wasn't fun, at least it was consistent. Maybe I just have bad sleep habits, but it is so much harder to wake up for college than highschool",
      "author": null,
      "created": 1569332044,
      "upvotes": 6,
      "replies": {}
    },
    "f1bdi9y": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bdi9y/",
      "text": "It’s weird, I don’t think the classes themselves are harder (I actually have had more high school classes I really really struggled with than college) but I feel way busier in college for some reason.",
      "author": null,
      "created": 1569331768,
      "upvotes": 13,
      "replies": {}
    },
    "f1bdazm": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bdazm/",
      "text": "Socially it’s been so much better. Academically it’s been a nightmare. I feel like I’ve tripped... off a cliff... while on fire... with no water in sight",
      "author": "pae913",
      "created": 1569331613,
      "upvotes": 99,
      "replies": {
        "f1be6b2": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1be6b2/",
          "text": "I've found that college is much worse than high school socially. I used to be the most popular guy in the school, but here I can't get anyone to give me the time of day. In high school people would just come up to you and talk to you voluntarily, but in college you can try your hardest to reach out to people and get nothing out of it.",
          "author": "awesomega14",
          "created": 1569332281,
          "upvotes": 62,
          "replies": {
            "f1bj71q": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bj71q/",
              "text": "I’m going through that right now it feels like everyone doesn’t want to talk and wants to be left alone",
              "author": "sieffy",
              "created": 1569335868,
              "upvotes": 38,
              "replies": {}
            },
            "f1bl0sz": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bl0sz/",
              "text": "Feeling that too. I had genuine friends in high school who I still talk to all the time but so far in college, I've only talked to one person",
              "author": "microfsxpilot",
              "created": 1569337082,
              "upvotes": 13,
              "replies": {
                "f1dp2vy": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dp2vy/",
                  "text": "you gotta try to talk to people",
                  "author": "lanster77",
                  "created": 1569392825,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "f1bqnqy": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bqnqy/",
              "text": "Literally have the complete opposite experience",
              "author": "WaifSux",
              "created": 1569340780,
              "upvotes": 24,
              "replies": {
                "f1brnou": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1brnou/",
                  "text": "Me too. In highschool I had no friends and no one ever wanted to talk. Here people will just sit at my table at lunch and start talking to me daily and I've made a nice little friend group.",
                  "author": "Cauliflowwer",
                  "created": 1569341435,
                  "upvotes": 17,
                  "replies": {
                    "f1dhsnh": {
                      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dhsnh/",
                      "text": "God I fucking wish that was me",
                      "author": "11trobo",
                      "created": 1569384585,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                },
                "f1dp1lw": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1dp1lw/",
                  "text": "Same here, in fact I often talk about how cool it is you can strike up a conversation with anyone and possibly make a friend",
                  "author": "lanster77",
                  "created": 1569392780,
                  "upvotes": 1,
                  "replies": {}
                },
                "f1bw8y2": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bw8y2/",
                  "text": "Same, especially when you're at a party and everyone has been drinking...I've made some good friends through meeting them at another friends party. People are super friendly",
                  "author": "AceOfRhombus",
                  "created": 1569344372,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "f1bjlr6": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bjlr6/",
          "text": "Funnily enough, my experience was the other way around.",
          "author": "Elastichedgehog",
          "created": 1569336142,
          "upvotes": 11,
          "replies": {}
        },
        "f1bwi14": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bwi14/",
          "text": "I don't find the workload too overwhelming. The problem is now you have to act like an adult and perform tasks like working a job, cleaning the house, shopping, and cooking your own food on top of your studying and schoolwork. It can get overwhelming when you also factor in relaxing, time with friends, applying to grad school, etc. All those factors make me feel like I am drowning sometimes",
          "author": "AceOfRhombus",
          "created": 1569344532,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "f1bd66c": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bd66c/",
      "text": "It’s a lot nicer in some ways but also much tougher for me. My friends here are closer and more real and just generally better people, and I can pursue what I want, but there’s the stress of studying and assignments and stuff. \n\nIt was worse my first two semesters because back then I had Chemistry and I barely scraped by, now I’m in courses I actually enjoy and have that behemoth out of the way.",
      "author": "bekrueger",
      "created": 1569331509,
      "upvotes": 7,
      "replies": {}
    },
    "f1bcya7": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bcya7/",
      "text": "The workload isn’t any easier. Some classes I take are easier than the AP classes I took in high school, it’s just there is always so much to do. I’m just glad I get to pick most of the classes I want to take, not ones I have to take like in high school. \n\nWhen it comes to being social, I think college is more fun. I’ve met a lot more genuine people in college than I did in high school and I moved out of my small town to a large college town so there’s a lot more to do with a lot more people to meet.",
      "author": "Alexia_Hope",
      "created": 1569331337,
      "upvotes": 340,
      "replies": {
        "f1bd5mi": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bd5mi/",
          "text": "I've also been meeting more genuine people and interesting people I want to associate with in college. In highschool you're stuck with the same hundred people for four years, but college there's thousands of new people you can try meeting.\n\nFreshman year was lonely since I never talked to anyone, and thus, noone cared about you. But after I started talking to more people in class and making acquaintances it's been pretty good.",
          "author": "9th_Planet_Pluto",
          "created": 1569331498,
          "upvotes": 90,
          "replies": {
            "f1bdfqn": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bdfqn/",
              "text": "Freshman year was lonely for me too! Sophomore year is when I started making friends, but it was outside of school. \n\nI still have a hard time talking to people in class. I’m finally starting to move out of my pre reqs into classes with people of similar majors so it’s getting easier to start conversations. I just can’t keep them going haha.",
              "author": "Alexia_Hope",
              "created": 1569331714,
              "upvotes": 37,
              "replies": {
                "f1bdz3p": {
                  "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bdz3p/",
                  "text": "I had problems with dying conversations before, but it helped me to ask what kinda hobbies they have and be genuinely interested in what they do in said activities. Or what career they hope to go into. People love talking about themselves, and I get to talk about myself too sometimes.",
                  "author": "9th_Planet_Pluto",
                  "created": 1569332129,
                  "upvotes": 29,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f1bcplg": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bcplg/",
      "text": "It’s really a give and take. \n\nYou have more in-depth classes. A lot more responsibility on you. \n\nFor the other side, I really enjoy the freedom and being away from family. You’re truly on your own. Your own time. Your own life.",
      "author": "Moyota",
      "created": 1569331142,
      "upvotes": 23,
      "replies": {}
    },
    "f1bcpjv": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bcpjv/",
      "text": "Kinda fluctuated for me. Easy and fun first year with gen eds. End of sophomore/beginning of jr year were rough academically, but the last year and a half were fun again because I was taking upper level classes in an area I was interested in and understood well.",
      "author": "Jean-Ralphio_S",
      "created": 1569331141,
      "upvotes": 7,
      "replies": {}
    },
    "f1bbjv0": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bbjv0/",
      "text": "I find it easier, but I've taken college level courses before and it's a field that I like so I'm more motivated in college.",
      "author": "arlomilano",
      "created": 1569330185,
      "upvotes": 19,
      "replies": {}
    },
    "f1bavuz": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bavuz/",
      "text": "Tbh I enjoyed high school more \n\nCollege starts to get serious, as in doing stuff for your career and classes are infinite times harder\n\nGoofing around in high school were the best times man, now I can’t do that in class anymore because I’ve grown up",
      "author": "gotatriplebeamscale",
      "created": 1569329626,
      "upvotes": 138,
      "replies": {
        "f1be3vm": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1be3vm/",
          "text": "Also with your paying for it, if I failed in high school it was who cares but if I fail in college then all my loans are uselsss",
          "author": "AmberBake1025",
          "created": 1569332230,
          "upvotes": 52,
          "replies": {}
        },
        "f1bobng": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bobng/",
          "text": "Eh, for a lot of people (including me), high school wasn't that great for us socially, so I can see where OP is coming from.",
          "author": "TrekkiMonstr",
          "created": 1569339263,
          "upvotes": 18,
          "replies": {}
        },
        "f1bl1g9": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bl1g9/",
          "text": "Agreed. I hated that I had to get up early for school, but my teachers were much nicer in high school.",
          "author": "RandomRedditor44",
          "created": 1569337094,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "f1baoe4": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1baoe4/",
      "text": "I’d say 1st semester of Gen Ed’s was easy(I had brought some HS credits in), but after that it gotta difficult real quick",
      "author": "UnironicSportsFan",
      "created": 1569329445,
      "upvotes": 87,
      "replies": {
        "f1bcued": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bcued/",
          "text": "I found gen eds to be hard. Some of them were really easy, but some (hard sciences for me, since I'm a soft science) took so many hours of extra studying because I just couldn't bring myself to care about biology or advanced math that I would never touch once I finish the course\n\nMy major classes have been really fun, reading the textbook is genuinely interesting, theories I learn relate to real life and ongoing news, and I'm learning about stuff I care which means I'm likely to remember them easier",
          "author": "9th_Planet_Pluto",
          "created": 1569331251,
          "upvotes": 45,
          "replies": {
            "f1bw2kn": {
              "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1bw2kn/",
              "text": "As a biochem major, my gen eds were definitely easier. Compare an intro to bio class to a biochem II class or an algebra class to a calc II class...it's a lot harder. Some of my classes such as microbiology are more interesting and therefore easier as I care about the subject more, but give me English 1000 over physical biochemistry any day\n\nEdit: to be fair I skipped some of my gen eds because I had AP credit, but I still had to take some gen eds outside my major",
              "author": "AceOfRhombus",
              "created": 1569344259,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "f1b9sqr": {
      "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1b9sqr/",
      "text": "Definitely not easier",
      "author": "AcrillixOfficial",
      "created": 1569328675,
      "upvotes": 147,
      "replies": {
        "f1ba4gs": {
          "link": "/r/college/comments/d8lc56/has_college_been_easiermore_fun_than_highschool/f1ba4gs/",
          "text": "yes",
          "author": "skatexdaze",
          "created": 1569328960,
          "upvotes": 17,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054559
}