{
  "sid": "quiys7",
  "link": "/r/college/comments/quiys7/do_you_think_that_a_course_syllabus_is_crucial/",
  "title:": "Do you think that a course syllabus is crucial for you to know what you should expect from a course?",
  "text": "At my uni, course syllabus is always only out a few days before the semester starts, when the course enrollment period have already passed. I don't know what I can expect with just reading a few sentences of the course descriptions. Some people say you can ask the teacher for the syllabus for the previous year but I just don't think it's realistic. Why can't they just upload it earlier?",
  "author": "Lost7799",
  "created": 1636990215,
  "updated": 1637181502,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hkqa03q": {
      "link": "/r/college/comments/quiys7/do_you_think_that_a_course_syllabus_is_crucial/hkqa03q/",
      "text": "Yes. More so because it shows the teacher’s attendance and participation policy, and the weight of the assignments. All of which may or may not affect your grade.\n\nAlso, they may give you estimated dates of when exams will be so you can plan when to start studying for them once that date is near. At least that’s what I do.",
      "author": "kizeltine",
      "created": 1636990587,
      "upvotes": 4,
      "replies": {
        "hkqakkx": {
          "link": "/r/college/comments/quiys7/do_you_think_that_a_course_syllabus_is_crucial/hkqakkx/",
          "text": "That's right. The dates and assignments are also important factors to consider when choosing courses. Sometimes you have to be realistic.",
          "author": "Lost7799",
          "created": 1636990829,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hkqce6m": {
      "link": "/r/college/comments/quiys7/do_you_think_that_a_course_syllabus_is_crucial/hkqce6m/",
      "text": "Often working on my syllabus until a few days before class starts. You CAN always email and ask if they'd be willing to share a copy of a previous syllabus - sending that email is not difficult and should not be onerous. Why don't you think that is a realistic option? Have you ever tried it? Don't forget, as well, that we don't get paid over the summer, so most of us use the summer to focus on our research or other projects.",
      "author": "Galactica13x",
      "created": 1636991588,
      "upvotes": 3,
      "replies": {
        "hkqspzz": {
          "link": "/r/college/comments/quiys7/do_you_think_that_a_course_syllabus_is_crucial/hkqspzz/",
          "text": "Why I mean by unrealistic is that I'd of course want to know what every course is \"really\" about. So should I just spam?\n\nOf course I'm not asking to have it, for example, in the middle of the summer. But couldn't it be available, at least, before the course enrollment period ends? \n\nIn addition, I understand that there're cases like a teacher is teaching the course for the first time, so they would need time to prepare for it. But apparently, often, they have already been teaching the same thing for years. \n\nIn addition, while you don't get paid in the summer, we are paying for something that we've no idea of. I'm not judging or what, but I just thought that it's not supposed to be a difficult thing. If we could know what to expect and prepare for, that would really make a difference.",
          "author": "Lost7799",
          "created": 1636998146,
          "upvotes": 1,
          "replies": {
            "hkrrbty": {
              "link": "/r/college/comments/quiys7/do_you_think_that_a_course_syllabus_is_crucial/hkrrbty/",
              "text": "And what I'm saying is that it is ok to email about a week before the semester and ask for the syllabus. And if you want to know more prior to that, it's ok to email and ask for a syllabus from a prior semester.",
              "author": "Galactica13x",
              "created": 1637011759,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkqn721": {
      "link": "/r/college/comments/quiys7/do_you_think_that_a_course_syllabus_is_crucial/hkqn721/",
      "text": "\"Did you read the syllabus\" the fuck is that prof?",
      "author": "NotStaggy",
      "created": 1636995955,
      "upvotes": 1,
      "replies": {}
    }
  }
}