{
  "sid": "qgonbf",
  "link": "/r/college/comments/qgonbf/going_to_fail_a_class_because_of_my_tardiness/",
  "title:": "Going to fail a class because of my tardiness",
  "text": "It’s my first semester at college and it’s horrible. It’s in the middle of nowhere so I can’t take a train to get there. Only way is by car. And I didn’t have a car at the beggining of the year. I either had to take a Lyft (which was very very expensive) or make my brother drop me off for the first two months. And I know this is no excuse but no matter how early I woke up my brother or traffic would always make us late. And I ended up coming to my first period class late. Soemtimes it was only by 1-2 min and soentimes it was 10 min. But I didn’t think anything of it because when she reviewed the syllabus, she never mentioned anything about tardiness counting as an absence. But recently I found out that basically for every two latenesses she counts it as one absence. And the first two unexcused absences were let off the hook and the others would each count as 4 points off the final grade. But I didn’t know of it. So I, right now, have a total of 6 absences which really equal to four unexcused absences so that means I will have 16 points taken off my final grade. And I have a 76% in her class right now. I actually had a 82% but since I got a 75% on my quiz and didn’t turn in one hw assignment, it dropped 5 points. And I need at least a 70 to pass this class. So the 76% with the 16 points off will result in me failing. So is there really a need for me to keep trying in this class. When I’m going to fail anyway. There’s no way I can bring my grade up over 10% in less than 2 months. Would it be better to just drop the class if possible? My gpa is ganna be crap because of this class.",
  "author": "Tina-snow",
  "created": 1635309579,
  "updated": 1635457107,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hi7kz9f": {
      "link": "/r/college/comments/qgonbf/going_to_fail_a_class_because_of_my_tardiness/hi7kz9f/",
      "text": "Also once I came in at exactly 9 ( the time class starts) but it was a few seconds past it and she still marked me as late. And another time I was at the hospital and our class was online for a day. So I decided to join in and not miss class while I was at the hospital. But I joined late because I had tit ale my BP taken. And she counted that as late even though I explained my situation. (I should’ve just not joined, that way I could’ve showed her a doctors note and had it count as an excused absence smh)",
      "author": "Tina-snow",
      "created": 1635309713,
      "upvotes": 0,
      "replies": {}
    }
  }
}