{
  "sid": "qdyckq",
  "link": "/r/college/comments/qdyckq/sad_about_having_to_transfer_to_different/",
  "title:": "Sad about having to transfer to different University (Anybody went through similar situation?)",
  "text": "I initally started in CC and transferred to a public university's B.A visual arts program in hopes of eventually getting into their BFA program that has a specific focus on graphic/visual design.\n\nAfter a long battle of submitting my portfolio on mutiple occasions and finally getting a response I was told there wasn't any room. \n\nOf course there's the option of just finishing  with the visual arts major but it would be a waste of time because the curriculum is more art history based.\n\nSo I'm applying to other universities but it just sucks because I had a whole plan that I have to rearrange (makes me feel alittle lost). The campus and location was starting to grow on me too. \n\nI did learn a lesson on not putting all my eggs in one basket. I'm also aware that where I went to school won't matter in the long-run of my career. It just sucks when something you had planned doesn't work out.\n\nAn upside is the universities I'm looking into are more open to granting transfer scholarships-so yay to less debt! Lol",
  "author": "PomegranateNo6321",
  "created": 1634965699,
  "updated": 1635184628,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hhqv4g4": {
      "link": "/r/college/comments/qdyckq/sad_about_having_to_transfer_to_different/hhqv4g4/",
      "text": "It is frustrating that things haven't worked out the way you hoped. I admire your persistence. That will continue to help you in the future. There may not be one perfect college. I hope you can find things you love just as much, if not more, at your new school.",
      "author": "fawkes_fiesta",
      "created": 1635000175,
      "upvotes": 2,
      "replies": {
        "hhqy4do": {
          "link": "/r/college/comments/qdyckq/sad_about_having_to_transfer_to_different/hhqy4do/",
          "text": "Thanks so much for taking time out to share your kind words! 💕 \n\nWhen I'm deep in my head it feels like the end of the world. I have to remind myself that college life is rarely a linear path and it can to teach us to adapt.",
          "author": "PomegranateNo6321",
          "created": 1635002174,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhroxsn": {
      "link": "/r/college/comments/qdyckq/sad_about_having_to_transfer_to_different/hhroxsn/",
      "text": "It depends on how close you to finishing your degree. If you are close to graduation, it's best to finish your degree. If you transfer, you will likely lose college credits.",
      "author": "Flashmode1",
      "created": 1635014594,
      "upvotes": 1,
      "replies": {}
    }
  }
}