{
  "sid": "q9kpzy",
  "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/",
  "title:": "how do I use peer review articles?",
  "text": "Was told it's important to use these and not rely on books why is that? I have learnt how to find the evidence in the book and quote and cite. Do you do the same for peer review articles? How do you use these in an assignment?",
  "author": "BlackBerry0123",
  "created": 1634418726,
  "updated": 1634584167,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgwn1ts": {
      "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwn1ts/",
      "text": "you would cite how you would normally just cite depending on the format. apa format is pretty common within peer review articles. it’s better to paraphrase the evidence in your own words you plan on to use in an assignment to show your knowledge of the material.",
      "author": "stressinglucy",
      "created": 1634418975,
      "upvotes": 1,
      "replies": {
        "hgwosto": {
          "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwosto/",
          "text": "Thanks for this, helps hugely! On the last point, Is it better to paraphrase for both book and peer review or both is equally important? I still am struggling to understand why it is important to use the peer review though and not just book",
          "author": "BlackBerry0123",
          "created": 1634419754,
          "upvotes": 1,
          "replies": {
            "hgwp0w0": {
              "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwp0w0/",
              "text": "u can just paraphrase certain sentences that u wanna use as evidence.\n\nfor ex:\n\nPrivacy is an issue affecting everyone in the United States because of (x,y,&z) and it has yet to be resolved by our federal government (No author, n.d.).",
              "author": "stressinglucy",
              "created": 1634419856,
              "upvotes": 1,
              "replies": {
                "hgwpnvi": {
                  "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwpnvi/",
                  "text": "Got it so tell me if im wrong but it's kind of about what is most convenient to use in a way? And best to have a mix of both to show you've read different sources?",
                  "author": "BlackBerry0123",
                  "created": 1634420146,
                  "upvotes": 1,
                  "replies": {
                    "hgwpxbt": {
                      "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwpxbt/",
                      "text": "peer review is really just an example of scholarly work since they go through the most intense review process to be in journals and they also have a lot of  citations and references that’s why these are important",
                      "author": "stressinglucy",
                      "created": 1634420265,
                      "upvotes": 1,
                      "replies": {
                        "hgwqc8j": {
                          "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwqc8j/",
                          "text": "That makes sense, thanks for helping me. I won't take too much of your time, but say if your writing on a topic you can look at a peer review article technically find their references and cite from them as well? Does that not make it too simple this way? Is this cheating?",
                          "author": "BlackBerry0123",
                          "created": 1634420455,
                          "upvotes": 1,
                          "replies": {
                            "hgwqrkr": {
                              "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwqrkr/",
                              "text": "you can do that. ex: (No author et al., as cited in No author). that way you can cite their references while paraphrasing and your citing them as well since you’re still paraphrasing from their ideas. i would say it’s cheating if you just weren’t citing your references ofc but if u look up one of their references and find something that isn’t mentioned in the same peer reviewed journal, that would be fine and wouldn’t be considered cheating as long as u cite.",
                              "author": "stressinglucy",
                              "created": 1634420648,
                              "upvotes": 1,
                              "replies": {
                                "hgwrr9n": {
                                  "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwrr9n/",
                                  "text": "This helps me so much you've no idea! I was so confused about peer review now it makes a lot more sense thanks so much. So I suppose when you get used to citing and referencing works and paraphrasing college assignments aren't so difficult? Say if you have thoughts in your mind after reading a few pages you can't write this without referencing where the thoughts came from? So everything has to be traceable?",
                                  "author": "BlackBerry0123",
                                  "created": 1634421097,
                                  "upvotes": 1,
                                  "replies": {
                                    "hgwrvdf": {
                                      "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwrvdf/",
                                      "text": "if the evidence or idea is not your own common knowledge then u have to cite it",
                                      "author": "stressinglucy",
                                      "created": 1634421148,
                                      "upvotes": 1,
                                      "replies": {
                                        "hgwsdb3": {
                                          "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwsdb3/",
                                          "text": "Got it, I think it's the while plagiarism thing that scares me with academics",
                                          "author": "BlackBerry0123",
                                          "created": 1634421374,
                                          "upvotes": 1,
                                          "replies": {
                                            "hgwsgcp": {
                                              "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwsgcp/",
                                              "text": "trust me it scares me too but it’s better safe than sorry",
                                              "author": "stressinglucy",
                                              "created": 1634421413,
                                              "upvotes": 1,
                                              "replies": {
                                                "hgwstvc": {
                                                  "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwstvc/",
                                                  "text": "Definitely better to have a ton of citation and told that's too much than get penalized",
                                                  "author": "BlackBerry0123",
                                                  "created": 1634421586,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgwrcpl": {
      "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwrcpl/",
      "text": "I think most just assume it is more difficult to determine whether or not a book is academic/scholarly and easier to confirm articles. I would suggest the site [owl.purdue.edu](https://owl.purdue.edu) to help you with citations for periodicals.",
      "author": "seagreengoddess",
      "created": 1634420915,
      "upvotes": 1,
      "replies": {}
    },
    "hgwwma3": {
      "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgwwma3/",
      "text": "I have a video on how to read journal articles: https://youtu.be/BKYwmCniFtI\n\nThere is also a resource on how to breakdown the article to find things that you need and want to focus on. It is in the comments section of the video. \n\nOwl Purdue as mentioned by others is a good resource to understand how to cite sources including articles. If you want more help you can always go online to your university’s library website and find a librarian to assist you with citations.",
      "author": "irisy211",
      "created": 1634423311,
      "upvotes": 1,
      "replies": {}
    },
    "hgz21y8": {
      "link": "/r/college/comments/q9kpzy/how_do_i_use_peer_review_articles/hgz21y8/",
      "text": "Go to your librarian.  In your library.  They do this for a living.\n\nThere are undoubtedly site that have this information that they can direct you to, for one thing and they can show you how to use the databases.",
      "author": "PersephoneIsNotHome",
      "created": 1634470442,
      "upvotes": 1,
      "replies": {}
    }
  }
}