{
  "sid": "qg93t1",
  "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/",
  "title:": "6 days a week of classes...struggling. How do I get over the burnout of...everything?",
  "text": "Everything's all in the title. I have classes six days a week, Monday thru Saturday, and some days I'm out all day from 7 am to 10pm and all of my time inbetween is used for catching up on work.\n\nThis is *hard*. Really fucking hard. I sometimes spend 5-7 hours working outside of class at once, and everybody around me is telling me I'm pushing myself way too fucking hard but if I slow down I'll fall behind. I have no choice.\n\nI've already hit my limits in more ways than one. Stress has made it hard to eat, and my immune system crashed recently which led to me getting sick (and falling behind, which made the stress worse). On top of class commitments and academic responsibilities, I've had to abandon almost every club I've attempted to join, I feel disconnected with the rest of the people in my major, and I rarely hang out with my friends on my dorm floor—I'm just too *tired,* and in turn my stress compounds even further because I feel like I'm doing the whole \"college experience\" wrong. I'm supposed to be meeting new people, making friends and trying new things, but all of the excitement I had and things I wanted to try when I first got here have since been absolutely crushed. My only day off is Sunday (which, hilariously enough, I still do have an obligation on. I haven't attended in 3 weeks and it's going to bite me in the ass.) and I don't actually get to have any free time because I'm inevitably so exhausted I wind up sleeping for 12+ hours.\n\nI'm a freshman. This is my first semester. I knew my major would be rigorous going in, but holy shit. Not only that, but the workload only gets crazier from here, and thinking about it just makes me...deflate. I can't do anything else—I love this, I really do, I can't imagine myself in any other program. But every day it's slowly gotten harder and harder to get out of bed, keep contact with my family, talk to my friends...I can't keep doing this much longer. I don't know how to deal with it.\n\nIs there anything I can do? At all? Or am I completely fucked?",
  "author": "tempaccount77746",
  "created": 1635262652,
  "updated": 1635302512,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hi4l788": {
      "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi4l788/",
      "text": "When I first got in college our counselor said something very powerful. \"Is always best to take one or two estra semesters and graduate with your mental and physical health intact than finish on schedule and sacrifice yourself on the way\". Talk with yours, see if there's classes you are taking that you can drop. This is definitely not how freshman year is supposed to feel like",
      "author": "CollegeGalStuff",
      "created": 1635263311,
      "upvotes": 3,
      "replies": {
        "hi4lnjr": {
          "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi4lnjr/",
          "text": "I've already met with my advisor, and I've heard that this is basically one of the first years that they've completely redone the program + it's post COVID...so it's certainly interesting.\n\nUnfortunately, dropping classes isn't really an option. My schedule is so packed in later years that there aren't really viable spots to make them up—it's a very rigid schedule of \"you should be doing this at \\[x\\] point\". And I can't really afford to be here longer than 4 years...it's way too expensive and I'm tied to all sorts of scholarships. I really need to be as close to on schedule as possible.",
          "author": "tempaccount77746",
          "created": 1635263491,
          "upvotes": 1,
          "replies": {
            "hi4ma00": {
              "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi4ma00/",
              "text": "In that case, I can suggest time blocking your whole week, down to the minute, so that you can schedule \"down time\". Down time can mean different things for different people, i could never just stop and do nothing, I feel anxious, but when my down time is scheduled I don't feel guilty. If you need help with time blocking I can help you! I've been doing it for years",
              "author": "CollegeGalStuff",
              "created": 1635263740,
              "upvotes": 1,
              "replies": {
                "hi4nke7": {
                  "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi4nke7/",
                  "text": "Might have to try doing that again. I did it before but my time management can get notoriously poor so it would often get shoved aside in favor of sleeping/getting dragged out by friends/just me flat out getting stressed at having every single minute planned out. Don't have many other options though, I'll see if I can give it a go.",
                  "author": "tempaccount77746",
                  "created": 1635264259,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi4lb2l": {
      "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi4lb2l/",
      "text": "Do you have the option of setting your own class schedule? We do in most Canadian Universities and it’s the only way to make your class schedule work. If so, can you hold out for next semester, making sure to change your class schedule?",
      "author": "Weyman16",
      "created": 1635263354,
      "upvotes": 1,
      "replies": {
        "hi4m18q": {
          "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi4m18q/",
          "text": "Next semester, yeah, I can hopefully land a normal 5 day class week (maybe even 4, if I'm lucky). I'm banking on that at this point, but god it still feels like so many weeks away.",
          "author": "tempaccount77746",
          "created": 1635263643,
          "upvotes": 2,
          "replies": {
            "hi4mpdw": {
              "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi4mpdw/",
              "text": "I hear you. I had that experience in my first semester (I’m old now, 40, and this was in 2000, so quite some time ago), and didn’t think I would make it. Might be worth creating a schedule which bakes in “free time” and I know you don’t have much, but if you plot out your time and ensure time for social interaction, you might just find other students with the same stresses and end up forging a bond to get you both through this first semester.",
              "author": "Weyman16",
              "created": 1635263910,
              "upvotes": 1,
              "replies": {
                "hi4nz4q": {
                  "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi4nz4q/",
                  "text": "Think I'm gonna try doing this—I don't really have many other options, it seems. Hopefully it'll work.",
                  "author": "tempaccount77746",
                  "created": 1635264424,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi52jmp": {
      "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi52jmp/",
      "text": "Adderall legit like saved my sanity. you won’t catch me without my adderall.\n\nDONT WANNA GET OUT OF BED? TAKE AN ADDERALL YOU WILL SOON AND YOU WILL WANT TO CLEAN YOUR WHOLE HOUSE",
      "author": "antichristsuperstars",
      "created": 1635270142,
      "upvotes": 1,
      "replies": {}
    },
    "hi60r4h": {
      "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi60r4h/",
      "text": "How many credits are you taking? The general rule of thumb is that for every credit you take it should be 2 to 3 hours outside of class. So a three credit hour class should have 6 to 9 hours of homework a week plus the 3 hours of class time. So even if you're at 18 credits you should hopefully be maxing out around 70 hours a week for school which is definitely a lot but not as bad as you're describing. Are your professors giving too much homework or are you still trying to do every single reading assignment before class and how many hours do you spend studying for a test? Are you at least getting the grades to show for all this work or are the results disproportionate to your effort?",
      "author": "Thelton26",
      "created": 1635283477,
      "upvotes": 1,
      "replies": {}
    },
    "hi4kjw3": {
      "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi4kjw3/",
      "text": "[removed]",
      "author": null,
      "created": 1635263052,
      "upvotes": 0,
      "replies": {
        "hi4kyif": {
          "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi4kyif/",
          "text": "its hysterical how many people have said this to me",
          "author": "tempaccount77746",
          "created": 1635263215,
          "upvotes": 2,
          "replies": {
            "hi522ih": {
              "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi522ih/",
              "text": "It’s true. Adderall keeps you awake and focused. Just make sure you eat. It’s a nightmare having a screwed up appetite on adderall (sometimes you need weed at the end of the day). You can find interest in things you find boring. Things you’re interested in are even more intriguing. Hell, you’re just fucking happy too because of that euphoria. \n\nAdderall is the goat. Even if you take it occasionally, it’s fucking great.",
              "author": "antichristsuperstars",
              "created": 1635269955,
              "upvotes": 1,
              "replies": {}
            },
            "hi5277q": {
              "link": "/r/college/comments/qg93t1/6_days_a_week_of_classesstruggling_how_do_i_get/hi5277q/",
              "text": "Make sure you channel your focus into productive things. That’s the main thing.",
              "author": "antichristsuperstars",
              "created": 1635270007,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}