{
  "sid": "qcmzbo",
  "link": "/r/college/comments/qcmzbo/any_tips_for_succeeding_in_bio_bsc_2020_4_credit/",
  "title:": "any tips for succeeding in bio? (bsc 2020 - 4 credit)",
  "text": "so next semester I’ll be taking a 4 credit general biology course. my advisor mentioned that the course has a 40% fail rate, and I want to know what I can do to better my chances at succeeding in that class. study tips, external resources, anything will be beyond appreciated. \n\nalso! how helpful was crash course in your personal experience? (assuming you used it ofc)",
  "author": "minervaonmars",
  "created": 1634804112,
  "updated": 1636176342,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhh26s9": {
      "link": "/r/college/comments/qcmzbo/any_tips_for_succeeding_in_bio_bsc_2020_4_credit/hhh26s9/",
      "text": "Crash course is pretty awful in my opinion for certain courses. It’s not too detailed and just gives a brief overview. It’s fine if it’s the first thing to watch, but do not use it as the primary source of studying. \n\nThe problem with bio is that it’s a weed out course. It’s a lot of memorization and can be application heavy. Not every question is going to be the mitochondria is the power house of the cell. My tip if you are worried is to start studying earlier. Use something like Khan Academy for example. Look up the syllabus for the course and go through those chapter topics during your winter break. You are going to get a feel for what’s important to learn. Biology doesn’t change much in terms of information you find online. A great skill to have is to be able to pick up what all these online instructors are stressing. I guaranteed a large portion of exam questions come from those topics.\n\nIf you go in semi prepared, you will just be reviewing the first few weeks. Everyone is stressing for the first exam while you are already looking at material for the 2nd and 3rd. You don’t have to worry about dropping your lowest grade and can save it.",
      "author": "kyeelee",
      "created": 1634810723,
      "upvotes": 2,
      "replies": {
        "hhhqltv": {
          "link": "/r/college/comments/qcmzbo/any_tips_for_succeeding_in_bio_bsc_2020_4_credit/hhhqltv/",
          "text": "okay, got it. this was really helpful btw, thank you so much :)",
          "author": "minervaonmars",
          "created": 1634825403,
          "upvotes": 2,
          "replies": {
            "hhhtovp": {
              "link": "/r/college/comments/qcmzbo/any_tips_for_succeeding_in_bio_bsc_2020_4_credit/hhhtovp/",
              "text": "Np good luck! My biology professor told use she failed 30% of the previous class (150+ person lecture) the first day so its not unusual.",
              "author": "kyeelee",
              "created": 1634826766,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhl7z6u": {
      "link": "/r/college/comments/qcmzbo/any_tips_for_succeeding_in_bio_bsc_2020_4_credit/hhl7z6u/",
      "text": "Study up. It’ll help if you’re interested in what you’re learning. I never use any materials outside of the class because the profs will only out material on exams assignments and quizzes that you could answer given the material presented within the courses",
      "author": "sgRNACas9",
      "created": 1634883020,
      "upvotes": 1,
      "replies": {}
    }
  }
}