{
  "sid": "quakym",
  "link": "/r/college/comments/quakym/im_at_my_breaking_point/",
  "title:": "I’m at my breaking point.",
  "text": "I failed another fucking test despite studying and having the notes for it right next to me. I literally don’t know how. \n\nIt’s feels like I was born to struggle and be miserable. Every time I try to make progress towards my goals in life, something is always there to kick me back. I’m just so tired and wish it would end.",
  "author": "Montelukast_10mg",
  "created": 1636959958,
  "updated": 1637181543,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hkp523o": {
      "link": "/r/college/comments/quakym/im_at_my_breaking_point/hkp523o/",
      "text": "Might wanna sit down with a professor or someone from accomodations to see what the problem is. Are you not studying the material? Unable to process it? Make small reading errors on the exam? Things like that. It shard to imagine with study and notes someone can fail (and hard fail)",
      "author": "safespace999",
      "created": 1636964317,
      "upvotes": 4,
      "replies": {
        "hkp5qo4": {
          "link": "/r/college/comments/quakym/im_at_my_breaking_point/hkp5qo4/",
          "text": "I agree. It’s one thing to fail an exam, it’s another to know why you failed. I would also recommend sitting down with your professor and going through the exam together.",
          "author": "vessva11",
          "created": 1636964867,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkp3jad": {
      "link": "/r/college/comments/quakym/im_at_my_breaking_point/hkp3jad/",
      "text": "We all mess up sometimes, not everyone is perfect.",
      "author": "EvangeIion_",
      "created": 1636963091,
      "upvotes": 2,
      "replies": {}
    },
    "hkpssbc": {
      "link": "/r/college/comments/quakym/im_at_my_breaking_point/hkpssbc/",
      "text": "I highly recommend you go to your professor. Have them look over your notes that you used, and see if they have any suggestions on how to study more effectively, and how to make sure that you're focusing on the right material. Also, study groups helped me quite a bit, and still do now.",
      "author": "physics_masochist",
      "created": 1636982376,
      "upvotes": 2,
      "replies": {}
    }
  }
}