{"sid": "psv6dg", "link": "/r/college/comments/psv6dg/how_do_i_deal_with_a_horrible_roommate/", "title:": "How do I deal with a horrible roommate", "text": "I don’t know how much longer I can deal with her. We’re in a double and she’s on vc with her boyfriend for at least 4-5 hours a night. She’s so loud. She’s gotten a little better since I talked to her but she’s just rude. She’s yelled “this is why I said you’re a closet gay” to her boyfriend multiple times when I have pride flags on my desk. She MOANS sometimes for him. She changes her laugh and sneeze to sound “cuter” for him. And her fake laugh is so obnoxious. When I try to vc with my friends they get concerned about how loud she is. She barely ever leaves the room, even for classes. She’s generally pretty nice to me but all those issues are making me hate her a little. Does anyone have any advice? Or am I just overreacting. Ive been wearing headphones so much to drown her out that my ears hurt all the time.", "author": "lavenderliv", "created": 1632267882, "retrieved": 1632946597, "over_18": false, "upvotes": 3, "upvote_ratio": 0.72, "comments": {"hdt0uhu": {"link": "/r/college/comments/psv6dg/how_do_i_deal_with_a_horrible_roommate/hdt0uhu/", "text": "I think that since she’s nice to you —don’t ruin that. So be very polite about how you want to address your concerns and give her a chance to think about what she’s doing wrong. She’s nice to you even if she’s doing some crazy shit—that’s what matters", "author": "elpresidentdeusa", "created": 1632283167, "upvotes": 2}, "hdsi2fe": {"link": "/r/college/comments/psv6dg/how_do_i_deal_with_a_horrible_roommate/hdsi2fe/", "text": "Is there anywhere else in the building she can go to chat with her bf? Study room? Common area? Kitchen? It is her room too but maybe you can negotiate a couple calls a week outside of your room. I second bringing the RA into the discussion. Also you could lol into transferring rooms.", "author": "Significant-Equal-12", "created": 1632273552, "upvotes": 4}, "hds9bhp": {"link": "/r/college/comments/psv6dg/how_do_i_deal_with_a_horrible_roommate/hds9bhp/", "text": "This isn’t the healthiest way to deal with it, but the big over-ear noise cancelling headphones are worth the investment.  \n\nA passive aggressive way to deal with this would be to play loud (ish) music whenever she’s being loud to “drown her out” and if she complains, you can say you weren’t comfortable hearing their private conversation so clearly all the time. \n\nThe direct way to deal with it could be kindly-coated honesty, “hey I can (still) hear your private video chats really clearly at their current volume. Could you use headphones for their audio and keep your voice down?  Or go outside?” \n\nPs. Im sorry.", "author": "NolasGirl379", "created": 1632269368, "upvotes": 3}, "hds8xkn": {"link": "/r/college/comments/psv6dg/how_do_i_deal_with_a_horrible_roommate/hds8xkn/", "text": "Just a quick \"Shut the fuck up bitch\" usually will suffice", "author": "cp3thegoat123", "created": 1632269179, "upvotes": 1}, "hds6fvh": {"link": "/r/college/comments/psv6dg/how_do_i_deal_with_a_horrible_roommate/hds6fvh/", "text": "Yikes. Sounds awful", "author": "ryysii", "created": 1632267985, "upvotes": 2}}}