{"sid": "pxcxkp", "link": "/r/college/comments/pxcxkp/im_going_to_be_failing_bio_101_at_this_point/", "title:": "I'm going to be failing bio 101 at this point.", "text": "Right now I have a 79.2 and I just got a 66 on my second exam. Great. I don't understand a single thing and whenever I search on Google or read the textbook, I still am so lost. I'm already halfway into this class and I'm scared to find a tutor and just straight up tell them I just don't understand anything starting from the start. Any tips? Study tips? I will probably find a tutor after fall break. A nice comment might be nice :') I am really sad and feel panicked about my grade.", "author": "santomical", "created": 1632854687, "retrieved": 1632945407, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"heob6x8": {"link": "/r/college/comments/pxcxkp/im_going_to_be_failing_bio_101_at_this_point/heob6x8/", "text": "YouTube: CrashCourse Biology\n\nAlso, find out what type of learner you are. We all have to study based on how we learn. Google a quiz, and that should help", "author": "TragicalKingdom", "created": 1632882304, "upvotes": 1}, "heni7kc": {"link": "/r/college/comments/pxcxkp/im_going_to_be_failing_bio_101_at_this_point/heni7kc/", "text": "First: deep breath. It will be okay. \n\nSecond: take some time to figure out what you do and don’t understand (you’ve got more than an F so you understand *something*, and we can work with that). Even just a really basic list of topics that are yes, maybe, and no, can be really revealing, and it might also tell you (or tell a tutor) something about how you learn best. Maybe you’re in great shape on the vocabulary, but you’re not sure on how to apply it. Maybe Punnet squares are your jam but taxonomy is breaking your brain a bit. And this doesn’t have to be anything super formal - just run down the table of contents in your textbook or flip through your notes thus far and jot down your first instincts. \n\nAlso - and yes, this is a totally shameless advertisement - if you’re planning to look for a tutor I’m taking new clients! PM me if you’re interested.", "author": "themathymaestro", "created": 1632868704, "upvotes": 1}, "hendyhx": {"link": "/r/college/comments/pxcxkp/im_going_to_be_failing_bio_101_at_this_point/hendyhx/", "text": "Try crash course on YouTube if your a visual leaner", "author": "gtfopx", "created": 1632866763, "upvotes": 2}, "hendvji": {"link": "/r/college/comments/pxcxkp/im_going_to_be_failing_bio_101_at_this_point/hendvji/", "text": "If your more of a visual leaner I highly recommend checking out crash course on YouTube they have some great videos that break it down so people can understand", "author": "gtfopx", "created": 1632866726, "upvotes": 3}, "hemmovd": {"link": "/r/college/comments/pxcxkp/im_going_to_be_failing_bio_101_at_this_point/hemmovd/", "text": "First off take a breath! It’s okay Bio is so difficult! Especially 101 classes sometimes cause they reallly want to weed students out. See what’s going on (are you not understanding the concepts cause it’s too wordy, is it too many things, do you blank on the exam?) and then see how you can fix it (maybe look up videos, write out the topics and tackle on at a time, practice relaxation techniques) Lastly, trust yourself that whatever happens you’ll be okay!! I got a D on Orgo Chem and then learned I was in the wrong field. Now I’m a straight A student", "author": "Nah_Maaan", "created": 1632855042, "upvotes": 2}}}