{
  "sid": "qi5rcl",
  "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/",
  "title:": "Annoying cough that won’t go away",
  "text": "Hey guys, I’ve had this annoying cough that has not gone away for basically a month now. I got tested for Covid a couple times and all negative. I then went to the doctor and they said it was bronchitis so I was on some medicine for that and just got off a couple days ago but I’m still coughing just not as bad. Every morning I wake up coughing up phlegm it’s so annoying. Anyone else also having this issue? I tend to have bad anxiety about my health so I wanted to see if anyone else was experiencing this as well. Upper respiratory viruses seem to be going around at the moment not really sure what else I can do lol",
  "author": "RudeDelivery9796",
  "created": 1635486027,
  "updated": 1635779836,
  "over_18": false,
  "upvotes": 23,
  "upvote_ratio": 0.93,
  "comments": {
    "hihb06p": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihb06p/",
      "text": "I’d say go get re-evaluated. Tell them you are not getting better. They might do some blood work and probably chest x-ray.\n\n\nEdit: what medication(s) did they put you on?",
      "author": "sohso31",
      "created": 1635486628,
      "upvotes": 16,
      "replies": {
        "hihbbvy": {
          "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihbbvy/",
          "text": "They put me on prednisone, a z pac and some kind of cough suppressant. They also said I had sinusitis as well so now my sinuses are much better and I wasn’t coughing any phlegm up when I was taking the medicine. But yesterday was the first day i didnt take any medicine as I had finished the treatment and then this morning I woke up coughing some phlegm up again.",
          "author": "RudeDelivery9796",
          "created": 1635486871,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hihe4px": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihe4px/",
      "text": "Dealt with this for 16 years before it got so bad I got pneumonia. Turns out I had undiagnosed asthma that presents similarly to a constant cold/cough. Could be something to ask about. Once I was properly medicated, it went away almost completely.",
      "author": "lyonnotlion",
      "created": 1635489010,
      "upvotes": 5,
      "replies": {
        "hihep4u": {
          "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihep4u/",
          "text": "I don’t think it’s asthma, I’ve never experienced this problem before with coughing. I think if I did have asthma I would know and everytime I go for a check up the doctors say my lungs are all clear. I will definitely ask tho!",
          "author": "RudeDelivery9796",
          "created": 1635489450,
          "upvotes": 1,
          "replies": {
            "hii8h6u": {
              "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hii8h6u/",
              "text": "I say definitely go for it. I have a similar problem with asthma where it makes my colds really bad and a higher risk for pneumonia, but not much else, no attacks or anything. I know it sounds weird, but it's worth asking",
              "author": "JarvisAI5",
              "created": 1635511756,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hihaqg8": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihaqg8/",
      "text": "Go back to the doctor. Preferably the same doctor you saw before. They will either run more tests, give you some stronger drugs, or both.\n\nWith vague/common symptoms, they end up treating the most likely cause of a patient's symptoms without 100% nailing the cause. The fact the drugs they gave you for bronchitis didn't work means it's either not bronchitis, your body metabolizes the drug weird, or you have strain that is resistant to the drug you were given.",
      "author": "bflotty",
      "created": 1635486429,
      "upvotes": 3,
      "replies": {
        "hihazsw": {
          "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihazsw/",
          "text": "I’m definitely gonna go back if it doesn’t get better in the next couple days. Just conflicted bc where I’m at in college the pollen is awful and I’m super allergic to all pollen so that’s probably contributing to it as well",
          "author": "RudeDelivery9796",
          "created": 1635486620,
          "upvotes": 1,
          "replies": {
            "hihdpk4": {
              "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihdpk4/",
              "text": "start taking allergy meds (NOT BENEDRYL) every day. it works so much better than just taking it when you have a flare up",
              "author": "rynpickles",
              "created": 1635488682,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hiheegw": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hiheegw/",
      "text": "Try asking r/AskDocs . They might be able to help you",
      "author": "Awkward_bi",
      "created": 1635489221,
      "upvotes": 3,
      "replies": {}
    },
    "hihafx2": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihafx2/",
      "text": "I’ve had the exact same thing pal. I don’t have a clue what it is though but I’ve been in the exact same boat for just about as long",
      "author": "harry01772",
      "created": 1635486216,
      "upvotes": 1,
      "replies": {
        "hihalyb": {
          "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihalyb/",
          "text": "Ugh yes. Literally so many of my friends have it as well. I’m just so confused and annoyed as to why it’s been lingering for so long. Hopefully we both get better soon",
          "author": "RudeDelivery9796",
          "created": 1635486336,
          "upvotes": 1,
          "replies": {
            "hii0h6m": {
              "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hii0h6m/",
              "text": "Do you all live in the same building? Could be a mold problem somewhere.",
              "author": "Business_Downstairs",
              "created": 1635507287,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hihdxee": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihdxee/",
      "text": "Sounds like you have what I had. Do you by chance have allergies? Especially bad attacks during the summer?",
      "author": "safespace999",
      "created": 1635488854,
      "upvotes": 1,
      "replies": {
        "hihekz8": {
          "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihekz8/",
          "text": "Yes I have horrible allergies. I got an allergy test about a year ago and it came back that I was super allergic to every single pollen 😅",
          "author": "RudeDelivery9796",
          "created": 1635489363,
          "upvotes": 1,
          "replies": {
            "hihffh3": {
              "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihffh3/",
              "text": "Oh then I would talk to your doctor about it, it sounds like postnasal drip and it's annoying. So what happens during the summer time, mucus begins to leak into your lungs and as the weather begins to get colder that mucus makes your lungs cold and have a persistent cough. It could potentially get worse over time and the cough persists. A round of antibiotics can help clear it up rather quickly (trust me I learned the hard way I had a persistent cough for about 3 months pre-covid). It would then help you next year to potentially take allergy medication to help lessen the possibility of happens regularly, especially with those with a history of bronchitis.",
              "author": "safespace999",
              "created": 1635490033,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hihvtmd": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hihvtmd/",
      "text": "Are you drinking enough water? Do you have acid reflux? Allergies?\n\nAll three of those was causing me to cough. All happened separately lol. Was coughing at night/early morning and my doctor put me on acid reflux medication and it stopped. Then I started coughing again about a year later after I adopted a second dog. Turns out I was allergic to pet dander. I stopped letting them sleep in my bed and popped a allergy pill. Stopped coughing. Lately, I can't seem to keep up on my water intake. When I do. I don't cough or feel phlegmy.",
      "author": "LikelyWriting",
      "created": 1635504057,
      "upvotes": 1,
      "replies": {}
    },
    "hii3qav": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hii3qav/",
      "text": "I was sick for like 4 weeks earlier in the semester (also not covid) but it eventually went away. I know a lot of people that are getting sick for way longer than normal rn. Maybe go get a strep test to see if you need antibiotics",
      "author": "ekaplun",
      "created": 1635509234,
      "upvotes": 1,
      "replies": {}
    },
    "hiif59q": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hiif59q/",
      "text": "I would definitely ask about allergies the next time you go to the doctor. I got sick freshman year and I was taking all kinds of cold and flu medicine that weren’t completely relieving my symptoms and it turned out I was having severe allergies.",
      "author": "serendipitygalaxy",
      "created": 1635514857,
      "upvotes": 1,
      "replies": {}
    },
    "hiiocfe": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hiiocfe/",
      "text": "Had same thing. Eventually just went away!",
      "author": "FewAssociate8372",
      "created": 1635518756,
      "upvotes": 1,
      "replies": {}
    },
    "hijkhcw": {
      "link": "/r/college/comments/qi5rcl/annoying_cough_that_wont_go_away/hijkhcw/",
      "text": "Same boat right now have work on hold, a midterm and a few projects fuck me. I have allergies too which has made mines confusing ,but no covid ! Fuck I hate phglem and runny nose ineed thegrade dammit ,I have no insurance either",
      "author": "chicityhopper",
      "created": 1635531344,
      "upvotes": 1,
      "replies": {}
    }
  }
}