{"sid": "k6pnh0", "link": "/r/college/comments/k6pnh0/stressed_to_the_max/", "title:": "Stressed to the max", "text": "Anyone else felt more stressed than usual this semester? I’ve been in a slump lately because of my grades I’m doing the worst I ever have in college and it’s put me in such a terrible state of mind. I’m usually a pretty good student but lately it’s been different. Forgetting assignments or not doing them at all, blowing off things till the last hour, just overall lazy and procrastinating and it’s made me feel awful and I have tried but I can’t get out of what’s going on. Am I the only one?\n\nEdit: I wanted to add in that I don’t mean to make a sob story for myself, just feels like a place I can post smtn like this and have peers relate to it.\n\nEdit 2: Wow! Didn’t expect this to blow up, so happy to see everyone sharing their stories about this semester. Thanks for the support and thank you guys for supporting each other through all of this! We can do it!", "author": "Emergency-Eggplant78", "created": 1607103846, "retrieved": 1632947219, "over_18": false, "upvotes": 1395, "upvote_ratio": 0.99, "comments": {"gfb8ngz": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gfb8ngz/", "text": "Man can't wait for this degree to be over..... im sick of it.... can't handle it anymore.....", "author": "gallygally297", "created": 1607627434, "upvotes": 1}, "gezfrr1": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gezfrr1/", "text": "100% feel this. Haven't gotten anything lower than a B and this is the first time that I will probably fail. This is my first semester in grad school too which means if I fail they might kick me out of the program. Ugh...\n\nWhen they cancelled in-person classes I was psyched thinking I would get to sleep in every day and take more time for myself.\n\nNow I would give anything to be back in person. Crazy how it changes", "author": null, "created": 1607374831, "upvotes": 2}, "gevvc3w": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gevvc3w/", "text": "Absolutely, I've had more assignments, essays, quizzes than a full year.  I've never had to stay up to finish projects before but I've already done it a couple of times. In my college it feels as if the professors think that since classes are online the students have all the time in the world to do assignments. Can't wait for this semester to end. \n\n&#x200B;\n\nAlso good luck on finals everyone.", "author": "Musker_", "created": 1607295893, "upvotes": 2}, "geus5tp": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geus5tp/", "text": "Yeah. It's been a rough semester though. My landlord decided to sell ghe house in the middle of the semester. My grandmother who I lived with off and on during my childhood and teenage years died from a heart attack and kidney failure. I got covid two weeks later. My other grandmother has covid and is not doing well. It's been terrible and Im so emotionally and mentally done. I need a break.", "author": null, "created": 1607278605, "upvotes": 1}, "geti481": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geti481/", "text": "This semester has been the worst for me. I'm in grad school and I have 7 subjects to cover in 3 months. I barely go out because a) people decline my invitations, b) I was swamped with assignments, c) COVID restrictions. I never had so many acquientances before but it still feels super lonely. The workload is manageable, just the social life is miserable.", "author": "lovethecomm", "created": 1607256227, "upvotes": 1}, "gesd984": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gesd984/", "text": "Oh man, It feels so good to know I'm not the only one who feels like this. Overall, this semester has been one of the worst experiences of my lifetime and I've never gone through anything like this before. All the people around me seem to be doing find, and I thought It was a \"me\" problem. The circumstances are super shitty so they are impacting the way we live our lives every day. Keep pushing, I'm in the same boat that you are. Even if the outcome isn't what you wanted, you will have moved past It. Keep your head up my friend. Tomorrow is going to be better than today, and you are not alone in this. Covid university/college is a nightmare, but hopefully we can all stay strong and get through It together. cheers", "author": "devendasmusic", "created": 1607235107, "upvotes": 2}, "ger7vap": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/ger7vap/", "text": "Most definitely. \n\nI'm an online student. I only returned to college last fall (after an 10* year hiatus), so I didn't realize the burnout I would experience. I went from mid-January to December 4th non-stop this year. The breaks between semesters were only a week at max I think. \n\nMiraculously, I didn't really start feeling the burnout til Fall Session of this year. I think it all started taking a toll because I was taking a second language, as well as essay-heavy courses alongside. Next year I am taking Fall Session off, either both \"semesters\" or just the second one. The day after I finished finals, I was so exhausted even though I'd gotten a good night's sleep after everything. Never again.\n\n*Edited when I realized that I was away for 10 years, not just the 8 I was working full-time", "author": "Daughter_of_Anagolay", "created": 1607214166, "upvotes": 1}, "geq6wia": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geq6wia/", "text": "Just took all my finals and I'm more than sure I failed my chem one, I had almost a week where I could have diligently studied after coming back home for break but once I did get home, all my concentration flew out the window. I literally could not get myself to sit down and go over anything, and if i studied for at least one test, it would have needed to be chem so i could at least pass. We had some online program due 2 days later as well that i could have done all day and night to complete to help out my grade somewhat, but again I just couldn't. Sat myself in front of the computer but I literally couldn't comprehend just doing those problems. This class was important to my major too, and I needed to pass to take the next level next semester, but as usual I've gone and fucked myself over. Dont even wanna look at my final grade from how scared I am, and dont get me started on telling my parents yet or when my friend and roommate find out. \n\nSorry for the long ass rant, I guess I just had to put this somewhere but TLDR, failed an important class because I'm too scatter brained to get myself to study and do what matters.", "author": "Nyatt666", "created": 1607197080, "upvotes": 1}, "gepj894": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gepj894/", "text": "My finals and papers are due exactly one week from now (yes on a Saturday). I’ve spent the past month just procrastinating and have to study and write everything this week. I’ve been looking for places to bitch and moan and complain because I’d rather do that than study lol", "author": "5krishnan", "created": 1607185013, "upvotes": 2}, "geph3fa": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geph3fa/", "text": "Yeah, I’m glad I’m not alone in this.", "author": "Rmaranan1999", "created": 1607183841, "upvotes": 1}, "gepg9hz": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gepg9hz/", "text": "My physics class has decided to assign a double-chapter week with the quiz on Wednesday. Then Thursday is calc 2 final and Friday is physics final. I honestly don't know how I'm going to prepare as calc 2 prep alone could easily take me 4 days. Just feels like an impossible task given the time.", "author": null, "created": 1607183358, "upvotes": 1}, "gepfvwg": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gepfvwg/", "text": "Lmao you absolutely aren’t alone. If you’re like the majority of US Students here, your semester was compressed, and MORE work was added on. A straight-shot semester with no breaks is definitely challenging. My on-campus counselor told me that she had more clients than usual this semester, and everybody was worried about grades/performance. Not to mention, for some reason most professors have been going harder on me. Some have been understanding, and some haven’t. But yeah we’re in a pandemic.", "author": "noexqses", "created": 1607183155, "upvotes": 1}, "gepetqx": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gepetqx/", "text": "Stressed is completing nursing transition 12hr shifts coupled with 8hr VSims while studying for 2 Kaplan finals (1 being a 3.5hr exam) while simultaneously studying for NCLEX board several weeks from now. Somehow, I squeezed a 5 page acadmic research QI project and presented to the entire hospital floor (20% of transition grade).", "author": "XMTROY", "created": 1607182541, "upvotes": 2}, "gep80gf": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gep80gf/", "text": "You definitely are not alone Emergency-Eggplant78. My last final is later today and I already feel like a huge weight has been lifted! I hope your grades turn out ok, but more importantly I hope you can get yourself back to who you want to be. Good luck!", "author": "ccole17", "created": 1607178321, "upvotes": 1}, "gep1oij": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gep1oij/", "text": "aww sorry", "author": null, "created": 1607173388, "upvotes": 1}, "geoxcj9": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geoxcj9/", "text": "It RIDICULOUS that being stressed in school has become such a cliche. Add work,friends and family, their life’s too and you have a whole team against one. Its simply too many tackles for just one person. No wonder people run the opposite way.", "author": "simplejosyy", "created": 1607169125, "upvotes": 3}, "geosi0g": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geosi0g/", "text": "I woke up at 3 am today in a panic Because I thought I forgot to turn in a huge paper. Turns out I did , thank god but it was stressful as hell lol. So yes.", "author": "lovingtolive", "created": 1607163722, "upvotes": 1}, "georwj2": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/georwj2/", "text": "I'm taking a medical withdrawal. Started out the semester with such high hopes but it just didn't work out that way. Hopefully I'll be able to start fresh in the Spring. \n\nWishing all of you safe travels and the best of luck on your finals in the next few weeks!", "author": "DJtunatundra", "created": 1607163048, "upvotes": 1}, "geoogce": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geoogce/", "text": "I'm in my first semester of a university I transferred to. I never wanted to study during the weekday because I'm always tired after work and I have to get up early (5:30AM) to go to work. My laziness finds doing school work is much better over the weekends.", "author": "DammieIsAwesome", "created": 1607159180, "upvotes": 1}, "geoloki": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geoloki/", "text": "Fully feel that. I missed an entire exam somehow this semester, that’s a new low", "author": "Iylaofthestars", "created": 1607156186, "upvotes": 2}, "geok4vx": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geok4vx/", "text": "im not in college , but yeah i have been feeling stressed out.", "author": "opioddaddy", "created": 1607154597, "upvotes": 1}, "geoik0e": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geoik0e/", "text": "I've been having an awful time. I've shed quite a bit of tears this semester. I'm definitely taking less hours in the Spring. It's just too tough to do 16 hours online for me. I hope you can hang in there!", "author": "Jokers_Harley", "created": 1607153057, "upvotes": 1}, "geohk5s": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geohk5s/", "text": "Me too! I’ve never been such a horrible student in my life. I just can’t focus on school right now", "author": "Spidersinthegarden", "created": 1607152113, "upvotes": 2}, "geoh38v": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geoh38v/", "text": "Yes. I failed at least two of my classes, it’s rare for me to get a C so I’m freaking out. Hoping the school accounts for COVID and online transitions and doesn’t kick me out or take my scholarship(2.0 gpa required for both). I’ve been in college for four years with no issues and it would be stupid to fail out now.", "author": null, "created": 1607151676, "upvotes": 1}, "geoda05": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geoda05/", "text": "unfortunately, it’s all this remote learning. it’s something new that not a lot of us have really experienced. i relate to your post soooooo much oh my gosh. i hope things get better for everyone on this post!", "author": "suncastles", "created": 1607148323, "upvotes": 1}, "geockld": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geockld/", "text": "I came to this subreddit to talk about the same issues in hopes that others could relate, and your post made me feel a lot better. I’m usually an A and B student and this is the first semester I’m looking at the possibly of failing classes for the first time. It’s sent my mental health spiraling, which just makes my grades and work ethic worse. At this point, I’m doing what I can, but accepting my mistakes and trying harder next semester.", "author": "jaspermont22", "created": 1607147738, "upvotes": 1}, "geo9vm2": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geo9vm2/", "text": "Definitely not the only one. I've struggled as a student in general because of my home life situation and my parents being a hindrance to my motivation. My brother dropped out of college his first semester and they thought I would do the same, especially my mom. \n\nBut right now, I'm failing four classes right now. Home life has been a little more difficult this year, experienced a couple of deaths of people really close to me, and I'm always cooped up in my apartment. I'm really thankful to have my roommate and to have supportive people in my life. But my mental health hasn't been the best and it's been hard for me to be motivated. This year really has sucked and the amount of built up stress is hitting right now.", "author": "rachyb4500", "created": 1607145671, "upvotes": 1}, "geo4k0q": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geo4k0q/", "text": "I’m a freshman so I have no other college to compare it to, but this is how I feel with online school! I just don’t feel immersed so I like have zero motivation", "author": "ayebieber", "created": 1607141981, "upvotes": 2}, "geo068q": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geo068q/", "text": "I feel the pain. The whole situation right now with CovId, etc. only adds to the stress. Mental pressure compounds by definition, meaning stress breeds anxiety and vice versa. It will get better. To make it better though, there's really two key things you need to do. 1.) focus on your health meaning good food/ cardio everyday. 2.) Focus on the input stressers. Wherever feasible, cut work hours or cut class load to something you feel you can manage.\n\n&#x200B;\n\nNot trying to peddle any wares, but here's some things that helped me.\n\n[https://dormessentials.com/top-ten/college-stress-relief/](https://dormessentials.com/top-ten/college-stress-relief/)", "author": "ExternalUse2", "created": 1607139128, "upvotes": 4}, "genzroj": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genzroj/", "text": "My grades have plummeted in comparison to other semesters. Got me feeling very down and discouraged about school. Just trying to hold it together. 1.5 semesters to go", "author": "mech_eng_student", "created": 1607138867, "upvotes": 2}, "genzm2z": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genzm2z/", "text": "I feel this man im graduating this semester and im just trying to pass Spanish 2 with a 60", "author": "existentialdoomer", "created": 1607138769, "upvotes": 2}, "genyf1h": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genyf1h/", "text": "I had a quiz today. 10 questions 12 minutes. I missed three questions and cried for awhile. \n\nIt’s my first year at a University and I hate it. My two years at a community college I had mostly As and a handful of Bs. Now it looks like I might finish with three Cs two Bs and one A. \n\nI have yet to come across a job that looks at grades, it’s mostly about experience. We will get pass this time, this year is extremely stressful. I believe in you all!", "author": "worlds_away_", "created": 1607137994, "upvotes": 2}, "geny3a3": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geny3a3/", "text": "This semester was my worst and all my exams were open notebook. Says it all.", "author": "QuirkyWafer4", "created": 1607137785, "upvotes": 3}, "genxv9z": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genxv9z/", "text": "Some semesters will be worse than others.", "author": "Sedusaa", "created": 1607137641, "upvotes": 2}, "genv916": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genv916/", "text": "Nah I've been doing pretty well this semester, probably better than most of my in-person semesters. I understand why people are finding it harder to focus but the material is constant whether classes are in person or not. I just found it within myself to give unwavering focus and my performance never dropped.", "author": "shuaybisaj", "created": 1607135999, "upvotes": 1}, "genul7l": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genul7l/", "text": "Completely relate. I actually started out with 4 classes this semester, nothing new to me, and dropped 3 of them within a month and a half of class. I lost a couple hundred dollars doing this but I knew I was going to fail them because I was doing the exact same thing in each one...\n\nI feel like Im a little alone in regards to dropping 3/4 of my classes. I knew it was the best thing for me, so looking back on it I dont feel too negatively about it, but feeling like I was the only one who gave up is kind of lame!", "author": "boebaeda", "created": 1607135589, "upvotes": 2}, "genseme": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genseme/", "text": "My grades have never been worse ( not terrible but not good) and im the most stressed I've ever been , in my last year of hs and I played 4 sports last year  and did 3 other extra curriculars on top of hard classes", "author": "jawsthegreat777", "created": 1607134252, "upvotes": 2}, "genqywp": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genqywp/", "text": "My college was on campus but with restrictions, so not nearly as many social events, so I felt like I wasn’t getting the fun experiences I would normally get with the stress and work.", "author": "sambamamerican", "created": 1607133391, "upvotes": 2}, "genpfc3": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genpfc3/", "text": "I consider myself an exceptionally well rounded student but I couldn’t care less about this semester. At this point, even logging into zoom meetings is mentally taxing. I haven’t learned shit and I’ve pretty much accepted that I’ll have to retake a class or two", "author": "Bk_Grizzly", "created": 1607132467, "upvotes": 6}, "geno3zp": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geno3zp/", "text": "My mum is working as a psychiatrist and she talks to so many students who struggle at the moment. I literally dropped out of college because I went back home (I was an international student in the U.S) and I was not able to organize my classes with this huge time difference. I completely felt disconnected from my college and my anxiety level increased so much. I worked so hard on my social anxiety when I was on campus and now I am not seeing anyone anymore and I also went through a break up at the same time which made me depressed and now I have to restart from zero. I found a good university in my home country but it feels like I am missing out. However, you are not alone. SO many people feel like this at the moment. \"If you go through hell, keep going\". It will make us stronger.", "author": "worldcitizen9395", "created": 1607131688, "upvotes": 2}, "geno3y1": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/geno3y1/", "text": "You are definitely not alone. I already have to retake 6 papers for this sem caused I failed most of my modules. The amount of tasks I have to do makes me procrastinate a lot too.", "author": "JestinJoe", "created": 1607131687, "upvotes": 3}, "genn50r": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genn50r/", "text": "Yeah, my work ethic has tanked. I’m doing mediocre but my drive to do well simply isn’t there anymore", "author": "f_ckupsomecommas", "created": 1607131111, "upvotes": 2}, "genlntw": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genlntw/", "text": "I’m currently putting off the three 10+ page research papers I have due within a week, only one of which I’ve started. Online classes just make me so unmotivated.", "author": "-not_a_real_account-", "created": 1607130240, "upvotes": 4}, "genkydp": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genkydp/", "text": "i'm also very stressed. i usually struggle with college though. let's try hard i hope we can pass our classes", "author": "ThinkingSmash", "created": 1607129829, "upvotes": 3}, "genjmms": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genjmms/", "text": "In the same boat!!", "author": "legendarysandy", "created": 1607129052, "upvotes": 1}, "genhssw": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genhssw/", "text": "Same man have done great first two years (am junior now) and this semester im gonna fail one class and its because of stress of online only and covid. you not alone g", "author": "AH_Matthew", "created": 1607127963, "upvotes": 5}, "genhplu": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genhplu/", "text": "I've been really consistently putting in the work as to not have my grades be the worst they've been this semester and am also quite regularly stressed to the max, way more than ever before. It's the Fall 2020 experience.", "author": "inthebluejacket", "created": 1607127911, "upvotes": 1}, "gengib1": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gengib1/", "text": "I just want this semester to end. I haven’t done work for any of my classes in so long and I’m afraid at this point they might just kick me out.", "author": "trashshoes1988", "created": 1607127204, "upvotes": 8}, "genft5q": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genft5q/", "text": "Felt this exact same way near the beginning of the semester, knew it wouldn't get better anytime soon. So I dropped 2 of my classes that I didn't have to complete this semester. Only wished I dropped them sooner so I could get more refund. I don't regret it at all, it keeps me sane for next semester.", "author": "StarTopNova", "created": 1607126792, "upvotes": 2}, "genc1nw": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/genc1nw/", "text": "Yeah man even if my lowest score has been 92 I feel stressed af", "author": null, "created": 1607124647, "upvotes": 1}, "gen9jb1": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen9jb1/", "text": "Yeah I’ve been crying everyday.", "author": "labrats21", "created": 1607123248, "upvotes": 14}, "gen811x": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen811x/", "text": "I have gotten lazy and have lost motivation and have been in a slump. And some days I just stress about the slump and how I’m falling behind but am having a hard time finding the motivation to break these bad habits", "author": "Joke-Ok", "created": 1607122424, "upvotes": 12}, "gen7wcm": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen7wcm/", "text": "Same 😭", "author": "Joke-Ok", "created": 1607122352, "upvotes": 2}, "gen76zg": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen76zg/", "text": "I can completely relate. Before the pandemic struck I was traveling with a club at my university, getting good grades, coming out of my shell, and overall THRIVING. Now, I’m flunking a class and I already dropped another. I’ve been struggling since we went online and being at home hasn’t helped when everyone else is caught up in their own mess. I’ve lost motivation, but I’m at least trying to re-discipline myself.... I’ll have to try again next semester for that though. I’ll be on campus next semester so hopefully it’ll be better for me in terms of academics and having my own space to myself. I’ve kind of gotten over being emotional towards my grades and I’m just like “damn... okay.”", "author": "thriftyriah", "created": 1607121973, "upvotes": 13}, "gen6khw": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen6khw/", "text": "I’m a prof and I feel this way", "author": "tode909", "created": 1607121634, "upvotes": 11}, "gen5vx3": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen5vx3/", "text": "I know what you mean. I'm a really good writer, I've written novellas and short stories in my spare time all throughout university (and my life, lol) and received praise from teachers on my academic writing. But, this semester, that's been all torn to shreds. I dropped one class because of extremely low marks, then I really doubled down and worked hard on my last assignment for another. It's been marked but the prof emailed us last night saying he's waiting until the thirteen late papers have been handed in before releasing marks. It's eating me up, lol. Like, bruv, it's been two weeks, they're not gonna hand them in, GIVE US OUR MARKS BACK.\n\nI'm waiting on four different marks for three separate courses, one of these we did a class showcase of our work yesterday over Zoom, so I'm confused why the marks aren't up if the prof has already publicly evaluated my work.\n\n I've combated this stress by eating the money and getting a Nintendo Switch with Smash Ultimate, training to beat my friends at Christmas and playing World of Light; I also I started forcing myself to exercise every day again which means running .50 miles on snow and ice for the first time ever, lol. I do have cleat attachments for my runners but still, a little terrifying.", "author": "AnothaCuppa", "created": 1607121261, "upvotes": 2}, "gen5t64": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen5t64/", "text": "Honestly just existing in the world is hard right now. Sometimes it feels like a personal problem, but the reality is stress and misery is everywhere I look right now. Even though I’m in a personally decent situation it’s still incredibly stressful just to witness all of this. Turns out living through a deadly pandemic - and all kinds of political turmoil in the US, where I’m from - really sucks. It’s been a long time since I could get on any social media site or turn on the news without reading constant upsetting shit.", "author": "Thunderplant", "created": 1607121218, "upvotes": 11}, "gen5358": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen5358/", "text": "More than stressed the first day classes started for me I had a seizure on top of having online classes for the first time and a pandemic. We are going through unprecedented times and stress beyond belief is completely normal. The fact that you’re functioning is enough given circumstances, be proud.", "author": "madiimars", "created": 1607120819, "upvotes": 5}, "gen37qk": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen37qk/", "text": "Dont take this as me being an asshole please it's just me trying to be helpful.\n\nA lot of times in life things suck I dont know what you're dealing with but I do know that things have sucked for me in the past and I got through them as much as you dont want to your gonna have to study to get the grades up force yourself to do assignments earlier and quit feeling sorry for yourself because 9 times out of 10 nobody is gonna come do it for you ask questions in class if your having trouble and go to the office hours and ask more questions if you keep having trouble bug the shit out of your professors until you understand. \n\nSorry for the wall of text I'm on mobile also feel free to ignore this advice because you are your own person and everyone does things differently\n\nI am speaking from experience because this is what worked for me", "author": "bald_butte", "created": 1607119812, "upvotes": 2}, "gen2hr4": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen2hr4/", "text": "Not only that but it's so hard to make friends and enjoy \"normal\" college life since it's all gone if you're going virtual only classes. This is my first semester of college and it's been highly stressful, but I wonder if it's going to feel better once things go more back to normal and I can feel like a real college student too.", "author": "pancakebirdpowder74", "created": 1607119431, "upvotes": 3}, "gen2gm4": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen2gm4/", "text": "It does, indeed, suck. I realized today I've failed statistics for the second semester in a row. Like I failed so bad that even if I get a 100% on the final I will **still** fail. Something about this semester sapped my motivation like nothing else, but then again I have had apathy issues for the last year or so. Worse within the last few months, tbh. So the fucked up thing is that I care that I failed but I also kinda *don't* in this odd, emotionally detached kind of way.\n\nSo, it do be rough. It do be that way, sometimes. All you can do is analyze what went wrong, decide on potential fixes, and then resolve to do better next semester. That's my consolation to myself and so it's the only real piece of advice I can give you.", "author": "EgyptianDevil78", "created": 1607119414, "upvotes": 31}, "gen15pi": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gen15pi/", "text": "Studying for a final you know your gonna fail is ass", "author": "veeeerain", "created": 1607118727, "upvotes": 10}, "gemyhu5": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemyhu5/", "text": "I'm failing two classes right now. I've never failed a class.", "author": "Bomcom", "created": 1607117354, "upvotes": 58}, "gemya79": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemya79/", "text": "Yup, got some of the worst grades I ever got.", "author": null, "created": 1607117245, "upvotes": 9}, "gemxvik": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemxvik/", "text": "I’m a junior right now and my first two years went great but this semester I’ve felt unmotivated so much that I just kinda gave up. Dunno if it’s because it’s online or because I’m almost done but I feel you", "author": null, "created": 1607117039, "upvotes": 2}, "gemxth8": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemxth8/", "text": "I feel the exact same way. I have no sense of time and I keep forgetting when assignments are due. I’m usually on top of my shit but this semester has been the worst", "author": "Panthera_leo22", "created": 1607117009, "upvotes": 5}, "gemxna9": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemxna9/", "text": "I definitely feel the same. I also considered myself to be a fairly good student and had a good run for the first few months of this semester, but as it went on it became harder and harder to find motivation and I became more and more disorganized. We're so close to the end though, so even though it's hard I want to wish everyone good luck on their finals and to have a great and fully deserved break no matter how this semester went.", "author": "autumnsymm", "created": 1607116923, "upvotes": 7}, "gemx9bv": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemx9bv/", "text": "Everything will be ok if I just\n\n•find all the motivation that left me\n\n•catch up somehow\n\n•don't need sleep\n\n•lower my standards\n\n•get a time machine and a personal assistant", "author": "bitetheboxer", "created": 1607116728, "upvotes": 96}, "gemwxih": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemwxih/", "text": "This semester I went from only working weekends to working 5 days / week, and I did that partially so I would be forced to get my shit together and do assignments before the last hour they are due. At first it worked out fine, and then in October things just went downhill and I couldn’t find the motivation to do anything despite still having ample time to complete stuff on my to-do list.\n\nWe were hybrid this semester but the way it worked out, I ended only going to campus 2-3 days a week, which turned out to be bad for my mental health and work ethic. So I’m right there with you. I have always had motivation/procrastination issues but it has never been this bad. \n\nI have been considering only doing part-time in the spring or just taking the semester off altogether because we are partially online once again, and I’m not sure how much more I can take. So I guess my advice would be to consider either of those if it is possible for you?", "author": "Jakeremix", "created": 1607116561, "upvotes": 3}, "gemwgmu": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemwgmu/", "text": "I'm in my final semester ever and I honestly have to say I've never been this mentally drained before. Stay strong! We will get through this 💪", "author": "sopisofie", "created": 1607116323, "upvotes": 13}, "gemvqzg": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemvqzg/", "text": "[deleted]", "author": null, "created": 1607115964, "upvotes": 23}, "gemvqah": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemvqah/", "text": "Definitely, I have three writing assignments, 2 of them being essays due this weekend. Next weekend, I have another 2 due, and by Dec 15th, I have 2 final papers due lol. These coming weeks will be an endless barrage, no breathers, but I feel like if I were in a normal semester, I’d be able to handle it better since I’d have paid attention more carefully, but it’s almost like I have to rewatch all lectures and re-learn information for my classes lol", "author": null, "created": 1607115955, "upvotes": 13}, "gemv1f4": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemv1f4/", "text": "Nah bro shits same thing different day", "author": null, "created": 1607115607, "upvotes": 9}, "gemuu09": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemuu09/", "text": "Just saw that I posted wrong format of file(word instead of pdf) so I got 0 marks for an assignment which took 3 days to complete and then there is surprise quiz tomorrow which will be added in our cgpa.\nMan it sucks.\n\nUpdate-Turns out it was just a mistake and only my assignment was checked and graded. Im not sure it will be checked again but she told me to resubmit it.\nHope it does and only way to find out is by waiting.", "author": "ceilingfan-19", "created": 1607115503, "upvotes": 37}, "gemurd4": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemurd4/", "text": "This is the first semester out of the past 3 years that I'm going to fail a class. Not only that, but I'm going to fail multiple classes. This semester was a nightmare. Every day of homework and classes made me feel like I was on the verge of a panic attack. I've never received anything less than a B, and now I'm failing 3 out of 4 classes.\n\nThis semester fucking sucks...\n\nedit: Just a few hours ago, my uni extended the withdrawal deadline for the Fall Term, so I was able to change those 3 F's into 3 W's. Words cannot describe how much of a relief it is now to not be failing, and also not have to take finals.\n\nI'm switching majors.", "author": "Mithrandito", "created": 1607115466, "upvotes": 209}, "gemuinv": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemuinv/", "text": "Hell yeah, reaching out for community over hard issues isn't making a sob story, it's making connection.\n\nAnd yeah it fuckin sucks lol", "author": "stastnygetnasty", "created": 1607115347, "upvotes": 227}, "gemua3e": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemua3e/", "text": "You're not the only one. My motivation to do assignments and study has been pretty much shot this entire semester. With my awful study habits and using my phone too much, I've been doing awful in my classes. Also, pretty much everyone I've talked to has been having the same issues you've been having. So you are definitely not alone.", "author": "cstgerm", "created": 1607115229, "upvotes": 27}, "gemtvqk": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gemtvqk/", "text": "I know at least 2 people and myself have felt similarly. Don't be so hard on yourself. There were things out of your control this semester that affected your motivation and ability to get things done. You can't do anything to change your past grades but you can finish strong. Just keep doing the next right thing.", "author": "PandaWithAnRPG", "created": 1607115028, "upvotes": 47}, "gem8jts": {"link": "/r/college/comments/k6pnh0/stressed_to_the_max/gem8jts/", "text": "Hell nah bro I’ve been feeling this exact way like idk it’s just bad energy in the air or something cause between school and work I’ve been so stressed lol", "author": "OlliesFollies", "created": 1607104711, "upvotes": 292}}}