{"sid": "ouov8z", "link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/", "title:": "Anyone else seriously worried about an online fall semester?", "text": "Delta covid cases are popping off in a lot of states. You also apparently have a 1/10 chance of still catching covid even if you’re vaccinated. This is one nasty strain, and it shows no signs of stopping. Cases are rising in all 50 states, and the CDC has now recommended masks again.\n\nI’m worried that we might get another online school year. I just graduated HS and I want to live life again. My senior year was completely ruined, and I don’t want to miss out on my freshman year of college. Anyone else worried? I don’t think they will do another lockdown, but I do think that the CDC might recommend to return schools to virtual learning and implement social restrictions.", "author": "MILE913", "created": 1627665328, "retrieved": 1632947383, "over_18": false, "upvotes": 973, "upvote_ratio": 0.96, "comments": {"h7zn71t": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h7zn71t/", "text": "I’m actually hoping for this. The delta variant is still obviously not controlled. Instead of starting in person then switching mid way. I just hope they switch it sooner rather than later so professors can try and mitigate their tech difficulties. Doesn’t look like the delta variant will be under control for awhile.", "author": "Far_Drink_8879", "created": 1628288768, "upvotes": 6}, "h796s26": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h796s26/", "text": "No because regardless of what happens, regardless of how many people suffer, colleges will do anything to remain open despite it being WAY safer to even offer online to students. They need that money.", "author": "ElBarro69", "created": 1627773644, "upvotes": 1}, "h78zd2n": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h78zd2n/", "text": "I just took a gap year specifically to avoid online class so I’d be pissed if this happened. However, my school is requiring vaccines and is in a state w pretty high vaccination rates so I doubt it’ll go online. Universal mask mandate is much more likely", "author": "spiraltap99", "created": 1627769727, "upvotes": 1}, "h78vlrc": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h78vlrc/", "text": "Yeah dont want to play wirh my d allday", "author": "RoyalMain3240", "created": 1627767781, "upvotes": 1}, "h78ilgm": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h78ilgm/", "text": "If so, I’m out for the year. There is no way you can convince me that online school is on the same caliber as in person. I have staked too much on online school and I am beyond giving it another chance.", "author": "RaceCraft86", "created": 1627761174, "upvotes": 3}, "h78bnkt": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h78bnkt/", "text": "I think its a very real possibility and because of that i am no longer worrying about it but planning around it. I'm setting up personal projects and creating opertunnities along the way to learn new skills. I'm also shooting to include the friends I've made over the past year or so in these projects. Small things like these make the quarantine bairable for me and while i realize I've missed a huge chance by having an entire year of school online, chance to meet new people and such, ive also strengthened  so many relationships and grown to find a huge understanding of myself that i just wouldn't take back. Good luck to you in the fall semester man.", "author": "FreshOutOfMercy", "created": 1627757713, "upvotes": 1}, "h7886wh": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h7886wh/", "text": "My school is requiring EVERYONE to wear a mask, vaccinated or not, and I am so thankful. I’m hopeful that we will get through midterms in person but I have a bad feeling finals will be online. I’m in Alabama (UAB) and our cases are terrible. Birmingham UAB hospitals are packed out. Only 30% of people are vaccinated", "author": "Friendly-Notice317", "created": 1627755995, "upvotes": 1}, "h77vojx": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h77vojx/", "text": "Graduated this year, did all online my last two semesters in college because of Covid. Both full time had some senior level classes that were difficult. At first it was hard to adjust but I was very glad I had some understanding teachers that helped with the whole process of being online. It wasn’t bad more boring if anything I missed going to campus seeing all my friends. But the school work in general was not hard just had to spend some time every day working on it. Zoom classes can be boring and drag on, just make sure you go to them and apply yourself. You will realize you have a lot more time on your hands if you space out the work. I wouldn’t worry about it, be ready to have to adjust to online learning and that’s about it! You will be good", "author": "Bartlett229", "created": 1627750010, "upvotes": 0}, "h77s7f7": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h77s7f7/", "text": "I doubt it would happen. If anything they would require new vaccinations and mask mandates rather than a total shutdown. Trust me no one wants that to happen.", "author": "GodOfThunder101", "created": 1627748348, "upvotes": 1}, "h77k7ft": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h77k7ft/", "text": "Wasn’t it .1/10 chance. Its has a 99.1% effectiveness against covid.", "author": "linksis33", "created": 1627744504, "upvotes": 0}, "h77ird8": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h77ird8/", "text": "I'm taking a gap year for that reason (and several others). I'm not spending thousands and thousands of dollars for zoom classes", "author": "calypso_harrison", "created": 1627743778, "upvotes": 1}, "h77i1yz": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h77i1yz/", "text": "I feel like it’s possible but honestly a part of me fears in person college cause I heard it was harder… and honestly last year beat my ass up", "author": "ExerOni", "created": 1627743425, "upvotes": 2}, "h77gdur": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h77gdur/", "text": "The vaccines are effective against the variant, so I think its extremely unlikely that we'd have online classes.", "author": "tsako99", "created": 1627742655, "upvotes": 0}, "h77efjg": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h77efjg/", "text": "My college announced yesterday that they are requiring all students to wear masks inside, even if they are vaccinated. I’m honestly distraught about this because they announced earlier this summer that vaccinated people would not need to wear masks, and I was thrilled that I would be able to experience a normal college semester without covid being the main talking point. Now i’m worried we’ll end up right back where we were originally", "author": "TheGayFay", "created": 1627741677, "upvotes": 4}, "h77d8j4": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h77d8j4/", "text": "I work for a large university. Vaccines are strongly recommended, not required. Masks are strongly recommended, not required. I'm following the CDC guidelines and am still wearing a mask while vaccinated..I'm certain I have an older coworker who is anti-vacc and doesn't wear one. We can't ask her to.\n\nWe have to follow the guidance of the governor...so depending on who that clown in (cough) Ron DeSantis...we shall see how it goes down.", "author": "theamester85", "created": 1627741098, "upvotes": 1}, "h77c33x": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h77c33x/", "text": "Lots of universities/colleges are currently having a transitioning semester from online to hybrid (both present and online). But I think that it is going to end up online again because the cases are going to rise up again. Always prepare for the worse outcome so you won't have big loss.", "author": "roseblossom00", "created": 1627740531, "upvotes": 1}, "h77935b": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h77935b/", "text": "They might bring back masks for the time being but it’s unlikely they close everything again because the virus is much less severe", "author": "Inner_Cress_6478", "created": 1627738915, "upvotes": 1}, "h777wwr": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h777wwr/", "text": "The government is stringing you along for a ride", "author": "HoonCranker22", "created": 1627738249, "upvotes": 3}, "h776eyv": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h776eyv/", "text": "I go to school in the south and I’m worried they will not offer optional online classes! My school did not require vaccinations and I’m an athlete so I’ll be spending a lot of time with unvaccinated jocks in weight rooms where they 100% won’t wear masks even with rules saying they should.", "author": "n_ugget_t", "created": 1627737364, "upvotes": 1}, "h76wm0q": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h76wm0q/", "text": "Nah all my classes are online anyway. Plus all my classmates are thousands of miles away.", "author": "luther_williams", "created": 1627730425, "upvotes": 1}, "h76ovpy": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h76ovpy/", "text": "I hope not. Reallllly looking forward to campus life 😓😓😓😓 I’d be so so disheartened. Fuck the people who refuse vaccinations. They should be the ones banned from attending in person classes. Ugh", "author": "Hads1233", "created": 1627723299, "upvotes": 3}, "h76m6xh": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h76m6xh/", "text": "Yes I’m extremely worried. I was a college freshman last year and everything was online. Not only did it drive me insane, but I had none of the “college experience”. I’m like desperate for any social interaction and an opportunity to meet people...if the two in-person classes I have are gone, I’m actually gonna cry lol. With everything going on, I completely understand if everything goes online, but it’s still gonna suck for mental health..", "author": "missderacine", "created": 1627720739, "upvotes": 0}, "h76liub": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h76liub/", "text": "All of you are blaming normal hard-working people for making the personal decision not to get vaccinated EVEN in blue states where most of you reside and agree with.\n\n Instead of blaming normal people for decisions, they make with their lives, maybe, just maybe you should blame the college administrations for shutting down the schools for a disease that affects our demographic groups with mortality rates similar to the common flu...", "author": "LuukeyBoy", "created": 1627720117, "upvotes": -1}, "h76hyha": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h76hyha/", "text": "Nope not me!", "author": "JimmyNeutrino2", "created": 1627716900, "upvotes": 1}, "h76bhww": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h76bhww/", "text": "A lot of my classes were online or huge forum\nSo either online where I can get distracted, or forums where it's hard to concentrate since it's basically a theater and I get sleepy in those chairs", "author": "WhatABlake", "created": 1627711598, "upvotes": 0}, "h765tr8": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h765tr8/", "text": "Possible. I would wait if you could, freshman year is such a vital year. I lost out on my last year of college cause of covid but thankfully I had my friends.", "author": "flamec4", "created": 1627707464, "upvotes": 0}, "h765enf": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h765enf/", "text": "Im kinda hoping for online if I’m being honest. I have never learned more in my life then just teaching it to myself. Something I have to do anyway because I can’t pay attention in lectures and I also can’t retain anything from lectures. So this was really refreshing.", "author": "Surreal-Numbat", "created": 1627707177, "upvotes": 3}, "h763gl9": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h763gl9/", "text": "With all due respect I just graduated college and have no more school left. You’ll have 3 years after this even IF your freshmen year isn’t exactly what you hoped. Please", "author": "noseydolphin", "created": 1627705883, "upvotes": 2}, "h761x54": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h761x54/", "text": "Theres no point itll be an endless cycle for years if they keep doing this. Im in the same boat as you, i really just wanna say fck it. Its never going away so might as well get used to it.", "author": "jaxcoop4", "created": 1627704901, "upvotes": 0}, "h75xxue": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75xxue/", "text": "Nope,  been doing online since the 9th grade and started college online. I guess it's just my personal experience but I prefer online tbh", "author": "ihavenoideanymore21", "created": 1627702488, "upvotes": 0}, "h75ws26": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75ws26/", "text": "No, I’m a lot more worried about in person. How the fuck am I gonna go back to taking tests without Quizlet or having literally the entire book in front of me and Ctrl-F’ing through the entire test", "author": "chadan1008", "created": 1627701806, "upvotes": 12}, "h75tzpd": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75tzpd/", "text": "Nope.\n\nColleges are losing WAY too much money out of poor freshman enrollment.\n\nThey used all their federal stimmy to support new students in person this fall.\n\nI would expect virtual learning to return only if CDC recommended lockdowns, in which case it would have to be quite severe; to the point where everyone is scared like March 2020. I dont think that is likely with the vaccines available, and booster shots in clinical trials.", "author": "su1eman", "created": 1627700208, "upvotes": 1}, "h75sdcj": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75sdcj/", "text": "Not really. That would be the stupidest shit. Security theater has gotten old", "author": "cp3thegoat123", "created": 1627699286, "upvotes": 2}, "h75pg4i": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75pg4i/", "text": "The thought has passed my mind. My school didn’t do fully online last year, I had about half my classes online and half in-person. I stayed on campus all year. I could see some bigger classes going online, but I don’t think my college would send us home/go fully online barring a major catastrophe.", "author": "holographicboldness", "created": 1627697668, "upvotes": 2}, "h75l4pa": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75l4pa/", "text": "I'm lowkey hoping for it to be online. It's been so long so in person I'm not gonna be used to it.", "author": "TheMias24", "created": 1627695361, "upvotes": -1}, "h75l0ml": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75l0ml/", "text": "I actually wish we got more online classes. All the classes I need are full or in early mornings when I have work", "author": "stardusttree", "created": 1627695302, "upvotes": -1}, "h75jb0e": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75jb0e/", "text": "I am worried as well", "author": "1234Dillon", "created": 1627694389, "upvotes": 3}, "h75ht8h": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75ht8h/", "text": "To be fair online college is not anywhere near as bad as what the public schools are doing rn for remote operations.", "author": "Danielanish", "created": 1627693597, "upvotes": -1}, "h75hfs7": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75hfs7/", "text": "Same here man. My senior year of hs was all online and I feel socially deprived like never before. I'm excited for in person freshman year of college. Can't take more online school.", "author": "Astro975", "created": 1627693401, "upvotes": 4}, "h75hbaj": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75hbaj/", "text": "This is just so frustrating. Just get vaccinated if you want life to return to normal!!", "author": "Tall_Specialist", "created": 1627693334, "upvotes": 4}, "h75edt6": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75edt6/", "text": "Well I just registered for my fall classes and most of them were online. I only found one class that was in person and the other two are completely online. I can tolerate remote classes but I hate taking classes completely online, especially science classes. I’m guessing that most of the professors in my college want to teach from home and not go back to the classroom, especially since covid cases in my area are going up. It sucks.", "author": "sparklez_88", "created": 1627691798, "upvotes": 0}, "h75bvgo": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75bvgo/", "text": "My college requires students, staff and faculty to be vaccinated. It’s located in Maryland, where the vaccinated percentage is some other states, but not high enough to be at herd immunity. I am super nervous, especially since the football season will happen and they’ll allow spectators.", "author": "DollXIX", "created": 1627690467, "upvotes": 0}, "h75b5ri": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75b5ri/", "text": "I can't do this again.\n\nI wore my mask, I got my shot, just ban non vaccinated students and let the rest of us move on with our lives", "author": null, "created": 1627690089, "upvotes": 29}, "h75anbo": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75anbo/", "text": "south dakota here..alas..lol..that first spring we went online, and then in the fall we were masked and had zoom options but were mostly in person...when the go ahead came down in may here to take off masks everyone on campus was so happy/\n\ni cant see south dakota colleges going back to masks without some serious kiciking and screaming.\n\ni'd like to have a legit real grad school experience instead of the craziness that was my senior year of undergrad", "author": "DakotagurlSD", "created": 1627689824, "upvotes": 0}, "h7596x9": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h7596x9/", "text": "[deleted]", "author": null, "created": 1627689072, "upvotes": -9}, "h757zia": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h757zia/", "text": "with the midterm elections coming up i think it's a real possibility 😉", "author": "RareLemons", "created": 1627688450, "upvotes": -5}, "h7568bl": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h7568bl/", "text": "Please. No more. My brain is literally bursting at the seams for doing 3 semesters completely online.", "author": "KaiserWilhelmDaThird", "created": 1627687550, "upvotes": 15}, "h7564fm": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h7564fm/", "text": "Oh absolutely, I'm an international student (us to uk) and I'm terrified my university will shut down again, the same way we did last fall. I've thought about taking time off, but since covid's going nowhere soon, the best we all can do is stick it out imo.", "author": "kycantina", "created": 1627687496, "upvotes": 2}, "h7562q9": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h7562q9/", "text": "Oh absolutely, I'm an international student (us to uk) and I'm terrified my university will shut down again, the same way we did last fall. I've thought about taking time off, but since covid's going nowhere soon, the best we all can do is stick it out imo.", "author": "kycantina", "created": 1627687472, "upvotes": -1}, "h755bac": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h755bac/", "text": "if they go online, im dropping out of my current school and going to local community college", "author": "irontricep", "created": 1627687090, "upvotes": 2}, "h753mq5": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h753mq5/", "text": "[removed]", "author": null, "created": 1627686246, "upvotes": 1}, "h753f55": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h753f55/", "text": "Depends on the campus I think. 91% of my school will be fully vaccinated in the fall and were in a pretty rural area so I’m not expecting there to be any major outbreaks. I can see schools in big cities implementing increased safety precautions but I think most students would take a semester off than go through this again so for the sake of money they’ll probably stay open.", "author": "Notaclarinet", "created": 1627686141, "upvotes": -1}, "h75360n": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h75360n/", "text": "Am fully vaccinated and got absolutely wrecked by the Delta variant. Honestly As numbers start to rise again I can easily see it happening. Which is unfortunate as being in person is a great time.", "author": "bigtimetimmyjimy", "created": 1627686013, "upvotes": 8}, "h752yru": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h752yru/", "text": "Why y’all scared of a virus with a 99% survival rate? You’re literally equally as likely to die in a car crash today (1/100) as you are of covi d", "author": "kelsieelynn", "created": 1627685913, "upvotes": -9}, "h752vk7": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h752vk7/", "text": "Im not worried. My school allows on campus activity this Fall but Im staying home still and all my classes are online. I’ll let people decide their own safety. Im keeping myself and my family safe. End of story", "author": "FluffyStuffInDaHouz", "created": 1627685868, "upvotes": 3}, "h752tij": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h752tij/", "text": "Just some facts to check on about covid:\nhttps://www.pbs.org/newshour/health/breakthrough-covid-infections-show-the-unvaccinated-are-now-putting-the-vaccinated-at-risk", "author": "Bberges", "created": 1627685839, "upvotes": 0}, "h752i85": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h752i85/", "text": "Stop posting about it. The more we keep talking about it, the media's attempt at fearmongering is going to keep working. Get the vaccine, take the mask off, and forget about COVID-19 for eternity. That's what I did.", "author": "bodak_red", "created": 1627685683, "upvotes": -10}, "h750337": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h750337/", "text": "Not a chance.", "author": "Megadog3", "created": 1627684494, "upvotes": 0}, "h74zudg": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74zudg/", "text": "I’ll drop out and resume later I’ll never do online again", "author": "Vince_stormbane", "created": 1627684374, "upvotes": 4}, "h74zeuq": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74zeuq/", "text": "The thing is, schools are requiring people to be vaccinated. For vaccinated people, you are very unlikely to get any type of serious illness. If you need to be vaccinated to be on campus, then COVID spread would be less  than flu spread, with an equal or lesser severity.", "author": "pokemonareugly", "created": 1627684162, "upvotes": 4}, "h74ymf8": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74ymf8/", "text": "I hope not, but it's not out of the realm of possibility. I'm banking on going back to classes in person because I've done SO bad online, and I need these in person office hours and counselling services.\n\nThing is, our school is still HIGHLY RECOMMENDING vaccines instead of requiring them, but yet they insist that students MUST be on campus for most classes. This is gonna be a mess lol.\n\nI'm clenching my cheeks for things to go either way. Luckily I don't think I'm living on campus this year, so that makes some stuff easier.", "author": "NoodleEmpress", "created": 1627683775, "upvotes": 8}, "h74ymd4": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74ymd4/", "text": "me too:( think i’ll drop out if stuff does back online", "author": "libbytravels", "created": 1627683774, "upvotes": 2}, "h74ygg3": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74ygg3/", "text": "Nope", "author": "ThePowerLord", "created": 1627683694, "upvotes": -1}, "h74xzt4": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74xzt4/", "text": "Here in texas I feel like they'll only do it if half the population dies or something. Our schools can't even require masks or vaccinations at this point, and greg abbot keeps making more and more rules, and we are at like, what? 50% vaccinations? I feel like it's going to get bad here. My masters degree is mostly online anyways, but I feel bad for everybody that was looking forward to campus life. Unfortunately at this point, the shortest estimates the scientists gave us last year for the end will never be met.", "author": "unamablemove", "created": 1627683472, "upvotes": 34}, "h74x8ij": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74x8ij/", "text": "Yes. All this Covid shit started in spring of my freshman year. Now I’m a rising junior and things are getting bad again. I just want to have a real college experience, man. I’m starting to think that’s not going to happen. Fuck the people who won’t get vaccinated.", "author": "noble-light", "created": 1627683106, "upvotes": 102}, "h74wuy3": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74wuy3/", "text": "I’m really concerned over the residential students—My university has us ether get the vaccine or exempt form to be on campus, but no matter what you HAVE to wear a mask. I wouldn’t be surprised if we’re forced to go back online learning, and since I’m a commuter, I have a feeling we’ll be one of the first to get the stay at home memo.\n\nWait until flu season, we’re quiet possibly screwed in the fall🥲", "author": "Nerdyxwitch", "created": 1627682923, "upvotes": -1}, "h74wpkw": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74wpkw/", "text": "Where did you get the 1/10 of delta variants?? That’s a scary stat", "author": "Narwhal_97", "created": 1627682851, "upvotes": 0}, "h74wff8": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74wff8/", "text": "This year is my senior year of college and I have a strong feeling the fall semester will be okay because my university is doing half online half in person classes but I have a bad feeling my last college semester will be online :(", "author": "NotThatGirl217", "created": 1627682717, "upvotes": 1}, "h74w6xt": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74w6xt/", "text": "I'm worried that I'll be forced back into the classroom tbh.\n\nedit: because anti-vaxxers outnumber us in my state", "author": "PhantasmHS", "created": 1627682603, "upvotes": 2}, "h74uq89": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74uq89/", "text": "As an immuno compromised person I wish it was online ;(.", "author": "PrinceBunnyBoy", "created": 1627681912, "upvotes": 11}, "h74t73x": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74t73x/", "text": "Seeing as my school was never online in the first place the whole of last year, no it’s not possible for my school. We were there during peak pandemic with cases blowing up in Rochester but very few campus cases. Same in spring and restrictions were lax for the most part. So yeah, I’m not sure about anyone else’s situation but my school takes sanitation, employ technology to neutral organic air particles, lots of hand sanitizer, and generally rules pretty seriously but I just can’t see it going online in any capacity", "author": "smelltheskinny8", "created": 1627681201, "upvotes": 0}, "h74s6h1": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74s6h1/", "text": "I personally want mine to be. My classes as of right now are mixed online and in person and we are required to wear masks. That all just sounds like it should be online, or at least I should have the choice to be online.", "author": "Yori_R6", "created": 1627680729, "upvotes": -1}, "h74qv5o": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74qv5o/", "text": "I truly hope society goes back to normal but uh, I really enjoy the virtual / online classes and school so much better than I did in person.", "author": "Niarah", "created": 1627680119, "upvotes": 8}, "h74qq60": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74qq60/", "text": "Id be pissed asf. I live in Oregon, and they're strict asf. We barely off from the first round of restrictions tbh lol", "author": "Rayklin", "created": 1627680056, "upvotes": 1}, "h74oqqx": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74oqqx/", "text": "TBH if school is remotely as it has been the last 3 semesters I will drop out and come back when this nightmare blows over", "author": "savagedoughnut", "created": 1627679149, "upvotes": 4}, "h74ok1u": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74ok1u/", "text": "We're guaranteed fall online at my university, and our vaccination rates will hit 80% (full). There will also be a fourth wave. Some places are celebrating the end of COVID like it's gone. It is not gone. Especially when places can barely hit 50% vaccination rates. So if your institution isn't actively planning for a fall one they'll be scrambling come the middle of the term to shift yet again.", "author": "purple_ombudsman", "created": 1627679065, "upvotes": -4}, "h74oh6l": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74oh6l/", "text": "I think we will be fine. Daily cases still under 85,000 and a lot of unis required students to get the vaccine so a lot are vaccinated. It could happen tho, right now I give it a 20% that everything will be online.", "author": "WalmartDarthVader", "created": 1627679028, "upvotes": -1}, "h74o34h": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74o34h/", "text": "My community college planned for mostly online already. 3/4 of my classes are fully online so not much will change for me no matter what. I really want to get back to “normal” too after a depressing senior year but my state is reluctant.", "author": "idkcat23", "created": 1627678934, "upvotes": -1}, "h74nilw": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74nilw/", "text": "I don't think we will be online but I could see mask mandates for everyone, including vaccinated people", "author": "fan4stick", "created": 1627678677, "upvotes": 2}, "h74mn7y": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74mn7y/", "text": "it’s called don’t live in a blue state", "author": "PM_Tits_69", "created": 1627678291, "upvotes": -12}, "h74m6dk": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74m6dk/", "text": "If that's what happens, that's what happens. Nothing we can do about it. Crazy times", "author": "unholymanserpent", "created": 1627678086, "upvotes": 1}, "h74hxoo": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74hxoo/", "text": "I’m a little worried. I’m transferring schools and sadly the school is the state with the highest rates. I told my parents if I get sent home to do online, I’m done. I’ve already tried college online and just can’t. I’m not wasting my money anymore.", "author": "redhill00072", "created": 1627676263, "upvotes": 9}, "h74hjhg": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74hjhg/", "text": "This has definitely been something I've been thinking about a lot for the past week (probably a bit too much if I'm being honest).  I'm about to begin my third year of college, so I have only had a semester and a half of traditional college (which I am very thankful for).  I am also starting my second semester of nursing school, where part of my learning comes from clinical experience. Last semester, our clinical experience was done through simulation on our computer. An absolute joke. We got our clinical placements yesterday, but I fear that as hospitals become full again, students won't be allowed, and understandably so. \n\nBut my school is in an area where vaccination rates are sub 30% and the vaccine is not required for attendance. Masks aren't either (as of now. I expect this to change). I can see no situation where we can safely go back to the way the school was in the Fall of 2019.  Maybe that's just me being pessimistic, but all the literature I've been reading seems to, unfortunately, support that fear.", "author": "viridity12", "created": 1627676096, "upvotes": 88}, "h74h135": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74h135/", "text": "[deleted]", "author": null, "created": 1627675880, "upvotes": 8}, "h74euzn": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74euzn/", "text": "i have been taking them all online. i have high risk family that’s can’t get vaccinated so i don’t want to risk it at all.", "author": "Free_fried", "created": 1627674953, "upvotes": 0}, "h74emk0": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74emk0/", "text": "No chance we have another online semester, but I wouldn’t mind if we did. I liked it that way a lot.", "author": "CastleDasher", "created": 1627674854, "upvotes": 10}, "h74e8yz": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74e8yz/", "text": "Kinda. I am ready to go back to in-person classes, but my parents are worried that I will catch the virus (even though we are vaccinated) and we all get really sick. It is a valid worry since my mom has a weak immune system.", "author": "iamsojellyofu", "created": 1627674696, "upvotes": 5}, "h74e54m": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74e54m/", "text": "I am supposed to start at my new transfer university in the fall. It looks like most classes have both in-person and online options. I would prefer to be back 100% and plan on enrolling in as many in person classes as possible. If it went all online I don’t know what I’d do honestly. This past year has been horrible for me, and finally showed me that I need to go to a different school.", "author": "FreezingDemon", "created": 1627674650, "upvotes": 2}, "h74dvmk": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74dvmk/", "text": "I’m actually hoping for another remote year… but I know I’m in the minority on this", "author": "Feigned_Muay", "created": 1627674539, "upvotes": 14}, "h74dpf1": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74dpf1/", "text": "No it’s all just propaganda. They want you to be scared of nothing. Fake news wont control us", "author": "psychadella", "created": 1627674465, "upvotes": -17}, "h74dgns": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74dgns/", "text": "does it matter? gotta do it either way", "author": null, "created": 1627674362, "upvotes": -1}, "h74d9mq": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74d9mq/", "text": "I am actually seriously concerned about class size restrictions for lab science courses.\n\nI'm literally 1 credit hour away from graduation, and am currently waitlisted for an equivalent course at 3 different colleges via transient admissions.", "author": "TehWildMan_", "created": 1627674277, "upvotes": 22}, "h74ce3d": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h74ce3d/", "text": "Fuck yes. Any sign of remote learning and I swear I'm deferring. Compromising my education for the first year may have been fine as it's basically a blow-off year where I'm from (but I still missed out on the partying and trips away). I'd be seriously concerned about my future career prospects if the garbage quality of education from my first year were maintained though. I don't mind large classes (over 100 people) being online, but anything else seriously needs to be in-person, ESPECIALLY exams. I swear if I have to do an online exam again, I'd seriously freak out. \n\nI know myself too well know from the pandemic and how unmotivated and unfocused I am in online environments. I seriously don't know how anyone manages to be productive, maybe if you are dead certain of what you want to do in the future, but still, the lack of human beings really really wore me down and this is coming from someone who is an introvert. After all, no one can hear you scream if you're feeling depressed in that environment. \n\nI don't even think comutting is really a problem, I mean, if it is by bus, you can quite easily get work done during the commute. It actually really makes me happy as it forces myself to exercise and actually see sunshine. Going by car could be a pain though.", "author": "thegodofeverydamn", "created": 1627673893, "upvotes": 42}, "h749hn6": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h749hn6/", "text": "Since vaccines are out there, I don't think that we'll go back to any lockdowns that we saw in 2020. BUT, it really depends on where you are, what the vaccination rate is, and how stupid people are.", "author": "fruitninja777", "created": 1627672709, "upvotes": 44}, "h746ewc": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h746ewc/", "text": "The vaccine mainly just makes it way less severe.", "author": "ElBarro69", "created": 1627671384, "upvotes": 15}, "h743hw7": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h743hw7/", "text": "Yes. It'll be my senior year. I don't think I can do it tbh. If it's all online I might have to look into taking a semester off of college, but I have no idea what the logistics of that would be.", "author": "Pangolin007", "created": 1627670221, "upvotes": 159}, "h740ubv": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h740ubv/", "text": "I want to say that it wouldn’t happen, but I didn’t think it would happen in 2020 either.\n\nIt largely depends on the area and, unfortunately, politics. My university is unlikely to go remote even if there’s a surge in cases because of governor Abbott. We probably wouldn’t even need to go remote if the student population got fully vaccinated and wore masks, but again… it’s the south. All of the covid rules went out the window this summer.\n\nAt this point the best thing to do is to get vaccinated and stay responsible. I’m still avoiding events with large crowds, wearing my mask around people, etc. If everyone could chip in and do that then there would be less of a chance of going remote again.", "author": "tlacct", "created": 1627669073, "upvotes": 17}, "h73zgmz": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h73zgmz/", "text": "tbh if these arkansas inbreds fuck up another year for us I'll just take another gap year and lie down.\n\nThese same people will shun student loan forgiveness but not see how much their stints are detrimental to quality education. I'm not the one to fear monger but fuck me we're all  fucked if these are the people our government continues to prioritize.", "author": null, "created": 1627668470, "upvotes": 27}, "h73xwgo": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h73xwgo/", "text": "It's already happening for some schools. What state you are in will matter, as well as % vaccinated and if they have guidelines in place for unvaccinated.\n\nI think my school could end up going online again, but it may also stay in-person - it isn't 100% in-person as it is, mostly prioritizing labs and studios. And the guidelines are unvaccinated will be tested weekly and mandatory masking on campus. Those vaccinated follow city guidelines for masking, which atm is back to indoor masking I believe. My school is also providing vaccines/is how I got it. So....I'm hopeful that my small studio classes will still make it through, as the county it is in hasn't spiked much/below the 5% be a decent margin and all the info on new cases significantly being those unvaccinated (although isn't a \"no risk\" for those vaccinated, overall much less severe). I'll take whatever booster they want, do the brain itch tests as much as they want, mask/social distance/etc, just if I can have access to facilities my senior year when I'm doing honors stuff and internships :/", "author": "Hellodeeries", "created": 1627667787, "upvotes": 2}, "h73vwzp": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h73vwzp/", "text": "I think its within the realm of possibility. Most schools are requiring vaccines to be on campus which is helpful, but if it spreads more among vaccinated people like it has been i think the schools may consider another semester online to halt the spread. Its hard to say, i suggest you be prepared for either outcome.", "author": "VanGoghsSeveredEar", "created": 1627666938, "upvotes": 317}, "h73spvo": {"link": "/r/college/comments/ouov8z/anyone_else_seriously_worried_about_an_online/h73spvo/", "text": "While another remote school year is definitely a possibility, there are a few things to consider: a) the intensity of the virus is much lower in those that’re vaccinated, b) if more people get vaccinated, the virus becomes less of a threat, c) most local and state governments are prioritizing an in-person school year, so even if most other things shutdown, we may still have a fully or partially in-person school year (with restrictions such as masks and social distancing). My point is, don’t feel anxious about it (at least not yet lol).", "author": "mowa0199", "created": 1627665574, "upvotes": 106}}}