{
  "sid": "lgxldf",
  "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/",
  "title:": "Does anyone else struggle with the lack of feedback in online learning?",
  "text": "This isn’t another “hate on online learning post”, but i see it as more of a reminder that feedback in person is good. \n\nIn person, your teachers remind you that your quiz is coming up, you should be about done with your project, etc. \n\nWith online learning, i get none of that interaction so it’s all on me to navigate the syllabus and hope I’m doing everything correctly\n\nI had a dream last night that i forgot i was taking another class and i was missing deadlines. So, my fear is that i am missing deadlines when there are no reminders and no one with whom i can discuss the content",
  "author": "cualiysht",
  "created": 1612975170,
  "over_18": false,
  "upvotes": 946,
  "upvote_ratio": 0.99,
  "comments": {
    "gmx0hf8": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmx0hf8/",
      "text": "I missed a quiz 3 days ago because I completely forgot it existed and thought I was scot-free to play one of my games. Only found out today when I got a notification of the ZERO I got on it. So yes, I completely agree with you. That is my only completely online class and I’m always forgetting about it, ngl. It’s the first time I’ve had a class like that AND it’s a subject I don’t enjoy, so I relate to ya.",
      "author": "KitKatVi7",
      "created": 1613030024,
      "upvotes": 1,
      "replies": {}
    },
    "gmwsfhy": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwsfhy/",
      "text": "Every Monday I sit down and go to my schools online platform and I write down on a piece of paper M-F and then click on each class and see exactly what is due on which day. Then I write it down and when I wanna work on it and I go through all my classes doing the same. Then for the rest of the week I wake up and look at my sheet of paper and know what has to get done :)",
      "author": "Mech_Bean",
      "created": 1613023430,
      "upvotes": 3,
      "replies": {}
    },
    "gmwru8o": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwru8o/",
      "text": "Constructive feedback is essential in learning. Follow the link below for tutoring assistance. https://discord.gg/K77FVjEE",
      "author": "MerolineB",
      "created": 1613023002,
      "upvotes": 1,
      "replies": {}
    },
    "gmwpbap": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwpbap/",
      "text": "Most of mine have been posting announcements reminding us what assignments and tests are coming up. I’ve found that super helpful! I also try to put all assignment due dates and test dates on my Google Calendar when we get the syllabus so I can refer back to it throughout the semester.",
      "author": "Songibal",
      "created": 1613021285,
      "upvotes": 1,
      "replies": {}
    },
    "gmwjov3": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwjov3/",
      "text": "Omg I keep having that same dream too!!!! And that I’m about to graduate but suddenly I remember I forgot about that class so I failed the class and can’t graduate. Sooo stressful then I wake up and I realize it’s not real lol",
      "author": "Mkgrigsby29",
      "created": 1613017763,
      "upvotes": 1,
      "replies": {}
    },
    "gmwi73a": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwi73a/",
      "text": "Sometimes but, I supplement lack of communication with zoom calls",
      "author": null,
      "created": 1613016892,
      "upvotes": 1,
      "replies": {}
    },
    "gmwhs70": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwhs70/",
      "text": "As someone who was cyber schooled since third grade, I can say this transition into online learning has been a mess even for me. I just started college this past fall and watching professors who have no idea how to teach online has been frustrating. Of course I don’t hold it against them because they weren’t thrown into this willingly, but I’m just so used to online learning and teachers who have been teaching online for living for years. I guess at least I was prepared?",
      "author": "falafelbug",
      "created": 1613016653,
      "upvotes": 2,
      "replies": {}
    },
    "gmwdjf4": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwdjf4/",
      "text": "Nope, my professors are great. We do housekeeping in the beginning of every class. Maybe talk to your professors about how you would like more feedback during class. Hope it all works out for you.",
      "author": "Alternativefacts23",
      "created": 1613014335,
      "upvotes": 1,
      "replies": {}
    },
    "gmw188r": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmw188r/",
      "text": "I still have the dream and I have not been in college for like 20 years\n\nGo to office hours and get more feedback.\n\nAnd I dont want to be mean, but you should be able to transition to keeping all your stuff straight without people constantly reminding you.\n\nGet a planner.  Not a google calendar but a planner.  So you dont only put in the due dates, but also block out time to do the things.  One of the things in my planner is to do over everything on Monday morning and make sure all my dates are right and everything is in my planner.\n\nSounds old school but believe me it works and it is such a stress relief.",
      "author": "PersephoneIsNotHome",
      "created": 1613008077,
      "upvotes": 4,
      "replies": {}
    },
    "gmw0dvr": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmw0dvr/",
      "text": "My English prof is damn amazing at this. Of course, he's a bit of a boomer, so some of the emails are a tad unnecessary, but I highly value his updates. I just got my first writing assignment back from him, and he recorded a 15 minute podcast-type feedback for me! I just hate the inconsistencies between teachers. Like, my chem prof (also a boomer) doesn't update his students at all outside of class.",
      "author": "ezw_",
      "created": 1613007657,
      "upvotes": 1,
      "replies": {}
    },
    "gmvrfko": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvrfko/",
      "text": "No",
      "author": "TigerBalmES",
      "created": 1613003211,
      "upvotes": 2,
      "replies": {}
    },
    "gmvjkt3": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvjkt3/",
      "text": "I made a google sheet that I update every week with my assignments, their due date, and the priority on a scale of 1-5 and then add conditional formatting to give it a visual presentation of my workload. Let me know if you want the file and I can share it! It saves my life pretty much daily.",
      "author": "infjetson",
      "created": 1612999284,
      "upvotes": 8,
      "replies": {}
    },
    "gmvjjv3": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvjjv3/",
      "text": "Same here",
      "author": "ccambelle",
      "created": 1612999272,
      "upvotes": 2,
      "replies": {}
    },
    "gmvhnj0": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvhnj0/",
      "text": "OMG I HAD THAT DREAM TOO!!! I HAD A DREAM I WAS 6 WEEKS BEHIND IN A MATH CLASS IM NOT TAKING!!",
      "author": "spazbagz",
      "created": 1612998350,
      "upvotes": 3,
      "replies": {}
    },
    "gmvf3uw": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvf3uw/",
      "text": "Lol I had the same dream two nights ago",
      "author": "pokemongofanboy",
      "created": 1612997175,
      "upvotes": 2,
      "replies": {}
    },
    "gmvaugh": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvaugh/",
      "text": "In one of my classes the instructor posts a weekly checklist. It’s incredibly helpful",
      "author": "Emmias",
      "created": 1612995241,
      "upvotes": 2,
      "replies": {}
    },
    "gmv9g7s": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv9g7s/",
      "text": "I feel so bad for you dude. My school has a thing called Canvas, where they put assignments online. You can interact with classmates, look at and submit assignments, attend lectures, online tutoring. I suggest you mention that to a school official.  I’m a returning student after ten years away. So, I’ve been lucky in that I’m not used to classroom learning. I’m actually finding less distractions learning from home and can communicate effectively with my teachers. I think you should email your teacher and let them know your concerns. Good luck to you! I know it’s not easy for everyone who is used to a classroom environment.",
      "author": "dawn-of-pickles",
      "created": 1612994619,
      "upvotes": 4,
      "replies": {}
    },
    "gmv5d2q": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv5d2q/",
      "text": "Yeah. My major is big on 'networking', and I was hoping to meet friends and all that- joined the Habitat for Humanity Club, environment Club, Newspaper Club, tried reaching out to profs and classmates, didn't workout.\n\nJust no one really wants to interact in general now, and especially asynchronous classes where the most you get is a blog post",
      "author": "neverfakemaplesyrup",
      "created": 1612992859,
      "upvotes": 2,
      "replies": {}
    },
    "gmv5a6y": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv5a6y/",
      "text": "Dude I have that dream all the time! Like I signed up for a class I totally forgot about until halfway thru the semester!",
      "author": "scubasam27",
      "created": 1612992823,
      "upvotes": 4,
      "replies": {}
    },
    "gmv523o": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv523o/",
      "text": "This is the ONE thing I dislike about online learning. \n\nI have taken classes online for the last... 6 years of my life? I LOVE IT. I love the free time. I love having my life, time to myself, time to spend in VR rather than in the real world.. \n\nBut. A lack of feedback is bad. It prevents learning. I almost never bother to type out an entire question to a teacher. Just not worth it.",
      "author": "ethancknight",
      "created": 1612992728,
      "upvotes": 3,
      "replies": {}
    },
    "gmv14ua": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv14ua/",
      "text": "I’m currently taking an online creative writing class. I’ve turned in tons of pieces, and have received little to no feedback. It’s a little upsetting.",
      "author": "noble-light",
      "created": 1612991056,
      "upvotes": 3,
      "replies": {
        "gmwp3wa": {
          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwp3wa/",
          "text": "Ironically the worst class I took last semester was CW. The professor is a nice lady but she made a rule you had to keep the camera on and if you turned it off without telling her, it counted as an absence. If you had to leave for whatever reason, you had to tell her. \n\nI felt so infantile telling her I had to use the bathroom or I had to go grab my charger.",
          "author": "CapriciousSalmon",
          "created": 1613021150,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gmv0ddp": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv0ddp/",
      "text": "are you able to contact/email your professors? all my professors are accessible by email, phone and our online system and i’ve found it to be very helpful. sure it’s more work but it works!",
      "author": "xjulesx21",
      "created": 1612990739,
      "upvotes": 4,
      "replies": {}
    },
    "gmuz14z": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmuz14z/",
      "text": "Imo this isn't even an online issue. Teachers should be reminding and sending out emails whether they're in person or not.",
      "author": "bearbarebere",
      "created": 1612990178,
      "upvotes": -5,
      "replies": {
        "gmv6uhj": {
          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv6uhj/",
          "text": "Professor here.  \n\nSo the Syllabus and Schedule and Canvas calendar are insufficient?  We are not your mother/father.  At what stage does this becomes your responsibility to manage your deadlines?  This is not specific to you.  About 10% of my students state you should remind me.  The other 90% seem be able to manage their schedules and meet the deadlines for assignments.",
          "author": "SlightScholar1",
          "created": 1612993498,
          "upvotes": 7,
          "replies": {
            "gmv7gdl": {
              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv7gdl/",
              "text": "I'm sure your students love the compassion you have for them throughout this pandemic!",
              "author": "bearbarebere",
              "created": 1612993760,
              "upvotes": -2,
              "replies": {
                "gmv7uq3": {
                  "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv7uq3/",
                  "text": "Not to get into a debate with you but students suffering real problems such as food insecurity,  financial insecurity,  homelessness, mental health challenges.  They have my compassion and are directed to the appropriate resources.   Students who cannot read a Schedule of due dates - yes you are right very low on the compassion continuum",
                  "author": "SlightScholar1",
                  "created": 1612993931,
                  "upvotes": 5,
                  "replies": {
                    "gmv8q74": {
                      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv8q74/",
                      "text": "I have mental health issues, and reminders would be really nice for when I'm having panic attacks all day and things slip my mind despite reading the calendar. But go off on how you can pick and choose compassion based on how a mental illness presents itself instead of recognizing and rising to the needs of students, I guess.",
                      "author": "bearbarebere",
                      "created": 1612994307,
                      "upvotes": -4,
                      "replies": {
                        "gmvmxz8": {
                          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvmxz8/",
                          "text": "Can you set up some sort of system of reminders for yourself?  \n\nThat’s a personal responsibility and not outside the realm of what is expected for a college student. \n\nWhen you are employed someday...I’m sure you won’t expect your employer to remind you of due dates for projects and so on. \n\nI think the professor has a point.  The professor presumably is preparing you for the workplace.",
                          "author": "inadarkwoodwandering",
                          "created": 1613000952,
                          "upvotes": 5,
                          "replies": {}
                        },
                        "gmwhmqt": {
                          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwhmqt/",
                          "text": "Most of us have mental health issues. I have clinical depression and anxiety disorder along with dyslexia and ADHD, among other physical health issues. Take some personal responsibility and keep up with your work. I don’t get compassion from students, and I don’t expect it because this isn’t an issue of compassion. Turns out, we are actually all in a pandemic and have been for a year.",
                          "author": "DrSameJeans",
                          "created": 1613016566,
                          "upvotes": 2,
                          "replies": {
                            "gmwq7po": {
                              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwq7po/",
                              "text": "Do you really think you don't get compassion for students? Perhaps you don't, since you don't give them any.",
                              "author": "bearbarebere",
                              "created": 1613021882,
                              "upvotes": 0,
                              "replies": {
                                "gmxt9kl": {
                                  "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmxt9kl/",
                                  "text": "Reddit needs a laugh reaction.",
                                  "author": "DrSameJeans",
                                  "created": 1613052702,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "gmvp6go": {
                          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvp6go/",
                          "text": "That’s the thing about online classes. If you were in person you’d easily have classmates who would remind each other...or your professor would say in person hey don’t forget about that assignment!",
                          "author": "inadarkwoodwandering",
                          "created": 1613002078,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gmuwqoh": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmuwqoh/",
      "text": "It’s 100 times worse for me because I am a very forgetful person",
      "author": "QuickCoyote097",
      "created": 1612989185,
      "upvotes": 0,
      "replies": {}
    },
    "gmus4vi": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmus4vi/",
      "text": "I have one professor who assigns all her readings and weekly assignments at the beginning of the semester and then doesn't teach or grade anything until the last week of classes. And this is the second time I've had her- it's infuriating.",
      "author": "SnowOverRain",
      "created": 1612987224,
      "upvotes": 4,
      "replies": {}
    },
    "gmupgfl": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmupgfl/",
      "text": "Professor's perspective: we were being told in the spring and fall that students were being bombarded with Canvas notifications and the like, and that we should be sparing about how much we send out reminders and information to the whole class (and instead create well-organized Canvas pages where students don't have trouble finding this info themselves). Whether that's really true, I don't know. I continue to send out reminder announcements 2x/week for my smaller classes, but I've tried to avoid it in larger ones.",
      "author": "Frequent_Yam_6711",
      "created": 1612986089,
      "upvotes": 32,
      "replies": {
        "gmvgyez": {
          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvgyez/",
          "text": "When it's one or two classes giving updates and such it might not be too distressing to get reminders. I think it generated anxiety in a lot of people, especially last Spring, because it's a big shake up from the way things are usually done and suddenly much more information is being conveyed via email. Plus, depending on the prof, updates might come sporadically so it very quickly begins to feel like one must be constantly on the lookout for updates or information.\n\nIn person with regular reminders as OP referenced is very regular, as in you get them at the same time every week consistently. There aren't any 1AM emails full of crucial information for one's success in the course.",
          "author": "Suchofu",
          "created": 1612998019,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gmunzgp": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmunzgp/",
      "text": "Agreed. I've missed so many assignments these last 2 semesters from pure confusion or oblivion to when they're due, and I've also missed many important statements from professors on assignment requirements. I'm diagnosed with severe ADHD and I'm extremely scatterbrained. The reminders you mentioned come naturally when taking in person classes, and now they're just nonexistent. I relied so heavily on them and not having them has been extremely detrimental to my academic performance.  \n\nIt also doesn't help that professors are using a million different websites for assignments, homework, and tests. They all organize their Canvas pages differently. Last night it literally took me half an hour to \"find\" all my assignments for the week and write them down in my planner. I hate it.",
      "author": "tacothetacotaco",
      "created": 1612985467,
      "upvotes": 22,
      "replies": {
        "gmx5042": {
          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmx5042/",
          "text": "So relatable. Feels like a piece of my soul dies when I have to spend so much of my life just finding the assignments & plugging them into the planner",
          "author": "_wooop",
          "created": 1613034226,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gmug5ey": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmug5ey/",
      "text": "Go through your syllabus and put everything in your calendar. Set reminders on your phone.",
      "author": "DrSameJeans",
      "created": 1612982188,
      "upvotes": 52,
      "replies": {
        "gmulkk9": {
          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmulkk9/",
          "text": "I do this. But what I’m also referring to is that fact that some assignments aren’t even being graded. How do i know I’m doing a good job on my discussion posts (when they’re not just participation) when i receive no feedback until the end of the semester?",
          "author": "cualiysht",
          "created": 1612984456,
          "upvotes": 64,
          "replies": {
            "gmv0mj3": {
              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv0mj3/",
              "text": "all my professors grade assignments within a week or week and a half. if your work is not graded until the end of the year 1. that’s odd 2. id just reach out to your teachers and ask if they can give you feedback so you know you’re succeeding.",
              "author": "xjulesx21",
              "created": 1612990843,
              "upvotes": 10,
              "replies": {
                "gmvp4dz": {
                  "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvp4dz/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1613002048,
                  "upvotes": 3,
                  "replies": {
                    "gmwng3y": {
                      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwng3y/",
                      "text": "That’s not luck. Turnaround time for assignments to be graded should be 2 weeks or less. If a prof isn’t grading near that time frame, it’s time to talk to the prof. Tell them you need the feedback because you don’t feel comfortable starting the next assignment until you know what/how you did on the one before. If they’re continuing after that, you may have to talk to the coordinator/chair. My students get their grades within a week, many times just hours after it’s due.",
                      "author": "obvthrowawaybecause2",
                      "created": 1613020071,
                      "upvotes": 3,
                      "replies": {
                        "gmxgzpu": {
                          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmxgzpu/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1613045080,
                          "upvotes": 2,
                          "replies": {
                            "gmxkixx": {
                              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmxkixx/",
                              "text": "Yikes I’m sorry. That sounds like a situation that does need to be brought to the coordinator or chair. I’m usually against all these “go to the Dean” responses right off the bat. Prof first, then coord/chair. Either way this needs an escalation. We don’t have a policy, but I stated mine personally and it’s fairly universally understood. But those responses so late in the game- sounds like something needs to go higher here",
                              "author": "obvthrowawaybecause2",
                              "created": 1613047657,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gmutmbk": {
              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmutmbk/",
              "text": "In the case of feedback for grades, you should definitely be getting it and should push until you do.",
              "author": "DrSameJeans",
              "created": 1612987860,
              "upvotes": 5,
              "replies": {}
            },
            "gmv5tbx": {
              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmv5tbx/",
              "text": "I have had this issue with a couple professors since the Covid semesters have been online. I honestly prefer the online classes, but not getting feedback in a timely manner is detrimental to my learning the material effectively. \n\nCurrently, my diff eq prof grades everything within a week or so, but the only feedback we get is a number grade. Like, how am I supposed to correct the mistakes I'm making if I don't know what they are. I tried emailing him to ask him if he was going to return graded work, but he never even bothered to reply back.",
              "author": "Dont_Blink__",
              "created": 1612993056,
              "upvotes": 3,
              "replies": {
                "gmwns6m": {
                  "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwns6m/",
                  "text": "Written feedback is much harder to do in online classes for us. My students know if they want to talk over an assignment I’m happy to do so via zoom. I stay after and log in early every day in case anyone needs me. I’m very happy to talk to them about it, there’s just no way I can type that much on hundreds of assignments, per assignment, and end up making more than 2$/hr for time spent working. Or sleep. We have hundreds of students.",
                  "author": "obvthrowawaybecause2",
                  "created": 1613020287,
                  "upvotes": 1,
                  "replies": {
                    "gmwpmcm": {
                      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwpmcm/",
                      "text": "That’s fair. However, he does his zoom classes from his ipad, which makes me wonder how difficult it would be to download some software and get and Apple Pencil and mark it up on his ipad. Then he just has to send back the marked up pdf. I’ve had other professors do this and it didn’t seem to be any extra trouble for them.",
                      "author": "Dont_Blink__",
                      "created": 1613021490,
                      "upvotes": 1,
                      "replies": {
                        "gmxl93f": {
                          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmxl93f/",
                          "text": "I grade from my iPad, and it depends on the submission type. I can’t mark on everything. But marking up writing assignments is still a huge pain on the iPad having to zoom in and out for every little thing I have to write that it’s at least 10 min for every 300 words. That’s a helluva long time when you multiply that. And who gets apple pencils?? I set up my tiny corner of my bedroom that was free so I could teach better online. Office desk, chair, whiteboard, markers- guess who paid for that? I’m not getting reimbursed either.",
                          "author": "obvthrowawaybecause2",
                          "created": 1613048146,
                          "upvotes": 1,
                          "replies": {
                            "gmxoiyk": {
                              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmxoiyk/",
                              "text": "I really do understand that this situation isn’t ideal for any of us, I’d just like to feel like my profs are putting as much effort into the classes the teach as I do as a student. After the first semester went online last year and I realized that this was likely going to be the situation for the long haul I bought a monitor. Trying to do synchronous Zoom classes at the same time as trying to do the in-class exercises on the required software that is usually supplied by the school on their computers wasn’t working very well for me. I didn’t get reimbursed for the monitor or the software we were required to have (MatLab, Multisim, etc), but it was worth it to do as well as possible in the situation.",
                              "author": "Dont_Blink__",
                              "created": 1613050155,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gmw1gcg": {
              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmw1gcg/",
              "text": "That is not cool.\n\nYou should have timely feedback.\n\nIf you aren’t getting things back ask the prof for office hours to go over how you are doing.",
              "author": "PersephoneIsNotHome",
              "created": 1613008190,
              "upvotes": 1,
              "replies": {}
            },
            "gmwp1q2": {
              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwp1q2/",
              "text": "Have you asked for feedback?",
              "author": "yogaccounter",
              "created": 1613021110,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gmu8bff": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmu8bff/",
      "text": "I think that professors should do a \"weekly reminder\" post where they record themselves giving a reminder of what is due and what they will be working on. I hate how teachers say they miss teaching in person but yet they make no strive to do anything through online learning. Just a thought I've given a few professors. One actually went along with it!",
      "author": "Equal-Building4177",
      "created": 1612978947,
      "upvotes": 19,
      "replies": {
        "gmvro47": {
          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvro47/",
          "text": "Recording a video is NOTHING like teaching in person. Literally nothing like it at all. It’s soul crushing for someone like me who loves that live interaction back and forth with students. Recording lectures fucking sucks.",
          "author": "IthacanPenny",
          "created": 1613003329,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "gmu6jb9": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmu6jb9/",
      "text": "My professors have been trying to combat this by consistently emailing us updates about classes. It’s been super helpful thus far!",
      "author": "nonconformistnugget",
      "created": 1612978205,
      "upvotes": 160,
      "replies": {
        "gmwath2": {
          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwath2/",
          "text": "I have a professor who emails us 5 times a day and I want to strangle him",
          "author": "BikeBonanza",
          "created": 1613012901,
          "upvotes": 36,
          "replies": {
            "gmwp2ew": {
              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwp2ew/",
              "text": "Everyone in the class should reply to every single e-mail saying \"Thanks!\" until he tells you to stop.",
              "author": "TheAllyCrime",
              "created": 1613021123,
              "upvotes": 22,
              "replies": {}
            }
          }
        },
        "gmx1lxn": {
          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmx1lxn/",
          "text": "I wish.  I have a prof that never emails me back.",
          "author": "themedicduck",
          "created": 1613031050,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gmu2pft": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmu2pft/",
      "text": "This is why I prefer teaching synchronously.  My students seem to have a better time keeping up with their work...",
      "author": null,
      "created": 1612976571,
      "upvotes": 175,
      "replies": {
        "gmurkeh": {
          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmurkeh/",
          "text": "It definitely has partially due to the fact that in person has way more accountability I feel like. Online classes don’t even feel totally real sometimes",
          "author": "90Degrees_Ankle_Bend",
          "created": 1612986982,
          "upvotes": 84,
          "replies": {
            "gmvmfa7": {
              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvmfa7/",
              "text": "Absolutely, sometimes I dissociate so bad I start wondering whether I'm actually studying in university and I have academic responsibilities.. and whether there will be actually bad consequences if I don't work hard",
              "author": "Pleasant_Savings_256",
              "created": 1613000693,
              "upvotes": 30,
              "replies": {}
            },
            "gmvr62s": {
              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvr62s/",
              "text": "It’s almost like requiring cameras on synchronous classes should be a thing. Not that students would agree with this. But you see the point.",
              "author": "IthacanPenny",
              "created": 1613003078,
              "upvotes": 1,
              "replies": {
                "gmvxt5t": {
                  "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvxt5t/",
                  "text": "as much as I'd hate it, got to admit it seems to be very helpful to make students turn on cameras to encourage them to participate. still feels unfair tho\n\n**possibly poor wording. i only said it feels \"unfair\" in the context of students having a hard time with online classes as it is",
                  "author": "croissantboo",
                  "created": 1613006394,
                  "upvotes": 8,
                  "replies": {
                    "gmvyyyw": {
                      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmvyyyw/",
                      "text": "Why does it feel unfair? Students bitch and moan when I try to teach with my camera off and only communicate via the chat function. They bitch and moan because being a blank silent square on the screen is totally ineffective for learning. Why is the onus only on me as the teacher? I get that it might be annoying, but it hardly seems “unfair”.\n\nE: oh so students don’t like being called out for being jerks? Because that’s what you’re doing by ghosting during class. YOU ARE A JERK. And if I try the same behavior you finally get how I feel. It’s AWFUL teaching to a blank screen. I feel dehumanized. And you immature assholes are talking about how “unfair” it all is. GROW UP.",
                      "author": "IthacanPenny",
                      "created": 1613006957,
                      "upvotes": -13,
                      "replies": {
                        "gmwcc1g": {
                          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwcc1g/",
                          "text": "why do you talk about your students like that",
                          "author": "croissantboo",
                          "created": 1613013690,
                          "upvotes": 18,
                          "replies": {}
                        },
                        "gni3u05": {
                          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gni3u05/",
                          "text": "Holy shit you’re a nutcase, I bet all of your students hate you.\n\nI guess they let anyone become a teacher, especially this grouchy fuck",
                          "author": "I_Was_Tom",
                          "created": 1613363595,
                          "upvotes": 2,
                          "replies": {
                            "gni3xzj": {
                              "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gni3xzj/",
                              "text": "YOU are the problem. GROW THE FUCK UP. Blocked.",
                              "author": "IthacanPenny",
                              "created": 1613363664,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gmwjoxu": {
          "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmwjoxu/",
          "text": "Yes! It’s the lack of structure that creates the suffering for me.. also I’m just way too good at procrastinating. I have 4 zoom meetings and a lab I go to for 1 hour each week.. it’s not enough actual interaction for 15 credits. My grades have thus dipped by my laZhead",
          "author": "zzzrem",
          "created": 1613017764,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gmu2aah": {
      "link": "/r/college/comments/lgxldf/does_anyone_else_struggle_with_the_lack_of/gmu2aah/",
      "text": "I sometimes struggle with lack of feedback as a Computer Science major. I guess it forces me to find creative solutions and look online. Silver linings I guess. I have no problems with due dates though because the Canvas dashboard has all upcoming due dates conveniently organized.",
      "author": "Serious_Place7216",
      "created": 1612976391,
      "upvotes": 5,
      "replies": {}
    }
  },
  "updated": 1634057368
}