{"sid": "px3vcq", "link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/", "title:": "I’ve just realized I don’t think I’m gonna be able to pay for college", "text": "I was talking to my parents a bit ago and I had an idea of getting a commercial pilots license to have a stable job to pay for school, (for context where I live it would cost around 45k to do so) and they said there isn’t that much money in the college savings. If college at my university is 10k a semester how on earth am I expected to do 4-5 years of school?? Sorry I’m just panicking a bit and i don’t know what to do.", "author": "Cppnv", "created": 1632826668, "retrieved": 1632945385, "over_18": false, "upvotes": 30, "upvote_ratio": 0.93, "comments": {"henojs2": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/henojs2/", "text": "Try going to a local community college for the first 2 years then transfer to a university. \n\nAlso try to continuously apply for scholarships and grants from the college or university you are attending and from credible outside sources (the coca cola scholarship is an obscure one). Keeping your grades high will greatly help with trying to get scholarships and grants. \n\nIf you live in the usa I heard about this thing where you fill out this form for the government and they can refund the amount you payed for college. Though please research this further and speak to a trusted and credible official.\n\nTry and save money where you can, like renting your textbooks or finding them for free safely online, whatever fits your needs.\n\nYou can talk to your college counselor for more info about about this.\n\nI hope you succeed in your endeavors.", "author": "Hinewmemberhere", "created": 1632871657, "upvotes": 3}, "henkm2h": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/henkm2h/", "text": "You get any Financial aid? Grants?", "author": "Own-Maximum-2087", "created": 1632869821, "upvotes": 1}, "hendqes": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/hendqes/", "text": "Adding to what everyone else has said here, a lot of colleges offer merit based scholarships. Research colleges and what breaks they can give you.", "author": "LenoraNoble", "created": 1632866663, "upvotes": 1}, "henc5wz": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/henc5wz/", "text": "Apply for scholarships and grants first. \nThan I would look into taking out education loans. \nSee if you can a side hustle or gig.", "author": "gtfopx", "created": 1632865964, "upvotes": 1}, "henb841": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/henb841/", "text": "I swear I’ve seen scholarships for aviation maybe you should check that out. Consider community college if you want to save some money.", "author": "artificiel_fraise", "created": 1632865551, "upvotes": 1}, "hemmqur": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/hemmqur/", "text": "Why wouldn’t you just get the license and join the workforce? Seems like you already have an awesome career planned out, without the need to pay for college.", "author": "senoroito", "created": 1632855065, "upvotes": 3}, "hemhjx2": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/hemhjx2/", "text": "Two options:\n\n- go to community College for a couple years while working\n\n- come to the midwest, its far cheaper to attend/Travel out of state here than instate somewhere else. I believe Missouri and Kansas schools are fairly cheap.", "author": "awaywind25", "created": 1632852919, "upvotes": 1}, "helu1sd": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/helu1sd/", "text": "You could join the national guard or reserves if that's possible for you.", "author": "Super-Sale-501", "created": 1632843263, "upvotes": 1}, "helsl3u": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/helsl3u/", "text": "That’s because most college students take loans. Community college for two years then transferring is another great way to save money.", "author": "kizeltine", "created": 1632842655, "upvotes": 1}, "helq9ft": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/helq9ft/", "text": "You can:\n \n-Apply for scholarships/grants\n\n-Take out loans \n\n-Get a part-time job (like you said)\n\n-Go to a cheaper college, perhaps a local community college for your first two years and then transfer to a local 4-year college", "author": "Awesome_Day123", "created": 1632841684, "upvotes": 18}, "helgazz": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/helgazz/", "text": "Are you in the US? A commercial pilot’s license alone won’t get you a job without experience. I’ve had mine since April. I’m minutes away from my flight instructor checkride and hopefully I pass this and can start teaching people how to fly. But instructors only make $20-25/hr on average so it still isn’t much. And that’s only per billable instruction hour. So it really translates to $15/hr", "author": "microfsxpilot", "created": 1632837360, "upvotes": 6}, "heleruw": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/heleruw/", "text": "My parents both make over six figures and I was able to get subsidized and unsubsidized loans through FAFSA... I’m fairly confident you can as well!\n\nObviously unsubsidized loans aren’t ideal, but if you want to go..", "author": "NoRadish5386", "created": 1632836667, "upvotes": 2}, "hel1oto": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/hel1oto/", "text": "also with a commercial pilots license- ud have to be traveling all the time. Im almost certain you cant chose when to fly/when not to fly since you have to sign a contract with an airline. so even if you did get a commercial pilots license, you would not be able to attend college.", "author": "_deathitself", "created": 1632829693, "upvotes": 24}, "hekxuwn": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/hekxuwn/", "text": "Loans are never a thing people want to talk about but that is always an alternative. Try to see if you can get federal loans before having to resort to private if you can’t find any other source of funding.", "author": "TheNameIsZander", "created": 1632827115, "upvotes": 15}, "hekxo7x": {"link": "/r/college/comments/px3vcq/ive_just_realized_i_dont_think_im_gonna_be_able/hekxo7x/", "text": "Why is living expenses 45k a year as a college student? Where do you live?!", "author": "Concerned-23", "created": 1632826982, "upvotes": 15}}}