{"sid": "m3hu5n", "link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/", "title:": "With many universities opting out of Spring Break due to COVID, how can students take a much needed mental break from school without falling behind in coursework?", "text": " When this semester started, I followed a pretty strict routine I set up for myself so that I could achieve everything I wanted to in a day and stay on top of my school work. Recently, I have felt my motivation start to decline but I still have eight weeks left in the semester. I am not trying as hard as I should and I am becoming a little lazier. I feel like this weekend I need a \"hard reset\" if that makes sense to ground myself a little to make sure I stay motivated and on task and so that I  don't crash and burn too early. Any and all suggestions are appreciated!", "author": "filipinoferocity", "created": 1615556709, "retrieved": 1632947379, "over_18": false, "upvotes": 977, "upvote_ratio": 0.99, "comments": {"gr2b19z": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gr2b19z/", "text": "As strange as it may sound to some of the more secular students, I'd advise taking a page out of Genesis. God took a day off after Creation and rested, basking in the goodness of His work. This is where the Sabbath day comes from and it's not just something for spiritually-minded people. Humans, from this perspective, are literally not built to work non-stop and need to rest (and I know there are tons of research materials that will back me up on this). So, regardless of how you spend that day, take a day every week for yourself and do something to relax your body, mind, and spirit. If need be, work ahead during the week to provide yourself that time. And, for what it's worth, I'll be praying for all of us students. Hope you have/had a great day!", "author": "RagingKK", "created": 1615848641, "upvotes": 1}, "gqubr5j": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqubr5j/", "text": "My school is encouraging professors to observe 1 day per month as a rest day and not hold classes, but there is no formal requirement that they do, so most of the time we just end up having class anyway. And even if you don't, there's always some piece of homework due soon. \n\nJust gotta make it til May and then I can graduate into a global recession, yay!", "author": "Dchaney2017", "created": 1615674600, "upvotes": 1}, "gqu7nrs": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqu7nrs/", "text": "honestly my poor ass always used spring break to catch up on school work..wtf with them cancelling it.", "author": "ZombieIsLost", "created": 1615672288, "upvotes": 1}, "gqsp0wo": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqsp0wo/", "text": "College looks more and more like a goddamn scam every day", "author": "TheSpaceNewt", "created": 1615642166, "upvotes": 1}, "gqsn47r": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqsn47r/", "text": "Go fishing. Head down to local tackle shop, pick up a combo for like forty bucks and spend the afternoon catching fish. Best decision you’ll ever make I guarantee it.", "author": "Empty_Tree", "created": 1615640765, "upvotes": 1}, "gqsn3x4": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqsn3x4/", "text": "It's been a tough semester. Motivation in steady decline, work load unreal. We had a meeting the other other day with our program chair and they were going on and on about how important self care is while totally ignoring the fact that we have a absolute mountain of big term projects due all within the same three day period, on top of all the other midterms, lab write ups, and assignments we are to complete in the meantime. Sometimes I look at my to do list and just break down completely. But I keep telling myself this is the homestretch and if I can just get through the next 6 weeks things will get better.", "author": "maexx1983", "created": 1615640759, "upvotes": 1}, "gqrwmll": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqrwmll/", "text": "Our spring break was one Tuesday we didn’t have class. I only have one class on Tuesdays but all my papers were still due. Not much of a break.", "author": null, "created": 1615615074, "upvotes": 1}, "gqri18u": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqri18u/", "text": "This is usually what helps me.  I like to watch videos from people like Dave Ramsay who speak about legitimate success stories (not a fake guru with fake stories), the way he talks about success and saving money and being financially free one day motivates me.  How being disciplined now while you’re younger and mentally and physically able, will let you live a more relaxed life later.  Thinking about my future and the reasons for going to school in the first place.  Hope I helped 💪🏼", "author": "weeese77", "created": 1615605183, "upvotes": 1}, "gqr7dhl": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqr7dhl/", "text": "You don't and the schools don't care.", "author": "ziggs_ulted_japan", "created": 1615598925, "upvotes": 0}, "gqr595d": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqr595d/", "text": "I really, really hate how my school opted out of spring break this semester due to Covid. \n\nHere’s the thing: they tested all of the students when we arrived here in August. Why can’t they do it after spring break?", "author": "RandomRedditor44", "created": 1615597694, "upvotes": 1}, "gqr4yeo": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqr4yeo/", "text": "Idk I’m pretty deep into the crash and burn already. Fortunately one of my classes doesn’t have late penalties and only one has exams, but damn, I’m still struggling.", "author": "Ilaxilil", "created": 1615597521, "upvotes": 1}, "gqr3lue": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqr3lue/", "text": "as someone who did not get a spring break, i’m struggling to find ways to chill. i’m a nursing student so i feel like i’m constantly pushing even on those joke “wellness wednesdays” my school did in place of long weekends and spring break (yes, 2 wednesdays in the middle of the week where we don’t show up for lectures are expected to replace all long weekends and spring break). literally just don’t do anything for 2 days. i forced myself to make those 2 days of progress in a few days before i take a break, and you kind of have to make up for it after, but it feels better than pushing till you burn out. socializing with my friends and enjoying some much needed time away from the screens outside helps me.", "author": "dancing_grass", "created": 1615596740, "upvotes": 1}, "gqr2diq": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqr2diq/", "text": "Honestly my college’s spring break never mattered to professors of online classes anyway and we still had work due throughout the week", "author": null, "created": 1615596026, "upvotes": 1}, "gqr1ykn": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqr1ykn/", "text": "My school had a mental break week where they scheduled fun activities/guest speakers every day of the week and class was optional. Teachers weren't allowed to assign homework. Pretty chill week honestly! Small college.", "author": "Delusionanal", "created": 1615595790, "upvotes": 1}, "gqqxir9": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqxir9/", "text": "Haha my school had spring break and I went to Florida, went to the clubs, restraunts, bars, beaches tiki bars and parties.", "author": "jgpdvs", "created": 1615593270, "upvotes": 1}, "gqqx2nm": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqx2nm/", "text": "What about an activity every day that you really love? Video game, athletics?", "author": "GrannyGrunge", "created": 1615593021, "upvotes": 1}, "gqqsj4e": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqsj4e/", "text": "I failed my first Calculus midterm, but I am determined to make a comeback. Honestly, if the universities were going to shortened the semester the least the professors can do is get adjust the curriculum to what is MUST NEEDED TO KNOW rather than trying to touch everything in such a short period!", "author": "Romano16", "created": 1615590526, "upvotes": 1}, "gqqsf57": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqsf57/", "text": "I would have thought that classes would give more leniency in how many days you can miss, but nope! They're more strict. In all of my classes you can only miss 1 day without getting your grade marked down, as opposed to 2-3 when classes were in-person.", "author": "21Hammers", "created": 1615590466, "upvotes": 1}, "gqqscwu": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqscwu/", "text": "It’s really hard.... I don’t think It’s fair, the breaks get shorter and shorter to the point I don’t even feel rested or motivated coming into a new semester", "author": "KN1GH7F4LL", "created": 1615590431, "upvotes": 2}, "gqqrz9f": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqrz9f/", "text": "I would still take a break lol. I'd work hard for a few days and get ahead in classes. Missing a few the following days is acceptable to me in a situation like that. I mean, it's really more on the university than the student and I would not feel bad missing them.", "author": "br1039", "created": 1615590226, "upvotes": 1}, "gqqrjll": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqrjll/", "text": "I force myself to finish all my work so that I can take either Saturday or Sunday off.We all need one day a week to decompress from the workload!!", "author": "gpgc_kitkat", "created": 1615589996, "upvotes": 2}, "gqqpzck": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqpzck/", "text": "Everybody, remember to take breaks when you need it and do stuff you enjoy to relax. I believe in you guys.", "author": "JasonT613", "created": 1615589166, "upvotes": 1}, "gqqp1m0": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqp1m0/", "text": "I occasionally like to sacrifice an hour or 2 of sleep to play video games. Really helps me to de-stress even though it seems irresponsible.", "author": "toofeduptocare", "created": 1615588671, "upvotes": 1}, "gqqn1wv": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqn1wv/", "text": "[removed]", "author": null, "created": 1615587633, "upvotes": 1}, "gqqkqgj": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqkqgj/", "text": "my “break” was when the school network was down for two whole days after a massive ransomware attack and i had access to 0% of my assignments and all school services\n\nhonestly i just took a day last weekend where i did homework, ordered takeout, got drunk and watched movies which helped me reset my brain a bit", "author": "MintyMinccino", "created": 1615586447, "upvotes": 5}, "gqqkbmq": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqkbmq/", "text": "I'd try talking to professors about this. It would probably vary, but I missed 3 days of attendance-mandatory class this past week because of mental stuff. My professor was very understanding.", "author": "SilverTrireme", "created": 1615586239, "upvotes": 1}, "gqqkarm": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqkarm/", "text": "I’ll get back to you on that after this assignment", "author": "ViridianNott", "created": 1615586228, "upvotes": 1}, "gqqibjx": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqibjx/", "text": "My school (William & Mary) gave us 5 \"spring break days\" staggered all over the semester. So far we've had two. Not going to lie, it is actually pretty nice getting a day to relax and recharge before having to worry about school work. If you feel you need to reset, I absolutely suggest you do so. Go outside and walk. Find a safe, outdoor activity to do in your neighborhood. Most importantly, relax! This is a tough time for all college students and we all need a break once in a while.", "author": "jgeorge20", "created": 1615585261, "upvotes": 1}, "gqqg8zf": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqg8zf/", "text": "I suppose they expect we’ll cut off our personal and social lives to compensate for the work load.", "author": "TheZarcFiles", "created": 1615584249, "upvotes": 1}, "gqqf9ht": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqf9ht/", "text": "I got injured and got two weeks off", "author": null, "created": 1615583772, "upvotes": 1}, "gqqetx4": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqetx4/", "text": "Spring break or no spring break, I'm still assigned a fuckton of projects during that time so really makes no difference.", "author": "DjSzymek", "created": 1615583563, "upvotes": 7}, "gqqej7r": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqej7r/", "text": "My school is doing “instructional” days where we just have the day off from class. I guess there are five of them sprinkled throughout the semester. Today is one of them, as a matter of fact. My girlfriend’s school is doing a week, still in school, but no homework or tests will be assigned.", "author": "k_hand", "created": 1615583419, "upvotes": 1}, "gqqcz1w": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqcz1w/", "text": "Getting out and spending time in nature has helped me refocus! There’s something about walking a trail or sitting next to a pretty view that refreshes my brain!", "author": "Accurate_Pumpkin8383", "created": 1615582687, "upvotes": 1}, "gqqbnzw": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqbnzw/", "text": "Well, I don’t get a spring break this semester, but this is what I’ve been doing. I do class work 6 days a week and pick one day to do absolutely anything EXCEPT work. Kinda works as a reset for me. A day off I guess.", "author": "Gumydenrures", "created": 1615582078, "upvotes": 1}, "gqqbaa3": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqqbaa3/", "text": "So, I don't have a real answer for you and I myself am suffering from burnout at the moment. My strategy has been to knock out a few hours of work every night, except one in which I do absolutely nothing towards school, and on the weekends I grind the entire days away, and every hour or two I take a small break, walk the dog, play a few rounds of a video game, and then get back to it. Sundays usually end up with me working from noon till midnight to meet deadlines. I could probably balance things better but between work 30+ hours a week and school I'm exhausted. After an 8-10 hour shift I really don't have the energy to do much more than an hour or two of class work.", "author": "EyePlayFantasy", "created": 1615581900, "upvotes": 3}, "gqq9sfl": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqq9sfl/", "text": "Luckily I go to a small school, we still have spring break.", "author": "NoSpaceAlien", "created": 1615581190, "upvotes": 2}, "gqq7g2k": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqq7g2k/", "text": "You guys got spring breaks in higher education? In Russia it's 2 months in summer and seweral weeks in February if you're bad, or ~ 2.5 months in summer+ January-half February if you pass everything in advance, which is possible and what I've totally done while in the uni. Plus state holidays ofc, one in February, Women's Day, Labor Day and Victory Day, Russia day in June snd another holiday in November.\nSpring breaks were only a thing in school.", "author": "Cerg1998", "created": 1615580088, "upvotes": 2}, "gqpy8fe": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpy8fe/", "text": "Just go to Florida they’re open for business. It’s gonna be lit", "author": "argentiniansigma", "created": 1615575810, "upvotes": -4}, "gqpxq8c": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpxq8c/", "text": "Northern Arizona University and all other big colleges besides community colleges in Arizona do not have a spring break. I wish I at least got 3 days off to be able to relax with no homework.", "author": "nbeaudry00", "created": 1615575577, "upvotes": 3}, "gqpwlqf": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpwlqf/", "text": "You don’t. Colleges don’t give a shit. Maybe you have counseling services you can utilize or an understanding professor. Otherwise, they have this archaic mindset that work needs to be continuous and nonstop.", "author": null, "created": 1615575070, "upvotes": 20}, "gqpsrad": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpsrad/", "text": "I visited my friend Sunday - Wednesday which made me feel so rejuvenated .. slacked a little but I finished my work this week. I now feel prepared to grind harder next week and put forth more effort.", "author": "revoltingslut", "created": 1615573340, "upvotes": 3}, "gqprpwa": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqprpwa/", "text": "Yeah. I gave up on the idea of weekends long ago. I think our culture is too obsessed with productivity to the point that we are miserable. College shouldn’t be as stressful as it is. We need more breaks. And reduced workload. Our culture only encourages unhealthy habits when young adults leave for the workforce, and they learn these habits in college. Workaholism is not what we should be striving for. Balance is so much more important for productivity.", "author": "QuickEquivalent0", "created": 1615572876, "upvotes": 18}, "gqpqxd8": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpqxd8/", "text": "This is gonna sound really dumb but just take a few hours for yourself everyday. I’ve started taking a book and going to the local Barnes and Noble cafe, sitting down and having a coffee there and just kinda enjoy existence for a little bit.", "author": "Scoruge", "created": 1615572522, "upvotes": 8}, "gqpqm1t": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpqm1t/", "text": "[deleted]", "author": null, "created": 1615572381, "upvotes": 24}, "gqpq8cn": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpq8cn/", "text": "Do an activity that does not allow work to be possible. \n\nFor example If you spend the day relaxing at home, there is a possibility for you to still work, and your mind and emotions will bug you about it, and therefore it is not that hardcore break you’re looking for. \n\nInstead, doing something like a full day hike, a spring camping trip, a long drive, or a cooking class will make you really feel like you’re day is not another college workday. And that feeling is the important part. \n\nCheers. It worked for me, I hope you find what works for you.", "author": "splash_dash", "created": 1615572210, "upvotes": 4}, "gqpoys5": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpoys5/", "text": "Honestly, as a senior it's hard to really push myself to find a break or work hard this last semester. But what I would say is that you should plan and stick to it for a chance at a break. My college is going to have a three day weekend and I'm pushing myself this weekend and next week to get ahead and then try to relax for a bit. I'm honestly not sure because it's still so stressful to think about no genuine breaks that won't be packed with homework.", "author": "TiredExpression", "created": 1615571646, "upvotes": 7}, "gqpmwkh": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpmwkh/", "text": "Honestly last year's spring break was suuuper stressful for me with all the papers I had coming up, I keep telling myself it would be the same this year. I think for me though I always let myself have a friday of freedom when I'm done with my classes...my work for Monday can start over the weekend.", "author": "nizzy090", "created": 1615570724, "upvotes": 3}, "gqpm2wu": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpm2wu/", "text": "If you can (depending on your major and year) try and take the class after a test off. I never knew about this before I met my boyfriend (now fiancé) my freshman year. At first I was going to every single class every single week. He told me there’s no need to go the class directly after a test because they won’t give any important information and even if they do you have plenty of time before the next text to grab that info. This is a good way to take some small breaks often instead of one long week once in the semester", "author": "uglybutterfly025", "created": 1615570355, "upvotes": 3}, "gqpl9hx": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpl9hx/", "text": "I’m a early graduate from high school and I started college this semester. So I don’t get a spring break but all my friend do and I’m like :(", "author": "AlexandraThePotato", "created": 1615569993, "upvotes": 1}, "gqpkzzh": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpkzzh/", "text": "Ride out to mexico for the weekend or cop a flight.", "author": "SenorTonto", "created": 1615569877, "upvotes": 0}, "gqpk13x": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpk13x/", "text": "Take as many breaks as possible to recharge", "author": "10dollaressay", "created": 1615569446, "upvotes": 3}, "gqpjaos": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpjaos/", "text": "You cannot. You must suffer.", "author": "HarryRichards69", "created": 1615569117, "upvotes": 5}, "gqpilps": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpilps/", "text": "This is something I’m really struggling with right now. I usually have a firm “no school on weekends” rule, but this coming week I have two midterms Tuesday and two projects due Friday, so I’m definitely breaking that, and I absolutely need the break the most right now too", "author": "BecomingCass", "created": 1615568806, "upvotes": 3}, "gqphucd": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqphucd/", "text": "Wait, you guys are getting weekends?", "author": "RedDeadRob", "created": 1615568466, "upvotes": 31}, "gqphmqk": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqphmqk/", "text": "It’s very much an unfortunate situation. Honestly, I’d much rather have an extra week added on to the end of the year to insert a spring break, but at the same time, how do you know that those on break won’t be going home or going to party in Florida or whatever?", "author": "simberry2", "created": 1615568375, "upvotes": 10}, "gqphjig": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqphjig/", "text": "that god we have a week off for my university, it’s actually this upcoming week. I’ll be using it to catch up on midterms tho :’( \n\nBut the extra time is appreciated for sure. I don’t think I’d make it very far without this break...", "author": "dreamer0303", "created": 1615568336, "upvotes": 8}, "gqpgmct": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpgmct/", "text": "By \"many\" universities, you really just mean your individual university. Most universities have declared their plans well in advance - none, that I am aware of, are \"opting out\" of Spring Break. They made a decision (most likely in summer 2020) to adjust their entire academic calendar. Some are adding random 1 or 2 day breaks throughout the semester, some are just plowing through, but very few (if any) are suddenly changing their plans - that would be expensive.\n\nTo answer your question - if you can't survive 15 weeks of working about 18 hours a week (that's what a typically full college course load is) and using the rest of your time to manage things like getting your homework done, eating meals, maybe having a job, and taking care of yourself, maybe you are simply taking life a little too seriously. College isn't hard. Busy? Maybe sometimes. But it isn't hard work. You don't need a break every 2 months. Sure, it would be nice, but you don't need it. If you want a hard reset, take the weekend to evaluate why the hell you're in college in the first place. If that doesn't motivate you, then go try something else.", "author": "signalorthenoise", "created": 1615567929, "upvotes": -18}, "gqpgewi": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpgewi/", "text": "Honestly, I am crashing and burning out right now. Recently, I have started having random instances of bursting out into tears. Maybe it is because I am trying so desperately hard to graduate in May 2022, but I am trying real hard to finish strong. I set up an appointment with a counselor at my school, so I suggest maybe that if you are up for it. It isn't really much of a mental break like a vacation would be, but it could help with trying to identify ways to cope with everything going on.", "author": "beepboopneepnoop", "created": 1615567837, "upvotes": 42}, "gqpff7h": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpff7h/", "text": "Fitness, fitness, fitness, goals, goals, goals, spring break or not I'm going to get in the gym either my own gym at home or public gym or at a friend's house and I'm going to get that money and if I am privileged to have the time I will make a trip to go rock climb or something for a day to get my mind right.", "author": "Old-Measurement4504", "created": 1615567397, "upvotes": -3}, "gqpfekv": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpfekv/", "text": "One thing I did that really boosted my mood was - stealing a line from WandaVision - taking a \"quarantine-style staycation.\" \nI used my university-provided currency at the general store, bought a bunch of snacks and just stayed in all day watching movies and eating on Saturday. Barely checked my phone, didn't worry about what may be coming up in terms of deadlines. Felt great afterwards, I definitely recommend!", "author": "Clarinetist123", "created": 1615567389, "upvotes": 25}, "gqpf2rk": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpf2rk/", "text": "My school is giving us two two \"instructional breaks\", the first of which was Feb. 23-24, the next is March 31-Apr 1, but its stupid because they are during the week and you still end up working on school work the entire time. I had a big midterm the Friday after that first one so I never got a break. The goal of them was to prevent people from traveling, but that hasn't really worked because people are just traveling during school now and doing their classes online. I'm getting through better than some because I opted to take last semester off from classes (except one through a community college), but I sure as hell have no intention of doing any classes this summer if I don't have to. I can't wait for this semester to be over with.", "author": "M477M4NN", "created": 1615567245, "upvotes": 87}, "gqpewxh": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpewxh/", "text": "You can try homeowork subreddits like r/domyhomeworkforme101 it's not a free break.. but it's a break", "author": "Jugz123", "created": 1615567174, "upvotes": -13}, "gqpeooc": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpeooc/", "text": "For me personally, I have been taking the weekends for myself. I do absolutely no work and just focus on what I want to do for myself instead.", "author": "nonconformistnugget", "created": 1615567073, "upvotes": 5}, "gqpebj9": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpebj9/", "text": "Spending my 3 day weekend doing school bc I’m always behind so when you figure it out lmk", "author": "AStruggling8", "created": 1615566912, "upvotes": 15}, "gqpcp9f": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpcp9f/", "text": "This definitely won’t work for everyone depending on your family and class situation but I’m going home to my family for a week as I normally would do. I chose a week in March where I knew I would have the lightest workload, and will only be missing 1 in person class since the rest are online. For me just having someone to help take a little bit of my responsibilities (cooking, cleaning, etc.) off of my plate for a week is immensely helpful. I plan to get my schoolwork done from 8-5 while they are at work, then spend evenings with them or hometown friends. A change of scenery and new people to talk to can do a lot for your productivity and help keep you sane lol.", "author": "chilly_standpoint", "created": 1615566193, "upvotes": 14}, "gqpcgsl": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpcgsl/", "text": "Going through the same thing! I had a strict schedule and now I'm falling behind because I NEED the rest!!! I recommend definately giving yourself some well deserved rest. And do not feel guilty about it. When you rest even for just half a day or one day you will be able to think more clearly when you get back to work. If you keep overworking yourself you could burn out and I think it's better if you miss some assignments or don't work too hard on some assignments than to go completely crazy. I think it's so stupid how we don't have a spring break this year..... I think spring break is needed!!!! I've been trying to not take school so seriously and it's helping. Good luck!! :)", "author": "radchicken23", "created": 1615566090, "upvotes": 22}, "gqpcgbt": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpcgbt/", "text": "Get a group of people to start advocating for random 3 or 4 day weekends sprinkled throughout the rest of the semester! If I recall correctly, that's what the student body at my school did last semester because we didn't have a fall break. So the 5 days off that were supposed to go towards your spring break should be distributed throughout the semester. I know it's not the same as a week-long spring break, but it might help some people out. Bring this idea to your SGA (or some organization/person with \"power\") and hopefully, they could get the ball rolling", "author": "DazedPenguin15", "created": 1615566084, "upvotes": 8}, "gqpca3f": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpca3f/", "text": "Yes. You should take a self care weekend! Log off of school and put away the notes and textbooks and make it a point to not think about it all weekend. Don't worry about Monday.i do this after weeks where I have multiple exams, but I make sure to plan ahead and do the stuff that is going to be due early the next week before logging off on Friday. That way I can truly enjoy the entire weekend without the sense of dred or guilt associated with knowing *I should* be working on the next assignment.", "author": "Boss_Myotis", "created": 1615566006, "upvotes": 98}, "gqpc773": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpc773/", "text": "I don’t see it as a break, we just aren’t meeting for lecture :/", "author": "dayyydreamerrr", "created": 1615565971, "upvotes": 202}, "gqpc3ss": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqpc3ss/", "text": "In Texas the “snow storm” was considered our spring break", "author": "Couldnt-think-of-you", "created": 1615565929, "upvotes": 126}, "gqp538e": {"link": "/r/college/comments/m3hu5n/with_many_universities_opting_out_of_spring_break/gqp538e/", "text": "I honestly don’t know. I’m somehow pushing through because I’m telling myself it will all be over in 8 weeks ( as if that’s short lol). Funny thing is I’m planning to take summer classes and I’m sure the fall which also be very rough. So I really am just putting up with the suffering I guess.", "author": "lovingtolive", "created": 1615562770, "upvotes": 482}}}