{
  "sid": "q78cu9",
  "link": "/r/college/comments/q78cu9/how_to_deal_with_being_sick/",
  "title:": "How to deal with being sick?",
  "text": "So I usually never miss a class unless it's due to an emergency or sickness. I missed one day of classes this semester because someone used a fire extinguisher as a 'joke' in our apartment and I was up all night cleaning it so I didn't choke on the powder while I slept, too exhausted to go on campus in the morning. No big deal, only one day missed.  \n\n\nBut then I got sick over last weekend. Really bad coughing and lots of mucus, probably the flu or a severe cold (one of my professors got it too.) So bad that I even took off an online class, my Japanese. Still having trouble getting through a sentence without coughing.  \nI've taken off a few days of classes because of this at this point, and while it's not all concentrated (1-2 missed days per class), it's still annoying. It's halfway through the semester so I'm not about to get a W I think, luckily.  \n\n\nI'm just kind of wondering, do I look like a bad student to my professors taking so many days off within a couple weeks? I still get all my assignments done, and I look over the content if I'm strong enough to pay attention. I find it really silly that I explained last week that my apartment was covered in fire extinguisher powder and now I'm taking multiple days off this week because of the flu.  \n\n\nWould you guys go to the hospital/doctor for such a thing? I'm considering it but since my uni is big on healthcare, I don't want to go in there and be bombarded with COVID patients. (Especially in a red state). Do you go there just to get a note that confirms you're sick? What do you do if you're sick during an exam?",
  "author": "moondra15",
  "created": 1634121396,
  "updated": 1634167608,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hggv7o0": {
      "link": "/r/college/comments/q78cu9/how_to_deal_with_being_sick/hggv7o0/",
      "text": "I just had something like this happened. I did a virtual visit because I needed meds and didn’t went to go to a walk-in (weekend) but they also gave him a note that my teacher accepted. It worked really well for me.",
      "author": "Hufflepuff7009",
      "created": 1634122103,
      "upvotes": 1,
      "replies": {}
    },
    "hghcnmc": {
      "link": "/r/college/comments/q78cu9/how_to_deal_with_being_sick/hghcnmc/",
      "text": "Professors don't want you coming to class if you are sick because they don't want to get sick too. Go to student health and get a note that you are sick.",
      "author": "hdorsettcase",
      "created": 1634132421,
      "upvotes": 1,
      "replies": {}
    },
    "hghn200": {
      "link": "/r/college/comments/q78cu9/how_to_deal_with_being_sick/hghn200/",
      "text": "Get a covid test and stay home. Who cares if it looks bad to your professors? You aren't being a disease vector, and that should be a high priority",
      "author": "biggestbaddestnerd",
      "created": 1634136905,
      "upvotes": 1,
      "replies": {
        "hghxk0m": {
          "link": "/r/college/comments/q78cu9/how_to_deal_with_being_sick/hghxk0m/",
          "text": "Thankfully don't think it's COVID. I have different symptoms, mucus is the main issue and it's not a COVID symptom.",
          "author": "moondra15",
          "created": 1634141208,
          "upvotes": 1,
          "replies": {
            "hghyl8c": {
              "link": "/r/college/comments/q78cu9/how_to_deal_with_being_sick/hghyl8c/",
              "text": "You should still get tested.\nSource: am vaccinated, had a productive cough, got a positive covid test.",
              "author": "biggestbaddestnerd",
              "created": 1634141635,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}