{
  "sid": "qbw13n",
  "link": "/r/college/comments/qbw13n/how_do_you_guys_take_notes_from_assigned_readings/",
  "title:": "How do you guys take notes from assigned readings???",
  "text": "Do u guys take notes from reading on physical notebook? Or tablet/laptop???",
  "author": "queenonbed",
  "created": 1634718004,
  "updated": 1634750251,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhc8n9e": {
      "link": "/r/college/comments/qbw13n/how_do_you_guys_take_notes_from_assigned_readings/hhc8n9e/",
      "text": "Assigned readings? Ugh. Normally I like to go skim through and get main ideas first then write notes based on that. Instead of just writing as I go, which I find wastes time.",
      "author": "Tricky-Leadership-38",
      "created": 1634719167,
      "upvotes": 2,
      "replies": {}
    },
    "hhccfjk": {
      "link": "/r/college/comments/qbw13n/how_do_you_guys_take_notes_from_assigned_readings/hhccfjk/",
      "text": "Read a page or half a page then write my thoughts. If there’s a lot of new info like terms/concepts I’ll write them as a see it, but often times I may just read to get the gist of it and even skim through the middle",
      "author": "Visible_Negotiation4",
      "created": 1634722676,
      "upvotes": 1,
      "replies": {}
    },
    "hhchyqx": {
      "link": "/r/college/comments/qbw13n/how_do_you_guys_take_notes_from_assigned_readings/hhchyqx/",
      "text": "I do something called \"engaged reading\".\n\nStep 1: Find the summary or conclusion at the end of the writing. This will tell you what the main points of the writing were supposed to be. Copy this, verbatim, on a separate sheet of paper for future reference.\n\nStep 2: Read. When you come across a sentence that supports the conclusion, copy that, verbatim. Then take that one sentence, rephrase it into two sentences. Then take that rephrased point and expound on it in four more sentences. You've now created an entire seven-sentence paragraph from one singular sentence.\n\nThese are your notes.\n\nAt the end of the course, if you have a paper due, compile these notes in the order which you took them, cite the original works, add an introduction, a summary and a works cited page and you've got your paper. Takes about 15-30 minutes in the end.",
      "author": "raku_rabbit",
      "created": 1634727271,
      "upvotes": 1,
      "replies": {}
    }
  }
}