{
  "sid": "qfxxx0",
  "link": "/r/college/comments/qfxxx0/is_it_worth_it_to_switch_majors_so_late_into_my/",
  "title:": "Is it worth it to switch majors so late into my degree?",
  "text": "So I’m currently in my third year at uni, however it is going to be my last before I get my undergrad since I had a bunch of credits from high school to help out. I’m currently a finance major. I like it and I’m interested in it, but ever since high school I’ve truly been passionate about computer science. I took AP and other classes in HS, but never pursued it in college bc a lot of advisors made the program at my particular uni sound very hard to get into. Now I regret it tho, and really wanna pursue that field.\n\nMy question is, would that be worth it? None of my credits besides my general education requirements would transfer over, and I have no clue how long or how many more years it would take to finish the degree. Has anybody done something like that that can speak to if it’s a smart choice? Or should I just finish out the next semester and a half with my current degree?",
  "author": "Spartan098",
  "created": 1635220073,
  "updated": 1635302634,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hi2pyrg": {
      "link": "/r/college/comments/qfxxx0/is_it_worth_it_to_switch_majors_so_late_into_my/hi2pyrg/",
      "text": "I’m gonna say no. It’s ok to have multiple interests, but you’re almost done.",
      "author": "dalej42",
      "created": 1635221142,
      "upvotes": 6,
      "replies": {}
    },
    "hi2rif2": {
      "link": "/r/college/comments/qfxxx0/is_it_worth_it_to_switch_majors_so_late_into_my/hi2rif2/",
      "text": "You should finish your degree in finance - you’re so close. After you get your bachelors you could do some bootcamps and/or online computer science classes to get your skills up and running and you could eventually pursue a masters in computer science, but finish the bachelors in finance first.",
      "author": "inisoirr",
      "created": 1635222103,
      "upvotes": 5,
      "replies": {}
    },
    "hi2qpmw": {
      "link": "/r/college/comments/qfxxx0/is_it_worth_it_to_switch_majors_so_late_into_my/hi2qpmw/",
      "text": "Depends on what you define as worth. Monetarily it will not be worth it if you still like finance, though same can be said on the other side. It would be worth it doing something you absolutely love. I say if you’re going to go into debt always make it worth it.",
      "author": "jimtimsza",
      "created": 1635221606,
      "upvotes": 2,
      "replies": {}
    },
    "hi2tzda": {
      "link": "/r/college/comments/qfxxx0/is_it_worth_it_to_switch_majors_so_late_into_my/hi2tzda/",
      "text": "I would say no, just because you're almost done. \n\nTake some computer science classes after you graduate and begin learning with [https://denigma.app](https://denigma.app) , YouTube, etc. and begin connecting with the community. \n\nYou'll have your finance degree, with CS skills!",
      "author": "bawlerblog",
      "created": 1635223683,
      "upvotes": 1,
      "replies": {}
    },
    "hi2vf3r": {
      "link": "/r/college/comments/qfxxx0/is_it_worth_it_to_switch_majors_so_late_into_my/hi2vf3r/",
      "text": "If you want to/can tack on another year of school it may be worth it to pick up a minor. Know its not the same thing but could definitely open up that field to you.",
      "author": "JXQX",
      "created": 1635224654,
      "upvotes": 1,
      "replies": {}
    },
    "hi2yv7a": {
      "link": "/r/college/comments/qfxxx0/is_it_worth_it_to_switch_majors_so_late_into_my/hi2yv7a/",
      "text": "You like your current major, and you’re almost finished? I would say no.\n\nYou can always sign up for a coding bootcamp",
      "author": "hercomesthesun",
      "created": 1635227144,
      "upvotes": 1,
      "replies": {}
    },
    "hi3b12j": {
      "link": "/r/college/comments/qfxxx0/is_it_worth_it_to_switch_majors_so_late_into_my/hi3b12j/",
      "text": "Why not finish your degree and get a Master’s in Computer Science? Also taking classes offered by organizations is a great way to build experience and skills that are valued by employers.",
      "author": "kizeltine",
      "created": 1635237362,
      "upvotes": 1,
      "replies": {}
    },
    "hi6uxns": {
      "link": "/r/college/comments/qfxxx0/is_it_worth_it_to_switch_majors_so_late_into_my/hi6uxns/",
      "text": "The majority of computer science jobs don't need a degree, they just want to see if you're able to do the work. Like someone else said, finish the finance degree and pursue CS on your own time, the combination is a strong one. Your degree will absolutely not prohibit you from pursuing a career in CS, so don't worry about that at all.",
      "author": "NoDryHands",
      "created": 1635296874,
      "upvotes": 1,
      "replies": {}
    }
  }
}