{
  "sid": "q7lduq",
  "link": "/r/college/comments/q7lduq/have_untreated_adhd_and_its_fucking_up_my_college/",
  "title:": "Have untreated adhd and it’s fucking up my college, what should I do?",
  "text": "I have untreated adhd and I’m only in two classes, both of which are online. The problem is the combination of not having classroom structure, having adhd and having to work full time have made it really difficult for me to accomplish my work. I’m getting treated soon for my adhd but my grades in both classes are abysmal. \n\nIn English I have a 0 and in math I have like a 7, plus I’ve missed most of my tests and like seven classes. Should I just drop out and Reenroll once I’m getting help, if I do that what will my current grade do to my future grades? Or should I just get as much work done as I can and try to bring my grades up a little bit and just retake the classes again?\n\nI currently go to the only community college in my area but it’s one of the top ones in the country, I’m not really sure how to handle this situation and the stress of it is just making this snowball.",
  "author": "DarkPho3nix40",
  "created": 1634161371,
  "updated": 1634167538,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgjd88h": {
      "link": "/r/college/comments/q7lduq/have_untreated_adhd_and_its_fucking_up_my_college/hgjd88h/",
      "text": "talk to your academic advisor or a therapist. reddit can’t help you and should not even try. this situation is personal and needs professional advice",
      "author": "Spottybelle",
      "created": 1634162166,
      "upvotes": 1,
      "replies": {
        "hgjhmhk": {
          "link": "/r/college/comments/q7lduq/have_untreated_adhd_and_its_fucking_up_my_college/hgjhmhk/",
          "text": "Well I more just want to know if the grades carry over when I drop out since it’s my first semester.",
          "author": "DarkPho3nix40",
          "created": 1634164118,
          "upvotes": 1,
          "replies": {
            "hgji007": {
              "link": "/r/college/comments/q7lduq/have_untreated_adhd_and_its_fucking_up_my_college/hgji007/",
              "text": "not if you’re within the drop period no they dont",
              "author": "Spottybelle",
              "created": 1634164289,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgjixtz": {
      "link": "/r/college/comments/q7lduq/have_untreated_adhd_and_its_fucking_up_my_college/hgjixtz/",
      "text": "treat it?",
      "author": "censqred",
      "created": 1634164717,
      "upvotes": 1,
      "replies": {}
    }
  }
}