{
  "sid": "qcme9g",
  "link": "/r/college/comments/qcme9g/the_better_degree_to_help_run_a_business/",
  "title:": "The better degree to help run a business?",
  "text": "Which is the better degree to run a business? which background or degree helps for running a business? \n\n(1) Accounting degree\n\n(2) computer science degree",
  "author": "GrandKnightMaster",
  "created": 1634801656,
  "updated": 1636176949,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhgxake": {
      "link": "/r/college/comments/qcme9g/the_better_degree_to_help_run_a_business/hhgxake/",
      "text": "See if there’s an MIS(management information systems) degree. \n\nIt teaches half technology(programming, databases, networking, hardware, software, troubleshooting) \n\nand half business(project management, accounting, possibly economics, and other miscellaneous business type classes). \n\nIt could also be called information technology, information systems, or computer information systems. If it’s in the school of business it’s good.\n\nIf this isn’t an option, your next best bet would probably be a CS degree with a minor in business or a cs degree and an MBA(if you don’t mind a masters), but really an accounting degree would also be really good, so I’d just pick the one you think you’d enjoy more.",
      "author": "evasiveshag",
      "created": 1634806229,
      "upvotes": 2,
      "replies": {
        "hhh11el": {
          "link": "/r/college/comments/qcme9g/the_better_degree_to_help_run_a_business/hhh11el/",
          "text": "I figured a Cs degree (for technical knowledge most new businesses are software companies/products) with a minor in business should do it.",
          "author": "GrandKnightMaster",
          "created": 1634809708,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhilzny": {
      "link": "/r/college/comments/qcme9g/the_better_degree_to_help_run_a_business/hhilzny/",
      "text": "What KIND of business? I mean, if you wanted to start a bakery, I would tell you culinary arts. If you wanted to run a publishing house, I'd tell you literature or creative writing. Finances? Finance. If you wan to run something like Walmart, then I'd suggest an MBA, a path you can get to by studying anything in your undergrad. A tech company? Then comp science. I do not know anyone who has gotten an accounting degree and went on to run a business... unless you want to run an accounting firm/business?",
      "author": "zifmer",
      "created": 1634838306,
      "upvotes": 1,
      "replies": {
        "hhio7vc": {
          "link": "/r/college/comments/qcme9g/the_better_degree_to_help_run_a_business/hhio7vc/",
          "text": "most business/new startup is software/technology-related business nowadays.",
          "author": "GrandKnightMaster",
          "created": 1634839211,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhkss3n": {
      "link": "/r/college/comments/qcme9g/the_better_degree_to_help_run_a_business/hhkss3n/",
      "text": "I'm a former business owner that decided to obtain an accounting degree because I was tired of paying my CPA $300/hour to do my taxes for me.  One thing I quickly realized when I opened my business was that I spent A LOT of time doing accounting, bookkeeping and taxes.  You will probably still want to hire someone to do your business taxes for you, but getting an accounting degree will help you in knowing how to properly maintain your books.  By properly maintaining your books, this will save you money with your tax accountant as there will be less work on the front end for them to do.  It will also give you greater understanding of how everything ties together regarding your financials statements, books and taxes.  I have a few degrees at this point in my life and I can honestly say the only one that helped me in my personal life was my accounting degree.",
      "author": "MDWrangler80",
      "created": 1634873257,
      "upvotes": 1,
      "replies": {}
    }
  }
}