{"sid": "k6zw3c", "link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/", "title:": "There is something fundamentally wrong with a class where you can ignore it for the entire semester and submit everything on the last day and still get an A", "text": "Basically because of my 21 credit hours and this class's very lenient resubmission policy (infinite resubmission until december 4th midnight) I ignored it so I could better focus on my other classes. Starting at 4 am of december 4th I performed all the labs and completed all the assignments and they have since been graded. at this point I have enough points for an A in a class where I put in 8-9 hours of effort total and it just feels wrong", "author": "Marethyu38", "created": 1607137819, "retrieved": 1632946794, "over_18": false, "upvotes": 2189, "upvote_ratio": 0.97, "comments": {"ghh04ed": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/ghh04ed/", "text": "Sounds like a dream to me", "author": "Letter_Additional", "created": 1609305476, "upvotes": 1}, "gesh30k": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gesh30k/", "text": "First off, props and congrats - I've never been able to do that and have wished I could several times, haha.\n\nIf it's a bullshit gen ed class, then I just take my A with gratitude and move along. Those classes can be solid boosts to a GPA, which in turn can makes your resume look slightly better, more competitive for postgrad programs, etc (not a gigantic advantage, but one nevertheless). It sucks that we have to waste time and money on things like that, but it's how college works right now and I just play along with the game. \n\nBut if it's a major class... yeah, I'd be disappointed, but I'd still take the A and try to dive deeper into the material in my free time if it mattered a lot to me.", "author": "piranhamahalo", "created": 1607237941, "upvotes": 2}, "germfi0": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/germfi0/", "text": "Op did a whole class in the time that I slept last night", "author": "REEEEEEED777", "created": 1607221559, "upvotes": 2}, "geranuj": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geranuj/", "text": "I had one class last semester.\n\nDid two assignments 10pm the last day able to. Got an A", "author": "fireandlifeincarnate", "created": 1607215576, "upvotes": 1}, "gequlsm": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gequlsm/", "text": "You just speedrunned a class", "author": "raddify", "created": 1607207999, "upvotes": 1}, "geqqgvv": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geqqgvv/", "text": "I teach a few courses that absolutely kick student butt. If you pass those, you're doing well. I have some labs that are very easy to get an \"A\" in, but the labs are really just designed to support learning the material inn the hard classes. The reason it is set up like this is that hands on learning reinforces classroom learning. And the lab activities will stay with them years after they sell back their books. At the end of the day, I could care less if a student gets an A as long as they meet a certain level of actual learning.", "author": "sonor_ping", "created": 1607206108, "upvotes": 2}, "geqoxef": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geqoxef/", "text": "Wild. I’m in STEM and the average weekly STEM assignment takes 8-12 hours for most people", "author": "UnexpectedClock", "created": 1607205412, "upvotes": 1}, "geqo7eq": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geqo7eq/", "text": "Professor here.   It’s should feel wrong.   You aren’t paying to get a degree with the least possible effort.   You paid to learn something.   And if you finished the class in 8-9 hours total, you didn’t learn a whole lot.   You got cheated.", "author": "AntiquePangolin", "created": 1607205100, "upvotes": 5}, "geqjzta": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geqjzta/", "text": "Yes but they’re a blessing along with a heavy corse load. If ALL of your classes are like that you got a problem 🥴", "author": "vr1252", "created": 1607203200, "upvotes": 2}, "geqi1vv": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geqi1vv/", "text": "I think this is great for general education in college - it allows more time for your major - but agreed. However, sometimes it is this way because of pressure from the administration", "author": "al_the_time", "created": 1607202317, "upvotes": 2}, "geqfthn": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geqfthn/", "text": "Yes, that prof should be fired", "author": "Thegymgyrl", "created": 1607201266, "upvotes": 2}, "geqbf0j": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geqbf0j/", "text": "I mean, consider that a lab class isn't usually going to run the full semester. Often they are designed to start a week or two into the semester and end a week or two early. So usually there are maybe 9 or 10 total labs. Now in person, a lab could take between one and four hours. For a lot of instructors this semester, they were encouraged to give less work and be more lenient. So they could have easily only assigned an hour's worth of work per lab. That would give you about 1 hour a week for 9 weeks of lab. If it took you about 9 hours of a single day to complete it all, it's the same amount of time.", "author": "Left_turn_anxiety", "created": 1607199310, "upvotes": 1}, "geqb7gd": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geqb7gd/", "text": "Demonstrated mastery of the subject should be all that's required. Instead we currently have a system that requires contact hours whether or not students need it. \n\nIt would be far better to have degrees that are comprised of exams that students have to pass (think CLEP tests). No time limit. No \"terms\" or \"semesters\". No \"courses\". Students who struggle with one subject can take as long as they need to study it. Students who already have aptitude in a subject can just take the exam and get credit. Fail an exam? No worries, just take it again after a waiting period, 3 months, say. Study what you missed and then pass it. \n\nAll the learning resources are out there, no need for expensive teachers. I'm not going to lecture about calculus better than the free videos you get from MIT or wherever. Need help? There will be markets for tutors and faculty will probably host lectures on specific topics. Students can attend in person or virtually, like TED talks.", "author": "acm2033", "created": 1607199222, "upvotes": 3}, "geq9md7": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geq9md7/", "text": "As a professor and professional, I think this is totally fine. In a professional setting, meeting the deadline is all that matters. My students start with a 100 from day 1, and it’s up to them how many points the lose and earn.", "author": "zella326", "created": 1607198503, "upvotes": 1}, "geq8yoz": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geq8yoz/", "text": "On one hand, it's kinda weird that's how the class works. On the other hand though, you did all the work, so it makes sense that you should get an A.", "author": "Deluxe_24_", "created": 1607198168, "upvotes": 1}, "geq8a4i": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geq8a4i/", "text": "its better than putting in the proper time and effort and still tanking the subject", "author": "itsShikharBitch", "created": 1607197806, "upvotes": 4}, "geq7puz": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geq7puz/", "text": "I had a class that had deadlines but it was like, extremely easy and the prof kept canceling class and assignments to the point that we didn’t even have a final or anything. I’m pretty sure everyone got an A and I got a 100. I’m not complaining though, it’s an introductory class that everyone in my major is required to take", "author": "AnkhAnkhEnMitak", "created": 1607197505, "upvotes": 1}, "geq55n3": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geq55n3/", "text": "My high school (online) was like that. Really did not help me develop a work ethic, so now I'm getting a crash course in not procrastinating from college. Fun stuff.", "author": "tyttuutface", "created": 1607196177, "upvotes": 3}, "geq4duc": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geq4duc/", "text": "Do you like it or not, and if not why not. I think this is the kind of class that gives people the best flexibility: If they want to learn they probably can learn a lot as well; if they are busy with others like internship/job searching this class won’t become a burden for them.", "author": "Typical_Resource_340", "created": 1607195775, "upvotes": 1}, "geq3iug": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geq3iug/", "text": "What kind of college do you go to where you have classes like this?", "author": "ajfewoi", "created": 1607195321, "upvotes": 1}, "gepy008": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gepy008/", "text": "Why are you complaining tho", "author": "ElvisC13", "created": 1607192695, "upvotes": 6}, "gepsjwc": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gepsjwc/", "text": "I mean if you aren't on scholarship, you just wasted money on a class you didn't really need? I mean did it expand any knowledge or skill set for you? If you could get an A for 8-9 hours of class, you never needed the class in the first place. But congrats on the A.", "author": null, "created": 1607189991, "upvotes": 2}, "gepsg2y": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gepsg2y/", "text": "The professor may also have other guidelines and constraints in designing the course. As others point out, some students struggle mightily to get a C whereas others may get to an A rather easily. None of that is predictable. The course may also serve as a step toward other courses where the content may be more challenging. One thing US University accreditors look for is courses with “High DFWIs” or lots of low grades, withdrawals and incompletes.  If the course is a stepping stone to others in a major, it may be a gateway to ensure basic competency for more advanced work. And, yes, I know it feels wrong to someone who actually wants to learn. Own that, because not all students want to. Professors are also under pressure to get good reviews from students, even if they think they should teach more rigorously, so please add your voice politely to wanting more rigorous study. This can help both the professors department as well as advisors whose job it is to try and match you with your own learning goals. Good luck!", "author": "BobasPett", "created": 1607189935, "upvotes": 1}, "geppqzt": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geppqzt/", "text": "Same thing happened to me with my financial accounting class. Four midterms + one final (for five total exams), but if you did better on the final than on any of your previous exams, the professor would substitute your final exam grade for that exam. So hypothetically you could make a 0% on all four midterms, make a 100% on the final, and make a 100% in the class since the 100% replaced all previous exam grades lower than it. Prior to the final, I was pretty much failing. Needless to say, I became a fucking accountant during finals week. Did nothing but study for that exam all week. Aced the final exam, and aced the class. Lmao not a strategy I would ever recommend though.", "author": "MyNameIsZink", "created": 1607188514, "upvotes": 4}, "geppbhw": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geppbhw/", "text": "I wouldn’t say there’s fundamentally something wrong with the class but more of something wrong with the professor. Like maybe he or she could be more engaging or else they wouldn’t have students like this. I think this policy would be helpful for students who are having a hard time focusing because of Zoom and COVID, but it doesn’t really benefit any of the students who are submitting stuff on time or along with the timeline.", "author": "jao812", "created": 1607188286, "upvotes": 5}, "geplu1x": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geplu1x/", "text": "I did the same as well😂. LMAO", "author": "AdriannaWriter", "created": 1607186421, "upvotes": 1}, "geplrwi": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geplrwi/", "text": "Here is the problem I think:\n\n1. If you can get your work done after you master the materials higher than the question standard, then I think either you're overqualified for the course, or the course shouldn't exist in the first place.\n2. Else if you get the work done but you have 0 understanding of the course, well... let's say it's more than a waste of tuition.\n3. Else you will learn the materials after by yourself, or you think you definitely have other focuses that are more right now, maybe your work or digging in to some theories, or any other things you genuinely feel worthy, then... GOOD JOB!", "author": "lisagg9", "created": 1607186389, "upvotes": 14}, "gepjkgp": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gepjkgp/", "text": "What a waste of your money and your college experience.", "author": "segwayistheway", "created": 1607185198, "upvotes": 0}, "gepeh5s": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gepeh5s/", "text": "Well, it's similar to many other countries' systems (modules with 100% contribution by end of term exams), and besides, many college classes have a CLEP counterpart which is basically just an exam, and yet there is nothing fundamentally wrong about a CLEP exam.", "author": "zacsaturday", "created": 1607182333, "upvotes": 2}, "gepb3pn": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gepb3pn/", "text": "Agree, but honestly an A is still an A and that is pretty sweet!", "author": "taeghibIi", "created": 1607180325, "upvotes": 4}, "gep82j6": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gep82j6/", "text": "My friends and I called these \"Buy an A\" classes.", "author": "Pariell", "created": 1607178362, "upvotes": 11}, "gep6i1x": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gep6i1x/", "text": "Yeah you should see my online PE class. 😒", "author": "someones--mom", "created": 1607177226, "upvotes": 1}, "gep647x": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gep647x/", "text": "I have been taking online exclusively for 2 years and theres always at least one or two classes like that every semester. Several times I've searched a question from homework on google to help me understand the steps and found the whole assignment and the next online. I didnt use it or anything, but I dont know if I'd be that honest if I forgot to study. Its insane and I'm a procrastinator so I get almost everything done day of and it's the worst. I hate online school but I cant commute.", "author": "someones--mom", "created": 1607176936, "upvotes": 10}, "gep53vk": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gep53vk/", "text": "I did state govnt class like this. Read all the chapters, wrote all the papers and took all the quizzes and tests in one marathon run of a day at the library. I saw nothing wrong with it. I did all the work.", "author": "eelnitsud", "created": 1607176174, "upvotes": 10}, "gep4e88": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gep4e88/", "text": "Nothing wrong here. You demonstrated an intimate knowledge of the tools, techniques and materials needed to accomplish the task, and did so to a more than acceptable level. In real world terms, your “manager” assigned you a project with a deadline and you met their expectation, delivered on time.", "author": "solventbigdaddy", "created": 1607175615, "upvotes": 31}, "gep3m3q": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/gep3m3q/", "text": "But it feels absolutely terrible to have to submit six assignments and multiple quizzes in a single week. Not to mention the occasional presentation as well. Continuous evaluation, they say.", "author": "Shagohod13", "created": 1607174989, "upvotes": 9}, "geoztqv": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geoztqv/", "text": "I'll take that freebie class pls. I hate how school is done in Quebec. Have to go through 4 semesters of pre-university classes that might or might not be related to what you want to do.", "author": "valkyriaz", "created": 1607171666, "upvotes": 8}, "geoybwz": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geoybwz/", "text": "Yeah I don’t think every class needs to be an intense, painful experience...", "author": "Oscar_L_de_Jarjayes", "created": 1607170158, "upvotes": 38}, "geoy3uz": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geoy3uz/", "text": "This is what I think all the time when students talk about “easy A” classes. Easy C? Ok. But I am there to teach people who want to learn.", "author": "GrandmaMabelGrey", "created": 1607169930, "upvotes": 8}, "geoxwx9": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geoxwx9/", "text": "I feel like it lessens the value of a degree honestly. I also agree with your statement. I don’t want a degree cuz I paid money for it, I want it because I put in the work and effort for it.", "author": "Keesus", "created": 1607169727, "upvotes": 12}, "geowbbc": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geowbbc/", "text": "Disagree. Had a class with this and it saved my ass", "author": "wolfy321", "created": 1607168003, "upvotes": 6}, "geow6de": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geow6de/", "text": "But shouldn’t every other class be like this, i mean not to the point of being completely easy but school shouldn’t even stress us. It sucks that being stressed from school is a must.", "author": "simplejosyy", "created": 1607167851, "upvotes": 7}, "geovyxg": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geovyxg/", "text": "I agree but it also  depends on the class. Some students might struggle in there while you find it easy. When I took petrophysics I slept everyday and got an A while others had to bust ass for a C", "author": "HiTekRednek10", "created": 1607167620, "upvotes": 53}, "geour6s": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geour6s/", "text": "Same with my philosophy classes. I am a physics and philosophy double major, study for philosophy maybe 8 hours total and get a 100% on the final. It feels wrong but it happens every single time.", "author": "InterestingKiwi5004", "created": 1607166268, "upvotes": 5}, "geou9h7": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geou9h7/", "text": "My GPA needs stuff like this", "author": "KING_COVID", "created": 1607165717, "upvotes": 50}, "geoqt9a": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geoqt9a/", "text": "If it's general education then I don't mind, in fact I welcome it. I already have enough pressure doing my major specific courses. I like to take general education classes seriously but sometimes duty calls and I need to get my priorities straight.", "author": "Bitmazta", "created": 1607161811, "upvotes": 72}, "geokg4u": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geokg4u/", "text": "It leads to some super crappy scenarios. More than once I have had to treat major classes I was genuinely really excited about like you described, because I had to put a ridiculous amount of time and energy into a non major class (looking at you calculus...). I’m not saying it didn’t deserve effort. I’m just saying I can’t focus on what I am there for because I’m drowning in side quests.", "author": "Softpretzelsandrose", "created": 1607154914, "upvotes": 41}, "geoif6n": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geoif6n/", "text": "I had this evolution class that I slept during literally every day of the semester because I was tired as shit by that time of the day and it was horribly boring. We had maybe one homework assignment a month. I got A's on every test. I learned nothing.", "author": "thelasthair", "created": 1607152930, "upvotes": 1}, "geobzwl": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geobzwl/", "text": "That’s insane but awesome job getting an A only putting in 8-9 hours work. It literally looks like you knew the exact amount of time the class would take to finish and was able to do everything at the quality the teacher expected. That’s a pretty cool accomplishment, even though I agree getting an A when finishing everything on the last day is pretty iffy.", "author": null, "created": 1607147277, "upvotes": 751}, "geo9dvb": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geo9dvb/", "text": "[deleted]", "author": null, "created": 1607145311, "upvotes": 202}, "geo7rcc": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geo7rcc/", "text": "No there’s nothing wrong with that. It’s heaven LOL", "author": null, "created": 1607144145, "upvotes": 39}, "geo3gwg": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geo3gwg/", "text": "I'd agree as well. But on the flip side, it does feel good knowing that you have a guaranteed A in this kind of class if you have other, harder classes to focus on that could tank your gpa.", "author": "Sprouse_66", "created": 1607141258, "upvotes": 542}, "geo06ti": {"link": "/r/college/comments/k6zw3c/there_is_something_fundamentally_wrong_with_a/geo06ti/", "text": "Hard agree", "author": "Judythe8", "created": 1607139138, "upvotes": 23}}}