{"sid": "nihwgc", "link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/", "title:": "Graduation is so anticlimactic", "text": "Don’t get me wrong seeing my friends again after over a year of zoom college is great, but once the ceremony is over everyone is all like —now what?— and you grab lunch and go about your life. Feels empty", "author": "daveed4445", "created": 1621687647, "retrieved": 1632947264, "over_18": false, "upvotes": 1257, "upvote_ratio": 0.99, "comments": {"gzkkayd": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gzkkayd/", "text": "Wow people sure are annoying with their \"the real world sucks.\" You guys don't have dreams or something?? Anything to look forward to?", "author": "VeraVera_", "created": 1622068729, "upvotes": 1}, "gz4v0i1": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz4v0i1/", "text": "Oh....", "author": "cornflake_rush", "created": 1621749313, "upvotes": 1}, "gz4pp6y": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz4pp6y/", "text": "I just graduated from my community college and will be transferring to a university in the fall to get my bachelors. For me, it was just overwhelming and scary, but also exciting. Like, I have been at my CC for 3 years and I was in the Student Government Association for 2 of them. I became the student government president and I've worked really closely with the staff at my school. I know a lot of people and a lot of people know who I am. \n\nIt's scary and sad that I will be leaving them all behind. I'll be starting fresh with no familiar faces or happy greetings from people who recognize me. I'm also excited though, because it means new opportunities and new people to meet.\n\nI admit that I cried at my graduation when they handed me my degree. It was partially from happiness, because I finally achieved what I have been working so hard for, but it was mostly sadness. Sadness that it was over. Now I have the summer to relax and it just feels weird. It's suddenly just over and I'm done. It's a weird and conflicting feeling.", "author": "Autumnleaves201", "created": 1621745136, "upvotes": 1}, "gz4lxbb": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz4lxbb/", "text": "What did you want?", "author": "OsculatingPlanes", "created": 1621742366, "upvotes": 1}, "gz4hjsb": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz4hjsb/", "text": "to be fair I didn't get a high school graduation last year so I'll take any kind of college graduation", "author": "nautilus494", "created": 1621739376, "upvotes": 1}, "gz4ctzu": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz4ctzu/", "text": "Yup same. Just graduated at CC and since this is my first virtual graduation. Felt kinda empty, a little sad and yet not cause there is no actual ceremony and the lingering “I finally have an AA. The first parts over, now what? Other than waiting for it to be mailed.” is there and it hasn’t even been the end of May yet.", "author": "N00dlemonk3y", "created": 1621736351, "upvotes": 2}, "gz4bfo4": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz4bfo4/", "text": "Don't graduate. It's simple.", "author": "-boredMotherFucker", "created": 1621735489, "upvotes": 1}, "gz47t6i": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz47t6i/", "text": "I know the feeling, with the whole Graduated college, now what? Celebrate, enjoy your new life, welcome to post-grad life, take the summer off, travel, hang out with friends, family etc. I graduated in 2019, way before the 2020 fiasco, and i had the same lingering thoughts, moved back home, feeling lost after school.\n\nThe world is your oyster after graduating college.", "author": "Carloverguy20", "created": 1621733286, "upvotes": 2}, "gz408o9": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz408o9/", "text": "For me, I really could care less about graduation. I put in the hard work & now I just want my degree. The ceremony is nice but it’s not necessary so I’d just pass on it (but like I said that’s what I think)", "author": "TheRestIs_Confetti", "created": 1621728854, "upvotes": 2}, "gz3xsw9": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz3xsw9/", "text": "I did not go to commencement for either undergrad or graduate school.  Too many people, and finishing during summer/winter terms instead of the usual spring made things inconvenient.  Do not regret.", "author": "ladyvonkulp", "created": 1621727450, "upvotes": 3}, "gz3x3re": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz3x3re/", "text": "‘Laughs in 2020 graduation’", "author": "lifer98", "created": 1621727061, "upvotes": 4}, "gz3ufoq": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz3ufoq/", "text": "Ha! What are you doing now? This is how it is for everything in your life that comes to a end — you gotta have the “ on to the next one” mindset!", "author": "erice3r", "created": 1621725602, "upvotes": 3}, "gz3tzb8": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz3tzb8/", "text": "while other Unis in Cali are doing in person graduations, im headed to a drive thru graduation to take a picture in my car on Tuesday. i know it aint the greatest but i know that i accomplished something. I'm more excited about getting some calls/emails for interviews regarding internships at this point.\n\n but the future is bright for us! I'll celebrate with you and the rest of the Class of 2021 today! cheers OP!", "author": "Caliagent702", "created": 1621725358, "upvotes": 3}, "gz3pu11": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz3pu11/", "text": "Hey my virtual graduation was just a YouTube video talk about not worth it", "author": "TrekkieTay", "created": 1621723184, "upvotes": 3}, "gz3cvav": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz3cvav/", "text": "My grad was purely for show. Get your fake diploma, do the walk, hear the people, everything seems legit.\n\nI didnt see my friends, they all went to different schools and Im a transfer student. But i hung out with my family, made my family proud which really makes up for it. \n\nAfter grad, I picked up the things in my room and said goodbye to my roommates cat and then went on the 300 mile trip home. \n\nKinda how my HS grad went but my HS grad I went home too early because my friends were still hanging out inside. I wish I was there instead of my family wisking me away", "author": "PossiblyAsian", "created": 1621716463, "upvotes": 3}, "gz3ciip": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz3ciip/", "text": "I didn't even have a ceremony so...", "author": "SwiftCEO", "created": 1621716283, "upvotes": 6}, "gz39v2a": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz39v2a/", "text": "Honestly you’re paying 40k+ for 4 years of having profs read power points to you and last minute studying for tests. Uni is only really fun when your family is rich enough to let you get a dorm and an allowance. For me personally, I can’t wait till I gtfo.", "author": "ezpounder", "created": 1621714965, "upvotes": 5}, "gz38lj4": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz38lj4/", "text": "That’s why I’m not going to mine when I graduate. It’s a waste of time.", "author": null, "created": 1621714340, "upvotes": 2}, "gz37ew1": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz37ew1/", "text": "My college graduation was at 9 a.m. and I missed it because my friends came into to town to watch and we ended up being too hungover to walk; I have zero regrets over not experiencing hours of speeches and names called of people I barely knew. I had the exact same feeling of \"what now\" 30 years ago because at the time all you needed was a Bachelor's to get a job - but there was no direction or help offered at the school for finding that job. Graduation is supposed to be closure so feeling empty is understandable - that part of your life is gone. It's also understandable to be depressed and even overwhelmed. I graduated during the recession of '91 and it sucked. I wanted to go straight to grad school but didn't have money so I just stayed with my \"college job\" to wait for better job prospects. Hopefully, the rosy picture the media paints of the job market is true and you can get your career going and feel less empty. Good luck!", "author": "Sisyphusmom", "created": 1621713739, "upvotes": 2}, "gz36cks": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz36cks/", "text": "This is how I felt finishing my last class of college at 9pm on a Thursday before christmas break. It was so anticlimactic, I didn’t even get a congrats graduation email until 2 months later. Not bothering with a virtual graduation", "author": "DynamicHunter", "created": 1621713192, "upvotes": 4}, "gz365bf": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz365bf/", "text": "And that's why my friend we usually don't have graduation ceremonies in German universities. You go to an office and pick up your degree 😎", "author": "Luck4mars", "created": 1621713089, "upvotes": 7}, "gz33dji": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz33dji/", "text": "Yeah, I also felt a little hollow at my graduation. Well, the one that didn't get cancelled anyway. It does just fly by and then you're like \"wow, this is over\".", "author": "Gauntlets28", "created": 1621711637, "upvotes": 5}, "gz314q0": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz314q0/", "text": "You got to see your friends again, you got to enjoy a good meal with them afterwards. That's awesome! I know that society and the media paints this unfair portrait of graduation as this insanely hyped, unbelievable event. Maybe in your reality, it's not that extravagant, but at the same time, remember the fact that it did happen and it served as a formal transition into the next part of your life!\n\n\"Expectations are the thief of joy\"", "author": "archer-sc", "created": 1621710463, "upvotes": 9}, "gz2sm7j": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz2sm7j/", "text": "Well, of course it is. Graduation isn't for *you*! It's for your family and other loved ones.\n\nYou walk across a stage so the audience can see you receive your diploma and pose for photos that your parents will buy at exorbitant cost because it's all *they* have to show for your time there. If it weren't for them then you could just get your diploma sent in the mail, which plenty do.", "author": "officially_anxious", "created": 1621706203, "upvotes": 22}, "gz2rpyi": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz2rpyi/", "text": "As long as you keep the curve moving upwards it has its rewards. When you plateau you get bored, apathetic, disgruntled. Eventually you get dependents and the game isn’t about you anymore, it’s about their chance at the opportunity, like was sacrificed to get you to this point. Keep impressing the right people, nobody does it alone. \nCollege is pretty much the same just more expensive at the end of the road. Never lose sight of the fact the parchment only tells the employers that you are trainable and able to set and accomplish goals. The degree gets you from n the door. The life skills still count toward maintaining the success.", "author": "Luftgekuhlt_driver", "created": 1621705781, "upvotes": 3}, "gz2r2na": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz2r2na/", "text": "Yes. Now sink into depression that lasts until death with the realization that you just completed the tutorial and now life begins.", "author": "simjanes2k", "created": 1621705463, "upvotes": 8}, "gz2k38e": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz2k38e/", "text": "Fuck that. I really hope i finish my bachelor's this year. Hate bleeding money as i  been doing for the past 3 years getting nothing in return. I don't even feel like i learned anything at all. Guess my major. 😂", "author": "PickTheDucks", "created": 1621702075, "upvotes": 9}, "gz2jxwl": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz2jxwl/", "text": "I did not go, so I don’t feel this way.", "author": "9ynnacnu6", "created": 1621702001, "upvotes": 2}, "gz2f4a8": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz2f4a8/", "text": "I didn't attend my graduation. I've never been a fan of ceremony. It seemed boring and pointless to me, and my family lived to far away to realistically go, so I didn't. I borrowed a cap and gown from a friend for pictures to satisfy my mom and that was it. It didn't feel like an accomplishment, but an expectation I was mandated to complete. \n\nBut I suppose that graduation is as much for your family as it is you, or moreso. I can see why people sit and suffer and walk across the stage for someone other than themselves.", "author": "genericusername513", "created": 1621699554, "upvotes": 39}, "gz2bavv": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz2bavv/", "text": "It can definitely feel anticlimactic, but things start to pick up and get a lot more exciting when you realize that you have so many directions to choose from. You can take time to pursue your more hobby-like passions, you can travel, you can look into job searching and fall into a position that ends up being the perfect fit...the graduation itself is anticlimactic, but it's the signifier that you're free to do basically whatever your resources allow you to do.", "author": "author124", "created": 1621697578, "upvotes": 68}, "gz29r3z": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz29r3z/", "text": "For mine they had us stand in line and go through like cattle. No music, no ceremony, nothing. Get in line, get your degree, go home.", "author": "Zerobeastly", "created": 1621696764, "upvotes": 66}, "gz28mgm": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz28mgm/", "text": "That’s how I felt with highschool grad. 4 whole years of memories and experiences and it was “here’s a 3 hour ceremony, the end, move on now”", "author": "DemonRDT6", "created": 1621696158, "upvotes": 24}, "gz25d4v": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz25d4v/", "text": "Look, I don't wanna sound like a pre-ejac dick here, but there is no ladder out there that would ever impress me. In my opinion, a ladder isn't even really a ladder until someone climbs it, and when someone does climb it, I'm impressed by the climber, not the ladder. Hey, and this is coming from a guy who owns three ladders and uses at least one of them once a month. I've climbed ladders, pal. Don't think I'm a guy who has only seen ladders on TV and talks a big game. I'm a big man with big ladders. Oh look at me! I climb ladders with no shoes on! I'm a hot man! I'm not like that, okay? I climb ladders by necessity. I use ladders as tools. I don't romanticize ladders. I don't treat them like people. I don't imagine a \"lady ladder\" where the act of climbing is sexual in nature and she blushes and moans as I ascend and descend her rungs all night long. I don't do that. I don't use my ladders for sexual gratification. They're just tools. They're not impressive. They will never impress me. They're just ladders.", "author": "SportOne8997", "created": 1621694428, "upvotes": -11}, "gz23ivo": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz23ivo/", "text": "I was happy bc my family was there and very proud of me :) I dropped out for a little bit after my sophomore year and I graduated hs like a month late so I never got to walk at a graduation. But I also had gotten my second covid shot the day before so I felt like utter shit and went back to bed as soon as I got home lol. I think I had the “ok now what” moment sometime this past week once I realized it might take me a while to actually land a job and that I have this free time that I’m not sure what to do with", "author": "puffy-jacket", "created": 1621693457, "upvotes": 9}, "gz228an": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz228an/", "text": "Honestly my graduation ceremony was boring as hell. I couldn’t wait to get out of there after it ended lmao", "author": "nonconformistnugget", "created": 1621692763, "upvotes": 93}, "gz1z20h": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz1z20h/", "text": "I kinda feel like I started feeling the effects of post graduation at the end of my 3rd year mostly just because we've all been home and not at university. It all feels like university was just a dream and nothing really happened. Adulting is hard.", "author": "AirBendingNopon", "created": 1621690997, "upvotes": 152}, "gz1z013": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz1z013/", "text": "the whole graduation process can be summarised in the words of Monica Geller: “welcome to the real world. it sucks. you’re gonna love it.”", "author": "Accomplished-Tap5345", "created": 1621690967, "upvotes": 651}, "gz1xegw": {"link": "/r/college/comments/nihwgc/graduation_is_so_anticlimactic/gz1xegw/", "text": "Welcome to adult life!", "author": "antenarock", "created": 1621690024, "upvotes": 60}}}