{
  "sid": "qam6x2",
  "link": "/r/college/comments/qam6x2/experiencing_injustice_from_a_professor/",
  "title:": "Experiencing injustice from a professor",
  "text": "Hi everyone,\n\nSo basically it happened that I recently experienced an unjust treatment from a professor. However, let me give you some context on how it happened : (sorry if it is lengthy)\n\nI had a physics exam inside a huge auditorium that contained approximatively 100 students.  Strangely enough, there was only one professor to supervise the whole auditorium (other people where supposed to help but they did not come). Throughout the exam all went well. However, it is when the time to submit the papers came that things turned ugly. You might already guess that it is not a good idea to have one supervising person over a 100 students. Basically, what happened is that many students stood up and were going with their papers towards a table at the end of the auditorium. Intuitively, I thought that I should submit my paper there (it was 6 meters/ 20 feet away from me). As I'm going there I stopped halfway to put my answer sheet inside my question sheet (the paper was so bulky that I had support it with my knee). At that moment that professor was in panic mode because of the number of students freely walking around and casually chatting with their papers still in hand. I could hear him in the background shouting to other students : \"You got minus 10 ! you got minus 10 !\". Basically as I was putting my answer sheet in my question sheet ( which is a 5 seconds timeframe), he approaches me and asks me  what I am doing, to which I replied: \"I'm putting the paper inside\". At that moment he takes my paper, turns around, and says \"you got minus 10\". I became sure that 10 points out of a hundred would be deducted from me as he only took in hands the papers of the students to which he said : \"You got minus 10\". \n\nWhat that professor did is that he downgraded my grade by a letter grade. If it was an A , it would become B and if it was a B , it would become C, and so on. \n\nI wrote all the text above in such details just to illustrate that I did nothing wrong. I directly wanted to submit my paper after the time was up. That professor  had no valid reason for deducting points. I feel he did that out of anger that he had towards everyone in the room. \n\nNow I e-mailed my teaching professor about the incident (in an appropriate way)  and that I would hope that points would not be deducted. I didn't get any response for a week. What worries me is that this supervising professor is a head of department and has more authority. He was very determined to deduct grades.\n\nIt is very devastating for me because it is a very important exam. What do you think I should do ? It seems my teaching professor can't do anything. I will try talking with that head of department, but what should I do if he refuses ? To whom should I appeal ?",
  "author": "vlada_88",
  "created": 1634561968,
  "updated": 1634654635,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hh3x4ta": {
      "link": "/r/college/comments/qam6x2/experiencing_injustice_from_a_professor/hh3x4ta/",
      "text": "When you say “head of department” do you mean the chair, the dean, etc.? Because you would usually want to go to the chair in situations like this. First though, they’ll tell you to go talk to the professor that took those points in the first place. I know this is difficult, but you didn’t seem to do anything wrong. I’d imagine if they did this to so many students then you aren’t alone in this situation and others will be bringing it up as well. So go explain how you don’t understand why points were taken. See what they have to say after they’ve cooled off. If they don’t listen, go to the dean, then the next highest person would be the provost (I believe).",
      "author": "WickedPuffin",
      "created": 1634565370,
      "upvotes": 5,
      "replies": {
        "hh4ehc2": {
          "link": "/r/college/comments/qam6x2/experiencing_injustice_from_a_professor/hh4ehc2/",
          "text": "That professor is the head of the physics department. I plan to talk diplomatically with him as soon as I am able to. So if I am to follow your advice, I would contact the chair and people in higher positions if it does not work out",
          "author": "vlada_88",
          "created": 1634572958,
          "upvotes": 2,
          "replies": {
            "hh5lfjn": {
              "link": "/r/college/comments/qam6x2/experiencing_injustice_from_a_professor/hh5lfjn/",
              "text": "I would not recommend doing that at all.",
              "author": "Mammoth-Title-2102",
              "created": 1634590946,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hh5ew74": {
      "link": "/r/college/comments/qam6x2/experiencing_injustice_from_a_professor/hh5ew74/",
      "text": "Familiarize yourself with your school's capricious grading policy and follow it. This seems a clear example of capricious grading.",
      "author": "hdorsettcase",
      "created": 1634587895,
      "upvotes": 2,
      "replies": {}
    },
    "hh5l8cq": {
      "link": "/r/college/comments/qam6x2/experiencing_injustice_from_a_professor/hh5l8cq/",
      "text": "So, I don't know how to say this without sounding harsh but, ultimately, welcome to adulthood. If you keep going up the chain over 10 points, is this really the reputation you want to make for yourself? It may be because I'm prior military and we learn early on that our personal feelings of 'injustice' don't mean anything to anyone but us, but it's also a good lesson in being an adult in a 'life isn't fair' world. My advice? Speak to the professor about what you can do differently NEXT time to avoid any confusion and loss of points. He may be taken by your approach and undo the 10 deducted, or he may not. Either way, you've shown maturity and learned how to prevent it from happening again rather than cause a complete ruckus over 10 points.",
      "author": "Mammoth-Title-2102",
      "created": 1634590826,
      "upvotes": -1,
      "replies": {}
    }
  }
}