{
  "sid": "q4svn6",
  "link": "/r/college/comments/q4svn6/losing_hope_for_the_future_whiny/",
  "title:": "Losing hope for the future (whiny)",
  "text": "I’m honestly just over it. Im working 60-70 hours a week and in school part time. Im majoring in computer software engineering. I honestly never had any interest in computers or engineering. I just have an interest in not being broke after graduation. What id really want to do is open up an animal sanctuary raise kids or talk about politics all day haha. However I don’t believe I can make enough to live above the poverty line with just a bachelors in any field I just listed above. I know so many college grads who don’t have jobs (or work minimum wage ones), and I’m just losing hope for everything. How do you guys stay motivated and do you think it’s worth it to work in a field I’m apathetic towards to make ends meet?  If not how do you manage financially? (Most people I know who didn’t get a job outside of college live with their parents).",
  "author": "ponderingexistence9",
  "created": 1633809827,
  "updated": 1634083120,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.71,
  "comments": {
    "hg0yy00": {
      "link": "/r/college/comments/q4svn6/losing_hope_for_the_future_whiny/hg0yy00/",
      "text": "Many people go into university with expectations and the wrong motivation.\n\nThe idea of university is to go an excel in something you like, and will also make you money.\n\nIt's no good making money and being a miserable sod. It is also no good doing something you enjoy but being broke.\n\nIf your idea was to just make money you went in with the wrong motivation. Change your major and try again.",
      "author": "Impressive-Name5129",
      "created": 1633813889,
      "upvotes": 3,
      "replies": {}
    },
    "hg2967x": {
      "link": "/r/college/comments/q4svn6/losing_hope_for_the_future_whiny/hg2967x/",
      "text": "Why are you working 60-70 hours a week? Sounds like you are burning yourself out. Even if you work during the weekends, that's close to 10 hours a day. Starting at 9am, 10 hours will put you at 7pm. How are you having time to go to class, study, eat, and sleep?",
      "author": "AcademicDifficulty",
      "created": 1633836612,
      "upvotes": 2,
      "replies": {
        "hg33rnd": {
          "link": "/r/college/comments/q4svn6/losing_hope_for_the_future_whiny/hg33rnd/",
          "text": "I’m an EMT and I work at Starbucks. Starbucks I work shorter shifts but as an EMT I work anywhere from 12-24 hours at once. I take online classes so I do class work when I’m not at work.",
          "author": "ponderingexistence9",
          "created": 1633858396,
          "upvotes": 1,
          "replies": {
            "hg3mla3": {
              "link": "/r/college/comments/q4svn6/losing_hope_for_the_future_whiny/hg3mla3/",
              "text": "Sounds like you are setting yourself up for failure. You need to find a balance point between work and school to succeed.",
              "author": "AcademicDifficulty",
              "created": 1633871988,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}