{
  "sid": "q5nsjy",
  "link": "/r/college/comments/q5nsjy/have_your_classes_returned_to_being_in_person_but/",
  "title:": "Have your classes returned to being in person, but your motivation hasn't returned?",
  "text": "I had a really fun freshman year--I enjoyed all of my courses, and did all of my work. I got good grades, but I wasn't focusing on the grades.\n\nMy sophomore year was online, which wasn't particularly fun, and my passion for school was gone.\n\nNow I'm a junior, and courses are in person again, but I'm not focused and having fun the same way I did in my freshman year. I'm enjoying my course lectures, but I'm not interested in the course work, and am not turning in assignments on time. My grades are meh. I used to work hard on assignments, and and really felt like I was accomplishing something. Now I don't. \n\nIs anyone else in a similar boat? I feel completely fine, asides from not having a passion for school anymore. I'd like to recapture my passion, because it was fun when I had it. Maybe if anyone else is going through the same thing, we can rap about some solutions.",
  "author": "SavCItalianStallion",
  "created": 1633925119,
  "updated": 1634082995,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.94,
  "comments": {
    "hg7prt9": {
      "link": "/r/college/comments/q5nsjy/have_your_classes_returned_to_being_in_person_but/hg7prt9/",
      "text": "Feeling this same exact way! No motivation whatsoever! Sucks but hey",
      "author": "Michelle_Royal",
      "created": 1633948804,
      "upvotes": 5,
      "replies": {}
    },
    "hg84hk0": {
      "link": "/r/college/comments/q5nsjy/have_your_classes_returned_to_being_in_person_but/hg84hk0/",
      "text": "I absolutely feel this. I feel like I even still had a little motivation last year to complete the work, but now I just feel swamped and my grades are suffering because of it.",
      "author": "beans7018",
      "created": 1633958440,
      "upvotes": 3,
      "replies": {}
    },
    "hg900ez": {
      "link": "/r/college/comments/q5nsjy/have_your_classes_returned_to_being_in_person_but/hg900ez/",
      "text": "Yeah, I definitely feel this...\n.",
      "author": "aanuma",
      "created": 1633972259,
      "upvotes": 3,
      "replies": {}
    }
  }
}