{
  "sid": "pxrpcg",
  "link": "/r/college/comments/pxrpcg/transfered_from_college_to_a_university_currently/",
  "title:": "Transfered from college to a university, currently a junior but its my first year. Is it weird if I as a 26 year old join a 6 person dorm?",
  "text": "Couldn't find a similar question, so figured I'd ask. I want to be around my peers, so I'd prefer to dorm over getting an apartment. But I realized this may be a bit weird since I'm potentially so much older than others at my dorm.",
  "author": "nothinginten",
  "created": 1632907314,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hepbqp1": {
      "link": "/r/college/comments/pxrpcg/transfered_from_college_to_a_university_currently/hepbqp1/",
      "text": "Depends on how you feel around and get along with people generally younger than you. It might be a few years but I (33) was a completely different person at 26 than I was at 18 or 20. So for me, rooming with the younger crowd would have been oil and water. For you, if you already interact with people in the age range that you are likely to room with and it's generally a pleasant experience then it could work out. If you find people younger than you to be generally annoying for whatever reason then living with them isn't going to be awesome.",
      "author": "Comipa47",
      "created": 1632907707,
      "upvotes": 3,
      "replies": {
        "hepbwea": {
          "link": "/r/college/comments/pxrpcg/transfered_from_college_to_a_university_currently/hepbwea/",
          "text": "Hey, I appreciate the response. I may just find a two-person dorm and go with that. I've also heard of dorms for those that are in their major and may therefore be a bit older/more mature.",
          "author": "nothinginten",
          "created": 1632907860,
          "upvotes": 3,
          "replies": {
            "heqa30b": {
              "link": "/r/college/comments/pxrpcg/transfered_from_college_to_a_university_currently/heqa30b/",
              "text": "Or a grad dorm.",
              "author": "Awkward_Result6214",
              "created": 1632927651,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hesr9yg": {
      "link": "/r/college/comments/pxrpcg/transfered_from_college_to_a_university_currently/hesr9yg/",
      "text": "I would say get one with less roommates. I just think having 6 different dudes friends over would suck especially if they’re too loud all night long. And if they can’t buy their own alcohol it would suck to be put in that position constantly for 6 different people because you either say no and they don’t like it or you say yes and you’re responsible for them.\n\nThere are definitely other ways to make friends. Sometimes there are student houses with a bit of an older crowd and less surveillance but like still fun. Or dorms for niche groups of people like honors dorms, etc.",
      "author": "shoelaceys7373",
      "created": 1632965827,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634054224
}