{"sid": "peb0ob", "link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/", "title:": "An answer to 90% percent of the questions on this subreddit: \"Nobody Cares.\"", "text": "So I browse the subreddit pretty often and I have come to the conclusion that 99% of questions or posts on this sub asking for advice can be answered with the following words. Nobody cares. Whether you're worried about looking ridiculous on zoom, wondering what you should wear, curious about how to make friends, or not sure how to handle a social situation -  remember that nobody cares.\n\nAnd by this I don't mean that nobody cares *about you*. In college you will make life long friends who will be there for you through thick and thin. What I mean is that nobody cares how you act, what you wear, or what hobbies you have. This is the first time in a lot of people's lives that they get to reinvent themselves away from the pressure of their hometown or old toxic relationships. \n\nDo your best to remember that everybody else is trying to find themselves just like you are.\n\nI work with a lot of first-year students and they always ask me what piece of advice I would give to a first year. And the answer is always \"Nobody cares\". Don't be too hard on yourself because everybody is watching themselves way harder than they are watching you.", "author": "Pm_Me_For_SomeAdvice", "created": 1630298084, "retrieved": 1632802693, "over_18": false, "upvotes": 684, "upvote_ratio": 0.99, "comments": {"hb10la9": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/hb10la9/", "text": "I disagree  \nSome people out here care about strangers we do not even know!  \nEspecially when it comes to academic grades. I care. Am willing to help any student ace their class. It's somebody's future we're talking about here for heaven's sake!  \nWhatever's your take, I care.", "author": "Rho_Bull", "created": 1630391441, "upvotes": 1}, "hb077b4": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/hb077b4/", "text": "Most issues deserve its own subreddit especially about paying for college.", "author": "DammieIsAwesome", "created": 1630374432, "upvotes": 1}, "haz7st3": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/haz7st3/", "text": "I care.", "author": "deb_dib", "created": 1630358230, "upvotes": 1}, "haz3zp2": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/haz3zp2/", "text": "I have BPD which can make us idolize someone and do impulsive things, and I was enjoying one of my classes so much I blurred out I love you to my professor. I didn’t mean it *that* way, but more I love your class. I wanted to die, but my mom and husband had a field day making fun of me. My professor emailed me later asking if everything was ok. I’m like no dude…I’m a mental patient who should have been admitted to the hospital for 8 days to get my shit straightened out, but I’m still here trying to pass this semester 🤦‍♀️", "author": "wovenriddles", "created": 1630356632, "upvotes": 3}, "hayiw0j": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/hayiw0j/", "text": "When I was a freshman, I had to shave my head like a week before orientation because I gave myself an awful haircut. I did not look good at all with a shaved head and it’s still my ID picture. With that being said, nobody remembers me having a shaved head and when people see my ID I just have a laugh. Most people have more important things to deal with in college than making fun of someone for something dumb they won’t remember in a few months.", "author": "2222lil", "created": 1630347900, "upvotes": 2}, "hay6eu0": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/hay6eu0/", "text": "It’s amazing how many people think the world revolves around them.", "author": "MaleficentDistrict22", "created": 1630342729, "upvotes": 8}, "haxso9s": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/haxso9s/", "text": "I’d say this good advice, but it’s not always the easiest to follow, so that’s probably why people ask these kinds of questions. There are always going to be people who act like it’s high school. I was around them in college. I was around forty-somethings who acted this way when I was out of college. The point is that if you don’t start becoming an adult when you’re in college and blocking out these people from your life, you’re going to be the kind of person who is negatively impacted by that kind of behavior when you’re in your twenties or forever.", "author": null, "created": 1630337039, "upvotes": 3}, "haxoqbo": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/haxoqbo/", "text": "This is the reality of college. Everyone is either too overworked, stressed, or both to care what anyone looks like. \n\nI remember my freshman year of college, there was this guy who would ride a motorized uni-skateboard thing in a Perry the Platypus onsie (from Phineas and Ferb) and remember thinking \"This man is doin it right.\" \n\nNo cares, only zoom zoom.", "author": "Wronium_", "created": 1630335345, "upvotes": 27}, "haxkpt3": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/haxkpt3/", "text": "Nobody cares *as long as you are following applicable school rules and the law.* If your university has a dress code, for example, you'd be wise to ensure your clothing conforms to it.", "author": "Comprehensive-Ad3963", "created": 1630333615, "upvotes": 3}, "haxf036": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/haxf036/", "text": "I teach hundreds of first year students every year, and this is pretty much bang on. Everyone is confused. Everyone is a little scared. Everyone is in \"what the fuck\" deer-in-headlights mode. And everyone just wants to find their people. For some it happens quickly. For others it takes a little while. But as long as you're open to new things and new people, it'll happen.\n\nIt's great. I've loved my first and second years more in retrospect because I look back on them and realize that the culture shock associated with university and becoming an adult (increasingly synonymous in North American culture as more folks go to post-secondary) was a huge step to becoming what I am now. I have no idea what I would be like now if I didn't push myself outside my comfort zone and intellectually, to challenge myself with new ideas and different personalities/groups.\n\nTry to enjoy yourselves everyone. I know it's going to be rocky, but I love teaching first years because it brings me back a little bit to that time, and to help them get through this difficult patch is one of the joys of my job. I both envy and do not envy you.", "author": "purple_ombudsman", "created": 1630331039, "upvotes": 29}, "haxd2iq": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/haxd2iq/", "text": "Unless that hobby is fursuiting.", "author": "all_hail_to_me", "created": 1630330104, "upvotes": 4}, "hawy15b": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/hawy15b/", "text": "For real. People in college are nothing like people in high school. For the most part no one knows each other, no one will see each other everyday, and people are just minding their own business.", "author": "ElBarro69", "created": 1630321241, "upvotes": 15}, "hawsqfe": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/hawsqfe/", "text": "This is one thing  I love about college.", "author": "iamsojellyofu", "created": 1630317069, "upvotes": 9}, "hawqp0j": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/hawqp0j/", "text": "Ik what you mean. The last few weeks the subreddit is filled with people anxious about going/returning to college...\n\nChill out. Everything will be fine, nobody cares and in a few weeks, you won't care either.", "author": "D_Leshen", "created": 1630315333, "upvotes": 54}, "hawnzyx": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/hawnzyx/", "text": "Also the answer to most things outside of this subreddit as well...\nThings that an insecure person is talking about anyways. Which also seems to be like 90% of people in my age group.", "author": "Boat-enthusiast", "created": 1630312977, "upvotes": 21}, "hawk4nq": {"link": "/r/college/comments/peb0ob/an_answer_to_90_percent_of_the_questions_on_this/hawk4nq/", "text": "100% agree. It's pretty much guaranteed that you'll embarrass yourself in some way at least once during freshman year, it's just part of the process when you're transitioning to adulthood. I'm a senior and embarrass myself constantly.", "author": "sashathebrit", "created": 1630309593, "upvotes": 171}}}