{
  "sid": "i5eu35",
  "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/",
  "title:": "My college just said all campus facilities will be closed, and off campus students are discouraged from using their apartments",
  "text": "I have a lease for this upcoming school year, now all campus facilities shut down meaning I won’t have a job and little reason to even be there\n\nSo my school just announced that instead of running a hybrid model and having campus facilities open everything will be remote, and there will be no access to dining halls or any campus facilities. This leaves me with little reason to go to my college town. I’m really lost on what I should do regarding my lease, as it feels like a huge waste of money paying 700+ each month for a place I don’t even need. The place does allow subletting, and I think my roommate is still staying. Any advice on what I should do?",
  "author": "SoakaTheCorka",
  "created": 1596810632,
  "over_18": false,
  "upvotes": 875,
  "upvote_ratio": 0.99,
  "comments": {
    "g0u2l9j": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0u2l9j/",
      "text": "I am in a similar predicament however my immunocompromised parents do not trust covid-19 tests/and will never let me go back home/visit till the virus is \"over\" or at least subsided.   \n\n\nA couple of weeks ago I signed a lease for an apartment next to our campus in hopes of using campus facilities. :(",
      "author": "mintroselily",
      "created": 1596927014,
      "upvotes": 1,
      "replies": {}
    },
    "g0reou3": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0reou3/",
      "text": "If you and your roommate each pay separately on your own leases you could just straight up leave - basically accepting eviction and just not pay. Not an amazing option but it is an option. They could report you to credit agencies though.",
      "author": "GennaroIsGod",
      "created": 1596862619,
      "upvotes": 2,
      "replies": {}
    },
    "g0radxw": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0radxw/",
      "text": "What state? I’m afraid!",
      "author": null,
      "created": 1596859612,
      "upvotes": 1,
      "replies": {}
    },
    "g0qpv3o": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qpv3o/",
      "text": "I would recommend subletting, if you break lease it could cost you the rest of the leases rent so I'd be careful",
      "author": "Skoboviik",
      "created": 1596847509,
      "upvotes": 2,
      "replies": {}
    },
    "g0qjwi2": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qjwi2/",
      "text": "That’s why I waited the day before the due date to finalize my classes",
      "author": "TxHerrmann",
      "created": 1596844206,
      "upvotes": 1,
      "replies": {}
    },
    "g0qjjrb": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qjjrb/",
      "text": "As far as your landlord is concerned your lease has nothing to do with the school. You signed a contract to rent an apartment. Whether you need to be there or not isn’t really relevant. It’s like leasing an apartment, but being gone on travel for work 95% of the time. It blows, blame the state and the pandemic? Some might find it easier to get school work done away from home even if it is all remote.",
      "author": "worried_alum",
      "created": 1596844011,
      "upvotes": 7,
      "replies": {}
    },
    "g0qigip": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qigip/",
      "text": "It might be good to be on your own and focus on school. No matter your home life, if your Roomate is still going why not? It’s strange timesc",
      "author": "komdothedragon96",
      "created": 1596843419,
      "upvotes": 2,
      "replies": {}
    },
    "g0qh6fm": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qh6fm/",
      "text": "When did you sign the lease?",
      "author": "DusLurkMaster",
      "created": 1596842732,
      "upvotes": 2,
      "replies": {}
    },
    "g0q6hy8": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q6hy8/",
      "text": "I was THIS close to just letting myself get evicted from my student housing apartment. I got lucky that a friend of one of my roommates wanted to live with her.",
      "author": "Idrahaje",
      "created": 1596837124,
      "upvotes": 6,
      "replies": {}
    },
    "g0q2fre": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q2fre/",
      "text": "A fellow UMasser I see. I’m staying in my off campus room. I love the town of Amherst, it’s my home and permanent address now! I’m sure a lot of your off campus friends will be back and fun times will be had. get away from the family for a while!",
      "author": null,
      "created": 1596835090,
      "upvotes": 12,
      "replies": {}
    },
    "g0pzsss": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pzsss/",
      "text": "Get some of your tuition back if they are going ll remote ad just try to rent it out or see if landlord makes an exception cause Covid-19",
      "author": "alexrider003",
      "created": 1596833884,
      "upvotes": 2,
      "replies": {}
    },
    "g0pwu63": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pwu63/",
      "text": "Bait and switch! Classes were supposed to start for me in 10 days and they just flipped them all virtual a couple days ago. I signed a 13 month lease on 8/1. Bullshit. I’ve gone through all of the stages of grief in the last 6 days hahaha",
      "author": "merrycrasmass",
      "created": 1596832435,
      "upvotes": 22,
      "replies": {}
    },
    "g0pq8w0": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pq8w0/",
      "text": "UMass? Yeah that email caused quite a bit of stress for my friends in off-campus housing",
      "author": "official_prabhu",
      "created": 1596829263,
      "upvotes": 13,
      "replies": {}
    },
    "g0po754": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0po754/",
      "text": "Is there not a break clause in your lease? Worth reading through your residence contract. You may lose any rent you've already paid and maybe a deposit but it's better than nothing.\n\nUsually there is if you withdraw from the course within 14 days of the start date, at least in the UK.",
      "author": "Elastichedgehog",
      "created": 1596828293,
      "upvotes": 6,
      "replies": {}
    },
    "g0pljw6": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pljw6/",
      "text": "IMHO, if coronavirus spread is to be stopped, there would have to be a way to break student housing leases. At my school, nearly everyone besides freshman lives in student apartments unaffiliated with apartments. Regardless if classes are in person or not, asking a kid to pay $800 a month and not live there and have fun is unrealistic. It almost seems moot if classes are in person or online, if kids have apartments they have to pay for they will go.\n\nIt's nearly impossible to break student leases where I go to school, and who's going to sublet knowing classes will be online?",
      "author": "blackwhitetiger",
      "created": 1596827044,
      "upvotes": 19,
      "replies": {}
    },
    "g0plg2x": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0plg2x/",
      "text": "I hate that schools are waiting so last minute to announce this stuff. I had to give like 2 months notice about whether I’d be renewing my lease for September.",
      "author": "TheConcerningEx",
      "created": 1596826992,
      "upvotes": 75,
      "replies": {
        "g0pseoe": {
          "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pseoe/",
          "text": "Watch the news. Schools nation wide are being pressured to open in person. Trump and DeVoss have been threatening to cut federal funding to any school that doesn't comply.\n\nNow, colleges are seeing what's happening in the schools that opened last week.  There have already been shut downs and teacher deaths.  Colleges were waiting to see if was possible to reopen safely. And instead of listening to medical experts, they had to see failed reopenings in order to cancel their own.",
          "author": "Inactive_Account",
          "created": 1596830289,
          "upvotes": 45,
          "replies": {
            "g0q5lm7": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q5lm7/",
              "text": "Yeah I definitely understand that there’s been pressure, followed by a lot of disaster.\n\nFor reference though I live in Canada, so the pressure to reopen hasn’t been the same but the updates have still been slow. My school actually waited until the government forced them to close (in March), for some reason.\n\nThere really isn’t any way to safely reopen colleges IMO, especially larger ones. I’m a senior so my class sizes may be small enough, but some other classes tend to have like 600 people and I don’t see any way of doing that non-remotely.",
              "author": "TheConcerningEx",
              "created": 1596836668,
              "upvotes": 6,
              "replies": {
                "g0qgdz4": {
                  "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qgdz4/",
                  "text": "I apologise for assuming you're in the US. My mistake. I understand Canada is having some of its own struggles with reopening and you guys are directly impacted/influenced by how poorly we're handling it.\n\nI disagree with your last paragraph. There is definitely a safe way to reopen schools at partial capacity. Online. Anything short of that will come with risks.\n\nAside from a few select labs, every thing can be done remotely. In 2015, I took a zoology course with 5 dissections remotely.  The specimens and tools were a part of the supply cost.  Same thing with Botany in 2016. That's 4 & 5 years ago.  The software for virtual Bio labs today is incredible today.  Using layered digital models, there's no real need for physical specimens. Some higher physics and chem labs definitely need to be in person, risk can be mitigated with minimal class sizes.",
                  "author": "Inactive_Account",
                  "created": 1596842301,
                  "upvotes": 4,
                  "replies": {
                    "g0ql65k": {
                      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0ql65k/",
                      "text": "No worries! My concern is truly with my American friends, some of whom were studying with me in Canada, who are now in a horrible situation because of the US presidency. Y’all are good people who deserve better.\n\nAnd sorry what I meant was that there was no way to safely open non-remotely. I don’t see any way in which my classes couldn’t work online, which is the same for a lot of jobs tbh. I’m not in science but I also agree that digital labs are a good solution. With the exception of a few higher level smaller classes I do believe everything needs to be online.\n\nThis goes for Canada too - we have less cases overall but I happen to live in the worst hit city. The idea of being on campus surrounded by hundreds is terrifying to me.",
                      "author": "TheConcerningEx",
                      "created": 1596844897,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g0qwvv3": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qwvv3/",
              "text": "Hold on, are you saying a teacher got sick and died in the same week?",
              "author": "Sevenzulu",
              "created": 1596851495,
              "upvotes": 3,
              "replies": {
                "g0r59v4": {
                  "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0r59v4/",
                  "text": "Some schools have been open for a few weeks. Additionally there are summer courses that could have been the issue.  No idea if the it just a week from the first symptoms to death.  It's plausible though, especially in an elderly teacher.",
                  "author": "Inactive_Account",
                  "created": 1596856339,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g0pihue": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pihue/",
      "text": "If your college has apply for the covid relief aid to help reimburse your money loss. It is nonsense that these colleges are waiting until the last second to make this call.",
      "author": "kello-bello",
      "created": 1596825579,
      "upvotes": 79,
      "replies": {
        "g0ppn1x": {
          "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0ppn1x/",
          "text": "It’s nonsense but unfortunately I’m not at all surprised. They were so afraid of students not attending bc virtual so you just lock them in and at the last second switch. I imagine a lot of this is going to happen",
          "author": "hiddenbuck",
          "created": 1596828975,
          "upvotes": 52,
          "replies": {
            "g0przhv": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0przhv/",
              "text": "its fucking bullshit",
              "author": "deathworld123",
              "created": 1596830086,
              "upvotes": 25,
              "replies": {
                "g0q0oxq": {
                  "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q0oxq/",
                  "text": "Agreed, any way they can fleece us of money, they’ll do it",
                  "author": "hiddenbuck",
                  "created": 1596834285,
                  "upvotes": 12,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g0pg26g": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pg26g/",
      "text": "UMASS ?",
      "author": "ezaf_winter",
      "created": 1596824439,
      "upvotes": 86,
      "replies": {
        "g0pg4dx": {
          "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pg4dx/",
          "text": "Yep",
          "author": "SoakaTheCorka",
          "created": 1596824468,
          "upvotes": 59,
          "replies": {
            "g0qoc2i": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qoc2i/",
              "text": "Aw frick, me too. Please update us!",
              "author": "heckdoggo111111",
              "created": 1596846641,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "g0pczid": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pczid/",
      "text": "I would try to get a subleaser for the fall semester. There are probably going to be quite a few on-campus students who'll be interested either because they have jobs in the area or they just can't study at home. You may have to be willing to give them a bargain on rent though because a ton of people will also be looking for a subleaser.",
      "author": "BigHeartBigShy",
      "created": 1596822990,
      "upvotes": 28,
      "replies": {}
    },
    "g0p56yt": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0p56yt/",
      "text": "Maybe see if you can break the lease. May cost a little bit but it would be far cheaper over the long run. Maybe the landlord will show a little mercy and not charge (not likely, but possible).",
      "author": null,
      "created": 1596819425,
      "upvotes": 407,
      "replies": {
        "g0p5aof": {
          "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0p5aof/",
          "text": "Wouldn’t that leave my roommate to pay for the whole thing? I don’t want to screw anyone over like that",
          "author": "SoakaTheCorka",
          "created": 1596819475,
          "upvotes": 133,
          "replies": {
            "g0pq0dj": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pq0dj/",
              "text": "If it’s a university apartment, don’t they rent by room? So your roommate is renting one room and yours would just be vacant and available for someone else? When I look for rentals in college towns apartments always seem to be by room.",
              "author": null,
              "created": 1596829151,
              "upvotes": 75,
              "replies": {
                "g0qe2te": {
                  "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qe2te/",
                  "text": "If it's an actual city it's unlikely. I live in a very student heavy but major city and its joint.",
                  "author": "wackrapconcarne",
                  "created": 1596841049,
                  "upvotes": 30,
                  "replies": {
                    "g0qtygl": {
                      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qtygl/",
                      "text": "A lot of apartments surrounding my school that aren’t university housing but market themselves to students make their leases person by person so that if one person breaks the lease it doesn’t screw over the others. Maybe this could be the case for you?",
                      "author": "Mozz8",
                      "created": 1596849826,
                      "upvotes": 8,
                      "replies": {
                        "g0rasik": {
                          "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0rasik/",
                          "text": "That's smart. I havent seen that around my uni but it makes alot of sense.",
                          "author": "wackrapconcarne",
                          "created": 1596859884,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g0p9sdi": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0p9sdi/",
              "text": "Chances are if it’s a university owned apartment, run by the housing office at your school, that rent is not affected by someone vacating their specific room. Your room would most likely be locked off so other residents couldn’t use it without paying for it, therefore leaving them to only pay their agreed on share of the rent.",
              "author": "cherryghino",
              "created": 1596821567,
              "upvotes": 74,
              "replies": {}
            },
            "g0ptduk": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0ptduk/",
              "text": "I see these other dudes thinking you're in uni housing, though it doesn't seem that you are. Your roommate likely would get stuck with the rest of the bill. Definitely something to discuss with your roomie before just dipping out on him.",
              "author": "Suchofu",
              "created": 1596830759,
              "upvotes": 45,
              "replies": {}
            },
            "g0q5utj": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q5utj/",
              "text": "If it's an off-campus, privately owned and managed apartment, your roommate will have to pay the full amount of the rent. If you want to break the lease, see if your roommate wants to do the same.",
              "author": "Coolmeow",
              "created": 1596836798,
              "upvotes": 10,
              "replies": {}
            },
            "g0q93xe": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q93xe/",
              "text": "Good luck trying to get out of your contract. The off campus housing I am in said they only accept two options NO MATTER the circumstances. \n\nPay your entire lease’s worth of payments upfront to get out OR find a sublease. Good luck.",
              "author": "AfterAmbition",
              "created": 1596838465,
              "upvotes": 10,
              "replies": {}
            },
            "g0q5y9o": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q5y9o/",
              "text": "I don't believe landlords can charge your roommate as long as your contract stated that they weren't responsible for getting the whole monthly charge paid. \n\nI may be wrong",
              "author": "helysia",
              "created": 1596836847,
              "upvotes": 1,
              "replies": {
                "g0t3si4": {
                  "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0t3si4/",
                  "text": "Problem is, every lease I've ever seen has had that provision",
                  "author": "Karakov",
                  "created": 1596908905,
                  "upvotes": 2,
                  "replies": {
                    "g0uf48n": {
                      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0uf48n/",
                      "text": "Aww okay. I wish you luck",
                      "author": "helysia",
                      "created": 1596934035,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g0pvso0": {
          "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pvso0/",
          "text": "This is unrelated, but during the beginning of the pandemic when it was getting rough and everything shut down. My roommate was a day late on his half of the lease and they threatened to evict us if we didn’t pay within 3 days. This just shows some places just don’t give a fuck about you, just your money. It’s marketed as (for College kids) too. They just now started requiring you to have a minimum of $100K renters insurance... let’s just say this is my last month there...",
          "author": "sirpumpington",
          "created": 1596831935,
          "upvotes": 30,
          "replies": {
            "g0py21w": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0py21w/",
              "text": "It actually wasn't legal to evict anyone during quarantine days.",
              "author": "Duckduckgosling",
              "created": 1596833041,
              "upvotes": 14,
              "replies": {}
            },
            "g0q4x77": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q4x77/",
              "text": "The renter must have insurance ? Didn't know that was a thing but I never actually rented before. Gonna look into that",
              "author": "BisexualWale",
              "created": 1596836321,
              "upvotes": 4,
              "replies": {
                "g0q55ub": {
                  "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0q55ub/",
                  "text": "Not all places, the place I’m moving into doesn’t require it, it’s not a bad idea but when you’re a broke dude going to College with no extra financial help you can’t really afford it",
                  "author": "sirpumpington",
                  "created": 1596836444,
                  "upvotes": 6,
                  "replies": {
                    "g0qdt7y": {
                      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0qdt7y/",
                      "text": "Renter's insurance is usually not very expensive - mine was between $10-20 per month. But it can cover things like stolen or damaged laptops or other electronics - in some cases even if you were out of the apt.\n\nAnd it would shield you from having to personally make up for any damage to property or if a friend were to get hurt while at your apt.\n\nYMMV",
                      "author": "staying_this_time",
                      "created": 1596840908,
                      "upvotes": 5,
                      "replies": {
                        "g0skkj7": {
                          "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0skkj7/",
                          "text": "Yeah for $150 a year, I got $10k in coverage in case shit happened and I lost everything.",
                          "author": "Sproded",
                          "created": 1596898311,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g0pxwui": {
          "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pxwui/",
          "text": "I would discuss with your roommates, as they're probably in the same boat. If you are right around your renewal (like you signed for another year, but that lease actually hasn't started yet.) You have much better chances of working it out with your complex, but you can still try. Some will try to charge you 3 months rent to break, but hey, still better than 12.",
          "author": "Duckduckgosling",
          "created": 1596832971,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "g0oy0fc": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0oy0fc/",
      "text": "What state is this?",
      "author": "PillowsTheGreatWay",
      "created": 1596816057,
      "upvotes": 35,
      "replies": {
        "g0ozs0a": {
          "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0ozs0a/",
          "text": "MA",
          "author": "SoakaTheCorka",
          "created": 1596816851,
          "upvotes": 34,
          "replies": {
            "g0pju8r": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pju8r/",
              "text": "Lemme guess, Amherst?",
              "author": "tricon9",
              "created": 1596826225,
              "upvotes": 23,
              "replies": {}
            },
            "g0pjuh5": {
              "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0pjuh5/",
              "text": "ty",
              "author": "PillowsTheGreatWay",
              "created": 1596826228,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "g0olzj8": {
      "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0olzj8/",
      "text": "[deleted]",
      "author": null,
      "created": 1596810922,
      "upvotes": 56,
      "replies": {
        "g0om279": {
          "link": "/r/college/comments/i5eu35/my_college_just_said_all_campus_facilities_will/g0om279/",
          "text": "Did you have any roommates? How does that work",
          "author": "SoakaTheCorka",
          "created": 1596810954,
          "upvotes": 20,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634052374
}