{
  "sid": "qma9be",
  "link": "/r/college/comments/qma9be/what_to_bring_to_my_dorm/",
  "title:": "What to bring to my dorm?",
  "text": "So I've been basically in high-school but doing dual enrollment part time last year as a junior and fulltime this year as a senior. But besides that, I applied for Ga Tech, UGA, and Ga southern all for fall 2022. Ga southern took about a month to accept me lol, but I'm not sure if I got accepted yet by UGA or Ga Tech (as I did early action so I should find out towards January because these are my 2 schools I would love to attend most). The main thing I'm wondering is what am I literally not allowed to bring. I believe the dorm I'm getting is an on campus apartment style dorm (living room, kitchen etc.). With all that being said, I don't plan to bring much of anything: clothes, shoes, maybe a TV, only because GA Tech actually recommends you to bring one, my 2 monitors, my PC, a laptop, and my peripherals for my PC.  However, the only thing I can't find much about on is if I'm allowed to bring furniture. I don't plan on bringing anything besides my chair I currently have and use. On Tech's website about the rules and all, it says \"students are not allowed to remove furniture from their dorms or rooms.\" which is apparently an act that is fineable. While I don't NEED my chair, I do believe it would be more comfortable sitting in it rather than the chairs they provide. I'm just not quite sure if I'm allowed because it doesn't state that you can't bring your own chair, just that you can't remove their chair from the dorm. the even tell you to bring an entire TV to the dorm so it doesn't sound to crazy to bring a chair as well right? So to sum up this incredibly long post, Could I just bring my chair to the dorm and keep both in my room? I was thinking if I am allowed to, I would just end up placing their chair in a corner somewhere or using it for another purpose like if a roommate wanted to sit next to me and collaborate on an assignment or something similar. I'm not sure, any advice is great, I'll end up asking someone at the school I attend before I begin packing, I just like to have an idea of everything months ahead of time so I can lay it all out on what I need and want to bring. Thanks!",
  "author": "Poojhoon",
  "created": 1635991438,
  "updated": 1636137459,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hj8ike8": {
      "link": "/r/college/comments/qma9be/what_to_bring_to_my_dorm/hj8ike8/",
      "text": "College sophomore here. I’ve brought a chair with me both years. My freshman year i got it for the “aesthetic” but it ended up being super convenient for having friends in my room.",
      "author": "divinemystic",
      "created": 1635994004,
      "upvotes": 1,
      "replies": {
        "hjcvmyw": {
          "link": "/r/college/comments/qma9be/what_to_bring_to_my_dorm/hjcvmyw/",
          "text": "what kind of dorm did you have? I'm planning on getting the mid tier dorm I guess you would say. Personal room for me and another for a roommate with a bathroom in the middle, I'm sure that I should have enough space and what you did is exactly what I thought of doing.",
          "author": "Poojhoon",
          "created": 1636073459,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}