{
  "sid": "qrx0qz",
  "link": "/r/college/comments/qrx0qz/online_school_that_would_allow_me_to_take_classes/",
  "title:": "Online school that would allow me to take classes at my own pace and then join another class right away?",
  "text": "\nIs there an accredited university that would allow me to sign up for an online class, complete it and join another one right away instead of waiting for the next class session? Not sure if this even exists, but figured I’d give it a shot. I’m hoping to get into Computer Science after dropping out of school and working full-time for the past few years.  I’ve tried looking the last few days, but figured I’d ask here.",
  "author": "If_It_Fitz",
  "created": 1636670450,
  "updated": 1636745757,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hka4hs9": {
      "link": "/r/college/comments/qrx0qz/online_school_that_would_allow_me_to_take_classes/hka4hs9/",
      "text": "EdX offers Massive Open Online Courses. They do operate on a schedule but have very frequent start times. You can get actual college credit for the courses, but only from a few universities. \n\nhttps://www.edx.org/credit\n\nI think you’d have to eventually become a more regular student at those universities to complete upper division work. But, I think those schools do have strong online programs.\n\nThat’s the closest I can think of.\n\nLots of universities will offer some courses in more rapid schedules - half of a semester, usually. But again, I think eventually you’ll be stuck taking upper division courses on a full semester schedule.",
      "author": "surreptitiously_bear",
      "created": 1636682892,
      "upvotes": 2,
      "replies": {
        "hkas5r7": {
          "link": "/r/college/comments/qrx0qz/online_school_that_would_allow_me_to_take_classes/hkas5r7/",
          "text": "That is definitely the closest option I have seen. I’ll have to do some research tomorrow and see who/where the credit would be accepted. This is definitely a huge help, thank you so much!!",
          "author": "If_It_Fitz",
          "created": 1636694528,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}