{"sid": "8tuapn", "link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/", "title:": "Going to college isn't just about classes.", "text": "For me, it is an opportunity to live in a safer community and healthier residence. A chance to work with a trainer to get into shape. A time for me to eat better and get financially squared away. It's also a place where I can develop friendships and reunite with old friends. In all, college is a way for me to have a better quality of life while gaining new skills and credentials in a profession more accommodating to my disabilities. ", "author": null, "created": 1529961753, "retrieved": 1632947753, "over_18": false, "upvotes": 870, "upvote_ratio": 0.95, "comments": {"e1cgla1": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1cgla1/", "text": "I tell people to never ignore all the free amazing resources at a University. Great library. Gym. Therapists. On-campus jobs related to your field. \n\nIt's a wonderful place to be.", "author": null, "created": 1530051246, "upvotes": 2}, "e1c9ibj": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1c9ibj/", "text": "The irony is that all of the opposite really happens of what you all said. What college you go to ? \n\n*edit I forgot to say to most people at least ", "author": "rich4ichrich", "created": 1530044885, "upvotes": 2}, "e1c3moy": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1c3moy/", "text": "All those things that aren’t classes towards an agreed are something that you should always do for a healthy life, not just while in college", "author": "Purplefizz1337", "created": 1530040141, "upvotes": 1}, "e1c16yy": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1c16yy/", "text": "I never lived on campus and worked full time through the entire program. I feel like all I did was be tired lol.", "author": "sgntpepper03", "created": 1530038116, "upvotes": 2}, "e1b86w8": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1b86w8/", "text": "You don't need a college for any of those things, and by demanding those things you are contributing to skyrocketing costs that has led to the student debt crisis.", "author": "GeneralShepard", "created": 1530007901, "upvotes": 0}, "e1b503v": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1b503v/", "text": "I totally agree with you. Also, this sounds like it could be a Valedictorian speech.", "author": "Ll_lCY", "created": 1530000850, "upvotes": 4}, "e1b0aq9": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1b0aq9/", "text": "I feel this in my soul! ", "author": null, "created": 1529992112, "upvotes": 2}, "e1aurmd": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1aurmd/", "text": "Thats all well and good but where do the ramen and suicidal thoughts fit in?", "author": "bishrekualboi", "created": 1529984457, "upvotes": 12}, "e1arz3n": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1arz3n/", "text": "Amen to that man! Part of the reason I'm going to college is to get away from my impoverished neighborhood. It's not safe here to walk around, even during the daytime, so there's no chance of me getting exercise by walking around. The last grocery store here closed down years ago and the only way to get (overpriced) food is to go across a 6 lane highway.  The food is all low quality stuff that's bound to kill you if you don't eat too much of it.\n\nIt's just... A mess. Anytime I'm on a college campus everything feels right. I can work out, eat well, meet people, go outside, and enjoy my life without fearing a stray bullet or a widening waist.\n\nIt's all a year away, but I'm closer than I've ever been", "author": "Gamecool_10", "created": 1529981352, "upvotes": 5}, "e1ar5af": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1ar5af/", "text": "Wish I realized this\nWhen I was fresh outta HS", "author": "No_Chill_Bill", "created": 1529980472, "upvotes": 4}, "e1aq3o2": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1aq3o2/", "text": "This is why i wish i was in college ", "author": "sovimax35", "created": 1529979383, "upvotes": 4}, "e1anr9w": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1anr9w/", "text": "Agreed! \n\nI’m graduated now, but college was also a time for me to grow the fuck up. I’m gonna be honest—I used to be a brat. I never did chores at home, and everything in life was handed to me on a silver platter. I lived off the bank of mom & dad, and didn’t even realize how ridiculous I was until I moved out and had to spend a little too long to figure out how to do laundry. \n\nI learned how to be a decent human being—to be considerate of others’ living spaces and my own, and to appreciate all that my family has done for me. The 3 years I’ve spent in college were truly life changing. ", "author": "carbsandcaffeine", "created": 1529976947, "upvotes": 4}, "e1alncp": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1alncp/", "text": "I'm 2 years into college and have met a lot of \"good\" friends who only look for me when in need, and some \"good\" professors who consistently promote their extra classes for money while not putting any effort into their college classes. I may not need friends but I must have my quality education, and the college I'm going to fails me both. But I guess the latter only happens at low-end colleges. Most of what you have said only happen if you have a spot in a famous or at least a decent quality one. And if you do, I'm glad for you. Hope your studying career flourishes and all the best.", "author": "2luauplife", "created": 1529974345, "upvotes": 8}, "e1albvs": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1albvs/", "text": "You shouldn't need to pay a University a stupid amount for those experiences. ", "author": "TytaniumBurrito", "created": 1529974009, "upvotes": 21}, "e1al4ek": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1al4ek/", "text": "36, starting my second year of a 4 year degree. I couldn't agree more. I definately take it way more seriously than I would have at 18, I see the opportunities where I wouldn't have before,  but I dont sweat the small stuff either. \n\nOut of everyone I know that's graduated with my degree and is working, the highest paid people were the worst students. Grades dont seem to matter at all, everyone gets the same piece of paper. ", "author": "keyjunkrock", "created": 1529973785, "upvotes": 4}, "e1ake4q": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1ake4q/", "text": "HAHAHAHAHAHAA LIEEESSSSSS BOYYY DID YOU GO TO COLLEGE YET?", "author": "person1_23", "created": 1529972622, "upvotes": -3}, "e1aj7n5": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1aj7n5/", "text": "Agreed! I just graduated and had a very fulfilling experience academically, socially, and personally. Be constantly curious and you’ll find your calling even if it isn’t exactly your major. Use everything to your advantage. ", "author": "Khalifeh19", "created": 1529971394, "upvotes": 5}, "e1ahj23": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1ahj23/", "text": "Yikes.. I'm going into senior year and am probably the least financially stable I've ever been. I guess I need to reevaluate some things.", "author": null, "created": 1529969614, "upvotes": 53}, "e1age4z": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1age4z/", "text": "This post is so optimistic and I love it. There are so many distractions and roadblocks though! I find managing it all difficult but it is really nice to not have to deal with the pressures of financially supporting myself in full and getting the opportunity to really focus on self-improvement. I just wish it didn’t feel so much like self-maintenance all the time! ", "author": "criticaledinburger", "created": 1529968420, "upvotes": 177}, "e1aessr": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1aessr/", "text": "I get where you're coming from, but at the same time \"going to college is **primarily** about classes\" (too many party-going students forget this). You can live in a safer community, work with a trainer, and eat better for far less than 200k or however much the average cost of college is.", "author": "ov3rsight", "created": 1529966788, "upvotes": 51}, "e1acx50": {"link": "/r/college/comments/8tuapn/going_to_college_isnt_just_about_classes/e1acx50/", "text": "Can't up vote this enough ", "author": null, "created": 1529964914, "upvotes": 59}}}