{
  "sid": "qbz6d6",
  "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/",
  "title:": "Your opinion on these kind of quizzes?",
  "text": "In one of my online classes, a professor quizzes us regularly, but, the way the quiz is formatted legit sucks.\nYou have 10 minutes for 10 questions, which isn’t horrible, but once you submit an answer to a question, you’re unable to return to it. Every single quiz so far, I’ve had at least 1 question I remember the answer to after submitting the question, or I had clicked the wrong thing by accident. I swear, I know I’m not the best student in that class, but the fact I haven’t passed a single one (and that the class average on these are ~65%) should mean something, right?\nI just want y'all opinion on this format. Is it just, and I’m just butt-hurt, or is it actually designed in a very poor way?",
  "author": "Salted_Sunflowers_44",
  "created": 1634731166,
  "updated": 1634750202,
  "over_18": false,
  "upvotes": 23,
  "upvote_ratio": 0.93,
  "comments": {
    "hhco7jc": {
      "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhco7jc/",
      "text": "It sucks. I hate it. I just took an entire test for my research class that had that format. I feel like the format punishes us for no reason",
      "author": "Missmaniequinn",
      "created": 1634731453,
      "upvotes": 27,
      "replies": {}
    },
    "hhd5l4m": {
      "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhd5l4m/",
      "text": "It's lazy. Hard assessment should come from the difficulty of the questions themselves and rigorous grading. You're from Canada, so don't you have to pay a lot for your schooling? As a paying customer, take it up with the head of your school that this is a problem. My school is a fraction of the cost of yours and with COVID being over, we're all back to in-person, non-multiple choice assessment. So this \"it's too time-consuming\" excuse is bullshit, it's your school's fault for not putting enough emphasis on assessment quality. If you don't want your GPA to be meaningless and to not have a proper idea of your understanding of the material (which comes from good quality assessment evaluating that), then take it up as an issue of institutional prestige.\n\nIf you don't get your way, try to publicise the issue to employers, other schools and news outlets. They would want to know exactly what a GPA from your school really means in terms of conceptual understanding, engagement and passion for the material.",
      "author": "thegodofeverydamn",
      "created": 1634740110,
      "upvotes": 3,
      "replies": {
        "hhd5yc5": {
          "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhd5yc5/",
          "text": "I should mention, I'm pretty sure the school I'm attending is one of the cheapest in the country, about 3k tuition a year.",
          "author": "Salted_Sunflowers_44",
          "created": 1634740270,
          "upvotes": 1,
          "replies": {
            "hhd6053": {
              "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhd6053/",
              "text": "Okay, not too bad then. A bit lower than mine.",
              "author": "thegodofeverydamn",
              "created": 1634740292,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhcqvcx": {
      "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhcqvcx/",
      "text": "I've got a class that does this too. \n\nHere's the thing, it's not going to change. \n\nI see this quite a bit in this sub. The lesson I think should be taken away from it is that this is only a challenge. That's it. \n\nThe challenge is clear; you can't go back to questions. This should only really change your strategy for these quizzes. Going to the professor isn't a strategy. \n\nI think that this is a concept that is missed in college when encountering challenging moments like this. To succeed in college is to adapt accordingly and constantly improve. If a test method doesn't suit you, it's not the tests fault. \n\nMy opinion that these sorts of challenges are valuable. To succeed in these sorts of things is to show that you're flexible. We can take these challenges one of two ways, either 'It's the quiz format that's doing me wrong' or 'I need to change my study habits to succeed at these quizzes'.",
      "author": "Awkward_Mail_2786",
      "created": 1634733026,
      "upvotes": 10,
      "replies": {
        "hhcvj98": {
          "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhcvj98/",
          "text": "I have an instructor who uses this format as well. However I really like the way you've reframed this!!",
          "author": "ROIIs360",
          "created": 1634735479,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhcrutg": {
      "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhcrutg/",
      "text": "Many times it's to discourage cheating through changing answers after consulting with other sources.",
      "author": "KindnessRule",
      "created": 1634733564,
      "upvotes": 9,
      "replies": {
        "hhcsknb": {
          "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhcsknb/",
          "text": "Shouldn’t that be what the 10 minutes time limit is for?",
          "author": "Salted_Sunflowers_44",
          "created": 1634733946,
          "upvotes": 9,
          "replies": {}
        },
        "hhdhkae": {
          "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhdhkae/",
          "text": "This is how my exams are and 40% of it is essay or text based. I hate how professors have to make a course harder because it’s online, but grade inflation is real if they don’t. My professor definitely doesn’t want people on chat apps or using google with the backtracking. I guess the cost of not being able to recheck your answers is having an “open book” exam.",
          "author": "kyeelee",
          "created": 1634745062,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhcryz8": {
      "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhcryz8/",
      "text": "i hate it so much, i have a class like that rn and it sucks",
      "author": "badbitchbobo",
      "created": 1634733626,
      "upvotes": 2,
      "replies": {}
    },
    "hhcwxhh": {
      "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhcwxhh/",
      "text": "Yes that's stupid. I would take the same class with another professor",
      "author": "Ph03n1x_5",
      "created": 1634736157,
      "upvotes": 2,
      "replies": {}
    },
    "hhco9bs": {
      "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhco9bs/",
      "text": "I think that format is stupid. Have you talked to your prof about it? Maybe they didnt realise it is that way",
      "author": "Odd-Tie6308",
      "created": 1634731484,
      "upvotes": 2,
      "replies": {}
    },
    "hhdaq7g": {
      "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhdaq7g/",
      "text": "i don’t mind not being able to go back but i don’t like how they’re so stingy with time. i have a class where we get 50 mins to take 50 question exams that also have several long scenarios you have to read to answer some of the questions",
      "author": "RainbowChocolate_",
      "created": 1634742270,
      "upvotes": 1,
      "replies": {}
    },
    "hhdgib6": {
      "link": "/r/college/comments/qbz6d6/your_opinion_on_these_kind_of_quizzes/hhdgib6/",
      "text": "Literally all of my exams and quizzes are like that in nursing school. It sucked at first, but you get used to it. It helps me a lot with not second guessing answers",
      "author": "Zestyclose-Load-6767",
      "created": 1634744632,
      "upvotes": 1,
      "replies": {}
    }
  }
}