{
  "sid": "psps1o",
  "link": "/r/college/comments/psps1o/i_want_to_drop_out/",
  "title:": "I want to drop out.",
  "text": "Yea I know how that sounds, and I know how most people are gonna respond. But just hear me out. \n\nAs far back as I can remember I’ve hated school. Even in 1st, 2nd, 3rd grade, when school is still fun to a lot of kids I couldn’t stand to be there. This feeling carried on into middle school when I basically refused to do any hw and into high school where I reluctantly decided to start getting good grades. \n\nThat being said I love to learn, my brain is just an information sponge. Especially if it’s a area I’m interested in or want to excel at. And I’m not lazy, I spent my summer working at McDonald’s and lifeguarding and got another job at a boat rental place as soon as the pool season ended. \n\nI just can’t stand the school environment, I wake up early in the morning driving to school, not being able to find parking, being hungry asf and in desperate need of caffeine cuz I didn’t have time to eat. Then sitting in a classroom taking notes listening to teachers lecture for hours. Then I have to go home study, finish assignments and wake up to do the same thing the next day. It probably would be better if I made some friends, but I’m kinda having a hard time with that. I’m a very quiet kinda shy person, but I’ve always been able to find people I click with. \n\nIm majoring in Marketing and it might just be that this major isn’t for me. My real passion is music and I love to play guitar and write and record songs. I would I switch to something thats more in that ballpark, but the thing is my parents would be pissed. They already aren’t happy that I’m majoring in marketing and would rather me go into premed or engineering. On top of that they are paying for my tuition so it wouldn’t really be fair to take their money and use it to major in something that wouldn’t be able to get me a job and would make me a disappointment in there eyes. \n\nHere’s where dropping out comes in. I truly and whole heartedly want to pursue music, and I know I can learn all the skills I need for this online and much cheaper than college. If I had the balls I’d just drop out now but I’m afraid of disappointing my parents and being screwed financially for the rest of my life.",
  "author": "Shmamp34",
  "created": 1632251740,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hdse3nz": {
      "link": "/r/college/comments/psps1o/i_want_to_drop_out/hdse3nz/",
      "text": "become a welder",
      "author": "censqred",
      "created": 1632271667,
      "upvotes": 0,
      "replies": {}
    },
    "hdrdpvv": {
      "link": "/r/college/comments/psps1o/i_want_to_drop_out/hdrdpvv/",
      "text": "First, if you want to pursue music, that usually equates to a career in retail sales or coffeeshop management. Are you going to have a better income/less discomfort with or without a degree? Degree. Does it matter what it's in? No. If you give up music when you are married with two kids, what's going to give you more freedom, music degree (selling after school lessons) or  any kind of marketing degree(9-5 job)? Ok, will your marketing degree give you more flexibility in music? You bet- you can market your band/etc as part of the team. Which costs more - music (loans) or marketing (parents)? I'd suck it up and get the marketing degree while taking performance lessons as part of my course load. At least let your parents pay to make you a better musician while you are jumping through their hoop!",
      "author": "CindsSurprise",
      "created": 1632255173,
      "upvotes": 3,
      "replies": {
        "hdrhh93": {
          "link": "/r/college/comments/psps1o/i_want_to_drop_out/hdrhh93/",
          "text": "Degree will definitely give me a decent day job, but the thing is everything I need to learn to produce, write, record and market music can be learned for free  or relatively cheap online, or is the kinda thing u only learn from experience.\n\nMusic marketing is basically entirely social media based at this point and most university marketing programs don’t take it as seriously. At my school internet marketing is an optional class. Which is pretty ridiculous imo",
          "author": "Shmamp34",
          "created": 1632256744,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hdr9r2h": {
      "link": "/r/college/comments/psps1o/i_want_to_drop_out/hdr9r2h/",
      "text": "I would try to switch majors, or possibly transfer to a college that has a good music department or dedicated to music like Berklee. I know it’s still college, but this way you’d be professionally trained and would have better chances at getting jobs.",
      "author": "BoysenberryLatter569",
      "created": 1632253551,
      "upvotes": 1,
      "replies": {}
    },
    "hdr9aso": {
      "link": "/r/college/comments/psps1o/i_want_to_drop_out/hdr9aso/",
      "text": "Are your parents paying your tuition? If not, change to music theory, if you can. Hell, there's plenty of sources online to help with your music endeavor. Look at Click! He's not even doing what he got a degree for and is making music and doing things he likes.",
      "author": "TheLavenderAuthor",
      "created": 1632253363,
      "upvotes": 2,
      "replies": {
        "hdrg1hs": {
          "link": "/r/college/comments/psps1o/i_want_to_drop_out/hdrg1hs/",
          "text": "They are paying my tuition. That’s why I said I’d feel guilty wasting their money on a degree that can’t get me a job and would make me a disappointment in their eyes lol",
          "author": "Shmamp34",
          "created": 1632256142,
          "upvotes": 1,
          "replies": {
            "hdrg76t": {
              "link": "/r/college/comments/psps1o/i_want_to_drop_out/hdrg76t/",
              "text": "They obviously already see you as somewhat of one based on your current major so might as well do what you want",
              "author": "TheLavenderAuthor",
              "created": 1632256208,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634051345
}