{
  "sid": "nynzm3",
  "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/",
  "title:": "Does anyone else feel like their local community college teaches better than the 4 years theyre going to?",
  "text": "Im taking anatomy at a community college and its so much more straightforward than my quote on quote competitive public school. theres no bullshit weedout mindset to deal with and the professor is actually willing to help everyone. theres no poorly written abritrary questions on the test that 80+% of student get wrong. The questions actually test you on the  stuff you learn in class and dont try to trick you on purpose just to lower your score. everything is concise and i feel like i dont have to spend hours feeling anxious trying to teach myself the basics that my professor chose to ignore. God it feels good to actually have an education that doesnt  just treat me like a number. cutthroat competition and grade deflation aint it chief. go to cc's if u have the chance",
  "author": "FewButton1",
  "created": 1623555904,
  "over_18": false,
  "upvotes": 670,
  "upvote_ratio": 0.98,
  "comments": {
    "h1q3mgo": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1q3mgo/",
      "text": "Yup. I had a few profs at CC worked us really hard. Demanded professional reports, and actually read what we wrote. \n\nAt my university, they just skim the report and I kind of feel like it's a waste to put too much effort into writing it. Whether I work really hard or bs my way through it, I get the same grade (usually 100 or close to it) and my classmates are getting 90s with almosy completely incoherent writing so idek.",
      "author": "GneissRockzs",
      "created": 1623674592,
      "upvotes": 1,
      "replies": {}
    },
    "h1p01ct": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1p01ct/",
      "text": "There are two main possible reasons.\n\nFirst, community colleges are designed to teach intro level courses. The instructors there tend to be more experienced at teaching at lower level.\n\nSecond, community college classes tend to be easier, which might provide a false sense of \"better teaching\".\n\nI can't really comment on biology. But as a statistics professor, I have to say we are currently having a major issue of students not learning what they needed to learn from community college math courses.",
      "author": "AcademicDifficulty",
      "created": 1623641872,
      "upvotes": 1,
      "replies": {}
    },
    "h1o2gil": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1o2gil/",
      "text": "Absolutely not, but I think everyone has their own subjective experiences, and not all colleges are the same. I felt like my time at community college was a waste. AP/Honors high school level education, underpaid uninspired professors, heavy focus on political correctness. 2 years in community college felt like a really weak introduction into higher education, and more like an assembly line for political ideologies. I feel like I never really learned much in most of my liberal arts classes, compared to my science classes. My time at Uni was much better. It was more focused, and my teachers were more interactive and caring (lower student:teacher ratio too). We also had so much more resources at the 4 year. My community college cut half our dissections and made them \"virtual\", and we had to share 1 classroom's set of models with 3 other classes. In university we always had our full dissections and enough models for everyone. Sometimes I wonder if I would have had a more objective targeted education if I had gone to University all along.   \n\n\nAnother thing I liked about Uni was my peer group. I feel like we all worked really hard to get where we were at, and our study groups and collaboration assignments were much more productive than Community college. In community college, 75% of the people in our groups wouldn't do their share of the work or participate. Some were very open about being on academic probation. I felt like the work always came down to me and one other responsible student, and the rest were just cruising along for the ride. I couldn't trust asking most of them for help either. When I was at my university, my fellow students felt so much more intelligent, and I was more comfortable asking them for help.\n\nSure, community college may be easier for some. The test questions are somewhat dumbed down, and aren't as challenging as a professional university. Are you really learning when the question is \n\n\"What is H2O?: \n\nA.) Water \n\nB.) Spaghetti \n\nC.) Your professor \n\nD.) Lava\" \n\n(I'm joking of course, lol, not that easy). \n\nHonestly, I've never had a problem feeling like my professors were trying to get me to fail. It's not in their interest. I think that's more of a case by case thing. The only teacher I had who was like that, was in community college and she wouldn't give out A's. It really comes down to your professor and their own motivation. Professors with chips on their shoulders, and professors who have one foot out the door already, generally won't give you the same education and experience as someone who's passionate about their work.   \n\n\nIt was insightful how we both had opposite experiences! What state are you in?",
      "author": "Nighthawk68w",
      "created": 1623622500,
      "upvotes": 1,
      "replies": {}
    },
    "h1o1f6y": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1o1f6y/",
      "text": "I actually enjoy my university for than my CC experience. I go to a mid sized university but still have a 15:1 student to faculty ratio and get all the support of a smaller institution. It also helps though my university is the same cost out of state or cheaper than most states in state tution",
      "author": "joc307",
      "created": 1623621945,
      "upvotes": 1,
      "replies": {}
    },
    "h1nq0qw": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1nq0qw/",
      "text": "This. I am having to retake chemistry, I took introductory chem at CC which wasn't transferable to my degree. I now have to take a higher level chemistry (General Chemistry) at my university. My chem prof doesn't seem to care as much about our understanding of the material as my CC prof. I understand that professors are generally hired for their ability to bring in grant money for their department through research but I would be nice to have my professor explain things that I am confused about rather than tell me to review it on mastering.",
      "author": "DementedCooki3",
      "created": 1623616224,
      "upvotes": 1,
      "replies": {}
    },
    "h1noaha": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1noaha/",
      "text": "It really just depends. I did a quarter at my 4 year, went to community college for 2 quarters and then came back to the 4 year. I noticed that in classes that leaned heavily freshmen the professors had an overall different vibe entirely from the professor. Even if the other classes weren't major specific, the lack of freshman made them much more enjoyable. I don't know why there's such a distinction. That's something I wish I knew back in high school",
      "author": "byorderofthe",
      "created": 1623615392,
      "upvotes": 1,
      "replies": {}
    },
    "h1nnq7d": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1nnq7d/",
      "text": "This is something I’m definitely afraid of, all of my four year professors have been wonderful and not befitting of Community College stereotypes. Actually makes me quite worried",
      "author": "Voltaire_747",
      "created": 1623615117,
      "upvotes": 1,
      "replies": {}
    },
    "h1nkmfc": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1nkmfc/",
      "text": "I teach at a state school and I can tell you from experience that if you teach at a lower tier, you have to try to make the subject as easy as possible to understand. We are always under enrollment pressure where an elite university is not. My husband teaches at a nearby elite university (same field as me) and he never had to make much effort—the students learn no matter what. If they fail out, no problem, there are always more students willing to replace them. Mine need the best pedagogy there is because they were not well served in high school. My administrators are always reminding us that retaining every student is important, so they get lots of personal attention and help. Experiences vary but I have no doubt there are truly excellent teachers at CCs.",
      "author": "raspberry-squirrel",
      "created": 1623613627,
      "upvotes": 1,
      "replies": {}
    },
    "h1nklhx": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1nklhx/",
      "text": "yes do I went to a local college in were I live right now and it went quick and the class I took was clanitery and pastry to open up my open restaurant and took other classes to like catering and business classes to and it went quick because a few of them was online classes too",
      "author": "michelleanzaldua",
      "created": 1623613614,
      "upvotes": 1,
      "replies": {}
    },
    "h1nf747": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1nf747/",
      "text": "Yeah I enjoyed my CC A lot more than my University. It's not even close TBH. I was going for an Associate's in Cyber security but ended up transferring for Supply Chain Management. I'm definitely going to go back for the Associates and take the CCNA course because I really enjoyed the school and the teachers. It's the same teachers that teach most of the computer classes so you get to know the teachers really well.",
      "author": null,
      "created": 1623610956,
      "upvotes": 1,
      "replies": {}
    },
    "h1neuws": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1neuws/",
      "text": "all of my CC professors were well into their 60s/70s, didn't have anything more than a Bachelor's degree from 40/50 years ago, and had been out of their respective industry for over a decade. My CC really sucked. I wish I could go back in time and start over, but hey, I got a degree! ....Even if it's a shitty one",
      "author": null,
      "created": 1623610793,
      "upvotes": 1,
      "replies": {}
    },
    "h1net4e": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1net4e/",
      "text": "Big universities goal is to make money, small local/community colleges goal is to educate you. I'll take the education every time",
      "author": "cortez_brosefski",
      "created": 1623610768,
      "upvotes": 1,
      "replies": {}
    },
    "h1nec8e": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1nec8e/",
      "text": "Yes. I wish I could get a BA from my cc. Any CC really.",
      "author": "Based_nobody",
      "created": 1623610538,
      "upvotes": 2,
      "replies": {}
    },
    "h1ndxrq": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1ndxrq/",
      "text": "Bigger colleges and universities have to be more by the book since there a lot of students and there's less time for individual attention. More prestigious schools function more for research so teaching is sometimes considered secondary. And if a prof has tenure, they might hardly give a shit. But if depends, of course.",
      "author": "William_Wisenheimer",
      "created": 1623610343,
      "upvotes": 1,
      "replies": {}
    },
    "h1nd8b5": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1nd8b5/",
      "text": "Guess what, I came from a 3rd world country in SEA, went to Japan for uni, hell I regret it every second I spent there, not because of the country, or different culture, or environment, it's the fuckin ugly uni with its horrible curriculum",
      "author": "OxheadGreg123",
      "created": 1623610002,
      "upvotes": 1,
      "replies": {}
    },
    "h1nb2on": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1nb2on/",
      "text": "I liked my CC more than my uni.\n\nIt’s a shame CC’s get shit talked by people and In Hollywood cause mine ranked pretty high for my state. And the people who are just lazy af and treat it as a joke",
      "author": "Redd889",
      "created": 1623608969,
      "upvotes": 1,
      "replies": {}
    },
    "h1nang7": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1nang7/",
      "text": "it's actually the opposite for me lol. i'm taking an intro macroeconomics class at my cc rn and my experience is definitely worse than what i had at my university this past year. questions on quizzes can be extremely arbitrary and sometimes come from an entirely different chapter. also, the prof doesn't really teach. we just have to read the textbook and keep up with the schedule. but i actually think that's how most econ course are run unfortunately.",
      "author": "ble22ed",
      "created": 1623608765,
      "upvotes": 1,
      "replies": {}
    },
    "h1na1pw": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1na1pw/",
      "text": "Because University is more of on your own with large lecture sessions and maybe smaller lab sessions.\n\nCommunity college is a lot smaller and generally you can get direct help from the instructor.",
      "author": "Romano16",
      "created": 1623608467,
      "upvotes": 1,
      "replies": {}
    },
    "h1n9ogo": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1n9ogo/",
      "text": "YES   \nYES  \nand YES.  \nI'm just about done with my BA; did first two years at local tech school, and the most memorable professors I've had were - guess where - at bumblenothing tech school. Most all of them were so down to earth, so passionate, so willing to carry a riveting discussion on a barely-related tangent simply because they could engage the class so well. \n\nMy astronomy instructor was one I'll never forget: he was so passionate, he came out of retirement to teach at the college even though he admitted he was basically teaching for free (I don't remember the full situation); he always offered to stay late if anyone needed help with concepts, and tried recruiting everyone to visit the stellarium at the local uni. Not to mention, that was back before I really applied myself, and it was only because he kept nudging me forward, I was able to pass that class. \n\nUniversity professors, on the other hand, I'm certain have exchanged their souls and personalities for their esteemed positions.",
      "author": "Severedheads",
      "created": 1623608284,
      "upvotes": 2,
      "replies": {}
    },
    "h1n8bfm": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1n8bfm/",
      "text": "Something I've noticed between my local CC and going to UC Berkeley is that it is far easier to use Rate My Professor at CC as they're more consistently teaching multiple classes vs my UC where a lot of them have 1-2 max classes and are otherwise doing research or are just adjunct to begin with (never mind sometimes having GSI's). It was easy to curate my schedule at the CC with instructors I could verify that way, vs half of the time I can't even find my instructors in RMP at Berkeley. Quality wise I don't think it is massively different, (and can't really compare my upper divisions to CC), but I do think for myself it was easier to find the better instructors at CC because of this, and have a better experience there.\n\nAlso for my department specifically, I got to know almost all of the instructors really well/still work with them, partly because I'd taken 2-4 classes from each (also TA'd in the dept), and there just aren't as many vs at the UC I have repeated instructors but not at anywhere the same rate/they just have so many more. It isn't really a negative, but I do find it a little harder to interact (though that can also be attributed to zoom university) as I just don't know them as well/am unlikely to take as many classes with them vs my CC experience. The positive is there are just a lot more class options, though.",
      "author": "Hellodeeries",
      "created": 1623607612,
      "upvotes": 1,
      "replies": {}
    },
    "h1n6y6n": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1n6y6n/",
      "text": "If you are at a large 4 year, the professors on tenure track or already tenured are focusing on research. They may teach 1-3 course per year if it’s an R1. The instructors are probably at a CC because they want to teach, hence better teaching. Sorry for your situation.",
      "author": "tactful-dan",
      "created": 1623606941,
      "upvotes": 1,
      "replies": {}
    },
    "h1n31lk": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1n31lk/",
      "text": "My son is finishing up his Associates in Cybersecurity at CC and transferring to a Uni that offers BS Cybersecurity online. Straightforward assignments and due dates with pop up reminders. He'll be traveling with us retired parents this winter to the subtopics. All he needs is a laptop and interwebs.",
      "author": "JGIRLMANDELL",
      "created": 1623605045,
      "upvotes": 2,
      "replies": {}
    },
    "h1n0seq": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1n0seq/",
      "text": "Speaking from personal experience, at the CC I went to for 3 semesters the professors were more passionate about teaching the subject matter compared to the 5 semesters I spent at a private university where professors were more focused on research and they were there because they had to and not because they wanted to.",
      "author": "Ech10100",
      "created": 1623603932,
      "upvotes": 1,
      "replies": {}
    },
    "h1n0qom": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1n0qom/",
      "text": "Having just recently transferred from a CC to Uni, I can say I miss several of the CC professors. I've had good and bad, but the CC professors actually wanted you to learn and would help answer questions.   \nFast-forward to UNI with the pandemic. The UNI professors wouldn't answer questions or would email a copy/paste section of the book to read on the topic of the question. It was so bad with some that I had to make formal complaints, negative reviews, and horrible class evails.   \nI'm hoping Fall semester is better, if not I'm transferring again.",
      "author": "deaviend",
      "created": 1623603908,
      "upvotes": 1,
      "replies": {}
    },
    "h1mzvit": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mzvit/",
      "text": "It depends on the university. I had a wonderful experience with mine. Most of my professors were accessible when I needed them, campus resources were readily available. I had a professional relationship with all my professors, and felt comfortable discussing grades and asking questions in class. But, I made sure I went to a university where I wouldn’t be in any lecture halls for that reason. My biggest class had 35 students and it was a sociology class that was an easy A and a waste of energy and resources.",
      "author": "roganwriter",
      "created": 1623603481,
      "upvotes": 3,
      "replies": {}
    },
    "h1mz11m": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mz11m/",
      "text": "I actually transferred *back* to my CC after experiencing one semester at my university. The instruction level was far below what I had been receiving at the CC and I didn't want to pay more for less.\n\nEventually I had to continue on at the university of course, but that situation really knocked the stars out of my eyes about what a 4 year college actually is.",
      "author": "TorchIt",
      "created": 1623603064,
      "upvotes": 6,
      "replies": {}
    },
    "h1my7ru": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1my7ru/",
      "text": "Some of the community college profs are also highschool teachers so they are the ones better at teaching. In college most profs are more focused on research first IMO.",
      "author": "idkthoughso",
      "created": 1623602662,
      "upvotes": 1,
      "replies": {}
    },
    "h1my7p3": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1my7p3/",
      "text": "Fuck I hope this isn't the case for me. I'm finishing up my associates before I move, I really hope I don't get the 4 year horror story professors I've heard about.",
      "author": "WhatABlake",
      "created": 1623602661,
      "upvotes": 1,
      "replies": {}
    },
    "h1mxj3a": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mxj3a/",
      "text": "I think part of it is there are no dorms. No one goes to a community college to party, they commute to the college to learn and further their personal knowledge and career. Making friends is a nice side effect. I think the instructors understand that.",
      "author": "FurretsOotersMinks",
      "created": 1623602328,
      "upvotes": 12,
      "replies": {}
    },
    "h1mx8aa": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mx8aa/",
      "text": "It's not just CCs, but any teaching college (versus a large research university). Faculty at CCs and teaching colleges (like small SLACS) are assessed first and foremost by teaching, and that is their main job. Faculty at an R1 need to research and publish, first. Teaching is a second (or third or fourth) priority, sometimes an unwanted obligation that gets in the way of their \"real\" work.\n\nObviously you can find bad apples in both models, but I'd argue it's harder for a terrible instructor to \"stick around forever\" at a teaching-focused institution. At a big university, if Professor ABC is a horrible teacher but brings in millions in grant / research monies over time, admin doesn't care about the former.",
      "author": "IndieAcademic",
      "created": 1623602182,
      "upvotes": 6,
      "replies": {}
    },
    "h1mwmtk": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mwmtk/",
      "text": "Yes and no. In community college, no one is pressured into competition like university for trying to get into your major and getting into the classes you want. You have more flexibility and accessibility at the cost of available resources, services, and social experience.\n\nOn the other hand, there are some insturctors who teach at a community college as a second job and has poor teaching quality.",
      "author": "DammieIsAwesome",
      "created": 1623601890,
      "upvotes": 1,
      "replies": {}
    },
    "h1mw7uy": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mw7uy/",
      "text": "From my understanding, CC professors often like teaching, and their goal is to instruct.\n\n\nUniversity professors on the other hand do research, and many of whom place priority on their research over teaching.",
      "author": "StoicallyGay",
      "created": 1623601689,
      "upvotes": 2,
      "replies": {}
    },
    "h1msrrs": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1msrrs/",
      "text": "A lot of the profs at the community colleges are working professionals that teach as a side hustle (at least the most of the ones I know). So they are straight to the point no BS.",
      "author": "TheThingsiLearned",
      "created": 1623599964,
      "upvotes": 1,
      "replies": {}
    },
    "h1mpscw": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mpscw/",
      "text": "All of my CC professors actually either teach at a 4 year or had taught at a 4 year. I loved my CC and really wish CC could do bachelor's degrees.",
      "author": "LikelyWriting",
      "created": 1623598451,
      "upvotes": 5,
      "replies": {}
    },
    "h1mn6ly": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mn6ly/",
      "text": "I think it depends on the teacher. I've had teachers in community college and university who were incredible, and teachers who didn't seem to care about anything at both",
      "author": "yellowdaisycoffee",
      "created": 1623597097,
      "upvotes": 1,
      "replies": {}
    },
    "h1mmmky": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mmmky/",
      "text": "My Marketing instructor works as Head of marketing at a bank. Before that, at a regional chain restaurant. Their grading meant more to me than most others, they were actually doing the job. They have real life experience to judge expertly with.",
      "author": "alcohall183",
      "created": 1623596798,
      "upvotes": 4,
      "replies": {}
    },
    "h1ml73o": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1ml73o/",
      "text": "I just completed a paralegal program at my local CC, all of my professors were working attorneys. They were incredibly knowledgeable and top tier. I took a creative writing class as well, and a year later I saw my professors name being advertised on the top Powell’s books. The program got me my job now as a rookie paralegal, can’t say enough good things about the quality of the professors and advisors. Loved my time there and don’t regret a thing!!! I also had a bad experience at uni, OSU, and left after a year. I was so adamant about not going back, however I changed my mind after working with real terrible people (and almost became one myself) in the back of a kitchen. \n\nI was very lucky!\n\nWhen I was at OSU for a year I had an astronomy professor who worked for NASA, and a education course taught by someone who was the leader of some Oregon Board of Education position for over 40 years. He knew every single school in the state and had amazing stories.",
      "author": "legallyderp23",
      "created": 1623596048,
      "upvotes": 17,
      "replies": {}
    },
    "h1mis7z": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mis7z/",
      "text": "I am going to a small private liberal arts school where the ratio of students to teacher is 10:1 and all of the teachers regardless of their rate my professor score are caring. They cared more than my cc teachers. I believe it has more to do with class size.",
      "author": "tobaccofromcuba",
      "created": 1623594755,
      "upvotes": 19,
      "replies": {
        "h1n09be": {
          "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1n09be/",
          "text": "It's also worth noting that at a SLAC (I'm a professor at one) our job is typically 80% teaching/ 20% research and service or thereabouts. CCs are similar. At a state school, it's closer to 40% teaching/ 40% research/ 20% service. Teaching undergrads is literally less than half of the job (and often less than half of their salary). When I worked at a state school for grad school, I could not put the same energy and time into teaching as I do now while still getting my job duties done. There's something to be said for who works where as well.",
          "author": "BunBun002",
          "created": 1623603669,
          "upvotes": 7,
          "replies": {}
        },
        "h1ms3wf": {
          "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1ms3wf/",
          "text": "And how much your profs are getting paid at a private school vs CC.",
          "author": "outsidesublime",
          "created": 1623599631,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "h1mi4e7": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mi4e7/",
      "text": "100%. But there are valid reasons for this.",
      "author": "whyrweyelling",
      "created": 1623594386,
      "upvotes": 6,
      "replies": {
        "h1mrv28": {
          "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mrv28/",
          "text": "What are they?",
          "author": "Bosschopper",
          "created": 1623599508,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h1mh7z0": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mh7z0/",
      "text": "Yep.\n\nCC seemed professional and caring. My University does not give a fuck so long as my tuition comes in.",
      "author": "Greyskies405",
      "created": 1623593895,
      "upvotes": 19,
      "replies": {}
    },
    "h1mh4hi": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mh4hi/",
      "text": "I think it depends on what you’re wanting to get out of taking classes. I took a few English and history courses at a local community college and they were straightforward, but there wasn’t anything extra beyond the course material. I enjoy my four-year university more because the classes have better discussions and I get to work with my professors.",
      "author": "tlacct",
      "created": 1623593841,
      "upvotes": 6,
      "replies": {}
    },
    "h1mh3hy": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mh3hy/",
      "text": "I LOVED my community college!  All my teachers were working in their field and giving real life advice. I thought that was so cool.",
      "author": "AutomaticYak",
      "created": 1623593826,
      "upvotes": 9,
      "replies": {}
    },
    "h1mbx4e": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mbx4e/",
      "text": "this makes me pretty hopeful, I just enrolled in cc after a terrible experience at a small state school.. honestly I was scared it ruined higher education as a whole for me",
      "author": "kingt816",
      "created": 1623590913,
      "upvotes": 32,
      "replies": {
        "h1mgard": {
          "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mgard/",
          "text": "Just check ratemyprofessor before classes start. I've had really good and really bad professors. Im taking online classes and one bad professor I had seemed like he couldn't do online classes very well but everyone that had him in person loved him.",
          "author": "whathaveyoudoneson",
          "created": 1623593398,
          "upvotes": 25,
          "replies": {
            "h1mzu52": {
              "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mzu52/",
              "text": "ratemyprofessor is not always accurate. I learned that some professors can and will remove negative reviews. I've still had good luck using it, but be leary when professors have no negative reviews.",
              "author": "deaviend",
              "created": 1623603462,
              "upvotes": 8,
              "replies": {}
            },
            "h1mhl5f": {
              "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mhl5f/",
              "text": "almost all of the profs there had less than a 3.0 and gave that “riding this out til retirement” vibe",
              "author": "kingt816",
              "created": 1623594094,
              "upvotes": 5,
              "replies": {}
            },
            "h1mhmco": {
              "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mhmco/",
              "text": "yeah same here, i’m taking an in-personal bio class rn and the professor is great, but the reviews on ratemyprofessor said he was terrible for online learning",
              "author": null,
              "created": 1623594112,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h1ltp45": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1ltp45/",
      "text": "[deleted]",
      "author": null,
      "created": 1623576896,
      "upvotes": -7,
      "replies": {
        "h1lyaa4": {
          "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1lyaa4/",
          "text": "Can you explain what you mean?",
          "author": "Queasy_Repair251",
          "created": 1623581188,
          "upvotes": 3,
          "replies": {
            "h1m6d84": {
              "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1m6d84/",
              "text": "He doesn’t know.",
              "author": "kenlovin",
              "created": 1623587168,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "h1llvqr": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1llvqr/",
      "text": "Tbh if you don’t go to a community college for your general education then you’re pretty stupid. Unless you have a reason not to.",
      "author": "TacticalBacon-_-",
      "created": 1623569508,
      "upvotes": -18,
      "replies": {
        "h1ln2wg": {
          "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1ln2wg/",
          "text": "I don’t think stem majors really do that. When I was a CS major I was told to focus on major prep and squeeze in GE’s to finish the 7 course pattern for UCs.",
          "author": "tha_oz",
          "created": 1623570614,
          "upvotes": 5,
          "replies": {
            "h1mu409": {
              "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mu409/",
              "text": "All majors have general education (and lower division requirements), including STEM majors.",
              "author": "AstuteYetIgnored",
              "created": 1623600635,
              "upvotes": 1,
              "replies": {
                "h1n55ja": {
                  "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1n55ja/",
                  "text": "I don't think you understood my comment.\n\nWhen applying to UC's as a transfer from california community colleges, ALL majors have to fulfill the 7 course pattern which is  just 7 GE's. IGETC is not a requirement but it satisfies all if not most of the GE's that you would have to take once you transfer to the UC. So basically IGETC satisfies the 7 course pattern and some extra GE's.\n\nHowever, it's not recommended for stem majors because stem majors have to take many more classes compared to say social science or art students. That's why they (stem majors) are recommended to only complete the 7 course pattern and focus on major prep before they transfer to the UC.",
                  "author": "tha_oz",
                  "created": 1623606056,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h1ley45": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1ley45/",
      "text": "At my community college, most of my previous and current instructors also teach at a near-by university (ASU). I actually enjoy my school, as I feel the classes are small enough to get direct help from my professors and a sense that they care about my success. Tbh I’m not looking forward to my university transfer, bigger classes, and professors that don’t care as much about your understanding on the material and personal success.",
      "author": "ayoalext",
      "created": 1623563492,
      "upvotes": 147,
      "replies": {
        "h1mhoy1": {
          "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mhoy1/",
          "text": "Take a look at NAU's 90-30 program if they have a program that matches your study. Mesa Community supported me through the entire process",
          "author": "SamSeebourne",
          "created": 1623594150,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "h1l631p": {
      "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1l631p/",
      "text": "CC is a great choice, but from personal experience, I get an equal share of uncaring and caring professors from both systems.",
      "author": "YingkaiLee",
      "created": 1623557223,
      "upvotes": 178,
      "replies": {
        "h1muvr7": {
          "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1muvr7/",
          "text": "I took an online computer science 101 class at my local CC as a prereq for a masters program I finished. The professor looked like he didn't wash his clothes and didn't teach anything plus always extended the due date for assignments (36 coding assignments in 6 weeks). Reviews about him on RateMyProfessor indicated he wasn't good but I had no choice on which class to take.",
          "author": "thecommuteguy",
          "created": 1623601025,
          "upvotes": 15,
          "replies": {}
        },
        "h1mqeye": {
          "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mqeye/",
          "text": "Relatable, I had a biology teacher that was clueless about the material. She would constantly say, I understand it and it makes sense to me, but not to you guys.  =\\_=",
          "author": "Bradscribe",
          "created": 1623598773,
          "upvotes": 9,
          "replies": {
            "h1mtx5s": {
              "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1mtx5s/",
              "text": "College instructors are not “teachers.” I know it seems silly, but words matter. Faculty at a college setting are instructors or professors; at the college level, the goal is to not teach, but to apply what’s been learned.",
              "author": "AstuteYetIgnored",
              "created": 1623600540,
              "upvotes": 8,
              "replies": {}
            },
            "h1nb9yk": {
              "link": "/r/college/comments/nynzm3/does_anyone_else_feel_like_their_local_community/h1nb9yk/",
              "text": "I had a prof at uni who was literally so lost at points during the semester she would desperately ask the class for help and get increasingly embarrassed at the board when she couldn’t work through a problem",
              "author": "airbear13",
              "created": 1623609069,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634056164
}