{
  "sid": "qgdyuo",
  "link": "/r/college/comments/qgdyuo/out_of_20_to_out_of_100_conversion/",
  "title:": "out of 20 to out of 100 conversion?",
  "text": "hello people, so I'm a french student going to a Canadian university. I'm used to the out of 20 system and obviously converted to the out of 100 grading system. Only issue is that I get confused as to which grades are 'good'. So a 75% would be a 15/20, which is pretty good to good depending on the course. But apparently a 75% is bad, and I can't find an accurate scale to make the conversion. Was wondering if someone here has had the same experience and could give me an accurate conversion of the grading system. thank you!",
  "author": "lucasphyxia",
  "created": 1635276026,
  "updated": 1635302379,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hi5m247": {
      "link": "/r/college/comments/qgdyuo/out_of_20_to_out_of_100_conversion/hi5m247/",
      "text": "It honestly is going to vary. Your best bet is to contact someone at the university you're going to or wish to go to, you can look if there is a French advisor in the French department or look to see if the international office has someone who specializes in france, and see if the school has a conversion scale they use.",
      "author": "lanabey",
      "created": 1635277771,
      "upvotes": 3,
      "replies": {}
    },
    "hi5kwle": {
      "link": "/r/college/comments/qgdyuo/out_of_20_to_out_of_100_conversion/hi5kwle/",
      "text": "Okay, so on [this page](https://www.mcgill.ca/gradapplicants/international/equivalency) look up the grade conversions for France and then at the bottom of the page should be a conversion chart from the 20 point system to a 4 point GPA system. Then you can take a look at [this page](https://studentmatrix.ca/blog/gpa-calculator-canada/) or [this page](https://www.easycalculation.com/statistics/learn-percentage-gpa-canada.php) to get an idea of how that GPA converts to the 100 point Canadian grading system.\n\nSorry I couldn't find something more direct. From what I gather, the issue is that the 100 point grading system varies a bit depending on the Canadian province, whereas the 4 point grading system is standard from province to province, so the best way to get a 20 point system to 100 point system conversion is to do it through a 4 point system conversion.",
      "author": "HumanDrinkingTea",
      "created": 1635277330,
      "upvotes": 1,
      "replies": {}
    }
  }
}