{"sid": "anbv6u", "link": "/r/college/comments/anbv6u/how_does_college_work/", "title:": "... How does college work?", "text": "Perhaps this is better suited for /r/NoStupidQuestions , because seeing my peers all seemingly knowing exactly what they're doing has me terrified.\n\nI'm a high school student, in my second semester of my junior year. I have a few universities in mind, but.... I just don't know what I'm doing, and it's leaving me very unsettled and insecure.\n\nOnce I apply for college, how do student loans work? Do I take multiple student loans for multiple years? Do I take one big student loan? When do I search for / apply for scholarships? I'm planning on getting a Master's degree (computer science). Is there a separate loan for that?\n\nOnce I finish my bachelor's degree and start working on a Master's, do I work at a job concurrently as I study for my Master's? Is a Master's like a bachelor's, where you go to classes (mostly) every day, or is it something different? Is my notion of how a bachelor's degree is obtained even correct?\n\nBack to student loans, when do you have to start paying? What happens if you miss a payment? \n\nThanks for the help. I have looked for some type of... \"College tutorial\" but I can't seem to find one, and frankly, I'm terrified.", "author": "reddituser00000111", "created": 1549352145, "retrieved": 1632802341, "over_18": false, "upvotes": 896, "upvote_ratio": 0.99, "comments": {"efujfln": {"link": "/r/college/comments/anbv6u/how_does_college_work/efujfln/", "text": "People downvoted my comment lmao. Brother Went to CC payed nothing then transferred to four year state school and payed nothing. Now job is paying for his masters", "author": "MsJillyWilly", "created": 1549425698, "upvotes": 1}, "efuciq5": {"link": "/r/college/comments/anbv6u/how_does_college_work/efuciq5/", "text": "When I was in high school, I felt the same way. No idea what I was doing even though everyone else seemed to have it figured out. My biggest tip for you is to try not to stress it too much— When applying for college, I did everyone as it came, a step at a time. First touring a couple campuses, then figuring out the application process, then loans, etc. I fill out the FAFSA each year for my financial aid, so check that out. Most everything, like applying for dorms and registering for classes and so on, will be spelled out somewhere on some website, and if not, you can always call the school and ask for some direction. It is overwhelming at times, but you’re going to figure it out and be a-okay. Good luck!", "author": "SparklyAbomination", "created": 1549420663, "upvotes": 2}, "efu902a": {"link": "/r/college/comments/anbv6u/how_does_college_work/efu902a/", "text": "/r/ApplyingToCollege is a good resource for this kind of info.", "author": "WoodlandWizard77", "created": 1549418155, "upvotes": 1}, "efu46x5": {"link": "/r/college/comments/anbv6u/how_does_college_work/efu46x5/", "text": "Can you pay your loans while you're still in school, or over the summer?", "author": "CuratorOfYourDreams", "created": 1549414432, "upvotes": 2}, "efu3764": {"link": "/r/college/comments/anbv6u/how_does_college_work/efu3764/", "text": "Here is one thing go to a public college I made a bad mistake and went to a private one. Unless that private college is the best ever or some ivy it is not worth going to. You’re going to pay more and might have a worse experience. Also if you didn’t get into a school you want or any program or if you don’t know what you want go to a community college.", "author": "person1_23", "created": 1549413636, "upvotes": 2}, "efu2mzm": {"link": "/r/college/comments/anbv6u/how_does_college_work/efu2mzm/", "text": "I was you in my senior year of high school! It's partly what drove me to decline my admissions at big 4 yr schools and go to community college because I had no idea what to do. As a plug for comm. college= it was 99.9% covered by my pell grant. I never had to pay out of pocket for tuition, and the only expenses I faced were textbooks that weren't covered by extra grant/scholarship money, and school supplies. Downside: I worked the entire three years I got my associates and lived with my parents. Now I'm a junior at a 4 yr like an actual student.\n\nLoans are probably the scariest, and once you start taking them out you'll see why people try to avoid taking out loans. However, they are completely necessary unless you have ~15k per semester to pay out of pocket (dependent on school). If you're taking out 30k per year for 4 years, that's over 120k in debt... for a bachelors. So that's when you start realizing how important aid and scholarships are in terms of your bill.\n\nYour bachelor's degree is the end of your undergraduate term. You achieve this by taking two years of consecutive lower level courses for your major (such as Eng101-104 for Eng majors), and then advanced 'upper classmen' courses in your junior/senior levels. Along with your core major classes, which you may take 1-3 courses per semester, you will also take your interdisciplinary classes. This allows you to take courses outside your Eng major, such as a programming class, and get credits, as you need 120 to graduate. They want you to be a well-rounded individual as well, so you're also require to take these gen eds. ", "author": "grebilrancher", "created": 1549413179, "upvotes": 2}, "efu18k1": {"link": "/r/college/comments/anbv6u/how_does_college_work/efu18k1/", "text": "Don’t worry about the set university you want to go to I did not decide until after I got accepted into the ones I chose to apply for. You take out a loan generally everyone semester going through a bank they will do it step by step with you. For your masters I can’t speak for computer science but at least in art fields a good amount of the time a company you want to work for or a school you want to teach at will help you out with the cost if you work for them so long after.", "author": "SoFlySenpai", "created": 1549412049, "upvotes": 2}, "efu0wfy": {"link": "/r/college/comments/anbv6u/how_does_college_work/efu0wfy/", "text": "This is what I tell everyone of my freshman:\n\nYou will fail at some point, it is about how you respond.\n\nPeople can pass by begging and cheating, but you are ALWAYS better than that.\n\nYou will, at some point, feel like you are having an emotional breakdown. You are. Breathe, cry, assess, repair.\n\nMake as many connections as possible. The people you are with are the ones who will hire you, or you them.\n\nDont wait to study for a final. They are hard enough.\n\nAlways communicate with your professor. They remember you, and those letters of rec matter A LOT coming from professors.\n\nSchool, then you, then social\n\nThe last, and most important rule, be proud of yourself. Give it 100%, and no matter the result be proud. Too many students are so hard on themselves because they got a B or a C. Be proud of it because that is your damn blood, sweat, and tears going into it; and no one else's\n\nMuch love, and good luck my friend.", "author": "jettafacer", "created": 1549411780, "upvotes": 2}, "eftswwr": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftswwr/", "text": "No clue how it works in the states, but in Canada you apply for a student loan on a years basis. \n\nIf you are in high school, there should be a school councillor who basically exists to walk you through this and also to keep two or three specific kids from killing them selves. (You can down vote me for being insensitive but you all know it’s true.)", "author": "UnlinkedInformation", "created": 1549405601, "upvotes": 2}, "eftsu7e": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftsu7e/", "text": "I do not know where you reside, I will answer from the Canadian perspective.\n\n\\- You apply for loans every year through the student loan website. So it isn't one big loan, but every year you apply from scratch from that year. You simply fillout the information asked on their website and they will release the money, some of it will go directly towards paying your tuition, and they will transfer some to your bank. You can change this when signing up for student loan.\n\n\\- Scholarships can be found at your institution. You can find more about this through your college/university.\n\n\\- Masters in terms of its classes is up to you. Yes it can be classes everyday, or you could do that part time. Same with bachelors. It is up to you how many classes you take and if you want to be part time or full time. Keeping in mind being full time or part time effects your student loan funding. \n\n\\- You start paying back your student loan once you graduate. The interest starts to collect after you graduate. You pay it as part of your pay check will go towards the loan. This may vary depending on what country you are in and the laws.\n\n\\- Finally, it isn't as complicated as you think. ", "author": "A_KK1", "created": 1549405545, "upvotes": 1}, "eftr18z": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftr18z/", "text": "Thank you for asking the question. I am in the same position. I hope once I apply, I'll get helped along by the admissions office. ", "author": "Gamerz1818", "created": 1549404206, "upvotes": 1}, "eftod4r": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftod4r/", "text": "Take ACT or SAT Junior Year\n\nIt’s never too early to apply to scholarships \n(Try App Raise Me, it’s amazing for my friends and I) \n\n4th Quarter Ask for letters of recommendation (3-4) from teachers you’ve had this year \n\nStart applying 1st Quarter Senior Year\n\nDo your FAFSA in October\n\nFAFSA offers a free funicular aid course, it takes about a half hour, it’s so worth it. Some colleges require it. \n\nFinish Applications before December (most are due Dec 31–Jan 1)\n\nKeep a list of these questions and go to your guidance counselor, they know more than us. \n\n", "author": "anonbff", "created": 1549402326, "upvotes": 2}, "eftnpec": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftnpec/", "text": "Applying to college here, going to be a freshman in college next year\n\nUnfortunately, a lot of this you don’t know until you go through the process. I had someone at the college I’m going to attend help me with loans and getting in and stuff, and high school counselors should be able to answer a lot of these questions. ", "author": null, "created": 1549401866, "upvotes": 1}, "eftnmdb": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftnmdb/", "text": "My best advice for you, coming from a college freshman, is to have your parents come in and sit down with your college/financial advisor and have them explain everything. It can be a complicated process. And more than likely you will have to take multiple loans out .. I had to take out 2 federal loans (which come from the FAFSA) and a plus loan. Message me with any questions, my bf is an enrollment counselor so i have some pretty good knowledge about this .. Feel free to m essage me, ill be glad to help (: ", "author": "ScientificSlothx", "created": 1549401810, "upvotes": 1}, "eftn8nw": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftn8nw/", "text": "No one explained these to me either when I was in High School. I'd say you're already on the right track, just asking these questions. \n\n First, I'd say study for your ACT or SAT. Second, apply for whatever schools you want. Research them and visit them. Just fill in the boxes on the applications. Third, apply for FAFSA. At my university, they let me know what grant's and scholarships I was able to get. Others may disagree with me, but you dont need to know your major going in and your interests will most likely change as you take college courses. (Originally, I was going for teaching and I changed it to Cytotechnology this semester. It was a career I had no idea existed and had no idea how much I'd enjoy the classes). If you realize you want to take a different degree and your school doesn't have it, you could even change schools. My school even has a program where you build your own degree, with help from college advisors. You're first two years are going to be generic classes, so you have those first two years to decide. As you decide, you'll figure out if you need to continue onto a masters program depending on your career plan. Again, you dont need to know this right away. You could even decide youd rather go to a technical school after you start college, and that's fine. A lot of jobs will see those college credits and it can put you ahead of those who just have their technical certs. \n\nEvery college has it's own financial stuff, so you could even just go to a college you like or call, and theyll most likely have a place for perspective students with staff to answer your questions. Even if its questions regarding majors, careers, finance ect. You've got this. ", "author": "AspireandAchieve", "created": 1549401549, "upvotes": 2}, "eftlmwv": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftlmwv/", "text": "Ok so if you go in undecided that is probably the best option for you. I wish I started off undecided. I didn't really know what I wanted to do and I knew science was cool so I started down that track. Now I'm in my second year about to graduate (Dual Enrollment Credits) in a year and I don't like my major and I wish I had more of an exposure to other classes instead of just science. \n\nI recommend that you apply for scholarships from your college before you go there. Some scholarships are for incoming freshman (my college offers 30+ for incoming students) which is good. So when you apply before you actually get there, the money will be in your student account or will go to your bank account depending on where they will send the money. \n\nIf you're planning on getting your Master's I recommend you work for your university so they pay for your master's degree. Lots of colleges do this for master's and phD students, but you have to either teach/TA or work for a department in the school. I know lots of people and TA's who are doing this and I recommend this for you because who doesn't want to get their masters or phD for free (well in reference to your classes/tuition fees you still have to pay for textbooks, but $200 is better than $2000). \n\nStudent loans are typically deferred and you can pay them down while you are in school, but once you get out the banks come calling for you. I don't know if while they are deferred you get interest on them, but get a deferral plan if you can and pay some down on it while you are in school so you aren't struggling. \n\nIf you can I would recommend going to a college in state because the tuition is considerably lower. For instance the college I attend is free tuition because I qualified for a scholarship the state hands out fairly easily. All i have to do is pay for my fees which are about $1500 a semester, however comparing this to someone who goes out of state without a scholarship it's pretty nice. There are also some schools that will consider you instate if NO SCHOOL IN YOUR ENTIRE STATE has your intended major, but most schools instate do so I don't know. That's all I got. Hope that helps and enjoy college, it will be the most memorable time in your life hopefully... it is for me... I got involved on campus though so... that makes a huge difference. ", "author": "Khunte99", "created": 1549400422, "upvotes": 1}, "eftl1ku": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftl1ku/", "text": "Im in 2nd semester of my senior year of HS and Im researching for scholarships like crazy. \n\nMy parents and I are trynna make a deal that they would pay half of the tuition and I pay the rest of half. For me, even after scholarships and my parents covering half of the tuition, I would have to pay 15k (Wanted to go to UIUC for in state but was rejected since cs is getting crazy competitive).\n\nOf those 15k, 5.5k would be from fafsa loan and other 9.5k would be from bank or credit union loan. The school Im planning to go to apparently has a great credit union. Still, I would have to pay 5.5~6.5 percent in interest. Thats about 580 dollars per yesr in interest for 9.5k loan. \n\nI have some ap and dual credits so I might be able to finish a semester faster, so my total loan would be 15k + 15k + 7.5 = 37.5k. Let's round up to 40k since interest could be accumulated if I chose not to work for some months. 40k @ 6percent interest for 10 years = 535 would be monthly payment. \nEven though, cs is a lucrative major, 535 in monthly payment is a lot of money. \n\nI don't really want to be that much in debt starting from my adult life. If ur a junior year student here is my advice.\n\n- Get a great gpa and act. Had I have act score 2 points higher, I could have got 17k/year scholarhip instead of 12k/ year. Thats 5k/year in savings. \n\n- If u can, start saving up for money. Get a job in the summer. Be financially literate. Read some books about personal finance, investing, business etc\n\n- Learn some side hustles. Since ur a cs major, look for local ppl wanting to make a website. I got paid some nice amount of money making a simple wordpress website. Did not have to write a single line of html css js. \n\n- Research scholarship opportunites. Start locally. Ask ur counselor if there are any opportunities. Keep hustling. Think scholarship hunting as ur second job. I spend a hour per day looking into scholarships.\n\n\n\n\n", "author": null, "created": 1549400001, "upvotes": 1}, "eftk5nv": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftk5nv/", "text": "I’m in college and still have no idea how most of this works. Lol you just figure it out as you go, you’ll be fine.", "author": "nandolino19", "created": 1549399269, "upvotes": 2}, "eftjkzu": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftjkzu/", "text": "how many questions are here ?", "author": "jskert", "created": 1549398874, "upvotes": 1}, "eftjgu9": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftjgu9/", "text": "Some advice. Be an Ra, your life will be a little like hell but it will save you so much money ", "author": "150311Aoi", "created": 1549398797, "upvotes": 1}, "eftgagx": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftgagx/", "text": "Don’t know how to explain everything but just wanna let you know barely anyone actually knows what the fuck they’re doing ", "author": null, "created": 1549396643, "upvotes": 1}, "eftebcq": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftebcq/", "text": "Before you get to college:\n\n1. Take your SATs sometime in HS. You can retake them, although it costs money each time you take it. If you're happy with your scores the first time around, no need to retake.\n\n2. Apply to colleges. How many you apply to completely depends on where you live and how you did on your SATs. My very strong advice is to stay in-state, because out-of-state tuition is ridiculously expensive. \n\n3. Apply for the FAFSA. Do it around September or October of your senior year, whenever it opens up (it's first come, first served).This is where you will get your grants and loans. A grant is free money, a loan is money you have to pay back after you graduate.\n\n4. Look for scholarships. You probably think you don't qualify, but that's what I thought when applying for grants, and I did qualify. There aren't many opportunities in life where you're offered free money, but this is one of them.\n\nOther notes:\n\n* I love CS, but most people don't get their Masters. As I write this comment, my classmate next to me just told me she got hired as a software engineer (we're seniors). That's why. It's not really necessary, but hey, the tech industry changes so much that by the time you're a senior, it might be totally different. Just play it by ear.\n\n* Consider community college for your first 2 years. It is significantly cheaper and it's all the same in the end. It also gives you a chance to prove yourself in your GPA if your SATs come back and they aren't what you expected. The only downside is that you'll spend less time at university and it's less common that you'll join a fraternity, if that sort of thing interests you. \n\n", "author": "hatewrecked2", "created": 1549395259, "upvotes": 3}, "efte9f9": {"link": "/r/college/comments/anbv6u/how_does_college_work/efte9f9/", "text": "Nothing useful to add here, I'm just really happy to see I'm not the only one. People seem to get irritated or impatient when I ask these types of questions. I've heard the answer \"it's common knowledge\". Where do you get this common knowledge? \n\nI'm sorry that I was an idiot with a learning disability in high school. \n", "author": "lampdude", "created": 1549395220, "upvotes": 8}, "eftdbb5": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftdbb5/", "text": "you get offered student loans in a financial aid package. you can take out multiple loans in a year. Google \"scholarships for college\", that will give you get you started. I suggest you start now, at least make an excel sheet of scholarships you can apply to. Don't forget to look at specific scholarships within the universities you apply to - many require separate applications albeit from the main application for admission. Master's are separate loans - hopefully since you're CS you'll get one that pays you to get your masters. Also bear in mind that many CS companies will pay for you to get your masters.\n\nYou start paying on student loans 6 months after you graduate/leave college. Missing a payment probably isn't good. Make sure you find out when your first payment is due long before it is due - many people miss the first one.\n\nEdit: if you get enough scholarships, you won't need loans.", "author": "ISpeakWhaleDoYou", "created": 1549394548, "upvotes": 1}, "eftcy3s": {"link": "/r/college/comments/anbv6u/how_does_college_work/eftcy3s/", "text": "Can anybody make a Canadian Version of this?", "author": "thinkerjuice", "created": 1549394294, "upvotes": 1}, "eft7w8p": {"link": "/r/college/comments/anbv6u/how_does_college_work/eft7w8p/", "text": "Hell, I’ve been in college for several years and haven’t taken a loan before, so I don’t know this stuff either. Glad you posted. ", "author": "PotlePawtle", "created": 1549390796, "upvotes": 1}, "eft4vqn": {"link": "/r/college/comments/anbv6u/how_does_college_work/eft4vqn/", "text": "i don't have a lot of answers to your questions but the one thing i can tell you: go to community college for a year and then go to an in-state, cheap university. don't you dare try to go to a private or out of state university that you cannot afford. you'd rather be $50-60k in debt than over $200k before you get your masters. trust me. private schools are fancy but don't fall into their trap. it is NOT worth it. ", "author": "susiemckeon", "created": 1549388711, "upvotes": 2}, "eft4sr2": {"link": "/r/college/comments/anbv6u/how_does_college_work/eft4sr2/", "text": "I don't know how helpful you would find this but my understanding is that there's a whole category on Khan Academy dedicated to answering your questions.", "author": "HisMajestytheSquid", "created": 1549388651, "upvotes": 2}, "eft4off": {"link": "/r/college/comments/anbv6u/how_does_college_work/eft4off/", "text": "Someone above mentioned it, but scholarships, scholarships, scholarships. Ask your guidance counselor and do some Google searches for ones you're eligible for now. Once you decide the schools you're interested in, look through their available scholarships as well, most of them have loads of weird hidden ones (e.g. if you're a lefty, if you're a first generation college student, if you're musically inclined, if you want to be a teacher, etc.). AND, do not shy away from \"expensive private schools\" because you think they'll be too expensive. The real truth is that most of these private schools have endowed scholarship money or a generous alumni giving base that give money for scholarships and depending on your parents' incomes, will give you a scholarship outright. For example, iirc, Pomona was giving full tuition to people whose parents made less than $60k a year. This number was even higher for Stanford. I got super lucky and, without knowing it, was able to go to an Ivy League school paying for only travel, books, and fees (even room and board was covered). Some of that was further offset by scholaships I won in HS and also NCAA scholarships because I walked on to a team once I got there. \n\nFor grad school, depending on what you're interested in, there are also lots of fellowships and scholarships available, though these will likely be more merit based. Look for programs and companies that sponsor further education as well. I've managed to pick up two MAs at little to no cost to myself this way as well. \n\nGood luck, good on ya for asking these questions now!", "author": "eliuhoo", "created": 1549388567, "upvotes": 9}, "eft2gj9": {"link": "/r/college/comments/anbv6u/how_does_college_work/eft2gj9/", "text": "BRAVO! Learn exactly what student loans are and how they work.\n\nFlashback to me: 17 years old, signing on the dotted lines, out of state tuition. \n\nI AM STILL IN DEBT. I have some loans currently in default. Its a mess.   \nEducate  yourself. Just because they are giving you money, doesn't mean its free. It will follow you until you pay it. Miss a payment and your credit report is affect. This affects a lot of stuff.", "author": "StraightIndication", "created": 1549387027, "upvotes": 2}, "eft2fd7": {"link": "/r/college/comments/anbv6u/how_does_college_work/eft2fd7/", "text": "[deleted]", "author": null, "created": 1549387004, "upvotes": 2}, "eft1vzd": {"link": "/r/college/comments/anbv6u/how_does_college_work/eft1vzd/", "text": "People have mentioned federal loans. There are 2 types: subsidized and unsubsidized. I believe subsidized loans dont charge you interest until 6 months after you graduate while the unsubsidized accrue interest right away", "author": "MikeNotBrick", "created": 1549386623, "upvotes": 2}, "eft0fyz": {"link": "/r/college/comments/anbv6u/how_does_college_work/eft0fyz/", "text": "Go to community college ", "author": "MsJillyWilly", "created": 1549385591, "upvotes": -3}, "eft0c77": {"link": "/r/college/comments/anbv6u/how_does_college_work/eft0c77/", "text": "Get a degree in something worth while. Not History or Art. Not saying you can’t make money with those degrees, but it is far more challenging. You will acquire debt that more than likely won’t be easily paid off. ", "author": null, "created": 1549385520, "upvotes": 0}, "efszwh8": {"link": "/r/college/comments/anbv6u/how_does_college_work/efszwh8/", "text": "Go to your guidance department! They can answer so many questions about loans and scholarships. You should be applying for scholarships now and next year. ", "author": "wolfy321", "created": 1549385211, "upvotes": 2}, "efszqiw": {"link": "/r/college/comments/anbv6u/how_does_college_work/efszqiw/", "text": "r/ApplyingToCollege", "author": "YahooYoshi", "created": 1549385091, "upvotes": 3}, "efsxhy9": {"link": "/r/college/comments/anbv6u/how_does_college_work/efsxhy9/", "text": "Eh... For CS I really don't think a Master's is worth it. It might help you get a way better first job out of college, but IME, after your first job in CS, nobody cares where you went to school, nobody cares whether you have a Bachelor's or Master's.              \n              \nYour first job out of college you'll most likely get a whiteboard interview- they'll sit you down, give you a word problem, and you have to write out an algorithm in pseudo-code that solves the problem and matches whatever specifications they give (ie. \"this has to take less than linear time.\") Once you pass that, your foot's in the door and you can do basically whatever with a good recommendation from that first job. I know plenty of people who've gotten the interview even without a Bachelor's and gone on from there.           \n             \nIf you get well into CS though and find that you *really* enjoy the program, and you have the money to spare, then yeah go for a Master's. I don't think you should decide until you're in the 2nd or 3rd year of the program though; CS is definitely one of the most misunderstood majors. CS is about programming about as much as Astronomy is about telescopes. You gotta have big love for Computational Theory, processor architectures and abstract mathematics in general to go for the Master's.", "author": "TheGrimz", "created": 1549383486, "upvotes": 3}, "efsw257": {"link": "/r/college/comments/anbv6u/how_does_college_work/efsw257/", "text": "Go talk to your HS guidance counselor, they should be able to give you the complete hookup and give much more details specific to your situation than anyone here on reddit.  \n  In general, student loans are taken out by semester as needed, with the expectation that you will pay it back after your graduation. Usually you'll do something like pay the interest on your loan while in school, then have to start making the real payments a few months after graduation.  \n  If you miss a payment, you will be hunted and killed. /s Nah, some places have a one time forgiveness program, others don't. Worse case is your interest rate goes up a bit and your credit score takes it hit. Neither is very good, but you have an entire lifetime to make it up. Just do your best to make payments when required. Don't forget to budget to keep from coming up short every single month.   \n  Start applying for scholarships any time between now and until you graduate. All anyone can say is no. Your HS guidance should be a big help in finding scholarships as well as your adviser once you get into college. Some colleges even have a transfer adviser to help as well.  \n  I don't recommend shooting for the masters right out of the gate. Go and take a few classes first. Your masters can be completely unrelated to your bachelors, and you might find a different love along the way. Or you could get one semester in and realize that you hate CS and change majors - which is totally normal and OK.  \n  Scheduling in college is kind of up to you with respect to the times the school offers. You can go every day from 9 to 3 like HS, or do night class, or spread them out all day, or slam them all on Mondays and Wednesdays so you have Tuesday, and Thursday to Sunday off.", "author": "DaleGribble88", "created": 1549382432, "upvotes": 2}, "efspe1z": {"link": "/r/college/comments/anbv6u/how_does_college_work/efspe1z/", "text": "Student loans give you a set amount of money every semester based on the amount you qualify for after filling out FASFA. For scholarships check to see if your State has one based on your results in High School like HOPE in Georgia for example. For repayment typically you have a six month grace period after you graduate/ drop out before you have to start making payments. If you miss a payment there will probably be late fees and if you don't pay it for 270 days it goes into default. For a Master's Degree you can get loans but probably working for 4 years and then going would be a better option as you would have work experience already. Typically a grad student will be doing their own fair share of class work while also being a researcher or a TA for a class. It's also not unusual to see them teaching intro courses for Freshman. Doing this typically get's them a stipend while also reducing the amount they owe for tuition. ", "author": "Atsubaki", "created": 1549377442, "upvotes": 6}, "efsoheo": {"link": "/r/college/comments/anbv6u/how_does_college_work/efsoheo/", "text": ">I'm planning on getting a Master's degree (computer science).\n\nI recently did a lot of research into CS and ME degrees. Typically, a Masters in CS has an immediate effect of boosting you ~2 years in pay. Considering that a Masters in CS takes 2 years to get, there's no immediate advantage. But there might be advantages in promotions later on (7+ years of experience), so you might eventually want to get it.\n\nPlay it by ear. Don't immediately plan on getting your Masters. Also, consider the fact that your Masters doesn't have to be identical to your Bachelors. You could get a Bachelors in CS and a Masters in Business Analytics, or a Bachelors in EE and a Masters in CS, etc...", "author": "_Eggs_", "created": 1549376699, "upvotes": 36}, "efsmfx2": {"link": "/r/college/comments/anbv6u/how_does_college_work/efsmfx2/", "text": "I’ll do my best to answer all of your questions. I think you have a very good idea about what you want to do. I’m on mobile, so sorry for bad formatting. Lets talk loans. The difference is price and financial aid. In order to get financial aid, you submit a fafsa. When you’re admitted to the university you’re going to, they will have a link you click to fafsa.gov. You sign up, do their fafsa form and bam, you’re done with that. You do the fafsa once every semester. They will email you saying “hey we’ll give you $5,000 for the year with barely any interest and you pay it back once you’ve been completely done with your masters for 6 months out of school.” financial aid is your best source in loans because it has a very low interest rate and they most likely have a 6 month grace period after you get your masters until you have to pay them back. This is usually the same with loans taken from a bank. If you take a loan from a bank, it’s because tuition is too expensive to cover by only financial aid and your own money. You go to a bank website and apply for a loan, and you’ll get it if you have a parent co-sign it, or if you have good credit. If you want to get good credit, apply for a credit card now, and then use it and pay it back ON TIME every month. Ask me if you have any other questions. Also, you take out the same kind of loans when you are completing your masters degree, although those classes are typically more expensive than undergrad, so you may end up taking out bigger loans. If you miss a payment on your loan, I’m assuming you’re interest goes up or your co-signer has to help pay because they’re responsible for it? I would assume the latter, the co-signer is responsible to pay if you had one. Not totally sure.\n\nNow scholarships, I unfortunately never did scholarships until now. Please do them! It’s free money! Once you know what universities you’re going to, you go to their website, click something along the lines of “student” then there should be a link that says “scholarships” if you can’t find it, use the custom search bar. Then follow their instructions. That’s about all I can help there.\n\nOnce you finish your bachelors, you will apply to the masters program in your field of computer science. They will admit x amount of students a semester. Assuming you are admitted, you will take classes harder than your undergrad classes. They are more expensive too. No differences in financial aid or loans from my knowledge. Just bigger to pay for the more expensive classes. You choose whether or not you want to study and have a job. If you can get a job with your bachelors degree, some companies will pay for your masters degree assuming they think you will stay with them. This might be rare though.\n\nYou had one more question about obtaining a bachelors. These programs work out as “You will do 120 total credits through your four years, and out of those 120, like 44 will be related to this bachelors degree” a masters will be like “this is a 56 credit program completed in 2 years” or something like that. You also have what’s called “general education requirements” this means you take classes like human geography, or intro to psychology, stuff that fulfills your requirements. They may be called “Ethical Citizenship” and they’ll have a list of classes you can take that will fulfill that requirement. It’ll say something like take one or two of these classes to complete the Ethical Citizenship requirement. Sorry the post is so lengthy, I hope this helps!\n\n", "author": "Mystix_", "created": 1549374907, "upvotes": 15}, "efslwy3": {"link": "/r/college/comments/anbv6u/how_does_college_work/efslwy3/", "text": "[deleted]", "author": null, "created": 1549374392, "upvotes": 215}, "efsfy05": {"link": "/r/college/comments/anbv6u/how_does_college_work/efsfy05/", "text": "For the loans part, you take them out by year and start paying six months after you leave school. ", "author": "shadowwolfsl", "created": 1549367431, "upvotes": 49}, "efsesa6": {"link": "/r/college/comments/anbv6u/how_does_college_work/efsesa6/", "text": "Upvoted for exposure, a lot of college stuff goes unexplained sadly. Although some of these things vary on school basis and could be googled.", "author": "Astrocat9", "created": 1549365671, "upvotes": 437}}}