{
  "sid": "mkdrte",
  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/",
  "title:": "I was wondering why the midterm average was so high.",
  "text": "Literally all the answers for my class are on Chegg. The grade in the class is based of of 3 tests and the homework. All of it is on Chegg. The class is on a curve. The class average was a 70. I studied so hard for a 50. Everyone in the groupchat who asks questions about homework and actually puts in effort, has grades in the 30-40 range.  \n\nFuck this.\n\nUpdate for clarification:\n\nSo essentially, the first midterm was adjusted because some of the questions were wrong, so everyone got 30 extra points. I didn't think that the class average was after the adjustment (even though it's pretty obvious now that I think of it) so the class average was a 70 and I got an 80. The curve is added after the class so I have a lot of reasons to be optimistic.\n\nAll the answers for the first test were on the internet and chegg. Essentially working through the problem with just 1 number changed. So a lot of people probably cheated. You do not have to show any work  and grades are just based off the answers. The first test was just 5 really long questions. It's not a great format imo. \n\nI have another midtern soon and hopefully all the answers won't be on chegg like last time. I'm just gonna take it without chegg and hope for the best.",
  "author": null,
  "created": 1617601703,
  "over_18": false,
  "upvotes": 1065,
  "upvote_ratio": 0.98,
  "comments": {
    "gtivt2l": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtivt2l/",
      "text": "Realities of uni. All the kids in frats/sororities/exclusive honors societies also have access to class materials through upperclassmen that give them a huge leg up. Great learning opportunity about the way the world works.  \n\n\nIf enough students are vocal, and the professor gives a damn, they may write and administer a new exam.",
      "author": "GucciBlackface",
      "created": 1617674500,
      "upvotes": 2,
      "replies": {}
    },
    "gti19d9": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti19d9/",
      "text": "Just snitch bro. The cheaters are the ones who started playing dirty. Only counter is to play dirty yourself by ratting them out.",
      "author": "Dragonmoip",
      "created": 1617658976,
      "upvotes": 1,
      "replies": {}
    },
    "gthptsl": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthptsl/",
      "text": "I hated that. My program was rehashed over and over again. Every class had group projects which were all essentially the same assignment year after year. Design a bridge, do a power point for xxx, use this program to do xxx. The entire program floated around on usb sticks.\n\nI didn’t use any of that shit and kind of suffered through. It’s like how tf don’t you guys see what’s going on but it’s because the profs are lazy too.",
      "author": "xxam925",
      "created": 1617653658,
      "upvotes": 1,
      "replies": {}
    },
    "gthl30l": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthl30l/",
      "text": "just stay in your lane and try your best. if these people are cheating in such a difficult major it will really come back to bite them in the ass once they enter the field.",
      "author": "_embracethevoid",
      "created": 1617651505,
      "upvotes": 2,
      "replies": {}
    },
    "gthi0m0": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthi0m0/",
      "text": "This happened to me too. First two exams in my chem class only 5 people got As. I was a bit above average on the first, didn’t do well on the second. One gets dropped so worked my ass off and got the same score as on the first one on the third & final exam. Thought I would at least be in the B+, hopefully A- range. Turns out 45 fucking people got As on the last exam, after only FIVE did on the first two (the whole class is cumulative). There is no doubt in my mind people cheated (the exam was open for 24 hours so it could be easily distributed). But of course my GPA took a hit. It’s so frustrating, I vowed not to take another chem class till we’re in person again. I feel what you’re going through though, it sucks.\n\nEdit: And of course the profs won’t do anything about it, because the higher averages look good for them. Sigh.\n\nEdit again: I just looked up the exam and parts of it are on Chegg. What. The. Fuck.",
      "author": "hsarah01",
      "created": 1617650105,
      "upvotes": 2,
      "replies": {}
    },
    "gthe0tx": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthe0tx/",
      "text": "You mean after all of your studying you didn't still check to make sure the question wasn't anywhere online. That is step one of an online exam my dude",
      "author": "mindfulskeptic420",
      "created": 1617648272,
      "upvotes": 5,
      "replies": {}
    },
    "gthch0b": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthch0b/",
      "text": "Sorry you got fucked but I don’t see how it’s anyone’s fault. Tools were available and you didn’t use them. I’m assuming the test was open notes or a take home test so they just used what was available to them and chegg isn’t free, you have to pay. Sorry you got fucked but no one is to blame for your score.",
      "author": "Ultra-moisturizing",
      "created": 1617647557,
      "upvotes": 0,
      "replies": {}
    },
    "gth7dgb": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth7dgb/",
      "text": "It's not their fault you got a 50 bro.",
      "author": "Bozzz1",
      "created": 1617645222,
      "upvotes": 4,
      "replies": {}
    },
    "gth1xde": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth1xde/",
      "text": "Hey, I’m a co-chair for my university’s honor council. I highly recommend that you email the professor with your concerns about finding the answers on Chegg, and then review the exam parameters and syllabus to make sure that using Chegg would be considered cheating. Unfortunately, if the guidelines did NOT include something about closed-internet, it probably won’t be considered cheating.",
      "author": "leaaaaaaaah",
      "created": 1617642777,
      "upvotes": 2,
      "replies": {}
    },
    "gth0ppf": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth0ppf/",
      "text": "Tell the prof.",
      "author": "Prof_Acorn",
      "created": 1617642233,
      "upvotes": 1,
      "replies": {}
    },
    "gtgwmyr": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgwmyr/",
      "text": "This is also on professors though. They get lazy and don’t create new exams knowing people post stuff online. \n\nI do however think it’s out of line for you to report it as you have no proof they used Chegg or not.",
      "author": "AbleSilver6116",
      "created": 1617640395,
      "upvotes": 1,
      "replies": {
        "gti2fp4": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti2fp4/",
          "text": "These questions usually appear within minutes the test is released. It’s maddening for professors. You should let the professor know. Where the professor might be being lazy is if he or she hasn’t already checked chegg himself. The professor can reach out to chegg and ask for information regarding the time of use and the university can get I. P. Addresses. \n\nIf you are a student, I highly encourage you not to do this. I have spent so much time interviewing students and having to comfort them as they admit to cheating and they realize an academic dishonesty referral will be filed. It’s no fun for anyone.",
          "author": "do-over47",
          "created": 1617659540,
          "upvotes": 2,
          "replies": {
            "gti2rg9": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti2rg9/",
              "text": "There’s not much professors can do aside from that. They use the same questions from schools all over the country there is no way to actually avoid this unless they create new tests each semester which is time consuming.\n\nI’ve had several classes with practice exams that had the same questions as as a regular exam or some. To chase people down with IP Addresses is also nonsense.",
              "author": "AbleSilver6116",
              "created": 1617659701,
              "upvotes": 1,
              "replies": {
                "gti3qdd": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti3qdd/",
                  "text": "I am a professor. I owe it to the students who are not cheating to investigate violations of the academic honesty agreement. I also owe it to the college where I teach so that the grades given truly reflect what each student has learned.",
                  "author": "do-over47",
                  "created": 1617660177,
                  "upvotes": 2,
                  "replies": {
                    "gti4dep": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti4dep/",
                      "text": "I mean I understand, but I’m not sure how you could really prove it anyway. Just the problem with covid now. \n\nAlso, not sure if your college utilizes proctoring services but my college does so there’s no concern for academic dishonesty at least in regards to google. \n\nAnd some professors give open note quizzes and exams for some of the general Eds.\n\nI was in a healthcare program and would never dream of cheating because people lives are at stake....but something such a religion, or government I don’t see the big deal in utilizing the internet. \n\nThe way of testing is SO out dated. In the real world you have resources at your fingertips in your jobs and other things. So I’m not sure why there’s this stigma that you should know everything off the top of your head on an exam. It leads to cramming and not retaining any information.",
                      "author": "AbleSilver6116",
                      "created": 1617660492,
                      "upvotes": 1,
                      "replies": {
                        "gti5kpe": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti5kpe/",
                          "text": "I’m not going to say much else, but I assure you I can prove it and when I am able to prove it the students then confess which then makes it irrefutable proof. I’m going to just advise once again that you do not do this if you are told not to use online sources during a test.",
                          "author": "do-over47",
                          "created": 1617661088,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "gtjvplm": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtjvplm/",
                          "text": "As another professor - the way universities deal with cheating is through a kind of kangaroo court. At absolutely no point do we need to *prove* you were cheating. We only need to demonstrate reasonable suspicion of it. Having an uncommonly high exam mark plus matching your IP (through the portal you took the exam) to the Chegg site is more than enough to file for academic dishonesty. At that point, it’s on you to prove you didn’t cheat. It isn’t a court of law and we don’t assume innocent until proven guilty.",
                          "author": "NoxiousQuadrumvirate",
                          "created": 1617701900,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gtgrjgu": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgrjgu/",
      "text": "Wow I just can’t fathom how so many ppl on this subreddit are trying to justify cheating.",
      "author": "owlwaves",
      "created": 1617638098,
      "upvotes": 9,
      "replies": {
        "gth2p1i": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth2p1i/",
          "text": "Most of the people I know in college have cheated one way or another.",
          "author": "TiVeL",
          "created": 1617643127,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gtgrf6i": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgrf6i/",
      "text": "You should’ve cheated too lmaooo",
      "author": "sharee_",
      "created": 1617638043,
      "upvotes": 0,
      "replies": {}
    },
    "gtgr7qa": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgr7qa/",
      "text": "That's a lazy professor too if he/she re using questions words for words from test bank, before chegg was a thing even memorizing questions from test bank was considered cheating, that involved remembering about a hundred problems without actually solving it.",
      "author": "nghigaxx",
      "created": 1617637951,
      "upvotes": 0,
      "replies": {}
    },
    "gtgpiok": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgpiok/",
      "text": "[removed]",
      "author": null,
      "created": 1617637185,
      "upvotes": -7,
      "replies": {
        "gtgtini": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgtini/",
          "text": ">your a crybaby\n\nYes.",
          "author": null,
          "created": 1617638996,
          "upvotes": 9,
          "replies": {
            "gtgxjq7": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgxjq7/",
              "text": "Lol good luck retaking the class. When you spend hundreds of dollars and another 3-4 months on this one specific class. You could ask in your little head if it was all worth it protecting your integrity. I hate to burst your bubble but every student cheats in their class. When you spend 4 years in college your bound to cheat at least once. This isn't about fairness, its about survival. colleges dont give a shit about your learning experience but to extract as much money as they can. So take advantage of the situation or drown. Its your choice haha",
              "author": "ReadyCarpet1",
              "created": 1617640805,
              "upvotes": -5,
              "replies": {
                "gti13c0": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti13c0/",
                  "text": "Sounds like you had a bad experience, but just know that your situation doesn't apply to everyone. Also, why should it be our responsibility if someone cheats? Just because other students cheated in one of my classes doesn't mean I should do the same.",
                  "author": "naaooonnnngh",
                  "created": 1617658897,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gtgmwi0": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgmwi0/",
      "text": "Welcome to Zoom University!",
      "author": "Rinsed__Idiot",
      "created": 1617636017,
      "upvotes": 0,
      "replies": {}
    },
    "gtgjoae": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgjoae/",
      "text": "What is the point of being graded on curve? Why do Americans need to turn everything into a game show?",
      "author": "LubieDobreJedzenie",
      "created": 1617634506,
      "upvotes": 0,
      "replies": {
        "gtguz48": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtguz48/",
          "text": "Lol why are so many ppl in this sub trying to bash America all the time. \nAre there no curves in Europe or Asia? Especially in STEM classes? Most international students that I have met had curves in their home country too. This isn’t something uniquely American lol",
          "author": "owlwaves",
          "created": 1617639648,
          "upvotes": 5,
          "replies": {
            "gtgx55l": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgx55l/",
              "text": "Never ever throughout all my education in Poland I was graded on curve. Is the point of exam beating your classmates or checking if you know required stuff?",
              "author": "LubieDobreJedzenie",
              "created": 1617640622,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "gtgeigr": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgeigr/",
      "text": "i admire your academic integrity, but cmon man...",
      "author": "blackiechan99",
      "created": 1617631954,
      "upvotes": 26,
      "replies": {}
    },
    "gtge8id": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtge8id/",
      "text": "That happened in thermo pchem last fall. I got a 60 but average was in the 70s and I'm usually towards the top, so the curve messed up my grade a lot.",
      "author": "yung_erik_",
      "created": 1617631809,
      "upvotes": 40,
      "replies": {}
    },
    "gtgcmr2": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgcmr2/",
      "text": "I had this happen once as a returning to college student. Back when I was in school you had to pay someone who took the class for their old tests if you wanted to cheat so I didn’t even know the tests were posted online. I sat down with my professor because the class average was so high and I studied so hard for a failing grade that wouldn’t be curved. SHE SHOWED ME THAT TEST ANSWERS WERE ONLINE. \n\nI was so pissed. How can you be a professor getting paid to literally teach us and know that most of the answers are online? I’ll give it to her, she did make course corrections after that and is actually my thesis chair now, but oh man was I not her fan in that moment.",
      "author": "MrsMelodyPond",
      "created": 1617630975,
      "upvotes": 110,
      "replies": {
        "gtgsku4": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgsku4/",
          "text": "Because it takes a lot of work to fight that kind of cheating and not every Professor or University care. Particularly when the class is a 100-200 level Intro style class. Reusing test questions from your past classes, from pre-made courses or tests that come with the text, and from peer Professors is much easier and quicker. \n\nStill sucks. But that’s why.",
          "author": null,
          "created": 1617638565,
          "upvotes": 46,
          "replies": {
            "gtgtefc": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgtefc/",
              "text": "Yeah I totally get it, and now that I know the professor I absolutely feel for her. The only issue  was this was my first class at a university where the cost per credit was probably ten times the cost of my community college credits. I probably just wasn’t in a class big enough to notice but I had never experienced this at CC. Universities can’t charge more saying they’re better quality than community college and then pull this nonsense.",
              "author": "MrsMelodyPond",
              "created": 1617638943,
              "upvotes": 12,
              "replies": {
                "gthefyl": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthefyl/",
                  "text": "Is the value you get from an education in whether or not other students can cheat their way through an exam or not?\n\nI don’t think the practice of reusing test answers which can be easily found online is a universal predictor of the quality of the class.",
                  "author": null,
                  "created": 1617648463,
                  "upvotes": 2,
                  "replies": {
                    "gthfea3": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthfea3/",
                      "text": "Well if I’m attending all the lectures, doing all the reading, all the homework, and completing all the study guides and getting a D on a test, but a massive portion of the class cheated and got the answers online then the professor doesn’t know that their teaching method isn’t working. They see that most of the class aced the test so I probably just didn’t work as hard. \n\nAnd it especially affects me if there’s a freaking curve involved. You cheat and get a 90%, I don’t and get a 65%. You’ve ruined the curve and now my grade is lower. Sure I still learned what I was intended to but you try explaining that to a scholarship board that you definitely learned the material so a grade shouldn’t matter.",
                      "author": "MrsMelodyPond",
                      "created": 1617648895,
                      "upvotes": 13,
                      "replies": {
                        "gthm99w": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthm99w/",
                          "text": "Fair (and excellent, really) points.\n\nIn those situations the Professor is likely not matching their syllabus with their tests. I’m guessing that manifests with you starting a test and thinking.... what the hell is this, we didn’t cover this, and I would also find that incredibly frustrating.",
                          "author": null,
                          "created": 1617652045,
                          "upvotes": 4,
                          "replies": {}
                        },
                        "gti8w37": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti8w37/",
                          "text": "Happened to me on midterm. I took it honestly and got a 50, which brought me down a whole letter grade, whereas most people I spoke to cheated and got A's or B's.\n\nI was pretty frustrated and ended the exam wishing I'd cheated too, but I will just prepare in a different way next time, that allows me to get a higher grade but doesn't involve cheating.\n\nSucks when it seems like you're punished for doing the right thing.",
                          "author": "morejamsthanjimin",
                          "created": 1617662761,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gtgx6m1": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgx6m1/",
          "text": "[deleted]",
          "author": null,
          "created": 1617640640,
          "upvotes": 6,
          "replies": {
            "gth0zja": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth0zja/",
              "text": "Oh for sure! I learned way more from classes where my prof had open book, open note, etc. but had you apply the knowledge to situations than classes that asked me to memorize the definition of something or another. \n\nBut if the prof is going to stipulate that it’s not open book and then rest the curve on everyone’s academic integrity, it’s not fair for those of us who don’t cheat to get the worse grade and the short end of the stick.",
              "author": "MrsMelodyPond",
              "created": 1617642356,
              "upvotes": 4,
              "replies": {
                "gth3psw": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth3psw/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1617643581,
                  "upvotes": 0,
                  "replies": {
                    "gth9kbx": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth9kbx/",
                      "text": "Okay well I can’t speak for OP but I can tell you for me it wasn’t open book.",
                      "author": "MrsMelodyPond",
                      "created": 1617646222,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gtgbm4q": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgbm4q/",
      "text": "[deleted]",
      "author": null,
      "created": 1617630449,
      "upvotes": 13,
      "replies": {}
    },
    "gtgae7v": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgae7v/",
      "text": "[deleted]",
      "author": null,
      "created": 1617629800,
      "upvotes": 0,
      "replies": {
        "gtgik7s": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgik7s/",
          "text": "Programming classes are the worst thing to cheat on. You are actively harming yourself by not learning the content.",
          "author": null,
          "created": 1617633974,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gtga4jx": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtga4jx/",
      "text": "If you do decide to use Chegg Study in the future because everyone else does, do not use information that you have given the school, use a gift card, use a VPN/Tor, and do not post questions with specific anti-SEO such as different numbers and names if the professor writes their own exams.",
      "author": null,
      "created": 1617629651,
      "upvotes": 6,
      "replies": {
        "gtgc0oe": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgc0oe/",
          "text": "Lol I feel like we’ve been trying to say this just not as aggressively as this",
          "author": "xsektor",
          "created": 1617630657,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gtg9xql": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg9xql/",
      "text": "[deleted]",
      "author": null,
      "created": 1617629549,
      "upvotes": 30,
      "replies": {
        "gtgem2p": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgem2p/",
          "text": "[removed]",
          "author": null,
          "created": 1617632006,
          "upvotes": 26,
          "replies": {
            "gtgr6ye": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgr6ye/",
              "text": "Absolutely wrong. Not everyone cheats. This is another rationalization.\n\nI (and many other profs) now include specific mention that sites like this are not allowed because people do not see a difference between open notes and paying someone to answer the question for you.",
              "author": "Dr_Pizzas",
              "created": 1617637941,
              "upvotes": 15,
              "replies": {
                "gtgrhk4": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgrhk4/",
                  "text": "True, people who have been convinced that not cheating will help in the long run. The thing is that it’s completely false and only hurts you. I’ll take my 3.9 from cheating over a 3.4 while studying my ass off and having no social life. Mr professor",
                  "author": "Whoknvws",
                  "created": 1617638074,
                  "upvotes": 3,
                  "replies": {
                    "gtgurt6": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgurt6/",
                      "text": "You sure about that? I never even cheated in college - my only inefficiency was studying to pass, not studying to learn and starting my job kicked my ass. The only reason I'm able to keep up at work is because I had to study for a certification after graduation that taught me things I had to know for work anyways. But if I hadn't learned all that stuff, I'd be lost now. Sure, you've got some classes at school you don't necessarily need after you graduate, but in general, you're not really expected to take more than intro level classes outside your major.",
                      "author": "lacrimosa122",
                      "created": 1617639557,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "gtgtjfd": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgtjfd/",
                      "text": "You made an outrageous statement that is verifiably wrong and I corrected it, as people who think \"everybody cheats\" may use that to justify their own cheating. It's just not true. In reality only about 50% of students have EVER cheated, and thus even fewer are serial cheaters.\n\nYou can keep your new rationalization. I will not chase you through moving goalposts for every justification you want to add.",
                      "author": "Dr_Pizzas",
                      "created": 1617639005,
                      "upvotes": 8,
                      "replies": {
                        "gtidvm6": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtidvm6/",
                          "text": "I like that last sentence. I think I'll keep it in mind for future conversations on this app.",
                          "author": "morejamsthanjimin",
                          "created": 1617665287,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gtgetiz": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgetiz/",
              "text": "i’m not saying people shouldn’t cheat. i’m just saying if you’re doing this and trying to act like it’s not cheating, you’re lying to yourself. unless it’s specifically stated that you can, but honestly even in online classes i’ve never heard of that being a thing.",
              "author": "Healthy_Combination3",
              "created": 1617632112,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "gthsodq": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthsodq/",
          "text": "Cheating is based",
          "author": "fatfuck3000",
          "created": 1617654965,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gtg9x8v": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg9x8v/",
      "text": "I'm really tired of these types of posts. It just attracts low-achieving students who think the solution to everything is cheating.",
      "author": "saywcu",
      "created": 1617629541,
      "upvotes": 35,
      "replies": {
        "gtgaajp": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgaajp/",
          "text": "Sorry, I was 2am sadposting",
          "author": null,
          "created": 1617629743,
          "upvotes": 23,
          "replies": {
            "gtgdr0a": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgdr0a/",
              "text": "It's all good.\n\nDon't worry about the people cheating. When in-person classes come around, most of these people will go back to failing their classes because they don't have outside resources anymore.",
              "author": "saywcu",
              "created": 1617631558,
              "upvotes": 11,
              "replies": {
                "gtgs8t8": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgs8t8/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1617638412,
                  "upvotes": 1,
                  "replies": {
                    "gtgu16n": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgu16n/",
                      "text": "> Keep overworking yourself for that institution that abuses and exploits students like you\n\nA little dramatic don't you think? Regardless, you know nothing about me so it's odd to assume that I'm 'overworking' myself. \n\nNot gonna entertain your attacks though. Take a break from Reddit, it's a beautiful day outside. \n\nYou seem a little angry!",
                      "author": "saywcu",
                      "created": 1617639227,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gtgydc6": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgydc6/",
          "text": "[deleted]",
          "author": null,
          "created": 1617641181,
          "upvotes": 1,
          "replies": {
            "gth08fw": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth08fw/",
              "text": "Do you realize how flawed that statement is?\n\nYour logic is equivalent to me saying that even though I wouldn't drive under the influence, that doesn't necessarily mean people who do drink and drive would get a DUI. Just to put into perspective how ridiculous what you just said was.\n\nIt's still cheating even if I don't do it, lol.",
              "author": "saywcu",
              "created": 1617642016,
              "upvotes": 1,
              "replies": {
                "gth2q8b": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth2q8b/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1617643141,
                  "upvotes": 0,
                  "replies": {
                    "gth476i": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth476i/",
                      "text": ">You keep saying it’s cheating but that’s entirely the result of you *assuming* that the rules for OP’s test are the rules that *you expect*  to be on the test. We have no idea whether online resources were  actually disallowed or not, meaning we have no way of knowing whether  these people could actually be considered as having cheated, and yet you  keep assuming they’re cheating and shit-talking people who aren’t.\n\nThe issue here is that you are continuously trying to beat around the bush by talking about whether or not online resources were allowed, when that's completely irrelevant if you actually understand what Chegg is. And I'm sure you do.\n\nChegg is quite simply a website that allows students to submit homework or test questions and get detailed answers to those submissions from other users.\n\nI'm sure you're also aware that the point of an exam is to assess one's knowledge on a topic, and that can't be accurately assessed when a student is copying down answers without actually attempting to solve the problems.\n\nUnfortunately, you're being disingenuous with me and various other users on this thread by completely avoiding the previous facts. Chegg is not a resource that is there to guide student's towards the right answer, it is a resource intended to give student's the right answer immediately and with minimal effort. Hence why material from that website is being taken down on a daily basis.\n\nIf what I'm saying is something that you are so passionately against, perhaps you should not be in college. You aren't learning anything anyways.",
                      "author": "saywcu",
                      "created": 1617643797,
                      "upvotes": 1,
                      "replies": {
                        "gti161z": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti161z/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1617658933,
                          "upvotes": 1,
                          "replies": {
                            "gti1sop": {
                              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti1sop/",
                              "text": "Now you're pretending to be a professor after deleting all of your Reddit comments? This has become comedic. \n\nI'd be embarrassed after that random spiel you wrote too, so I understand. Pretending to be a totally different person is borderline psychotic though.",
                              "author": "saywcu",
                              "created": 1617659235,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gtg8nha": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg8nha/",
      "text": "[deleted]",
      "author": null,
      "created": 1617628851,
      "upvotes": -7,
      "replies": {
        "gtghfgm": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtghfgm/",
          "text": "you’re such a mean person",
          "author": "jericho_hope",
          "created": 1617633421,
          "upvotes": 1,
          "replies": {}
        },
        "gtgqcmr": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgqcmr/",
          "text": "Lol exactly. These morons that care so much about integrity end up retaking the class or end up not graduating for their \"integrity\". Take advantage of the situation or you'll end up in the bottom. college isn't testing people on their fairness, but on their ability to get the highest score possible.",
          "author": "ReadyCarpet1",
          "created": 1617637563,
          "upvotes": -4,
          "replies": {}
        }
      }
    },
    "gtg6xid": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg6xid/",
      "text": "First of all, grading on a curve is bs. Secondly, why didn't you do it as well?",
      "author": "Zoroark1089",
      "created": 1617627885,
      "upvotes": -8,
      "replies": {
        "gtg787a": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg787a/",
          "text": "I don't own chegg because I'm cheap. Also it's a prerequisite major class so I try to take it seriously.",
          "author": null,
          "created": 1617628057,
          "upvotes": 13,
          "replies": {}
        },
        "gtg7dzi": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg7dzi/",
          "text": "eh most people dont want to lose a 1000 bucks and another 4-6 months of their life when the average grade for a class is like a 50. Especially when those 50s are the people worked hard",
          "author": null,
          "created": 1617628147,
          "upvotes": 5,
          "replies": {}
        },
        "gtgd1s5": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgd1s5/",
          "text": "Every time someone says “grading on a curve is bs” I know their degree is probably not that difficult. Most rigorous degrees have average exam grades around 50-60% since professors are trying to get some separation from competitive students. \n\nI can’t tell you how many times the curve has saved my ass. In transport the average overall final grade was a 40%— of fucking course they were going to curve, do you think they should have failed the class? The professor literally gave us a graduate level exam to get a larger std. Not every degree is easy enough that if you put in 1-2hrs of studying a week you can get a solid 80, nor do many degrees have classes with average grades of 80+. The curve *rarely* works against students in STEM. \n\nThe problem is, due to rampant grade inflation in business, the humanities, and social studies, the curve *would* work against you guys. You wouldn’t have an average grade of B+/A-.",
          "author": "catfeinee",
          "created": 1617631192,
          "upvotes": 1,
          "replies": {
            "gtgdjm7": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgdjm7/",
              "text": "I agree that an econ degree is useless. Okay, let me rephrase it : \"I hate grading on a curve\".",
              "author": "Zoroark1089",
              "created": 1617631451,
              "upvotes": -1,
              "replies": {
                "gtgdqy3": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgdqy3/",
                  "text": "Okay, sure- for people benefitting from grade inflation it would work against you. However, without it literally nobody would be passing my program’s classes. I know the same goes for plenty of other people I’ve met in college. I’ll defend the curve until I die lmao.",
                  "author": "catfeinee",
                  "created": 1617631557,
                  "upvotes": 3,
                  "replies": {
                    "gtgdx00": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgdx00/",
                      "text": "Fair enough.",
                      "author": "Zoroark1089",
                      "created": 1617631644,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gtg6tij": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg6tij/",
      "text": "[removed]",
      "author": null,
      "created": 1617627822,
      "upvotes": 151,
      "replies": {
        "gtg8z1e": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg8z1e/",
          "text": "[removed]",
          "author": null,
          "created": 1617629026,
          "upvotes": 78,
          "replies": {
            "gtgcblg": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgcblg/",
              "text": "Problem is that OP is in STEM, if the cheaters pass and don’t understand the content it *will* bite them in the ass later. This isn’t some psych or business class you can just “check a box” with, it’s a class that has major ramifications as to how they’ll do in transport phenomena, polymer chemistry/physics, separations, and other classes.",
              "author": "catfeinee",
              "created": 1617630813,
              "upvotes": 43,
              "replies": {
                "gtglnj0": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtglnj0/",
                  "text": "I’m in a STEM major. I had a professor literally tell us he doesn’t care if we cheat because we need to know these things. My industry doesn’t care about your GPA. They care how many times you’ve failed practical tests that are done by super experienced individuals at very high standards. You’re not gonna make it ten minutes into the oral exam if you don’t know your stuff. And if you fail too many practical exams, no company is gonna hire you. Even with a 4.0 GPA",
                  "author": "microfsxpilot",
                  "created": 1617635446,
                  "upvotes": 31,
                  "replies": {
                    "gtgn95x": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgn95x/",
                      "text": "I mean, sure- GPA isn’t the deciding factor. But if you don’t understand the fundamentals and basics of your field you’re probably not going to have much luck passing those oral exams.\n\nAlso, I kinda doubt you had a professor tell you they “don’t care if you cheat,” sorry. Program prestige is pretty important, especially when it comes to staying accredited.",
                      "author": "catfeinee",
                      "created": 1617636177,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                },
                "gthm655": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthm655/",
                  "text": "It's less about people screwing themselves over in the future and more about people screwing over their clients and patients...",
                  "author": null,
                  "created": 1617652005,
                  "upvotes": 3,
                  "replies": {
                    "gthmdj0": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthmdj0/",
                      "text": "I mean, that’s true, but they also won’t get through their actual classes if they don’t understand the content their classes are built on. Of course, that applies less in some places, but it’s the immediate outcome. \n\n\nIt’s even worse if it’s related to their field because they could end up killing themselves. There’s a reason you need training and expertise to go into many real science labs.",
                      "author": "catfeinee",
                      "created": 1617652098,
                      "upvotes": 5,
                      "replies": {
                        "gthn2ro": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthn2ro/",
                          "text": "Yep. There's also the possibility of unnecessarily hurting animal subjects.",
                          "author": null,
                          "created": 1617652413,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gtgdmca": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgdmca/",
                  "text": "I dunno if you're in STEM or something. I'm in med school, not the in the US though.\nMost of what I'll learn before my clinical classes are useless. Like 80%.\nMy friends in easier engineering courses say the same. There is a reason many stem jobs offers training and shit.\nIf you finish a stem degree and getting a job 2 years later, I'm sure you don't remember some obscure detail the professor bitched about in a thermodynamic class.\nThere are classes for highly specific and competitive areas like nuclear engineering and shit. Students know those classes and prepare accordingly. Nobody is going to waste time on a useless class that is low yield to their career.\nAt least I won't.",
                  "author": "Lucem1",
                  "created": 1617631491,
                  "upvotes": 27,
                  "replies": {
                    "gtgesg7": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgesg7/",
                      "text": "Thermo is a fundamental class in most engineering disciplines. Everything I learned it in applied to later classes I took. How are you supposed to understand distillation without understanding vapor liquid equilibrium, how are you support to understand heat transport without understanding how energy behaves in the long time limit, how are you supposed to understand how competing reactions occur in physical-organic chemistry to predict outcomes, how can you design an experiment to measure thermodynamic potentials without understanding the maxwell relations? \n\nMed school is a special case because you probably won’t use most of what you learn in undergrad at your job— unless you plan on going into research. That’s generally why so many people choose the easier pre-med majors like psych or bio to boost their GPA to ensure a higher chance of acceptance to medschool, instead of challenging themselves in more rigorous undergrad programs.",
                      "author": "catfeinee",
                      "created": 1617632097,
                      "upvotes": 30,
                      "replies": {
                        "gtgfk5c": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgfk5c/",
                          "text": "Makes sense now. Thanks for explaining",
                          "author": "Lucem1",
                          "created": 1617632488,
                          "upvotes": 7,
                          "replies": {}
                        },
                        "gtgwuus": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgwuus/",
                          "text": "I feel like people who say shit like “in the real world, you can look this shit up” are probably majoring in something easy like where you can just get an A by just memorizing stuff on the textbook (no offense). Btw in most of my exams, formulas and all that info are given to begin with, what professors are looking for on the exam is how you can derive that formula and then apply your knowledge.\n\nFor example, let’s say we learned about Poisson distribution. Professors will rarely test you if you can just plug and chug. What they are really looking for is if you really understand what this does and why we use it over other distributions and how we derived this. \n\nSure in the real world I can look these things up and in fact the formulas are also given on the exam, but even if let’s say you can look this up, do you know how to actually apply it? If you just cheated your way through college, then it’s most likely not.",
                          "author": "owlwaves",
                          "created": 1617640493,
                          "upvotes": 10,
                          "replies": {
                            "gtgy3ld": {
                              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgy3ld/",
                              "text": "To be fair though, sometimes it is easier to look shit up. Sure I can derive all the hell I want, but how am I supposed to evaluate a massive PDE describing heat transfer? I’m probably just gonna use matlab, even if I can make simplifying assumptions I’ll probably use integral calculator to solve whatever my problem is because I’m lazy. \n\n\nBut yea, I agree with most of your point.",
                              "author": "catfeinee",
                              "created": 1617641058,
                              "upvotes": 12,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gtj6kzt": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtj6kzt/",
                  "text": "I agree. Most students who understand previous coursework tend to still be unprepared for shit like transport phenomena on the level of BSL. Students who cheat and don’t make up for it with diligent self studying will get steamrolled.",
                  "author": "calebuic",
                  "created": 1617680387,
                  "upvotes": 2,
                  "replies": {}
                },
                "gtgwqh3": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgwqh3/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1617640438,
                  "upvotes": -1,
                  "replies": {
                    "gtgyhuj": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgyhuj/",
                      "text": "Are you dense?\n\nWho’s more likely to come up with a solution quickly, the person who can actually solve the novel problem or the person who just googled their way to the answer instead of deriving it? \n\nMost stem classes are based on being able to derive a solution from general principles, not about “knowing the solution by heart.” You also learn simplifying assumptions from that. \n\nThe kids who cheat and just get the final solution won’t even be able to provide a realistic answer, much less one in 5 minutes. Lmao.",
                      "author": "catfeinee",
                      "created": 1617641239,
                      "upvotes": 5,
                      "replies": {
                        "gth02is": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth02is/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1617641942,
                          "upvotes": 4,
                          "replies": {
                            "gth2xsw": {
                              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth2xsw/",
                              "text": "I mean, if you can’t find a simplified solution you defintely can’t answer the complex version— much less define the problem that needs to be solved. That’s the real world. You either know how to define and solve problems or you don’t. Sure, google can help you supplement forgetting a specific detail like solving an integral, doing the tedious work, etc. but you\ndon’t know what you don’t know.\n\nAlso thermodynamics was very much not formula based in my program, maybe you took the watered down version. Mine leaned heavily on derivation of equations and knowing how to use them for specific circumstances. Sure, you could just equation chug in select scenarios, but those were in the vast, vast, minority. Critical thinking is something that should be stressed in that subject if it’s taught in a halfway decent way.",
                              "author": "catfeinee",
                              "created": 1617643235,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gthzbl4": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthzbl4/",
              "text": "This is horrible advice, you can fail and be kicked out for cheating.",
              "author": "Blackberries11",
              "created": 1617658053,
              "upvotes": 3,
              "replies": {}
            },
            "gtgrmqo": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgrmqo/",
              "text": "Well said",
              "author": "sharee_",
              "created": 1617638139,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gtgijwy": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgijwy/",
          "text": "This is the harsh truth that most of the academia does not want to admit. The world is a competitive place and people will use any advantage they can get, be it fair or not.",
          "author": "Sufficient_Tradition",
          "created": 1617633969,
          "upvotes": 19,
          "replies": {}
        },
        "gtg8dl4": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg8dl4/",
          "text": "Tried to say this and they buried me for it. Understood where they were coming from though. It happens",
          "author": "xsektor",
          "created": 1617628701,
          "upvotes": 35,
          "replies": {}
        },
        "gtg9ed0": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg9ed0/",
          "text": "[removed]",
          "author": null,
          "created": 1617629258,
          "upvotes": -2,
          "replies": {
            "gtga6m5": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtga6m5/",
              "text": "[deleted]",
              "author": null,
              "created": 1617629683,
              "upvotes": 16,
              "replies": {
                "gtgatzi": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgatzi/",
                  "text": "exactly --- cheating **≠ not learning or cheating yourself**",
                  "author": "jtxng",
                  "created": 1617630036,
                  "upvotes": 20,
                  "replies": {}
                }
              }
            }
          }
        },
        "gthst6d": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthst6d/",
          "text": "Yup yup yup this right here homie",
          "author": "MyLike4thAccount",
          "created": 1617655027,
          "upvotes": 1,
          "replies": {}
        },
        "gtjfqfy": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtjfqfy/",
          "text": "This is a very strange way of looking at it. I don't do this, my friends don't either and our GPA is high. What kind of university do you people attend that you cannot pass without cheating?",
          "author": "Expensive_Material",
          "created": 1617686690,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gtg6dn4": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg6dn4/",
      "text": "People in my year had found the powerpoints my university are using for lectures and seminars on another university's site so that's fun.",
      "author": "EddaValkyrie",
      "created": 1617627564,
      "upvotes": 15,
      "replies": {
        "gtjwbb9": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtjwbb9/",
          "text": "It’s not that uncommon for academics to share their course materials, especially not if one of their friends is teaching a similar course for the first time. Most people don’t put a huge amount of effort into slides anyway - it’s not like they contain any groundbreaking pedagogical methods, and most of it is cobbled together from textbooks.\n\nSo the other university knows and willingly gave those slides to yours.",
          "author": "NoxiousQuadrumvirate",
          "created": 1617702489,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gtg3gc4": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg3gc4/",
      "text": "[deleted]",
      "author": null,
      "created": 1617625775,
      "upvotes": 96,
      "replies": {
        "gtg6hf5": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg6hf5/",
          "text": "And this, friends, is why you don’t use a school email or your real name for chegg.",
          "author": "temsik1587againtwo",
          "created": 1617627624,
          "upvotes": 103,
          "replies": {
            "gtg6n84": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg6n84/",
              "text": "[deleted]",
              "author": null,
              "created": 1617627720,
              "upvotes": 67,
              "replies": {
                "gtg7xp5": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg7xp5/",
                  "text": ">Use a vpn \n\nDone",
                  "author": "DarkAssassinXb1",
                  "created": 1617628455,
                  "upvotes": 64,
                  "replies": {
                    "gtgaj1b": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgaj1b/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1617629873,
                      "upvotes": 69,
                      "replies": {
                        "gtgpqux": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgpqux/",
                          "text": "It’s a huge joke at my institution.  One of the founders of Chegg started it for an undergraduate class project and grew it from there.  He’s the success story the university keeps quiet about.",
                          "author": "br0city",
                          "created": 1617637288,
                          "upvotes": 22,
                          "replies": {}
                        },
                        "gtgfgeg": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgfgeg/",
                          "text": "I would imagine if someone is clever enough to use a vpn to cheat, they would probably have the sense to either change their settings or turn it off to do school stuff.",
                          "author": "DasRotebaron",
                          "created": 1617632435,
                          "upvotes": 16,
                          "replies": {}
                        }
                      }
                    },
                    "gtgqlso": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgqlso/",
                      "text": "That alone would not necessarily address that issue. It might, but not necessarily.",
                      "author": "Dr_Pizzas",
                      "created": 1617637678,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "gtg6s5e": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg6s5e/",
                  "text": "Professor would have to get canvas IPs from school IT. I doubt if this is ever been used at 99% of universities...",
                  "author": "temsik1587againtwo",
                  "created": 1617627799,
                  "upvotes": 12,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gtg3f6o": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg3f6o/",
      "text": ">.... The class is on a curve. ...\n\nThat's such lazy teaching. Sorry, just a tangent.",
      "author": "acm2033",
      "created": 1617625755,
      "upvotes": -4,
      "replies": {
        "gtg5p9r": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg5p9r/",
          "text": "A tangent to the curve?",
          "author": "symmetrical_kettle",
          "created": 1617627154,
          "upvotes": 18,
          "replies": {}
        },
        "gtgcnfr": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgcnfr/",
          "text": "Not really. Most STEM classes need to be in a curve- you have a bunch of pretty competitive students taking exams with 50% averages. It’s rough content and you need to get some separation. This isn’t an easy A psych UD class, so your score is not purely based on time put in- leading to high averages. \n\nYou’re not going to fail them all- so the solution is to curve around a C+ to prevent grade inflation. Welcome to engineering.",
          "author": "catfeinee",
          "created": 1617630984,
          "upvotes": 9,
          "replies": {
            "gtggcwe": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtggcwe/",
              "text": "I'm in school for engineering, I second this.",
              "author": "ihavenoswag97",
              "created": 1617632889,
              "upvotes": 5,
              "replies": {}
            },
            "gtgezvd": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgezvd/",
              "text": "I'm gonna add onto this and say a curve has absolutely nothing to do with whether or not a teacher is 'lazy'.\n\nIdiotic statement by an idiotic student.",
              "author": "saywcu",
              "created": 1617632204,
              "upvotes": 3,
              "replies": {
                "gtgf7u6": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgf7u6/",
                  "text": "I think the people who dislike curves generally take easier degrees where the average grade is a B+/A-, think psych, comms, American studies, etc. they totally neglect the idea that plenty of college degrees don’t have 88% exam averages lol.\n\nI know in my classes difficult exams are used to separate the wheat from the chaff. The professors generally normalize the class and put a lot of thought into where they draw the boundaries. I would not call that “lazy teaching.” It’s a totally idiotic statement, you’re right.",
                  "author": "catfeinee",
                  "created": 1617632315,
                  "upvotes": 10,
                  "replies": {
                    "gtgfpps": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgfpps/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1617632567,
                      "upvotes": 7,
                      "replies": {
                        "gtgg44x": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgg44x/",
                          "text": "Yeah! It’s a valid way of getting some separation in the class scores. If you give a difficult exam and the average is about 50-60, that’s expected. If it’s higher, something is generally up- so you need to do more analysis. \n\n\nAnother thing that’s important to account for is how important what you’re learning is to you immediately. If you’re going to be an accountant someone’s livelihood is in your hands, so you need to be trained properly- if you’re an engineer that machine you’re building could kill someone if designed wrong, if you’re a chemist you could easily kill yourself if you mishandle yourself reagents. Those are really serious and it’s kinda hard to afford people a lot of slack for that.\n\nMeanwhile in my 3000 level communications class the average score is around an 85% on every major assignment, because what’s being “taught” is more for box checking than for actual learning.",
                          "author": "catfeinee",
                          "created": 1617632768,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gtg38c1": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg38c1/",
      "text": "How do you know the exam was on chegg?",
      "author": "GodOfThunder101",
      "created": 1617625634,
      "upvotes": 67,
      "replies": {
        "gtg5ju6": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg5ju6/",
          "text": "Easy to google, doesn't mean OP used it though. When I was taking physics in one of the recent covid-online semesters, I had a particularly difficult exam and was surprised at how many 100%s there were. \n\nGoogled the exam questions and yup, someone had posted them on chegg. Annoying because although our class didn't have a normal curve, he would slightly curve certain questions if most of the class did poorly on it.",
          "author": "symmetrical_kettle",
          "created": 1617627064,
          "upvotes": 96,
          "replies": {}
        },
        "gtg6ozd": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg6ozd/",
          "text": "I can still look at the questions and answers for review. The answers were on chegg long before the test was taken.",
          "author": null,
          "created": 1617627748,
          "upvotes": 35,
          "replies": {}
        },
        "gtg5pcx": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg5pcx/",
          "text": "OP might of googled a question after a test because they were confused. Or someone in the GC leaked the Intel.",
          "author": "wizard680",
          "created": 1617627155,
          "upvotes": 24,
          "replies": {}
        },
        "gtgjbe1": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgjbe1/",
          "text": "Not that this is an option for my course but if I did a test honestly and wanted to know whether I got a question correct afterwards, I'd check chegg.",
          "author": "Elastichedgehog",
          "created": 1617634335,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gtg1ov3": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg1ov3/",
      "text": "Snooze you lose boss.",
      "author": "SelfImproveDrew",
      "created": 1617624648,
      "upvotes": -20,
      "replies": {}
    },
    "gtg1fio": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg1fio/",
      "text": "What’s more surprising is your professor didn’t catch this and fail most of the class....yet",
      "author": "Romano16",
      "created": 1617624471,
      "upvotes": 671,
      "replies": {
        "gtgmzpi": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgmzpi/",
          "text": "At my university professors usually grade everything during the term but then leave a blank grade on your transcript at the end of the course. \n\nBlank grades often mean the student is being accused of having violated academic integrity. If the student chooses to challenge it, they have to go through a very long (several months worth of a) process to be put on trial to prove they didn’t cheat and if they’re found guilty, the punishment is often worse than if they would’ve just confessed in the beginning. \n\nIdk how it works at OP’s institution but... it could be that the professor knows and is waiting for the course to end.",
          "author": "Somni_um",
          "created": 1617636058,
          "upvotes": 139,
          "replies": {}
        },
        "gth3m08": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth3m08/",
          "text": "Tbh it’s not that surprising. Not sure how OP’s test was, but when I took thermo the exams would be just three super long questions. If you actually understood what was happening, even if that meant using chegg to figure it out, all you would have to do is write your answers in your own way and be able to explain what is going on.  This is how a lot of people study in engineering, you just find similar problems and see how other do it. \n\nIt’s a dick move for other students to do it on the exam, but at the end of the day if the professor called you out you would probably have plausible deniability. This isn’t cheating on a multiple choice test, there’s  a decent amount of work that would have gone into it. So If you can explain what’s happening, say why you did the problem that way, and your answer is correct then you can make a fairly easy case that you just happened to study similar questions. After all you are expected to do that for an exam. Especially if it were only 3 questions, it’s pretty believable.\n\nShitty situation for OP, but idk really how they could prove anything.",
          "author": "HighwayDrifter41",
          "created": 1617643535,
          "upvotes": 34,
          "replies": {
            "gth5psk": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth5psk/",
              "text": "Chegg will log and provide account names, emails and ips of people who accessed solutions to university faculty upon request during investigations into cheating.",
              "author": "Doc_Faust",
              "created": 1617644478,
              "upvotes": 29,
              "replies": {
                "gti8pyh": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gti8pyh/",
                  "text": "But what about the myriad of websites such as stack exchange, reddit, and other academic forums?",
                  "author": null,
                  "created": 1617662677,
                  "upvotes": 2,
                  "replies": {
                    "gtjw2y5": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtjw2y5/",
                      "text": "If it’s a long answer question and your answer matches that on a website then that’s enough to slap academic dishonesty on you.\n\nThe way it usually goes (from experience) is \n\n- the markers get a sense of déjà vu while marking the assignments/tests because some students’ answers are too similar in language or approach\n\n- the markers go back through every script to find the ones that are very similar to one another\n\n- the markers google the questions that are matching and immediately find the source that students have copied from\n\nDone. That’s all it takes. We only need *suspicion* of cheating, not formal proof. It’s not a criminal court and isn’t held to the same standards. If it’s implausible that 2 students would use the same esoteric method that hasn’t been taught in class then that’s all we need - implausibility.",
                      "author": "NoxiousQuadrumvirate",
                      "created": 1617702264,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "gtj5qzc": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtj5qzc/",
                      "text": "These are almost impossible to monitor.",
                      "author": "calebuic",
                      "created": 1617679894,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gthfmrf": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthfmrf/",
          "text": "Perhaps op should email the prof.  It seems they have a pretty good case here.  And if the exam scores have a bimodal distribution, that's pretty good evidence to suggest cheating.",
          "author": "loomdawg",
          "created": 1617649001,
          "upvotes": 6,
          "replies": {
            "gthz1yy": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthz1yy/",
              "text": "Definitely email them. They need to know about this.",
              "author": "Blackberries11",
              "created": 1617657925,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gtgwge7": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgwge7/",
          "text": "[deleted]",
          "author": null,
          "created": 1617640311,
          "upvotes": 9,
          "replies": {
            "gtgx55d": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgx55d/",
              "text": "Maybe they want to do a reverse UNO and wait until the very last minute to fail everyone that obviously looked like they copied straight off of Chegg.",
              "author": "KaiserWilhelmDaThird",
              "created": 1617640622,
              "upvotes": 20,
              "replies": {
                "gtgy9m7": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgy9m7/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1617641134,
                  "upvotes": 13,
                  "replies": {
                    "gth7ts0": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth7ts0/",
                      "text": "Yeah but when you need to solve real-world engineering problems, the answers will not be on Chegg, so you need to know wtf you’re doing",
                      "author": "Useful_Bread_4496",
                      "created": 1617645426,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "gtgyymq": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgyymq/",
                      "text": "Also a valid theory, lol.",
                      "author": "KaiserWilhelmDaThird",
                      "created": 1617641444,
                      "upvotes": 9,
                      "replies": {}
                    },
                    "gthgymp": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthgymp/",
                      "text": "This is fine for knowledge that needs to be recalled... not so much when you're trying to teach critical thinking and problem solving within a certain field.",
                      "author": "ITaggie",
                      "created": 1617649614,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gtfuab9": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtfuab9/",
      "text": "Don't hate the player, hate the game. Sounds like your prof. is not making his own exams. Either way a 50% in an exam...Yeah its unfair but maybe do what the others are doing... \n\nOverall I remember I was taking this statistics class, same thing. All the HW and exam questions were on chegg. One of the student's brought this up to the prof. The student that worked hard and didn't use chegg made huge stink about it, but in the end the prof. couldn't do much about it. Something about the class or school syllabus allowed \"outside or online\" resources to be okay for student use as studying material. \n\nIn the end my prof. didn't care and I passed without using chegg. It just will end up hurting those type of students later.",
      "author": "ice_bag",
      "created": 1617619094,
      "upvotes": 79,
      "replies": {
        "gtgmvnl": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgmvnl/",
          "text": "Honestly. Some of the people here need to worry less about what others are doing and worry more about themselves. \n\nChegg and the like are resources. I’ve used it, and will continue to, because it’s less time consuming to look up an explanation and answer on google than schedule time with a tutor you won’t get to see for a week. \n\nSome people use it to cheat, sure, but that’s on them. Maybe it’ll bite them in the ass later, maybe not. Just do you, fam. \n\nAs for OP—who’s to say that some of the people with amazing scores even used Chegg? With a 50% they could have very well been fucked either way.",
          "author": "reinakun",
          "created": 1617636006,
          "upvotes": 32,
          "replies": {
            "gtgonrn": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgonrn/",
              "text": "BuT mY InTegrITy!?  I didn’t think people cared so much when academics has been shown to us be a literal competitive dog eat dog battle. People will do whatever to get ahead of the next guy. \n\nBut don’t point that out apparently cause you’re promoting cheating I guess or something like that. I don’t think it’s that deep personally. But my downvote of my thread say otherwise I guess 🤷🏾‍♂️",
              "author": "xsektor",
              "created": 1617636806,
              "upvotes": 20,
              "replies": {
                "gtgw7qt": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgw7qt/",
                  "text": "Sure, college is competitive and people tend to do whatever it takes to get ahead. But you're paying thousands of dollars to take these classes. Most people who cheat don't do it just to get ahead - they do it to make their lives easier. And easier doesn't always mean better in the long-run. They're not going to go back and learn the material - they cheated so they wouldn't have to learn. At that point, why not just skip college and go to YouTube University then? They'll probably be better off with the latter in terms of knowledge anyways.",
                  "author": "lacrimosa122",
                  "created": 1617640202,
                  "upvotes": 3,
                  "replies": {
                    "gth6vaf": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth6vaf/",
                      "text": ">At that point, why not just skip college and go to YouTube University then? They'll probably be better off with the latter in terms of knowledge anyways.\n\nBecause jobs don’t accept degrees form YouTube University.\n\nPlenty of people aren’t going to college to gain knowledge or learn anything. They just want the piece of paper at the end that gets them a job. \n\nHalf the time their job ends up being in a completely different subject then their degree anyway",
                      "author": "MakinBaconPancakezz",
                      "created": 1617644998,
                      "upvotes": 16,
                      "replies": {
                        "gthkpi0": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthkpi0/",
                          "text": "That's why I said \"in terms of knowledge.\" It's kind of like you get out of it what you put in. The bare minimum is paying for a degree and you get that piece of paper. But why not actually take the time to learn alongside it? Not like it costs any extra. I personally could excuse those who are so overwhelmed with responsibilities they don't have time to put in any extra effort (occasionally perhaps, if it was a last resort kind of thing and not a curved class). But they're generally the same people who do have a better work ethic and won't take advantage of the system. The serial cheaters are generally the same people who would rather party or coast through school without working for it. And if you think about it, is partying any more worthwhile than getting the knowledge that you paid for, even if it's optional?\n\nThe sad reality is that both categories of people end up getting lumped in together, even if one is more qualified (both ethically and technically) than the other. Do we really want people who would jump at a chance to take advantage of inadequacies in a system in immoral ways as our leaders or people in positions where they're doing work that impacts us all?",
                          "author": "lacrimosa122",
                          "created": 1617651332,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gtfdk8p": {
      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtfdk8p/",
      "text": "Yeah I hate this shit man. I would definitely report this to your professor. Normally, I wouldn't care so much, but since you are graded on a curve, the people cheating are not just cheating themselves, they are cheating *you.* Talk to your professor about this, there is no reason to take this sitting down. The people who cheated fucked you over, there is no reason to care what happens to their grade if they are found out.",
      "author": "needhelpne2020",
      "created": 1617603162,
      "upvotes": 409,
      "replies": {
        "gtfgb8g": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtfgb8g/",
          "text": "Facts",
          "author": "redgram10",
          "created": 1617605606,
          "upvotes": 69,
          "replies": {}
        },
        "gtg13aq": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg13aq/",
          "text": "I’ve never been a fan of this mentality. Even when people cheated and I didn’t and failed an exam. Think real hard what you want to do going forward. Ok. You got fucked over. Making it your mission to fuck over the class when you can’t prove who specifically used chegg is/and will be a complete misfire on your part. \nYou’ll gain nothing but a selfish satisfaction that you’re all failing together at least. And a professor who will go out of their way to make the class much harder for everybody. You and the classes after you. Which helps no one. They cheated. You didn’t and somehow failed. It’s how the saying goes nice guys finish last? Integrity doesn’t always win. And life isn’t fair. Case and point. \n\nAll that matters now is what you do going forward. Whether you stay true and study hard and call out the class for cheating. Or use chegg like everybody else. It’s your choice\n\nP.S. and I’m not saying you should just suck it up. But situations like this happen in the real world as well as college. And you’re not gonna be able to (for lack of better word) ‘complain’ to somebody. Sometimes you just have to take the L and move on",
          "author": "xsektor",
          "created": 1617624245,
          "upvotes": -113,
          "replies": {
            "gtg8gct": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg8gct/",
              "text": "Once it is reported Chegg gives all the info to the professor.\n\nYou absolutely can complain about fraud in the real world",
              "author": "TheRightSideOfDumb",
              "created": 1617628743,
              "upvotes": 91,
              "replies": {
                "gtggabf": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtggabf/",
                  "text": "Yeah, for people who don't know -- I teach a class and last spring when zoom was new, the entire final exam got screenshotted and posted to chegg. It took about a month, but we got the sign-up email addresses, billing names, and IP addresses of everyone who _looked_ at the answers. Chegg is terrified of their own legal culpability, and will _not_ protect the privacy of its users. They are not your friend.",
                  "author": "Doc_Faust",
                  "created": 1617632854,
                  "upvotes": 57,
                  "replies": {}
                }
              }
            },
            "gtg1t9f": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg1t9f/",
              "text": "Ok but the whole point is that since the class is graded on a curve, if other people weren’t cheating, the 50% “failing grade” that OP got would probably be an A, or at least a B.",
              "author": "mkivel",
              "created": 1617624731,
              "upvotes": 97,
              "replies": {
                "gtg2cko": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg2cko/",
                  "text": "Still doesn’t change what I said. He can go on this witch hunt. With the possibility of causing a huge shift in grades and structures of the course. More than likely sending it in the more challenging direction as if thermodynamics wasn’t hard enough or he can just take the L and move\n\nIt doesn’t change that this a life lesson situation op is in and that they honestly need to think real hard about their next course of action. Advice from us redditors or not",
                  "author": "xsektor",
                  "created": 1617625074,
                  "upvotes": -81,
                  "replies": {
                    "gtg30nm": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg30nm/",
                      "text": "It would only be harder for people who cheated though. Everyone who played by the rules—not just OP—would benefit in the long run. And even if his “witch hunt” didn’t prove anything for this exam, the professor might be more careful making his tests in the future to avoid this situation.",
                      "author": "mkivel",
                      "created": 1617625500,
                      "upvotes": 50,
                      "replies": {
                        "gtg4esg": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg4esg/",
                          "text": "Just to be clear I’m not against you in any way but obviously there’s two choices for OP and each obviously come with major effects and I’m just more on the side of “you decide op, stuff like this happens” over a clear cut yea report it. Or let it go. In my opinion it is a tough decision",
                          "author": "xsektor",
                          "created": 1617626375,
                          "upvotes": -21,
                          "replies": {}
                        },
                        "gtg3sm2": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg3sm2/",
                          "text": "Which is another fair point. But if the professor hasn’t caught on to this massive disparity of what seems like half the class failing and other half passing. Op may just fall on deaf ears",
                          "author": "xsektor",
                          "created": 1617625992,
                          "upvotes": -21,
                          "replies": {}
                        }
                      }
                    },
                    "gtg2yfy": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg2yfy/",
                      "text": "I bet you cheated on exams and are butthurt about your cheating friends getting caught lmao",
                      "author": "Typhlosion43",
                      "created": 1617625460,
                      "upvotes": 41,
                      "replies": {
                        "gtg3guf": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg3guf/",
                          "text": "I’ve been cheated out of grades many times. Not once did I think about witch hunting it. What’s it gonna do? Replace the F I got on the exam? No. I didn’t pull through as a student. Even if it was my best it simply wasn’t enough. \n\nThere’s gonna be cheaters in classes. That’s a given. But if you wanna worry so much about the persons grade next to you. go for it. I’ll be putting that energy into studying and getting a better grade. Cheaters be damned.",
                          "author": "xsektor",
                          "created": 1617625784,
                          "upvotes": -12,
                          "replies": {
                            "gtg4wns": {
                              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg4wns/",
                              "text": "That’s great and understandable when the class isn’t graded on a curve. However, that’s a very important point you seem to be disregarding. It doesn’t matter how hard OP tries if everyone else in the class is cheating their way through and using outside (prohibited) resources. OP shouldn’t have to fail a class to save the cheaters’ asses.",
                              "author": "Dogmama1230",
                              "created": 1617626680,
                              "upvotes": 39,
                              "replies": {
                                "gtg63k0": {
                                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg63k0/",
                                  "text": "My biggest thing for OP and this is what I’m trying to drive home is that when you report cheating and you bring the hammer down. That hammer hits everybody. Good and bad. And yes the class is graded on curve but don’t think that a curve can’t be revoked. Because then what? Now you’re really up a creek with no paddle and pissed off classmates beside you. Good ones and bad ones\n\nEdit: My thread is gonna get downvoted to the earth’s core and that’s fine with me. But I stand by my opinion. OP( I know I’ve been saying he a lot) has a tough call and they have to figure out what’s best. In a ideal world I’d be all for reporting it too. But I know well enough that being the ‘good guy’/hero doesn’t always work out and in some rare cases make your life harder. I wish OP the best and do not envy their position. They have a lot to think about",
                                  "author": "xsektor",
                                  "created": 1617627394,
                                  "upvotes": -3,
                                  "replies": {
                                    "gtgv8e8": {
                                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgv8e8/",
                                      "text": "It's not going to affect the \"good\" ones because they weren't cheating in the first place. They're just going to do what they have already been doing and just study study study. What a weird mentality you have",
                                      "author": "-SmashingSunflowers-",
                                      "created": 1617639762,
                                      "upvotes": 11,
                                      "replies": {}
                                    }
                                  }
                                },
                                "gtg5nvx": {
                                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg5nvx/",
                                  "text": "I’m not disregarding the curve portion. But I’m also saying that with this tough decision of reporting cheating comes either no change to the course(this is possible since this professor hasn’t caught on yet) or so much change(curve removed, harder exams, monitoring you while you take the exam ect) that OP possibly fails regardless but hey at least I made sure the entire class comes with you on a all or nothing type gamble. Which isn’t entirely fair because I also don’t think he can prove that everyone that got a decent grade actually used chegg. \n\nHe can make guesses. On the bad apples in the class they know of sure. But when it comes down to it. OP may end screwing someone else who didn’t cheat just like him",
                                  "author": "xsektor",
                                  "created": 1617627130,
                                  "upvotes": -1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gtgcdv1": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgcdv1/",
              "text": "No, one should not tolerate dishonorable actions like that.",
              "author": "raviolispoon",
              "created": 1617630845,
              "upvotes": 19,
              "replies": {}
            },
            "gtg4btz": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg4btz/",
              "text": "I would agree with you if the class wasn't graded on a curve.",
              "author": "lowerbackpain2208",
              "created": 1617626324,
              "upvotes": 21,
              "replies": {}
            },
            "gtgv575": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgv575/",
              "text": "Lol",
              "author": "Apolace1999",
              "created": 1617639723,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gtfla3j": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtfla3j/",
          "text": "On an open book exam, using materials outside the course isn’t cheating. That includes if they found the test. It sucks but I wouldn’t fault other students for using what was accessible on the internet, this is the professors fault alone.",
          "author": "earlymourningperson",
          "created": 1617610439,
          "upvotes": -101,
          "replies": {
            "gtfyy9j": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtfyy9j/",
              "text": "Where does op say this test was open book?",
              "author": "gpgc_kitkat",
              "created": 1617622745,
              "upvotes": 61,
              "replies": {}
            },
            "gtfr041": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtfr041/",
              "text": "“Open book” means just that. Open textbook, open notes, open slides, open homework. It doesn’t mean “open use chegg to find answers”.",
              "author": "Weat-PC",
              "created": 1617616129,
              "upvotes": 95,
              "replies": {
                "gtfs08o": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtfs08o/",
                  "text": "I have a professor this semester that has open book, at home midterms, and finals. He specified he is okay with you using Google, Wikipedia, or whatever outside source you want to use in addition to class notes, and texts.",
                  "author": "EyePlayFantasy",
                  "created": 1617617073,
                  "upvotes": 38,
                  "replies": {}
                },
                "gtfrcei": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtfrcei/",
                  "text": "Blame the professor for not making his own test",
                  "author": "NaryxDandy",
                  "created": 1617616455,
                  "upvotes": 31,
                  "replies": {
                    "gtgdghk": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgdghk/",
                      "text": "Pretty sure the professor did make their own test, it was just posted on Chegg.\n\n(Edit): apparently this is incorrect",
                      "author": "catfeinee",
                      "created": 1617631406,
                      "upvotes": 7,
                      "replies": {
                        "gtgh7v2": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgh7v2/",
                          "text": "No, he just didn't make his own test. The questions were online long before the actual test.",
                          "author": null,
                          "created": 1617633318,
                          "upvotes": 12,
                          "replies": {
                            "gtghet0": {
                              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtghet0/",
                              "text": "Seriously? He didn’t even change the numbers? I’m honestly kinda surprised. What type of program are you in?",
                              "author": "catfeinee",
                              "created": 1617633412,
                              "upvotes": 2,
                              "replies": {
                                "gtgtmka": {
                                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgtmka/",
                                  "text": "He changed one number on all the problems. All the answers online show work though",
                                  "author": null,
                                  "created": 1617639045,
                                  "upvotes": -1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gtglk99": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtglk99/",
                      "text": "Doesn't matter. People post my exams on Chegg while taking them. It just slows things down a bit.",
                      "author": "Dr_Pizzas",
                      "created": 1617635405,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "gtg1o22": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg1o22/",
                  "text": "Open notes can mean a lot of things. For example finding the test online and printing it off to take notes and explain the answers turns it into notes",
                  "author": "nemo1261",
                  "created": 1617624633,
                  "upvotes": 6,
                  "replies": {
                    "gtg6v5f": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg6v5f/",
                      "text": "Yeah my classmates have had meetings with my professor and the professor actively encouraged using quizlet and any other online resource to help us during the exam. I know a lot of other courses aren’t like that, but some professors just kind of take it in stride now.",
                      "author": "ucantstopdonkelly",
                      "created": 1617627848,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gthbwbr": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthbwbr/",
              "text": "I’ve never once heard of an open book exam that doesn’t specify “your notes, or lecture notes, or the textbook, **nothing from the internet**”",
              "author": "Xystem4",
              "created": 1617647292,
              "upvotes": 2,
              "replies": {}
            },
            "gtg814q": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtg814q/",
              "text": "I agree with you don’t know why you got so many dislikes lol. TBH if he knows that all the answers to the exam are on Chegg then why come to Reddit complaining. You have three obvious choices. First choice, cheat with the others and get A on the next exam and pass the class. Second choice, print out the exams from chegg (or take pictures) and send it to your professor to expose the cheaters. Third choice, keep doing you and study for the 3rd exam early. I feel the first two choices would not help you in the long run of your college career but the third choice will help you build harder work ethics. Even if people cheated or not you got a 50% and I’m sure there was something you could of studied harder to at least get a passing grade. \n\nI don’t recommend cheating because it won’t help you graduate. Yea it will help you pass the class but the next course you take will just make you regret not paying attention. Two, reporting students without valid proof of them actually cheating won’t help you. Yea you can show professor the exam but all he would do is make a 3rd exam from scratch and everyone mostly likely fail it, but the people that cheated at the start of class would still pass bc there no way to prove they personally cheated or just “smart”. If you are on failing hard then I would suggest to study the exam on Chegg and don’t study it to simply copy answers but as a resource of study material. In this situation you cant really blame anyone other then the professor that doesn’t hand write new questions each semester. Keeping the same old recycled questions is lazy and makes it so the professor work less. If the professor wrote new exam questions every year then his teaching in class would probably help you guys more exactly pass.",
              "author": "plawilliams",
              "created": 1617628509,
              "upvotes": -6,
              "replies": {}
            }
          }
        },
        "gtfrzhl": {
          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtfrzhl/",
          "text": "🐀",
          "author": "TiNyUzi",
          "created": 1617617055,
          "upvotes": -63,
          "replies": {
            "gtgjowv": {
              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtgjowv/",
              "text": "The only rats in this situation are the cheaters who are fucking over the people that actually tried.",
              "author": "----NSA----",
              "created": 1617634514,
              "upvotes": 19,
              "replies": {
                "gth8cg5": {
                  "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gth8cg5/",
                  "text": "And? Find another way. U nerdy ass snitches will learn that tattle telling won't get anybody anywhere or help ur grade. Bring in the downvotes!",
                  "author": "TiNyUzi",
                  "created": 1617645663,
                  "upvotes": -9,
                  "replies": {
                    "gthzu5u": {
                      "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gthzu5u/",
                      "text": "But thats how it’s stopped....",
                      "author": "2sACouple3sAMurder",
                      "created": 1617658299,
                      "upvotes": 1,
                      "replies": {
                        "gtiymvg": {
                          "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtiymvg/",
                          "text": "No, it's not. 85%+ of college students are cheating in some way shape or form right now. Nobody cares about integrity when it comes to online school. Stop whining and snitching. If u snitch, students will find out and it'll backfire. I've already read multiple threads of ppl asking if they should snitch or not and the answer is ALWAYS \"no\".\n\nThis subreddit, however, doesn't realize how stupid they are. So they support snitching w/o thinking of the phrase \"snitches get stitches\", ain't the smartest way of thinking. Just saying.",
                          "author": "TiNyUzi",
                          "created": 1617675985,
                          "upvotes": 1,
                          "replies": {
                            "gtjpkdk": {
                              "link": "/r/college/comments/mkdrte/i_was_wondering_why_the_midterm_average_was_so/gtjpkdk/",
                              "text": "This isnt prison my guy",
                              "author": "2sACouple3sAMurder",
                              "created": 1617695592,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634051749
}