{
  "sid": "q2w4m1",
  "link": "/r/college/comments/q2w4m1/cheating_on_exams/",
  "title:": "cheating on exams",
  "text": " if you see people cheat what would you do ? I saw [this post](https://www.reddit.com/r/college/comments/q2rwox/witness_cheating_on_exam/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) and made me want to ask this. i understand you are their to focus on your own degree but what if their score can hurt you ? my class grades matter for the school/program i need to get into, what if the person who cheated gets a better grade then me so now they enter the program i wanted ? it can hurt me/ my chances of getting in along with others who are trying HARD. isn’t more embarrassing to cheat then to just report them? i don’t want to be THAT person on campus but i also want the best future i can get for my self.",
  "author": "RefrigeratorDear2641",
  "created": 1633562648,
  "updated": 1634083653,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hfok8k1": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfok8k1/",
      "text": "The people who cheat will take care of themselves. What I mean is that they will eventually fall behind so far that they can’t pretend to know anymore. Once you get past basic requirements, you aren’t going to be able to bullshit your way through. \n\nI wouldn’t make it my job to be the cheating police. These things tend to fix themselves through the aforementioned means.",
      "author": "115machine",
      "created": 1633573019,
      "upvotes": 5,
      "replies": {
        "hfonhjg": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfonhjg/",
          "text": "yup. If it’s anything higher education, med school, law school, psych phd etc they will eventually fail out or won’t pass the boards and it’s no ones fault but their own.",
          "author": "rynpickles",
          "created": 1633574769,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfo0yer": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfo0yer/",
      "text": "That person cheating is not going to make it far. What will they have to show for the admissions committee of the program you want to get into? Nothing. But you will have much to show because you are putting in the work and learning the material. They may have good grades but they will lack the skills and knowledge that it takes to succeed in that program. You on the other hand will have everything that the cheater lacks. And admissions panelists can spot a bullshitter from a mile away. Let the cheater learn the hard way.",
      "author": "alecnm",
      "created": 1633563878,
      "upvotes": 2,
      "replies": {
        "hfo648j": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfo648j/",
          "text": "true in a way. but if the school knows i knew (and who ever else knew) we can get hurt too since it can go against guidelines i believe",
          "author": "RefrigeratorDear2641",
          "created": 1633566359,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfok7oh": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfok7oh/",
      "text": "The people who cheat will take care of themselves. What I mean is that they will eventually fall behind so far that they can’t pretend to know anymore. Once you get past basic requirements, you aren’t going to be able to bullshit your way through. \n\nI wouldn’t make it my job to be the cheating police. These things tend to fix themselves through the aforementioned means.",
      "author": "115machine",
      "created": 1633573006,
      "upvotes": 2,
      "replies": {
        "hfrbkle": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfrbkle/",
          "text": "sucks for them too since they will just have a harder time catching up",
          "author": "RefrigeratorDear2641",
          "created": 1633631047,
          "upvotes": 2,
          "replies": {
            "hfrouaj": {
              "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfrouaj/",
              "text": "You reap what you sow. Some of them will see that and start doing better, others won’t and will fail out. I doubt their cheating will affect you terribly bad. The only difference I could think of would be if they are out here breaking curves with ungodly high scores but I doubt that will happen without arousing suspicion from the professor.",
              "author": "115machine",
              "created": 1633636555,
              "upvotes": 2,
              "replies": {
                "hftmjlj": {
                  "link": "/r/college/comments/q2w4m1/cheating_on_exams/hftmjlj/",
                  "text": "yeah i know it can’t affect my score at all but it sucks for others working really hard.",
                  "author": "RefrigeratorDear2641",
                  "created": 1633671401,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfo92cp": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfo92cp/",
      "text": "Here’s what I assume will be a slightly unpopular opinion.\n\nIf they’re good enough at cheating to not get caught, they deserve it as much as the people grinding in the library. They earned it a different way, but they made it work.\n\nNow I wouldn’t want my doctor cheating on their MCAT, but generally if someone can get through the system I commend them.\n\nThe Academic integrity system is brutal these days, and if you can successfully get through a program without getting caught, that’s an achievement in itself.\n\nMost people are going to get caught somewhere invalidating all their positioning in program selections. I doubt it will affect you as much as you think practically.",
      "author": "Casual-Economist",
      "created": 1633567746,
      "upvotes": 5,
      "replies": {
        "hfoa69n": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfoa69n/",
          "text": "i hope so thankyou",
          "author": "RefrigeratorDear2641",
          "created": 1633568260,
          "upvotes": 1,
          "replies": {}
        },
        "hfomycq": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfomycq/",
          "text": "The thing is test like the MCAT it’s impossible to cheat and they are severely monitored so that person won’t do well on it so OP mind your business they will lear the hard way",
          "author": "11572762",
          "created": 1633574464,
          "upvotes": 1,
          "replies": {}
        },
        "hfomynz": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfomynz/",
          "text": "The thing is test like the MCAT it’s impossible to cheat and they are severely monitored so that person won’t do well on it so OP mind your business they will learn the hard way",
          "author": "11572762",
          "created": 1633574470,
          "upvotes": 1,
          "replies": {}
        },
        "hfomzk0": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfomzk0/",
          "text": "The thing is test like the MCAT it’s impossible to cheat and they are severely monitored so that person won’t do well on it so OP mind your business they will learn the hard way",
          "author": "11572762",
          "created": 1633574484,
          "upvotes": 1,
          "replies": {
            "hfooxzs": {
              "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfooxzs/",
              "text": "Right… that’s kind of my point. If you manage to get past modern cheating filters, that’s pretty impressive on its own",
              "author": "Casual-Economist",
              "created": 1633575614,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hfofc3y": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfofc3y/",
      "text": "don’t be an adult tattletale. all im gonna say is that snitches get stitches. literally. 🤷🏼‍♀️",
      "author": "savannahgonzalez",
      "created": 1633570673,
      "upvotes": 2,
      "replies": {}
    },
    "hfnzqdy": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfnzqdy/",
      "text": "Reporting someone else’s cheating is not going to further your academic career. Focus on you. Any second you’re spent worrying about someone else is a second spent away from focusing on yourself.",
      "author": "whatevermajorloser69",
      "created": 1633563267,
      "upvotes": 1,
      "replies": {
        "hfo1dbi": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfo1dbi/",
          "text": "> Reporting someone else’s cheating is not going to further your academic career.\n\nIf your class is curved, it may very well net you a better grade. Additionally, if it's discovered that you knew of the cheating and didn't report it, you may be in violation of some honor code and in some trouble with the University as a result.",
          "author": "mrbmi513",
          "created": 1633564084,
          "upvotes": 4,
          "replies": {
            "hfo5jyu": {
              "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfo5jyu/",
              "text": "very true, in the long run it can hurt you .",
              "author": "RefrigeratorDear2641",
              "created": 1633566099,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hfo5xju": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfo5xju/",
          "text": "it can hurt me because programs care about grades so if that person and me both apply to the same one who do you think they will pick ? Sonography’s best programs are so competitive and pick the absolute best candidates.",
          "author": "RefrigeratorDear2641",
          "created": 1633566271,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfo2tot": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfo2tot/",
      "text": "I don't remember how many serious exams where I have seen someone deliberately cheat, mostly because I don't really let that be a distraction for me but even then I can't recall. If one person is slick enough to pull their phone out and find answers then really the most you can do is just ask the professor to be more attentive during exams (which they usually are). This kind of stuff usually catches up to people so I wouldn't really lose sleep over it and just worry about it if the situation actually does manage to happen.",
      "author": "Traaaaaaaaap",
      "created": 1633564801,
      "upvotes": 1,
      "replies": {}
    },
    "hfodxo1": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfodxo1/",
      "text": "Mind your business",
      "author": "TragicalKingdom",
      "created": 1633570021,
      "upvotes": 1,
      "replies": {}
    },
    "hfpr3hj": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfpr3hj/",
      "text": "I won't say anything because it won't improve my grade and not to mention how would i gather the necessary proof for it ? Do i just pull my phone out and record them cheating and potentially fail the test myself ? What's the point of playing detective lol. And before all the folks say\n\n\"WHaT IF itS GrADed On a CurVe\"\n\nOk reporting a cheater isn't going to make you automatically pass. Lol. I mean if you want to get a few decimal points higher on your grade go for it. it just isn't worth the risk of being a considered a rat to your fellow classmates. Being bullied for it and wasting your own test time being distracted on someone.",
      "author": "milk690",
      "created": 1633604905,
      "upvotes": 1,
      "replies": {
        "hfrc431": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfrc431/",
          "text": "im not saying it can make my grade better. or atleast that’s isn’t what I’m trying to say. in med school and law schools they take a look at your grades and decide on that to let you in or not. if someone who cheated and got an A and someone who didn’t cheat get a B then they will first accept the A candidate. I’m not saying it has to be me but others who can get hurt by it as well.",
          "author": "RefrigeratorDear2641",
          "created": 1633631276,
          "upvotes": 1,
          "replies": {
            "hfrnxpi": {
              "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfrnxpi/",
              "text": "Well life is unfair. Some students are born to rich families and are able to buy the best tutors for the mcat or lsat. They can even pay the tutors to do the test for them. Its a cruel world in academia and every student is out for themselves to get the highest gpa or internship. i wouldnt worry about how others are doing and just focus on yourself.",
              "author": "milk690",
              "created": 1633636172,
              "upvotes": 1,
              "replies": {
                "hftmexn": {
                  "link": "/r/college/comments/q2w4m1/cheating_on_exams/hftmexn/",
                  "text": "so what your saying is that life is unfair so i should get over it …",
                  "author": "RefrigeratorDear2641",
                  "created": 1633671309,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hfrcckw": {
          "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfrcckw/",
          "text": "i also don’t see why i would be bullied when i did nothing wrong. people who bully people for something like that (or anything in general) are just stupid and childish. i wouldn’t want to be around those people anyways so idc about them.",
          "author": "RefrigeratorDear2641",
          "created": 1633631372,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfsa4dr": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfsa4dr/",
      "text": "[removed]",
      "author": null,
      "created": 1633645832,
      "upvotes": 1,
      "replies": {}
    },
    "hfofb0i": {
      "link": "/r/college/comments/q2w4m1/cheating_on_exams/hfofb0i/",
      "text": "don’t be an adult tattletale. all im gonna say is that snitches get stitches. literally. 🤷🏼‍♀️",
      "author": "savannahgonzalez",
      "created": 1633570659,
      "upvotes": 0,
      "replies": {}
    }
  }
}