{
  "sid": "kpojkn",
  "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/",
  "title:": "You pay for college, you should know how it operates.",
  "text": "I’m gonna lead off the bat by saying this can be a long post. As someone that works professionally in Higher ed, and as someone who got their masters in student affairs and higher ed have a pretty strong understanding of how universities operate at their core. For you students out there, my plan is to lay a pretty decent foundation here to help you understand many different aspects of how your university probably operates, since you pay for it and are the reason these institutions exist. I’ll say, I’m not the expert on everything or every type of university, and my experience is entirely in the United States so that is who this will be most relevant to, but I’m hoping I can bring some interesting info to you on this Sunday morning! \n\nFirst and foremost, universities are businesses at the core. Just like Target, Walmart, or Amazon, they have a bottom line that needs to be met. Your tuition and student fees pay this bottom line, alongside federal and state funding if your institution is public. The more students a university has, the better faculty they can hire, the more research they can pump out, the better alumni they can get who will hopefully donate, and the cycle continues. Your money is being put into a long term investment by the university to sustain itself. The biggest expenditure of any university? Faculty and staff. Let’s break those down. \n\nFaculty are your professors and researchers who teach courses, contribute to scientific papers, and experts of a given field. Thing is, any bit of discovery or research faculty yield, their intellectual property in other words, belongs to the university. If I were a cancer researcher and made a massive breakthrough in cancer treatment, that belongs to my employer, not me. This is not an exclusive practice to higher ed, but consider how faculty are paid and tenured up front and how it is part of a larger system for an institution to protect their investments. \n\nStaff are everyone else. These are your custodial staff, dining staff, residence hall employees, student activities peeps, diversity center staff, etc. If the faculty are left brain, staff are right brain. Their job is to keep amenities usable, create safe environments for all on campus, and create learning/social opportunities outside of the lecture hall. I fall into this category. \n\nLet’s stick with this left brain and right brain analogy. Left brain are your academic affairs team, they are focused on the classroom experience and your enrichment in the field you have specified. Your advisors, faculty and program chairs are gonna work to develop your academic capital.  Your right brain, student affairs, will work to adjust you to being a strong functioning member of a global society, helping you network and meet people you would never normally meet. They’re focused on your social capital. These two parts of the brain are meant to work in tandem, but at many universities they grind up against each other. Some in student affairs view those in academic affairs as pretentious or uncaring. Some in academic affairs see those in student affairs as wasteful or unnecessary. I’m not here to say who is right or wrong, but instead advocate that they need to work together to create the best experience for all. \n\nLet’s talk about how your money breaks down further: your fees pay for all the above staff and faculty, as well as dining halls, programs on campus, sports and clubs. Sports are seen as big money makers on campus: this isn’t always true! Sure, some very large programs (think Alabama or UT Austin) turn a profit on their sports programs, and usually the profit from these programs go into paying for other sports on campus. Usually though, sports programs break even on their costs or even subsidize the costs across the whole student body. Sports have become their own worst enemy: they need to fill seats and charge fees to sustain themselves lest they fall apart. \n\nAnother important thing to know about your money: it doesn’t always pay for what you think it does. Some departments or offices on campus are auxiliary services. What that means is that they do NOT receive federal funding. Housing is a great example of this. All money that housing uses is *usually* only what is earned by students living in the halls. So your money goes into paying for the maintenance of all buildings, housing staff, programming etc. Parking is another auxiliary service. This is not to defend they high prices of living on campus, but instead to help explain why some of those costs are the way they are. \n\nOne last thing I’ll cover here is power. The head of your university may be titled President, Chancellor, Dean etc. You may believe this person holds all the power on campus: this isn’t necessarily true. Most heads of universities are tasked with two big things: build strong alumni relationships to get more funds, and build strong political connections on behalf of the university. These presidents or chancellors are truly political figures at the core and they have lots of different people in their ears telling them what to do: student governments, faculty and staff associations, alumni, parents, and the biggest of all, board of regents/directors. This board is where lots of power rests. I’d recommend you learn who is on your board and what their backgrounds are: this can help you understand a lot of decisions made on your campus. Ultimately though, the power is in the consumer, and that is the student body. The ability to make changes as students cannot be understated. \n\n\nWhew. That is a lot. And it doesn’t even scratch the surface of all that is there. I’m hoping that this helps provide some interesting information of how funds are allocated, how systems operate, and where the power rests in any given institution. As a student who is paying to uphold all these different things, I believe it is your responsibility to know how your money is spent and how you are being advocated for on multiple levels. My career is in supporting students through their higher ed journey and I love it to death. Because I love it so much, I really believe that it is my duty to be honest and transparent with those who pay my salary. Hopefully y’all enjoyed this and finds use in it!",
  "author": "Cosmicmix",
  "created": 1609694665,
  "over_18": false,
  "upvotes": 1432,
  "upvote_ratio": 0.97,
  "comments": {
    "gi5gyvo": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi5gyvo/",
      "text": "Your post is incredibly misleading and wrong. The administration is making a ton of money and they’re barely mentioned in your post. All those people with titles like Associate Assistant Dean can be consolidated into far fewer people and costs would go way down while their accountability to students would go up. Stop lying. \n\nSource: I’m a professor.",
      "author": "ItsOnTheSyllabus",
      "created": 1609823957,
      "upvotes": 1,
      "replies": {}
    },
    "gi4eait": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi4eait/",
      "text": "Im so glad you mentioned the sports thing. People always say \"well, athletes get all the special treatment because they make the school a profit.\" But...they don't most of the time. In fact, the university my mom works at, which is D1, has actually *lost* money from sports, and faculty have been petitioning for years to bump it down to D2 or D3 because they literally haven't gotten cost of living raises since 2012 meanwhile they school is spending millions on a team that isnt making any profit.",
      "author": "Jmh1881",
      "created": 1609803213,
      "upvotes": 2,
      "replies": {}
    },
    "gi2xz01": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi2xz01/",
      "text": "Malcolm Gladwell actually does a great series of episodes on his podcast Revisionist History about college costs and where money goes. The episodes are on Spotify, in the first season season of his podcast and are called Carlos Doesn’t Remember, Food Fight, and My Little Hundred Million.",
      "author": "killerwhaletales",
      "created": 1609778458,
      "upvotes": 1,
      "replies": {}
    },
    "gi2cd82": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi2cd82/",
      "text": "This is false. At my school all the faculty does is show up on the first day to assign your youtube courses and on the last day to turn in grades.",
      "author": "KarmaInFlow",
      "created": 1609766299,
      "upvotes": 0,
      "replies": {}
    },
    "gi28dat": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi28dat/",
      "text": "thank you so much for this super informative post i didn't know i needed!! \n\n>Whew. That is a lot. And it doesn’t even scratch the surface of all that is there. \n\nit would be great if you'd educate us more with similar posts on the insides of how a college is being ran!! that'd be fascinating to learn and certainly very useful😊",
      "author": "catheriiiine",
      "created": 1609763098,
      "upvotes": 2,
      "replies": {}
    },
    "gi1wzn1": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1wzn1/",
      "text": "I was wondering when someone would give kids around here a reality check.\n\nCollege is a business. I'm 28 years with a degree and several years experience.\n\nBut it blows my mind when I hear kids say \"Yeah, heading to college! Borrowing $100K! Sports and campus are cute!\" Uhhh what?\n\nAnd you just covered the surface! When companies come recruit on campus, you take a an internship or a job then suddenly quit it (bc it was too hard), you'll be reprimanded by the school! Most students don't understand why...after spending $100K.  You get reprimanded because the companies PAY money to recruit on. Administration wants these relationships, especially with HUGE companies. But for some reason....even business sudents don't get this.",
      "author": "fezha",
      "created": 1609751954,
      "upvotes": 1,
      "replies": {}
    },
    "gi1i026": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1i026/",
      "text": "Thanks a lot for this! I already knew a lot of these topics you brought up, but you definitely filled in the gaps that I didn’t understand!",
      "author": "Fern_Fox",
      "created": 1609738930,
      "upvotes": 2,
      "replies": {}
    },
    "gi1djdh": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1djdh/",
      "text": "Amen!",
      "author": "Subharaj_Ghosh",
      "created": 1609736034,
      "upvotes": 1,
      "replies": {}
    },
    "gi10ljm": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi10ljm/",
      "text": "All that matters to me is that I gotta pay a university to get an education that’s required of me to get a job nowadays.",
      "author": "kh7190",
      "created": 1609729037,
      "upvotes": 0,
      "replies": {
        "gi272kf": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi272kf/",
          "text": "There are lots of jobs that don’t require a university degree.",
          "author": "ProfessorHomeBrew",
          "created": 1609761939,
          "upvotes": 2,
          "replies": {
            "gi45wn5": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi45wn5/",
              "text": "that make $50k or more? highly doubt it.",
              "author": "kh7190",
              "created": 1609799039,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gi0xtld": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0xtld/",
      "text": "This seems mostly accurate, although I take issue with you saying universities are run like a business. The accounting may look lots like a business, but the element of profit is missing. The university may try to cut costs or to increase income, but this isn't usually at the detriment of its students--usually the goal is to decrease tuition (or increase it more slowly) or to allocate money for other things which will benefit the university. A business on the other hand might cut costs by charging the same price for a lesser service.",
      "author": "tennismenace3",
      "created": 1609727577,
      "upvotes": 7,
      "replies": {}
    },
    "gi0s1jc": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0s1jc/",
      "text": "> Another important thing to know about your money: it doesn’t always pay for what you think it does. Some departments or offices on campus are auxiliary services. What that means is that they do NOT receive federal funding. Housing is a great example of this. All money that housing uses is usually only what is earned by students living in the halls. So your money goes into paying for the maintenance of all buildings, housing staff, programming etc.\n\nTo build on this: this is why your school may not refund your housing or meal plan if you move out of the dorms partway through a semester, especially if it's a private university or college. You aren't paying for *your specific* lodging and meals, you're subsidizing part of the cost to provide those services to everyone. (Just like your tuition isn't paying *your specific* professors' salaries.)\n\nSome schools (like the one I work for) have partnered with outside companies to provide housing and/or dining services, so issuing refunds may not even be up to the university, but rather Sodexo or Aramark or whatever company they've contracted with to provide these services for you. Especially for the Spring 2020 semester, (1) not everyone was able to leave in March, and (2) the school/Sodexo/whoever still needed to pay the staff providing services for the ones who stayed.",
      "author": "tehzephyrsong",
      "created": 1609724659,
      "upvotes": 5,
      "replies": {}
    },
    "gi0e1zm": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0e1zm/",
      "text": "There is some truth to what is said here, but I find myself cringing at some of the finer points. The left/right brain analogy is. . crude. \n\nTo add context, in the past universities mainly consisted of faculty. Faculty taught, mentored, advised, administered. They did it all, except cleaning and preparing meals. Over time there was a need for people to specialize in certain areas and institutions found that parents expected them to take care of their students in many various ways. This is called “duty of care.” Duty of care is the reason services at universities and colleges have expanded so much over the 20th century, and most especially in the last 40 years. Institutions are expected to provide for the mental, physical, and social health of their students in order to provide an environment that is conducive to learning. \n\nThese expectations coupled with dwindling state funding are two major forces in the rise of cost of attendance. In 2011, it cost an institution on average $12,000 per year to educate one student ($14,000 for universities, $9,000 for colleges). That’s the price to educate them (teaching, student support, and administration). Not the price to provide counseling, health centers, student activities, or sports. \n\nInstitutions must offer these other services. It’s both expected and can be contributing factors on whether incoming students decide to attend the institution, which yes, does affect the caliber of student and alumni population and the cycle of donations to keep the school operating and growing. This is all not to mention the institution’s responsibility to their community. \n\nYes, institutions must keep business practices in mind for continued operation. But don’t let that fool you into thinking education is exactly like any other business operation out there. Higher education has many more nuances as well as regulations that make it unique from other fields.",
      "author": "persephone_24",
      "created": 1609717729,
      "upvotes": 22,
      "replies": {}
    },
    "gi0bduh": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0bduh/",
      "text": "Good post. I deal with colleges across North America for my job. I’m amazed how many auxiliaries are outsourced. In many cases the student center operates like a mall, and the food services and bookstores are often outsourced. It used to be that a culinary program would use a food operation as part of that program, but it is very rare. And bookstores are changing into convenience stores as books go to digital subscriptions or “rentals” or adopt an inclusive access program. I find it ironic that campuses who claim to offer a top tier business school can’t find the talent to self-op these businesses.",
      "author": "vicemagnet",
      "created": 1609716473,
      "upvotes": 3,
      "replies": {
        "gi187nb": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi187nb/",
          "text": "On your last point, the education field does not pay. I’ve seen so many people go to the private sector because their pay will double.",
          "author": "persephone_24",
          "created": 1609733052,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gi091qr": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi091qr/",
      "text": "Staff and custodial are the biggest expenses? Try administrators",
      "author": "redwhiteyellowblue1",
      "created": 1609715375,
      "upvotes": 8,
      "replies": {
        "gi15s7e": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi15s7e/",
          "text": "Oh look a person complaining about administration. How original.",
          "author": "AlexOrion",
          "created": 1609731812,
          "upvotes": -3,
          "replies": {}
        }
      }
    },
    "gi064yb": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi064yb/",
      "text": "I’m really sorry to see you invoking the “student as consumer” paradigm. The corporate model is not appropriate for higher education (nor for health care). If we must use this model, the students would be the *products* and their future employers or graduate schools would be the consumers. The faculty are quality control.",
      "author": "Act-Math-Prof",
      "created": 1609713975,
      "upvotes": 18,
      "replies": {
        "gi0esdw": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0esdw/",
          "text": "Seconded. There a lot more nuance in this field than what is described in the post.\n\nETA: It’s why there are even *graduate* degrees to allow people to understand how everything works.",
          "author": "persephone_24",
          "created": 1609718068,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "gi04w0q": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi04w0q/",
      "text": "I Would add that at most state universities, tuition is less than 40% of the cost, with the state and feds picking up the balance ot the tab.\n\nDorm, meal plan, other living expenses are really not part of the cost of your education. They are your living expenses whether you go to school or not go to school. No such thing as a free lunch.\n\nThe trend in student housing is moving away from university provided services to private companies building and operating these nice student apartments with individual bedrooms and bathrooms and dining halls with greater diversity in meals. Those cost more to provide than the old three in a room, common bathroom down the hall, with everybody eating the same meal.  Many of these are built on university ground under a ground lease agreements without government bonds paying for the building. Therefore the price is higher than those old dorms when parents and grandparents attended colleges. Side note, the state legislatures are shifting money away from providing affordable housing to other spending. A state issue, not a federal issue.)",
      "author": "Kimmybabe",
      "created": 1609713387,
      "upvotes": 7,
      "replies": {}
    },
    "gi01c7m": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi01c7m/",
      "text": "How about we just cut some of the useless administration positions to make college cheaper?",
      "author": "Homelesscat23",
      "created": 1609711742,
      "upvotes": 12,
      "replies": {
        "gi2xgwy": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi2xgwy/",
          "text": "I don’t know if you’ve seen The Patriot Act on Netflix, but Hasan Minhaj does a great episode on college costs and touches on this issue a lot.",
          "author": "killerwhaletales",
          "created": 1609778216,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghzz3h4": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzz3h4/",
      "text": "Several of your professors are struggling. 60 to 70 % of your professors are adjunct faculty. They do not have sick days, vacations or Health insurance. They receive 2500-3500 for a course of 3 credit hours and 1500-2000 for a 1 credit course (for the whole course, not monthly). As adjunct faculty they make 25000- 50000 per year, depending on how many courses they teach in different places. 1 in 4 adjunct faculty is on SNAP. They work as adjuncts because they love teaching, and because they think that maybe in the future, they can get a full time position. They usually do a lot more of what they are being paid for.",
      "author": "iamnewhere2019",
      "created": 1609710705,
      "upvotes": 137,
      "replies": {
        "gi0hy20": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0hy20/",
          "text": "That is well above the average adjunct pay per credit. One credit is 1/3 to 1/2 of that nationally.",
          "author": "GriIIedCheesus",
          "created": 1609719563,
          "upvotes": 36,
          "replies": {}
        },
        "gi1c4sm": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1c4sm/",
          "text": "[deleted]",
          "author": null,
          "created": 1609735184,
          "upvotes": 14,
          "replies": {
            "gi1dvwd": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1dvwd/",
              "text": "Even a large proportion of non-adjunct faculty get paid significantly less than 6 figures. \n\nThe average for pre-tenure (assistant professors) at doctoral research universities is 90k, going up to right around 100k for tenured associate professors and around 160k for tenured full professors (usually 15-20 years in). Obvious variation applies. But that's not a majority of schools nationwide, and includes both public and private and really high-paying fields like business and medicine. \n\nIf you drop to institutions that have masters programs or are focused on undergraduate teaching, it's closer to 70/80/100k for the same ranks (again, average across all fields). Many faculty are pulling in salaries in the 50-70k range.",
              "author": "Eigengrad",
              "created": 1609736247,
              "upvotes": 10,
              "replies": {
                "gi1kmpr": {
                  "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1kmpr/",
                  "text": "Wow. So I’m making 30-50k more than my professors and I don’t even have my degree yet? This really puts things in perspective for me. I always felt my lack of degree was holding me back. \n\n(Context: I’m a returning student that already has a 15 year career in marketing but no degree.)",
                  "author": "cappytan-exjw",
                  "created": 1609740831,
                  "upvotes": 13,
                  "replies": {
                    "gi1nmm1": {
                      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1nmm1/",
                      "text": "Yup. A number of my students make more than I do a job or two after graduating. \n\nMy salary as a professor is somewhere between 1/3 and 1/2 of what I would make if I went to work in industry. Most professors don’t do it for the money- they do it because they like it and think it’s important work.",
                      "author": "Eigengrad",
                      "created": 1609743178,
                      "upvotes": 12,
                      "replies": {}
                    },
                    "gi4ett0": {
                      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi4ett0/",
                      "text": "Mhm, my mom is a fully tenured prof and is only making 50k. My dad is as well, and the head of a department, and makes 85k. Its honestly gross how poorly professors are paid when they have the highest level of education in the country and are literally the reason modern knowlage on basiclly anything exists",
                      "author": "Jmh1881",
                      "created": 1609803484,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gi4ekox": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi4ekox/",
              "text": "Oh God, that makes me LIVID. I remember in August, all these college kids were like \"sChOoLs aRe oNLy gOinG bAcK bEcauSe tHe faCulTy aRe sElfIsH.\" Like no, they arent. They arent getting paid shit lmao. My parents would have lost their jobs if their univeristy didn't get the room and board money from students living on campus.",
              "author": "Jmh1881",
              "created": 1609803356,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ghzwig8": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzwig8/",
      "text": "\nI live in Norway and I have payed a total of approximately 460USD for my entire bachelors degree. Can't relate",
      "author": "Schl33m",
      "created": 1609709520,
      "upvotes": 42,
      "replies": {
        "ghzyaiu": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzyaiu/",
          "text": "Right, because your government actually supports your institutions of higher education. You cannot run a university on $120 per student per year.\n\nIn the US, state support for universities has been consistently treding down as legislatures cut subsidies.",
          "author": "biggreen10",
          "created": 1609710334,
          "upvotes": 39,
          "replies": {
            "gi02mbl": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi02mbl/",
              "text": "And legislatures cut spending to increase spending in other areas because federal parent plus loans without any limitations made it possible to shift a thousand or two thousand dollars per student per year away from the university over many years. The students and their parents did not notice it.This is a state problem, not a federal problem, and the worst places age generally blue states. And with the Covid-19 reducing state revenues, it's going to get worse.",
              "author": "Kimmybabe",
              "created": 1609712337,
              "upvotes": 12,
              "replies": {}
            }
          }
        },
        "gi03c4k": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi03c4k/",
          "text": "Curious, did that free four years, except for $460, include dorm and meals as well as tuition?\n\nWhat percent of students finishing high school each year attend colleges there?",
          "author": "Kimmybabe",
          "created": 1609712670,
          "upvotes": 3,
          "replies": {
            "gi0a1hr": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0a1hr/",
              "text": "Just tuition. Dorms/apartments we have to take care of ourselves, but we get 800USD per month throughout our studies, of which we only have to pay back 40% if we pass our degrees.\n\nNot sure how many attend colleges after HS, but the system is like this, so everyone who has the required grades/classes, can attend. The required grades and classes differ throughout the various degrees/studies.",
              "author": "Schl33m",
              "created": 1609715845,
              "upvotes": 18,
              "replies": {
                "gi16qux": {
                  "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi16qux/",
                  "text": "I would love to see something similar in the US, but I have to be realistic that it’s not likely to happen in my lifetime. \n\nSeeing your post made me think about my own education expenses. I was extremely fortunate and honestly lucked out in several ways. Through my undergrad and grad due to scholarships, merit grants, and tuition waivers, I was paid $8 to attend school over 5 years of my life. This is tuition and fees, income tax on the waivers, and books fees subtracted. Housing and living expenses were separate. \n\nI probably sound ancient, but I’m 28. I graduated with my Master’s 5 years ago. I’m the first in my family to attend college, so it even being an option was a miracle. \n\nI work directly with students and I have seen extreme ends of the spectrum. I wish my experience was the norm. It’s far from it. Some students have parents that pay for everything. Some get Pell grants (due to being very poor) and have to take out excessive loans to make up the difference. Some have parents that make just enough for them to be ineligible for federal aid but their parents have other financial obligations/refuse to help. The majority of my students face significant debt that will be with them for at least 10 years with how some payment plans work. These loans mean people wait to buy a home (or never do), wait to have children (or never do), or wait to travel (or never do). And if they have loans but did not graduate for some reason, it’s even worse.  \n\nDon’t take your experience for granted. And tell anyone willing to listen what the support you received has allowed you to do in life. So many people don’t have that option here.",
                  "author": "persephone_24",
                  "created": 1609732306,
                  "upvotes": 8,
                  "replies": {
                    "gi2g3x0": {
                      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi2g3x0/",
                      "text": "I'm definetely not taking it for granted. I wish students in every country had it as easy as we have it in Norway when it comes to the economic side of college. But the way i see it, many countries have the financial sustainability to start a similar program, but choose to spend their money elsewhere, like for example the military.",
                      "author": "Schl33m",
                      "created": 1609768887,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ghzqvw3": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzqvw3/",
      "text": "Do you believe that some people aren’t met to be professors or teachers? I noticed that some students struggle in course because of the professors structure the course.",
      "author": "universalbutterfly1",
      "created": 1609707002,
      "upvotes": 8,
      "replies": {}
    },
    "ghzoc8b": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzoc8b/",
      "text": "now factor in for the fact that we are getting none of these resources with online classes and a much diminished academic experience yet universities still increased tuition for next year",
      "author": "Chayse_21",
      "created": 1609705868,
      "upvotes": 8,
      "replies": {
        "gi0q0m3": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0q0m3/",
          "text": "Software isn't free.",
          "author": "tehzephyrsong",
          "created": 1609723625,
          "upvotes": 4,
          "replies": {
            "gi1755m": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1755m/",
              "text": "0 software changes outside of zoom calls for us",
              "author": "Chayse_21",
              "created": 1609732497,
              "upvotes": -1,
              "replies": {
                "gi1eaw2": {
                  "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1eaw2/",
                  "text": "Does that include changes on the back-end to IT infrastructure?\n\nYou mention \"outside of Zoom\", but that alone is a huge extra cost to the university. The cost of delivering the education went up (more costs, fewer students to share the cost over) not down.",
                  "author": "Eigengrad",
                  "created": 1609736506,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gi172ub": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi172ub/",
          "text": "Lets just fire everybody during a pandemic obviously good idea to lower cost.",
          "author": "AlexOrion",
          "created": 1609732464,
          "upvotes": 2,
          "replies": {
            "gi179zf": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi179zf/",
              "text": "maybe just maybe universities shouldn’t be living paycheck to paycheck on students payments each year just to pay employees.",
              "author": "Chayse_21",
              "created": 1609732565,
              "upvotes": 3,
              "replies": {
                "gi1e7fv": {
                  "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1e7fv/",
                  "text": "I mean... they're non-profit. That's the whole point- they take in student tuition, and use it to directly pay for the campus services.",
                  "author": "Eigengrad",
                  "created": 1609736446,
                  "upvotes": 3,
                  "replies": {
                    "gi1ehq9": {
                      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1ehq9/",
                      "text": "yep. and when those services are no longer existent...why are they still taking said money to pay for services students do not receive?",
                      "author": "Chayse_21",
                      "created": 1609736624,
                      "upvotes": 2,
                      "replies": {
                        "gi2rd3c": {
                          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi2rd3c/",
                          "text": "Because the biggest cost is the people who do the student services, and as someone said above it's not a great idea to just fire everyone until the pandemic ends and you have to hire a bunch of people again.",
                          "author": "dogsdogssheep",
                          "created": 1609775220,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gi4oobk": {
                  "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi4oobk/",
                  "text": "If Universities overcharge students to have a bigger savings fund they can do that but students don't like that either.",
                  "author": "AlexOrion",
                  "created": 1609808587,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ghzm1qj": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzm1qj/",
      "text": "I know you're just giving a surface-level overview here and not getting into all the nuance and details, so don't take this as a stereotypical angry internet \"you're wrong you f-ing dummy!\" rant. Just adding a little more flavor...\n\n>Faculty are your professors and researchers who teach courses, contribute to scientific papers, and experts of a given field.\n\nUp until last year, not a single member of my department had a degree in their field (composition studies). We're not experts. We're mostly creative writing MFAs and literature MAs who just love teaching and writing.\n\n>Thing is, any bit of discovery or research faculty yield, their intellectual property in other words, belongs to the university.\n\nProbably depends a lot on the department and even more on if there's any sort of research grants involved, I'd guess. In the humanities, it seems to be the norm that faculty own all their own research.\n\n>Their job is to keep amenities usable, create safe environments for all on campus, and create learning/social opportunities outside of the lecture hall.\n\nKinda... but ultimately their job is to make sure seats get filled. Maintaining amenities that get shown off on tours will often take priority over maintaining things students and faculty use every day.\n\n>Let’s talk about how your money breaks down further: your fees pay for all the above staff and faculty, as well as dining halls, programs on campus, sports and clubs\n\nI want to quibble over the terminology here, because \"fees\" has a specific use in college costs, distinct from tuition, housing, and meal plans.\n\n>think Alabama\n\nRoll Tide\n\n>One last thing I’ll cover here is power.\n\nFor students, the most relevant wielder of power is usually going to be the department chair. Even to tenured professors, the department chair still has a lot of weight to throw around, and can usually force the troops to get in line. Their boss is the dean, but a dean is going to be reluctant to get into a fight with a department chair over a dispute between a student and a professor.",
      "author": "bl1y",
      "created": 1609704826,
      "upvotes": 35,
      "replies": {
        "gi0i9ih": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0i9ih/",
          "text": "I'd quibble with your last point. My department chair has absolutely zero power over me as a faculty member. Dean of the college is the person with power over me. \n\nThat said, I've made (and will continue) to make the point that on aggregate, students have more power to effect change than even tenured faculty. Faculty are employees (and expensive ones), but students are the source of income. Sufficient student and alumni unrest, properly focused, will do more to effect change than anything the faculty can do. \n\nAll you have to do to see that is watch university systems where the faculty vote no confidence in the president (united front) and the board backs the president and nothing changes.",
          "author": "Eigengrad",
          "created": 1609719715,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "ghzlv2v": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzlv2v/",
      "text": "There are spaces on a campus where the idea of institutions of higher ed being a business is appropriate: the dining commons, residence halls, student centers, etc. The classroom should never be one of those spaces.",
      "author": "prof_dm",
      "created": 1609704742,
      "upvotes": 100,
      "replies": {
        "gi0ft42": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0ft42/",
          "text": "> the dining commons, residence halls\n\nI'd argue these shouldn't been profit driven either, especially residence halls. Those are essentials, and turning them into an engine to price gouge teenagers living on their own for the first time is unacceptable.",
          "author": "fullforce098",
          "created": 1609718558,
          "upvotes": 49,
          "replies": {
            "gi0jiil": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0jiil/",
              "text": "To the degree that residence halls and dining commona provide amenities beyond essentials, they are a commodity that students are renting/purchasing. So I agree with you to a degree.\n\nThat said, residence halls are essential to only a portion of a given university population. Nontraditional students, online students, and commuter students come to mind as students who do not require residence halls.",
              "author": "prof_dm",
              "created": 1609720322,
              "upvotes": 12,
              "replies": {
                "gi0tgtt": {
                  "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0tgtt/",
                  "text": "Many universities, including the one I work at, require all incoming freshmen to live on campus. So it ends up being an essential service for nearly all students, even if just for a year or so, and only approximately 25% of the university student population at a time. And when they charge exorbitant prices, well above the local market value (plus requiring an additional, equally overpriced, meal plan), I'd definitely say that's an area they should improve.",
                  "author": "Roquemore92",
                  "created": 1609725385,
                  "upvotes": 17,
                  "replies": {
                    "gi2kv3h": {
                      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi2kv3h/",
                      "text": "I wholeheartedly agree that improvement is needed.\n\nMy point was that in our capitalist society, residence halls are a service industry. If you want beautiful dorms, movie theater style commons rooms, rec rooms, and food courts in the residence halls, you're going to pay more. \n\nI understand not every dorm is like this and there are some real stinkers out there. My college dorm had walls that would move if you leaned on them, and this was late 2000s.\n\nI still agree that the norms should be challenged, but so long as there are parents and students who demand more and more of this kind of resource, I don't know why universities would change.",
                      "author": "prof_dm",
                      "created": 1609771758,
                      "upvotes": 1,
                      "replies": {
                        "gi2sniu": {
                          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi2sniu/",
                          "text": "The point about it being a service industry and wanting the nice amenities doesn't really apply in this case though.\n\nThat argument only works if there is a choice involved. Universities add those extras as an excuse to charge students more, but those students don't have a choice. I'm sure if given a choice, some would still choose for the overpriced on campus residence with those amenities, but most would go for cheaper options. Hell, at least here, even with the \"extra\" amenities provided, they still are a good 50-75% more expensive than comparable off campus alternatives, and those off campus options don't require sharing a room, having an additional meal plan, or any of the other restrictions that come from living on campus.\n\nDon't get me wrong, I understand the studies that show that living on campus the first year improve retention rate. I don't necessarily have a problem with students being required to live on campus the first year (as long as there are exceptions for lower income students or those who live close to campus), but what I have the problem with is both requiring that, and only offering housing options that are so much more expensive than options in the surrounding community that it causes undo financial hardships on the students or making them take out extra loans just to pay for that.\n\nFor example, the absolute cheapest on campus option here is still >$10k for August-May. That is for a shared room with community bathrooms in the oldest dorm building still on campus. In the same area, for the same amount of money, I could rent a 2 bedroom apartment or house, with no roommates, for the entire year. Our mortgage for a 3 bed place fairly close (about 5 minutes) to campus is less than that for the whole year. And that's not counting the overpriced meal plans at over $4700/year, which is about $525/month. That's about the same as what my wife and I spend on both groceries and restaurants for the 2 of us.\n\nAll this could vary university to university, but at least all the major ones in this region, and all the ones I've looked at elsewhere have similar numbers, way above the regular housing prices in the area.\n\nI know there are some people that are always demanding more and nicer things in this area, but at least around here, people have been complaining about both the cost and quality (i.e. mold issues for decades) of the dorms for years. And yet apartments around campus are able to have much cheaper costs with no mold problems, and the same or better amenities.\n\n> I'd argue these shouldn't been profit driven either, especially residence halls. Those are essentials, and turning them into an engine to price gouge teenagers living on their own for the first time is unacceptable.\n\nThat post above basically sums up everything. You mentioned residence halls providing amenities beyond essentials so they are a commodity, but that completely ignores the fact that the students don't get a choice there. If they had a choice to live on/off campus, then I could agree with that, but they don't in most cases. Now, if people who aren't required to live on campus choose to, then that's completely on them. \n\nSorry for the long rant, I know you said improvement is needed, but it's much more drastic an issue than saying it's only essential to a portion of the university population or that they provide more amenities so you're going to pay more. It really is an epidemic (alongside the cost of tuition) that causes more and more student loans to be taken out by kids barely out of high school, having their very first taste of adulthood, sending them straight in to massive debt.",
                          "author": "Roquemore92",
                          "created": 1609775863,
                          "upvotes": 1,
                          "replies": {
                            "gi2vay0": {
                              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi2vay0/",
                              "text": "Again, I wholeheartedly agree improvements are desperately needed, but I believe you are generalizing the problem.",
                              "author": "prof_dm",
                              "created": 1609777169,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gi15fy2": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi15fy2/",
              "text": "Well public universities are unable to make a profit. Residence halls become more expensive because students don't like living on top of each other in tiny rooms.  So they build nicer more spacious buildings and that added space and construction results in higher bond payments.  More students more buildings equals higher cost for everyone.",
              "author": "AlexOrion",
              "created": 1609731635,
              "upvotes": 3,
              "replies": {
                "gi17k71": {
                  "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi17k71/",
                  "text": "Agreed. So many people *must have* a private room on campus now. They would have on-campus living in the past.",
                  "author": "persephone_24",
                  "created": 1609732714,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gi1437j": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi1437j/",
              "text": "I'll agree with Res Halls, but dining halls should be able to at least attempt to break even. They have more variable ongoing costs.",
              "author": "asoep44",
              "created": 1609730907,
              "upvotes": 1,
              "replies": {}
            },
            "gi14h2l": {
              "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi14h2l/",
              "text": "With the new model of private-public partnerships, the private entity has to make a profit. Otherwise in many cases the institution could not afford to build/renovate dorms on their own.",
              "author": "persephone_24",
              "created": 1609731104,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gi4ezu6": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi4ezu6/",
          "text": "I really don't like the \"colleges are businesses\" model. Like yeah, they have to make money so they can run, but their goal isn't profit",
          "author": "Jmh1881",
          "created": 1609803567,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghzl1h6": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzl1h6/",
      "text": "It’s a good idea to look critically at how the university works. I wish more students did this. \n\nIt is incorrect though that our intellectual property belongs to the university. This applies in some ways to grant funded research using university equipment, but that is limited to certain fields. I am a social scientist and my research and pubs do not belong to the university.",
      "author": "ProfessorHomeBrew",
      "created": 1609704366,
      "upvotes": 329,
      "replies": {
        "ghzu5ys": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzu5ys/",
          "text": "One additional thing to note here is that even when it does belong the university, the university will sometimes sell it or release it for cheap or for free.",
          "author": "Jonjoloe",
          "created": 1609708455,
          "upvotes": 52,
          "replies": {}
        },
        "gi0hwy3": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/gi0hwy3/",
          "text": "And even in STEM fields / medicine, it totally depends on the contract with the university, which can vary wildly from \"the university owns it all\" to \"the faculty member owns it all\" and everything in between.",
          "author": "Eigengrad",
          "created": 1609719548,
          "upvotes": 23,
          "replies": {}
        },
        "ghzl5sx": {
          "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzl5sx/",
          "text": "Very good correction to make, I appreciate you posting this!!",
          "author": "Cosmicmix",
          "created": 1609704423,
          "upvotes": 59,
          "replies": {}
        }
      }
    },
    "ghzf1i7": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghzf1i7/",
      "text": "If you need some one to weigh in on Technical Colleges, Tech Centers (huge difference) and CC's, let me know! They are great ways to get educated without putting yourself in debt, because they often don't have a lot of the auxiliary services, such as housing or sports teams that cost a lot of money.",
      "author": "iamsavsavage",
      "created": 1609701593,
      "upvotes": 25,
      "replies": {}
    },
    "ghz3mp4": {
      "link": "/r/college/comments/kpojkn/you_pay_for_college_you_should_know_how_it/ghz3mp4/",
      "text": "Very informative, thanks!",
      "author": "reptiwitch",
      "created": 1609696284,
      "upvotes": 29,
      "replies": {}
    }
  },
  "updated": 1634054784
}