{
  "sid": "r05qgy",
  "link": "/r/college/comments/r05qgy/should_i_apologize_to_my_professor_for_repeatedly/",
  "title:": "Should I apologize to my professor for repeatedly turning in late assignments?",
  "text": "At the beginning of my English course, I missed a good amount of assignments due to not knowing how to navigate the program (I am taking classes remotely this semester). Recently, I have really been getting my \\*stuff\\* together and I have been performing exceedingly well on assignments. The only problem is that I tend to turn in assignments many hours late. Typically, all assignments are due on Sundays at midnight. I always tend to underestimate the amount of time it will actually take me to complete assignments so instead of turning them in incomplete, I will do them to my best ability and turn them in past the due date.\n\nI have never had a conversation about my late assignments with my professor, but for each late assignment I have turned in, he has given me full credit (as long as my paper was still turned in the same night). I have really been trying to turn in my assignments before the due date but I am really struggling to get my assignments done early and on time.\n\nI don't know if I should apologize to my professor and thank him for accepting my work even though it is a few hours late? I don't know if it's a huge deal to him, but I feel extremely guilty (but for some reason, I am performing a lot better than I ever have). \n\nI don't know if I should just keep trying to get my assignments done on time and ignore if they are late or if I should bring up the issue and be honest with my professor.\n\nI am in my freshman year of college and I don't want to overreact if this is not a big deal. I just don't want it to come to the point where my professor gives me a warning or something or surprises me with a late deduction.\n\nI really am trying to be better with my time management. I don't know why it's so hard.\n\nBut yeah. \n\nThanks",
  "author": "EmotionalINFP",
  "created": 1637644735,
  "updated": 1637688987,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hlqs6v2": {
      "link": "/r/college/comments/r05qgy/should_i_apologize_to_my_professor_for_repeatedly/hlqs6v2/",
      "text": "I also feel super guilty when I do this but, yeah, no, don't draw attention to it. There are two possibilities at play here: 1) it isn't noticed because it's there when the assignment goes to be graded, or 2) it isn't cared as long as the assignment is there when it goes to be graded. Drawing attention to it at this point just screams, \"Hey, I know I'm late and I'm so sorry, but I'm continuing to turn in late stuff regardless!\". Don't do that, it looks arrogant.",
      "author": "Mammoth-Title-2102",
      "created": 1637652633,
      "upvotes": 8,
      "replies": {
        "hlquofs": {
          "link": "/r/college/comments/r05qgy/should_i_apologize_to_my_professor_for_repeatedly/hlquofs/",
          "text": "That makes sense, thank you for your advice!",
          "author": "EmotionalINFP",
          "created": 1637654646,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlqi5t5": {
      "link": "/r/college/comments/r05qgy/should_i_apologize_to_my_professor_for_repeatedly/hlqi5t5/",
      "text": "You are doing great!\n English papers can take more time than we realize. Good professors are the ones who appreciate that you are putting in the effort and give a little leeway, especially in an early class like freshman English. It's always a good idea to keep communication open with a professor and just let them know hey, I'm really working on it but sometimes I may need an extra day.",
      "author": "poison_catz",
      "created": 1637645601,
      "upvotes": 5,
      "replies": {
        "hlqoapm": {
          "link": "/r/college/comments/r05qgy/should_i_apologize_to_my_professor_for_repeatedly/hlqoapm/",
          "text": "Aw, thank you so much! This actually really helped a lot :')\n\nThank you!!",
          "author": "EmotionalINFP",
          "created": 1637649703,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlqiukr": {
      "link": "/r/college/comments/r05qgy/should_i_apologize_to_my_professor_for_repeatedly/hlqiukr/",
      "text": "Turn your shit in on time",
      "author": "Pale-Beginning",
      "created": 1637646030,
      "upvotes": 9,
      "replies": {
        "hlqo8dv": {
          "link": "/r/college/comments/r05qgy/should_i_apologize_to_my_professor_for_repeatedly/hlqo8dv/",
          "text": "Thank you, that helps so much ❤",
          "author": "EmotionalINFP",
          "created": 1637649657,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hlqx3uq": {
      "link": "/r/college/comments/r05qgy/should_i_apologize_to_my_professor_for_repeatedly/hlqx3uq/",
      "text": "just try to turn it in on time cause even though your professor now accepts them for full credit others won’t so don’t make it a bad habit",
      "author": "AffectionateDoctor93",
      "created": 1637656705,
      "upvotes": 2,
      "replies": {}
    }
  }
}