{
  "sid": "qgind9",
  "link": "/r/college/comments/qgind9/taking_up_another_major_for_better_social/",
  "title:": "Taking up another major for better social opportunities, yay or nay?",
  "text": "I realize most of you on this sub are Americans, but I am not so please let me give you some context so that you can better understand the situation.\n\nBasically I am a sophomore college student in a European capital. There's many universities in the city but different faculties of the same university are often located in entirely different parts of the city. For example I study computer science so I mainly see software engineers and electrical engineers hanging around campus I frequent. Sports aside there's no electives that you can take from other faculties. Even school events are mostly organized by faculties. \n\nThus you can imagine that I have barely met anyone except programmers and engineers. I try to partake in extracurricular activities but I haven't really managed to make meaningful friendships, only acquaintances. I would still prefer to hangout with my high school friends 10/10 times.\n\nI thought maybe I could spice up my social life AND become more well-rounded and cultured by taking up a humanities major at another university in addition to computer science. Bonus that humanities majors have way more favorable women to men ratio. I figured this would be a good way to expose myself to as many people as possible. I also think I am personally more likely to have common interests with a humanities major than a comp sci student.\n\nDo you think this plan makes any sense? Btw schooling is also free in my country.",
  "author": "MorningBusGuy",
  "created": 1635289346,
  "updated": 1635302380,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi6hq5g": {
      "link": "/r/college/comments/qgind9/taking_up_another_major_for_better_social/hi6hq5g/",
      "text": "You could also just take up 1 or 2 minors instead of another major. You could also join a sport/club that works together. These types of clubs tend to make a lot of close relationships",
      "author": "Diligent_Tea3364",
      "created": 1635290883,
      "upvotes": 2,
      "replies": {
        "hi6ivl1": {
          "link": "/r/college/comments/qgind9/taking_up_another_major_for_better_social/hi6ivl1/",
          "text": "As far as I know only BA students can take up minors here :/\n\nWhat kind of clubs are you thinking of? We used to organize outdoor soccer games when the weather was warmer, but that's about 80% of all the friendly bonding I had with people from school.",
          "author": "MorningBusGuy",
          "created": 1635291404,
          "upvotes": 1,
          "replies": {
            "hi6jfxy": {
              "link": "/r/college/comments/qgind9/taking_up_another_major_for_better_social/hi6jfxy/",
              "text": "At my school there is about 500 clubs that you can join. The ones where people are very close involve building/creating something together, working together to win something, or common interests.",
              "author": "Diligent_Tea3364",
              "created": 1635291658,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}