{
  "sid": "lenfl9",
  "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/",
  "title:": "Do you also feel like you're learning nothing or nothing is going into your head?",
  "text": "Basically I feel like I'm not getting any knowledge into my head and studying solely for the sake of improving my GPA or getting good grades. First year college student here, I know I wasn't the same in high school. In highschool I was genuinely interested in learning, for example I would actively try to apply scientific concepts learnt in school to daily life and marvel at how interesting everything was. But now I feel like am just vomitting all content I've learnt through the semester into my exams and forgetting afterwards. My profs are doing a good job at teaching too, I just feel a shift in my own mindset. This is obviously not good, I know, but are any of you experiencing similar things? If so, how do you get over it?",
  "author": "happycatto",
  "created": 1612708025,
  "over_18": false,
  "upvotes": 1095,
  "upvote_ratio": 0.99,
  "comments": {
    "gmo14ie": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmo14ie/",
      "text": "I’m having the same issue",
      "author": "Agwalker430",
      "created": 1612847378,
      "upvotes": 2,
      "replies": {}
    },
    "gmknk9f": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmknk9f/",
      "text": "You should follow some techniques that can actually help you improve your memory. Lately I've been using this website ([https://quizplus.com/](https://quizplus.com/)) for studying different subjects. It's an online platform that contains all the study resources and materials needed to learn key concepts along with high quality practice tests prepared by experts. I think it would be very helpful!",
      "author": "leena_ahmed",
      "created": 1612785749,
      "upvotes": 2,
      "replies": {}
    },
    "gmjsoti": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjsoti/",
      "text": "I kind of feel the exact opposite. I took a few years off of college and returned at 25 as a non traditional student. I learned alot about carpentry during that time but most days felt super monotonous like I wasnt learning anything. I returned for something I'm super passionate about, Forestry. And I'm learning an incredible amount of really interesting stuff (to me). I feel like I'm learning alot more now, since I'm very interested in it, than I ever was in high school!",
      "author": "Sly_leaf",
      "created": 1612758935,
      "upvotes": 2,
      "replies": {}
    },
    "gmjs2uv": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjs2uv/",
      "text": "I feel the exact same way. I’ve been doing college all remotely because of this pandemic and I can honestly say I feel like I’ve learned absolutely nothing and I am in the second active semester. I seriously considered talking to my doctor about it, because I feel dumb or something is wrong.",
      "author": "easybreezy777",
      "created": 1612758555,
      "upvotes": 2,
      "replies": {}
    },
    "gmjrdiu": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjrdiu/",
      "text": "We're going through a pandemic and online courses are rough. Give yourself a break if you're not the perfect student right now. ☺️ Your professors will understand!",
      "author": "Majestic_Pass2197",
      "created": 1612758111,
      "upvotes": 2,
      "replies": {}
    },
    "gmjpnmf": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjpnmf/",
      "text": "This happens to all College student at one point in their academic journey. You’re most likely exhausted from constant learning and routine activities. Best thing that you can do at times like this is get involved in a social community. I understand this maybe hard especially during current circumstances. But try to find a balance between school and pleasure. And in regards to you forgetting the material you’ve learned after the exams or end of semester is totally normal. You just need to expose yourself to the material you’ve learned over time. Try going over your lecture notes, lecture slides (ppt), and books. And don’t make this an “assignment” type of activity. Do it because you want to and enjoy it. \n\nBetter days are ahead of you, don’t put too much pressure on yourself. College is a trial and error process. Learn from your experiences\n\nOne last thing, carry yourself with a Growth Mindset.",
      "author": "Preposterous-_-",
      "created": 1612757071,
      "upvotes": 2,
      "replies": {}
    },
    "gmjhxeu": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjhxeu/",
      "text": "Hey I feel like that too!!!!!!!!!!!!!!!!!!!!!!!!!",
      "author": "Spirited-Advice9501",
      "created": 1612752856,
      "upvotes": 1,
      "replies": {}
    },
    "gmjf5up": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjf5up/",
      "text": "I kinda feel you. I feel like I'm learning, but I've got to put in WAY more review and study time to actually cement the things I learn in online classes",
      "author": "AnOddCoyote",
      "created": 1612751051,
      "upvotes": 1,
      "replies": {}
    },
    "gmjafq0": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjafq0/",
      "text": "I am currently doing math and I have not learn a single thing in this class. Thankfully it is just precalculus and not high tier math class. I also cannot remember what I learn from last semester even know I got a 3.8. This is why I heavily believe that general education is complete waste of money. We could be focusing on proficiency and understanding over a 3 year period. Instead we are cramming useless information into people head just to act like we make people well rounded. In truth, we are not making  well-round and people are forgetting everything they learn from these classes. Well-roundness should be job of a high school.",
      "author": "HowlSpice",
      "created": 1612748776,
      "upvotes": 1,
      "replies": {}
    },
    "gmix9ic": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmix9ic/",
      "text": "For me the difference was actively reading and annotating the texts I was given. Lectures are great (some moreso than others) but i've definitely maintained way more knowledge from in-depth readings of the course materials. I only learned to do that about halfway through college",
      "author": "Bb8P8",
      "created": 1612742225,
      "upvotes": 2,
      "replies": {}
    },
    "gmiw52c": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmiw52c/",
      "text": "Take short breaks. The system I use is basically that I take a break whenever I start getting unmotivated. It can be small or big. Whatever it takes to get me okay again. When I did essays, I would do 3 sentences, then take a break for 5-15 minutes. In between paragraphs I take 30 minute breaks. You would think it wastes time but I got essays done within 1-2 days, even when super stressed.",
      "author": "HermioneandKatniss",
      "created": 1612741631,
      "upvotes": 2,
      "replies": {
        "gmjcfyp": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjcfyp/",
          "text": "This is an interesting strat. I'll use this for college, thanks",
          "author": "mysocksx",
          "created": 1612749757,
          "upvotes": 1,
          "replies": {
            "gmkkzmv": {
              "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmkkzmv/",
              "text": "Np",
              "author": "HermioneandKatniss",
              "created": 1612783514,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gmjlnzr": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjlnzr/",
          "text": "You mean like pomodoro? I'll try it thanks! :) But I much prefer doing 2-3 hours of work then taking an hour of break, but I'm open to suggestions since this is no longer working huhu",
          "author": "happycatto",
          "created": 1612754770,
          "upvotes": 1,
          "replies": {
            "gmkkymy": {
              "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmkkymy/",
              "text": "I tried being pretty specific with a special pomodoro timer, but it wasn’t working and essentially taking up space on my tablet. (It was an app) Just remember to wing it!",
              "author": "HermioneandKatniss",
              "created": 1612783489,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gmitt1j": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmitt1j/",
      "text": "You have no idea how much you've really learned yet as you haven't had a chance to really use it yet. In five years you will suddenly remember things or you will have an experience that causes you to think about something in a different way or make something click. As someone else said, if you're getting good grades you're probably learning.",
      "author": "Dr_Pizzas",
      "created": 1612740418,
      "upvotes": 2,
      "replies": {}
    },
    "gmiszub": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmiszub/",
      "text": "Is there a way that you can make the content more relevant to you? For instance, I decided I didn't want to be a news reporter during my undergrad journalism program. We could write stories on whatever we wanted for class assignments, so I took the opportunity to write stories on urban development, as it was something I was interested in for future investment. Because I had to do the assignments anyway, why not kill two birds with one stone? \n\nAre you in any business classes? If you want to start your own business one day, treat class as if you are learning about how to run your own business. Think about the course content in terms of how it would apply to your venture and use it to your advantage. \n\nMy point is, think about what you want to do in life after college and try to apply the content to what you would like to do (if possible).",
      "author": "Violet_Atlas",
      "created": 1612740004,
      "upvotes": 1,
      "replies": {
        "gmk33da": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmk33da/",
          "text": "major: chem + bio! not in any business classes no. Since my aim is medschool, I think retention of knowledge is important, not just gpa. (ofcourse gpa is important too)",
          "author": "happycatto",
          "created": 1612766489,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gmiq9q6": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmiq9q6/",
      "text": "First off, I'd like to lead with I have never been to college, so this could be different for you or other people.\n\nFrom what I have heard from other people's experiences, college isn't about learning and applying knowledge. It is more so a challenge that you have to collectively overcome.\n\nThis is compounded by the fact most people do not apply what they learned into the field they go into. For example, someone going into computer sciences may never use a good chunk of what they learn when going into an IT job.\n\nOverall, going to college and getting a degree is meant to be something that shows people \"hey, I did this. I went in, stuck it out, and got my degree.\" It shows commitment and ability to conquer obstacles.",
      "author": "AgileImpakt",
      "created": 1612738664,
      "upvotes": 2,
      "replies": {}
    },
    "gmiothz": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmiothz/",
      "text": "Final semester in college here as a biology major and I agree 100%. These upper level courses have no connection to me going med school. I finished organic chem 2 and biochem 1 last summer and that was my last requisite.\n\nI honestly question why I am still doing this, but you know it is what it is.\n\nI agree though having the can do mindset and being optimistic really does help a lot!",
      "author": "Rmaranan1999",
      "created": 1612737907,
      "upvotes": 5,
      "replies": {}
    },
    "gmic2mo": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmic2mo/",
      "text": "I have been thinking about this exact thing for the past few days. I feel like I have the writers block equivalent of learning",
      "author": "TheNextMorganFreeman",
      "created": 1612732819,
      "upvotes": 3,
      "replies": {}
    },
    "gmiae83": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmiae83/",
      "text": "You’ll be a  surprised one day you just know stuff you think everyone knows and it’s not. It’s stuff you realize you learned in college. \n\nI was a bio major and I randomly remembered all the steps in the metabolism of some toxic heavy metals one day- something from my toxicology course I thought I’d forgotten instantly after that test. \n\nI get memory bubbles like that all the time- I look at a tree and can tell you a thousand facts about it and how it converts sunlight to sugar etc. all stuff I thought I hadn’t actually learned... it just needs time to marinate I guess.\n\nSame goes for my non-bio classes. I’ve got tons of info on art, philosophy, psychology, etc. it just bubbles up to the surface when I’m in conversation with someone from time to time.  College really does make you more well rounded.",
      "author": "Nerobus",
      "created": 1612732311,
      "upvotes": 4,
      "replies": {
        "gmkorms": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmkorms/",
          "text": "This.",
          "author": "L4dyGr4y",
          "created": 1612786729,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gmi3zr5": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmi3zr5/",
      "text": "That's the American education system for you. Americans emphasize good grades over proficiency and understanding.",
      "author": "tekkersmate",
      "created": 1612730320,
      "upvotes": 3,
      "replies": {}
    },
    "gmi2abr": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmi2abr/",
      "text": "College is a tool. Always remember that. \n\nProblem is that said tool is hardly used properly by those who get to wield it. The professors may not give you the right information or expect you to regurgitate their preconceived notions with no critical thinking, or, worse, you get GAs that are too overwhelmed or not knowledgeable (or both) to teach properly. \n\nThen there is the student that thinks that a lecture or reading is enough to learn. However, if you do not apply it or think upon it regularly (or, more often, at all), then how can you expect to learn anything?\n\nCarl Rogers was quoted as to have said, “The only person who is educated is the one who has learned how to learn.”\n\nDo not take this as an attack but as a lesson. The majority of college students that have been polled answered as having learned very little or nothing during their college years according to an annual survey by Gallup and the Strada Education Network. Take this realization that you fall into that percentage of generalizability and work to change rather than mope. \n\nGood luck in your future studies. A professor once said to my class that a person who gets an A in a course does not necessarily learn the material for that course.",
      "author": "sanfortunado",
      "created": 1612729796,
      "upvotes": 9,
      "replies": {
        "gmjlasa": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjlasa/",
          "text": "thank you for the insight! i do think marks =/= knowledge but it's sad that academic potential is mostly judged by a few numbers on the gpa scle. :(",
          "author": "happycatto",
          "created": 1612754568,
          "upvotes": 2,
          "replies": {
            "gmjpqry": {
              "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjpqry/",
              "text": "Cannot think of any studies that support the argument of the GPA scale to aid learning. This causes students to focus on appeasing professors and learning the skills of networking which sounds great in that regard, but then what about the field that they are supposed to learn too? My suggestion is to focus on getting an A while in the classroom, and then you apply critical thinking during discourses and other situations outside of the school (unless you are absolutely confident that your professor will back critical thinking).\n\nIf your professors are open, then I suggest you bring your concerns to them. A great professor will assist you.\n\nEDIT: What is your major or field if you do not mind me asking? This could also better answer your question on how to cope or to understand the real-world application (from me or somebody else.)",
              "author": "sanfortunado",
              "created": 1612757123,
              "upvotes": 2,
              "replies": {
                "gmkk2hb": {
                  "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmkk2hb/",
                  "text": "chem + bio :) aiming for medschool",
                  "author": "happycatto",
                  "created": 1612782666,
                  "upvotes": 2,
                  "replies": {
                    "gmksg9v": {
                      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmksg9v/",
                      "text": "Yeah then it’s probably just first year fluff. Still, you can talk to professors if you are concerned.",
                      "author": "sanfortunado",
                      "created": 1612789452,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gmhvq0m": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhvq0m/",
      "text": "This. And I am studying from the time I wake up until I go to bed. My microbiology class is completely online-through Pearson-and I’ve went through the 4 chapters 3 times, countless YouTube lectures. I go to take the quiz on one of the chapters and felt like I didn’t know half of it. I’m putting so much pressure on myself also because I got a 4.0 first semester and I want to keep it that way.",
      "author": "melsue1026",
      "created": 1612727541,
      "upvotes": 1,
      "replies": {}
    },
    "gmhu603": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhu603/",
      "text": "I feel exactly the same.",
      "author": "adamnblake",
      "created": 1612726790,
      "upvotes": 2,
      "replies": {}
    },
    "gmht2wg": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmht2wg/",
      "text": "Yes I feel like I don’t retain info as much anymore",
      "author": "Angy-Jellyfish-0819",
      "created": 1612726253,
      "upvotes": 2,
      "replies": {}
    },
    "gmhr8d3": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhr8d3/",
      "text": "As someone who is in the process of completing 3/4 of my college semesters online, I strongly believe this is a direct side effect (affect?) of trying to do school during a pandemic coupled with the fact that unlike high school, to be a full time college student you have to be taking 12+ credits (3-5 classes a semester) meaning you could be taking up to 10 different classes in a given school year. I know I'm not maintaining all that information ESPECIALLY not in the middle of a panoramic when a majority of the \"after college adult life\" is hitting me during college.  \n\nI survive by reminding myself that if I stop now, I lose my scholarship and 9 times outta 10 am not going to try college ever again in life.",
      "author": "jcgjg",
      "created": 1612725343,
      "upvotes": 2,
      "replies": {
        "gmi1w1h": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmi1w1h/",
          "text": "effect\n\nBoth affect and effect can be both a verb and a noun. But the more typical usage is: effect is a noun and affect is a verb. I remember this because I know the phrase “special effects” and that ‘effects’ is a noun there.",
          "author": "IthacanPenny",
          "created": 1612729683,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gmhqqsp": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhqqsp/",
      "text": "High school is just easier—my bio class met every day of the week (and one day a week was longer for lab), and it was two semesters, and the class was smaller. Now intro bio is one semester only three days a week so you really have to do a lot on your own and that’s hard.",
      "author": "ColaRBT16",
      "created": 1612725108,
      "upvotes": 3,
      "replies": {}
    },
    "gmhn8ir": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhn8ir/",
      "text": "Professors won't always have the time or inclination to go into why a subject is interesting or important, but that info is out there if you look.  I would always try to research the history of every new subject.  You have the power to steer your own interests.",
      "author": "pmw7",
      "created": 1612724038,
      "upvotes": 2,
      "replies": {}
    },
    "gmhlyy4": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhlyy4/",
      "text": "I’m gonna graduate this semester with a 4.0 and I remember something about a dog and saliva",
      "author": "iceman2kx",
      "created": 1612723708,
      "upvotes": 11,
      "replies": {
        "gmjhsal": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjhsal/",
          "text": "I'm aiming for a 4.0 this semester bc I feel like if there's a semester where I can do it with \"minimal effort,\" its this one. Any advice?",
          "author": "discerningpotato",
          "created": 1612752783,
          "upvotes": 1,
          "replies": {
            "gmjxr8z": {
              "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjxr8z/",
              "text": "as someone that maintained a 4.0 up to the \"this 4.0 is fucking useless\" epiphany; do the homework. like, actually *do* the homework. that's 90% of the battle imo.",
              "author": "liftingline27",
              "created": 1612762353,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gmhlm79": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhlm79/",
      "text": "College has definitely made me a less shit writer. Even if I completely forget half the stuff I’m writing about next week having a strict TA and having to not BS does feel like it’s stretching my critical thinking skills.",
      "author": "Amaxter",
      "created": 1612723610,
      "upvotes": 9,
      "replies": {}
    },
    "gmhlex0": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhlex0/",
      "text": "Yes I've felt this way a lot in my college experience. I'm doing a mechanical engineering degree online (not due to the pandemic). At least once per semester I have felt I'm just doing work to get a grade and not learning. For example, I'm in calculus 3 right now. I just finished a homework assignment and looked at my work on one of the last problems and thought to myself \"damn, 1 year ago I would've looked at that problem and not had any idea what they are talking about\". Sometimes it might feel like you're not learning, but you more than likely are. Sometimes it takes getting to calculus 3 to realize you have actually learned something, sometimes the revelation comes sooner. But know that just because it doesn't feel like you're learning, you probably are.",
      "author": "Mickey_Randal",
      "created": 1612723553,
      "upvotes": 16,
      "replies": {}
    },
    "gmhkx7g": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhkx7g/",
      "text": "If you are getting decent grades without cheating you are likely learning. One day you'll be talking about something with someone and realize you know what that is or how that works and a light bulb will light above your head as you realize that you learned that shit! It's an amazing feeling. \n\nI have the same feelings sometimes and then I'll be at work and something relevant will come up with one of my projects and I'm like \"oh yeah, I learned how this works\" or \"how to figure this out\".",
      "author": "Dont_Blink__",
      "created": 1612723417,
      "upvotes": 86,
      "replies": {
        "gmi4aa1": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmi4aa1/",
          "text": "Agreed! I'd give you an award if I had one but this is soooooo trueee. I used to think what I learned was shit until I could actually think back and apply it and I was mind BLOWN.",
          "author": "ambitiousvanilla_",
          "created": 1612730415,
          "upvotes": 19,
          "replies": {}
        },
        "gmjl2rx": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjl2rx/",
          "text": "I guess I did feel like that, like when my friends would ask me questions on course materials I'd be able to answer them without actually knowing that the knowledge was in my head the whole time! But I didn't think I was actually learning, I thought I was just good at memorizing stuff taught in class. Huh, thanks for reassuring me!",
          "author": "happycatto",
          "created": 1612754448,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gmhjlwy": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhjlwy/",
      "text": "I felt like this a lot but once online learning hit it was basically full send into pointless school work. I quite literally have no learned anything in the last year and I graduate in May. So happy with how I’m spending my time, money, and energy.",
      "author": "mgs108tlou",
      "created": 1612723076,
      "upvotes": 3,
      "replies": {}
    },
    "gmhjh4d": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhjh4d/",
      "text": "Remember i felt the same during my first year of my bachelors degree in nursing. Am now in my 6th and last semester and I recognize that I have learned alot! Learning takes time. Be patient. You'll learn that you have learned.",
      "author": "Schl33m",
      "created": 1612723045,
      "upvotes": 30,
      "replies": {}
    },
    "gmhj4w7": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhj4w7/",
      "text": "5th year here who feels like he's learned nothing",
      "author": "Zefphyrz",
      "created": 1612722943,
      "upvotes": 41,
      "replies": {}
    },
    "gmhfhy7": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhfhy7/",
      "text": "I just assume I will learn things in the go or if it's too much I can just spend the night reading online. I don't think what I'm learning rn will actually contribute once I begin working. I'll just learn on the fly",
      "author": "Fuba301",
      "created": 1612721868,
      "upvotes": 2,
      "replies": {}
    },
    "gmh8y32": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmh8y32/",
      "text": "+11111\nWhat is your major though?",
      "author": "someone1411",
      "created": 1612719212,
      "upvotes": 1,
      "replies": {
        "gmk2yal": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmk2yal/",
          "text": "chem + bio. I am aiming for medschool :) this is why I believe retention of knowledge is just as important as grades >.<",
          "author": "happycatto",
          "created": 1612766375,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gmg390t": {
      "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmg390t/",
      "text": "The “shift in mindset” really resonates with me. That happened to me too during my first year of college (I’m in my second year, second semester of college). High school was more fun than college in my opinion. I don’t know if that has to do with us doing college during the pandemic or the times we’re living in or if that’s just something that also happens to a lot of other people transitioning from high school to college.\n\nWhat I feel is just tiredness. I can get all the sleep in the world and still be tired, unmotivated to do schoolwork. In the beginning of a semester, everything I learn goes in my head and out by the end. It just feels like I’m using my head to store all this information and then prove its worth on exams. I totally get you.\n\nAnd there wasn’t just a shift in my academic mindset. There was also a shift in just my general mindset. I became really depressed after leaving high school and starting college. This may be really common though. I don’t know. As for getting over this, I just disciplined myself. Force yourself to get assignments done. You’re tired? Grab a Red Bull. You’re unmotivated? Think of why you’re doing this. Try and trick yourself into liking doing schoolwork. You have try a bunch of different approaches to this and see what works for you.",
      "author": "Kkranker352",
      "created": 1612710235,
      "upvotes": 225,
      "replies": {
        "gmhv1ns": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhv1ns/",
          "text": "Huh, funny, I have the complete opposite mindset. Did you go to a private high school by any chance?\n\nI went to a public high school and the education I received was pretty abysmal. I was also suffering from mental illness, and I was just genuinely uninterested in everything going on around me besides art class. Somehow I made it into college and I'm literally thriving, I love college both in-person and online, I'm learning so much more than I ever did in high school, I can make my own schedule, work when I want to, make actual friends, have a choice in what extracurriculars I am in, etc.",
          "author": "TheColorOfYou",
          "created": 1612727212,
          "upvotes": 37,
          "replies": {
            "gmi1xa4": {
              "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmi1xa4/",
              "text": "The new found independence with schooling is really the dividing factor between students liking and hating college right now. Personally I'd like the situation. I can do my classes on my own time, no need to travel and walk. It's like finals week but the whole semester.\n\nTo many that's hell on earth and it can lead to the burnout and sadness. I've found I had to still reach out and initiate contact with others, and I'm still more sad than normal, but I found a good way to make a schedule and stick with it",
              "author": "Flacvest",
              "created": 1612729692,
              "upvotes": 15,
              "replies": {}
            }
          }
        },
        "gmhuhfk": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmhuhfk/",
          "text": "One often underestimated strategy for improving both mood and motivation is maintaining good physical health. As someone who struggles with clinical depression, it doesn't matter what I do (therapy, antidepressants, etc.), I feel like crap if I don't take care of my sleep, diet, and exercise. Seriously:\n\n* Sleep. Go to bed and get up at the same times every day, even on weekends. Everyone requires a different amount of sleep; eight hours is just an average (I need 10). If you struggle with insomnia, the problem could be blue light. Try to stay off electronics for at least the hour before bedtime. Blue light glasses were also a lifesaver for me.\n* Diet. Eat whole foods; nothing processed; no sugar, salt, or preservatives (things like vitamin C are an obvious exception). This can be difficult as a college student, but the difference between the standard American diet and actual food is just incredible. Check out some testimonials on whole foods subreddits. Don't confuse whole foods with vegan, though. Personally, I am my best on a high-protein diet, including animal products.\n* Exercise. As cliché as it sounds, you must find a physical activity that you enjoy; otherwise, you'll constantly dread it (and what college student needs something else to dread?). I enjoy walking on a treadmill while watching or listening to YouTube. Pay attention to your activity level while you're not deliberately exercising, too. Standing up and walking around for two minutes every 20 minutes works wonders for your mood. I use the Stand Up! app for this. Another app I love is StepBet, which literally pays you for meeting your custom step goals.",
          "author": null,
          "created": 1612726944,
          "upvotes": 37,
          "replies": {}
        },
        "gmjkozz": {
          "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gmjkozz/",
          "text": "Yes! I'm not too used to the semester system and it honestly feels weird that I can just forget everything I've learnt during sem break and start anew, which is what really bothered me. As for assignments, I forced myself to get them done but I feel like I'm not using my full potential. I used to find things like projects so fun in school and try to put my all into them. I do try my best now, but there's less motivation and more \"get it done before the deadline\" I'm glad to know some of us also felt a sort of \"depression\" upon entering college. I'll try to motivate myself a bit more.",
          "author": "happycatto",
          "created": 1612754241,
          "upvotes": 4,
          "replies": {
            "gnckb3d": {
              "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gnckb3d/",
              "text": "I'm struggling with college right now. I'm in my second year and semester. I thought I would talk about it if anybody relates.\n\n**Struggle #1** is I'm not certain what major would make me happy. I love video games but I don't feel capable to make them, so I chose CS major.\n\nSince I'm not certain about my CS major, I finally asked my advisor for help about it. I will take this survey called MyPlan that will generate a list of jobs I could be interested in for me to discuss with my advisor. Then I could choose a major!\n\n&#x200B;\n\n**Struggle #2** is I'm not good at time management. In high school I had classes from 7am - 2pm. As long as I did homework and studied in the afternoon, I was okay. I would often cram studying and procrastinate on projects but do okay, if not feel scared for the day before the test/due date.\n\nIn college my classes aren't in a row, more book readings, I must do adult stuff sometimes like FAFSA and grocery shopping, doctor visits, homework can be bigger, I need to really study, etc.\n\nIt's hard for me to plan my time to finish everything. I'm getting better, though. It helps me to make a realistic list of goals for the day. I can learn time management/study tips by asking my advisor and tutors.  There's a lot of nice people in the college who want to help.\n\nCollege gets tiring if I have to catch up on homework on the weekend or end up with little time in the day for relaxing. Some days I feel depressed and wake up late, so there is less time in the day. My concentration can go down, so I'll take breaks by listening to music or walking outside, to regain concentration.\n\nIt can help to take short breaks every 25 minutes (Pomodoro timer app) & give little rewards after finishing goals, and a big reward once you're done with school.\n\nI'm thankful I can stay with my parents & siblings because my college is nearby, so they help by buying food, cooking, utility bills, being there for me, and having a house to stay in.\n\n&#x200B;\n\n**Struggle #3** is making friends. I miss my good high school friends and familiar people. In college everybody's new and I don't know them. There's nice people, but it seems I haven't connected strongly to a friends maybe because of my social anxiety.\n\nI learned for anxiety, staying in a situation that makes you anxious can help you overcome your anxiety. It's like saying \"Hi Anxiety, I'm not gonna listen to you. I'm going to say Hi to that person even if I feel scared.\"\n\nIf you're anxious you can't write that essay and you're avoiding it, remember all the essays you've written before and that you *can* do it, you've done it before, and you'll do great! Plus the tutors/teacher are there to help you.\n\nOur school had board game nights where we play fun games and I was nervous, but I went there and felt safer/calmer around strangers after a bit. If I keep going there, it's like practicing where hopefully my social anxiety goes down over time.\n\nThere's some super nice people at the school. I love the librarians and tutors, and nice classmates.\n\n&#x200B;\n\n**Final thoughts:**\n\nCollege feels really hard. I wish it was a little easier! I wasn't sure if struggling a lot is common, but I can see I'm not alone. We can get through this together!\n\nI'm sure college will get easier for you as you gain experience. When you need help, don't be afraid to reach out to your school advisor, tutor, school counselor, etc. They really love to help. :)\n\nI like to stop by the tutoring center just to do homework and ask for help if needed, because we can just go there to do homework. I hope some of the random tips I said can help, and don't feel overwhelmed by trying too many tips at once. You can just try one tip at a time and see if it helps you or not.",
              "author": "FixProgrammatically8",
              "created": 1613276041,
              "upvotes": 2,
              "replies": {
                "gnhz2bw": {
                  "link": "/r/college/comments/lenfl9/do_you_also_feel_like_youre_learning_nothing_or/gnhz2bw/",
                  "text": "thank you for sharing !! i very relate to 2 and 3 but i’m glad you’ve also provided tips to help those struggling to overcome them.",
                  "author": "happycatto",
                  "created": 1613360690,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634054808
}