{"sid": "pvmch9", "link": "/r/college/comments/pvmch9/homework_on_weekends_and_burnout/", "title:": "Homework on weekends and burnout", "text": "I do school work every day of the week, on weekends at least 6 hrs a day. I create small breaks to relax but for the most part I’m always working on something. I hate when assignments pile up so I starting on projects early and use my weekends. I’m just afraid that I could develop burnout because I’ve been told to enjoy my weekends but having multiple big projects due at the same time in the next few weeks scares me so I start on them early, I’d rather do that than wait for it to get overwhelming. Also the way my classes are structured, I have to work on them a little bit every day otherwise I get behind fast. \nWill treating every day like a work day actually be unsustainable if I’m balancing my days?\nYeah some days I wish I could not do school but at the same time life is quite boring without school (don’t have a ton of friends) so in some ways having stuff to do is easier. Most days I am in a good mood especially if I’m productive with my classes.", "author": "QuickEquivalent0", "created": 1632628735, "retrieved": 1632800264, "over_18": false, "upvotes": 9, "upvote_ratio": 0.92, "comments": {"hef4yq1": {"link": "/r/college/comments/pvmch9/homework_on_weekends_and_burnout/hef4yq1/", "text": "Honestly, it really depends. For me, doing what you did works best for me. When you get ahead, you give yourself more flexibility in terms of taking a break if needed. When you only look at one week at a time you end up with insane weeks where you can't take a break even if you wanted to. Imo the former is better.  The semester tends to get busier as the semester goes on so the more cushion you can give yourself the better. Usually by the time I would be burned out the semester ends.", "author": "Maleficent_Unit_7928", "created": 1632705795, "upvotes": 2}, "hees0ca": {"link": "/r/college/comments/pvmch9/homework_on_weekends_and_burnout/hees0ca/", "text": "For me personally I always made sure I had Saturdays off and have my myself a mental health day no matter the amount of work I had. I thinks it’s really healthy to allow yourself a break or your gonna burn out real\nQuick", "author": "Sparkelz13", "created": 1632699606, "upvotes": 2}, "hecpgtz": {"link": "/r/college/comments/pvmch9/homework_on_weekends_and_burnout/hecpgtz/", "text": "I honestly do the same. I do work everyday, and I have breaks. But definitely squeeze some time in to like take a walk or do something fun.", "author": "Rite1234", "created": 1632668081, "upvotes": 2}}}