{
  "sid": "q7tm7f",
  "link": "/r/college/comments/q7tm7f/halfway_through_semester_assembly_professor_has/",
  "title:": "Halfway through semester, assembly professor has only posted two assignments all semester, zero programming",
  "text": "I've talked to others who've taken any of his classes, it's the same:\n\nProfessor releases 1-2 assignments for the first 8-12 weeks of the semester, then goes dark. Last 4 weeks he dumps like 90% of the material all at once and you're expected to complete it. His ratemyprofessor profile says the same, as well as every single person I've talked to who's taken his classes. They've all either had Ws, EWs, or low grades beause of this.\n\nSo far we have done ZERO assembly programming. We bought stuff for the class and we're not even using it yet. I'm getting worried so I've started teaching myself assembly because I don't want to fail this class. Professor doesn't reply to emails that much anymore either. He says he's sick right now, but he wasn't sick before in the previous semsters, and still had the same behavior.\n\nAs soon as I heard this, I decided I was going to put in a complaint/grievence to the Dean/District Counsel if he pulls the same shit again this semester. I think I might have a chance with the dispute because looking at his patterns (2-3+ semesters), this is no way to teach a class.\n\nIs this type of stuff the sort of thing that would be actionable against?",
  "author": "sinceThe2ndGrade",
  "created": 1634191074,
  "updated": 1634252231,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hgldz8h": {
      "link": "/r/college/comments/q7tm7f/halfway_through_semester_assembly_professor_has/hgldz8h/",
      "text": "I don't know about actionable but I would definitely let the department know. They might or might not do something this semester, though. There's a lot of behind-the-scenes stuff that makes it hard to directly do anything about it. \n\nI think that your CYA plan of working on it by yourself so that when he dumps it on you, you've been learning all along, is an incredibly good idea. I'd continue that AS WELL as letting the department know. It certainly won't hurt you, whatever the resolution.",
      "author": "jessamina",
      "created": 1634205802,
      "upvotes": 2,
      "replies": {}
    }
  }
}