{
  "sid": "qffkzm",
  "link": "/r/college/comments/qffkzm/i_feel_completely_stuck/",
  "title:": "I feel completely stuck",
  "text": "I am a current sophomore in comp sci and came out of freshman year with just above a 3.0. I thought I wanted to code throughout all of high school and I did decent in my first two intro courses freshman year (both B’s). Right now im taking a data structures course on top of calc 2 and a weird ass matrices math class. I basically stopped doing work in data structures a month in because I felt like I didn’t bring much with me from my intro courses, like I almost just BS-ed the whole freshman year. I’m currently failing that class and it’s a big pre req to a lot of the higher level cs courses. Not doing hot in my other courses either. I want to succeed as I was a majority A+ student up until college, yet I find myself continuously losing passion and motivation. I’m not sure if I should switch majors or stick it out and maybe go for a grade replacement for data structures next semester. \n\nMy sleep schedule is completely off now and I’m starting to miss more and more classes and skipping assignments, just pondering in bed, scared to attempt the pile of past assignments waiting for me.\n\nI don’t know if im depressed or not I just feel void towards like everything right now. Don’t even play my favorite video games anymore. Stopped going to club meetings too that I was involved in. I just find myself procrastinating in anyway I can to escape college.\n\nOn top of everything my senior year of hs and freshman year of college were affected by covid and I barely made any friends. It’s gotten to the point where I drive 3 hours home and 3 hours back almost every weekend to visit my one good buddy where I feel happy.\n\nI just feel like I’m wasting my life bro",
  "author": "Monamacc",
  "created": 1635164778,
  "updated": 1635184135,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.83,
  "comments": {
    "hhz9qbx": {
      "link": "/r/college/comments/qffkzm/i_feel_completely_stuck/hhz9qbx/",
      "text": "I dont want to come off a certain way, but if you dont attempt things, then you wont learn. Beimg afraid to fail robs you, because failure is your most valuable teacher. Thats not just college, but thats a theme thats going to stick with you until you die.\n\nIt seems you understand that problem but you cant get past the fear.\nSame thing goes for you driving 3 hours back and forth because making new friends where you are is just too uncomfortable. Thats fear and apprehension.\n\nLet me ask you. Whats the worst that could happen? Seriously? If you attempt the courses but dont get that ideal A or B, so what? Of you engage with new people and it doesnt click, so what? You're young and scared and inexperienced with challenging situatioms, but if you dont get up and dust yourself off now, you'll be old, scared and inexperienced, and thats a road you dont want to go down.\n\nAnd if you literally are physically unable to just try because the fear and anxiety are crushing, then talk to a school counselor about on campus therapists and guidance.\n\nTrust me, you are not alone and if you start the ball rolling this week you can progress forward. If you fail your classes, just retake them again. Take your time and hurdle over that fear. You can do this.\n\nYou can come back from anything.",
      "author": "_OneirO_",
      "created": 1635166091,
      "upvotes": 2,
      "replies": {}
    },
    "hhzivn1": {
      "link": "/r/college/comments/qffkzm/i_feel_completely_stuck/hhzivn1/",
      "text": "imma keep this nice and simple so you can actually read my post. In the situation, I would choose from 2 simple choices..\n\n1. take the L for this semester, withdraw from the failing class and simply try again next semester. school isn't going anywhere remember that.\n\n2. do you really wanna take this class again next semester? you doing this is postponing your graduation date. you dont wanna be 30 in college man you gotta do something about it. At least get a C, grab some motivation and finish the semester is ALMOST over.",
      "author": "TrueVibez14",
      "created": 1635170664,
      "upvotes": 1,
      "replies": {}
    },
    "hhzjhtg": {
      "link": "/r/college/comments/qffkzm/i_feel_completely_stuck/hhzjhtg/",
      "text": "You're definitely struggling with mental health currently, and it sounds like you recognize that. I would definitely start with your school's counseling services. Depression is no joke. \n\nMissing class is 100% the way to failing out. I've been there, done that 3 times. I stepped away for 5 years, and came back on my own terms when I was ready. I'm working hard and am at the top of my class. \n\nThe issues you are dealing with are not related to your choice of major. Watching my friends, and my personal experience, has showed me that CS often just doesn't click for some people until much later, and it's such a blow to the ego for previously great students. There will be things your classmates make look or sound easy to do, and then you sit there and just stare at it blankly.\n\nAs for your current workload, Calc2 is one of the hard math classes you'll take. Linear Algebra (your weird matrices course) shouldn't be too difficult. 100% make sure you're at least trying the homework, as it's mostly technique and making sure you catch all of your mistakes. \n\nFor your Data Structures course, you likely need the fundamentals from your first two courses. The one thing I know that always helped me clearly implement algorithms and such is writing it out plainly in comments in the code so that each line of code is preceded by a comment that explains that step of the algorithm. If you find that a step wants you to do two things, that's at least two lines of code then.\n\nYour professors already know you're struggling, and you're not the only one nor the first. Talk with them, get their feedback and suggestions. Go to the tutoring center. Ask people in your courses for help. There are so many great YouTube videos on these topics, as well as numerous books and articles. \n\nDefinitely talk with your advisor, and your parents. If you're that far behind this semester, consider a leave of absence possibly until next semester. \n\nUltimately, you have to be in a good state of mind to succeed at school. Crushing failure happens to so many straight A highschool kids, it's kind of funny. You're learning a new way of thinking, in a new social environment, probably the first taste of independence, and your daily life is far less structured by outside factors. Discipline is built now. \n\nOh, and if you can, get a laptop that's strictly for school. Go to the library or a lounge or outside and work. Get out of your room.",
      "author": "BKrenz",
      "created": 1635170950,
      "upvotes": 1,
      "replies": {}
    },
    "hhzqdgg": {
      "link": "/r/college/comments/qffkzm/i_feel_completely_stuck/hhzqdgg/",
      "text": "Consider changing your major. While comp sci is great, engineering is a difficult field and I image that has been more challenging without access to in-person study groups and other activities to maintain balance in your day.",
      "author": "DisruptIt",
      "created": 1635174018,
      "upvotes": 1,
      "replies": {}
    },
    "hhzsrco": {
      "link": "/r/college/comments/qffkzm/i_feel_completely_stuck/hhzsrco/",
      "text": "My two cents:\n\nOne thing I learned was don't do past assignments if you don't have free time and you are motivated. Just concentrate on the current ones.\n\nJust do the ones that are fresh.\nIt might be harder after falling behind to understand them, but doing them yourself is the only thing that is going to get you back on track.\n\nGet a grip on your sleep schedule, fixed wakeup bed time.\n\nDo breaks, 45-15 minutes when studying solving exercises or something like that.\n\nDon't look at EVERYTHING you have to do, look at the next task, the next course, the next hour, what can you do rn which is A step in the right direction.\n\nIf you don't get something, take a break look at the script, read it, look at the slides/recording whatever, and try again THE NEXT day.\n\nDo exercises as soon as possible.\n\nSTEM is hard work, all of it. Everyone struggles.\nDon't give up. Failing isn't a shame, but giving up is, and once you have failed you can say \"I tried I'm gonna try something else\" or smash your head against it again. Your choice. Just don't give up, try your best.",
      "author": "GardenChickenPen",
      "created": 1635175054,
      "upvotes": 1,
      "replies": {}
    },
    "hhzupsc": {
      "link": "/r/college/comments/qffkzm/i_feel_completely_stuck/hhzupsc/",
      "text": "I worked as a software engineer for decades without a degree and when I went to pick up a degree the math was completely unfamiliar.\n\nFor every minute I spent coding I spent an hour learning math.\n\nWhat kind of coding do you want to do? There are lots of options that do not require a degree or any of that math. I wrote software for airports, ignition interlock systems, heavy equipment rental, processing plants, museum scheduling and inventory, etc… wayyyy before I had ever heard of Big O.",
      "author": "other-account-banned",
      "created": 1635175889,
      "upvotes": 1,
      "replies": {}
    }
  }
}