{
  "sid": "qmaa19",
  "link": "/r/college/comments/qmaa19/majoring_in_biophysics_premed_but_not_good_at_the/",
  "title:": "Majoring in Biophysics (Pre-med) but not good at the actual physics part and I dont know what to change it to?",
  "text": "In terms of majoring:\n\nI hate chemistry (I think its boring)\n\nI hate psychology/sociology.\n\nNueroscience is a nope\n\nI can deal with Bio\n\nI do love math though and today it just hit me and for a minute I considered changing my major to Math on the premed track. But Im not sure. Biophysics has all the courses I need, but I feel the actual physics part is impossible to do. Biophysics is basically all math and physics is math, but with long words. Like once I get to classes like Modern Physics, Quantez Mechanics, and Theoretical Physics I cant imagine how it cant be game over. That sounds hard af and my experience in AP C Mechanics in high school was aweful. Failed every test but it was curved so hard I got a B. I really really enjoy math and would continue on my current major if I didnt feel so defeated by the idea of physics? How hard is Biophysics really.",
  "author": "Marsrule",
  "created": 1635991502,
  "updated": 1636137458,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj8j10b": {
      "link": "/r/college/comments/qmaa19/majoring_in_biophysics_premed_but_not_good_at_the/hj8j10b/",
      "text": "Pre-med track and med school itself will have a LOT of chemistry. Just saying. Maybe it’s not the best choice of career track?",
      "author": "boilerlashes",
      "created": 1635994230,
      "upvotes": 7,
      "replies": {
        "hj8jrtc": {
          "link": "/r/college/comments/qmaa19/majoring_in_biophysics_premed_but_not_good_at_the/hj8jrtc/",
          "text": "no its the right path 100 percent. I wrote in terms of major: its not something Im passionately into. I ultimatly want to be an Interventional Radiologist so someone who deals with physics and math alot. I dont think pre-med has a lot of chem. Only 4 semesters and its not like im dreading by chem now, just not a subject I can see myself do ECs with.",
          "author": "Marsrule",
          "created": 1635994603,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}