{"sid": "hokanq", "link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/", "title:": "If you HATE online classes, what at least can make them better?", "text": "Prof here, sorry to barge in. But I need your thoughts.\n\nI've taught plenty of online classes in the past, but only to students who willingly chose the online option. This fall my campus will be fully online so I will be having students who don't like or don't want online classes, but they are stuck. \n\nSo, knowing that I'll have students who don't want to be online, as their instructor, what things could I do to make it better? Things to do? Things to avoid?\n\nI especially want to hear from the haters. Fire away.\n\nThanks much.\n\nEdit: much appreciation for all the comments so far. I'm reading them all, I promise! Keep them coming, even if your comments are redundant with someone else, it's useful for me to see what gets repeated and isn't just a random one-off.", "author": "Violet_Plum_Tea", "created": 1594364290, "retrieved": 1632947256, "over_18": false, "upvotes": 1274, "upvote_ratio": 1.0, "comments": {"gf1zxco": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/gf1zxco/", "text": "A cyberattack would help lol", "author": "i_love_nostalgia", "created": 1607437632, "upvotes": 1}, "g2bwyi5": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/g2bwyi5/", "text": "just want you aware that my professor linked us to this post for a class discussion\n\nyou're now reference material", "author": "spaztasticnerd", "created": 1598021902, "upvotes": 1}, "fxyic1x": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxyic1x/", "text": "I ussually Study for classes before starting them so learning on my own is something I’m used to. I don’t know what class you’re teaching but most lower division stuff like cell & molecular biology, calculus based physics, calculus 1-3, linear algebra, differential equations, organic/general chemistry etc you are not the primary source. I have yet to find a math teacher as good as professor Leonard or a chem teacher as good as chad prep (both YouTube personalities) why should people watch your first try lectures when these amazing personalities exist already? instead I would most want a professor who clearly outlined the learning expectations with homework that comes close to exam material with the online professor there to answer hw questions. If the online professor was going to lecture then working problems with the class to me is infinitely more valuable than having something explained half as good in twice the amount of time than my favorite online personalities.", "author": "Pennybagz90", "created": 1594667355, "upvotes": 1}, "fxy0e26": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxy0e26/", "text": "Don’t make it so that it will be up to me to decide between your lectures and Khan academy. Your lectures need to be designed for me and my class, and if there is even a shred of belief I can learn the material better for free online I will and you’ve failed.", "author": "hugobarros", "created": 1594658803, "upvotes": 0}, "fxp8z2l": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxp8z2l/", "text": "Professor here - What many have mentioned here about not having video on is true, internet can be fickle.  I learned that you can add avatars to Blackboard collaborate and other stuff.  So, if you want to do an introduction discussion board - and they don't want to take a picture they can use Bitmoji or any of a million other ones to make an avatar for you to see while looking at video class.   It made my Ultra training class so much better this summer.\n\nOn the doing lectures front - I use Screencast-o-matic and usually have my face in the corner while I am showing them around in Blackboard or other items on the internet they need for the project I am having them do.  In BB Ultra you have to use Youtube for the video holder.  We have mandate to have closed captioning on our videos.  - So after you upload to youtube- come back about an hour later - depending on the length of your video - and you can edit the AUTOMATIC captions - instead of typing the whole thing out. \n\nDo not be afraid to leave in the \"ums\". I say \"so\" a LOT.  And re-record to make it more clear.  I have a degree in Television and have edited all my life and Screencast-o-matic has some very useful editing choices. Don't be afraid to click around.  I put on a new front and back of a video from spring lock down work to this summers hybrid class.\n\nWe are not allowed to use Zoom at our college - remember those porn bombers \\*yup they hit us. So we use blackboard collaborate and Microsoft teams. \n\nThat's what I have.  I was letting others teach online classes and not pushing for it - but I had fun this spring.  Got to try lots of techy things for my class.  Slack was pretty good for Instant messaging.  But Microsoft teams worked rather well for lots else - we just got rid of Skype.\n\nGood luck. \n\nAnd thanks to all the students posting - you have given me plenty to think about.  I am glad you mentioned how horrible the proctor software is - I had not heard anything.  We have been told we are getting a license for something this fall.", "author": "Sherpatam", "created": 1594486132, "upvotes": 2}, "fxok2d6": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxok2d6/", "text": "Nothing, unfortunately", "author": "NovelOutlandishness6", "created": 1594479469, "upvotes": 0}, "fxlo226": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxlo226/", "text": "Please dont ramp up the homework load because theres \"no classwork\" done in class. Give as much as what would be expected pre rona With the current situation a lot of us will also be working to support ourselves and adding more onto of lectures and hw will be a pretty shitty thing to do to students rn. That or have a bunch of assignments but a loose due date because then people can schedule for a few days to get everything done on those few days instead of being forced to cramp right before the due date because of work and life.", "author": "boo_dumb_asian", "created": 1594438683, "upvotes": 1}, "fxlgzhg": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxlgzhg/", "text": "I think this depends on the class, but I love when professors write as they go with clear notes that I can look back on and actually study from. I like when professors use class time efficiently. I have had professors that don’t make class worth going to because what they talk about is rarely ever on the exams. Also, please don’t do group work. Virtual group work is the WORST. Those zoom calls are so awkward.", "author": "amarin404", "created": 1594434030, "upvotes": 1}, "fxld7yr": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxld7yr/", "text": "In on-campus classes there is a lot of space for the professor to get off track while showing a slide, making it difficult to figure out to remember from the slide. Off-campus, theres a lot of space for the student to get off track while looking at a slide. Highlight key terms and what will be on tests, if you offer extra credit or bonus questions, those could be other information from the ppt that wasn’t necessarily key information. \n\nIf you’re a RECORDING a lecture to upload instead of providing the slides, the same applies, but rather than highlighting the information you can say something like, “Take a minute to pause the video and write down the information on this slide- pay attention to X.” That’d be really helpful for me. \n\nAnother thing about recording lectures- provide CLOSED CAPTIONING. Either type captions out yourself, or pay someone to do it. This is so valuable for students who are deaf or hard of hearing. Not only the disabled community can benefit from this, I know a lot of students are going to be at their family home this semester and may not have the option to listen to your lecture with sound. It’s become increasingly popular to watch videos and tv shows with captions on, atleast amongst my friends, whether we are watching a video with someone else and they’re talking, or you’re watching a movie and can’t hear the actors over yourself eating. I personally learn better when i can read and understand what someone is saying to me as they’re saying it.", "author": "SARAHSARAHPEARL", "created": 1594431666, "upvotes": 1}, "fxld0la": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxld0la/", "text": "If my professors emailed me back within 48 hours or didn’t falsely accuse me if plagiarism so often", "author": "yuzuman", "created": 1594431539, "upvotes": 1}, "fxl5pav": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxl5pav/", "text": "What would make them better is having professors that are CONSISTENT when posting lesson content and reliable when it comes to responding to emails. My biggest issue with online last semester was my Bio professor who pretty much went MIA and only posted one weeks worth of lesson content over a 3 month stretch. If he had only communicated with us more a lot of us would have struggled less with the class.", "author": "gracefulspork", "created": 1594427089, "upvotes": 2}, "fxkv4rb": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkv4rb/", "text": "if you say you’re going to post content at a certain time please post it then, i’ve had teachers in the past say they would put the homework up monday at 3pm and then it will be friday and they still had t posted anything.", "author": "madzstaff", "created": 1594420991, "upvotes": 2}, "fxkuqev": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkuqev/", "text": "I don’t hate online classes, but I do find them cumbersome. If the operating environment was more universal and intuitive it would be great. On the flip side of that, I don’t think that enough attention is paid to setting up students for success at home. I would have loved a quick primer in setting up a work/study place at home, and ideas on how to pace myself through the day/week. Also source material that doesn’t originate from the course (like khan academy etc.) is nice, particularly when I can’t grasp a concept the way the professor has it laid out.", "author": "BleachOrchid", "created": 1594420768, "upvotes": 1}, "fxksoir": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxksoir/", "text": "Try and get to know your students the same way you would in an in person class. I once had a professor who would post a “getting to know you” question once a week. It made me feel a bit more connected to my classmates and made me feel far more comfortable approaching my professor. Also get to know the demographics of your students. IME older students will learn far differently then students fresh out of high school.", "author": "upsidedownanna", "created": 1594419648, "upvotes": 2}, "fxkrvbi": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkrvbi/", "text": "Please don’t require class at a certain time sometimes my internet goes out or I’m at work during the schedule times, or I have a doctors appointment I can’t miss rather I like discussion boards that the professor interacts with", "author": "Jcisne2", "created": 1594419209, "upvotes": 0}, "fxkr3hb": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkr3hb/", "text": "don’t put so much requirements into the class especially since students have a full time load of other classes i feel like people who normally take online classes probably do part time  due to other responsibilities. like work etc. Having prerecorded lectures and cut class time shorter, most students have a 30-45 min attention span and even lower with a full load of online work", "author": "ellison12345", "created": 1594418795, "upvotes": 0}, "fxkpc6j": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkpc6j/", "text": "For office hours let students all join at once! I know profs now who make students wait in a zoom waiting room until it’s their turn. I’m fine waiting my turn to get my questions answered, but at least let me hear others questions while I’m waiting like normal office hours. There have been times where I’ve sat in a waiting room for 45 minutes to talk to a professor, and it’s just such a waste of time.", "author": "dogfanatic24", "created": 1594417864, "upvotes": 1}, "fxkp0nu": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkp0nu/", "text": "I have to do online classes from my local college. Luckily I have an actual PC and a laptop (surface) so I'll be able to do it. I wanna know how other college students who unfortunately don't have internet will be able to do it since my local library is still closed.", "author": "Zolo89", "created": 1594417696, "upvotes": 1}, "fxknrg8": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxknrg8/", "text": "I would make your quizzes/exams open book exams. I had a professor last semester who switched to this method because he knew that students would probably be cheating otherwise, and it did help with my motivation to do exams, especially since I have a hard time memorize concepts.", "author": "totallyforked", "created": 1594417039, "upvotes": 1}, "fxkn4z2": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkn4z2/", "text": "One thing I can say is just PLEASE remember just because your students are at home doesn’t mean they magically have 48hrs/day rather than 24hrs. They still have the same amount of classes as previous semesters, and they still have work not to mention probably more stress of constantly being surrounded around family during the school year. I mentioned the last part because some parents think their children are completely free, and can watch little siblings when that is not the case. Good Luck.", "author": "Impossible-Pace", "created": 1594416712, "upvotes": 1}, "fxkmivn": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkmivn/", "text": "PLEASE if possible, video record your lectures. My professor did this, and it was like being in class. It was also helpful to rewatch it if I needed to", "author": "BlackLabel6661", "created": 1594416391, "upvotes": 1}, "fxkm98q": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkm98q/", "text": "1) Custom study guides and practice quizzes, doesn’t have to be anything fancy just to get an idea of what the questions will be like.\n2) Please notify us if you made adjustments to an assignment. I will do an assignment early in the week just for adjustments to made to it. Please please please upload assignments that are finalized. \n3) Virtual lectures are useful and can be fun, but I’m really only there for what I need to know. Going off on a tangent every once in a while is fine, sharing a story here and there, etc. I’m not there for you to lecture me  to death, listen to your latest research, or hear your personal opinions. Give me what I need. \n4) Please don’t send me links to resources in an email asking a specific question. I know them and have checked them. Please just take the time to answer my question, I’m only asking you as a last resort.", "author": null, "created": 1594416254, "upvotes": 1}, "fxkleoj": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkleoj/", "text": "I'm half deaf and my Calc class, arguably my worse subject, was taught via Zoom. Prof is amazing but because not everything was written down and she kept breaking out audio wise, her class became unwatchable on Zoom and I had to rely on someone else's exam review to barely get that P.\n\nPlease, please make sure there is a visual form of everything you teach provided to students. preferrably before lecture but just writing it down as you go or having a good slide show suffices. Just make sure hearing impaired / peeps with bad internet / unfortunate time zones don't miss out! Thank you. Folks like you are the real MVPs.\n\n&#x200B;\n\nAlso maybe make class engaging like make kids answer questions so it feels more like a class then a vid..\n\n&#x200B;\n\nLastly, obvious, use a platform taht does not require a download, and one that hasn't been blocked in other countries, please do your best to do this!", "author": "StardustNyako", "created": 1594415812, "upvotes": 1}, "fxkl6ez": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkl6ez/", "text": "Honestly teach it as if youre actually in class set up the camera to face a board so they take notes and everything or use screen share function and literally draw out the letters in mspaint or another software. Do everything like its in-class and recommend to students that they lock themselves in their rooms and make themselves unavailable to family during the time. And try for them to use a desk of some sort with a chair and for them to treat their rooms like a classroom. I literally turned down college this year (was about to go back to school since class of 2018) because of my distaine of online learning since its so hard for me to learn online but just try to make it as close to an actual classroom as possible", "author": "JohmasWitness", "created": 1594415695, "upvotes": 1}, "fxkjd91": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkjd91/", "text": "I hate online classes because I get distracted really easily and I just like the physical college experience.\n\nDon't: have discussion posts be part of the grade (I hated them and never did one), make a bunch of big assignments due, make group work mandatory (one of my in person classes last semester transitioned to full online, but kept the \"final is all group work\" rule... It turned out poorly), make attendance mandatory, and finally if you can at all help it, please don't make students attend online lectures at any particular time. Part of online classes is the freedom to complete lectures and assignments whenever. \n\nDo: maybe make some kind of \"class chat\" sort of thing where everyone can type to each other and ask questions, post weekly to do lists with due dates (yes I know, professors are not there to hold our hands, but with this being a new normal, a lot of us still need to adjust. If you don't intend to post weekly due dates, don't change the syllabus once a week and announce any changes.), have some kind of weekly quiz (not worth too much) to test skills and knowledge, either make study guides for exams or have students do them for extra credit (I had a class that did this last semester), keep communication open and if you mess something up own up to it (a few years ago, I took an online class where the instructor seemed great at first. I sent her an email because she was grading something that was not listed in the syllabus at any point as being graded. I asked her about that and she ceased all communication with me), learn how to use zoom to effectively use breakout groups (but don't freak out if some kids are uncomfortable talking over it), understand that technical difficulties happen and try to be flexible (but don't get taken advantage of).", "author": "aquanonymous", "created": 1594414754, "upvotes": 1}, "fxkixa4": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkixa4/", "text": "i hate busy work, or work that i won't learn anything from. the discussion boards shouldn't be a thing, but i read that they have to be. if so please just make questions to answer and not like 400 words min. also reply to other people's posts is just stupid you don't ever discuss anything that way, it feels more like a drag then actual learning", "author": "s_lu_c", "created": 1594414522, "upvotes": 1}, "fxkix7k": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkix7k/", "text": "Organizing everything in one place, including links to assignments and lectures, due dates etc. in chronological order makes it SO much easier. I hated having to sort through my class pages on canvas just to figure out when things were due because they were so disorganized.", "author": "bonnie--clare", "created": 1594414522, "upvotes": 1}, "fxkgtqf": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkgtqf/", "text": "I HATE online classes. The only one that I've taken voluntarily, I failed. I told myself never again. This summer, I decided to take a two credit, four week course to \"warm up\" to online classes for next semester. \n\nI loved my professor. When I told him that I totally spaced on getting a Visa (student with disability disclosure) for the summer, he believed me and gave me accommodations without me having to send in a form so I could get my accommodations ASAP. He also had a strict schedule where every week looked the same (textbook questions due Mon., discussion post due Tues., discussion post synthesis due Wed., etc.). *Everything* was due at midnight, which was something I appreciated greatly because my work schedule changes weekly and I wouldn't have to rush on any deadlines. He was also very understanding about my disabilities surrounding school.", "author": "earringbacks", "created": 1594413443, "upvotes": 2}, "fxkeizb": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkeizb/", "text": "Do live lectures, but don’t make them mandatory. Some students have to work and their jobs think online classes= schedule me whenever. Instead, record the lecture and give out extra credit for those who attend. For me that motivated me too attend the lecture whenever it was possible. \nPlease do not do group or partner projects. With students’ work schedules, it makes it impossible to sync up schedules so everybody can be online at the same time. If you have to assign partner projects, assign partners so students don’t have to reach out to people they haven’t met and try to sync schedules, and make the projects things where each person can do their part at any time.\nMake all the assignments available at the beginning of the course, and all slides. It was helpful for me to have the slides that people do not like to see in class, the kind with walls of text, because I find it very difficult to take notes during a video lecture and also very hard to pay attention so I liked to be able to go back and read the material on a powerpoint.", "author": "samaliciousss", "created": 1594412279, "upvotes": 1}, "fxke7w1": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxke7w1/", "text": "It makes a big difference when profs send reminders. In normal circumstances I’m p good abt knowing when the exam is/when a papers due but I think for a lot of us being at home and being in the same space all the time makes it much harder to organize, nothing crazy but a reminder that there’s an exam and u need x,y, and z is astronomically helpful", "author": "bitch-patrol", "created": 1594412121, "upvotes": 2}, "fxkdtoi": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkdtoi/", "text": "Obviously, it depends what you teach, but this is what my History teacher is currently doing. \n\n1. Lecture slides with voice recording audio. Reading short stories/paragraphs \n- sometimes lecture includes watching a movie, documentary, or short videos.\n2. Discussions with a max of 200 words. With student reply of 75 words. \n3.  Due dates are Sunday at 11:59 PM\n- people have jobs, volunteer, take care of children. Giving them an entire week to turn everything in. \n- Not everyone has fast internet connection so giving them the ability to turn in work Whenever helps. \n 4. Extra credit opportunity at least every week. Usually we need to read extra pages or documents, but we have to incorporate them in our discussion. \n5. Allow multiple attempts on quizzes.", "author": "strawberry1997", "created": 1594411920, "upvotes": 1}, "fxkdopg": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkdopg/", "text": "One approach that my online math class I’m in right now takes that I really like is discussion boards being used to ask and answer questions and/or show methods you found helpful to understanding the current unit. That’s a lot more meaningful and natural than having students respond to an essay prompt on a forum and forcing them to respond to each others’ essays (which are mostly all just “I agree because blah blah blah.”) Like others are saying, please don’t have overly lengthy requirements for those posts.\n\nPlease be lenient with assignments and due dates. We’re in a pandemic right now and that’s already stressful for a lot of students. People are in many different situations.\n\nAvoid online proctored exams. It’s an invasion of privacy and it just teaches students to find more creative ways to cheat. The better approach would be questions that are harder to Google. Also, it’d be nice you allowed multiple attempts with different questions each time you take it.\n\nPlease don’t make Zoom classes mandatory. Especially don’t require students have their camera on. Like I said before, I don’t want the whole class seeing what my room looks like. Besides, online classes are supposed to be more flexible around peoples’ individual schedules. Who knows what time zone the student is in with all these different living situations and students shouldn’t be punished for having commitments that come up during a particular time. I also tend to like readings and prerecorded lectures better because I can pause and rewind as many times as I need to fully understand it.", "author": "Songibal", "created": 1594411852, "upvotes": 1}, "fxkdlym": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkdlym/", "text": "I agree that learning to work towards a common goal with a group of people is a very important life skill, however, online classes do not simulate the kind of cooperative effort you would see in a workplace. Online courses are not prioritised the same way by students. You are not obligated or forced to work on your classes on a certain schedule like you would be at work. I have found group projects to be incredibly stressful to arrange, discuss, and execute during much less complicated times. While I would personally recommend group projects be avoided for online learning as a general rule, there seems to be an even greater incentive to avoid them with the current pandemic going on.", "author": "DiazugmaCaesar", "created": 1594411813, "upvotes": 1}, "fxkdaf1": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkdaf1/", "text": "It's not so much the professor's fault as some classes were just not meant to be taught online. Labs are glitchy and it is hard to have the full experience when you are not in the lab. \n\nBUT\n\nboth my lab professors were never clear about instructions. Our class average was a C in a normal B average classes. (Gen Chem and Cell Bio) This was more the TAs faults but asking questions only lead to more questions. And I am not talking about questions like \"Where are my grades?\" or \"Let me ask how much our quizzes count for and waste zoom time because I am a junior in college but never learned how to read numbers\". \n\nI'm talking about \"Hey when it says analysis for our lab reports I noticed the section didn't have instructions on what we were supposed to put here. Can you explain that to me?\"\n\nAnswer: \"Sure. Look and describe data.\"\n\nMy head: \"Oh I thought we did that in the description section but I guess analysis is digging deeper and what I couldn't put in the description part of the lab report because or word count.\"\n\nContinues like this back and forth for two weeks . Turns in assignment. \n\nThree weeks later: 38% \n\nNotes made on report: Wasn't specific enough in analysis section 1/20\n\nYup", "author": "BecuzMDsaid", "created": 1594411651, "upvotes": 2}, "fxkcpa7": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkcpa7/", "text": "Actually have lessons and learning materials easily accessible instead of just “turn this in by this date”. This might be just an issue the classes I have took have had, but many classes I’ve had would just say turn a paper in by next week on a chapter of the book and provide no other resources to learn from", "author": "The-Untitled-Man", "created": 1594411355, "upvotes": 1}, "fxkcdn0": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkcdn0/", "text": "Break everything up into small lessons so that people wont have to work on something for hours at a time. This allows for greater flexibility and motivation since youre completing smaller goals quickly.", "author": "Cerenya", "created": 1594411191, "upvotes": 1}, "fxkc8ck": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkc8ck/", "text": "Don’t do a ton of assignments either. If you can group them and extend deadlines that would be best. Be understanding if they miss deadlines. Maybe instead of having a set deadline time have a deadline window. Where the assignment needs to be submitted within a certain number of days.  \n\nDefinitely offer extra credit in some way. It can be really helpful to some students who might be able to do some assignments better. Make the extra credit worth the work too.", "author": "FirstForBurgers", "created": 1594411116, "upvotes": 1}, "fxkbra9": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkbra9/", "text": "Put all the content up for them to access easily and in an organized way. Record lectures put slides up separately as well. \n\nIf you have time offer workshop time outside of class where you can help students study or understand certain concepts. \n\nOffer to stay after class for 5-10 minutes to\nAnswer questions or go over anything else they need.", "author": "FirstForBurgers", "created": 1594410879, "upvotes": 1}, "fxkair0": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxkair0/", "text": "If you’re doing a math based based course please please PLEASE find a way to do written examples. The benefit of actually seeing a problem done is crazy even if there are examples that you walk through, having it written for some reason is just huge", "author": "hiddenbuck", "created": 1594410259, "upvotes": 3}, "fxka852": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxka852/", "text": "Fellow lecturer here.\n\nI strongly believe that there are two groups of students: those that prefer online classes and those that don't.\n\nMost of the research on online education was done on the group that prefers online education. I think that having a class that is 75% similar to your in person class--especially with a synchronous lecture or component--is better than fully asynchronous.", "author": "TBDobbs", "created": 1594410110, "upvotes": 2}, "fxk98we": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxk98we/", "text": "hey!! thanks for asking this, I have had a few professors who taught me in distance learning that just didn't care at all, so having someone at least care about how to make it better gives me hope. \n\nthe best thing you can do is offer lots of opportunities for your students to have something at least semi similar to office hours. my calc 2 TA offers schedule-able office hours and that way if no one requests time, he doesn't have to hold them, and when you do request time, you get the instructor to yourself to ask as many questions as you want. it really improved my grades and engagement with the course. \n\nto avoid? I'd say if your class is 400 people like one of mine was, please please PLEASE do not hold a massive zoom lecture unless you are a Zoom Expert. it was super painful to log on and have my professor not automatically mute people, and just have loud noises as people joined. it was just insanely chaotic and the first 20 minutes of lecture where people where still showing up were basally intolerable. plus, the whole thing just felt infinitely impersonal. \n\ngood luck with distance teaching!!", "author": "sadness-noise", "created": 1594409625, "upvotes": 2}, "fxk58gd": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxk58gd/", "text": "They are fine imo. I graduated in May, but it was fine because all of my professors were tech savvy or quickly gained proficiency. I know a lot of students claim to want asynchronous, BUT the complaints they have tell me they definitely won’t bead it from it. Have classes meet at set times. Seeing your prof in real time creates a good connection and an opportunity to ask questions and engage which is BY FAR the most impactful think about in person classes in my opinion.", "author": "3classes2go", "created": 1594407623, "upvotes": 1}, "fxk50am": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxk50am/", "text": "Please PLEASE have some sort of office hours, I’m taking online summer courses currently and I don’t get my questions answered because they’re often open-ended, and my teachers didn’t give me anything but an email.\n\nAlso posting slides would be great. I’m taking 3 online classes and none of them have slides or something that condenses the information. It’s especially difficult in my science class having to dissect a long winded textbook to pull the relevant information.\n\nI hope this helps!", "author": "flowerfairy-1", "created": 1594407516, "upvotes": 1}, "fxk4y41": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxk4y41/", "text": "I hate online classes because I feel like I’m not learning anything I’m just memorizing for the test, I’d say check in with students individually if possible, if you have a large class it may not be an option. \nMake things super clear, especially guidelines of what you want when. I had a prof who gave us harsh deadlines but stuff wasn’t always clear and it was just so frustrating. \n\nAnother Thing is deadlines, during the shut down last semester I had a whole deadline just float past me and I had no idea. I apologized profusely and begged for an extension because things got so hectic the last week of classes, so I guess it’s really up to you about if the student has slacked or been up to date on everything but just leniency where you see fit on assignments. \n\nI wish you the best!", "author": "Azh_950", "created": 1594407488, "upvotes": 2}, "fxk4f7s": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxk4f7s/", "text": "Undergrad here who absolutely hates online classes, but mostly because my professors haven't been doing it right (at least to my standards). If you're not already, definitely do live lectures through Zoom or some other video conferencing platform. I absolutely HATE that the majority of my professors just prerecord their lectures and post them to YouTube for us to watch on our own time. Nothing is productive when lectures aren't interactive. It's a huge pain to be watching a prerecorded lecture and then not be able to ask a question right away if I get confused. I also really have no motivation to watch the lectures when they are not live. I need a routine in my life, especially during these trying times. Definitely record the live lectures and post them so that dedicated students can go back and catch small things they may have missed.\n\nAlso, be willing to have live office hours through Zoom. Going back to how annoying it is to not be able to ask a question right away when lectures are prerecorded, it is also an extreme burden to have to compose really long emails to professors in an effort to explain something you are really confused about or stuck on, only to receive a vague reply that doesn't help at all. A lot of questions really need to be asked and addressed \"face-to-face.\" I know that many of the email questions I have taken upwards of half an hour to compose and send to my professors, who were completely unwilling to have live video office hours, could have been asked and answered satisfactorily over Zoom in just a few minutes. If it really doesn't work for you to have office hours over Zoom as often as you would in person, at least be willing to let students make appointments with you regularly.", "author": "schoolguru", "created": 1594407236, "upvotes": 2}, "fxk33wt": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxk33wt/", "text": "1. Discussion posts are the bane of a student’s existence. If you’re gonna have them, don’t have them be weekly. Also, having graded replies to other classmates is tedious for us. Most of the time i really don’t have much more too say to a classmates post.\n\n2. A really good study guide. In most of my online classes last semester i often found myself teaching the material to myself. Simply because it’s really hard to get all the information across when you’re only reading PowerPoint and textbooks. A study guide that’s really efficient in covering what’s on the test is a must. Last semester in Perception, my professor literally had a section on the study guide that just said “the eye”.  What am I supposed to do with that? The answer is struggle to study.\n\n3. Make the deadlines lenient. Remember, we are in a global pandemic with record unemployment. US students are really struggling to keep afloat. Most of us didn’t get a stimulus check even though we have to pay for college tuition. Part time workers were the first to be let go, and that’s a majority of college students. We are really going through some tough times right now. So be gentle.\n\nThat’s really all i can say, you are trying to make it easier for us. I for one really appreciate it. Just remember you can’t please everyone. No matter what you do, you will get people upset with the online class. Good luck.", "author": "Thekiraqueen", "created": 1594406604, "upvotes": 1}, "fxk1m45": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxk1m45/", "text": "When you post grades for things like discussions and assignments and anything else that isn’t an objective “you either get this answer right or you don’t”, give feedback! One of my professors this summer semester isn’t giving any feedback at all on my discussion posts, even though I’ve been getting less than a b average on them and have reached out to her to clarify why. Give better feedback than “oh the rubric is in the syllabus!”", "author": null, "created": 1594405885, "upvotes": 3}, "fxk0wiw": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxk0wiw/", "text": "While this depends on the type of class you’re teaching, I prefer when the prof puts the whole class online with loose due dates to work at your own pace. Especially with everything going on, many students will have trouble sticking to specific dates. The best online class I took was like this, but he was still very communicative and engaged with the class through zoom office hours, constant updates and clarifications, and was very responsive if there was a problem. Truth is, I hate online classes and despite that being a great course, I simply do not learn well without having a prof present to discuss with. However this is personal, so it was great to have a prof who was accessible for those discussions, but they were not required for those who don’t learn that way. You have to be flexible and understanding of learning styles and the personal lives of your students", "author": "11yearoldmichealjack", "created": 1594405544, "upvotes": 2}, "fxk0lu3": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxk0lu3/", "text": "honestly, for some students an online format will never be as accommodating as an in person class. just do your best to educate us as you would in the classroom, we see your effort and we will try our best as well.", "author": "throwRA2647", "created": 1594405401, "upvotes": 1}, "fxjzkc9": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjzkc9/", "text": "I had one professor that required we submit our notes from the lecture with our homework. It was for a Thermodynamics 2 class, and his lectures consisted of him writing out notes and explaining as he went, or using drawings to explain concepts. You could copy down his notes exactly, or adjust them to fit your need. I was awful at getting myself to watch online lectures, but this gave me incentive to watch them. Plus it helped me remember the material.", "author": "atrolen", "created": 1594404894, "upvotes": 1}, "fxjzc57": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjzc57/", "text": "Hi, avid hater of online classes here.  Went from an A student to pity Cs because of online classes and have previously dropped online classes because they just did not work.  (So it's not just the pandemic that was a problem.)\n\nSome problems that I've run across either myself or have had friends encounter:\n\n* If you're doing synchronous classes, please for the love of all that is holy, don't penalize students for not attending.  My internet went down during classes and my professor told me to just use my phone without considering that I don't have unlimited data.  I had friends who had to try to do their classes in cars from restaurant parking lots in the middle of stay-at-home orders, it obviously didn't go well.  People are having to get jobs or may have gotten sent home to the four corners of the globe and have time zone issues, but there may not have been another alternative to synchronous classes.  \n* Put up any PowerPoint lectures ahead of time so that people who want to can print them out/put them up on a tablet/etc and scribble along with them as you go.  \n* Captions are fabulous for accessibility, plus if there's a transcript of them available, it helps students who have to miss classes or can't have audio on because of their living situation.\n* If you're assigning group projects, please don't force students to sit in a breakout room on Teams/Zoom/etc to work on them during class time.  Being forced to sit there hearing group members making noise and their background noise on TOP of our own background noises is absolute hell with attention deficit issues and turns into a prolonged period of getting nothing done except getting frustrated for the required period of time when we could normally take our bits and go at our own pace separately and be fine.  (This happened to me, it turned into getting nothing done and wanting to scream because I was required to be there twice a week for almost 2 hours each time.)  If students want to use that dedicated block, great, but don't make it mandatory.\n* For the love of god, don't use those awful proctoring websites.  They're such privacy violations and they can be sources of shame for students in less than optimal conditions or be outright problems that might force students to take zeros.  Some of the services require having a desk and a chair and being able to show the area around it on camera.  Some people don't have access to any kind of area in their home that fits the bill because of living situations and may have to do their work on beds/couches/floors.  Some also can't get quiet environments where nobody will walk in and start talking to them or they'll get interrupted.  Students may be embarrassed if they have to show a proctor their surroundings.  There's also that awful feeling of being watched the whole time.\n* If you can, please be on camera somehow.  Some students need to be able to read lips and/or see facial expressions to be able to understand and retain information and that's something that may have prompted the decision to take in-person classes even when online was an option before.\n* Be extremely clear on expectations, learning objectives, timelines, etc.  Some students aren't comfortable trying to stop you in the middle of an online class and ask questions like they might raise their hands in a classroom.\n* Don't require cameras to be on.  It's fine to encourage it so that you're not talking to a bunch of blank screens, but requiring it can lead to frustration and/or embarrassment and it's a privacy issue.  (It's not like we don't trust you, but requiring us to put our cameras on would force us to open up a window into our home lives that we might not usually want professors or classmates to see.)", "author": "LadyWolfshadow", "created": 1594404783, "upvotes": 3}, "fxjz0h5": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjz0h5/", "text": "Honestly, as someone who hates online classes and even dropped one: Organize everything by week, use calendar functions if they're available. Record lecture if you can. I had a class that was just \"read, do the thing\". It was stupid, non-interactive and I hated every moment of it. The one I dropped was solely graded on tests - please for the love of everything in this universe don't do that. 😭 I don't test well, and even using my double time I still don't do great. Having graded assignments is a good push to keep up with class, and incentive to do well because it's not *just* tests.", "author": "Friendly-Exit", "created": 1594404625, "upvotes": 1}, "fxjyohn": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjyohn/", "text": "Honestly? Look at ASU online classes. Talk to professors there because they do an amazing job. The things I’ve noticed most between my actual college online classes and the ones I took at ASU is the lack of familiarization with Canvas/Blackboard at my college. Categorize the folders according to date. Put the syllabus in the syllabus tab. Any links to recurring meetings/discussions/labs put in a spreadsheet with clear indication as to what has to be accessed when. Most students (that I know of) don’t use the “pages” tab so avoid that if I you can. Again, that’s personal experience so I could be wrong. \n\nUse simple language when attempting to convey the structure of the class. For example, my professor used “peer group” and “group” to explain breakout rooms and lectures which confused the hell out of me until I showed up for the lectures I wasn’t supposed to be in and I had to email him to ask what was going on. Similarly, my other professor used “synchronous” and “non-synchronous” to describe the lecture and the discussion respectively and, because I had another class with two lecture sections instead of just one, I was confused as to what this meant. \n\nEssentially, keep it uncomplicated. \n\nProfessors are being hit as hard as the students are and as a student I wanted to say thank you for asking because we’re all figuring this out together. Thank you for the commitment to your students.", "author": null, "created": 1594404461, "upvotes": 1}, "fxjx5ul": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjx5ul/", "text": "-Don't change due dates to be earlier \n-Don't only unlock the quiz or homework one day before due date \n-be consistent with due date times \n-Have live zoom office hours super helpful especially for really detailed questions they may have also helpful for math and science classes in general", "author": "JellyfishButterfly", "created": 1594403728, "upvotes": 1}, "fxjw8sb": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjw8sb/", "text": "I like to print the powerpoints/worksheets and annotate then there! I use the app my study life to upload the syllabus /due dates/ test dates etc so I don’t forget about any assignments!\n\nEdit: sorry I shared this from a student perspective.", "author": "Realistic_Pass", "created": 1594403288, "upvotes": 1}, "fxjw80p": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjw80p/", "text": "Composition professor here. \n\nI’m enjoying the feedback, but I’m curious about notes specific to an online writing course. \n\nWriting’s really only learned through practice, so, to a certain extent, PowerPoints and lectures only go so far. But, at the same time, I’m seeing that discussion boards are problematic. Do y’all have similar issues with journal assignments?\n\nAnyway, I’m open to suggestions!", "author": "nerdhappyjq", "created": 1594403277, "upvotes": 1}, "fxjw7kt": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjw7kt/", "text": "If they were in person", "author": "logicalflow1", "created": 1594403271, "upvotes": -1}, "fxjtf70": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjtf70/", "text": "Please don’t expect students to complete nearly all class work outside of class since it’s virtual. Class should still be class-like. One of the hardest aspects of online to me was that suddenly I was expected to do class work before class for all of my classes which took up all of my time, took away from my ability to focus on homework, and made going to lecture pointless.", "author": "cumacnereceiver", "created": 1594401940, "upvotes": 3}, "fxjtcwe": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjtcwe/", "text": "My professor provided us with a super fleshed out schedule for each time we had an online meeting so we could know EXACTLY what to expect. She also, in order to make sure participation was up, let students sign up for different discussion roles (questioner, responder, note-taker). Breakout groups are also really good for these roles and it helps students get to know each other. When I had this structure I was able to learn the name of every person in class within the first week. Really helps bring in the personal experience that a class is supposed to have.", "author": "The_smartpotato", "created": 1594401910, "upvotes": 2}, "fxjrhjw": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjrhjw/", "text": "Please for the love of god DO NOT post 1.5 hour lectures every day. One of my profs breaks them up into 3 separate videos and my focus is significantly better.\n\nEdit to add: Remove Lockdown browser!! It really messes with my computer and just gives me more anxiety. I would rather have a Zoom proctored exam.", "author": "liceter", "created": 1594401010, "upvotes": 1}, "fxjrema": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjrema/", "text": "What kind of classes do you teach? Lecture, discussion, lab or activity?Also subject? English? Math? Engineering?", "author": "nickthatknack", "created": 1594400971, "upvotes": 1}, "fxjr7yg": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjr7yg/", "text": "I love when a professor has their own lecture videos that are actually interesting. \n\nI had the best Biology professor 2 semesters in a row. When we went online, he did his lectures just as he does in person-wacky and silly. It was such a great surprise to be mundanely listening to his lecture and then cut to a video of him showing up what potential energy and kinetic energy is (literally him running around like a crazy person for some of it).\n\nI also like discussion boards, but not something that is happening every single week or multiple times. There’s a time and a place where I’m actually enjoying discussing versus taking an hour to write a paragraph.", "author": "sum1inphx", "created": 1594400883, "upvotes": 1}, "fxjqgb4": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjqgb4/", "text": "Answer emails. If your school has multiple ways for students to contact you (platform inbox, email, q&a discussion board) check all of them at least daily or make it very clear which you prefer. \n\nTeam assignments should be optional. Working in teams online is difficult and an added stressor. If a student wants to work alone on a paper or project they should be to.\n\nAfter the online class post any PowerPoints or things you discussed for students to reference\n\nMake sure that your microphone works properly. Do a test run. Don't just do an initial testing-1-2-3, actualy talk for.a while the way you would in class. I had a professor who had a terrible microphone. We could hear him if he did the \"can you hear me\" question, but when lecturing it would cut in and out.\n\nMy favorite online class wasn't just someone talking for a few hours, but a professor who asked questions constantly. He had a policy that you had to participate in the discussion to get points for being there. You could expect him to call on you at least twice during class to answer a question or give an opinion on something. For peoppe who couldn't attend the live session he required them to watch the video and to make sure they watched it he would ask a question at some point aimed at those watching at a later time and they had to write up a statement answering the question. I really liked this class because it forced people to participate and it made it feel more like a  classroom environment.", "author": "RadioactiveMermaid", "created": 1594400515, "upvotes": 1}, "fxjpfza": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjpfza/", "text": "One thing I know a lot of people have frustrations with is using a bunch of different platforms for different work. Try to keep everything for your class in one, easy to access place. Also, if you can, maybe send out some type of tutorial on how to use the program of your choice.", "author": "metalhead_mommy", "created": 1594400030, "upvotes": 1}, "fxjotck": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjotck/", "text": "Do not do zoom calls. If you want to record yourself and post that it is so much easier. Not everyone has WiFi some kids have to help babysit or have to work. It's just hard to make it on time to a scheduled zoom meeting and they don't really help much either. Slides would be the best option.", "author": "catty0924", "created": 1594399731, "upvotes": 1}, "fxjo7u5": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjo7u5/", "text": "Request active participation. Call on people randomly like you would in class. Keeps them on their toes instead if reading Reddit while you're lecturing. 😁", "author": "BennytheMeep", "created": 1594399443, "upvotes": 2}, "fxjo4ng": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjo4ng/", "text": "I'm not a \"hater\", but it's obvious that online classes arise from the soulless profiteering in the higher education industry.\n\nThere is no incentive for the players in that industry to strive for real quality education.  If they were interested in quality, they would prioritize face-to-face interaction with professors. Programs offered entirely online are bullshit.  Digital technology should *enhance* education; it should not be used to eliminate the need for teachers being in the same room with learners.\n\nBut anyway, yeah, the pandemic.  If you want to do a good job teaching online classes, spend an extra hour every day to proactively reach out to students and engage them in conversation about the course content.  Plan a phone conversation (10 minutes) with every student.   By doing something like this you're counteracting the tendency for human interaction between teacher and learner to be lost in the digital age.", "author": "BeingsBeingBeings", "created": 1594399401, "upvotes": -1}, "fxjnpa4": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjnpa4/", "text": "Make your discussion board more than just a \"theory\" or hypothetical question. \n\nYou can make discussions be \"performance based\" discussions in which students have to problem solve or create and share something. \n\nNot sure of your subject, but if math based: \n\n1. Post some wrong solutions and ask the class to solve it as a group. \n\n2. Have the students teach each other. So each student gets a problem and has to explain how to solve it in their discussion. \n\nIf social sciences, bio, etc > \n\n1. Have the students use video recording software to teach a topic in the unit of study. Then post that video to the discussion board. Then classmates need to ask questions. (LOOM is free software for this)\n\n2. AMA - Kinda like Reddit AMA. A student gets a topic > then the class is broken into groups and do an AMA in small groups\n\n3. Debate a topic. \n\nBasically, if you can make the discussion something that the students can \"own\" they will be more likely to engage. \n\nThis is the same for assignments. Don't assign a bunch of papers. Do one academic paper, then do a bunch of smaller assignments that can demo their mastery of the topic. \n\nEx: \n\nCreate an info graphic that explains how, why, etc on a given topic. Students post it to a discussion board and have students peer critique. CANVA is excellent for this. \n\nOr for a review on a test > have the students create their own self graded quizzes using Google Forms. Then have the classmates each others quizzes.", "author": "drumpfFOREVER", "created": 1594399196, "upvotes": 1}, "fxjniwz": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjniwz/", "text": "Personally, I hate Zoom meetings. I never learn anything in them and always end up looking at my phone. I'd prefer an all-online self-paced style class. But I know a lot of professors won't like that.", "author": "las921", "created": 1594399110, "upvotes": 1}, "fxjn2ms": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjn2ms/", "text": "My college is 100% online. I think colleges should learn from schools that are already there. The Blackboard portal alone is huge, especially with auto graded tests. And step away from thinking you need to have actual regular classroom meetings online.\n\nWe have zero classroom meetings. All homework is due at the end of the week, Mondays at midnight, and we have lecture and presentation videos on top of our reading, tests, and message boards.", "author": "Eredhel", "created": 1594398888, "upvotes": 1}, "fxjmvci": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjmvci/", "text": "If you plan on online proctoring, please make sure that\n1) the software is compatible with most laptop devices \n2) it doesnt flag for ridiculous things like looking at the sidebar or clock or random noises \n3) Blindly and falsely accuse students of academic integrity WITHOUT having run through their proctoring videos and assessed their cases to see if they really were cheating or not and not just going off of the fact that you see a flag\n\nI understand that a lot of proctoring software is garbage and may not do all of these if any, but please try. My school had horrendous issues because of this. \n\nI also thank you and applaud you for taking the time to reach out and understand your students.", "author": "terrancethequeef", "created": 1594398791, "upvotes": 3}, "fxjmuva": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjmuva/", "text": "I will add about using online classes, don't have pearson do your entire class because I garuntee your students are cheating and now that doesn't mean you should invoke time requirements or something on your exams. Pearson pulls questions from places like quizlet, I learned this because I copied a question I didn't answer and instead of deleting the link to the deck they pulled from they just turned the font white, but you could still see the link if you tried to copy the problem.", "author": "OpticalJesu5", "created": 1594398784, "upvotes": 2}, "fxjmkxx": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjmkxx/", "text": "I’ve taken several online courses and for the good ones, I still remember the information years later. \n\nHave a clear due date that never changes. The best one for me was the class that had all work due Monday at 8am. Every Sunday I was booked doing the coursework for class. \n\nHave modules that are open for 2 weeks. Make the modules similar (quiz, homework assignment, discussion).\n\nEncourage open book tests or even collaboration on exams and quizzes. Working with a group to solve problems was so much more productive than guessing. It really forced us to go over the material in the module to agree on answers. \n\nUse online resources whenever possible to avoid expensive textbook costs. \n\nDon’t have synchronous classes. Let students do the work when they can. \n\nHave a separate discussion board where students can ask for help from each other and then give extra credit to the students that use it.", "author": "VROF", "created": 1594398649, "upvotes": 1}, "fxjmc24": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjmc24/", "text": "Please do not over complicate exams. So far the best exams I’ve had were open notes take home exams but with a substantially increased difficulty (and so questions obviously can’t be searched up on Google). The professors that did use this format said the distribution of scores is what they normally saw in their in person classes, so I think it’s a fair form of doing exams.\n\nThe worst exam I had was one of my finals last semester. It was one minute per question, you weren’t allowed to visit previous questions after answering them, MC but 7 choices per questions, A LOT of questions had weird phrasing like triple negatives, and closed book ofc.", "author": "LieutenantCurly", "created": 1594398533, "upvotes": 1}, "fxjlpta": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjlpta/", "text": "Some of my most enjoyable online classes did not include any slides, the professor actually had a white board in front of the camera and wrote in front of us as she explained and discussed the subject. She encouraged using chat to discuss and talk about each aspect of the lecture, asking each other questions, correcting each other, or adding to the subject. And she actually read the chat and gave her immediate input to what is being said. Some lectures were so engaging that even when the professor left we actually stayed for a while talking about her proposed theory and how to find a different patterns to change it.", "author": "aldha_", "created": 1594398235, "upvotes": 1}, "fxjlp7u": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjlp7u/", "text": "Honestly I'm doing \"Online\" classes I dislike them too.\nI like one on ones with my instructors if they allow it because I have questions about my assignments and probably my classmates don't care about my questions. Or I just email them about certain things.\n\nBut as someone who likes in class class. I prefer One on Ones just because I can pay attention to the instructor and what they want to tell me.\n\nZoom calls are just nerve-racking for me at least... I try not to let it bother me too much but yeah it's not easy...\n\nHopes this helps as I'm just a student 😊", "author": "MajesticSanbiru", "created": 1594398226, "upvotes": 1}, "fxjlj7i": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjlj7i/", "text": "I love my online classes because they have no fluff, are straightforward, have no time commitments. and only rely on me. Im not the person you’re looking for, but I will tell you what it is that can make them lovable. They:\n\n- Do not require to “check in” to online lectures. Aka attendance. Not saying you shouldn’t live stream, but they should be optional. We’re adults, if I want to learn/make a good grade I’ll check out your notes and lectures. I also feel like prerecorded lectures are better in general since you can pause/slow down as much as needed for my understanding. If I have a question I’ll email you, Google it, or go to YouTube University.\n\n- The class doesn’t rely on proctorU. You can still make the tests difficult, but don’t invade people’s spaces, privacy, and slow down their computers. \n\n- The professor responds to emails within 24hrs and is clearly and throughly answering my questions. Especially when it comes to answering assignments.\n\n- Not an online only thing, but a class schedule detailing everything that’s due/expected is nice for planners.\n\n- If you use a hw system, use a common one like Cengage that has a cheaper package for students instead of something like Connect that’s $165 per class. Similarly, please make all assignments open at the start of the class instead of segmented by week. Believe it or not, I have totally finished a class in my 2week trial so I could cross the class off my list AND not pay for a book. I don’t see how it hurts you to keep them open. \n\n- Do not give group projects. Do I really have to explain why this is a complicated process rn? Similarly, projects that require you to go somewhere like a museum or leave the house in general. I had a Summer class that required something like that. \n\nHope this helps.\n\nEdit: I saw a lot of people complain about busy work (quizes, Cengage assignments, discussions, etc) but those have never bothered me. I learn a lot from them and they’re what’s helped me the most on my exams. However, my classes only consisted of said “busy work,” and didn’t have papers, projects, and other stuff. If they did, the busy work would have been an annoyance.", "author": "StarFizzle", "created": 1594398146, "upvotes": 2}, "fxjl09l": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjl09l/", "text": "Also please dont do breakout rooms", "author": "tha_oz", "created": 1594397892, "upvotes": 2}, "fxjkzu7": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjkzu7/", "text": "Please, *please* if you do your lectures over skype, zoom, etc do not make your students have their video on. \n\nMaybe it’s just me, but I don’t like the idea of my professors/classmates knowing what my apartment looks like.", "author": "KingwasabiPea", "created": 1594397886, "upvotes": 2}, "fxjjvnt": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjjvnt/", "text": "I am an extremely hands on/visual learner, so online has become the worst thing imaginable. Something that’s been awful is when the teacher speeds through the solution to the problem or explanation of why because it might be seen as easy to comprehend or possibly common knowledge. PLEASE, take your time to explain things thoroughly by writing them out or using a lot of visuals. Don’t just have the problem and then the solution, I don’t understand how to get from A to Z, and I’m the kind of person who’s too shy and afraid to ask, especially in an online setting.", "author": "Bob_Ross_95", "created": 1594397336, "upvotes": 1}, "fxjjrtl": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjjrtl/", "text": "I’ve taken online classes willfully and unwillingly and I have some thoughts.\n\nI really like when professors make lecture videos. It’s almost like going to class but you can watch them whenever. I had a professor this past semester post them on days we would normally have class and it made me feel like I had a more structured class. I also really like when the professor offers and encourages students who have questions to send an email or even talk through zoom. It makes the students feel like their education isn’t being hindered because of online classes. I would try to steer away from talking through lectures slide by slide. I’ve also had professors do that and it’s pointless to not explain things while going over slides. I would also not eliminate projects and such because they’re hard to grade or something along the lines of that. I had a professor last semester who pretty much quit teaching the class and cancelled the final exam when we went online. It was a shame because I really liked that class. Make sure you’re assigning as much work as you would an in person class. Hope this helps!", "author": "bandcandy98", "created": 1594397284, "upvotes": 1}, "fxjj72c": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjj72c/", "text": "You should have scheduled office hours where you'll just be in a zoom or video chat room for a length of time. I hate scheduling office hours if I only have a short question and its nice to be able to listen to other people's questions. I know this might be a pain but I wish my professors did this!", "author": "harnort", "created": 1594396996, "upvotes": 1}, "fxjiv2f": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjiv2f/", "text": "I want the online class to be an online class. Not just the regular class migrated to Zoom.", "author": "ShawnReardon", "created": 1594396830, "upvotes": 1}, "fxjic4q": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjic4q/", "text": "Some people might not agree with me in this, but don’t make only exams count towards a grade. I had an online class that only counted tests towards a grade. No papers, no quizzes. \n\nIn addition, have us research something within the bounds of the curriculum of our choosing, and make it some sort of paper, nothing too long. Some of us aren’t good test takers and when time limits are set, it makes us nervous. Personally, I don’t like online tests but I’m pretty good at writing papers, so the two balance out. \n\nBoth test my knowledge and ability to comprehend information as well as express my takes on any given topic.", "author": "planeace222", "created": 1594396573, "upvotes": 1}, "fxjhn9u": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjhn9u/", "text": "Biggest thing for me would be don’t assign unnecessary busy work just because we should be doing something. Try to treat it as much as a normal class but online.", "author": "Buddypeterson", "created": 1594396234, "upvotes": 1}, "fxjgzfg": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjgzfg/", "text": "I think making participation mandatory is a bad thing. I hate sitting through online lectures. I took discrete math online last summer and never once watched any of the lectures. I read the textbook at my leisure and absorbed more than I do during normal classes (because reading is an active activity and listening to an hour long lecture is passive for me). Then each week there were homeworks and quizzes due on Saturday at midnight and you had the whole week to do them (quizzes had a time limit but you could begin whenever you wanted to). I also liked this self paced format because if I felt like a topic was easy I could move ahead and as a result when I found a subsequent chapter difficult I could spend a few more days on it. \n\nContrast this with last spring semester where I’d lose participation points often if I zoned out for a minute or went to the bathroom for a quick deuce.", "author": "Passname357", "created": 1594395906, "upvotes": 1}, "fxjgyof": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjgyof/", "text": "Please be flexible with deadlines if a student comes to you.\n\nI really struggled with depression during the first month of online classes and my professors let me make stuff up with little to no pentalty. It was life saving.", "author": "Level99Legend", "created": 1594395896, "upvotes": 1}, "fxjgw8z": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjgw8z/", "text": "Open note assignments, but make them things you can’t just google, conceptual things. If you make it closed, people are going to cheat, and the people who don’t are the ones that suffer", "author": "throwaway178943", "created": 1594395863, "upvotes": 1}, "fxjft42": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjft42/", "text": "I don't know if either of these things were already said. But I think most people disliked the switch to online because a lot of teachers and programs never did it so they were learning what worked on the fly. Which resulted in either the same amount or increase in out of class work with less instruction. Not to mention not many schools lowered tuition or reimbursed students when switching to online so you were paying the level of on campus support and resources with out receiving any of those resources. So in the end I think people will find your class better because you know what you are doing and how to balance out work. I'm sure you can't do anything about the tuition problem but that's up to the students. So over all just keep doing what you know works. Sorry if this was more ranty than what you were hoping for but I hope this insight helps.", "author": "GhanDiNerd", "created": 1594395327, "upvotes": 4}, "fxjfrv0": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjfrv0/", "text": "Having live classes is the single best thing I can think of. The students actually get to talk with you and other students in real time and you get as close to an in-person class as you can. Meanwhile asynchronous classes where students do everything on their own, they are so awful and destroy motivation so easily. Doesn’t matter if there are occasional check ins- the lack of talking to actual people for each classes and getting a bit of that classroom energy takes a toll on everyone.", "author": "Ms_Digglesworth", "created": 1594395310, "upvotes": 1}, "fxjfmiw": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjfmiw/", "text": "Like others have already said, don't rely on the textbook or online textbook publisher platforms as the main source of learning - after all, we're still paying tuition to learn from you. Otherwise we'd just buy the book. \n\nAlso, everyone I know, myself included, despises computer proctoring services like ProctorU. It totally feels like a massive invasion of privacy in our homes and on our devices. Furthermore, it messes with our computer settings and configuration. I've dropped online classes specifically because the syllabus said ProctorU would be used. It's a no-go. Better option is to make the exams slightly stricter on time, or better yet, ask questions that aren't directly copied from the notes or slides but make the exam open-note. Make the questions more about understanding the material rather than memorizing specific details to the extent that you can. That's generally a good practice for in-person classes too, but it inhibits student's abilities to look up the answers as easily for online classes. Some of my professors have just made their exams slightly(not much) more difficult and open-book, and the score distribution remained about the same as it was for standard in-class closed note exams. If you absolutely must use some sort of software to keep students from using the internet, use Lockdown Browser if your school pays for it. I still hate it, but it wasn't \\*quite\\* as awful as ProctorU. But even still, students can cheat by using their phones or notes that aren't on their computer. And the Lockdown Browser still sucks. \n\nMake the class Asynchronous as possible. When we aren't at school in person, we often have other obligations that come up in person. It can be easier for some than others to set aside a specific time each say to do a specific class on the internet. \n\nLastly, I know a couple others have talked about this too, but make sure due dates are clear. Blackboard isn't always very user friendly for that, so make sure to send out reminders and make some sort of schedule as to when things are due.", "author": "logs99", "created": 1594395236, "upvotes": 2}, "fxjfjin": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjfjin/", "text": "Smoking weed", "author": "jadetheplug", "created": 1594395193, "upvotes": 0}, "fxjfi7h": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjfi7h/", "text": "Hello, I hope I’m not too late to answer this. Would you consider on revaluation of what needs to be learned by students? Last spring I felt like I couldn’t leave my computer because I always had something else to do from school. The teachers continue with the regular assignments, lecture etc. I realize the workload was too much, I only took 12 credits. Is it possible to reduce the amount of material we have to learn from?", "author": "IthinkIknowthis", "created": 1594395175, "upvotes": 3}, "fxjezzd": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjezzd/", "text": "I like pp slide lectures with audio or notes in the comments. I don't like group anything. Make any non-proctered quiz/test open notes. GIVE INDIVIDUAL FEEDBACK, it can be really motivating. If having discussions make them open to anything of personal interest relevant to the weekly topic/chapter. You'll get a lot for diversity in OG posts and responses. If you want a specific response to something make it an assingment. Let people access modules ahead of time if they want. Make a STUDY GUIDE outline for proctored tests. Thank you for caring.", "author": "Thestruggleisfeels", "created": 1594394917, "upvotes": 1}, "fxjejdq": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjejdq/", "text": "Absolutely love to see professors reaching out to students like this, wanting to improve.", "author": "zPhakeSharp", "created": 1594394683, "upvotes": 1}, "fxjegog": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjegog/", "text": "Please no group projects or pure busy work.", "author": "wolfy321", "created": 1594394645, "upvotes": 5}, "fxjec3g": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjec3g/", "text": "Depends on the size of your class, but I had a professor last semester who would always say hello to students by name as they logged on to the zoom call. I really loved that.", "author": "slider501", "created": 1594394579, "upvotes": 1}, "fxjdp50": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjdp50/", "text": "This seems kinda small but it really makes a difference; please put what time zone assignments are due in. Canvas doesn’t always convert the time zone so for students working away from their college (like me) it can cause confusion when assignments are layered throughout the day. Thanks for being a good prof and trying to get feedback!", "author": "PixelPenne", "created": 1594394255, "upvotes": 3}, "fxjdkkx": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjdkkx/", "text": "Out of four of my classes last semester, I had one that transitioned seamlessly to online and I was so grateful. My professor posted two zoom lectures a week, outlined notes based on those lectures, had quizzes for each lecture (but was lenient with deadlines), had two optional zoom classes a week for questions, and two office hour periods where she was available for anyone to drop in. On top of that, she always took the time to listen to what we needed as students and adjusted her curriculum to fit what we discussed.", "author": "discodolphin1", "created": 1594394191, "upvotes": 1}, "fxjdd7n": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjdd7n/", "text": "As someone who has always detested, I will share the layout of a class I had this spring that was completely online. It was one of my favorite classes I've taken outside my major. \n\nThe class was Crime Scene Science, a chem course.\n\nIt was on a two week rotation. \n\nFirst week, you were supposed to read the chapters, and watch short clips (about 5 mins long each) that explained the premise of the chapter. They had a quiz at the end of each to check understanding. \n\nSecond week, you were supposed to watch the lectures that the professor made, he usually had some sort of quiz at the end to check your understanding, but you could retake them to get better scores. These quizzes were about 30 questions each, depending how long his lecture was and the content. There was also a final test for the chapters and an assignment. \n\nEverything was due at 11:59 PM on Sunday at the end of the two weeks. It was recommended that you do some the first week and the rest the second, but if you wanted to work ahead a little, that was fine. If things came up and you couldn't finish it until the last two days, that was okay too.\n\nHe also was really good at answering emails, and very straightforward. The routine was easy to follow and there were never any \"surprises\". I always knew what was due no matter what.", "author": "evilwoman747", "created": 1594394086, "upvotes": 1}, "fxjd4v7": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjd4v7/", "text": "I appreciate you asking! Your students are lucky to have you. A little thing that I've noticed some professors forget is to make sure your video lectures (if you are going to video lecture) or any videos in general have captions!", "author": null, "created": 1594393966, "upvotes": 1}, "fxjcw7h": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjcw7h/", "text": "Please don't randomly call on people. I find that professors do it more often online than in in-person classes since it's less intimidating but please don't do it, it just makes things worse for the student.", "author": "penguinroc940", "created": 1594393842, "upvotes": 4}, "fxjc4zy": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjc4zy/", "text": "Ik this one is a little vague, but read the room (metaphorically speaking). If your class just seems tired/not engaged on a certain day try qnd figure out why. Also keep communication (email, etc) open and if you're alright with it, be open to extensions and such. I know myself and a lot of other people tend to have issues completing assignments outside of an academic setting and extensions in March were my saving grace.", "author": "QueenOPeace", "created": 1594393454, "upvotes": 1}, "fxjbjal": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjbjal/", "text": "recommend a daily schedule for your students. maybe even recommend one that has them working on the weekends and one that doesn't. I try to not work on weekends (I set myself on a 9-5 schedule), which helps a TON.\n\nalso VIDEO LECTURES. I honestly hate when online classes only have PowerPoints and readings. I much prefer video lectures, even if that's just a recording of you clicking through the PowerPoint. that way, a student can email you and be really specific with questions - such as with my calc class, I can say \"hi professor, I just watched videos 1 for section 3.2. can you please explain how you took the derivative in the problem at 28:15?\n\nand maybe break up the lectures into shorter sections, like do 4 15 minute videos instead of a single hour long video. or, do lectures as one video, then example problems as separate videos.", "author": "lizlizliz645", "created": 1594393140, "upvotes": 1}, "fxjaxiy": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjaxiy/", "text": "Recording lectures help tremendously. if you're able to do that. And also being clear with homework instructions.", "author": "lesgo_penguin", "created": 1594392829, "upvotes": 1}, "fxjagy1": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxjagy1/", "text": "Clear, consistent communication goes a long way!", "author": "avityhall", "created": 1594392594, "upvotes": 2}, "fxja8ft": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxja8ft/", "text": "Edit: Sorry, I didn’t see you were a professor haha.\n\n\nDEAR GOD, PLEASE, DO NOT MAKE YOUR STUDENTS USE HONORLOCK. We all hate it and feel our privacy is violated.\n\nFrom a student point of view, I do a lot better in a class when I feel like a professor is interested in my spécialisation and my professional work, and is supportive in encouraging me through relevant feedback on my classwork, as well as being open to help guide me if I need it. Knowing that is invaluable.\n\nIt will be invaluable to many people - for if they hate classes and would usually not choose them, chances are, they are not in their usual uni environment. They are probably very stressed from their circumstances, and may not have the support system that they usually have around them of people who actually understand their goals and want to help them succeed.\n\nOne thing: I actually disagree with a couple of people below in the discussion boards. Requiring a discussion board of something relevant to both a student and the class material is a fantastic way - for me at least - to feel connected to the class. My two favorite prompts thus far have come from two different classes:\n1. A Western European Politics class: research and give your opinion on either the effects of Brexit on the EU, of Basque devolution, or the effects of Emmanuel Macron’s party, *En Marche!*, in France. I loved this because I actually have been doing daily research and have been very involved in one of the three, and it was such a joy to be able to speak about it in a context where it was appreciated. 450 word limit.\n\n2. The effects of culture in your personal growth essay from an artistic standpoint (for the class of Art in Globalistion). To do it well, honestly, and with a sense of professionalism and analysis was actually quite challenging - even to accelerated graduate students.  \n\nIt is kind of you to care so much about reaching out to your students - show them that, and you will reach the ones that are open to being helped now. I would guess you are an excellent professor.", "author": "al_the_time", "created": 1594392471, "upvotes": 3}, "fxj8cew": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj8cew/", "text": "to replace discussion boards, I enjoyed packback (it is a website) where the professor gave a bit of free reign to what we discussed and just said make sure it is relevant to the course work this week. They required one question and two responses each week, and packback itself scores responses based on some algorithm, so we would have to have a 60/100 curiosity score for each post for it to count. Only downside is you do have to pay for it, but i definitely liked having control over what I talked about rather than an assigned prompt. \n\nAlso, do not require face cameras on for zoom calls. Or for kids to be sitting up 100% of the time. That really annoyed me during my summer online class. \n\nfinally, make sure all slides are posted prior to class, and then record the lecture on zoom and post that as well for people to review. There was a lot of connection issues and technical difficulties in one of my classes, so some people missed the lecture sometimes and were unable to find out what was said. I would recommend not mandatory attendance, but bonus points for those who do actually come to class.", "author": "sullify223", "created": 1594391471, "upvotes": 4}, "fxj7rye": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj7rye/", "text": "Post lots of practice with answer keys if applicable so your students can better gauge where they’re at in the class without falling behind and not knowing it. Also just being generally accessible and checking in with your students, asking for constant feedback and suggestions goes a long way. I always wish my professors would do that", "author": "visual_perception", "created": 1594391168, "upvotes": 3}, "fxj7nwr": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj7nwr/", "text": "Don’t do anything synchronously. Let me watch an online lecture when I have the will power to do so. Have online office hours, a lot. Personally I really needed those in order to learn some of the stuff I’ve had to do online. If you have to do online homework don’t use software that will make it overly tedious, long, or painful. (Knewton was this way for me). Other than that there’s not much else you can do unfortunately", "author": "NJhumanbeing", "created": 1594391107, "upvotes": 8}, "fxj7f60": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj7f60/", "text": "I liked classes that incorporated some form of offline interaction. Even if it was just a couple conference calls or something.", "author": "CrownonTHErocksJ", "created": 1594390977, "upvotes": 1}, "fxj727q": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj727q/", "text": "While I am one of those students who chose to do the online format for both my entire undergraduate degree and now my graduate courses, I think I can offer insight as well. \n\nFirst, I don’t mind the discussions, esp if they’re relevant to the assigned chapters. I’ve learned a lot from the research I’ve had to do for these. What I do mind is x number of responses to peers and word count for those responses. One of my last professors didn’t require responses, but if we wrote good replies to peers those qualified us for extra credit points. That was a much better way of handling it since these discussions often are in lieu of the discussions that would occur during an in-seat program. \n\nSecond, do not assign busy work or assignments that require codes. In fact, the codes should be an absolute no-no when students pay money for the course. Likewise, avoid $800 textbooks or the requirement for the newest edition if there are several editions. \n\nThird, do not require group projects in an online  setting. Every single group project I have been a part of have been disastrous because of nonparticipating students. The project as a whole always suffers because the remaining students are required to assign and wait for nonparticipating students to contribute before completing those sections last minute. While I understand the reasoning behind group projects, they simply don’t work in an online setting (especially in accelerated programs). \n\nLast, explain assignment requirements in detail (either in the syllabus or the assignment page) \nand be prompt with your responses regarding assignment questions (I always had a few for major papers that were not covered in the syllabus). I always liked those courses that offered a draft option for major papers. A draft submission meant I could see if I was on track before submitting the final version. Constructive feedback should also be given afterwards. \n\nBest of luck!", "author": "Svenska80", "created": 1594390782, "upvotes": 1}, "fxj6xpc": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj6xpc/", "text": "Not college yet, but if my school wouldn't allow us to use zoom.\n\nThey say it's racist, so no one is allowed to use it.", "author": "BeatTheGreat", "created": 1594390713, "upvotes": 1}, "fxj6llu": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj6llu/", "text": "Grad student and I actually prefer online classes because of how well my professors do it.\n\n1. Assign readings and assignments 1-3 weeks early. It’s very stressful to manage life with the pandemic if you have under a week to view all the assignments and complete them in about 6 days. Viewing them ahead at least let’s me plan my time accordingly.\n\n2. If you do discussion boards please have it remain professional and discuss topics from the textbook. If you want to know how students are doing put that in a seperate discussion board that is not graded. \n\n3. If possible record the meat of a lecture that can be followed by PowerPoint or YouTube. I take notes with my composition book and loathed live sessions because it was difficult to keep up (sound lagging, video distortion, asking to repeat). I preferred pausing the lecture as needed to write the notes down and our professor always highlighted pieces we needed to read or concepts we needed to have a good understanding of. \n\n4. Exams. If your course offers any math please get rid of the timer or extend the timer. We had to do advanced math in one class and **show our work** by typing it out. It was such a struggle to insert an equation and type out my explanation for 50 questions in 1 hour and 15 minutes. It’s just not possible. Our professor gave the exam as many hours as as possible in a 3 day time frame. We took a survey what day works best for us and she recorded it. If there were any complications we would email her. Any questions to the material email and she would call many students to help.\n\n5. Be empathetic, understanding, and lower your expectations. I had classmates that contracted the virus or know someone that died. It’s a difficult situation in that many of us are also out of incomes too. If you’re expecting someone to work 100% for a B and over 100% for that A this semester, don’t. Scale back and also offer extra credit. \n\nThank you.", "author": "QueenLazuli", "created": 1594390529, "upvotes": 10}, "fxj5bx5": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj5bx5/", "text": "The point here is students need to learn how to adapt. Why facilitate everything so easy who say college was going to be easy. I work 40 plus hour and do 4 classes spring and fall n 3 in summer.while I enjoy lecture I'm slowly adapting to online classes live zoom is just as good of being present in class.", "author": "papichuloswag", "created": 1594389820, "upvotes": 1}, "fxj4g5b": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj4g5b/", "text": "100% accommodate for all learning types. I’ve taken two online classes so far. One had slides with a pre recorded lecture and another was a professor winging it all on paper. The first class with slides and pre recorded material was a much better experience. I can’t even focus with the professor who wings it. Know the lesson, know the knowledge you want to convey and do it well for all learning styles.", "author": "Raymx3", "created": 1594389320, "upvotes": 1}, "fxj488p": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj488p/", "text": "My one professor used something called flipgrid and we totally loved it. It was short bite sized discussions and we could reply to each other in videos, address specific points. And it was manageable while we were trying to balance our home life at the same time. It’s not realistic for me to focus as much or get as much done at home as I would on campus. This allowed for meaningful discussion without overwhelming us, and allowed us to do it asynchronous.", "author": "MrPotato2753", "created": 1594389197, "upvotes": 2}, "fxj3r3s": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj3r3s/", "text": "Clear communication of expectations and procedures throughout the course. Need students to download software? Give them a heads up before the semester begins because trying to troubleshoot during the term is a nightmare. Modifications need to be made to traditionally in person courses. You cannot do the exact same lab on simulation software as you would in a physical lab. Have virtual office hours available they are really helpful. Most importantly ask for and listen to student feedback! If the majority says something is not working for them adapt and change your teaching strategy! I had a prof this semester refuse to modify his lecture styles despite conducting numerous polls were the feedback was please modify the lecture format.", "author": "rjc1500", "created": 1594388924, "upvotes": 2}, "fxj3nzg": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj3nzg/", "text": "So many good suggestions on here, so I won’t add much. But here’s what I’ve got: \n\n-Whether or not the class is synchronous (I saw you mentioned you weren’t sure about live calls), keep a schedule and stick to it. Post content at the same time(s) each week and have homework due at the same times. And follow through with it. The only thing that keeps me motivated/sane during online classes is setting something of a schedule for myself, which is impossible to do if the class doesn’t have a regular schedule. Maybe this is obvious, but I had a prof last semester who never posted content when she said she would and it got so stressful. \n\n-respond to your emails! Or hold virtual office hours! Anything like that. Again, might seem obvious, but the same prof last year was terrible at responding to emails. Without in-person meetings, if you’re lost on something, there’s no hope. \n\n-Have some way for students to interact (but maybe not group projects). Create a class group chat or something and encourage informal discussion. It would have been so nice to have peers to reach out to bounce ideas off of, ask questions, or just talk. \n\n\nThanks for the effort you’re putting into this! We all need professors like you.", "author": "rbetters", "created": 1594388876, "upvotes": 1}, "fxj3mr9": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj3mr9/", "text": "As a teacher, you are able to use tools like discussion boards or extra assignments if you wish, but just please remember that many students are now working fulltime in order to keep up with college payments and such. \n\nThis last semester, I found myself completely burnt out, because on top of the already assigned final projects, papers, etc... there were extra weekly discussions, new assignments, and entire new classes that now needed to be included online (music ensembles, phy ed classes, etc.) that required papers and discussions. \n\nI had one professor that I genuinely looked forward to each week, as they always took time to ask about what was going on in our personal lives, and gave us room to discuss the news and our personal victories. It was nice to hear about things that didn't revolve around COVID-19 or homework. I don't know what your class sizes look like, but my prof required at least one personal meeting with them to check in, and to see if the student needed any assistance or even just a half hour to vent about what could be frustrating them. I enjoyed my meetings, as it was just a time to talk, and I was able to ask my teacher how they were doing, and what I could do as a student to help them :)\n\nEven just you making this post shows that you care, and I applaud you for that. I may not know you personally, but you show that you care about all of your students with your action, and that is so critical in the situation we are facing. However you choose to go about it, I hope this semester goes well for you!", "author": "peachesandpiano", "created": 1594388857, "upvotes": 7}, "fxj3ixi": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj3ixi/", "text": "I just want to clarify that I love my online classes. That being said, I avoid signing up for online classes with professors that do the following don’ts:\n\nDON’T require students to get their participate grade based off of them attending the zooms or online class. You can’t really measure participation that way, which is why it’s an online class. Students shouldn’t be punished for completing their work on time, in their own time, by managing themselves. That being said, instead you can have assignments due weekly or at the end of the week, or some kind of deadline known ahead of time.\n\nDON’T force your students to attend zoom classes as a requirement. It’s similar to the first one, but different in that professors tell you you *must* attend the classes. Once again I feel like online classes give students an opportunity to manage their own time and do the work they’re required to do in their own time, and that that’s okay. Sometimes by forcing students to attend zoom classes they get more irritated with the workload and start slacking. I know I do lol. \n\nDON’T assume the worst of your students just because it’s an online class. I have a friend who because of covid-19 have a professor who accuses everyone in the class of cheating. As a result, she gave extra work such as essays or make assignments and tests so much harder and stressful than things already are. I feel like one of the best ways you can get your students to respect you, enjoy your class, and enjoy the material is to trust them. Students react different to classes based a lot on the way a professor handles things. I see that in my own classes too when it comes to the behaviors and attitudes that students have. \n\nDON’T not check your emails or be irresponsive. It’s an online class, things happen, and communication is key to making it work. That being said, having deadlines known ahead of him is important. Stress the deadlines! \n\n\nOkay, that’s all I can come up with from the top of my head. The key points listed above are just the main ones that bother me, coming from experience(I wasn’t trying to be nick picky). That being said, thank you for asking! You seem like a really cool professor who cares about his/her students, and your quality of teaching. Good luck with everything!", "author": "TheeAngelness", "created": 1594388796, "upvotes": 1}, "fxj3hj0": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj3hj0/", "text": "The number one thing for me personally would be offering  some incentive for attending the online lectures. Previous professors would let us know about them but not make them mandatory and that ended up hurting a lot of our grades in the end. Offer some extra credit or something to give incentive for the student to attend the online lectures", "author": "sprescorr", "created": 1594388774, "upvotes": 2}, "fxj3dfz": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj3dfz/", "text": "Actually have some kind of lecture (try to make it as much like it would be in person as you can) whether it be a zoom meeting or you just recording yourself and posting it blackboard/canvas/whatever platform your school uses and, also post PowerPoints too. Have office hours and actually answer student emails bc I notice a lot of my professors didn’t do that since going online for some reason. And, please don’t make your students buy a $100+ access code that offers essentially no instruction and, have it be their only method of learning because, I had that happen to me and it caused so much unnecessary stress bc I wasn’t learning anything.", "author": "Throwawayaccounttt__", "created": 1594388707, "upvotes": 1}, "fxj39xl": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj39xl/", "text": "No proctor for online exams 😀", "author": "golfburner", "created": 1594388651, "upvotes": 1}, "fxj2uk3": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj2uk3/", "text": "Actually have lectures in real time and don't just assign textbook reading.", "author": "doggoshmove", "created": 1594388402, "upvotes": 1}, "fxj2kph": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj2kph/", "text": "I honestly can’t tolerate attending a 2 hour lecture via Zoom— I can barely get through it in person and online it’s truly unbearable (I know I sound awful! Sorry!) The 3 hour lab classes were a nightmare. \n\nIt was extremely helpful when my professors would record and post the Zoom lectures along with notes to reference (I found the notes were the most helpful than the lectures most of the time) to view at a later time. \n\nMy absolute favorite class last term posted the lecture slides, Zoom lecture, and lots and lots of shorter videos taking about a specific topic. They even went through each example in slides/homework/practice problems. They were on top of Piazza, answering questions with a very short response time. For the lab portion, they made us work together and record a Zoom video answering brief questions about the lab. We weren’t best friends by the end, but it was nice to briefly interact with people and it helped us understand the material. \n\nI know the last suggestion is very intensive and a lot of work (honestly don’t know how they did it, they are so amazing, which is why it was my best class). But it really helped!", "author": "slate_er", "created": 1594388241, "upvotes": 0}, "fxj2bfp": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj2bfp/", "text": "Communication. I feel like it can become very easy to forget about your online class. Especially when the professor barely reaches out to the students. Maybe sending out email a couple times in a week can help those students who feel disconnected or discouraged from learning.", "author": "GodOfThunder101", "created": 1594388086, "upvotes": 1}, "fxj13yv": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj13yv/", "text": "Prerecorded lectures are actual hell. During this summer session, I’ve had 2 profs do their lectures prerecorded. Let me tell you, it f’ing sucks. Something as simple as a 30 min lecture takes me 2 hrs to fully take notes. I might be the only one, but I *hate* it.", "author": "sizzlebizzle1010", "created": 1594387356, "upvotes": 19}, "fxj0px5": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj0px5/", "text": "Discussion boards on blackboard are NOT IT, especially if there’s a time your students would be doing them at once, it’s just typing back and forth, no one will get anything out of it as they’ll only be doing it because they have to.\n\nIf you do want to have a discussion board type of thing, one of my professors had us do ours on Discord and it was actually super helpful because the threads there worked better than blackboard and they gave us the whole week to think over what we thought as well as what other people had said on a topic, rather than have a ‘discussion time’. \n\nI think something like this would be reasonable and helpful, but the classic blackboard discussion board situation should be avoided if possible, I don’t know anyone that enjoys it or benefits from it.\n\nI wish you luck! Online classes suck", "author": "kkitkat6996", "created": 1594387117, "upvotes": 4}, "fxj0p4f": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj0p4f/", "text": "hi, doc. ive been a distance student for years (bc i work FT).\n\nthe only piece of advice i have is to realize that your online class is not an on-campus class. this sounds obvious but since taking my first online class in 2014 and seeing online education evolve ever since, i've noticed the professors and TAs have this expectation that their students are going to learn online the way they learn on-campus, which is synchronously. sometimes (if not most time) this is not true. there are special cases (esp in sciences that require labs or in language classes that require practice with one another) but in most cases it's not, and to force it will make the learning exp such for you AND your students. this means:\n\n* harnessing technologies (group chats, boards, presentation materials to deliver content, etc)\n* harnessing an instructional design team (meaning YOU focus on the content whereas the designers focus on the delivery)\n* accepting that some students will not use webcams (bc their internet can only sustain either audio OR video—but not both)\n* and a lot of what was already posted here in this thread.", "author": "pika_chuuu", "created": 1594387103, "upvotes": 4}, "fxj09d8": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxj09d8/", "text": "Try to give alternatives for those who are at a disadvantage to be sure that is fair for everyone and listen to their needs\n\nI had one class which the exam required printed out drawings and for us to scan our papers in for our final exam. Most of us did not have a printer and/or a scanner and our professor just responded saying spend a hundred or few hundred to print and scan. She barely gave any proper alternatives because she just assumed everyone had a proper online connection and printer/scanner at home until announcing it near the final exam date.", "author": "Pingu_Pig", "created": 1594386834, "upvotes": 1}, "fxizyvl": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxizyvl/", "text": "I work full time and gave appreciated the profs who are lenient with online deadlines. Occasionally I've gotten stuck doing 12 hour shifts (hooray for being essential right?) and going home to do my homework after that is almost impossible, it's either half assed or late. I had a wonderful prof last spring who was so understanding and would give small extensions when asked. This helped a ton.\n\nI've seen some other people comment about discussion boards as well. I don't mind them, but please don't require responses to others' comments if possible. Sometimes you just can't add more to the conversation when everyone has the same answer to the same prompt and you get stuck writing \"I agree!\". \n\nI also had a prof who had us hand write our assignments and send in pictures this past spring semester. I think the intention might have been to prevent plagiarism? I don't know. But it was annoying to have to hand write something that would be turned in digitally.", "author": "ShrewdWords", "created": 1594386652, "upvotes": 8}, "fxizv2k": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxizv2k/", "text": "I teach online and use many of the practices in \\*successful\\* online classes that students write about below. At my university, I do a lot of training for professors across the disciplines, and my focus is on developing meaningful feedback. \n\nFor online learning specifically, I've learned a great deal from [Michelle Pacansky-Brock's](https://brocansky.com/) work; she's an expert in making online education better. You could poke around on her site that I linked above or go straight to YouTube. She has many videos there, including a few keynotes where she talked about the problems of online teaching and how to improve what we do. \n\nIf your subject lends itself to discussion, I recommend [VoiceThread](https://voicethread.com/) (VT). My institution has a license, but I think you can get a free one if yours doesn't, and you can set it so it's free for students. I first found Michelle Pacansky-Brock's work because [she has a free Kindle book](https://www.amazon.com/Humanize-Your-Online-Class-VoiceThread-ebook/dp/B00DTAKMTC/ref=sr_1_1?dchild=1&keywords=michelle+pacansky+brock+voicethread&qid=1594386173&sr=8-1) on how to set up and use VoiceThread effectively.  The app is a game-changer. Every semester, my online students tell me how much they \\*enjoy\\* the discussions (!!!!). Last semester, when my face-to-face classes had to convert to online, they said similar things---especially that it was VT that kept them connected to the class.\n\nI also recommend using screencasting software, especially [Screencastify](https://www.screencastify.com/) (free with Google apps). I use my voice to speak my feedback to all my students, face-to-face or online. My online students tell me it's valuable and makes them \"know that I care.\" I've done some research and have a few publications supporting the use of screencast feedback, and it's easy to find in academic journals. Also, screencasting works in any discipline and at any level! I've done many, many workshops teaching professors how to use it, and you can simply use the tutorials with Screencastify (linked above) and be up and running in minutes. \n\nI hope what I've shared here can give you a few practical applications to try. I'm not affiliated with any of the products, etc., that I mention. Without question, I know my students benefit from everything I've promoted here. My reviews and personal anecdotes support that, as well as the many \"thank yous\" that I've received from colleagues over the years.", "author": "docktor_Vee", "created": 1594386585, "upvotes": 3}, "fxizf9e": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxizf9e/", "text": "Like many other people have said, the busy work is extremely frustrating. It's frustrating that one of my professors added online modules through our textbook that add 8 hours of work per week once we went online. In person, the course only consisted of lectures and exams. So I definitely did not understand the reason to add more work when we weren't doing it in the first place. Don't add things just because we are online. The assignments/expectations of the in person course should be transformed into an online version.\n\nIf your class normally involves discussion, I personally would prefer discussion over zoom during class than typing discussion posts. But either are acceptable as long as the requirements of discussion posts are within reason. If the most someone would say in class is a paragraph or 2 worth of information, there is no reason to mandate 6 paragraphs for a discussion post.\n\nGroup work is already dreadful when classes are in person. Please don't assign group projects online. Typically, I find them to be a waste of time and frustrating since someone ends up carrying most of the work for the team.\n\nIt is evident that you care about engaging your students by asking here and that does not go unnoticed. Make sure that your students know that you care. That you know some of them hate online school. It may be beneficial to have anonymous surveys throughout the semester, so your students can provide feedback.", "author": "juice_box19", "created": 1594386309, "upvotes": 8}, "fxiytnc": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxiytnc/", "text": "I have four online classes right now and my absolute favorite one is a zoom class (we meet on zoom once a week for 3 hours) because its only 30 students so the prof requires cameras be on and we all interact throughout to make it feel like a real class and it makes it so people actually pay attention", "author": "crayl11", "created": 1594385923, "upvotes": 2}, "fxixxcv": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxixxcv/", "text": "There needs to be a real lecture, using Zoome or Adobe Connect or something. Not a student alone with a textbook. Keep teamwork to a minimum and please none of that \"teams of 8 people,\" that's already messy in normal times but now it's just a straight up disaster.", "author": "Nomorethrowaways23", "created": 1594385339, "upvotes": 8}, "fxiwxs9": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxiwxs9/", "text": "A lot of real time interaction. As a student who prefers in person classes I missed the discussions/debates the most after everything switched online. This may be a me thing, but having the ability to start a discussion with my peers and professor really helps me to cement the knowledge vs viewing the lecture slides/being straight lectured on them. \n\nI feel most people are going to be missing the social interaction from being around people and that should help out a bit.", "author": "anon_throwaway13579", "created": 1594384679, "upvotes": 4}, "fxiwm8w": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxiwm8w/", "text": "Please do live lectures on zoom and record them and post them online, having no live calls and only recordings made me have no sense of urgency and made me struggle to get anything accomplished", "author": "TheGraveWalker22", "created": 1594384456, "upvotes": 12}, "fxivn9m": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxivn9m/", "text": "Professor PLEASE don’t give them group projects. They never work for online classes and idk why some teachers make them. No one is ever on time to meet up online so you’re left wondering if you have to do all the work, and then boom it’s Saturday night and it’s due Sunday and your teammates are finally responding. \n\nJust the absolute worst. Group projects should not be apart of online classes. \n\nI digress. Now I have to go do my group project that’s due Sunday 😤", "author": "imagineer_17", "created": 1594383760, "upvotes": 58}, "fxiuk4r": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxiuk4r/", "text": "Synchronous lectures on a normal class schedule. I hated just getting slides with voiceovers and then having little Q&A sessions once a week. The classes I was able to maintain interest in were the ones that felt like we were still have class instead of teaching ourselves.\n\nAlso, discussion boards are fine as long as you don't go nuts with the requirements. Like, one post per thread is a good requirement to have. Personally, I loved the discussion board for my seminar class, because we could get way more in depth and cover more topics when everyone could \"talk\" at once.", "author": "ParsnipPizza2", "created": 1594382948, "upvotes": 7}, "fxitjm6": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxitjm6/", "text": "No group projects or word/length requirements on discussion boards\n\nEdit: Please don't force students to use testing programs that cost money. They force you to pay per test and we're already broke.", "author": "just-doing-a-job", "created": 1594382168, "upvotes": 20}, "fxitg08": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxitg08/", "text": "Make sure to give people plenty of time to complete stuff. When my high school went online last semester, I ended up completely flip-flopping my schedule to be nothing normal. Letting students have 24 hours to complete exams and stuff can really help.\n\nI’m not sure if you’re going to do lectures in video calls, but if you do, recording them and posting them can be super helpful", "author": "404errorlifenotfound", "created": 1594382089, "upvotes": 6}, "fxis1xz": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxis1xz/", "text": "A lot of these are excellent points.\nMy take is please no group projects. \nHave both PowerPoint slide and audio of lectures for those who are auditory learners. \n\nDiscussion boards are cool but please don't make us required to reply to other students. When you make us respond you'll just see \"I agree with this statement about blah blah blah that you said!\" In literally every topic.\n\nAnd for the love of God give us a review or the correct answers after we take a test. How am I suppose to fix my grade in the future when I can't even see what I got wrong? \n\nThanks for talking to us and hope you're doing alright!", "author": "PleasantRub", "created": 1594380964, "upvotes": 67}, "fxiqn0r": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxiqn0r/", "text": "This semester all of my classed had been online and in summary I can say, that live sessions with mandatory attendance, a well structured syllabus, reading assignments with guiding questions for preparation and break-out sessions in class for discussion worked the best for me. It is harder to engage in a discussion when you have to talk to the whole class online, however break-out session take the pressure out of it and it is way more comfortable to discuss in smaller groups (preferrably not more than 4 students in each group), especially when you were given clear questions and guidelines for the discussion. Things that did NOT work so well, were, as a lot of people mentioned before, dicussion boards and non-live classes without proper interaction with the professor or the other students. Actual group work, like presentations or research projects are not very feasible as well, since it is awful to study with people online over a longer period of time. Weekly assignments are fine and might keep students engaged, as long as they are not too demanding, since this might end up in lack of quality. Additionally you should try to keep in touch with the students as much as possible. Maybe it might still be possible to have individual appointments via phone or at least answer your e-mails frequently. As much as I hate online classes and especially miss all the social interaction, which might be a main reason for so many students despising the now obligatory format, it is possible to make it more enjoyable and interesting for everyone. Hope this helped!", "author": "_thefuninfuneral", "created": 1594379751, "upvotes": 12}, "fxipzox": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxipzox/", "text": "Be clear and transparent about when lectures, assignments, and tests are released so students can prepare ahead. Leave a long enough time window for any thing time sensitive (at the very very least 24 hours, but ideally more), considering people have different schedules and there are students in different timezones.", "author": "gargar070402", "created": 1594379167, "upvotes": 9}, "fxippuo": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxippuo/", "text": "Thank you for asking this. I’m a prof too and have been wondering the same. This feedback is great", "author": "ArchMagoo", "created": 1594378917, "upvotes": 71}, "fxippu0": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxippu0/", "text": "You're not going to like my answer.\n\nYou need to take a page from prolific YouTubers.  In addition to preparing your material for lecture and assignments you're going to need to dump a ton of time into production and either scripting and/or editing.\n\nTeaching online shares a lot in common with producing a program for mass.consumtion in which the communication goes almost exclusively in one direction. \n\nGood lighting. Clear, crisp sound and interaction with a limited set of students. A moderator/TA to manage questions would be helpful.\n\nAlso be a good presenter. Take some cues from forensics competitors or other storytellers. If an audio-only podcast version of your lecture imparts enough information for an uninitiated stranger to take some knowledge away then you are probably on the right track.  As the adage goes, if you can't describe something at a basic level to someone else, then you probably don't have a good grasp of it yourself.", "author": "riftwave77", "created": 1594378916, "upvotes": 6}, "fxip8qo": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxip8qo/", "text": "One of my teachers just has discussion boards spammed and those discussion boards are just youtube videos with one question that basically makes sure you watched the video and another asking how it relates to the chapter.\n\nPlease don’t do that. It gets annoying.", "author": "Kingmir1", "created": 1594378475, "upvotes": 28}, "fxiiddb": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxiiddb/", "text": "Although I typically love online classes for their flexibility, some things I hate about online classes are when professors assign busy work. Discussion boards and poorly worded multiple choice quizzes or tests, especially.\n\nNone of my classmates care what I have to say in response to their discussion post, and the ones that respond to mine don't care about when I said (or whatever they are posting) either. Since all 30 of us have the same prompt, 90% of us are saying the exact same thing.\n\nIf you're gonna do multiple choice tests or quizzes, offer more than one attempt or make it for very few points. For a class where I'd do fine on a short answer or essay based exam, I've nearly failed when all of the quizzes and exams were pulled from some online test bank (but in my case the wording was really off in some cases- like the teacher tried to change the questions just enough so they wouldn't be google-able, but it rendered them very difficult to understand what they actually meant.)\n\nPlease try to get around requiring microsoft word or other products that cost money to buy the full version. There are free, fully functional softwares available that do the same tasks. It only takes about 30 min to research which softwares would work best for your class - if you have a preference at all. Being able to tell your students \"submit it as a word doc, pdf, or  \"open office doc\" can make things easier for them. We don't have the same computer access we used to on campus.", "author": "dippinlotsadots", "created": 1594371603, "upvotes": 20}, "fxii2zc": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxii2zc/", "text": "Depending on what you teach, an iPad or drawing tablet is such a great replacement to a white board. Following along to a discussion while staring at slides is already difficult enough in person. It just feels like an audiobook when done online. My professor would display the slides and take notes on the sides during the presentation. It worked well imo.", "author": "SwiftCEO", "created": 1594371308, "upvotes": 50}, "fxihpa9": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxihpa9/", "text": "Dont throw giant ass booklets at us.\nFor chem 30 (grade 12 level) I was given these modules. An entire unit was around 2 modules and I hated it because it was so much work AND I had to teach myself the full unit because I wasnt sure if I was gonna have finals.\n\n\nIt's not university but I suspect the format is similar. Break up your assignments if you can, and give the students resources like your lectures, other videos, and readings.", "author": "lucue_", "created": 1594370924, "upvotes": 12}, "fxihnk3": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxihnk3/", "text": "For those students, I'd: Have live lectures that are also recorded with non-mandatory attendance, have weekly homework to keep students engaged,   ask for feedback more than usual and take polls on how students want the course delivered, and most importantly-- Be very organized and make content accessible in advance of lectures.", "author": "siltyclay_clayeysilt", "created": 1594370875, "upvotes": 37}, "fxih838": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxih838/", "text": "Dear lord please no group assignments. I’ve taken 4 online courses (willingly) and the only thing I truly hated was group projects. They’re difficult to work on cooperatively (especially with different time zones) and create much more stress than is necessary.", "author": "DiazugmaCaesar", "created": 1594370438, "upvotes": 343}, "fxih80h": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxih80h/", "text": "If the questions are on Quizlet, your students will find them.\n\nAlso, don't use spyware for tests.", "author": "you90000", "created": 1594370436, "upvotes": 1}, "fxih6sz": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxih6sz/", "text": "I have a professor who really seems to know how to do online. He has a groupchat for the class - it makes it easy for us to contact him with questions and to bounce ideas off of classmates. He does a lot to encourage us to talk and share ideas in the group.\n\nOne of the big downfalls for students in online classes is forgetting when things are due. The same professor emailed us a link to the schedule on the first day - it's just a google doc with links. Links to the recorded sessions, links to the homework, links to the quizzes, etc. Organized by week, updated regularly. He updates the links at the start of the week and when new recordings are ready, and it helps a lot to have everything in one place - no hunting around on the class webpage for the links. \n\nThe same professor also seems to despise live online lecture. He does it only when discussion is needed. Instead, he makes his own lecture videos, posts them online, and keeps the online session to 15-30 min for updates, clarification, questions, etc. The lecture videos are full of notes and visual aids, emphasizing the important points, and move fast enough to be not boring - he makes them with the expectation that we will pause and rewind and watch the video more than once. Bonus that he uses youtube so we can watch the videos on 2x speed on the second or third rewatch. The software our school uses for online sessions doesn't have a setting that allows you to change the video speed.\n\nHad a professor last semester lecture fully online, monotone, didn't know how to use his software well, etc. It was very hard to focus in his class. He eventually discovered onenote and things were a lot better, but still difficult. He was trying to continue doing things exactly as he had when classes were in person - just notes on a whiteboard. I don't fault him though - it was an unexpected, sudden change for everyone.\n\nHad another professor who took advantage of his software to make things interesting. Changed pen colors frequently, for example. It was a math class so not much you could do to make it fun beyond that. Well, he let us - encouraged us to go a bit off topic in the class chat, and that livened things up a lot - group dynamic was different though since we had all known each other from class before we all got sent online.", "author": "dippinlotsadots", "created": 1594370401, "upvotes": 218}, "fxiguur": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxiguur/", "text": "post everything — every module, note, whatever — ahead of time and make the entire class function as a learn a module a week class of that sort.", "author": "EdDoesntKnowAnything", "created": 1594370064, "upvotes": 128}, "fxif2ge": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxif2ge/", "text": "Personally, I prefer multiple,low-stakes assignments rather than a handful of big assignments. Everyone is different, but I think a low-stakes quiz on the material every week is a good thing because it makes sure students are keeping up with the lectures and boosts the grade a little. Also, don't grade on a curve because that just hurts the students that don't cheat", "author": "lexiJeff", "created": 1594368245, "upvotes": 446}, "fxieuyu": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxieuyu/", "text": "Don't: use the textbook to substitute actual lectures", "author": "saltxburn", "created": 1594368036, "upvotes": 60}, "fxie7at": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxie7at/", "text": "[deleted]", "author": null, "created": 1594367379, "upvotes": 420}, "fxicv8q": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxicv8q/", "text": "What really helped for me and a bunch of other people is having a live lecture but also recording it, attendance not mandatory. I have enough discipline usually to attend live, but sometimes I’d fall behind just because being online...sometimes my willpower and mood just tank hard.  Having it recorded makes it possible to catch up. \n\nWhat helped the most though was just the professors being open and understanding and accommodating. It’s possible to maintain rigor and yet be super understanding of the students. Like just knowing you empathize with us is enough, but like showing not just saying (otherwise the opposite effect will happen)", "author": "Peanuts-the-Penguin", "created": 1594366055, "upvotes": 9}, "fxibyao": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxibyao/", "text": "Do: post slides ahead of time to follow along with, record synchronous lectures, have a protocol for discussion so it's orderly (i.e. putting an X in the chat window to form a speakers list), be transparent, be as prompt as reasonably possible to respond to emails\n\nDon't: require discussion boards, especially with arbitrary length and quantity requirements; assign purely busy work; require expensive access codes for work if you can create some assignments and save each student a hundred bucks or so; use \"midnight\" as a deadline, but instead clear the confusion by using 11:59pm", "author": "mrbmi513", "created": 1594365182, "upvotes": 1512}, "fxibvrc": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxibvrc/", "text": "[removed]", "author": null, "created": 1594365117, "upvotes": 1}, "fxibmy2": {"link": "/r/college/comments/hokanq/if_you_hate_online_classes_what_at_least_can_make/fxibmy2/", "text": "I'm currently in graduate school and recently had to take my first couple of online classes. I hated it - pretty much the entire time. But what made it at least somewhat bearable was my professors acknowledging that this was a tough and complicated time to live in. I appreciated them letting students know that this was going to be the new normal but also showing us that it was a learning process for everyone involved. This made the class feel more intimate which actually made me enjoy the lectures much more.\n\nI don't know how large your classes will be nor do I know what your subjects you will be teaching, but I would recommend possibly providing some interactive aspects to your lectures. For instance, using breakout rooms to divide students into small groups (if you're using Zoom) so they can discuss key points you've just discussed.", "author": "collegesupprtnetwork", "created": 1594364886, "upvotes": 43}}}