{"sid": "fx1kvj", "link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/", "title:": "tell me your funny college story", "text": "here's mine. I was doing an assignment that was due in 30 minutes in the library. 5 minutes left, i quickly print my assignment, write my name on top and hurry to class and turn it in. Few days later, my professor emails me saying that my assignment was identical to another person and that i will be getting a zero for the assignment. I was like WTF? because I don't talk to anyone in the class and I knew i didn't cheat. So I said ok i will talk to you in the next class.\n\nso in next class, me and this girl stay behind and the professor hands us our assignments. and they were exactly the same! Apparently she printed hers in the library before me and i guess she printed an extra, and i accidentally picked hers up and just saw the top and assumed it was mine lol.\n\nBut luckily, the assignment was two pages and I somehow took her first page but my second page. So that kind of told the professor that I didn't mean to cheat, since we each wrote about a different topic. I was able to print mine again and turn my assignment in lol.", "author": "49_1", "created": 1586328854, "retrieved": 1632802024, "over_18": false, "upvotes": 1339, "upvote_ratio": 0.99, "comments": {"fyez6xy": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fyez6xy/", "text": "Every year at my university they have two fire drills a year at night. Unfortunately both those times they went off at the worst possible moments.\n\nFirst time: I had just gotten out of the shower and had put on a gray clay face mask. I was chilling on my bed doing homework in nothing but my robe when the fire alarm went off. I quickly threw on my sweats, a t-shirt, and a jacket before I ran down 4 flights of stairs and outside. We gathered with our respective RA. It was October in Oregon and it was freezing out. Suddenly one of the girls from my floor started laughing. I realized I forgot to take off the mask. We all laughed about it; I still have a Snapchat from that night to commemorate it.\n\nSecond time: I was having sex with a former partner, and it was getting really good. The sound of the alarm pierces the air. We turned to each other and started to laugh. We stumbled around in the dark and I hit my funny bone on my desk as I found my shirt. Eventually we got outside assembled as usual. It was the middle of February and it was really cold, and I didn't bring a jacket. So I froze my ass off instead.\n\nTL;DR: The two annual fire drills happened once when I had a clay mask on my face and another time whilst I was in the middle of having sex.", "author": "ohnonotmycrocs2", "created": 1595031127, "upvotes": 1}, "fo1arpe": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fo1arpe/", "text": "Picture it: Kentucky, 2013 \n\nIt’s finals week and my roommate and I had finally crawled into our beds after hours of studying. The dormitory that we lived in was not the best quality and the walls were paper thin. You could hear people fucking four doors down. \nThere was usually a group of girls whom sat in the common area which was right outside our door, and that of the RA. It was four am. And these girls were being loud af. We kindly asked them to keep it down because we were trying to sleep. It took four times asking them to be quiet, then them banging on our bedroom door and the RA telling them to shove off for them to relocate to the room beside us where they continued to be loud. We overheard one girl saying “I lost my virginity at fifteen years old.” My roommate then yelled “YOU WHORE!” I fell out of bed laughing.", "author": "hippi3Kat94", "created": 1587429265, "upvotes": 4}, "fn752r2": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fn752r2/", "text": "My favorite so far involves my buddy and me. It started with us passing each other on a regular basis in the tech/math building. After about two weeks, we decided to turn our run-ins into a war of tag.\n\nThe best tag was on my way to the tech building one evening for a proctored exam. I saw red hair across campus and texted him: \"so if this isn't you then I'm the biggest creeper, but if it is then 5-1.\" He responded with: \"WHY ARE YOU STILL ON CAMPUS\"\n\nHe also only wears grey converse, and is about 6'2\" so even when he would try to hide and tag me, it would end in me seeing him first. Had corona not happened this semester, we would probably still be at war. Hoping to continue in the fall.", "author": "Abeeham25", "created": 1586713446, "upvotes": 2}, "fmuwnjh": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmuwnjh/", "text": "I never had anything too outrageous happen during my time in college. I'll just go with something that happened my freshman year. I was taking a calculus class at a community college and the professor hadn't showed up. Ten minutes went by and someone went up to the front and wrote \"No class\" on the chalkboard. The whole class then got up and made their way to the door. Just as the first students were about to pass through, the door opened and the professor came in and said we still had class today. Everyone let out a big long \"Awwwww\".", "author": "Giantsgiants", "created": 1586400545, "upvotes": 1}, "fmuumfx": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmuumfx/", "text": "I thought I was going to leave a life of bleakness behind when I started college. Now I’m bitter as shit after my first 2 years of college. And I don’t know if the rest of it will make up for the sadness. Funniest shit I’ve ever seen.", "author": "Basically_Zer0", "created": 1586399249, "upvotes": 1}, "fmumhdw": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmumhdw/", "text": "Mine is embarrassing 😂 It was the first warm day of spring and I was wearing a cute dress. While passing this girl she told me something along the lines of me looking nice & summer-y. She was wearing a sweater, jeans, and boots and I was sweating in what I was wearing. I replied to her, \"you make me feel very hot\" 😭😂 thankfully she just laughed 😂", "author": "thriftybee123", "created": 1586394308, "upvotes": 1}, "fmujer7": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmujer7/", "text": "I'm taking online classes, so covid hasn't really affected me that much. The only difference is that I'm a bit busier.\n\nMy math professor had opened all of the assignments ever back up again for a bit. I was at my grandparents house when that happened, but (I'm in California) that was when the governor issued the quarantine notice. No leaving the house unless it's absolutely necessary. I had my laptop and charger with me, so I wasn't that worried. Unfortunately, their WiFi is really bad, and Matlab wouldn't load.\n\nSo I stayed the night there, and left in the morning once I heard the quarantine was loosened a little. When I got home, I emailed my professor, explaining what happened and asking if she could open the assignments up for another day.\n\nI'm not really sure exactly what happened, but I think she opened them up for another week for the whole class, which was really nice of her. On the last day of the week, I went onto Canvas to finish up. (And by finish up, I mean do half of them. I'm bad at managing my time, and on top of that, I'd been super busy helping out and running errands.) To my dismay, it wouldn't load. It stayed down until after midnight.\n\nAfter some internal debate, I (and I assume others) emailed my professor again explaining that Pearson's servers were down. So she sent out an email to the class, explaining that we would get an extra day to work on it because of the server issues. I was grateful, and went to work on it the next day. But the servers were down again. She sent out another email, extending the last day.\n\nThis happened so much that we ended up getting a whole extra week because of this.", "author": "Nomekop777", "created": 1586392582, "upvotes": 2}, "fmuhi4p": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmuhi4p/", "text": "I was an R.A. at my college's apartments. Two days before the term, I got a bag of about 100 condoms.\n\nCool, right? Except that most of my residents were female and I couldn't find a way to offer them without straying into inappropriate territory.\n\nI included their availability in my monthly newsletter and put a \"free\" box outside my apartment, but I still have the majority of them.", "author": "DJGlennW", "created": 1586391514, "upvotes": 1}, "fmuewoh": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmuewoh/", "text": "I go to a school 3 hours away from my hometown. I was visiting home one weekend and went to a Ross to shop. I look up to see my physics professor shopping for bras.\n\nAfter I made sure it was her, I approached her and did the friendly \"crazy seeing you here\" and she pretty much snubbed me. I mean it was a class of about 30 and I was wearing a school shirt so she had to recognize me. She just said \"oh yeah it's me\"", "author": "Sham129", "created": 1586390053, "upvotes": 1}, "fmu9r26": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmu9r26/", "text": "Friday night with my roommates. Nothing particular planned. One of our teammates decides to stop by with alcohol. Ten minutes later, a few of his friends join. Apparently a text went out that a party was going down at our place. Within thirty minutes, fifty plus people decide to commandeer our small on-campus apartment. RA is notified as only ten people are allowed in an apartment at a time. We bribe him with alchohol. He gets plastered. Spend most of the night babysitting and attempting to hook up my friend with the volleyball captain.", "author": "ParaguayPanther", "created": 1586387198, "upvotes": 6}, "fmu7yb3": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmu7yb3/", "text": "One of my favorite stories started on the first day of the semester. \n\nOur professor was taking roll for the first time and calls out, “Carson!”. Me and the person behind me say, “Here!” at the same time. Everyone starts chuckling and the professor clarifies “Carson H.” And we both said, “Here”. Everyone was in amazement. Then the native, Spanish speaking teacher tried to sound out my name. To which we both responded by completing our names. And the class lost it. Turns out, we both have almost identical names. We ended up being partners in The class for the whole semester. \n\nIt was a, “did we just become best friends” moment. \n\nTL/DR: on the first day of class, unknown to us. Me and the kid behind me had the same fist name, same last initial, and our last names sounded almost identical.", "author": "cat_father", "created": 1586386249, "upvotes": 4}, "fmu3xog": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmu3xog/", "text": "One of the student orgs handed out over 5000 dildos the first week of class. They did it in the middle of campus to protest the fact that guns were allowed on campus but sex toys weren't. So they got together with local shops, gathered up a bunch of dildos, and handed them out while waving signs that said \"Cocks Not Glocks\" and \"Pack Heat, Not Meat.\"", "author": "valleydoodle", "created": 1586384118, "upvotes": 7}, "fmu2ymd": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmu2ymd/", "text": "Realized 20 mins before coms i had a demonstration speech due. Threw a pillow, ipad, nintendo switch, water bottle, and my passport then went to class. Presented speech on the fly about how to pack for a plane trip. When i was done the professor asked for my outlinez which i hadent done, so i asked to go print it, went to the computer lab upstairs, made and printed the outline in 5 mins and turned it in when i got back. I got a 96/100 on the assignment...", "author": "_ProfessorHamish_", "created": 1586383594, "upvotes": 8}, "fmu1kpj": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmu1kpj/", "text": "Second semester freshman year, professor came in late, my friend walks to the front of the class and declares himself professor. Starts talking about what he’s going to do to make class better. Everyone starts saying that he’s the best professor ever and calling him “Dr. Lastname”. Teacher comes in and tells him to go sit down. We all got a good laugh out of it", "author": "bambiartistic", "created": 1586382865, "upvotes": 2}, "fmu0hy2": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmu0hy2/", "text": "[deleted]", "author": null, "created": 1586382312, "upvotes": 3}, "fmu0gfm": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmu0gfm/", "text": "I fell down an entire staircase with a pile of papers in front of a group touring and they laughed", "author": "cherrypie_momjeans", "created": 1586382290, "upvotes": 1}, "fmtxbpv": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtxbpv/", "text": "Getting poisoned with ammonia together with my lab partner. At least we had fun.", "author": "peachy2506", "created": 1586380669, "upvotes": 1}, "fmtswc0": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtswc0/", "text": "First semester of freshman year. I had a class that usually met MWF at 9am. However, the final was at 8am for some reason. I had studied, felt confident, and tried to go to bed at a reasonable hour but I couldn’t really sleep. \n\nSo my genius solution to that was to take a NyQuil around 1am. I only took one, so I wasn’t expecting the shit show of events that happened on the morning.\n\nI wake up to my phone ringing. First of all, I notice it’s unusually light outside. I look at the phone and see that it’s my friend from the class whose final I was taking today. Why the hell would she be calling me? Then it hits me. I look at the time.\n\nIT’S SEVEN FIFTY A.M. Unbeknownst to me, the NyQuil has knocked me out so hard that I didn’t hear my alarm go off. I answer the phone in hysterics as I’m desperately pulling on a bra and shoes and sprinting down the hallway of my dorm. (Side note: my professor was very strict and she had previously told us that she would be closing the door at 8am- no exceptions.)\n\nI live all the way across campus, naturally, so I’m running as hard as I can, in tears, texting my friend to tell the prof to keep the door open, that I’m almost there, and I genuinely believed I was going to fail the class if I didn’t make the final so I was worried about that too.\n\nThe clock hits 8 and I break down. I still had a solid 5 minutes to go, so there was no making it. My friend texts me, however, and says to BOOK it because the prof was keeping the door open.\n\nI break out in a full Usain Bolt fucking sprint and don’t stop for a solid minute or so until I get to the building where the final was. I run in the room, everybody looking at me like I’m an escaped zoo animal, and try to keep my breathing under control as I take the paper from my prof. (My friend later told me that I was unbelievably sweaty and breathing like a maniac.) She tells me I’m late (oh wow, I didn’t notice!) and I nod my head and take the exam. (Got an A, by the way!)\nI thanked her profusely for letting me take the exam after I turned it in, and I basically owe my life to her.\n\nAnd that’s why it pays off to go to class regularly, actually put in effort throughout the semester, turn in assignments on time, and show a genuine interest in the class/prof! Because they’ll save your ass if you fall into a NyQuil-induced coma and nearly miss the final.\n\ntl;dr: I took NyQuil at 1am the night before an 8am final, overslept/woke up 10 mins before I need to be there, sprinted like a madman across campus, prof kept the door open an extra minute or two because I was generally a good student.", "author": "ramen_lovr", "created": 1586378437, "upvotes": 10}, "fmtrz1z": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtrz1z/", "text": "One day last semester, the power went out on campus. Nothing out of the ordinary, right? \n\nWell, you see a squirrel (Sparky) had a genius idea to climb a pole. Still, nothing out of the ordinary. \n\nAt the top of the pole, there was a transformer that looked fun to play in. He had a blast!\n\nUnfortunately Sparky bit the wrong wire and well, you see, Sparky went spark. He didn’t make it.\n\nWe still look up to Sparky today. He saw the light in the darkness.", "author": "Warren-Binder", "created": 1586377979, "upvotes": 10}, "fmtrsqk": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtrsqk/", "text": "Just two hours ago, I found out the one time I didn't save my assignment to the cloud before I started working on it, I forgot to save it at all ^(hahaha) ^^so ^^funny ^^^kill ^^^me", "author": "thatLifeVibe", "created": 1586377893, "upvotes": 7}, "fmtrj0u": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtrj0u/", "text": "**TLDR:** I didn't know what clove extract was and I ruined everybody's experiments.Story from my Analytical Chemistry lab last year:\n\nWe had to do an experiment to determine the \"antioxidant ability\" in different food products. We designed a reaction where if the reaction went from clear to purple, that would indicate better antioxidant ability. We tested this on clove extract, cranberry juice, and green tea.\n\nMy TA asked me to make the clove extract for our entire section. The instructions were just to put the cloves in some water to let it soak for 30 minutes, which I did. Afterwards, I asked my TA if I should use a filter to remove the cloves, and she was like \"Oh, you can just pipet the water out\".\n\nWhich I did. I pipetted the water out, but INTO A WASTE BEAKER. I was supposed to throw away the CLOVES, not the water!!\n\nI didn't realize this until I went up to the front counter with a beaker of cloves, and I stared at everybody else's containers....and I realized: Wait, cranberry juice and green tea are liquids.....but I'm carrying a solid!\n\n(So at that point I realized I messed up, and I realized that clove EXTRACT meant the water that you soak cloves in, not the cloves themselves. My 1st language is English by the way, I just never realized what clove extract meant before that day)\n\nOkay so now I'm in panic mode because I wasted 30 minutes and everybody is waiting for my cloves. As I'm putting the cloves into water again, the worst thing happens: I GET A SPONTANEOUS NOSE BLEED!\n\nBlood is gushing out of my nose, my lab coat is soaked in red, and I have to leave the room. I told my lab partner that if anybody asks why the cloves aren't ready, it's because when I got a nosebleed I panicked and accidentally knocked over the extract (total lie, but I was in too deep)\n\nSo my nosebleed stops after like 15-20 minutes; when i return, the lab is back to normal, the clove extract is almost ready. I take out the WATER this time and throw out the cloves.\n\nBut....when we do the experiment, our clove extract reaction didn't turn purple. At all. Which is weird because we KNOW cloves are antioxidants.\n\nAfter we left the lab, I was talking over what happened with my lab partner. When I got to the part about putting the cloves in water a 2nd time, she stopped and said: \"Wait...you put the SAME cloves in water???\"\n\nSo yeah, that's why the experiment turned out bad. I re-used the same cloves for the 2nd experiment. It didn't occur to me that after soaking them once, the cloves would have lost some \"clove juice\" to the surrounding water. Which is why I didn't think it'd be necessary to use new cloves.\n\nLuckily, even though i ruined everyone's experiments, we were graded for how we wrote up the results, and not the accuracy of the results themselves :)", "author": "Giant_Anteaters", "created": 1586377760, "upvotes": 1}, "fmtpf6t": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtpf6t/", "text": "I went to college that’s it that’s the story.", "author": "BigChilling25", "created": 1586376719, "upvotes": 1}, "fmtmgi9": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtmgi9/", "text": "There was this activity for a subject that I didn't like. The fact that it is scheduled 7:30 AM in the morning didn't help either.\n\nOur professor asked us to introduce ourselves in a unique way for only a minute. I don't like activities like these because of the following reasons:\n\n1. I don't like too much attention. \n\n2. I'm not good with introductions. \n\nI'm not talented but I can dance. When my name was called, I went to the front and stared at the audience because I know this will be awkward and weird as hell. Thanks to the \"last minute weird but can help you get out of sticky situations\" kind of ideas. \n\nI started dancing like the Swedish guy who auditioned for the Sweden version of American Idol. I improvised by adding some robot moves (Just search \"A funny Swedish idol meme [Mai Ya Hee]\" on YouTube for reference).\n\nGuess what? People laughed and applauded me.\n\nI never felt so awesome my entire life.", "author": "forsythe_", "created": 1586375254, "upvotes": 2}, "fmti2yb": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmti2yb/", "text": "With the pandemic making everything go tons web lecture. I found out 5 minutes before my class last night we are retaking our exam. \nOur professor lost our grades from the first online attempt! Poor guy, poor students too", "author": "wildtexastornado", "created": 1586373096, "upvotes": 3}, "fmtgsef": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtgsef/", "text": "The college I attended had a lot of distinctive features. For being a small, liberal arts college, we have a lot of “traditions” in both formal and informal manners. Formal being the events that take place, informal being the things that students do. The center of campus, called the pine grove, is a huge hang out center whenever the weather is nice. It would not be uncommon see 10-50 people doing homework there in February when it was 40 degrees and sunny outside. In the pine grove, live these lovely little squirrels, black squirrels to be specific. And they’re beloved. \n\nSide note: most of the dorms on campus are co-Ed. While there are 3 all female dorms there is only 1 all male dorm. That all male dorm has a history of being...rambunctious. And also having traditions. One of which is called a “Chapel Run”, in which the inhabitants of the dorm strip off their clothes and run to the chapel. I never found out what they did in the chapel then, but I don’t need to know. This typically happened around the library would close (midnight) so it was also a crap shoot what you would encounter on your walk back to your room. \n\nAt one point, some dudes from the dorm decided they wanted a pet, so they captured a black squirrel. Can’t remember how many days they got away with it but I think it was quite a few. Also they don’t have shower curtains cause they ritualistically rip them down at the beginning of each school year.", "author": "Anxiousrabbit23", "created": 1586372455, "upvotes": 1}, "fmtgcs2": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtgcs2/", "text": "I had about 2 weeks of horrrrrible bloody noses. I mean, I’d get one and have to lay down for HOURS sometimes just to get them to stop. \nAnyways, they eventually stopped so my roommates and I cracked a few brews to celebrate. A few too many drinks later, I decide to surprise jump on my roommates back. Well, he decided to do a 180 degree spin at the same time, landing his elbow right on my nose, starting up the nose bleeds again, immediately. So there we were, 4 drunks dudes cracking up over me bleeding out in our bathroom. To this day we still laugh about it. Good times man good times.", "author": "Raymx3", "created": 1586372246, "upvotes": 1}, "fmtd1n0": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtd1n0/", "text": "I have a bad habit of late minuting papers. So I had written a reflection paper on a book we were supposed to read for a class of mine fifteen minutes before the class started, which is when it was due. (No late work unfortunately.) I was going to do the same thing again for another reflection but I realized the last paper that I turned in like that hadn’t been graded. I decided to talk to my professor very quickly about the grade and if I had gotten a good one then I’d last minute this one too and if not then I wouldn’t. \n\nWell, I’d forgotten my professor was a huge talker. He’d go on and on about stuff. I was only looking for a grade but it become clear early in that he was more than willing to give back feedback as well which he proceeded to do. On top of that, as it turns out, last minuting a paper is a very bad idea because as he was going through it he asked me if I could not put things like “I am writing this reflection because I was forced to read this book.” I didn’t say that specifically but it was essentially that. I’d have taken that out if I hadn’t rushed to turn it in. Luckily, he was very nice about the whole deal and gave me a B.", "author": "Dragon_Cat_", "created": 1586370684, "upvotes": 2}, "fmtbyha": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmtbyha/", "text": "I took a general ed class online. If you copied the first question on the test and pasted into google, the exact test with all the answers in the same order would be the first result. That was the easiest class I ever took.", "author": "cheesymanda", "created": 1586370174, "upvotes": 3}, "fmta5zz": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmta5zz/", "text": "My friend was planning a Valentine's party for our dorm floor, and she invited me and my roommate to go bake a cake for the party at her brother's apartment. We shop for ingredients until approximately 10 pm and decide while we're out that we also want to make cookies.\n\nWell we get going, cake's in the oven pretty quick and we're working on cookies. Wholesome friend wants to make them into Ts for the name of the building we live in. Oh that's a great idea! my roommate and I say and we shape them and get them into the oven.\n\nWhen they came out my friend was so proud she called her brother out to see them. He just said \"you know what those look like...?\" And that was when we realized we'd made two batches of dick shaped cookies to give out to our floor.\n\nI couldn't stop laughing for a straight five minutes or so. The best part was just that none of us realized what we were doing. We had taken picture of me holding several of the Ts (upside down!) before they went in the oven, my roommate in the background making a T with her hands. Oblivious. It's one of my most cherished pictures from freshman year.\n\nWe still gave out the cookies, and they turned out delicious ;)", "author": "Cewells14", "created": 1586369331, "upvotes": 10}, "fmt5o88": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmt5o88/", "text": "One time I went to a photography club event and this one eccentric dude was modeling for us. When he was introducing himself to me, he pulled some mayonnaise packets out of his pocket and gave them to me and said something like \"here, eat  some, they're really good\", and I thought like \"haha funny joke\".\n\nI found out that he wasn't joking when he started slurping them down back-to-back the entire time. Dude legit had a pocket full of mayonnaise packets to slurp on.", "author": "FamishedHippopotamus", "created": 1586367264, "upvotes": 5}, "fmt1otm": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmt1otm/", "text": "I missed two papers in the same class because I ended up in jail during midterms week and then my girlfriend died during finals", "author": null, "created": 1586365442, "upvotes": 18}, "fmt1b5x": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmt1b5x/", "text": "Haha I remember freshmen year I had a very loud portable speaker and an oversized traffic cone which the speak happened to fit in very nicely. I found when the speaker was inside the cone it amplified the sound 10x so it was insanely loud. \n\nMy dorm had occasional PA announcements that started with a little three ding “chime” tune that I found online so I used iMovie and created a recording that’s started with the chime then said \n\n“Attention all residents of [my dorm] there is currently FREE PIZZA in the lobby! Bring your student ID and come on down for a free slice!”\n\nI would put my traffic cone with the the speaker out in my hallway and everyone would open their dorms up and sprint to the lobby where the desk attendant would have no clue what they were talking about.", "author": "Yaksho", "created": 1586365268, "upvotes": 23}, "fmsys0p": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsys0p/", "text": "Second chick I hooked up with freshmen year shitted  during sex. Shit got on my dick, futon, and floor. I proceeded to finish in her mouth and didn't realize what happened until after she left.", "author": null, "created": 1586364115, "upvotes": 1}, "fmsxgvt": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsxgvt/", "text": "It was halloween night and I had gotten back to my dorm room and decided to do some late night studying, at about 3 I head to bed but hear some yelling outside my window, my window is by the gate of the dorms and they’re right by a bunch of bars so it’s normal for me to hear people yelling.\n\nThen I hear the gate open and someone yell “I’m gonna fuck his ass up!” and then I hear a taser go off and I was like oh shit someone’s gonna get fucked up. Then I hear running and some girls yelling “No Robby don’t do it, Robbyy!”\n\nThe running comes to the section of my dorm, then up my stairs and hear more yelling. Then BOOOM my front door goes flying the fuck in. I stood straight the fuck up and locked my room door. The taser is going crazy now the person us yelling “WHERE IS HE!!” Like fucking Batman. I’m like wtf.\n\nI end up going to go check it out and Robby is gone but like 5 random people are in my dorm except for 1 who I know because he’s part of the group my roommate hangs out with. Ask him what’s going down and said that Rami(the whole time I heard Robby who could’ve been anybody but it was Rami, he’s part of the friend group so I was like oh okay) \n\nRoommate likes to talk shit but so does the whole rest of the group. Right as the people left and I was closing the door my roommate was coming back. I was like hurry and get the fuck in here, as soon as I get the door closed I was like you might wanna lock that and do it for him. I turn it and BOOM Rami kicks the fuck out my door. I’m just dying of laughter and my roommate tries to calm him down through the door by calling him a pussy and a bitch. He ended up filing a police report lol.", "author": "fyrefreezer01", "created": 1586363523, "upvotes": 14}, "fmsx1up": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsx1up/", "text": "It's move-in day at the dorms. The top floor is the boys' floor, second and first are the girls' floors, and the basement is common space. It also connects to the nearest parking spots, so it's heavily trafficked on move in day. \n\nMy boyfriend, myself, and some of the residents' parents are waiting on the elevator on the basement floor when we hear all the way from the third floor, \"^aww ^yeah ^dog we're gonna slay tonight, it's gonna be great, we're GONNA GET SOME *PUSSAAAAY*\"\n\nThe doors pop open on the last syllable and a trio of freshman frat-pledge-to-bes look at all of us and turn beet red.", "author": "iwrestledasharkonce", "created": 1586363336, "upvotes": 46}, "fmswr7j": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmswr7j/", "text": "Once I was going to the bathroom and I wasn't paying attention as I was on my phone. I walked through the door and put my phone down and splashed some water on my face to wake myself up. As I'm drying my face, this dude walks in and is like \"oh, shit. My bad\" and walks out. I kinda laugh at him because lol, he came into the wrong bathroom. Dude, walks back in 2 seconds later, shrugs and goes \"I don't care. If you gotta go, you gotta go.\" I'm like wait, what? And as he's walking to the stalls I turn and see a urinal and am like \"oh, shit!\" Quickly grabbed my stuff and ran out.\n\nFunniest part was there was another dude shitting in there and was probably looking through the cracks like \"why is there a girl in?\" ;)", "author": "engineer_thiz", "created": 1586363203, "upvotes": 44}, "fmswdv5": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmswdv5/", "text": "a lot of these are way more tame. but.\n\ni did LSD on campus with my ex and then had to call public safety on him when he lost his shit, which in turn got me in copious amounts of trouble, too.\n\nbackstory: i had just become an RA and i 👏 was 👏 LIVING 👏 like i was really excited to be an RA at my tiny little college in the south. it was a pay raise and a job i could do in my pajamas.\n\nso i wanted to celebrate and i acquired a single tab of reality melter and came back to my summer apartment and my boyfriend got really butthurt that i only bought one for me. so i went back out and got one for him. cool shit. i really honestly just wanted to do it alone and be alone in my dorm finally, but he insisted on taking it with me (eyerolls) even though i made it pretty clear i wanted some alone time with this. not to mention, i already was well aware that he is a terrible trip buddy.\n\nanyway, we drop these tabs and finally i'm itching for a walk in the woods. so we get our shit together and start walking. and he's already acting like there is something coming after him (keeps looking back behind him, has a look of impending doom, acting real uneasy). i had also packed a bowl and rolled a blunt so i could smoke in the woods and just wander around the small town (let me make it VERY CLEAR that i am EXTREMELY directional on lsd and know exactly where everything is in the small town of berea, ky despite my drug-induced state). little did i know what the next hour would bring because i honestly thought he would be able to handle his shit.\n\nso we are sitting in the woods on a bench and i pull out my bowl and we light up. i'm feeling REAL high after like one hit and so i chill with that; he basically chimneys out the bowl entirely. i think this is where he begins to lose it. he told me he wanted to walk back, so i said okay and started guiding us back. the sun is setting so the woods are getting kind of dark and moody. i'm LIVING for the dark, but he's starting to freak the fuck out and then he darts out to this clearing. I get pretty angry and follow him and was like \"what's wrong?\" and he tells me that he saw something in the motherfucking woods and it's coming after him. i looked back at the woods, back at him, back at the woods, and back at him, and said \"what the fuck are you talking about\" and then tried to convince him to just walk with me and i could take him home so he felt safer.\n\ninstead, he ran away from me. and he didn't know where to go because he generally lacks directional skills. he was relying on me from the get-go and yet wouldn't even trust me to get him to safety. and he's FREAKING out now. i even tried to calm him down with a blunt and he threw it and ran.\n\ni was genuinely worried. and also pretty fucking mad that he wouldn't just follow me. so i kind of just left. am i a terrible person? maybe. but i was getting really fed up with babysitting my boyfriend when i just wanted a night alone.\n\nso i get out to the alumni field. shits getting melty and i'm finally enjoying myself for a minute until i realize that my ex is still out there losing his motherfucking shit. i was torn; do i follow the protocol set in place for RAs to call public safety when someone seems dangerous or just let him live it out there alone. both felt like i was throwing him under the bus (i feel way less bad about it now and tbh would have probably just left him if it was current me, but then i certainly was torn because i cared about him). but because he felt to me to be a danger to himself and possibly others (he was sincerely delusional when i left him; it was kind of scaring me), i called the pub. my personal mistake was reporting it and then sticking around. they would have never known i was on drugs if i had left... or kept my composure. after placing the report call, i was sitting in the field and enjoying myself until i got another call. i thought it was my boyfriend because his name came up. turns out, it was his FUCKING MOTHER calling to YELL AT ME about how i PUT HER SON IN DANGER. y'all. y ' a l l. HE LITERALLY MADE ME GO BUY HIM A DAMN TAB. I WAS GONNA DO THIS ALONE. HE COULD HAVE SAID NO AT ANY TIME AND IT WOULD NOT HAVE HURT ME ONE BIT. \n\nso anyway back to me crying like a little baby. makeup smearing all over my face. bawling. was really mad at the same time. so while my waterworks are working at full speed, the pub rolls up and hears me crying and they get super concerned super quick which is, like, not what i wanted. they seem to start thinking this is a domestic abuse case or something since the call i placed was basically \"my boyfriend and i got separated in the woods and i don't know where he is and i think he's lost and confused.\" they ask me if he's been hurting me, if i need help, etc. and finally, it just comes out. \"we're both tripping on acid. he lost his mind and i left him out there to handle it on his own.\" \n\nthen, they start freaking out. they call EVERYONE. ems, fire, police. the whole nine yards for this search team. the search takes, like, an hour. the police officer was surprisingly the only person that was nice to me. he brought me two bottles of water and a blanket and was like, \"you seem to be handling this okay\" and i responded \"dude, i don't even know what i am doing here right now.\" and he laughed and told public safety it was in their hands now (public safety has total jurisdiction for campus crimes. didn't know until this day) and left and told me to have a good night despite this mess.\n\nother stuff happened too after they found him (it took, like, an hour), such as a trip to the public safety interrogation room in which they interrogated us under the influence of drugs and got nothing really from us because WE WERE ON DRUGS. but, anyhow, that's the story of how i got fired from being an RA before my job even started and the downfall of my first go-around at college. hope it entertained someone out there.", "author": "kateblazed", "created": 1586363038, "upvotes": 33}, "fmsvmsp": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsvmsp/", "text": "This one time, i started to get my life together at the age of 24, and started going to classes at my local community college, and then this huge virus took over the nation and now I'm basically doing what i was doing before.", "author": "Darth-Shittious69", "created": 1586362705, "upvotes": 27}, "fmstfpd": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmstfpd/", "text": "I slide down a hill and my pants were covered with mud.\n\nWe were doing a solid lab and we had to get down to the bottom of a hill. I'm a very clumsy person so I was hesitant about going down in the first place. I made it about a 3ed of the way down before I fell and slide. The whole lab class saw me and I wanted to drop out immediately(joking of course).\n\nI was able to smack the most of the dirt off and when we got back to campus I went to turn bathroom and wiped the seat of my pants to get the rest off.\n\nThe best part is a bit there is a path that I could have taken that was way less steep.", "author": "nickthatknack", "created": 1586361729, "upvotes": 10}, "fmsq5eo": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsq5eo/", "text": "I was taking a shower at night on Saturday and I was about to use shampoo, the fire alarm went off and I made a mad dash to throw on my robe and grab my towel. I flashed someone trying to tie my robe. \n\nLuckily it was April and not too cold, but I had to stand outside, wet, all because the theatre department went crazy with their fog machine.", "author": "littlebutcute", "created": 1586360201, "upvotes": 59}, "fmsmxn1": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsmxn1/", "text": "So my school building used to be a nuns convent so ofc we have ghost stories galore, specifically of this old nun who haunts the halls seeking vengeance or whatever. It was during exam week, I was at the library cramming my ass off when suddenly the power went out. A few people screamed and it was out for a few seconds before the generator kicked in. When it came back on, one of the jocks sitting at the table next to mine facing bolted out of there, shouting something about not getting possessed tonight. We all laughed, but then the power went out again and I noped out there too.", "author": "erlakes", "created": 1586358557, "upvotes": 65}, "fmsmvdg": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsmvdg/", "text": "We have a piano in our commons on campus and every few days I sit down and play for 10-15 minutes. One day I’m doing my thing and when I get done, this guy comes up to me and he says,\n\n“Hey man, great job! I love listening to you play.”\n\nAnd I say, “Thanks dude, I appreciate you saying that.”\n\nAnd he says back, “Yeah I actually just broke up with my girlfriend because she wanted to leave and I wanted to stay and listen to you play.”\n\nThat was an awkward moment for sure. I told him that was a bad idea but he just shrugged it off and left. I was laughing all the way to my next class.", "author": "sheepishmenorah", "created": 1586358524, "upvotes": 564}, "fmsmvan": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsmvan/", "text": "you know what's funny?\n\nI don't get to go to college because of covid.\n\nHAHAHAH", "author": "mindblower2theMAX", "created": 1586358523, "upvotes": 34}, "fmsmbpl": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsmbpl/", "text": "Here’s mine:\nWe had an O-chem exam the on the following Tuesday. I studied my ass off for a week and ended up getting a 94 on it. Completely ruined the curve for everyone in class", "author": "Redd889", "created": 1586358229, "upvotes": 27}, "fmslbuy": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmslbuy/", "text": "A lot of my stories are either inside jokes or really inappropriate, so I'll settle for this one that happened a couple of months ago.\n\nSo this apartment company I'm renting from is your typical slumlord agency. Whenever I have the opportunity to tell people that go to my school to avoid them at all costs, I do. Not only have I been paying on average $60 for water every month, they lied about about promotions, and every time I put in a service request, their employees would leave mud on the carpet and not clean up after themselves. \n\nSo around Christmas time, they sent out a mass email talking about a Christmas Wishlist Giveaway. All you had to do was put some random wishlist items down. So, me being the smartass I am, I put down a variety of items as a joke:\n- An all expenses paid trip to Europe\n- Your employees at least put bags over their shoes and not track mud all over my apartment. Also have one of them dress up as Santa and give me $500 for the time I spent cleaning after them and feeling paranoid when my stuff was moved out of place. \n- Spring Tuition & Fees paid for\n- a microwave with $1,000 stuffed in it\n- Non-perishable food to give to the pantry...  and also $1,000\n- $500 Target giftcard and a bottle of eggnog\n- Paid storage unit for 5 years so I can put all of my extra shoes and clothes in there. Or maybe I'll live in there. \n\nI completely forgot about it until a couple of weeks later, I got an email from them saying that they will be giving me one of the items on my wishlist! I am completely bewildered because all of my responses were expensive jokes. So I went about my daily life until one day I walked into my apartment after work and saw a neatly wrapped box 24\" x 12\". \n\nNot gonna lie, a small part of me got a little excited. I ripped open the present to find... a microwave. With a little hope left, I opened the microwave to see if there was any money or checks. Nope. I honestly felt like I got rickrolled as I looked up at the built in microwave above the stovetop that came with the apartment. I ended up giving the microwave to a friend who wanted one and having a good laugh about it afterwards. \n\nTl;dr: the slumlord apartment company that I'm renting from gave me a fucking microwave as a joke for Christmas.", "author": "qwassie", "created": 1586357696, "upvotes": 156}, "fmsl1ov": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsl1ov/", "text": "Was in the dead of winter and I was leaving the gym on campus. Beside the gym is the only significant hill on campus and I see three drunk girls at the top all on high heels and skirts. So, I’m just watching them when they all decide to sit down on the sidewalk. \n\nHave you ever watched the Winter Olympics when the athletes perform the [luge event?](https://youtu.be/nIn9vmzWWSE) This is what the girls were doing. One of them was carrying a skateboard and they all got on it like it was a luge. Well, they go down this hill at a whopping 5mph, digging their heels into the ground the entire time. \n\nThey get near the bottom and completely eat it. Two girls are on the ground crying and the third is to the side throwing her guts up. They finally collect themselves after a minute or so, look at each other, and walk right back up the hill to do it all again. \n\nThere was a girl who was also leaving the gym who saw the whole thing. We just looked at each other to make sure we weren’t losing our minds and then went on our way.", "author": "HornOfLegion", "created": 1586357545, "upvotes": 221}, "fmsjupb": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmsjupb/", "text": "Spent the first night of university in the Drunk Tank after tackling a mascot and preceding to square up with each other right in front of a squad car. Stayed the full night in the slammer with a dude in a shark costume. He was a pretty cool dude honestly.", "author": "ELK47", "created": 1586356896, "upvotes": 292}, "fms8qhy": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fms8qhy/", "text": "One time I was in my second semester of nursing school about to go on spring break when the school closed because of a really contagious virus that lead to a worldwide pandemic and lock down. I now have every clinical, exam, project and ATI due online, missing out on 80hrs of patient experience. The funniest part is my bf and I have custody of his 3 kids. They're on online homeschool, 2 are independent enough but I'll have to basically teach a 9yr old who just wants to play video games about a math technique that I never learned in school. Being so overwhelmed my anxiety skyrockets and I actually get less done than I'd like. The hilarity, i cant! The good news is the bf still works. So, we'll make it, I just don't know in what condition lol.", "author": "ColorMeSalty", "created": 1586349816, "upvotes": 270}, "fms6f0h": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fms6f0h/", "text": "One time when I called up the elevator to go down to breakfast, my friend happened to be in there. Neither of us were fully awake, so when the elevator door opened we both jumped out of our skin and probably woke up that whole section of the residence hall with how loudly we screamed.\n\nAlso I'm from NH but I go to school in North AL. It snowed about an inch in December, and obviously from my perspective it wasn't anything of note. But my friend from Mobile was SO EXCITED. I have a video of her literally dancing and freaking out and running through the snow because of how beautiful it was; she'd only seen it a couple times before in her life.", "author": "astronomer346", "created": 1586347987, "upvotes": 91}, "fmrrw77": {"link": "/r/college/comments/fx1kvj/tell_me_your_funny_college_story/fmrrw77/", "text": "You won't believe this, we're paying over $3,000 a quarter to stream lectures online", "author": "Semi-Delusional", "created": 1586333230, "upvotes": 956}}}