{"sid": "ptnndx", "link": "/r/college/comments/ptnndx/planners_apps_and_other_organizational_tools_what/", "title:": "Planners, Apps and other organizational tools... What do you use, what works about it for you and what doesn't? How do you keep track of everything and all the plates spinning?", "text": "Looking for the real deal from you all...  and if you could indicate if you are full time/part time student or a traditional 18-25 student or a non traditional student 25+ or any age with kids...  what works for YOU and where does it occasionally break down. I work with college students as an adviser/advocate,  and am looking for real life solutions that are working for you... \n\nFolks are generous with talking to me in my office about this stuff and I share good info... but I realized I have access to a far more diverse crew of really great people to help me help others, and to help each other while we are here! :) thanks!", "author": "daveymars13", "created": 1632371750, "retrieved": 1632800814, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hdy1j5q": {"link": "/r/college/comments/ptnndx/planners_apps_and_other_organizational_tools_what/hdy1j5q/", "text": "Full Time Grad Student, Working 3 days a week. I love trello.\n\nI can have everything for all different areas in one place, colour coded, and tagged by importance with links/photos for more info, attached documents, and timelines and reminders.", "author": "Hello_Sweetie25", "created": 1632389925, "upvotes": 1}, "hdxptab": {"link": "/r/college/comments/ptnndx/planners_apps_and_other_organizational_tools_what/hdxptab/", "text": "I'm a full-time 21-yr-old student.\n\nI use Google Calendar a lot but that's because our school website is linked with Google calendar so any classes (g-meet usually) or submission deadlines are automatically added in my calendar.\n\nAside from that, I'm pretty traditional so I like traditional planners a lot. I like seeing my handwriting because online planners make me confused and overwhelmed. Moreover, we're still doing online classes due to lockdown and I want a break from the screen.\n\nSetting up my to-do's for the week is more fun when I write on my planner since I also add some doodles and silly messages to myself like \"grind girl, because your cats need a bright future\"--basically trying to generate as much positive energy as I can to combat academic stress. I paste in pictures of my cats and corny stuff like that, hehe.", "author": "UnapologeticBitxh", "created": 1632379299, "upvotes": 3}, "hdxo6j0": {"link": "/r/college/comments/ptnndx/planners_apps_and_other_organizational_tools_what/hdxo6j0/", "text": "Evernote is really good for to do lists. \nIt's like Google docs but more aesthetic", "author": "genericusername_____", "created": 1632378004, "upvotes": 2}, "hdxjhjf": {"link": "/r/college/comments/ptnndx/planners_apps_and_other_organizational_tools_what/hdxjhjf/", "text": "I'm a big fan of Todoist linked to Google calendar. It'll automatically add and remove dated tasks for you.", "author": "mrbmi513", "created": 1632374526, "upvotes": 3}, "hdxi1c2": {"link": "/r/college/comments/ptnndx/planners_apps_and_other_organizational_tools_what/hdxi1c2/", "text": "I am a non traditional full time student and I work full time. \n\nMy favorite tool for planning is hands down Google calendar. I've trier a few different apps and physical planners, but google calendar is just what works best for me.\n\nI add everything from a course's syllabus at the beginning of the semester, check my final exam dates, etc. All of my events are color coded so that I can see at a glance if I have class, work, an assignment due, a social event, or an appointment. It also helps me not double book myself when I have to go to the doctor or agree to go to a party or something.", "author": "hemehime", "created": 1632373530, "upvotes": 3}}}