{
  "sid": "qlkj5k",
  "link": "/r/college/comments/qlkj5k/i_need_some_advice_failing_my_first_semester/",
  "title:": "I need some advice, failing my first semester",
  "text": "Hi i need some advice, basically this is my first semester of college and I was honestly not ready to go, I got severely depressed and I'm failing a lot of my classes, I will be able to bring my grades up but Im not sure if ill be able to bring them up enough to pass some courses, I will be able to retake some courses but i guess im asking if im just doomed because of this.\n\nMy college has a academic forgiveness form as well. I'm 100% I will make good grades next semester.",
  "author": "throooowwwaway1888",
  "created": 1635906076,
  "updated": 1636137566,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj3khvz": {
      "link": "/r/college/comments/qlkj5k/i_need_some_advice_failing_my_first_semester/hj3khvz/",
      "text": "Hey, things happen. Get diagnosed and get a doctor's record as that documentation will help you get the semester forgiven. \n\nI also made a few mistakes my first semester and have made As ever since. I'm saying that because it IS possible and I'm so glad you know you can do it!",
      "author": "ShesAlex",
      "created": 1635907004,
      "upvotes": 1,
      "replies": {
        "hj3kw3m": {
          "link": "/r/college/comments/qlkj5k/i_need_some_advice_failing_my_first_semester/hj3kw3m/",
          "text": "I really don't think I have clinical depression, but I am diagnosed with ADD which I have not been able to get my meds here until very recently. But thank you for the advice I appreciate it\n\nAlso I am pretty sure a diagnosis like that would be detrimental to the career path I want to go down.",
          "author": "throooowwwaway1888",
          "created": 1635907176,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj3t94s": {
      "link": "/r/college/comments/qlkj5k/i_need_some_advice_failing_my_first_semester/hj3t94s/",
      "text": "Seek diagnosis and accommodations for the ADD you mentioned. Some schools do extra time, private testing (with staff watching) but away from the noise of class, etc. Some schools won't work with you in regards to entire withdrawal without it being a diagnosis of some sort that explains why you're dropping out ie: depression. (Although even then, they still might not.) If you believe you will fail, I strongly advise you to talk to your counselor and financial aid about withdrawing. Just because YOUR school has academic forgiveness, others may not. So that transfer school or masters program may take only your first grade or a combo. Figure out which way is best for you.",
      "author": "lightbluejellyfish",
      "created": 1635910942,
      "upvotes": 1,
      "replies": {
        "hj3vi9b": {
          "link": "/r/college/comments/qlkj5k/i_need_some_advice_failing_my_first_semester/hj3vi9b/",
          "text": "Thank you for the advice, I appreciate it",
          "author": "throooowwwaway1888",
          "created": 1635912060,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}