{"sid": "puvf6d", "link": "/r/college/comments/puvf6d/dealing_with_writing_anxiety_in_english_courses/", "title:": "Dealing with writing anxiety in English courses", "text": "I'm a math major and my biggest obstacles in college are English classes and the anxiety I get writing papers. It has led me to drop freshman composition 2x. This semester I'm taking it again because I have to, and we're writing essays this week. Whenever I look at my essay Google Doc I get really nervous, so I've been avoiding it. I'm forcing myself to work on it today though.\n\nI really really don't want another W on my record. How do I break out of this cycle? Do colleges typically offer any good resources that might be useful to students with writing anxiety?", "author": "askdocs1010", "created": 1632527684, "retrieved": 1632946032, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"he8fvoa": {"link": "/r/college/comments/puvf6d/dealing_with_writing_anxiety_in_english_courses/he8fvoa/", "text": "If it makes you feel any better, I graduated with a BS in engineering and was never forced to read novels outside of English class. It's kind of a saying that literary analysis can often miss the mark. One author even said something to the effect of, \"Look. There's no hidden meaning here. I may have written 'the blue sky,' but I could have just written 'the sky,' and it wouldn't have changed the meaning one iota.\"", "author": "Comprehensive-Ad3963", "created": 1632585459, "upvotes": 1}, "he5r6wo": {"link": "/r/college/comments/puvf6d/dealing_with_writing_anxiety_in_english_courses/he5r6wo/", "text": "Most schools have student help centers that can help you out with stuff like this. Whether it is through tutoring, online help, in-person study help, peer review of written essays, etc. Check around your school for resources. Try the library and look on the school website. \n\nAlso, maybe think about reaching out to your professor; let her know you are experiencing troubles (and why) and ask her if she might have any advice. She is there to teach you, not judge you. \n\nOne way that might help you break out of your fear of being judged is to start writing for fun. Find an online outlet, whether a subreddit here, or a blog of your own, or just physical journaling, and get used to putting your words down. The more you practice, the easier it gets, and even though right now it seems like the hardest obstacle, you aren’t the only person who struggles with it! \n\nGood luck!", "author": "WickedPufferFish", "created": 1632529298, "upvotes": 1}, "he5nxis": {"link": "/r/college/comments/puvf6d/dealing_with_writing_anxiety_in_english_courses/he5nxis/", "text": "You could write an essay on the anxiety of English courses", "author": "USMCvet0303", "created": 1632527792, "upvotes": 2}, "he5nvc0": {"link": "/r/college/comments/puvf6d/dealing_with_writing_anxiety_in_english_courses/he5nvc0/", "text": "What exactly are you nervous of? Is it the unknown of getting a F or not on the paper?", "author": "USMCvet0303", "created": 1632527763, "upvotes": 2}}}