{"sid": "d5wimj", "link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/", "title:": "Are Online Classes Supposed To Be This Bad?", "text": "It's my first year of college and I have three in real life classes and two online. The second one hasn't started yet but the first is Intro to Psych. I took it as a class in high school and it was my favorite. Now, with the online class, our entire course is just reading the textbook. Genuinely my entire syllabus is every week we read a chapter of the textbook and summarize it. Then we have to reply to two other students summaries with some kind of response even though we're all describing the same thing. She'll occasionally throw in a three page essay on a 15 minute video like Little Albert. Are online classes supposed to be this horrible? I literally paid this teacher like 300$ to scan my summaries weekly and grade them.", "author": "princess-kelly", "created": 1568806931, "retrieved": 1632802948, "over_18": false, "upvotes": 558, "upvote_ratio": 0.99, "comments": {"f10t6f4": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f10t6f4/", "text": "I'm a Database Management major, and I've been taking online classes since I was 18(25 now). I've switched majors so many times I can't keep count BUT one thing that has always been consistent is online classes being awful. They have double the amount of work a regular class and its mostly self taught. I myself of average intelligence. I am no means a genius so I NEED the information to be taught to me.\n\nI'm learning how do algorithms and stuff in my programming class(That is on campus) with some difficulty. Meanwhile my online Network and Security class is having me rethink my major again. You see, I have no problem committing but when its not sticking after 6+ hours of studying...well I don't know what to do :/.And the worse part about this? An overwhelming majority of my major consist of online courses.", "author": "Colcrys", "created": 1569116984, "upvotes": 1}, "f0wmuh7": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0wmuh7/", "text": "I'm surprised to read that this is the norm in these comments. All the online courses I've taken have been more or less the same quality as in-person courses (with actual assignments, quizzes, exams, discussions, etc), just generally with written explanations of things in place of lectures", "author": "Suicidal-Lysosome", "created": 1569010197, "upvotes": 1}, "f0v01m1": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0v01m1/", "text": "Teaching an online class is actually a lot more difficult than teaching a traditional class, IF you want to achieve a reasonable teaching standard.\n\nIf you want to learn something, then do NOT take online sections. If you just need to jump through the hoop and get the credits, then take them online and do some busy work. \n\nOverall, online classes are BS. I've created one, and reviewed quite a few of them. None of them, including my own (intro to stats), are up to the same standard as regular classes. And I really did try to make mine as close as possible. I've shot videos of myself teaching and edited them. I've made video aids for the difficult topics. I also made videos explaining exam problems after they were graded. But it was still not good enough. I got a grant making that class, so I was under some pressure to make the class presentable. **Most others would simply fill each week with some boring busy works.**", "author": "AcademicDifficulty", "created": 1568957208, "upvotes": 1}, "f0tu27e": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0tu27e/", "text": "yep, thats online classes, typically dont recommend taking a class your not familiar with because if you have any issues its hard to contact the prof for help as much as they say theyre always available. they suck, all they have you do is teach yourself. i prefer in class classes but if i need to take an online for the time frame i will", "author": "carminehk", "created": 1568928968, "upvotes": 1}, "f0sxqum": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0sxqum/", "text": "[deleted]", "author": null, "created": 1568912416, "upvotes": 1}, "f0r2qik": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0r2qik/", "text": "It really depends on the lecturer I'm afraid. I've had classes that are engaging and nearly fun to do but also classes that were absolute boredom to sit through", "author": "Detozi", "created": 1568872468, "upvotes": 1}, "f0r0yg8": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0r0yg8/", "text": "I generally prefer to avoid online classes because I find them harder. Even hybrid classes are harder than traditional classes in my opinion, I'm currently taking office information systems as a hybrid class and it seems I'm having a tougher time than my friends who took it as a traditional class. I know that I'll definitely try to avoid taking any programming classes online because that would be even harder.", "author": "DarkWolf2017", "created": 1568871126, "upvotes": 1}, "f0qxxym": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0qxxym/", "text": "Yeah that’s about what they’re like in my experience . I’ve been taking online classes for about 3 years and most of my classes have been like this. Let’s only I don’t mind it. But I also have not been in a regular in-class format since high school so maybe I’m missing out lol", "author": "lacy52", "created": 1568869012, "upvotes": 1}, "f0qwbjv": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0qwbjv/", "text": "This is part of the reason that I don't take online classes. They can be good if you need credit for something, can manage your own time well, and don't need much face-to-face interaction.\n\nPersonally, I want to be invested in every class I take, so I never take online classes. The only class I ever dropped was the first and last online one I took, which was a College Algebra class. And it did NOT work for me.", "author": "ST_the_Dragon", "created": 1568867951, "upvotes": 1}, "f0qu5lz": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0qu5lz/", "text": "Online classes are never better.", "author": null, "created": 1568866563, "upvotes": 1}, "f0qu51y": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0qu51y/", "text": "Yes. That’s roughly the norm. They’re much better than in-person professors who can’t teach worth a shit", "author": null, "created": 1568866553, "upvotes": 1}, "f0qrhfw": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0qrhfw/", "text": "Yea that is exactly how all of my online class were at my last two schools. Now I'm going completely online through Penn State and it's like taking any normal class", "author": "creed_1", "created": 1568864946, "upvotes": 1}, "f0ql60c": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0ql60c/", "text": "I'm beginning to hate OL classes. At first I thought it would be a great fit for me but it appears that I'm more of an in-person learner. I don't want to wait for the professors reply to a question, I don't want to talk to other students online. I just want to learn the subject the old fashion way! \n\nAnd now you got these damn classes where you're literally sitting in a classroom 4-5 days a week on campus but they have you participate *in class* using your smartphone. What kind of shit is that?", "author": null, "created": 1568861733, "upvotes": 1}, "f0qdw3k": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0qdw3k/", "text": "a lot of online classes are this way. you read, do quizzes, write papers and really only reach out to professors for help. In my experience, if it's a class I'm not interested in taking but have to then I'll take it online.", "author": "l_poveda", "created": 1568858217, "upvotes": 1}, "f0qa8pi": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0qa8pi/", "text": "I mostly use online classes as an easy credit for classes I don't want to take. I'm basically getting an HR minor for free because all the classes are online. \n\nThis is how all of them are. I just took an ethics class and we read a chapter then posted twice in a discussion board every week.", "author": "DreadPiratesRobert", "created": 1568856498, "upvotes": 1}, "f0q7a39": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0q7a39/", "text": "Pretty much yeah. If you’re an introverted person, busy with life, or work at a slower pace online classes are for you, but if you don’t mind much social interaction and appreciate professor to student interaction take physical courses. Take this L as a learning experience mate!", "author": "banannapancakes123", "created": 1568855088, "upvotes": 1}, "f0q63c0": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0q63c0/", "text": "Unfortunately, online classes are just like real life classes in the sense that you live or die by the professor teaching the class. I've had great online classes. I've had terrible ones. The correlation was always the professor.", "author": "NewMePls", "created": 1568854543, "upvotes": 1}, "f0q34o0": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0q34o0/", "text": "Throw in another essay, a couple discussions, and a couple of quizzes weekly, and two power points and you’ve got the standard online class in my experience.\n\nI thought they were alright at first because I’m an introvert, but, absent a phenomenal instructor, they really do pale in comparison to real life classes.", "author": "AnImperialGuard", "created": 1568852993, "upvotes": 1}, "f0q18da": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0q18da/", "text": "We have seminar weekly, write and respond to weekly discussion, write occasional paper, and have quizzes. \nI have just started but from what I am gathering they really expect you to take your learning into your own hands with online classes.", "author": "Cama25", "created": 1568851946, "upvotes": 1}, "f0q0iw8": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0q0iw8/", "text": "My fiancé is physically disabled, so they told her to take all online classes. So they signed her up for 5 online classes, and long story short, she ended up having to withdraw from the university because the work load was absolutely insane and it was so much money. They then charged her $3000 for withdrawing, and we still haven’t been able to pay it. Welcome to college..", "author": "TheDankHoo", "created": 1568851534, "upvotes": 1}, "f0pyb4o": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pyb4o/", "text": "The online class I took this past summer was not this easy...we had to watch three or four (at least) hour long lectures a week and take detailed notes for the three tests and we had one instructor-led and one peer discussion a week via Zoom and questions that we had to answer to prepare for them. And we had to write three papers and two of them required at least six pages. AND we had to read five books, and a couple of them (such as Homer’s Odyssey) were quite long...", "author": "runucleverboi", "created": 1568850323, "upvotes": 1}, "f0pxzpb": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pxzpb/", "text": "That sounds like in-class psych I’m taking now so... yeah?", "author": null, "created": 1568850114, "upvotes": 1}, "f0px0mp": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0px0mp/", "text": "This sounds exactly like my Econ class I had over the summer.\n\nThankfully, our textbook was decent at explaining and my professor uploaded slides that explained a lot of concepts in depth. Our homework was in Pearson though and it was a pain in the ass. Depending on the class, it can be bearable. I’m taking intro level computer science online right now and it’s going great cause the teacher has lots of resources, all made by him, to help us with his assignments that he actually created for us. It really depends on how much effort the professor wants to put into the class.", "author": null, "created": 1568849475, "upvotes": 1}, "f0pwxve": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pwxve/", "text": "I would think there would be discussion posts or a wider variety of assignments. What a shame as intro psych could be so much more interesting.", "author": "UniKitty26", "created": 1568849424, "upvotes": 1}, "f0pw72i": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pw72i/", "text": "My online classes were so easy they were just tests and all the answers were on quizlet", "author": "ash3lynn", "created": 1568848925, "upvotes": 1}, "f0pv2yi": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pv2yi/", "text": "That was my experience in low level and general education courses. As I moved up into higher level courses, the work became more technical.", "author": "ClovertheRover", "created": 1568848155, "upvotes": 1}, "f0puv51": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0puv51/", "text": "Most of college is just bad.", "author": null, "created": 1568848005, "upvotes": 1}, "f0ptr1k": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0ptr1k/", "text": "My online courses haven’t been this way. I had one, but it also had simulations, work and questions. I generally have found my online courses use the textbook like a bible. It really depends on your teacher.", "author": "fadedpink2010", "created": 1568847219, "upvotes": 1}, "f0ptj6k": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0ptj6k/", "text": "Thats exactly what online classes are, pay excess amounts of money to teach yourself and reply to student comments saying the exact same thing but slightly different", "author": "Loli_Messiah", "created": 1568847062, "upvotes": 1}, "f0pslle": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pslle/", "text": "Here's the thing-- most entry level anything is going to just be barebones like that.\n\nEven your in-class lectures are mostly technically just that.  It's likely either a grad student or adjunct professor going over slides that summarizes the readings for the day.  It might seem like more because they might throw in some activities or question time, but that's basically it.\n\nOnline just sort of takes out the middle man.\n\nThat's just the way she goes, bubs.  Classes get a little better when you actually get deeper into your program.", "author": "Punchee", "created": 1568846377, "upvotes": 1}, "f0pr4vc": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pr4vc/", "text": "Yep thats online classes.  It's better than some profs tbh", "author": "Brendynamite", "created": 1568844252, "upvotes": 1}, "f0pqi0e": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pqi0e/", "text": "At least you don't have to to use Mindtap, that overpriced garbage,", "author": null, "created": 1568843184, "upvotes": 1}, "f0pq9x0": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pq9x0/", "text": "Depends on the program.", "author": "arlomilano", "created": 1568842807, "upvotes": 1}, "f0ppk09": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0ppk09/", "text": "In theory: no. \nIn practice: yes.", "author": null, "created": 1568841634, "upvotes": 1}, "f0png2j": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0png2j/", "text": "That's a pretty bad online class, but not surprisingly bad.", "author": "MythicalWhistle", "created": 1568838510, "upvotes": 1}, "f0pmz8d": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pmz8d/", "text": "> Are online classes supposed to be this horrible? I literally paid this teacher like 300$ to scan my summaries weekly and grade them. \n\nIt's the elephant in the room with non-synchronous online classes. Synchronous classes (where the class is broadcast live) tend to be better, but still not the same as brick & mortar classes.", "author": "monkeyman88956", "created": 1568838014, "upvotes": 3}, "f0ph96b": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0ph96b/", "text": "Yes.  That's what online classes are.  They're reading the book and doing problems/writing responses.  If you wanted discussion, you should take the course in person.", "author": "wolf2600", "created": 1568834671, "upvotes": 1}, "f0pg8vf": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pg8vf/", "text": "That teacher sure sucks at making it interactive or interesting. But some people find that to be easier/less stressful.", "author": "Ryugi", "created": 1568834072, "upvotes": 1}, "f0pg3dm": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pg3dm/", "text": "No, most of the best courses I've taken were online, but of course, some were the worst. \n\nReading the text? Can't go wrong with that.\n\nSummarize the text weekly? I don't agree with teachers enforcing busy work like this. Seems intellectually lazy, as if there is some consensus that students won't read unless forced to.\n\nReplying to some arbitrary number of posts? Hell no.\n\nReplying for the sole sake of replying? Hell no.\n\n&#x200B;\n\nThe value of online courses for myself has always been the strong discussion boards. Teachers need to be prepared to grade subjectively and not objectively as well as to be very involved. \n\nYour teacher is taking an \"easy route\" with this class by containing the subject matter to \"summarization\" and is using plausible deniability to maintain that they are not taking an \"easy route\" because they are not reliant on testing/quizzing for grading. Quick grading, as in a reliance on multiple choice or other simplified subjects like summarization, over busy work is corruptive in my opinion to actual learning because you are forced to a singular perspective.\n\nThe discussion boards can be really something great and inviting when the professor can pose complex questions for subjects they are personally interested in.", "author": "noogiey", "created": 1568833985, "upvotes": 2}, "f0pectc": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pectc/", "text": "Online classes for me have been pretty variable, some where the professor actually teaches, and some where we just read the textbook like yours. Overall, I’d try to avoid them if it’s a class or a subject your care about.", "author": "MediocreLion", "created": 1568832936, "upvotes": 1}, "f0pe82e": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pe82e/", "text": "Honestly, sounds like the typical online class to me. At my CC there are only online classes for relatively easy classes (i.e. your intro classes and GE classes). At best you get prerecorded lectures + powerpoints. At worst you're basically taking an automated course where you take online multiple-choice quizzes/exams that are automatically graded. The average online class I have has multiple choice quizzes/exams, weekly posts + lectures from the professor, discussions where you post your response and have to reply to others, and maybe a project/paper or two. \n\nSince you said you want to be a therapist, it may have been wise to try and fit the class in with your IRL classes. You get a more immersive/interactive environment, and you can talk to the professor about their experience in the major after class/during office hours. Sounds like you got a bit unlucky with the professor, but it is the nature of online classes to be a lot of busy work as you described.", "author": "Kindredspirit_", "created": 1568832856, "upvotes": 1}, "f0pddkp": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pddkp/", "text": "I'm having the opposite problem. I have 5 classes, 4 online and 1 not, and that one is the only class I have a problem with because I swear the professor isn't very good.\n\nOf course I'm an IT major so that might be the reason why I'm fine with mine.", "author": "R2D21999", "created": 1568832361, "upvotes": 1}, "f0pdagx": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pdagx/", "text": "Yeah sounds about right. Students usually take online classes for courses they don’t really need. Example, I’m a stem major and I took both fine arts credits online. It also works the other way around", "author": "avnscyrrej", "created": 1568832309, "upvotes": 1}, "f0pcm1s": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pcm1s/", "text": "I was about to take an online class but my advisor thought it wouldn't be a good idea my first semester. Kinda glad I took her advice now.", "author": "microfsxpilot", "created": 1568831917, "upvotes": 1}, "f0pbvm1": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pbvm1/", "text": "This is precisely why I don't take any online classes", "author": "Dj_White_Gold", "created": 1568831488, "upvotes": 1}, "f0patge": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0patge/", "text": "Your experience so far sums up most online classes. Occasionally you'll get some that use Connect or some other online proprietary platform. They're not much better though.\n\nMy advice is just to suck it up and try to get the most out of the critiques as you can. Be critical when you give them yourselves, but constructively so. You'll actually gain something from being able to process and either counter or support other people's critiques.\n\nOf course you can always do the \"Tom, I really like the way you express your opinion on the sky being blue. I agree that the sky is blue, too. Great post. \" routine if you're just wanting to skate by. But if you're wanting to get more out of the class, it's gonna be up to you.", "author": "TheRealSuperNoodle", "created": 1568830867, "upvotes": 1}, "f0pa2z4": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0pa2z4/", "text": "Only taken one but yeah, seems about right", "author": "Shadowshark7620", "created": 1568830423, "upvotes": 1}, "f0p99xq": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0p99xq/", "text": "Yeah my online classes are pretty shit too, granted im doing a semester doing online at a cc before I move to uni, but yeah 2 of my classes don't have work due until october 15 lol", "author": "AdroitMan", "created": 1568829938, "upvotes": 1}, "f0p869r": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0p869r/", "text": "Sounds about right", "author": "Elcycle", "created": 1568829266, "upvotes": 1}, "f0p7w17": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0p7w17/", "text": "Yeah that sounds like an online class", "author": "realcaptainkirk", "created": 1568829091, "upvotes": 1}, "f0p7vjt": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0p7vjt/", "text": "I’m in my junior year and all my classes are online, really prefer in class classes since I learn way better than online.", "author": "thelonerdude", "created": 1568829083, "upvotes": 1}, "f0p7syd": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0p7syd/", "text": "No, you paid the university that money. Then they keep the money, move sections online so they don't have to pay for operational costs of using classrooms, and then give the professor like $30 and give the rest to the 12 admin who make over $300k.", "author": "perceptionactionprof", "created": 1568829040, "upvotes": 5}, "f0p77i7": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0p77i7/", "text": "[deleted]", "author": null, "created": 1568828672, "upvotes": 2}, "f0p67cq": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0p67cq/", "text": "Yes, but isn't it \"soooooo convenient?\". Online classes are a joke.", "author": "NoChannel1", "created": 1568828052, "upvotes": 1}, "f0owa75": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0owa75/", "text": "It's an intro to psych course, so it's a soft science gen ed requirement for most majors. Those are more likely to be low/no rigor, and if it's delivered online it can get even weaker. I have had online courses like that, and online courses that were super engaging and challenging. Same for in person classes, but it's harder to phone it in as an instructor if you have to show up.", "author": "muranternet", "created": 1568821709, "upvotes": 3}, "f0ov8eb": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0ov8eb/", "text": "Serious question: if this were an in-seat class, what would you expect or prefer? Would that improve the online course if it were taught more in that way?\n\nI teach almost entirely online and what you're describing is exactly what I try to avoid every semester. I'm always open to new feedback so I can improve.", "author": "weasel85", "created": 1568821025, "upvotes": 2}, "f0orcjm": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0orcjm/", "text": "Generally that's about right. Depending on what you're doing, I've had some online learnings that would include video lectures and virtual practice labs, but it's amazing how much harder it seems to pick up information when you can't actively engage or discuss the information. It could be worse tho. I'm always surprised at how many people have had that one professor who spends the whole lecture talking about something off topic so you have to spend extra time catching up. Actually, you might end up experiencing that too, brace yourself and appreciate those professors who are truly organized, focused, and interested in the subject they are teaching.", "author": "AvAPunQween", "created": 1568818465, "upvotes": 2}, "f0oo091": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0oo091/", "text": "I teach online and I require a lot more interaction than that. Some instructors just don't know better. Others are just lazy.", "author": "whats_it_to_you77", "created": 1568816177, "upvotes": 12}, "f0omqqn": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0omqqn/", "text": "I would love that class. For classes that I don't wanna actually learn ofc.", "author": "TwitchMoments_", "created": 1568815288, "upvotes": 37}, "f0ombwp": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0ombwp/", "text": "I mean that’s pretty much online learning, and $300 is cheap AF for 3 credits... don’t see much of an issue here lol", "author": "LonelyCactus420", "created": 1568814995, "upvotes": 6}, "f0okw8y": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0okw8y/", "text": "Yep, all my online classes have been like that, from middle school to college. I don’t think it’s a waste of time. After a while, I started to get tired of sitting through lectures where the teacher reads off a power point and then gives us 15 minutes to discuss a concept in groups. For me online classes are worth it for the ability to structure my own time and focus on my own learning instead of following the pace set by a teacher for the benefit of the entire class. If you really like the topic, you’re more than welcome to dive into it, but if you’re just there for a quick A you can do it fast and easy.", "author": "RightStranger", "created": 1568813942, "upvotes": 38}, "f0og4ou": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0og4ou/", "text": "You only paid $300 for a 3 credit class? That's cheap.", "author": "danielfletcher", "created": 1568810055, "upvotes": 146}, "f0ofdls": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0ofdls/", "text": ">I literally paid this teacher like 300$ to scan my summaries weekly and grade them.\n\nFalse. You paid *the university* that money. Good chance the university is paying the professor something like $1500 for the entire semester.", "author": "bl1y", "created": 1568809383, "upvotes": 96}, "f0of0ue": {"link": "/r/college/comments/d5wimj/are_online_classes_supposed_to_be_this_bad/f0of0ue/", "text": "[deleted]", "author": null, "created": 1568809054, "upvotes": 559}}}