{
  "sid": "q8epvs",
  "link": "/r/college/comments/q8epvs/would_i_be_able_to_get_fasfa_after_starting/",
  "title:": "Would I be able to get fasfa after starting college and taking a year off",
  "text": "\n\nI went to college and did horrible bc id never gotten help for adhd. I made good friends and was supposed to live w them the next year. My parents than pulled me out of my apartment bc of my grades randomly w out telling me or my friends they were gonna so my friends got mad at me. I guess I should have gone on my own to get adhd help freshman year of college but my parents told me I was tested as a kid and didn’t have it. My mom and I decided I could go back to college sophomore year if I got an A in my summer classes. \n\nWe decided to get me help for adhd before the summer classes bc other wise there would be no point in trying to get better grades. But than each day my mom kept telling my my appointment to get adhd medication was pushed back. And at this point it was the summer after my freshman year of college but my parents moved out of my hometown so I was alone w just my parents in a town without friends . My mom kept telling me she’d take me to get adhd help each day and never took me and I ended up doing bad in the sumemr class. They blamed me but never helped me. My prnsts then took me to an eye doctor who repeatedly asked if I was bossy w my brother (I’m literally not), someone who opposes change (my friends always say how I’m down for whatever and I am easy going and spontaneous, and  if I’m good at math (I’m not). \n\nMy mom screamed “YESl at all of his questions where he asked if I randomly yelled  at family and stuff. The guy basically was saying autism traits and I think he thought i had autism which I don’t. But ifk the doctor was a creep and kept telling me how I was insanely  attractive. He wanted a 10k$ check right than for me to get help for my “issues” which he didn’t even say the name of. My mom wanted to sign and send me there bc he said I have convergence insufficiency. I told my mom that we should wait bc this doctor required immediate money and took years to treat things. I said we should Try $20 adhd meds first bc they work immediately. She yelled no and I got mean texts from my brother about how I didn’t go to the eye doctor. My parents wouldn’t listen and take me for adhd help. I than got yelled at by my parents to submit a medical withdrawal for my grades for months. The problem is I had no diagnoses bc they wouldn’t take me to get diagnosed w adhd. Eventually I got taken to get adhd help only bc my brother asked to go for him. My mom let my brother go in the room alone w the doctor but refused to let me go alone. She yelled at the adhd doctor saying I only wanted drugs even tho I’m not a drug person so?? The doctor tried to reason w her and she was acting so dramatic and weird to the doctor he got uncomfortable and just repeated “ok” w. Blank annoyed face like he thought she was crazy and she yelled at the nurses too. The doctor told me how my adhd medication wouldn’t work if I had toxic ppl in my life and mentioned how he didn’t even understand why my brother needed adhd meds. But when I got meds my parents said I couldn’t go back to school than told me I had fo do community college than said no to that and kept going back and fourth. I rlly think it’s unfair to punish a kid for having adhd especially since I’d take dyslexia tests in hs and told my parents i thought I had adhd but they made fun of me and even made fun of me w my doctor. \n\nThey say it was my responsibility to get help freshman year of college but they made fun of me and made me feel lazy and dumb my whole life. I also Spent so long trying to convicne and beg my parents and tried to get them fo understand but they never listened except my mon listened once when I tried explaining for hours and than creepily hugged me saying “it’s ok to express ur feelings” ina. Weird voice\n\nI am diagnosed w adhd. The doctor prescribed me meds. But I tried for so long and I have no motivation no matter what I d and everything from my life was pulled from me at once plus for some reason I developed a severe eating disorder and went through a period of being suicidal for like two weeks months back when this all started bc I tried for so long to get parents to listen and ufh",
  "author": "Useusername889",
  "created": 1634265248,
  "updated": 1634331953,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}