{
  "sid": "qyjbhx",
  "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/",
  "title:": "Is anyone else kinda depressed about not enjoying their college life?",
  "text": "I feel like this is so petty and dumb to feel bad about, but I haven't had the \"college experience\" at all. No crazy nights out, no real dating, no new interesting friends. I live at home and commute to school, but it's mostly online now anyway. My college also generally doesn't have a fun, social atmosphere anyway. The fact I haven't had any fun experiences also makes me feel bad about myself as a person too.\n\nMy time in college has been mostly doing HW and trying to improve myself. I'm not having any fun and it bums me out because college is usually the last time you get to be young, reckless, and just wildly enjoy life. I'm sad I probably won't get to have that. \n\nI just turned 21 and have a year left in college. Grad school is ahead of me. Just want to know if others are going through the same thing.",
  "author": "PhysicalRatio6440",
  "created": 1637456297,
  "updated": 1637689092,
  "over_18": false,
  "upvotes": 892,
  "upvote_ratio": 0.97,
  "comments": {
    "hlgh2mc": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlgh2mc/",
      "text": "“the college experience” is a bunch of fictional bullshit that hollywood sells. yeah, college kids party (sometimes a little too hard) and yeah you can meet some interesting people, but mostly it’s just…. like normal life. don’t put so much pressure on yourself to have “The College Experience,” you’ll never be able to enjoy any of your remaining time there if you’re always comparing your life to some unattainable fictional standard",
      "author": "we-bought-a-zoo",
      "created": 1637458902,
      "upvotes": 521,
      "replies": {
        "hlj6np2": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlj6np2/",
          "text": "I mean it’s not like you can’t do those things when you’re out of college",
          "author": "Pablovansnogger",
          "created": 1637516196,
          "upvotes": 18,
          "replies": {}
        },
        "hljercz": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljercz/",
          "text": "Uhhhh idk. I mean, maybe not constant* CRAZY frat parties but def a bunch of like minded, socially oriented people trying to party and have fun. Only place you’ll ever be where almost everyone is close to your age range, is almost entirely independent and has their own place to stay. Just cause your college experience was wack doesn’t mean that the experience isn’t real.",
          "author": "kdubs248",
          "created": 1637519452,
          "upvotes": 12,
          "replies": {
            "hlkdjme": {
              "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlkdjme/",
              "text": "That’s pretty much what they said, just with a different implication.",
              "author": "strawberrysweetpea",
              "created": 1637533450,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "hlj04g0": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlj04g0/",
          "text": "What do you consider “the college experience”?",
          "author": "Dragonborn22777",
          "created": 1637513513,
          "upvotes": 18,
          "replies": {
            "hljaazw": {
              "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljaazw/",
              "text": "wild frat parties all the time, meeting all of these really unrealistically interesting and quirky people, meeting your spouse and your best friends for life, clubs and sports and school spirit, having professors that become lifelong mentors and treat you like you’re super special, being one of those people who’s always like “college was the best time of my life” ….. and so on. basically, stuff that appears in most portrayals of college in film/ tv shows",
              "author": "we-bought-a-zoo",
              "created": 1637517690,
              "upvotes": 31,
              "replies": {
                "hljbvfj": {
                  "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljbvfj/",
                  "text": "Yeah, I mean I’m in a fraternity and while we do have parties a lot they’re not “wild” unless it’s Halloween or something.",
                  "author": "Dragonborn22777",
                  "created": 1637518326,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        },
        "hlk87y3": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlk87y3/",
          "text": "Yep. This. I had more fun in grad school with a more close cohort and work friends that liked going out (service industry full of college kids). That was way more fun and you’re a bit older - so you can enjoy more things legally.",
          "author": "AgentOrange256",
          "created": 1637531195,
          "upvotes": 3,
          "replies": {}
        },
        "hlj0km7": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlj0km7/",
          "text": "[removed]",
          "author": null,
          "created": 1637513696,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlgeeo1": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlgeeo1/",
      "text": "“The college experience™️” is only seen in Hollywood.",
      "author": "Spicybooiii",
      "created": 1637457607,
      "upvotes": 337,
      "replies": {
        "hlih5oh": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlih5oh/",
          "text": "speaking as *probably the only non american and coming from a 3rd world* in this thread, this is true, there's just more... to life than a 4 year university...\n\nyou might all come for me but college culture is different in other countries, my assumption is that.. people in the west may determine their \"college experience\" by partying like i see on american movies lmao",
          "author": "Frydnoodles",
          "created": 1637505389,
          "upvotes": 15,
          "replies": {
            "hlo3esw": {
              "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlo3esw/",
              "text": "I was of the opinion that it was *mostly* an American thing. I'm in a Western country (but not the US) and \"College Experience\" as defined by \"fun\" isn't much of a thing. Sure parties exist, but there's no where near as much emphasis on it as I hear online or in media.\n\nYou go to school to study.",
              "author": "EggOfAwesome",
              "created": 1637606156,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hlhid7u": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhid7u/",
          "text": "As an FSU student, I can confirm that this is entirely false",
          "author": "AC845",
          "created": 1637481159,
          "upvotes": 92,
          "replies": {
            "hlhmo7q": {
              "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhmo7q/",
              "text": "Yea FSU is partying like there is no\nPandemic. Easy to see by the positive numbers and the flu that just went through then entire population. That said there's lots of social stuff like Greek system going on and clubs. Being in dorms helps. There's free movies on campus etc. do you attend any social or other events on campus? Hanging around on campus\nLet's you meet people.\nWhat about rushing even if you don't join you are going to meet about 400-500 people.",
              "author": "jetclimb",
              "created": 1637484429,
              "upvotes": 50,
              "replies": {}
            },
            "hlhssq4": {
              "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhssq4/",
              "text": "UF student here to corroborate. It’s makes me sad to see these posts bc I felt the same not too long ago but I’m having the time of my life rn, and everyone deserves this. Peace, love, happiness, and getting absolutely shitfaced",
              "author": "5krishnan",
              "created": 1637489359,
              "upvotes": 22,
              "replies": {}
            },
            "hljxmcm": {
              "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljxmcm/",
              "text": ">That is really unfortunate.",
              "author": "emarcomd",
              "created": 1637526886,
              "upvotes": 2,
              "replies": {}
            },
            "hliyy03": {
              "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hliyy03/",
              "text": "😂😂 ok you’re both right! Hollywood does oversell the college experience which I think is what’s upsetting the OP, but there will be some schools like the legendary northern FL schools UF FSU FAMU where it’s easier to turn up like that. The schools I went to were kind of in the middle. You can just be a student if you want to, but if you want to live an exciting college experience you have to go out of your way to see what’s happening on campus (social media is your bestfriend for this) to participate. Once you get there, it’s just a matter of being friendly and from there on you’ll find more places with other ppl. It’s sounds simple but it’s not bc there’s also a lot of inner work we all have to do for ourselves to overcome a lot of the problems we face. Like maybe being too shy, nervous, overthinking, confidence etc. While you’re looking for the college experience, I recommend to also consider working on any personal traits you want to work on in order to feel more at peace. This could mean going to the extreme of being super out there or the extreme of not giving a F that you’re not living *that* life to everything in between. Try it out",
              "author": "melienoyoulie",
              "created": 1637513029,
              "upvotes": 2,
              "replies": {}
            },
            "hlhj2ob": {
              "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhj2ob/",
              "text": "which FSU we talking about here?",
              "author": "Il-LAME-lI",
              "created": 1637481681,
              "upvotes": 1,
              "replies": {
                "hlhm0su": {
                  "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhm0su/",
                  "text": "In the tone he's speaking, there's only one FSU he could be referring to and that's Florida State University",
                  "author": "WhoaTheFutureDude",
                  "created": 1637483908,
                  "upvotes": 42,
                  "replies": {
                    "hlhpufe": {
                      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhpufe/",
                      "text": "Well there's the problem lol it's Florida. XD",
                      "author": "ZCyborg23",
                      "created": 1637486964,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "hlhqx3z": {
                  "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhqx3z/",
                  "text": "Florida State, the legendary party school. In the past 10 years, literally no school can compete besides the SEC schools in terms of partying",
                  "author": "Lukerpooker",
                  "created": 1637487843,
                  "upvotes": 16,
                  "replies": {}
                }
              }
            }
          }
        },
        "hlj9cbr": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlj9cbr/",
          "text": "Like summers at camp, and raunchy high-school comedies.",
          "author": "jacxy",
          "created": 1637517299,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hli099a": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hli099a/",
      "text": "Honestly, the \"college experience\" is overrated. I (21F)  commute from home and am happy (as happy as an engineering student can be). Is it possible to just hang out in a small friend group and go out on the weekends?",
      "author": "TorturedCactus",
      "created": 1637495127,
      "upvotes": 25,
      "replies": {}
    },
    "hlgd3au": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlgd3au/",
      "text": "I genuinely believe as a traditional college student turned military turned non-traditional college student that the \"college experience\" most expect are Hollywood created. College is hard. Everyone is trying to figure out how to be adults, succeed academically, and all under an onslaught of pressures to have what they've been told is the college experience. When you don't, you think you suck at life. Personally, I didn't have the \"college experience\" until I actually left college and joined the military! If you're a traditional student, I can tell you that these are likely not meant to be the best years of your life. 24-32 were way more fun. Enough experience at that point to be able to survive and still young enough to be stupid.",
      "author": "Mammoth-Title-2102",
      "created": 1637456953,
      "upvotes": 115,
      "replies": {
        "hlhb392": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhb392/",
          "text": "Same path as you, still in school (3 semesters left) and I’m 28. To your point, these are the best years of my life, cuz you know how to have time management, work hard, have some money in your pocket to do fun stuff (eat out, day trips, etc) and honestly I “don’t care” to fit in (mostly cuz of my age) , that all in all, I’m having a blast\n *as I study for my finals on a Saturday night*",
          "author": "Mcbeto93",
          "created": 1637475872,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "hlidhrj": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlidhrj/",
      "text": "I had the “college experience” my first semester of college and it ruined gpa and I ended up in streets and houses where I should have not been, and almost lost my life. Being “reckless” becomes so fun until you get to near death experiences. After that semester I was satisfied with my fun. As a third year I’m worrying about other things now.",
      "author": "Normal_Flan_1269",
      "created": 1637503502,
      "upvotes": 18,
      "replies": {}
    },
    "hlhhm87": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhhm87/",
      "text": "we are literally the same person i am turning twenty one soon…I live at home and commute to school. Never got invited to a party, never made friends and went to like two school events but with an old friend ive had for years who doesnt attend my school. I go to school physically now like 3 times a month because of covid. I know lots of people are saying its unrealistic expectation shown in movies but my siblings and classmates have show the ideal life i wanted. Making new friends, parties, fun trips, casual dating, cool clubs etc. It makes me question myself since i have tried to reach out to people but only faced rejection or weird adult bullying",
      "author": "RatatouilleFiend",
      "created": 1637480614,
      "upvotes": 39,
      "replies": {}
    },
    "hlh6je7": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlh6je7/",
      "text": "life is different for everyone",
      "author": "jasonvoorheessucks",
      "created": 1637472796,
      "upvotes": 34,
      "replies": {}
    },
    "hlgcqsw": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlgcqsw/",
      "text": "Yeah :( I only had fun my first year and then spent the next 5 sulking because I felt the same way",
      "author": "dedreanna",
      "created": 1637456788,
      "upvotes": 29,
      "replies": {}
    },
    "hlh8xm5": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlh8xm5/",
      "text": "While I sympathize with you and understand it must be difficult going through this… what have you done to get “the college experience”? It isn’t just given to you. You kinda have to work  for it, get out your comfort zone and join some clubs\n\nLast year I joined club baseball (which I hadn’t played in a few years) as wel as 2 other clubs and met all my closest friends through that. Only really have 1-2 people I talk to consistently cuz of classes, and both of those are through me asking for their numbers. Gotta work to get that experience and sometimes it isn’t easy or comfortable. Growth happens when you’re uncomfortable",
      "author": "charlesdickinsideme",
      "created": 1637474366,
      "upvotes": 22,
      "replies": {}
    },
    "hlgr3nq": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlgr3nq/",
      "text": "I'm (20 M) enjoying my college experience. I hangout with my roommates & friends, got to parties, meet other students from other dorms, learn new stuff. I enjoy it. one definitely needs \"luck\" for lack of better words to have the \"typical college experience\" my college experience is fun, but mild not crazy, just a bunch of hanging out. unfortunately, I am commuting next semester so thats really going to suck.",
      "author": "vibinggrass",
      "created": 1637463988,
      "upvotes": 35,
      "replies": {}
    },
    "hlip7xg": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlip7xg/",
      "text": "Firstly 'College Experience ' is an arbitrary concept which gets highly influenced by social media and Hollywood. To be honest, I also have an year left and kinda in the same boat but I don't feel bad about it. All you need to know is that it's going be an year long grind and after that you have a great future. Infact, 18-22 aren't that fun, as compared to 24 and beyond, you'll be young and smarter. Life is what you make of and to be Frank, I'm just waiting for this 1 year to pass by.",
      "author": "watermelon_loml",
      "created": 1637509020,
      "upvotes": 7,
      "replies": {}
    },
    "hlixlz9": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlixlz9/",
      "text": "This is me in community college. I’m in my 4th year of community college and still yearn for that college experience that I never got to have. Living in the dorms, meeting new people, going out to parties or kick backs, exploring a new city , etc…. \n\nI’m 21 and going to transfer to a 4 year and I’m excited af. I really hated my decision of going to community college because the social life was so bad for me. \n\nHowever, CC is good for people who want to save money, and for people who don’t know what they want to major in yet. It also gives you a better shot into getting into any schools compared to applying as a HS applicant (excluding Ivy League).\n\nSummary: CC social life is bad, everything else is ok/good.",
      "author": "tha_oz",
      "created": 1637512480,
      "upvotes": 6,
      "replies": {}
    },
    "hlhgcgy": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhgcgy/",
      "text": "Totally in the same boat. I rescued a puppy and it has improved my quality of life astronomically. Sure it might not solve all of my problems, but at least I have a source of dopamine, serotonin, and oxytocin!",
      "author": "Loveraevan",
      "created": 1637479700,
      "upvotes": 10,
      "replies": {
        "hlhhwer": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhhwer/",
          "text": "My favourite answer. He he.",
          "author": "Steve_McQueen_Jnr",
          "created": 1637480823,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlhpsoh": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhpsoh/",
      "text": "“Its supposed to be fun, turning 21.”",
      "author": "deepbluegolden",
      "created": 1637486928,
      "upvotes": 10,
      "replies": {}
    },
    "hlhvlu3": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhvlu3/",
      "text": "My college experience has made me want to throw myself off a cliff. And I’m not even being dramatic or hyperbolic at this point. I’m fucking miserable and no matter how hard I try or how long I spend I literally can’t do my work anymore.",
      "author": "deprimada",
      "created": 1637491581,
      "upvotes": 7,
      "replies": {}
    },
    "hlhls7l": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhls7l/",
      "text": "Drinking can be fun in terms of helping you to interact but it is nothing special it cannot beat sobers connections because those are forever.. I waited until college to drink.. this is my second night drink and simply put people just make themselves sick. Why the hell? And this was my view before and after drinking but im just dumb my life is sad.",
      "author": "elpresidentdeusa",
      "created": 1637483719,
      "upvotes": 3,
      "replies": {}
    },
    "hli1fv3": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hli1fv3/",
      "text": "Sounds like you need to create that fun for yourself! I encourage it",
      "author": "louddorms",
      "created": 1637496018,
      "upvotes": 3,
      "replies": {}
    },
    "hliqkfj": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hliqkfj/",
      "text": "Bro I do college online. I don’t even know what my college looks like IRL",
      "author": "zebradonkey69",
      "created": 1637509581,
      "upvotes": 3,
      "replies": {}
    },
    "hlj37oi": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlj37oi/",
      "text": "Lmao all these people are trying to convince themselves that wasting 2 years of their youth locked up in a room is no big deal. I'm not from the US but my college experience is something I wouldn't trade for anything in the world. I didn't got drunk every weekend, but I enjoyed being around people that had so much in common with me everyday. I feel sorry for everyone who is getting robbed of this experience.",
      "author": "planetinspaces",
      "created": 1637514785,
      "upvotes": 3,
      "replies": {}
    },
    "hlhsjvq": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhsjvq/",
      "text": "I honestly just want a girlfriend, even if she leaves me after like a month. Everyday I see at least one couple kissing on campus and I'm tired of it getting to me. Too bad I'm too awkward to talk to anyone lol",
      "author": "-DisasterStraight-",
      "created": 1637489171,
      "upvotes": 5,
      "replies": {}
    },
    "hliwouf": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hliwouf/",
      "text": "I often feel like this, but then I think to myself: JI can just make up for my lack of “the college experience” when I graduate. I’ll have my own place with no roommates and I’ll be able to have enough financial stability and freedom to do whatever I want (within reason) whenever I want (again, within reason). There’s not a whole lot you can do in college that you can’t do after you graduate with the exception being that it’s at college.",
      "author": "NeedsMoreJava",
      "created": 1637512103,
      "upvotes": 2,
      "replies": {}
    },
    "hlj19gy": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlj19gy/",
      "text": "I’m 27, and was so excited to finally head back to school to learn, enjoy the in person college experience, and meet new people. Pandemic hit a year later and I’ve been online ever since. I hate it so fucking much. I went from being on the Dean’s List to HOPING I can transfer to a University to finish out my bachelors. School went from fun and exciting to downright fucking depressing.",
      "author": "diabIo_666",
      "created": 1637513985,
      "upvotes": 2,
      "replies": {
        "hljn1kt": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljn1kt/",
          "text": "I’m also 27 and returned to school (community college), but like 2 years ago..Actually, I don’t even know anymore. 😂 Anyway, I purposely made all my classes online because I’m anti-social most of the time. But I’m also concerned with being able to transfer. I have a 2.100 or something and I need a 2.5 GPA (that’s the lowest, but I’m gonna ignore that specific detail and do my best to get to it). My anxiety is the reason it’s so low, but I’ve been trying to fix it since I returned to school. These last 2 semesters have been extra garbage, so I’m concerned about my GPA and my financial aid. 😵‍💫\n\nAnyway, I just wanted to let you know you’re not alone in this or in returning a bit later. 🙌🏼 \n\nWe got this! 💪🏼🎓👑👌🏼",
          "author": "kaesimmerdown",
          "created": 1637522638,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hljh4ll": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljh4ll/",
      "text": "Im going through the same thing but I live in the dorms. It’s my first year and I’ve decided to stop worrying about it. The right people will come around. It’s a mind over matter kind of situation. Stop Beating yourself up about the things you can’t control, the process of Getting friends is equally important as having friends. You’ll learn things about yourself just by being alone. I also want to establish connections but I would rather wait for good friends then going out with A crowd that will replace you if you Don’t show up.",
      "author": "E-ER-ERI-ERICS",
      "created": 1637520369,
      "upvotes": 2,
      "replies": {}
    },
    "hlhdme9": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhdme9/",
      "text": "I transferred to a different school for academics, and there was a stark improvement in my social life without me doing much different. If your school doesn't have as much of a social atmosphere, your options may be vastly more limited and outside your control, and that's completely okay. It's definitely tough living in a non-social environment like that, and your experience isn't uncommon.",
      "author": "BayesianOptimization",
      "created": 1637477707,
      "upvotes": 2,
      "replies": {}
    },
    "hlhkpt1": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhkpt1/",
      "text": "Here’s hoping for next semester",
      "author": "Angrysliceofpizza",
      "created": 1637482901,
      "upvotes": 2,
      "replies": {}
    },
    "hlhlo2h": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhlo2h/",
      "text": "I am having a similar experience to you. In addition to your similar experience, I was caught up in a sect of Christianity that was borderline cult-ish. So, that assisted in me not having the college experience. I'm 26 and am back in school now. I have a lot of traditional students in my class, and I still wish I would have been able to have the college experience.\n\nIts not all bad though. I still have my childhood friends, and we still have a great time together.",
      "author": "septicshock6133",
      "created": 1637483628,
      "upvotes": 2,
      "replies": {}
    },
    "hlhngyd": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhngyd/",
      "text": "Yeahhh you’re definitely not alone lol. I live at home too and I can 100% relate.. hang in there!",
      "author": "PsychologicalWave332",
      "created": 1637485075,
      "upvotes": 2,
      "replies": {}
    },
    "hli1rri": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hli1rri/",
      "text": "Unfortunately that’s the reality of living at home and commuting. I love my family but living in the dorms my first year and with roommates in subsequent years is the whole reason my time in college has been so much fun. If the social aspect of college is important to you, consider getting your own place for your last year if it’s financially feasible.",
      "author": "chi_sweetness25",
      "created": 1637496255,
      "upvotes": 2,
      "replies": {}
    },
    "hlhbwrs": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhbwrs/",
      "text": "The collage experience is simply the experience of the early 20s. No collage is necessary for any of the things you are talking about.\n\nYou are still young. Recklessness is simply neglecting sleep (or responsibilities) for partying. Go do that.",
      "author": "Alyscupcakes",
      "created": 1637476452,
      "upvotes": 2,
      "replies": {}
    },
    "hlglx94": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlglx94/",
      "text": "guys try weed it really helped me lol",
      "author": "jackxlawrie",
      "created": 1637461320,
      "upvotes": 0,
      "replies": {
        "hlguuu8": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlguuu8/",
          "text": "It gave me schizophrenia",
          "author": "madmax543210",
          "created": 1637465980,
          "upvotes": 12,
          "replies": {}
        },
        "hlhew3a": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhew3a/",
          "text": "I'm with this guy lmao",
          "author": "magentatriip",
          "created": 1637478625,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlhps07": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhps07/",
      "text": "My college experience is 100% online and it's pretty depressing when I see events happening at the college 2 hours away from where I live. I would attend more events if I was on campus. I don't have \"college friends\" or any for that matter outside of work. >.<",
      "author": "ZCyborg23",
      "created": 1637486914,
      "upvotes": 1,
      "replies": {}
    },
    "hli10ks": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hli10ks/",
      "text": "Yeah same, I just started college this year but it's all online so I haven't even met my classmates. Was hoping that it would be more fun but it is what it is.",
      "author": "freedunnoski",
      "created": 1637495700,
      "upvotes": 1,
      "replies": {}
    },
    "hljl69j": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljl69j/",
      "text": "One thing to remember is a lot of stuff you see on social media or hear about is a highlight reel. Sure people party and have fun, but for the majority of students most of college is just doing schoolwork and living normal life. And in my experience people who prioritize the experience end up sacrificing more important things along the way and have to eventually adjust, it’s just not sustainable.\n\nI struggled with the same concerns for awhile and eventually realized the partying was fun but often overrated, and that plenty of people were also just working through the 4 years and living normal lives.",
      "author": "zestyrigatoni",
      "created": 1637521918,
      "upvotes": 1,
      "replies": {}
    },
    "hljtczt": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljtczt/",
      "text": "College experience is bullshit. Get good grades, get internships, get some healthy hobbies, get a couple of real friends, graduate in 4 years or less. That’s it.",
      "author": "StarDingo",
      "created": 1637525156,
      "upvotes": 1,
      "replies": {
        "hlkw9f6": {
          "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlkw9f6/",
          "text": "how is it bullshit? You can still do all of those things and also meet new people, go out, etc",
          "author": "legendmassive",
          "created": 1637541859,
          "upvotes": 1,
          "replies": {
            "hll1qf2": {
              "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hll1qf2/",
              "text": "If you have a competitive major, you won’t have much time to party. Once per week tops. Real fun starts after college cause you finally can earn good money and be fully independent.",
              "author": "StarDingo",
              "created": 1637544443,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlkkiow": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlkkiow/",
      "text": "Also sounds like you’re not making any effort so how about making friends lol being s commuter was your choice so",
      "author": "nickydaddyy",
      "created": 1637536532,
      "upvotes": 1,
      "replies": {}
    },
    "hlid6ac": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlid6ac/",
      "text": "\"...because college is usually the last time you get to be young, reckless, and just wildly enjoy life.\"\n\nActually that was high school......sorry. The rest is Hollywood as someone else has commented also and not real, at least not for the most part.",
      "author": "KindnessRule",
      "created": 1637503327,
      "upvotes": 0,
      "replies": {}
    },
    "hlhvoan": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhvoan/",
      "text": "[removed]",
      "author": null,
      "created": 1637491635,
      "upvotes": 1,
      "replies": {}
    },
    "hlidufg": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlidufg/",
      "text": "I feel u bro",
      "author": "WanderingSoul667",
      "created": 1637503693,
      "upvotes": 1,
      "replies": {}
    },
    "hliu3dm": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hliu3dm/",
      "text": "[removed]",
      "author": null,
      "created": 1637511029,
      "upvotes": 1,
      "replies": {}
    },
    "hliv10f": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hliv10f/",
      "text": "I was in your boat my whole freshman year. I’m in my first semester sophomore year but with Covid impacting my freshman I too wanted the college experience. I decide to try to make new friends. There was one kid in my group in business law and I was gonna try to form a friendship. I started to and then I would hear him talking to another kid about what clubs were gonna be the ones to go to this weekend. It was at that moment my mindset changed. You gotta think about this man, we pay to go here. To learn mainly. If you spend all 4 years worrying about the experience, personally for me it’s a waste. I want to have a great job out of the gate. I know to do that I have to apply myself. Can’t be going out every Friday and Saturday getting shitfaced and definitely can’t be thinking about it at the start of the week. I see it this way, if you go to college mainly for the experience, and you truly apply yourself, you just wasted 4 years that you could have solidified knowledge of what you wanted to do enabling you to become successful earlier and retire earlier if you play your cards right. That’s how I view it. Fuck the college experience bullshit. Room full of people I don’t know screaming, yea no thanks I’m set with me, my few friends, and my joint I smoke at night. The rest of the time I’m putting my mind towards my goal, towards my success. Like you’re paying tens of thousands of dollars to party, or you’re making your parents? Like not you, but there are definitely kids who do this and it’s like what sense does that make? It’s really not worth it",
      "author": "jhulgan25",
      "created": 1637511419,
      "upvotes": 1,
      "replies": {}
    },
    "hlj0j4p": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlj0j4p/",
      "text": "[removed]",
      "author": null,
      "created": 1637513679,
      "upvotes": 1,
      "replies": {}
    },
    "hlj1nuf": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlj1nuf/",
      "text": "I enjoyed college when covid hit and I was part of the few people on campus because of my major. When everyone came back this semester, it went downhill real fast. I work better alone and sadly I can't do that right now",
      "author": "Kaitlin33101",
      "created": 1637514148,
      "upvotes": 1,
      "replies": {}
    },
    "hljmb4n": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljmb4n/",
      "text": "As someone who is 35 and just got back into college and is going to be in the last two years (new semester hasn't started yet for me until SU 2022). I can tell you that the highlight of my day when I was in CC; since graduating, was going to early morning classes for 1/3 hours (depending on classes) and then having the rest of the day to myself to do whatever I wanted. Go to bookstore, game store, coffee shop, mall, etc.\n\nWas never the type to \"fit in\" in school growing up really. The older I got the more I realized how I liked relaxing and chilling by myself (middle of the whole \"extrovert/introvert thing); not to say I don't like mingling with people as I love it, but nothing beats wondering around on your own, even if it's just taking a bus somewhere.",
      "author": "N00dlemonk3y",
      "created": 1637522355,
      "upvotes": 1,
      "replies": {}
    },
    "hljym9i": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljym9i/",
      "text": "Relatable :,) Hang in there OP, I'm going thru the same thing as you",
      "author": "Dandy-Jasper",
      "created": 1637527292,
      "upvotes": 1,
      "replies": {}
    },
    "hlkm8do": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlkm8do/",
      "text": "I'm in the same exact predicament. I commute from home and most of my classes are online anyway. It honestly makes me really depressed sometimes because I look around and everyone I know has all these friends and they seem like they're having the time of their lives. At this point I just feel like stuff is just happening to me and I'm not really doing anything.",
      "author": "Spaghettio225",
      "created": 1637537296,
      "upvotes": 1,
      "replies": {}
    },
    "hlkvvtc": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlkvvtc/",
      "text": "Maybe don’t live at home?",
      "author": "legendmassive",
      "created": 1637541680,
      "upvotes": 1,
      "replies": {}
    },
    "hlkwhj0": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlkwhj0/",
      "text": "College is not the last time to be young and reckless. After college, if you have a stable job and especially if you live in a large city, you can afford to do a lot of fun things! I’ve had the funnest time in my mid twenties so far!\n\nI didn’t have the full college experience either, which at the time I wanted. Fortunately, I made friends through bumble BFF, went to music festivals, and had some other cool experiences.",
      "author": "ahooks1",
      "created": 1637541965,
      "upvotes": 1,
      "replies": {}
    },
    "hlo6aod": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlo6aod/",
      "text": "I can completely relate. My parents had a great college experience and idealize the past, so much so that I feel like a disappointment that I am tethered to my work. It isn't so much an alteration from my high school experience, yet with slightly more socialization. A lot of people are feeling alienated. One slight positive may be that, since we are in a global pandemic, you have less pressure to be partying. You only see those who are out not doing their work, I know so many people (employed) who were studious during college. The people out at bars may have one night of festivities, but that is the night they are seen. The rest of the time, they may be quietly chugging away at a desk or nook of the university, addressing the great amount of work.\r  \n\r  \nIn the past, university work did not extend so far; we are so digitalized now that those who are disciplined are never off the hook from their responsibilities. My advice would be to do something that is not within your character at all. Try an acting class; a painting class; a new form of exercise. Get involved with school clubs, as this can be a great place to meet people. I have expanded my social horizons significantly by attending my school's musical concerts, going to Poetry club, running club, calisthenics, a religious group, mountaineering, and a club for my major. When you talk about being reckless, you probably wouldn't appreciate your reckless times when you are this age. There are so many of my peers who are jaded by the experiences they have had and hence have to seek new highs, which have a net detrimental effect on them.\r  \n\r  \nYour set point for what is reckless, wild, and fun, has been sensitized, leaving you a broad range of potentialities for expansion. Life is short, but it is also a long winding journey, and there is no such thing as normal. You will appreciate the \"virgin\" aspects of life so much more if you save them. My friends have often expressed regret that they have done all the stereotypical college things (getting drunk at frat parties, drugs, sex, random nighttime spontaneous activities) and now are bored of them. Others never do those things and still have a lot of fun and grow as people.\r  \n\r  \nI suppose it depends on what you think is fun, and that personal criterion is always under flux. What someone who is a grad student thinks is fun varies greatly from what a freshman in college would consider an ideal night.\r  \n\r  \nFor the sake of curiosity, what do you consider fun? How can you work on incorporating those moments of levity, reprieve, or enlivening activities into the fabric of this stage of life?",
      "author": "turtledove-tail",
      "created": 1637607303,
      "upvotes": 1,
      "replies": {}
    },
    "hli4ptd": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hli4ptd/",
      "text": "I barely enjoyed college at all when I went. It was also very telling of just how awful life would still be even after I graduated.",
      "author": "SoulfulYam",
      "created": 1637498302,
      "upvotes": -1,
      "replies": {}
    },
    "hlhgsta": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hlhgsta/",
      "text": "Im more depressed about how behind i am. (Technically only a yr but my brain likes to dramatize things). Thought i wanted to do business but failed everything first yr except English. So now im chipping away at a biochem associates still in community. And pissed about it. Ill be done in probably 3. 3+1=4. Fucking hate this shit.",
      "author": "pungyou",
      "created": 1637480021,
      "upvotes": 0,
      "replies": {}
    },
    "hli2pcf": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hli2pcf/",
      "text": "Yeah. I was also going to make a post about this. \nSubmissions, tests, self learning, making projects and searching for internships is what takes most of my time. \nMy college is 10-5, I don't have time left for anything else.\nComp sci is grind.",
      "author": "leygen02",
      "created": 1637496918,
      "upvotes": 0,
      "replies": {}
    },
    "hljxdga": {
      "link": "/r/college/comments/qyjbhx/is_anyone_else_kinda_depressed_about_not_enjoying/hljxdga/",
      "text": "***If the \"frat-house party all the time, get an STD and have it be the best time of your life\" is your college experience.... then you're not supposed to be in college.***\n\nI feel bad for anyone who says \"college was the best time of my life.\"\n\nOH SHIT.  Just four frigging years in your teens?    The rest of your life is downhill from there?  A half-century of knowing your best years are BEHIND YOU?   That has got to suck.\n\nThe thing is, not only is college hard,  it comes at a really hard period in a person's life.   It's like a double-whammy.   \n\nYou're there to learn.   People all over the world would kill to have the opportunity to learn at a college level.   \n\nYou know what helped me when I felt the same way?   Talking to my cousin who was 5 years out of college.\n\nTold him I felt like a nerd who didn't do anything but study.  I never went on trips for \"spring break\" or any of that stuff.\n\nHe turns to me and says \"***Holy shit do I wish I was like that in college.  If I could do it all again, I'd do it just like that.  I didn't, and now it's too late.\"***",
      "author": "emarcomd",
      "created": 1637526788,
      "upvotes": 0,
      "replies": {}
    }
  }
}