{
  "sid": "klbczn",
  "link": "/r/college/comments/klbczn/community_college/",
  "title:": "Community College",
  "text": "Why don't more people attend Community College? Or take college or AP classes in high school? I graduated with my AA and I'm starting nursing school in the fall but I took a year off to take any extra classes I needed at Community College and the only thing I had to pay for was books. I just don't understand why more people don't see it as the opportunity it is. You don't have to go to a big four year university at first. Most of the time the first two years is just the general education classes anyway.\n\nEdit to add: I mean I get people wanting traditional experience but everyone I know that went to a four year was sent home by thanksgiving anyway.\n\n2nd edit: it’s so nice to see everyone’s opinions! I wish there wasn’t such a stigma around CC. I understand why someone would want to go straight to a 4 year I just wish it wasn’t expected of everyone. Thanks for all the responses!",
  "author": "louisepesto",
  "created": 1609102753,
  "over_18": false,
  "upvotes": 1061,
  "upvote_ratio": 0.96,
  "comments": {
    "gjb0iuc": {
      "link": "/r/college/comments/klbczn/community_college/gjb0iuc/",
      "text": "When I was in hs they called it 13th grade but my friends went to community college for 2 years and then to universities I dunno I think it’s a good option",
      "author": "thorsvalkyrie",
      "created": 1610680760,
      "upvotes": 2,
      "replies": {}
    },
    "ghg10f3": {
      "link": "/r/college/comments/klbczn/community_college/ghg10f3/",
      "text": "I definitely understand why people are going to university right after high school just to get that “college experience” but if you are planning to go into debt it’s really important to make sure you find the cheapest route possible and community college is the way to go. Like for me I’m still planning on getting the college experience by living in a residence hall and joining clubs and etc. The best part is that the residents hall that I’ll live in will be apartment style and that is only offered to sophomores and above. Also I’m planning to study abroad too!. \nSo I definitely think going to community college is a pro👌🏽",
      "author": "adamismyname19",
      "created": 1609285868,
      "upvotes": 1,
      "replies": {}
    },
    "ghbtpmy": {
      "link": "/r/college/comments/klbczn/community_college/ghbtpmy/",
      "text": "I took AP classes but they didn't transfer over. Who knew that you didn't need Human Geography or World History for a Finance major... (\\*clearly not me)",
      "author": "No-Swim-6033",
      "created": 1609191895,
      "upvotes": 1,
      "replies": {}
    },
    "ghbfnxs": {
      "link": "/r/college/comments/klbczn/community_college/ghbfnxs/",
      "text": "For one, your cc gpa usually doesn’t transfer to a 4-year, only the credits do. So you’re starting upper division courses as a junior with no gen Ed As to prop up your gpa in your major classes",
      "author": null,
      "created": 1609184632,
      "upvotes": 1,
      "replies": {
        "ghbg3mn": {
          "link": "/r/college/comments/klbczn/community_college/ghbg3mn/",
          "text": "That can be a blessing or a curse. \n\nIt is a lot easier to make an A when you are actually interested in the class.",
          "author": null,
          "created": 1609184854,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ghbfebp": {
      "link": "/r/college/comments/klbczn/community_college/ghbfebp/",
      "text": "I can only speak for my experience in High school, which was a pretty decent high school in the DFW area\n\n>Why don't more people attend Community College?\n\nIt definitely was pushed as \"lesser\" when they talked about college and what not, but support was still there. You could take dual credit classes that were straight up taught at our CC and you would recieve credit.\n\n>Or take college or AP classes in high school? \n\nI think this was actually promoted pretty well in our school, there were a variety of AP classes, the issue is these classes were advertised as REALLY hard so a lot of people just did sign up for them.",
      "author": null,
      "created": 1609184498,
      "upvotes": 2,
      "replies": {}
    },
    "ghbcvnx": {
      "link": "/r/college/comments/klbczn/community_college/ghbcvnx/",
      "text": "While CCs are a great resource and are the better financial choice, that doesn’t mean there aren’t any cons. One of those if not the biggest is the ability to network. My university had multiple opportunities for me to meet people in my field. I wouldn’t be where I am today if it weren’t for that. When I was still at the CC there was nothing like that available. \n\nAlso while I transferred to a university and finished my bachelors the data suggests that that isn’t the most common outcome. One source I saw claims only one in five CC students end up transferring to a university. \n\nWhile it is the route I took and can be beneficial, it’s not always the best option for everyone. One should look at more than just the financial factors when deciding where to go to school.",
      "author": "knightrain76",
      "created": 1609183229,
      "upvotes": 1,
      "replies": {
        "ghbfp1w": {
          "link": "/r/college/comments/klbczn/community_college/ghbfp1w/",
          "text": ">  One of those if not the biggest is the ability to network. My university had multiple opportunities for me to meet people in my field.\n\nI feel like this isnt that big of a downside as it seems since in my experience your networking options in early university are limited anyways.\n\nPeople in the field typically want to talk to people who are about the graduate.\n\nAs for professors, it is not like your CC professors cant be a form of networking in of itself.  Also in early University you are typically taking classes outside your major anyways so networking with your entry level English professor when you are Computer science student is not as effective.",
          "author": null,
          "created": 1609184649,
          "upvotes": 1,
          "replies": {
            "ghbhn03": {
              "link": "/r/college/comments/klbczn/community_college/ghbhn03/",
              "text": "Not necessarily. They might not offer an internship or job until later but getting out there early can only benefit you. \n\nI’m speaking from my experience going through recruiting for accounting firms. Obviously it might be different for other fields. It took me going through two rounds of recruiting to land an internship that started after my last semester of my undergrad. These firms recruit a year in advance so by not being on campus earlier prevented me from getting the internship under my belt before graduation. They also run these summer leadership programs for younger students that I missed out on. \n\nAs for professors I agree that it is not as important in the first two years. I also don’t view that as being as beneficial in general unless you’re more focused on academia.\n\nAlso Go Mean Green!",
              "author": "knightrain76",
              "created": 1609185648,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ghbctxn": {
      "link": "/r/college/comments/klbczn/community_college/ghbctxn/",
      "text": "CC is a great option, and one that should be taken advantage of by more students, but its good to be aware of the limitations of a CC. \nIf you are just looking to take classes and get the degree like what seems to be the majority of students, CC is probably the best choice. \n\nThe advantage a 4-year has is resources and opportunities. If you're looking to get very involved in research, orgs, clubs, competitions early on, a university will be the better option. I got involved with an international engineering competition freshman year, and by junior year I was running my University's branch. I honestly got more out of that comp than classes, and I really enjoyed it. It was also cited by my boss as one of the major reasons I got hired.\n\nIf I had gone to CC I wouldnt have had those same opportunities and wouldn't have the same job now that I love. That being said, the vast majority of university students dont take advantage of those opportunities and would have no different outcomes spending 2 years at a CC.",
      "author": "MTR2244",
      "created": 1609183205,
      "upvotes": 0,
      "replies": {
        "ghbfxmi": {
          "link": "/r/college/comments/klbczn/community_college/ghbfxmi/",
          "text": "If you transfer over you can still get involved in research, and orgs in 2 years.\n\nI think the people that are typically active in that stuff will make just as big of a presence in 2 years as they would in 4.",
          "author": null,
          "created": 1609184769,
          "upvotes": 3,
          "replies": {
            "ghc6s24": {
              "link": "/r/college/comments/klbczn/community_college/ghc6s24/",
              "text": "You're absolutely right people can still get very involved in 2 years, and it is often \"enough\" for experience/jobs whatever. However, being involved for twice as long will always be better. You make more connections and can build better relationships with professors/staff with more time. \n\nIts become a balancing act with money now though. 9 times out of 10 the best bang for your buck will be 2 years CC then university because university is so unreasonably expensive today. If you have the ability to pay for university through scholarships/grants/work and can do it with little to no debt its important to know there are benefits.\n\nAnecdotal, but while 2 year students can do well and contribute with research/orgs/comps, the majority in leadership roles or doing more advanced research are almost always 4 year students in my experience.",
              "author": "MTR2244",
              "created": 1609198901,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ghb834k": {
      "link": "/r/college/comments/klbczn/community_college/ghb834k/",
      "text": "Or I hate the people that think just because their college had a lower acceptance rate they are somehow better than you in every way. Like in literally had a kid tell me he could go though school high and not come to class and vet into my school when his was 23% and mine was 68% acceptance rate like bruh",
      "author": "Carbuck2",
      "created": 1609180858,
      "upvotes": 1,
      "replies": {}
    },
    "ghb7key": {
      "link": "/r/college/comments/klbczn/community_college/ghb7key/",
      "text": "I graduated HS with 30 credit hours and then finished my AA a few semesters later. Sooo much cheaper than university would have been. I went on to get my bachelors (graduated this month actually!) and saved soo much money doing it this way. My FASFA always sucked so I couldn’t get good scholarships. I applied for lots and wrote many many essays. Eventually I got one 500 dollar one only because it didn’t check my FASFA. \nMy parents couldn’t never afford to help out with college so I had to figure out how to do it as cheap as possible. I have no regrets for attending CC.",
      "author": "annirosec",
      "created": 1609180597,
      "upvotes": 2,
      "replies": {}
    },
    "ghb5mi8": {
      "link": "/r/college/comments/klbczn/community_college/ghb5mi8/",
      "text": "Friendly reminder that California has a CC Promise Grant that makes tuition free for 1 year at accredited community colleges.",
      "author": "KHXIII",
      "created": 1609179625,
      "upvotes": 2,
      "replies": {}
    },
    "ghb501p": {
      "link": "/r/college/comments/klbczn/community_college/ghb501p/",
      "text": "I went to a CC and I regret not having the traditional 4-year experience. Also, I was stuck in my hometown while I was there and it stunted my growth as a human person for two years. I don’t think I really was able to start developing or thinking critically until I left my hometown, which going to a 4-year provided. I could finally meet people of many different perspectives once I left my CC. I don’t look down on CCs or people who go to them but they aren’t for everyone.",
      "author": "lesbianpearls",
      "created": 1609179312,
      "upvotes": 0,
      "replies": {}
    },
    "ghb1lzs": {
      "link": "/r/college/comments/klbczn/community_college/ghb1lzs/",
      "text": "I also went through the same route. CC then transfer to Univ for accelerated BSN. Sure I missed out on some college experiences but I ended up saving a ton of money by living at home those years. The friends I made in school after I transferred to a univ said they wished they had went to a CC looking back on how fast expenses add up. I wish you luck in nursing school!",
      "author": "oxford-g",
      "created": 1609177619,
      "upvotes": 2,
      "replies": {
        "ghb4yx8": {
          "link": "/r/college/comments/klbczn/community_college/ghb4yx8/",
          "text": "Aww thank you!! I’m super nervous. Any tips? I’ve been working on my time management and I ordered straight A nursing’s boot camp.",
          "author": "louisepesto",
          "created": 1609179296,
          "upvotes": 2,
          "replies": {
            "ghbbkgi": {
              "link": "/r/college/comments/klbczn/community_college/ghbbkgi/",
              "text": "Of course fee free to pm me!",
              "author": "oxford-g",
              "created": 1609182581,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ghaz764": {
      "link": "/r/college/comments/klbczn/community_college/ghaz764/",
      "text": "This will likely get lost because I am incredibly late to the party but I made the decision to go to community college my senior year of high school. I wanted to get into a specific program at one of the state schools and it would require me to retake the SAT and that was just not appealing to me. I didn’t really care about school at that point in time and I didn’t even really want to go to college. \nWhen I tell you it was the best decision I could have made for myself, I was suddenly given the ability to study what I wanted to study, get gen Ed’s out of the way and get the individualized attention I needed, all on my schedule. I ended my first semester with a 3.8 gpa (I’m not good at math) and every other semester with a 4.0. I graduated high school with a 3.2. I also joined clubs and got to be editor in chief of my CC’s newspaper. I ended my time there with an internship and an acceptance into the program that I needed to get into. Now when I got to university I was able to hit the ground running 4.0 gpa, I joined clubs and got prestigious jobs on campus. I have paid less than half of what my peers have paid in 4 years (tuition at cc 1k a semester, at university it was 10k), I was able to get elected student body president and have job prospects when I graduate. Community college will build you up and give you the skills you need to be successful. I promise your abilities to have the “college experience” will still be there when you get to university. (Not to mention that I was able to work full-time for most of my cc time and I have quite a bit saved up.) I am in a far better place coming out of undergrad than my peers and I can almost entirely thank community college for that.",
      "author": "nahora123",
      "created": 1609176392,
      "upvotes": 3,
      "replies": {}
    },
    "ghayfwe": {
      "link": "/r/college/comments/klbczn/community_college/ghayfwe/",
      "text": "CC is definitely a smart choice depending on your situation, but in my case I attend a business school and wanna break into wall street so its actually been good to network with banks at an early stage. Some people in finance wanna get their name out so CC can seem like a late start.",
      "author": "iamvmx",
      "created": 1609176007,
      "upvotes": 1,
      "replies": {}
    },
    "ghax7ed": {
      "link": "/r/college/comments/klbczn/community_college/ghax7ed/",
      "text": "In my experience people in my community often take longer than two years to finish community college and then never really transfer to a 4 year institution. I see the upsides but you have to be dedicated and I would much rather go to a 4 year institution without having to reapply and transfer credits which makes the process bumpy. Also there is a stigma but there is some truth to it in a way. My family views it like quicksand, this is why going straight to a 4 year institution is preferred.",
      "author": "ec_2000",
      "created": 1609175381,
      "upvotes": 0,
      "replies": {}
    },
    "ghaslt9": {
      "link": "/r/college/comments/klbczn/community_college/ghaslt9/",
      "text": "[deleted]",
      "author": null,
      "created": 1609172984,
      "upvotes": -2,
      "replies": {
        "ghbgfqu": {
          "link": "/r/college/comments/klbczn/community_college/ghbgfqu/",
          "text": "> In this economy, everyone is driven my making a source of income and do whatever is necessary to get it done. Be honest with what you want.\n\nThis statement completely contradicts the rest of your post.\n\nWhy would I spend 4 years at a university and get 40k in loans when I can do \n2 years at CC followed by 2 years a university and only have 22k in loans?",
          "author": null,
          "created": 1609185028,
          "upvotes": 1,
          "replies": {
            "ghcrrb7": {
              "link": "/r/college/comments/klbczn/community_college/ghcrrb7/",
              "text": "[deleted]",
              "author": null,
              "created": 1609210298,
              "upvotes": 0,
              "replies": {
                "ghd3xir": {
                  "link": "/r/college/comments/klbczn/community_college/ghd3xir/",
                  "text": "I mean I'm getting a masters degree for what I think is a valid reason. \n\nAnd yeah college is not the only way to have a high salary, but statistics does not lie either",
                  "author": null,
                  "created": 1609217309,
                  "upvotes": 0,
                  "replies": {
                    "ghd45fe": {
                      "link": "/r/college/comments/klbczn/community_college/ghd45fe/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1609217451,
                      "upvotes": 0,
                      "replies": {
                        "ghe358x": {
                          "link": "/r/college/comments/klbczn/community_college/ghe358x/",
                          "text": "And what are you doing?",
                          "author": null,
                          "created": 1609249299,
                          "upvotes": 1,
                          "replies": {
                            "ghfibsy": {
                              "link": "/r/college/comments/klbczn/community_college/ghfibsy/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1609276289,
                              "upvotes": 1,
                              "replies": {
                                "ghfipie": {
                                  "link": "/r/college/comments/klbczn/community_college/ghfipie/",
                                  "text": "Nah im asking because you seem to nut off some perceived sense of superiority.\n\nIm asking because literally everything in life is a damn carrot. Whatever you are chasing is also a carrot dangling on a stick. Or maybe you are running away from a stick?\n\nIt really seems to make you happy to think Im failing in life. Idk dude, you should get some help. You should find happiness from within.",
                                  "author": null,
                                  "created": 1609276480,
                                  "upvotes": 0,
                                  "replies": {
                                    "ghfji2o": {
                                      "link": "/r/college/comments/klbczn/community_college/ghfji2o/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1609276876,
                                      "upvotes": 1,
                                      "replies": {
                                        "ghfjt2e": {
                                          "link": "/r/college/comments/klbczn/community_college/ghfjt2e/",
                                          "text": "And how are you not following a carrot yourself?\n\nIm not flaunting shit. It is called giving context",
                                          "author": null,
                                          "created": 1609277031,
                                          "upvotes": 0,
                                          "replies": {
                                            "ghfnznf": {
                                              "link": "/r/college/comments/klbczn/community_college/ghfnznf/",
                                              "text": "[deleted]",
                                              "author": null,
                                              "created": 1609279126,
                                              "upvotes": 1,
                                              "replies": {
                                                "ghfp08w": {
                                                  "link": "/r/college/comments/klbczn/community_college/ghfp08w/",
                                                  "text": "What? Dude you are the one shitting on people! I literally have not insulted you once.\n\nIm literally just defending other people that you are looking down upon.",
                                                  "author": null,
                                                  "created": 1609279630,
                                                  "upvotes": 0,
                                                  "replies": {
                                                    "ghfszvj": {
                                                      "link": "/r/college/comments/klbczn/community_college/ghfszvj/",
                                                      "text": "[deleted]",
                                                      "author": null,
                                                      "created": 1609281665,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "ghfxvh8": {
                                                          "link": "/r/college/comments/klbczn/community_college/ghfxvh8/",
                                                          "text": ">  I never once insulted college students for being in college (as long as they have a plan and aren't wasting their time).\n\nYou literally did in your first comment, that is why I commented in the first place.\n\nUnderstand the tone you are putting out.\n\n>I am sure people on reddit rely on you to defend them, because that's the last thing they need.\n\nIt doesnt matter what they need or dont need, if I see BS it is moral to try and stop said BS. IRL or online",
                                                          "author": null,
                                                          "created": 1609284210,
                                                          "upvotes": 0,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ghashlu": {
      "link": "/r/college/comments/klbczn/community_college/ghashlu/",
      "text": "I was an AP student from sophomore year on, took running start my senior year and am now in my second year of CC. I have saved so much money it’s ridiculous, I don’t even work full time most of the year and have had minimal scholarships from the school. I highly encourage anybody who’s drive isn’t solely based on going to 4 years at their “dream school” to attend CC. Many of my instructors have been much more qualified than I expected, and have been pretty good across the board. Total est cost of 1 year at my school is ~1/2 to the cheaper of the two largest state schools where I live. It makes it a no brainer.",
      "author": "RedmondHorn",
      "created": 1609172923,
      "upvotes": 1,
      "replies": {}
    },
    "ghar2ke": {
      "link": "/r/college/comments/klbczn/community_college/ghar2ke/",
      "text": "How did you only pay for the books and not the classes?",
      "author": "TheMcWhopper",
      "created": 1609172158,
      "upvotes": 1,
      "replies": {
        "ghb584w": {
          "link": "/r/college/comments/klbczn/community_college/ghb584w/",
          "text": "Because classes at my CC are so cheap pell grant covers them.",
          "author": "louisepesto",
          "created": 1609179425,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghaqkdm": {
      "link": "/r/college/comments/klbczn/community_college/ghaqkdm/",
      "text": "I got my associates from CC. The CC that I went to has a program that allows you to transfer with all your credits to the university in my city. I basically paid a fraction of the price for my associates to transfer as a junior in college. The community college I went to is the least expensive higher level education in my state too, so it allowed me to figure out what path I wanted.",
      "author": "QueenLatifahClone",
      "created": 1609171881,
      "upvotes": 2,
      "replies": {}
    },
    "ghapjmc": {
      "link": "/r/college/comments/klbczn/community_college/ghapjmc/",
      "text": "Honestly, this is a dumb ass post.  People do what’s best for them, or not, based on all sorts of factors (HS Ed, family, location, cost, field, etc.). There is no right/best way to do college.  It seems like you’re applying a high school mindset to the whole thing.  People do what they want/can/feel they have to.  It’s not much more convoluted than that unless you make it.",
      "author": "keekeexd",
      "created": 1609171319,
      "upvotes": -2,
      "replies": {}
    },
    "ghamied": {
      "link": "/r/college/comments/klbczn/community_college/ghamied/",
      "text": "If you're really poor, it's a lot easier to afford a state school or similar through government grants. Through that, a four-year university was completely paid for. Personally, I could also commute from home while living with parents. There was no reason to go to a community college.\n\nMany high schools in poor areas also don't offer many AP classes, or at good enough quality to reliably allow students to pass the exams. But, the ones you can take are free because the fee is waived when you're poor. So I was able to get 6 English literature credits out of the way.",
      "author": "MaddoxJKingsley",
      "created": 1609169573,
      "upvotes": 1,
      "replies": {}
    },
    "ghakrs3": {
      "link": "/r/college/comments/klbczn/community_college/ghakrs3/",
      "text": "I took dual enrollment courses my last two years in high school and it only took me one semester out of HS to get my AA and now I'm transfered to a University starting my 4 year program at 18",
      "author": "warrior15678",
      "created": 1609168533,
      "upvotes": 1,
      "replies": {}
    },
    "ghakqqr": {
      "link": "/r/college/comments/klbczn/community_college/ghakqqr/",
      "text": "Community college is great if you have to pay out of pocket etc but as someone who went and got an AA and had APs I wish I had done the full college experience. After going to design school for a year I left for financial reasons and the difference is huge. I had some friends even off campus my year at a real university after that I had no one. Also as for AP classes one your teachers have to let you do AP classes at least at my school you had to prove in your previous classes that you could do the work well. As for community college it’s really not as prestigious and you miss out on the college experience. I severely regret it because I spent all my time working or traveling when I wasn’t doing school. Didn’t meet many friends, didn’t get research opportunities, didn’t have close connections with professors. It really removes the whole experience so if you can afford it or your parents actually file their taxes unlike mine then I would say go to a cheaper state school which is what I do now. I will say it benefited me with more freedom to work and travel but overall that didn’t last and I wish I had spent more time like everyone else. Granted my family and I were going through stuff and I didn’t have the money or focus to do full time at a university but I really missed out and it shows because I don’t have any college friends.",
      "author": "mokenz",
      "created": 1609168515,
      "upvotes": -1,
      "replies": {}
    },
    "ghaiko9": {
      "link": "/r/college/comments/klbczn/community_college/ghaiko9/",
      "text": "I go to CC right now I wasn’t always smart or had the best education but CC gave me a chance to chase my dreams. At first I was a embarrassed going to a CC because most of my friends went to big university’s and I was the only one staying in my hometown. I find CC to be very easy going classes. Also you can transfer schools with the 2 year program which also saves a lot of money. But at the same time CC gives the same degrees as a big University so I don’t really see a difference with that.",
      "author": "Ajsnipedyou",
      "created": 1609167166,
      "upvotes": 1,
      "replies": {}
    },
    "ghai7ws": {
      "link": "/r/college/comments/klbczn/community_college/ghai7ws/",
      "text": "Going to CC was the best thing I ever did for myself. It was hard at first as I was experiencing a ton of FOMO by not going to a 4 year straight out of high school. The amount of money I saved was so worth it, plus I ended up making friends which I was not expecting. At CC I created my own definition of a college experience and have zero regrets!",
      "author": "berryniceday",
      "created": 1609166936,
      "upvotes": 1,
      "replies": {}
    },
    "ghag0ln": {
      "link": "/r/college/comments/klbczn/community_college/ghag0ln/",
      "text": "I applied to some more selective schools and got into one that I thought I'd like more than the CC --> state school track. I got enough aid and scholarships to make it affordable, and I really wanted to move out of my parents house.",
      "author": "SkiMonkey98",
      "created": 1609165457,
      "upvotes": 1,
      "replies": {}
    },
    "ghafo86": {
      "link": "/r/college/comments/klbczn/community_college/ghafo86/",
      "text": "I mean CC for me was great. It was cheap I paid zero to go, hell I got refunds every semester I was there. Got my gen eds out of the way. \n\nSocializing was not an issue as my CC would have been considered somewhere between the 8th and 10th largest schools in the country if it was a 4 year.\n\nIt had good connections, as it had agreements with some big schools (Georgia Tech, Syracuse, Wisconsin and a few others) that if you got your AA from there you'd get auto accepted into the school. If you also had a certain gpa, you'd to scholarships too. \n\nNobody I know was looked down on for going to that CC. Hell most people who parents went to college at all, usually went to that CC at some point. When you were a senior a good chunk of your friends were going to be at that CC. It was just normal. \n\nNot sure about other places but here in Miami, nobody batted an eye at CC.",
      "author": "dade305305",
      "created": 1609165216,
      "upvotes": 5,
      "replies": {}
    },
    "ghabpz0": {
      "link": "/r/college/comments/klbczn/community_college/ghabpz0/",
      "text": "It all boils down to branding.",
      "author": "Wrashionis",
      "created": 1609162278,
      "upvotes": 2,
      "replies": {}
    },
    "gha6663": {
      "link": "/r/college/comments/klbczn/community_college/gha6663/",
      "text": "I considered going to a community college, but I would've saved more money in the long run to go to university. I had a really good scholarship and if I had transfered after going to CC I would've lost it. I'd have to pay about $32,000 extra, despite getting the first two years free (including books) at CC. It so sucks! My school also didn't offer AP whatsoever, so I hadn't any choice.",
      "author": "Jokers_Harley",
      "created": 1609157276,
      "upvotes": 1,
      "replies": {}
    },
    "gha5761": {
      "link": "/r/college/comments/klbczn/community_college/gha5761/",
      "text": "Community college (or at least the couple I looked into) aren’t significantly cheaper than regular university where I live (Canada). I think it was only around $3000 difference and one was actually more expensive than university. There would also be the hassle of transferring into an accredited university after the community college program, which tends to be quite competitive.\n\nI do wish I took more AP courses in high school because it would have been nice to get my English requirement out of the way, but I just didn’t know about it when I was in high school",
      "author": "Queenstaysqueen",
      "created": 1609156292,
      "upvotes": 1,
      "replies": {}
    },
    "gha0fve": {
      "link": "/r/college/comments/klbczn/community_college/gha0fve/",
      "text": "In my experience, AP classes are overwhelming, and not at all like any college classes I have taken. The amount of homework given in a lot of these classes (at least at my school) is too much for some people. As for going to a four-year over community college, living on campus may help a lot with drive and motivation, and the social scene is generally better. Also, if you don't have a car or a consistent ride and you have difficulty learning online then you're kind of fucked if you have to travel to and from a community college every day.",
      "author": "FujisakiChihiro",
      "created": 1609151232,
      "upvotes": 1,
      "replies": {}
    },
    "gh9xq1p": {
      "link": "/r/college/comments/klbczn/community_college/gh9xq1p/",
      "text": "at my high school graduation an old family friend of my dad’s asked me what my plans where and i said “oh i’m going to *insert community college name here*” and he looked at me and replied “oh! yeah... nothing wrong with that...” and that’s when it hit me that people actually think that community colleges are “bad” or are for “lazy people”",
      "author": "kidretro_",
      "created": 1609148247,
      "upvotes": 1,
      "replies": {}
    },
    "gh9v1n1": {
      "link": "/r/college/comments/klbczn/community_college/gh9v1n1/",
      "text": "It is definitely the college experience !! Before covid, now truly ehh idk",
      "author": "srewwz",
      "created": 1609145348,
      "upvotes": 2,
      "replies": {}
    },
    "gh9rmud": {
      "link": "/r/college/comments/klbczn/community_college/gh9rmud/",
      "text": "I mean like college in general, community college isn’t for everyone. First to a reasonable extent prestige of the college you do attend does matter for many things that people want to go into. Second there is obviously a stigma attached that shouldn’t be there. Third the social setting, environment, and general scene is not for everyone. As for the question of why more people aren’t taking college or AP classes in high school the answer is a lot of people aren’t capable or motivated enough to do them. Not everyone has the capacity to do tougher extra courses beyond schoolwork. On the other hand AP/IB classes are indeed very common among high performing high school students who aspire for the countries top 80ish colleges. So there are a reasonable amount of people taking APs.",
      "author": "VTDMAN7",
      "created": 1609141797,
      "upvotes": 2,
      "replies": {}
    },
    "gh9rfdm": {
      "link": "/r/college/comments/klbczn/community_college/gh9rfdm/",
      "text": "[deleted]",
      "author": null,
      "created": 1609141590,
      "upvotes": -1,
      "replies": {}
    },
    "gh9qrzi": {
      "link": "/r/college/comments/klbczn/community_college/gh9qrzi/",
      "text": "I think from the pandemic a lot of people are starting to realize that prestige shouldn't matter when it comes to a college. Taking Physics 101 from Harvard vs. Physics 101 from a CC roughly covers pretty much the same material and even the same txtbk. And now that classes have been online for almost a year, we realize how all the things we pay for an elite school doesn't matter. It's like we're paying for a \"Brand\" to put on our resume. But more and more employers now days do not care where you went to school. Your education is what you make of it and shouldn't matter whether you went to a CC or prestigious 4 year uni. Online classes aren't ideal now and I'm sure every college student no matter what school they attended are in the same boat now (no clubs , sports, social events within the school). \n\nI feel bad for the kids that paid so much for school only just to do it for home this year. But I definitely think CC needs less stigma and can offer a quality education, less competition/pressure, and individual attention from professors.\n\nAP/IB classes aren't available in all high schools especially in lower income communities. My town, for instance, didn't offer IB. Administering & taking AP exams are expensive and that's how the CollegeBoard makes its money.  \n\nFrom my experience taking many, I can say that AP classes also are very difficult and require a lot of time, effort, and homework so not all students can achieve that. Especially in a school day where you have about 8-9 periods in a day. I missed out on prom or doing things like homecoming or learning to drive or didn't really hang out with friends ever outside of school. \n\nAlso, the fact that the one test for the individual subject is the determining factor in whether you get credit or not, which is typically 3-5 score. That can place a lot of pressure into students especially those who have performance and test anxiety.",
      "author": null,
      "created": 1609140951,
      "upvotes": 3,
      "replies": {}
    },
    "gh9qk2p": {
      "link": "/r/college/comments/klbczn/community_college/gh9qk2p/",
      "text": "I am so happy I went to community college. I took my time and worked before transferring and as someone with ADHD and extremely low funds, it was a great choice. I have some friends who aren’t my friends anymore who told me that I wasn’t going to “real college”, but I had some great professors and made lifelong friends.",
      "author": "pikachusbooty",
      "created": 1609140732,
      "upvotes": 3,
      "replies": {}
    },
    "gh9pndj": {
      "link": "/r/college/comments/klbczn/community_college/gh9pndj/",
      "text": "CCs are underrated. Definitely a great choice depending on your situation. Finances are tough and nobody should really have to stomach 4-5 years of so much debt just to graduate. This is as close to “free education” that we have in the U.S. All highschool students should be encouraged to take advantage of it and so should any and all students considering in getting their associates/vocational training/ ability to transfer out/ etc. Especially in California where I’m the system is completely streamlined to maximize units, lessen time, decrease costs, and have guaranteed admission to various CSU and UC campuses via Associates for Transfer or UC TAP. I have friends who transferred to USC, Berkeley, UCLA, Cornell,and all these other top schools from attending a CC. You can quite literally attend the best schools in the nation by starting at a CC and performing well while completing the required coursework.",
      "author": "kdrdr3amz",
      "created": 1609139864,
      "upvotes": 3,
      "replies": {}
    },
    "gh9p0wo": {
      "link": "/r/college/comments/klbczn/community_college/gh9p0wo/",
      "text": "I will bite since I’m in the same boat. I went to CC to do all of my Pre Reqs for a Nursing programme offered at my local uni. I guess I could’ve just gotten my ADN but I wanted my BSN. I think having a bachelors degree of any kind opens a lot of doors. I lowkey want to be an NP one day or go to dental school... So, no matter how you cut it, I’m still gonna need a bachelors degree. I’ve been lucky enough to get scholarships so I’m only paying about 10k for my bachelors degree instead of nearly 40k. I’m at uni now, but I really miss the quality of academics at my CC. The quality of academics at my uni is abysmal.\n\nEdit: A couple of things. There is still a stigma surrounding CC for sure. I wish that stigma would be dissolved... Also, I stayed home. That helped with my student loan debt. Lastly, I’m a huge supporter of AP stuff and like CLEP exams or ALEKS exams if you guys have those available to you! They really help you save money and you won’t waste too much time in a class you already understand the central concepts of.",
      "author": "bpwk07",
      "created": 1609139281,
      "upvotes": 2,
      "replies": {}
    },
    "gh9lwpa": {
      "link": "/r/college/comments/klbczn/community_college/gh9lwpa/",
      "text": "I honestly wish I went to CC before university. I would've saved myself so much time, money, and stress. Plus having taken summer courses at CC, the teachers there are way better to me than university teachers.",
      "author": "lowkeyproducer",
      "created": 1609136585,
      "upvotes": 2,
      "replies": {}
    },
    "gh9kfyt": {
      "link": "/r/college/comments/klbczn/community_college/gh9kfyt/",
      "text": "I’m lucky in that I got away with a year of state uni paid (OSU), however when it came time to realize how was I gonna pay rent/tuition after the dorms I was faced with either go into huge amounts of debt for an undecided major or move back home for free and check out CC. I originally wanted to go to to uni for the college experience however I hated it. I got unlucky and placed in the international building, despite the many cool people and cultures I experienced it was not at all what my other friends were experiencing in their dorms.\nI have one term left now at CC, and already have an ok job lined up that I got with the assistance of my advisors who fucking rock!! They sent out opportunities for internships and jobs all the time and met with us each term to check up. CC is also so much easier for changing your major with little penalty financially. Literally even just taking one class in a topic your interested in can help you decide if you want to persue it or not, and at Oregon State it was costly and you would have to change advisors or colleges to take classes outside your major. CC? So easy. My two years hear have cost as much as one term with housing. Since moving home and going to CC I was able to easily get a part time job and move out in a fairly large city, pay rent and utilities, get 3 years of work experience. \nI’d highly recommend community college first if you think a dorm experience isn’t for you, you meet a broader group of people, your peers are usually there for a reason and taking it semi seriously. It’s good. Also trades, two years in Electrical or welding or whatever and you will be making bank and coming out with way less debt. The stigma attached to CC is just bogus, and anyone who judges them or students from there as less, are dicks.",
      "author": "legallyderp23",
      "created": 1609135412,
      "upvotes": 3,
      "replies": {}
    },
    "gh9huf0": {
      "link": "/r/college/comments/klbczn/community_college/gh9huf0/",
      "text": "Cc is great! I personally did dual enrollment my senior year and love it. I try to recommend it to everyone younger than me in my in my family. I would say one (good) reason that people take ap classes because they are applying to high tier colleges w low acceptance rates and a high weighted gpa is important, or to be competitive enough in that school. But unless you’re trying to get into a really really good school I would recommend doing dual if you can still, or if you aren’t as likely to get into or go to a elite college. I personally am currently attending a public state college because I was really excited for my classes in my major and I really wanted to move away from home. But I’m home remote bc of covid and I’m lucky enough to have a merit scholarship and financial aid to make my tuition and fees either comparable or less than what cc would be so I’m still attending there. I’m also meeting a bunch of ppl and getting involved in my school. But cc is def a great option esp dual enrollment and def is great quality at least at the one I went to!",
      "author": "tollersis",
      "created": 1609133482,
      "upvotes": 1,
      "replies": {}
    },
    "gh9hpgv": {
      "link": "/r/college/comments/klbczn/community_college/gh9hpgv/",
      "text": "I attended CC and loved it, but as for AP classes- I and many others in my school couldn’t afford to take them for credit. I enrolled in AP but never got anything to show for it because my family couldn’t pay the astronomical fees",
      "author": "SerotonRin",
      "created": 1609133384,
      "upvotes": 2,
      "replies": {}
    },
    "gh9dtq1": {
      "link": "/r/college/comments/klbczn/community_college/gh9dtq1/",
      "text": "This!!!\n\nCommunity colleges do not provide you with a lesser of an education than a 4 year University. In every college, the first 2 years are you gen ed classes and your prereqs. Maybe the 4 year will teach those subjects at a higher standard. However, they are still the same classes and those pre req classes do not matter as much as the higher level classes. Frankly, a 4 year is only good for the high level major classes. Those are the classes that matter not the pre reqs. You can come from a community college and transfer to Harvard and still be at the same level as someone who took pre reqs at a 4 year.\n\nAlso, dual enrollment is way better than an AP class because you are learning from teachers who are specialized in teaching college level classes rather than a High School teacher. Especially right now it's easy to do dual enrollment if your classes are online.",
      "author": "Khum__Dahn",
      "created": 1609130731,
      "upvotes": 5,
      "replies": {}
    },
    "gh9b3m6": {
      "link": "/r/college/comments/klbczn/community_college/gh9b3m6/",
      "text": "Though I believe Community College is the best route and has many many many benefits, I didn’t spend hundreds upon thousands of hours grinding out AP class after AP class. Even though I know I’m being stream-rolled out of money I could be saving, the thought that my hard work being paid off gives me a little bit a joy... a little bit.",
      "author": "_ystem_",
      "created": 1609129000,
      "upvotes": -1,
      "replies": {}
    },
    "gh9b1ie": {
      "link": "/r/college/comments/klbczn/community_college/gh9b1ie/",
      "text": "I went straight to a university because Personally I knew what I wanted to do (programming and mathematics). I wanted to go to a place with great researchers, great professors, great peers, and a big campus. I have no regrets going straight to a university.",
      "author": null,
      "created": 1609128964,
      "upvotes": -1,
      "replies": {}
    },
    "gh9aoup": {
      "link": "/r/college/comments/klbczn/community_college/gh9aoup/",
      "text": "I attended community college for roughly 3 years, and transferred to a university with a 4.0 GPA and 80 credits under my belt for computer science. I was never a good student in HS, but when starting college I promised to get my act together and work as hard as I could. I managed to become a mathematics tutor at the college's tutoring center on top of my classwork. With financial aid, I paid $0 for all of that time. The only reason I could see why people would be against this would be for the lack of social life, my CC didn't have a lot of clubs or a lively student body, but I didn't really care, and most people don't. Some people think CC deprived people of the \"true college experience\" but in my opinion I'd rather graduate with 0 debt and a peaceful financial state of mind.",
      "author": null,
      "created": 1609128749,
      "upvotes": 2,
      "replies": {}
    },
    "gh9a59t": {
      "link": "/r/college/comments/klbczn/community_college/gh9a59t/",
      "text": "My school didn’t actually offer AP courses at all. None whatsoever.",
      "author": "RogueApollo01",
      "created": 1609128429,
      "upvotes": 1,
      "replies": {
        "gh9eaf4": {
          "link": "/r/college/comments/klbczn/community_college/gh9eaf4/",
          "text": "Did they offer dual enrollment?",
          "author": "Khum__Dahn",
          "created": 1609131031,
          "upvotes": 1,
          "replies": {
            "gh9fm5f": {
              "link": "/r/college/comments/klbczn/community_college/gh9fm5f/",
              "text": "Nope! My high school didn’t have any kind of program to help out folks going from HS to college in any way, shape, or form.",
              "author": "RogueApollo01",
              "created": 1609131918,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh99zp6": {
      "link": "/r/college/comments/klbczn/community_college/gh99zp6/",
      "text": "Community College can be a great option, however I would be wary of recommending it to EVERYONE. I know plenty of people who got screwed by attempting to do \"engineering\" at CC, only to be incredibly behind/not have classes transferred. I've heard similar stories with pre med, with many community colleges not teaching organic chemistry.\n\nI will say however that there are certainly viable and effective options for engineering/pre med at CC, but I can't stress enough how important it is to research what is the best 2 year program. Don't just go to the nearest community College as you might get screwed.",
      "author": "e_expert",
      "created": 1609128338,
      "upvotes": 1,
      "replies": {}
    },
    "gh997rl": {
      "link": "/r/college/comments/klbczn/community_college/gh997rl/",
      "text": "Many people few community college as the cruder option for the dumber/lazier people. My own family members had this stigma as well, but quickly changed their tune after seeing the money I saved while receiving the same education by going there for two years.\n\nHowever, i wish I went straight to a four year college, because the one I am attending allows for people in my major to graduate in three years rather than four, but since I transferred, I have to spend two whole years here (four years total)",
      "author": "Emily588",
      "created": 1609127888,
      "upvotes": 1,
      "replies": {}
    },
    "gh996u7": {
      "link": "/r/college/comments/klbczn/community_college/gh996u7/",
      "text": "AP classes were a bitch in HS but proved worth it",
      "author": "5krishnan",
      "created": 1609127873,
      "upvotes": 1,
      "replies": {}
    },
    "gh98m84": {
      "link": "/r/college/comments/klbczn/community_college/gh98m84/",
      "text": "1. Sometimes credits don’t transfer 2. Social life just isn’t the same when compared to uni 3. It felt like high school 2.0 (literally just busywork)",
      "author": "U_Sam",
      "created": 1609127539,
      "upvotes": -1,
      "replies": {}
    },
    "gh97ptc": {
      "link": "/r/college/comments/klbczn/community_college/gh97ptc/",
      "text": "To be completely honest, my personal reasons were not at all related to academics. I went to a school 2 hours away so that I wouldn't have to live at home in a toxic family situation any longer. I also chose a school close enough that i could travel back & forth in case of emergency & to not abandon the few who aren't toxic in my family.",
      "author": "Austin1173",
      "created": 1609127035,
      "upvotes": 1,
      "replies": {}
    },
    "gh97ev8": {
      "link": "/r/college/comments/klbczn/community_college/gh97ev8/",
      "text": "Honestly not to be dramatic but I think I would’ve committed suicide had I not moved away to university. Making new friends and meeting more diverse people (especially as POC who came from a white suburb into a really diverse university) really allowed me to open my mind in ways I don’t think my local CC could, and I honestly just had a lot of trauma. Being independent without being properly prepared can really damage someone but for me it was almost needed in a way. I’ve made so many memories and grown so much anyways that I would not exchange it for anything else.",
      "author": "flanadelrey",
      "created": 1609126871,
      "upvotes": 1,
      "replies": {}
    },
    "gh96hd4": {
      "link": "/r/college/comments/klbczn/community_college/gh96hd4/",
      "text": "Some get full rides to prestigious schools, so instead of paying for 2 years of community college they get 4 years free at a top college with free room, board, and food included all four years. You’ve got to be really perfect in high school to get a full ride scholarship for all four years though. Also, you can still party and get drunk and do stupid things if you go to community college and then transfer 2 years later at age 20 to a 4 year university and graduate at 22 like you do if you go from high school straight to 4 year.",
      "author": "GetYourselfAHapa",
      "created": 1609126373,
      "upvotes": 1,
      "replies": {}
    },
    "gh968sm": {
      "link": "/r/college/comments/klbczn/community_college/gh968sm/",
      "text": "For me it was the cost. Because of my address, we don’t pay taxes on the local community college, despite it being right up the street. I would be paying out of district tuition (~$5K a semester) which is the same as tuition at a 4 year public college. I figured I would rather pay that tuition at a 4 year school and get the experience than live at home and pay all that money for little to no resources- compared to a big 4 year university. I also had 21 hours of AP credit from high school- pretty much knocked out a lot of my basic general Ed classes, allowing me to start my major specific classes my first semester. Also graduated in 3 and a half years, so I saved a semester of tuition. I took a class at a community college in my college town and it was cheaper than taking it in my hometown, despite me being out of district for both.\n\n\nIf my community college would’ve been cheaper I probably would’ve gone and taken some classes then transferred. I don’t regret my decision at all- I wish people realized there are more reasons people don’t go to community college.",
      "author": "suprstar16",
      "created": 1609126246,
      "upvotes": 1,
      "replies": {}
    },
    "gh94ybp": {
      "link": "/r/college/comments/klbczn/community_college/gh94ybp/",
      "text": "I started at a CC in 2017 and a lot of people and I haven’t been able to attend an in person university because of COVID. It makes me sad that I’ll probably never step place in the university I really wanted to attend thru CC :(",
      "author": "FormerBath",
      "created": 1609125566,
      "upvotes": 1,
      "replies": {}
    },
    "gh94s5t": {
      "link": "/r/college/comments/klbczn/community_college/gh94s5t/",
      "text": "I'm a nursing BSN major at a 4 year and I'm just gonna say that for me, a 4 year was absolutely worth it for the social scene. I truly hate my town and toxic relatives, I had enough money in scholarships and grants, and living away from my parents and having an apartment allowed me to be more independent. I truly think for some, moving away to college can be a fresh slate. Also, another big factor is that I don't drive LOL so living on campus was extremely convenient.  I do think CC is a completely valid choice for many people, it just was not what I wanted.",
      "author": "basicbiatch",
      "created": 1609125474,
      "upvotes": 1,
      "replies": {}
    },
    "gh92lzj": {
      "link": "/r/college/comments/klbczn/community_college/gh92lzj/",
      "text": "My freshman year of high school I had just moved to a new city so I slacked a lot in favor of making friends, talking to girls, and generally being a stupid teenager. My sophomore year for nearly 3/4 of the school year we had a strike and you literally did not have to attend class. While I finished strong the last 2 1/4 years of HS my GPA was still in bad shape.       \n       \nSo I decided to go to CC, save some money *and* if I should get a good enough GPA to transfer to my university of choice seeing as I didn't meet the HS admission requirements.       \n      \nThat was one of the bigger misteps of my life. I found myself incredibly bored and distracted. I was 10 minutes from where I went to HS, in class and surrounded by far too many people I went to HS with. While my close friends were off having new experiences and living college life the way you imagine it to be. I regularly found myself making trips out to their universities and neglecting my responsibilities at home. It didn't take long for me to drop out due to falling behind, and very little changed about my life as a result. I didn't have to move home because I never left, I just picked up more hours at work the following semester.       \n     \nThis is not to discredit what CC offers because a few years later I returned and now I'm about to be transferring to my university of choice as a junior following this semester. It is more so a warning to those considering this option that if you desire the traditional college experience don't discount that. It can be worth the increased cost, or going to your second choice. I personally would have benefited from being in the mess of it all and having college life as a motivator to staying focused and not needing to make an entire week or weekend of living the typical life of a 18-20 yo.",
      "author": "EyePlayFantasy",
      "created": 1609124324,
      "upvotes": 2,
      "replies": {}
    },
    "gh92i2l": {
      "link": "/r/college/comments/klbczn/community_college/gh92i2l/",
      "text": "You lose a lot of the college experience going to a CC. Independence, parties, dorms, etc. are huge parts of college that you don’t get at a CC. CCs also don’t have the same opportunities and resources to offer as universities. I did my first 2 years at a CC and while I saved some money, I really wish I’d done all 4 years at my university.",
      "author": "robertsmiths",
      "created": 1609124266,
      "upvotes": -1,
      "replies": {
        "gh9rk3a": {
          "link": "/r/college/comments/klbczn/community_college/gh9rk3a/",
          "text": "Depends on how important that college experience is to someone. For me I didn’t really care about it and still don’t. After I transfer I have 2 years to do just that. It’s not like the parties, dorming, independence suddenly disappears once you become a junior lol",
          "author": "kdrdr3amz",
          "created": 1609141719,
          "upvotes": 2,
          "replies": {
            "gh9sb5t": {
              "link": "/r/college/comments/klbczn/community_college/gh9sb5t/",
              "text": "Yeah I get that, but 2 years goes by pretty fast. Plus that’s 2 years of missing out on research opportunities, internships, and other stuff that you don’t get at a CC.",
              "author": "robertsmiths",
              "created": 1609142481,
              "upvotes": -2,
              "replies": {
                "ghbi41l": {
                  "link": "/r/college/comments/klbczn/community_college/ghbi41l/",
                  "text": "That’s a huge lie. Where did you get this info from? I’m not sure how it is for other majors but here we have MESA for stem majors and theres definitely a lot of opportunities when it comes to internships, research, etc. (I got an internship at nasa via my community college) and have had friends who got research opportunities at schools like USC while at a CC so your claim is false. Nice assumption btw",
                  "author": "kdrdr3amz",
                  "created": 1609185889,
                  "upvotes": 0,
                  "replies": {
                    "ghbidpz": {
                      "link": "/r/college/comments/klbczn/community_college/ghbidpz/",
                      "text": "Jesus Christ man, calm down. Not everyone is a STEM major.",
                      "author": "robertsmiths",
                      "created": 1609186017,
                      "upvotes": 2,
                      "replies": {
                        "ghbp68z": {
                          "link": "/r/college/comments/klbczn/community_college/ghbp68z/",
                          "text": "Again like I said I don’t know how it is for other majors. I’m only explaining how it is for me Jesus Christ dude can’t you read?",
                          "author": "kdrdr3amz",
                          "created": 1609189511,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh92bgy": {
      "link": "/r/college/comments/klbczn/community_college/gh92bgy/",
      "text": "My 4 yr college offered me more money than my local CCs did. Plus I already had a semester of college credit through one of them, so if I stayed at the same cc after completing high school, my life would’ve felt even more stagnant than it already does by deciding to complete a 4 yr degree. Also wasn’t a good option for my desired field, and networking is vital for it",
      "author": "computing-depressed",
      "created": 1609124166,
      "upvotes": 1,
      "replies": {}
    },
    "gh91jgx": {
      "link": "/r/college/comments/klbczn/community_college/gh91jgx/",
      "text": "I've been wondering this, too. I think it's an ego thing because of the stigma of CCs. They're associated with low socioeconomic status. But that doesn't make them necessarily bad. I \"teacher shop\" at my CC, and so I've had stellar, top-notch instructors. CCs are an affordable way of racking up lots of credits.",
      "author": "turquoiseblues",
      "created": 1609123740,
      "upvotes": 2,
      "replies": {}
    },
    "gh913uf": {
      "link": "/r/college/comments/klbczn/community_college/gh913uf/",
      "text": "Eh, it's complicated. I didn't have much access to AP and CC courses in high school. Because I can afford 4 years of college, I'm glad I have this time to find myself. I have friends graduating this year at 19 years old who emotionally aren't ready to be done with college.",
      "author": "byorderofthe",
      "created": 1609123501,
      "upvotes": 1,
      "replies": {}
    },
    "gh90ojc": {
      "link": "/r/college/comments/klbczn/community_college/gh90ojc/",
      "text": "Classism, plain and simple",
      "author": "dumpsterfiresaint",
      "created": 1609123273,
      "upvotes": 0,
      "replies": {}
    },
    "gh8z76k": {
      "link": "/r/college/comments/klbczn/community_college/gh8z76k/",
      "text": "for real. I attend cc because I’m not rich, not because I’m lazy",
      "author": "Amxricaa",
      "created": 1609122506,
      "upvotes": 5,
      "replies": {
        "gh9rgjg": {
          "link": "/r/college/comments/klbczn/community_college/gh9rgjg/",
          "text": "Yup, we all don’t have the privilege of mommy and daddy money paying for our tuition. So we have to be intelligent with how we manage our future debt and finances. Some of us are first gen students, low income, etc.",
          "author": "kdrdr3amz",
          "created": 1609141622,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gh8ykj5": {
      "link": "/r/college/comments/klbczn/community_college/gh8ykj5/",
      "text": "Community college student here. I just recieved my associates and plan to transfer to a D1 university. During my three years there, i could tell why people generally looked upon students who attend CC. A good handful of my classmates were unmotivated and not the brightest. Not to mention the transfer rate at my CC was 15%. Generally, a majority of my classes were quite easy and the professors didn't much care what they were teaching. Also, a good chunk of my CC credits didn't even transfer to a university. CC does have quite the stigma of being a place for dumb or lazy students but it is a viable option for people lacking financial assistance or to knock of gen-ed classes at a faster pace.",
      "author": "ReadyCarpet1",
      "created": 1609122191,
      "upvotes": 1,
      "replies": {}
    },
    "gh8x48u": {
      "link": "/r/college/comments/klbczn/community_college/gh8x48u/",
      "text": "I actually went to the big state university (Utah) for a semester. I was commuting from home via my city's transit system. I was working to afford it all too. It was stressful and lonely with spending 2hrs daily in commute.\n\nI took a semester off, worked on my mental health and transferred down to Salt Lake community College. Best choice ever. The pandemic stuff aside, it's helped with making friends and getting to narrow down on my major since everyone else works and is busy.\n\nAnd college with least covid cases because no one lives in dorms!",
      "author": "Adadave",
      "created": 1609121433,
      "upvotes": 2,
      "replies": {}
    },
    "gh8ukmh": {
      "link": "/r/college/comments/klbczn/community_college/gh8ukmh/",
      "text": "Not going to community college right out of high school was one of the worst decisions of my life. I dropped out of uni because I wasn't ready and I had a lot of out of school responsibilities.",
      "author": "NewCenturyNarratives",
      "created": 1609120089,
      "upvotes": 8,
      "replies": {}
    },
    "gh8ufhp": {
      "link": "/r/college/comments/klbczn/community_college/gh8ufhp/",
      "text": "Also a cc degree in a trade is way better for some people than a four year and 80 grand most community collage two year courses is under 25 grand.",
      "author": "ampjk",
      "created": 1609120016,
      "upvotes": 2,
      "replies": {}
    },
    "gh8u0s0": {
      "link": "/r/college/comments/klbczn/community_college/gh8u0s0/",
      "text": "I went to a 4 year my first semester, realized I couldnt afford it so I went to CC the next semester and started studying nursing. Now I’m going to graduate in May, take the NCLEX and become an RN! There’s nothing wrong with community college and its a quality education at a fraction of the price, and while I’ll likely further my education at another time I can tell you the class quality was the exact same as it was at the 4 year I attended. I got a lot of shit for it from people until about a year ago when the nursing program got some award bc of their stats. To anyone thinking of going, I’m leaving college with job security in a well-paying field with only $20k of student debt compared to the $64k I would have paid at the 4 year public college. It’s not for lazy people; I really couldn’t tell you why people think it is!",
      "author": "itholdmanyloop",
      "created": 1609119800,
      "upvotes": 7,
      "replies": {
        "gh9qdd7": {
          "link": "/r/college/comments/klbczn/community_college/gh9qdd7/",
          "text": "Because people like to put people in boxes and generalize situations without knowing all the details. When in reality everybody I’ve spoken to about CCs only know the generalizations, the stereotypes. They have no evidence to their claims, no logic or reasoning to explain their thinking.",
          "author": "kdrdr3amz",
          "created": 1609140557,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh8texx": {
      "link": "/r/college/comments/klbczn/community_college/gh8texx/",
      "text": "There is stigma associated with CC. People may assume you did not do well in high school. Some people did well in high school but want to have an easier transition to college. \n\nMost people live at home when they go to a CC and for some people they would rather be off on their own at this point. I can understand this very well, I chose CC and it has been great but home life has become increasingly stressful. If I knew it would end up like that I may have chose a UC. Even though I love the low tuition costs and avoidance of debt. \n\nThere are cons to CC and it is not for everyone. \nFor example:\n- people with stressful home lives\n-people who want to be independent\n-people who want to have the “college experience” and live in a dorm. \n-people who have full rides or plenty of scholarships making a 4 yr university a more logical choice. \n- people who know what they want to do as a career already\n- also people who have the $ taken care of and can afford a 4 year without loans, who may already know what the want to do. \n- people who want to graduate early\n\nMy personal cons to CC:\n- You cannot take intro to upper level classes. For example I want to do Neuroscience but there is no “intro to neuroscience” course I can take at my CC to determine if the workload and subject matter is something I want to stick with. Unlike at a 4 year school this class may be an option for people. \n- Also doing undergrad research can be difficult because there are fewer opportunities because most students don’t do research at CC. \n- You don’t have the strong community feeling at a CC like a 4 year. It is harder to make friends because some don’t stay very long, many work, some are just there to switch careers and don’t want to meet new people. Also, when you transfer it can be hard to integrate into the campus and you have less time to make solid friendships. This does kind of suck because college friendships for some last a long time and you may come out of college with fewer strong friendships than someone at a 4 yr the whole time. It is harder to make friends but is not impossible, it just takes more effort on your part. \n- you also have to do college apps while doing your college classes and for some that will be harder than completing them senior year of HS so something to keep in mind. \n- not every school accepts many transfers so you may be “out of luck” for some schools. May depend on which year you are transferring into though - transferring into junior yr is a lot easier than earlier years.  \n\nI think everyone knows the pros about CC so I won’t mention them here. (I listed cons - don’t assume that I dislike CC. I like it more than I dislike it - I’m just answering OP’s question).",
      "author": "QuickEquivalent0",
      "created": 1609119475,
      "upvotes": 2,
      "replies": {
        "gh9qh61": {
          "link": "/r/college/comments/klbczn/community_college/gh9qh61/",
          "text": "[deleted]",
          "author": null,
          "created": 1609140656,
          "upvotes": 1,
          "replies": {
            "gh9ypw0": {
              "link": "/r/college/comments/klbczn/community_college/gh9ypw0/",
              "text": "Yes you are totally right - I don’t expect any CC to have those classes. It is just an added benefit one may have if they go to a 4 yr. It isn’t really that big of a reason but it is something I have thought about - once I transfer I can’t change my major, it would be nice to have an opportunity like that but a lot of schools don’t which I totally understand. A lot of people probably can’t relate to that reason 😂 but I added it anyways",
              "author": "QuickEquivalent0",
              "created": 1609149341,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh8sy4q": {
      "link": "/r/college/comments/klbczn/community_college/gh8sy4q/",
      "text": "Coaches and mentors in high school told me it was a bad idea to go to community college. It was better for me to go to a university or 4 year college.",
      "author": "GodBasedHomie",
      "created": 1609119218,
      "upvotes": 1,
      "replies": {}
    },
    "gh8rhhj": {
      "link": "/r/college/comments/klbczn/community_college/gh8rhhj/",
      "text": "My personal experience with this is seeing a lot of kids wanting to escape their hometowns or get that independent life that their parents never allowed them, so they attend 4 year unis. I totally agree with you that CC is the way to go, but just like a 4 year uni wasn't for me, a CC might not be for someone as well.",
      "author": "petrifiedlemon",
      "created": 1609118419,
      "upvotes": 5,
      "replies": {}
    },
    "gh8qj3q": {
      "link": "/r/college/comments/klbczn/community_college/gh8qj3q/",
      "text": "TBF I had a really crappy time at CC, and that’s my personal opinion based on my experience. \n\nI went for a year before university and dont like to reflect back on that time. Went to a decent CC. The quality of education was noticeably different, CC professors approached students and learning a lot like it was still high school. Learned some, but not as much as I did in university. But for me it was still copying notes off a slide as the lectures from my profs were really lacking. Not to mention the academic advisors seemed jaded. Nobody was interested in being friends, it was damn near impossible since nobody hung out on campus and most students weren’t interested and wanted to leave and go home after classes. \n\nYeah, I’m glad community college was there, my GPA in high school was terrible & I brought it to a 4.0 in CC, and it allowed me to attend a good uni. also shaved off some of the debt I would’ve had otherwise. Cost effective, yes. Fun and rewarding experience? Not at all. It was quite depressing. Wouldn’t trade my uni experience and friends for the world. Social scene and the overall network of people and profs are top notch in uni.",
      "author": null,
      "created": 1609117902,
      "upvotes": 1,
      "replies": {}
    },
    "gh8ovu2": {
      "link": "/r/college/comments/klbczn/community_college/gh8ovu2/",
      "text": "Most people just don't want to do the extra work it takes for AP and college classes in high school (plus they can be expensive). My dad works at a college nearby, so my brother and I were fortunate enough to take college classes starting junior year of high school, and got some credits out of the way for free. Also, my dad was up our asses about how we at least needed to take one college class every semester at that school. My credits transferred as both high school and college credit, so I could graduate a year early, and my brother who is opting for the traditional four years in high school will have about a semester of gen ed classes out of the way by the time he graduates. Seriously people TAKE COLLEGE CLASSES IN HIGH SCHOOL IF YOU CAN, IT'S TOTALLY WORTH IT.",
      "author": "Paesana",
      "created": 1609116998,
      "upvotes": 1,
      "replies": {}
    },
    "gh8o2gc": {
      "link": "/r/college/comments/klbczn/community_college/gh8o2gc/",
      "text": "cuz a university degree has clout, CC has no drip",
      "author": "grubbycoolo",
      "created": 1609116551,
      "upvotes": -5,
      "replies": {}
    },
    "gh8mtil": {
      "link": "/r/college/comments/klbczn/community_college/gh8mtil/",
      "text": "Because if you attend a CC you have a less likely chance of going to graduate school. At least that is what I was told when I transferred from. C to college. I’ve been dealing with the stigma for a long time I have higher grades but I have community college dragging me down",
      "author": "WeGoatMail4U",
      "created": 1609115879,
      "upvotes": -2,
      "replies": {}
    },
    "gh8mthr": {
      "link": "/r/college/comments/klbczn/community_college/gh8mthr/",
      "text": "I couldn’t afford AP courses when I was in high school. The testing fee was $180 per class.\n\nI did go to a CC and it’s good because I got to have a career before going back to finish my BS.",
      "author": "kalmakayah",
      "created": 1609115878,
      "upvotes": 2,
      "replies": {}
    },
    "gh8m6dk": {
      "link": "/r/college/comments/klbczn/community_college/gh8m6dk/",
      "text": "I'm in community college right now, and I'm confident that it's better than 90% of universities out there. The teachers are caring, and they teach you the material well. The people are great. It's a wonderful environment. It's cheap. It's effective. I respect all of my professors. I'm fairly certain that whatever university I transfer to won't be as great as my community college is.",
      "author": "SquigglyHamster",
      "created": 1609115538,
      "upvotes": 6,
      "replies": {
        "gh9r27v": {
          "link": "/r/college/comments/klbczn/community_college/gh9r27v/",
          "text": "People definitely underestimate CCs. We literally have the same exact professors that university kids do. Well with the exception of maybe the top top schools in the world like Harvard (obviously). But amongst local universities they’re the same. 70% of the professors at my CC have PhDs lmao.",
          "author": "kdrdr3amz",
          "created": 1609141228,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh8loo4": {
      "link": "/r/college/comments/klbczn/community_college/gh8loo4/",
      "text": "I agree with many people in these comments that it’s probably mostly because of the stigma around community college. I went to CC for three years before transferring to a university to finish my degree. CC classes are way cheaper and usually much easier than university classes and while I do regret staying so long and trying to get my associates degree before moving on, I will never regret getting my basic classes out of the way at community college, and I encourage everyone I can to at least start out there.",
      "author": "mtn-cat",
      "created": 1609115283,
      "upvotes": 3,
      "replies": {}
    },
    "gh8lcs7": {
      "link": "/r/college/comments/klbczn/community_college/gh8lcs7/",
      "text": "I'm a sophomore at a community college. I constantly asked myself the same question going into my freshman year. Financially there are a ton of pros, especially because in terms of gen eds you're paying a fraction of the cost for the same content taught at a four year institution. But I've come to understand why many people don't consider it as an option.\n\nThe student services at my college (counseling, bookstore, financial aid offices) are a hot mess and at times pretty much useless. Many of the professors simply don't care. The atmosphere is identical to that of high school. There are no networking/research/job search opportunities for many fields and there is only one course in the entire catalog that relates to the field I'm going into. I haven't been remotely interested in a single class I've taken. Making friends has been damn near impossible (though this might just be my own fault lol).\n\nOf course, I'm speaking on my behalf alone and my experiences are certainly not universal. There are many CC's in the country that none of the things I spoke about apply to, I'm sure. And I definitely don't regret attending, either, and I'm really thankful I got a large fraction of my education done at a (relatively) affordable cost. But at the same time, I'm transferring in fall of 2021 and to say I'm excited to move on from community college is an understatement.",
      "author": "solarsuplexus",
      "created": 1609115114,
      "upvotes": 3,
      "replies": {}
    },
    "gh8l1fc": {
      "link": "/r/college/comments/klbczn/community_college/gh8l1fc/",
      "text": "I attended a community college first then 4 year school.",
      "author": "favnh2011",
      "created": 1609114954,
      "upvotes": 2,
      "replies": {}
    },
    "gh8kwki": {
      "link": "/r/college/comments/klbczn/community_college/gh8kwki/",
      "text": "I attend a cc bc classes are cheaper and I also really want to avoid debt",
      "author": null,
      "created": 1609114884,
      "upvotes": 2,
      "replies": {}
    },
    "gh8kaa1": {
      "link": "/r/college/comments/klbczn/community_college/gh8kaa1/",
      "text": "I know some people get hefty scholarships to 4-yrs that they lose if they don't go there in the fall. My RA would have preferred to get his gen-eds out of the way at a CC, but he'd have been throwing away a 4-yr 50% tuition scholarship if he did, no option to defer. So he signed up to be an RA as soon as he was eligible and now he pays $0 for room and board (perk of being an RA) and only 50% of his tuition and books (scholarship). I don't know how many credits he takes, but for me that would be less than $3000 total per semester for a SINGLE on-campus dorm, meals and basics paid for (e.g TP, soap because the campus markets sell it), and 12 credits of classes. \n\nFor others, like myself, their homelife was/is bad and since community colleges don't usually have on campus housing, there's usually at least one community college per county (often with multiple campuses in larger counties), and the housing market is difficult to jump into at 18 with a min-wage job and no credit/renting history, the dorms of a 4-yr is the often only palatable option they have to get away.",
      "author": "therealmegluvsu",
      "created": 1609114558,
      "upvotes": 8,
      "replies": {
        "gh90e23": {
          "link": "/r/college/comments/klbczn/community_college/gh90e23/",
          "text": "This right here is the answer if you qualify for scholarships. There are very few scholarships for transfer students as compared to traditional first-year students. A CC might be cheaper, but not if you’re giving up a large multi-year scholarship with much reduced chances of any scholarship after you transfer as a rising junior back to the 4-year university.",
          "author": "HeyTherePlato",
          "created": 1609123122,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh8k2ex": {
      "link": "/r/college/comments/klbczn/community_college/gh8k2ex/",
      "text": ">the only thing I had to pay for was books\n\nNot for me. I had to pay every single penny for classes, whether it was paid for my current cash or from loans.\n\nIt also caused me to spend longer at the 4 year. Because I had all the gen eds done, I had nothing to fill in when all my other classes had scheduling conflicts or filled up on day 1. Because of that, I may as well have just gone to the 4 year for only a little bit more in the end.",
      "author": "OoglieBooglie93",
      "created": 1609114444,
      "upvotes": 2,
      "replies": {}
    },
    "gh8j2ba": {
      "link": "/r/college/comments/klbczn/community_college/gh8j2ba/",
      "text": "So one reason that could be a negative that I didn’t hear about before is the fact that on average it’ll take another year for students to graduate, at least at my school, so it’ll be an over all of 5 years of college so you just end up saving 1 years worth of cost at my school",
      "author": "CGCSEE",
      "created": 1609113924,
      "upvotes": 1,
      "replies": {}
    },
    "gh8iy2q": {
      "link": "/r/college/comments/klbczn/community_college/gh8iy2q/",
      "text": "It’s not the same as attending a 4 year university.",
      "author": "FeistyHelicopter3687",
      "created": 1609113863,
      "upvotes": 1,
      "replies": {
        "gh8j403": {
          "link": "/r/college/comments/klbczn/community_college/gh8j403/",
          "text": "From what I’ve heard it wasn’t a great experience this year 😂",
          "author": "louisepesto",
          "created": 1609113949,
          "upvotes": 3,
          "replies": {
            "gh97nf4": {
              "link": "/r/college/comments/klbczn/community_college/gh97nf4/",
              "text": "I mean, I’d say most university students didn’t know a global pandemic was going to occur before they attended college lol. It’s the opposite for me, I wasn’t able to have the college experience I wanted because I attended CC for two years and COVID didn’t let me attend the uni I wanted in person :/",
              "author": "FormerBath",
              "created": 1609127000,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "gh9quad": {
          "link": "/r/college/comments/klbczn/community_college/gh9quad/",
          "text": "it’s not meant to be the same",
          "author": "kdrdr3amz",
          "created": 1609141012,
          "upvotes": 1,
          "replies": {
            "gha47cs": {
              "link": "/r/college/comments/klbczn/community_college/gha47cs/",
              "text": "It’s not the same, as in inferior. Is that clarification better?",
              "author": "FeistyHelicopter3687",
              "created": 1609155262,
              "upvotes": 1,
              "replies": {
                "ghbhqbi": {
                  "link": "/r/college/comments/klbczn/community_college/ghbhqbi/",
                  "text": "Inferior yikes. I found someone with a highly obvious superiority complex.",
                  "author": "kdrdr3amz",
                  "created": 1609185694,
                  "upvotes": 1,
                  "replies": {
                    "ghbie1m": {
                      "link": "/r/college/comments/klbczn/community_college/ghbie1m/",
                      "text": "Why doesn’t the UC system start at year 3?",
                      "author": "FeistyHelicopter3687",
                      "created": 1609186021,
                      "upvotes": 1,
                      "replies": {
                        "ghbp90v": {
                          "link": "/r/college/comments/klbczn/community_college/ghbp90v/",
                          "text": "What are you talking about?..",
                          "author": "kdrdr3amz",
                          "created": 1609189551,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh8iioa": {
      "link": "/r/college/comments/klbczn/community_college/gh8iioa/",
      "text": "Community college is really popular here because the major universities in my state set up a system that lets people easily transfer from CC to a 4 year university. I did that myself, and it’s ended up being a heck of a lot cheaper.",
      "author": "Vig_Big",
      "created": 1609113643,
      "upvotes": 9,
      "replies": {
        "gha0kwr": {
          "link": "/r/college/comments/klbczn/community_college/gha0kwr/",
          "text": "It's like that here in Virginia. I can't speak for myself, but I have a lot of friends who went to the local community college after they graduated with the intent to transfer to bigger four-years after a while.",
          "author": "FujisakiChihiro",
          "created": 1609151387,
          "upvotes": 3,
          "replies": {
            "gha0tbh": {
              "link": "/r/college/comments/klbczn/community_college/gha0tbh/",
              "text": "Yeah, it’s honestly great, you spend a tenth of what you’ll spend at a 4 year for Gen-Eds.",
              "author": "Vig_Big",
              "created": 1609151640,
              "upvotes": 4,
              "replies": {}
            },
            "ghajf6z": {
              "link": "/r/college/comments/klbczn/community_college/ghajf6z/",
              "text": "Yeah, I go to a CC right now I’m trying to get into UVA or maybe VTECH",
              "author": "Ajsnipedyou",
              "created": 1609167701,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gh9c34z": {
          "link": "/r/college/comments/klbczn/community_college/gh9c34z/",
          "text": "California?",
          "author": "turquoiseblues",
          "created": 1609129610,
          "upvotes": 1,
          "replies": {
            "gh9d1s9": {
              "link": "/r/college/comments/klbczn/community_college/gh9d1s9/",
              "text": "Nope, but California does it too, I think New Mexico as well.",
              "author": "Vig_Big",
              "created": 1609130222,
              "upvotes": 4,
              "replies": {}
            },
            "gh9qnm9": {
              "link": "/r/college/comments/klbczn/community_college/gh9qnm9/",
              "text": "Florida",
              "author": "matsudasociety",
              "created": 1609140831,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh8igaj": {
      "link": "/r/college/comments/klbczn/community_college/gh8igaj/",
      "text": "Not all degrees transfer well and/or have the opportunities you need at most community colleges.\n\nAs a music education major, I had to take classes for my major right away.  Had I started at a community college with the intent to transfer later, I would still have four years of music classes ahead of me after transferring.  Also, I would limit myself in regards to opportunities by not going to a bigger school.  I'm not even sure many community colleges would have even offered my major.  I cannot speak for other majors, but I doubt music is the only degree like this.  It would have been handy to have some gen ed's out of the way, but it wouldn't have saved me any money or helped me graduate sooner.",
      "author": "Vauldr",
      "created": 1609113610,
      "upvotes": 19,
      "replies": {
        "gh9em2l": {
          "link": "/r/college/comments/klbczn/community_college/gh9em2l/",
          "text": "This is a good point.  The local community college to me has several classes that are in the field in which I teach at the university.  However, only one of them counts towards the major if you transfer.  I've seen multiple cases in which students take all the classes offered there thinking they're getting a head start on the major only to find out upon transferring that we don't accept them.",
          "author": "TheKwongdzu",
          "created": 1609131247,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gh8hb7e": {
      "link": "/r/college/comments/klbczn/community_college/gh8hb7e/",
      "text": "I wanted to do gen ed in a community college, but I knew my parents were going to move soon. I was fresh out of high school and obviously couldn't afford to live on my own and community college credits aren't guaranteed to transfer out of state. If community college credits, and college credit overall, was standardized and transferable throughout the US, I would have done community college.",
      "author": "FurretsOotersMinks",
      "created": 1609113023,
      "upvotes": 3,
      "replies": {}
    },
    "gh8gsh4": {
      "link": "/r/college/comments/klbczn/community_college/gh8gsh4/",
      "text": "I think a lot of younger people REALLY want to immediately experience life away from home/their parents - which is totally understandable. They want to experience a new state, new friends, new everything. They would still get to do that if they transferred after CC, but sometimes people are desperate to do it ASAP, and want to do it at the same time as their friends. If I could have afforded it, I'd probably have done that too.",
      "author": "LettuceBeSkinnay",
      "created": 1609112755,
      "upvotes": 2,
      "replies": {}
    },
    "gh8gatx": {
      "link": "/r/college/comments/klbczn/community_college/gh8gatx/",
      "text": "For specific majors, community college isn't an option. I am in Aeronautical Engineering Technology, which means I will be graduation with an A&P liscnese and I will be working on military aircraft, then going on to be a pilot. Most of my classes were Aviation classes, with the other one being a math class. I am also in Air Force ROTC, which is a four year commitment. If i was to go to CC, I would still have to take a ton of Aviation classes. \n\nBut for people who have the option to attend CC, i think it is a great choice. Definitely saves a lot of money!",
      "author": "Scarlet_199x",
      "created": 1609112496,
      "upvotes": 2,
      "replies": {}
    },
    "gh8g6n3": {
      "link": "/r/college/comments/klbczn/community_college/gh8g6n3/",
      "text": "My private high school literally limited the number of AP classes we took for whatever reason - I would have taken a bunch more if I had the ability to.",
      "author": "wishingstarrs",
      "created": 1609112434,
      "upvotes": 3,
      "replies": {}
    },
    "gh8fwbp": {
      "link": "/r/college/comments/klbczn/community_college/gh8fwbp/",
      "text": "I think it really depends on your location and you financial opportunities.  In my state, not every high school offers dual credit, not every student could afford the extra fees, and not every student could get into those classes.  Plus, some students get offered a hefty scholarship/aid package that wouldn't be available to them as a transfer student so they have to go straight to traditional university after high school to take advantage of that.  \n\nObviously this year was a big hot mess with online classes and quarantining, etc. I do know that at the small, state university I teach at, we had decreased enrollment and fewer face to face classes but we opened our residence halls to as many students as needed to live there.  They still weren't at full capacity but a lot of our students from rural areas benefitted by living on campus and having access to the wifi, food service, and other things.  Had they stayed home, I don't think they would have gotten any of their schoolwork done and would have failed.  (Our community colleges don't offer housing...they are \"commuter only\" so that also makes a difference).\n\nI am encouraging both of my nephews to get as much dual credit and AP courses that they can.  My oldest one already knows he wants to go to grad school, so he might as well get ahead while he can (and he's smart enough to ace the classes).  My younger nephew isn't sure on what he wants to do just yet, but it wouldn't hurt him to get dual credit in some of the basics so he has the time/credit hours available to take some extra college courses that speak to his interests.  We also know that Pell Grants won't be an option for them due to parental income, so they can save money by getting credits done in high school.  However, if they are offered a good scholarship (the oldest is smart enough to get the highest level of scholarships at college he wants to attend), staying home and taking CC classes before matriculating on campus would cause them to lose that scholarship money.  It all comes down to the math when the time comes.",
      "author": "PsychTau",
      "created": 1609112287,
      "upvotes": 1,
      "replies": {}
    },
    "gh8fewq": {
      "link": "/r/college/comments/klbczn/community_college/gh8fewq/",
      "text": "[deleted]",
      "author": null,
      "created": 1609112043,
      "upvotes": 4,
      "replies": {
        "gh9qt3r": {
          "link": "/r/college/comments/klbczn/community_college/gh9qt3r/",
          "text": "yes everybody acknowledges the fact that different circumstances calls for different actions. Nobody is saying that people are dumb for not choosing CCs when everybody situation is different. In your case it would not make much sense due to board costs. It really does depend on how streamlined your CC is with the local universities. In California it’s not necessarily perfect but definitely one of the best states for transfer students.",
          "author": "kdrdr3amz",
          "created": 1609140981,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh8f0jh": {
      "link": "/r/college/comments/klbczn/community_college/gh8f0jh/",
      "text": "I attended community college while in HS and also took a few APs each year to knock out some credits. Now I’m graduating a full year early from undergrad with all those transfer credits under my belt and didn’t have to overpay for core courses. That’s a lot of money I saved right there. Even better, the cc environment was full of people who *wanted to be there*. I honestly miss the group discussions and projects I had with my CC folks, as well as the wide range of backgrounds and experiences we all came from. Learned a lot about what I wanted from a college, which helped me pick which school I eventually attended to finish my degree.",
      "author": "Ozymandias_2000",
      "created": 1609111832,
      "upvotes": 3,
      "replies": {}
    },
    "gh8ewr2": {
      "link": "/r/college/comments/klbczn/community_college/gh8ewr2/",
      "text": "[deleted]",
      "author": null,
      "created": 1609111776,
      "upvotes": 5,
      "replies": {
        "gh8f2s7": {
          "link": "/r/college/comments/klbczn/community_college/gh8f2s7/",
          "text": "My district is very low income! We’re so low income we all received free lunch for our entire school career🤣",
          "author": "louisepesto",
          "created": 1609111865,
          "upvotes": 3,
          "replies": {
            "gh8fj9r": {
              "link": "/r/college/comments/klbczn/community_college/gh8fj9r/",
              "text": "I feel it! We had a lot of people transfer to other districts because we were in such a bad place for a while. I don't think it was a *bad* school but holy shit they needed some levy money. 😂",
              "author": "torgoboi",
              "created": 1609112103,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gh8eh84": {
      "link": "/r/college/comments/klbczn/community_college/gh8eh84/",
      "text": "I hated AP classes in high school, but they had more of a positive impact on my GPA if I took them. It’s a complete scam. I can’t stress how essential it is to take community college classes if you can in high school, it’ll save you so much money in the long run.",
      "author": "ramen_lovr",
      "created": 1609111551,
      "upvotes": 6,
      "replies": {}
    },
    "gh8e9fy": {
      "link": "/r/college/comments/klbczn/community_college/gh8e9fy/",
      "text": "I think there are a number of reasons people choose to go to 4-year schools right away instead of CC, with the big ones including the stigma surrounding CC, wanting the “college experience,” wanting to get away from home or shitty parents, etc. For me, I chose to go to a 4-year school because my degree path is highly specialized and the classes begin in freshmen year. I wanted to start as soon as possible so I wouldn’t get stuck in school for like 6 years. \n\nI took several AP and other college courses while in highschool, but my siblings didn’t. It really depends on the person and what they think they’ll be able to handle at any given moment.",
      "author": "divine_trash_4",
      "created": 1609111438,
      "upvotes": 3,
      "replies": {}
    },
    "gh8e2cq": {
      "link": "/r/college/comments/klbczn/community_college/gh8e2cq/",
      "text": "some dont get into ap classes or understand the purpose, and some community colleges don't take the credits anyway. some people want the experience of a 4yr university. also for nursing community college is much more competitive to get into",
      "author": "daddycakes101",
      "created": 1609111333,
      "upvotes": 6,
      "replies": {
        "gh8emng": {
          "link": "/r/college/comments/klbczn/community_college/gh8emng/",
          "text": "It is! I’m just doing my science classes at CC I’ve already been accepted to a BSN program. Over 200 students apply for the 30ish seats in the CC program. It’s crazy.",
          "author": "louisepesto",
          "created": 1609111630,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gh8cjmb": {
      "link": "/r/college/comments/klbczn/community_college/gh8cjmb/",
      "text": "I mean no disrespect to you or anyone else attending community college, but they aren’t respected by the “upper crust”. For those of whom just seeking a job, there’s no reason not to. People might not want to admit that there’s a distinction between what you get at Wharton versus a community business school, but for the majority it’s not a different story. The level of education you’d get at a community college isn’t all that different from what you’d get outside of a T-50 school. Plus cost is an enormous factor.\n\nBearing that in mind, the reputation of a school is an enormous factor for a lot of interviewers and when you network in general. When people ask “Where’d you go?” And you say a CC? Prepare for the bad looks. The “Oh...cool” responses. Should it be that way? No. Same as why it shouldn’t matter if you grew up in downtown Chicago or if you grew up without a father. But people do care. It’s the reality of the situation. People aren’t as bad as they used to be (90s, 2000s) but are still judgemental. And thus, people are far more willing to sacrifice a substantial amount of money to avoid that association.\n\nCombine that with what other users have mentioned—college experience and such—and community college just isn’t appreciated.",
      "author": "DoorHingeDeliveries",
      "created": 1609110534,
      "upvotes": 1,
      "replies": {
        "gh8csij": {
          "link": "/r/college/comments/klbczn/community_college/gh8csij/",
          "text": "I mean most people do transfer to a four year. I always say I’m studying at CC right now but I’m transferring to four year for my bsn. Most people even tell me they think it’s smart.",
          "author": "louisepesto",
          "created": 1609110664,
          "upvotes": 3,
          "replies": {
            "gh8dymk": {
              "link": "/r/college/comments/klbczn/community_college/gh8dymk/",
              "text": "With all due respect, a quick lookup says “Only 13 percent of the students who start at a community college manage to get a bachelor’s degree six years later, according to the National Student Clearinghouse Research Center. One part of the problem is that only 30 percent of community college students succeed in transferring to a four-year institution.” That’s from the [Hechinger Report](https://www.google.com/amp/s/hechingerreport.org/why-so-few-students-transfer-from-community-colleges-to-four-year-universities/) and links some study from the National Student Clearinghouse Center.\n\nIf you actually manage to transfer, best of luck to you. But my point stands for a good chunk of people. Many dropout or just end up getting a Bachelor’s from their CC. Again, I’m not giving the claim that CC will lead nowhere; but my father experienced this stigma, and a lot of people I know do too. But you asked why more people don’t attend CC—why people don’t see the “opportunity” that it is—and my answer is because most people acknowledge the financial gain but are pressured into it being outweighed by societal expectations.",
              "author": "DoorHingeDeliveries",
              "created": 1609111280,
              "upvotes": -5,
              "replies": {}
            }
          }
        }
      }
    },
    "gh8chdg": {
      "link": "/r/college/comments/klbczn/community_college/gh8chdg/",
      "text": "After my bachelors degree, I went back to CC for nursing. Would recommend CC any day of the week, comparatively.  I now am an instructor at the CC I graduated from!",
      "author": "inadarkwoodwandering",
      "created": 1609110500,
      "upvotes": 8,
      "replies": {}
    },
    "gh8bka4": {
      "link": "/r/college/comments/klbczn/community_college/gh8bka4/",
      "text": "Does anyone feel like the miss out on some of the social aspects being a transfer student thou? I just feel like if I transferred to my school 2 years in, I would have a hard time making friends\n\nEdit: also internships. I’m an engineering student, so I had two internships My first and second year, don’t think I could’ve gotten those at a community college",
      "author": "sdbeaupr32",
      "created": 1609110020,
      "upvotes": 1,
      "replies": {
        "gh8bptm": {
          "link": "/r/college/comments/klbczn/community_college/gh8bptm/",
          "text": "One reason I decided to do CC this year was because of COVID. I wasn’t going to be able to make a ton of friends anyway. I think it depends on how easily you make friends.",
          "author": "louisepesto",
          "created": 1609110099,
          "upvotes": 2,
          "replies": {
            "gh8c8za": {
              "link": "/r/college/comments/klbczn/community_college/gh8c8za/",
              "text": "That makes sense. Also my edit about internships, as engineering student, I doubt I could’ve gotten those as a community college student",
              "author": "sdbeaupr32",
              "created": 1609110377,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh8bjab": {
      "link": "/r/college/comments/klbczn/community_college/gh8bjab/",
      "text": "I wanted to escape my state.\n\nAlso, community college actually wouldn't have done me much good at all - by the time I graduated HS I had enough AP and dual enrollment credits that I could conceivably have graduated with a bachelor's in two years. But my school does a senior capstone thing and I would have had to start work on that second semester of my first year, so I decided to stick around for an extra year and get a double major.\n\nSo technically I didn't make the *best* decisions, but I can live with them. (If I get a job. But my school set me up well for that too, so I'm actually not super worried.)",
      "author": "ParsnipPizza2",
      "created": 1609110006,
      "upvotes": 11,
      "replies": {
        "gh8busa": {
          "link": "/r/college/comments/klbczn/community_college/gh8busa/",
          "text": "I got my AA in high school. The only reason I went to community this year is because of my science classes I needed. I figured since they were all online I should save some money.",
          "author": "louisepesto",
          "created": 1609110170,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gh8bivo": {
      "link": "/r/college/comments/klbczn/community_college/gh8bivo/",
      "text": "Because people consider community college to be the \"alternative school\" of college. Seriously, I am guilty of doing this myself. Back in my early days of high school I would laugh at all the seniors that were going to a CC because to me that meant that they were too stupid or lazy for \"real college\". Parents also cant brag about the success of their own child seeing as they went into \\[insert community college name here\\].\n\nBut community college provides a great way for students to save money in there education. I begrudgingly went to community college my first 2 years and saved thousand on my education. I got a 2 year degree in IT and I am finishing my 4 year degree in Finance.",
      "author": "RisingSunofJapan",
      "created": 1609110000,
      "upvotes": 7,
      "replies": {}
    },
    "gh8b4zc": {
      "link": "/r/college/comments/klbczn/community_college/gh8b4zc/",
      "text": "I know when I first went into engineering I was thrown directly into engineering classes that only that University offered. Spending a year or 2 at a CC would have ended up being a waste of time for anyone going into the school of Engineering at that uni. Even if it was to just get gen ed classes done because the Engineering Program had special engineering classes that counted as those gen ed too.",
      "author": "DevilsHand676",
      "created": 1609109799,
      "upvotes": 8,
      "replies": {}
    },
    "gh89vs9": {
      "link": "/r/college/comments/klbczn/community_college/gh89vs9/",
      "text": "100%! The only reason I started at a 4-year institution instead of a community college is because I was already considered a sophomore by credits in my first semester so I would have had to transfer to a 4-year institution after only a semester.\n\nI will say though, if you can take dual credit courses in high school (or better yet take online or evening community college courses) instead of AP because colleges have to take the dual credit/community college courses and make them count for something, with AP they don't. At one school you can come in as a mid-year sophomore by credits because of you passed enough APs, whereas at another you might get no credits or they give you credits but the credits only count as electives.",
      "author": "squirrel8296",
      "created": 1609109151,
      "upvotes": 3,
      "replies": {
        "gh9f05y": {
          "link": "/r/college/comments/klbczn/community_college/gh9f05y/",
          "text": "You may have to be careful of taking too many if you're looking for scholarships.  If you have over a semester's worth, it can make you classified as a transfer student instead of a first-time freshman which can change scholarship eligibility.  One of my students had 18 hours of college credit after high school from dual enrollment and it made her lose out on  multiple scholarship opportunities since she was over 15 hours.  This is likely different by school, though.",
          "author": "TheKwongdzu",
          "created": 1609131506,
          "upvotes": 2,
          "replies": {
            "ghaia09": {
              "link": "/r/college/comments/klbczn/community_college/ghaia09/",
              "text": "At least from my experience, usually schools won't classify students like that as transfer students at least at a public school. At a private school its anyone's guess.",
              "author": "squirrel8296",
              "created": 1609166974,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh89tzc": {
      "link": "/r/college/comments/klbczn/community_college/gh89tzc/",
      "text": "My experience at community college was better than my experience at university, teachers have a lot less work load and are more personable to their students. You get more one-on-one support and really getting to know your teacher more makes the experience much more enjoyable. \n\n&#x200B;\n\nI had one teacher in when I was taking sign language at community college take the entire class out to dinner but required that we all order in sign language (and he'd interpret to the waitress/er), it was super fun. \n\n&#x200B;\n\nPeople shit on community college when imo its a better student experience and cost a fraction of the price. And then you can go to university and get your \"college experience\" since some people for whatever reason value that after two years of community college.",
      "author": "GennaroIsGod",
      "created": 1609109125,
      "upvotes": 22,
      "replies": {}
    },
    "gh89rhv": {
      "link": "/r/college/comments/klbczn/community_college/gh89rhv/",
      "text": "High school GPA requirements and attendance is a big thing for doing dual enrollment",
      "author": "GanstaThuggin",
      "created": 1609109090,
      "upvotes": 2,
      "replies": {
        "gh8a1d4": {
          "link": "/r/college/comments/klbczn/community_college/gh8a1d4/",
          "text": "Depends on the school. I started college classes when I was 14",
          "author": "louisepesto",
          "created": 1609109230,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh88k55": {
      "link": "/r/college/comments/klbczn/community_college/gh88k55/",
      "text": "I should have went to community college straight out of high school, but when you grow up in a rural town you just want to get away from it all and see new things. Going to community college was basically like the 13th grade to me because nothing about my current living situation was going to change. When you are that age, leaving home and going to a big university is very appealing as opposed to just staying home. Also when all of your friends are going to universities, you don’t want to be the one person still stuck back home.",
      "author": "NaztyC",
      "created": 1609108465,
      "upvotes": 1,
      "replies": {
        "gh88r2p": {
          "link": "/r/college/comments/klbczn/community_college/gh88r2p/",
          "text": "I mean I am that age and I live in a very rural town but I’ve been a member of the student loan sub for a while and that’s one reason I’m taking as many classes as possible at CC.",
          "author": "louisepesto",
          "created": 1609108564,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh88jmx": {
      "link": "/r/college/comments/klbczn/community_college/gh88jmx/",
      "text": "My high school made it damn near impossible to do PSEO (post-secondary education opportunity) or any AP classes. You had to be in the top third of the class percentage to do it and typically has to do it starting your junior year to do it your senior year. I tried signing up my senior year as I would have been able to join due to being in that top 3rd but they wouldn’t let me because all the “spots for seniors” filled up.",
      "author": "Eeeeeeeeeeeeeek12",
      "created": 1609108457,
      "upvotes": 2,
      "replies": {}
    },
    "gh8819f": {
      "link": "/r/college/comments/klbczn/community_college/gh8819f/",
      "text": "CC doesn’t have the courses i need and i definitely couldn’t get a car to commute :-(",
      "author": "dearwikipedia",
      "created": 1609108196,
      "upvotes": 2,
      "replies": {}
    },
    "gh8803m": {
      "link": "/r/college/comments/klbczn/community_college/gh8803m/",
      "text": "I’m happy so many people have such great experiences at community college. It definitely seems like a great option finachaily. Unfortunately at least in my experience from my local community college compared to my currently university the quality of the education was significantly worse at the community college. I’m happy to hear from people online that the quality of the education is comparable to 4 year university’s at other CCs.",
      "author": "Ann_as",
      "created": 1609108180,
      "upvotes": 8,
      "replies": {
        "gh9q7ca": {
          "link": "/r/college/comments/klbczn/community_college/gh9q7ca/",
          "text": "Really does depend on the school. But again universities have TONS more financial support than CCs do so it’s expected that some institutions may be lackluster.",
          "author": "kdrdr3amz",
          "created": 1609140393,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh87h3s": {
      "link": "/r/college/comments/klbczn/community_college/gh87h3s/",
      "text": "Community college is great. As a second degree career changer I wish I had gone the community college path the first time. High quality education at an affordable price and many transfer options.",
      "author": "sasiamovnoa",
      "created": 1609107903,
      "upvotes": 9,
      "replies": {
        "gh889qj": {
          "link": "/r/college/comments/klbczn/community_college/gh889qj/",
          "text": "That’s the main reason I’m going. It saves so much money for the most part.",
          "author": "louisepesto",
          "created": 1609108316,
          "upvotes": 4,
          "replies": {}
        },
        "gh9ga8d": {
          "link": "/r/college/comments/klbczn/community_college/gh9ga8d/",
          "text": "This is absolutely the case for a high quality community college, of which there are many.  However, there are also some that aren't so great.  This is true of universities as well, of course, but I've seen a lot more lacking areas in students transferring from certain community colleges than others.  It's worth it to make sure that the community college you're interested in has a good reputation.  Getting the credit for the lower division courses isn't worth as much if the classes where you took them didn't prepare you effectively for the later classes in those areas.",
          "author": "TheKwongdzu",
          "created": 1609132386,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh87eu5": {
      "link": "/r/college/comments/klbczn/community_college/gh87eu5/",
      "text": "I did go to community college, but I wasn't able to take AP classes in high school because I couldn't afford the test fees.",
      "author": "bornagainteen",
      "created": 1609107871,
      "upvotes": 2,
      "replies": {
        "gh88b2h": {
          "link": "/r/college/comments/klbczn/community_college/gh88b2h/",
          "text": "I didn’t know they had test fees!",
          "author": "louisepesto",
          "created": 1609108335,
          "upvotes": 1,
          "replies": {
            "gh8cjmt": {
              "link": "/r/college/comments/klbczn/community_college/gh8cjmt/",
              "text": "Yup. I graduated HS in 2012 and I think tests were like $70 each back then. They’re super expensive.",
              "author": "elentiyaa",
              "created": 1609110534,
              "upvotes": 2,
              "replies": {
                "gh8ja1t": {
                  "link": "/r/college/comments/klbczn/community_college/gh8ja1t/",
                  "text": "That's interesting. I couldn't afford the test fees, the SAT test, or applying to different colleges but because I had free/reduced lunch those we're all free with a simple waiver. Did you never ask about payment options for those who cannot afford the test fees?",
                  "author": "theenigmaticlover",
                  "created": 1609114035,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "ghbhn0c": {
              "link": "/r/college/comments/klbczn/community_college/ghbhn0c/",
              "text": "They’re around $90/test now.",
              "author": null,
              "created": 1609185648,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh86tk8": {
      "link": "/r/college/comments/klbczn/community_college/gh86tk8/",
      "text": "My high school counselors really pushed the idea of scoring high on aptitude tests so you can “not end up at community colleges”, so I think that would explain it. I actually started off at a 4-year university part-time and now I’m finishing the rest of what I need at a community college so I can transfer back in a couple years. I’m glad I went to CC",
      "author": "Songibal",
      "created": 1609107566,
      "upvotes": 3,
      "replies": {}
    },
    "gh86gs7": {
      "link": "/r/college/comments/klbczn/community_college/gh86gs7/",
      "text": "There's still kinda a sigma against them.",
      "author": "_theatre_junkie",
      "created": 1609107379,
      "upvotes": 2,
      "replies": {
        "gh9r3p8": {
          "link": "/r/college/comments/klbczn/community_college/gh9r3p8/",
          "text": "/really??/",
          "author": "kdrdr3amz",
          "created": 1609141267,
          "upvotes": 2,
          "replies": {
            "gh9rl9j": {
              "link": "/r/college/comments/klbczn/community_college/gh9rl9j/",
              "text": "Yeah, that they're not as good as for years or that the people who go to them are lazy.",
              "author": "_theatre_junkie",
              "created": 1609141752,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh86ak2": {
      "link": "/r/college/comments/klbczn/community_college/gh86ak2/",
      "text": "Going to CC first thing i did after graduating HS is the best decision of my life. The tuition is mostly paid by fin-aid. And i love how small it is when it comes to classroom and i feel like you still have 1 on 1 whenever you need help from your prof. And i also feel like you have that closer experience on the major you pick on. And its would be easy work if i decided to get my batchelors. I understand others wanna have that university life but i feel like that wasnt me at all. I wanted to do it in cheapest way for me and my prents. Overall i still have good experience in and out",
      "author": "omogal123",
      "created": 1609107288,
      "upvotes": 12,
      "replies": {}
    },
    "gh86ac3": {
      "link": "/r/college/comments/klbczn/community_college/gh86ac3/",
      "text": "I personally went the CC Dual-Enrollment route my last two years in high school. Was able to get 30 credit hours or so. Was kinda tough balancing 3 college classes on top of high school classes and ECs but it was worth it. I didn’t go to CC after because with the way my program of study works out at my University it’s really advantageous to get into certain classes as a freshman; I ended up getting an internship sophomore year because of it. On top of it I got really great scholarships at my 4-year so I don’t really pay anything besides personal expenses. If I was studying something else that didn’t have advantages like that I definitely would’ve considered CC for a year after HS",
      "author": "rbeck337",
      "created": 1609107285,
      "upvotes": 2,
      "replies": {
        "gh86rxw": {
          "link": "/r/college/comments/klbczn/community_college/gh86rxw/",
          "text": "I feel ya on it being tough! I went to an early college and I started college classes my freshman year of high school. It was wild 😂",
          "author": "louisepesto",
          "created": 1609107541,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh865nj": {
      "link": "/r/college/comments/klbczn/community_college/gh865nj/",
      "text": "Taking running start/ dual enrollment classes in highschool at the local community college has been one of the best decisions of my life",
      "author": "SilverLightning926",
      "created": 1609107218,
      "upvotes": 6,
      "replies": {
        "gh86uf7": {
          "link": "/r/college/comments/klbczn/community_college/gh86uf7/",
          "text": "My school was an early college and even thought it was difficult I am so thankful for it",
          "author": "louisepesto",
          "created": 1609107579,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gh864a8": {
      "link": "/r/college/comments/klbczn/community_college/gh864a8/",
      "text": "I did bad in High School graduated with a 2.1 GPA. Graduated CC with a 3.5 and on track to graduate University with a 3.8. CC is really great you save literally thousands not going directly to a 4 year. The stigma really is why people feel ashamed going to CC..",
      "author": "shrimpynut",
      "created": 1609107198,
      "upvotes": 25,
      "replies": {}
    },
    "gh863md": {
      "link": "/r/college/comments/klbczn/community_college/gh863md/",
      "text": "My high school didn't offer a variety of AP classes, only 2 AP U.S. history and AP Chem, however the teacher had to approve you for the class. The school later lost the ability to teach AP classes, so for me I took one AP as that's what fit my schedule. I know most schools around my area growing up just didn't offer AP. CC wasn't too big either, one within an hour of me that mostly offered trades such as cosmetology. I dual enrolled, but even then that CC wasn't a true CC, it was a technical college, but that's what was offered.",
      "author": "CarefulStrawberry",
      "created": 1609107189,
      "upvotes": 2,
      "replies": {}
    },
    "gh85h3q": {
      "link": "/r/college/comments/klbczn/community_college/gh85h3q/",
      "text": "I took a bunch of AP classes and always passed the exams and never got any sort of college credit for them.  I was also not allowed to take community college classes in high school like some other schools",
      "author": "Spazattack43",
      "created": 1609106861,
      "upvotes": 12,
      "replies": {
        "gh8czhw": {
          "link": "/r/college/comments/klbczn/community_college/gh8czhw/",
          "text": "Yeah i’m mad that i’m not allowed to do the dual enrollment course I wanted to do this year. While a lot of my classmates are allowed to take it, and I feel like if i do it senior year it won’t count as much or be as impressive.",
          "author": "peppathesheep",
          "created": 1609110770,
          "upvotes": 1,
          "replies": {
            "gh9q217": {
              "link": "/r/college/comments/klbczn/community_college/gh9q217/",
              "text": "Bruh you don’t take college classes just to impress admissions officers lol. You take them to receive COLLEGE CREDITS at a very reduced price. Why does it matter if it would be as “impressive” or not? Logically that makes no sense.",
              "author": "kdrdr3amz",
              "created": 1609140253,
              "upvotes": 2,
              "replies": {
                "gh9r521": {
                  "link": "/r/college/comments/klbczn/community_college/gh9r521/",
                  "text": "Well, I do want to receive free college credits so taking the course still makes sense.",
                  "author": "peppathesheep",
                  "created": 1609141306,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gh85gre": {
      "link": "/r/college/comments/klbczn/community_college/gh85gre/",
      "text": "One class at my CC is $458 (3 credit hours). I know that’s cheap compared to a university. But it’s still a lot. My school also doesn’t have a wide variety of classes so I’m very limited in my choices and have to wait until a university to take the classes for my degree. I have 1 or 2 left for the general requirements, but I want variety in those.",
      "author": "taffypulller",
      "created": 1609106855,
      "upvotes": 3,
      "replies": {
        "gh9qjla": {
          "link": "/r/college/comments/klbczn/community_college/gh9qjla/",
          "text": "That is a lot of money. At my CC it’s $46 bucks per unit. So full time students (12 units minimum) pay $552 bucks for one semester! Little over 1k a year. Meanwhile the local universities charge 6.5k+ a year.",
          "author": "kdrdr3amz",
          "created": 1609140719,
          "upvotes": 2,
          "replies": {
            "ghbgybp": {
              "link": "/r/college/comments/klbczn/community_college/ghbgybp/",
              "text": "Wow what state? My local CC is $6k/yr in tuition.",
              "author": null,
              "created": 1609185295,
              "upvotes": 2,
              "replies": {
                "ghbhh79": {
                  "link": "/r/college/comments/klbczn/community_college/ghbhh79/",
                  "text": "California",
                  "author": "kdrdr3amz",
                  "created": 1609185566,
                  "upvotes": 2,
                  "replies": {
                    "ghbjkdg": {
                      "link": "/r/college/comments/klbczn/community_college/ghbjkdg/",
                      "text": "Yeah, that arrangement is entirely different in most other states. Many community colleges focus on trades, have no transfer agreements, don’t offer math beyond precalc, are expensive, etc",
                      "author": null,
                      "created": 1609186608,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gh9t9u4": {
              "link": "/r/college/comments/klbczn/community_college/gh9t9u4/",
              "text": "Is that in the US? I have honestly never heard of those prices in anywhere but in Canada",
              "author": "taffypulller",
              "created": 1609143484,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh851fd": {
      "link": "/r/college/comments/klbczn/community_college/gh851fd/",
      "text": "If someone has barely left their home area or met new people for 18 years so they’ll take the first opportunity to get a change of scenery. I went to school four hours away (only one state away though). I grew up in southern New Hampshire, my philosophy was life’s too short to only see southern NH and northern MA for the rest of my life so I spent four years in central Maine and met people from probably at least 20 different states and saw some things I wouldn’t have thought to go to if I’d never left home. I can see why a well traveled person with a diverse friend group would be fine with a CC, but for an 18 year old with barely any chance to do anything more than an hour away from their house change is desperately needed.",
      "author": "anonymous_gam",
      "created": 1609106631,
      "upvotes": 1,
      "replies": {
        "gh85khg": {
          "link": "/r/college/comments/klbczn/community_college/gh85khg/",
          "text": "I was like that but I realized I’d rather not be a lot in debt. I’m not hating on your choice! But for me the best choice was to stay close to home to get my degree.",
          "author": "louisepesto",
          "created": 1609106909,
          "upvotes": 1,
          "replies": {
            "gh86dxi": {
              "link": "/r/college/comments/klbczn/community_college/gh86dxi/",
              "text": "In state tuition in NH is wildly expensive and I went out of state for that cost. Every single person has to know themselves well enough to know how far they want to go. For me if I had known everything would work out and everyone at home would be fine I probably would’ve went a bit further, but now I have connections with people that are way better than the ones I made in K-12. I also think my education was good quality for a state school. Everyone had choices and I will always advocate for four year public schools to be free, some programs are better run as four year than get gen Ed’s done, than main courses. I don’t like seeing cc, and four year people putting each other down, almost everyone’s decision of where to go has multiple factors going into it.",
              "author": "anonymous_gam",
              "created": 1609107338,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh84hmm": {
      "link": "/r/college/comments/klbczn/community_college/gh84hmm/",
      "text": "In my personal situation, I have scholarship with a specific large public university and it’s main campus and I would have to attend all four years to keep the scholarships. So I’d literally be saving more money just by staying consistent.",
      "author": "TheZarcFiles",
      "created": 1609106348,
      "upvotes": 19,
      "replies": {}
    },
    "gh8487k": {
      "link": "/r/college/comments/klbczn/community_college/gh8487k/",
      "text": "There are obviously pros and cons. For me personally, since I’m transferring into engineering, the admittance to a UC or a private school for engineering is competitive (especially schools like UCLA and UCB, it’s insane). You have to have a certain amount of rigour and mental toughness to push yourself to keep a 4.0 . It’s really not an easy task. My classes followed the same UC Berkeley Courses and shared sometimes the exact tests. It simply is hard and not for everyone. A lot of my friends didn’t make it. They had to transfer out of engineering because they didn’t have the required gpa (~3.5). Most people want to secure a future and not take chances. Going to a Cc and transferring is taking a somewhat big chance. There are a lot of smart people you are gonna be competing against. Your path could be easy but then again it could be hard as well.",
      "author": "JohnPotato001",
      "created": 1609106213,
      "upvotes": 4,
      "replies": {}
    },
    "gh83r4y": {
      "link": "/r/college/comments/klbczn/community_college/gh83r4y/",
      "text": "[deleted]",
      "author": null,
      "created": 1609105971,
      "upvotes": 2,
      "replies": {
        "gh8baz7": {
          "link": "/r/college/comments/klbczn/community_college/gh8baz7/",
          "text": ">Ivy League universities also tend to provide more resources to ensure that students are getting internships and networking opportunities.\n\nThe thing is someone who's been admitted to an Ivy League university is someone who'd need to consider community college at all. They have the grades and likely the scholarships to make it a non-issue. \n\n&#x200B;\n\nI had a school colleague who got accepted into MIT but didn't have the financials she was comfortable with to attend so she just looked at a state school instead, and between her private scholarships and all the general academic-based ones she was *technically* making money by just attending and keeping her grades up. \n\n&#x200B;\n\nUnless you're not paying for college you'd have to have an extremely compelling argument to say CC wouldn't be worth it even if it was just to get a 12 credit gen-ed semester out of the way - in my opinion. \n\n&#x200B;\n\nObviously, there are other takes on this.",
          "author": "GennaroIsGod",
          "created": 1609109886,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gh83jdz": {
      "link": "/r/college/comments/klbczn/community_college/gh83jdz/",
      "text": "CCs are not a traditional college experience. Would not recommend but if you want cheaper tuition then go for it",
      "author": "davidc5494",
      "created": 1609105864,
      "upvotes": 1,
      "replies": {
        "gh83mlz": {
          "link": "/r/college/comments/klbczn/community_college/gh83mlz/",
          "text": "I like CC. Like this year was traditional in any way 🤣",
          "author": "louisepesto",
          "created": 1609105909,
          "upvotes": 5,
          "replies": {}
        },
        "gh8s1tb": {
          "link": "/r/college/comments/klbczn/community_college/gh8s1tb/",
          "text": "You absolutely can have a traditional American college experience at Community Colleges. There are lots of clubs to join to meet and network with people. My community college also offers to internships for prospective students.",
          "author": "tibetansplateau",
          "created": 1609118728,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh83e7h": {
      "link": "/r/college/comments/klbczn/community_college/gh83e7h/",
      "text": "I'm not really sure how community college and taking AP classes in HS are correlated? \n\nBut I personally have not enjoyed taking AP classes. As I get closer to finishing up my last year of HS, and having taken AP Bio--I've found that AP classes are less about \"learning\" in depth, than it is actually just about learning to become a better test taker and how to work smarter on assignments. And I was originally going to take AP physics and Chem as well. Thank god that never worked out.",
      "author": "norman-the-foreman",
      "created": 1609105794,
      "upvotes": 1,
      "replies": {
        "gh83koi": {
          "link": "/r/college/comments/klbczn/community_college/gh83koi/",
          "text": "Because they both in the long term (generally) save money for people.",
          "author": "louisepesto",
          "created": 1609105882,
          "upvotes": 7,
          "replies": {
            "gh84hrb": {
              "link": "/r/college/comments/klbczn/community_college/gh84hrb/",
              "text": "I find AP classes to be a bit redundant when it comes to saving money, considering how so many colleges/universities have such strict regulations on what you can and can't do with your credit. \n\nAs for community colleges, there's a large stigma about going to one. Both of my parents have gone to different community colleges, and had incredibly negative experiences such as random last minute loans, crappy professors, and etc. And there's also the issue regarding the quality of education you would receive at a community college compared to a larger state university.",
              "author": "norman-the-foreman",
              "created": 1609106350,
              "upvotes": 3,
              "replies": {
                "gh8cgra": {
                  "link": "/r/college/comments/klbczn/community_college/gh8cgra/",
                  "text": ">and had incredibly negative experiences such as random last minute loans, crappy professors, and etc. And there's also the issue regarding the quality of education you would receive at a community college compared to a larger state university.\n\nI would argue that this is not unique to CC's and a problem in the academic structure (in America) in general. \n\nI've had all those problems at my university when I attended and the quality of education at this point for all universities is questionable at best when everything they're teaching has been posted on YouTube in a likely more clear and concise way. \n\nI can only speak for me any my fellow peers who I worked with but when we got stuck on something 99% of the time we'd just watch a YouTube video or read a web page that gave me the exact information I was looking for rather than dealing with emailing a professor and waiting a few days, or going to office hours and waiting outside in a line of 10 other students to get your 3 minute conversation in. \n\nMeanwhile, I can go learn Computer Science from MIT videos *they* posted on YouTube from their own classroom lectures.",
                  "author": "GennaroIsGod",
                  "created": 1609110491,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gh83baa": {
      "link": "/r/college/comments/klbczn/community_college/gh83baa/",
      "text": "Community college changed my life in the best of ways. I seriously judged it before I attended and can honestly say that I wouldn’t be anywhere near where I am today without it. I wish people knew how wonderful it is.\nAs for AP classes, I was homeschooled so I don’t know much about them, but what I heard from friends was that a lot of what they were told would count towards college credit ended up not counting. Hopefully that was just for the people I knew though. I’m not sure how it’s supposed to work.",
      "author": "purlgraytea",
      "created": 1609105753,
      "upvotes": 21,
      "replies": {
        "gh9n1e2": {
          "link": "/r/college/comments/klbczn/community_college/gh9n1e2/",
          "text": "I think whether or not you get credit at a college depends on what your AP exam scores are. Their all out of 5 and usually most schools award credit for people who scored either a 5 or a 4, and sometimes a 3",
          "author": "bbbbbryce",
          "created": 1609137524,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gh835mn": {
      "link": "/r/college/comments/klbczn/community_college/gh835mn/",
      "text": "I took a handful of AP's (stats, world, us history, literature, language, and physics) in high school and passed all of them, which was a massive help when I started college. It helped get me ahead and reduced the number of general ed classes I needed, so I can pull back a bit for these online semesters and not be behind in any way. However, I didn't go to community College. It was an option, and I considered it, but decided it wasn't worth it for me. Accedemically and financially, I would have been better off. I would have had a year to adjust to being in a college course setting, and would have likely been able to get a job while staying with my parents so save up so as not to need to take out any loans in the future. However, for me personally, I had enough saved up that with financial aid and scholarships, it wasn't the biggest issue. I decided that I would rather have my independence sooner and be able to live away from my family than have the advantages community college offers. YMMV, but i don't regret my decision at all",
      "author": "Zedekiah23",
      "created": 1609105673,
      "upvotes": 3,
      "replies": {}
    },
    "gh833hn": {
      "link": "/r/college/comments/klbczn/community_college/gh833hn/",
      "text": "There’s a lot of talk about community college being for “stupid people” or “poor people” when in reality it’s a phenomenal choice. Very happy with mine!",
      "author": "peachyypeachh",
      "created": 1609105642,
      "upvotes": 30,
      "replies": {
        "gh97vvh": {
          "link": "/r/college/comments/klbczn/community_college/gh97vvh/",
          "text": "I hate the stigma around it! When I was in high school people said community college was for C students. It’s so frustrating",
          "author": "avocado_qween",
          "created": 1609127127,
          "upvotes": 12,
          "replies": {
            "gh9pyon": {
              "link": "/r/college/comments/klbczn/community_college/gh9pyon/",
              "text": "Sadly this still exists even today. I remember that I was very hesitant towards community college in highschool. Now I am very glad I made this decision. Completed over 70+ units at the price of virtually nothing, am eligible and transferring out to a CSU/UC for the fall of 2021, was able to maintain and create new friendships, get work/internship experience as well as ECs. I suppose a downside would be that most CCs are pretty much commuter schools but to me this didn’t really matter much. I met really smart kids at a CC who ended up transferring to top schools what’s the matter if they started at a CC instead of from HS? That’s what I ask myself every time I hear the stigmas.",
              "author": "kdrdr3amz",
              "created": 1609140163,
              "upvotes": 6,
              "replies": {
                "gha7byr": {
                  "link": "/r/college/comments/klbczn/community_college/gha7byr/",
                  "text": "In 2016 I graduated high school and went to community college afterwards. Once I got my associates I was able to transfer those credits over to a university and only had to complete two years to get my bachelors! At first I was sad about community college but I don’t regret it!",
                  "author": "avocado_qween",
                  "created": 1609158419,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gh831wr": {
      "link": "/r/college/comments/klbczn/community_college/gh831wr/",
      "text": "CC is definitely beneficial for someone like you who is doing nursing. But for more humanities and arts majors I would advise against CC because there’s less resume building opportunities and you NEED resume builders in college to be successful. That’s two years wasted if you go to CC. But if you’re in a STEM field it’s prob worth it money wise. \n\nEssentially I see it as CC for humanities majors being cheaper in the short term (less debt) but more expensive in the long term (lower paying job = harder to pay debt).",
      "author": "tattooedships",
      "created": 1609105621,
      "upvotes": 9,
      "replies": {
        "gh89dzn": {
          "link": "/r/college/comments/klbczn/community_college/gh89dzn/",
          "text": "This is a *fantastic* point. What you said about short term vs long term benefits is something I think most people don’t think about, and it’s always driven me nuts. Disregarding the fact that my private school was cheaper to attend than my state school, I graduated with 8 internships (and I had to support myself while doing the unpaid ones, so I gained even more work experience with those) and obtained a “high paying” job post-grad with a liberal arts degree. I am certain that there’s no way I would have have achieved either of those two things had I got to a CC and then my state university, especially since my undergrad heavily emphasized internship opportunities, which definitely helped.",
          "author": null,
          "created": 1609108895,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gh81w9y": {
      "link": "/r/college/comments/klbczn/community_college/gh81w9y/",
      "text": "Bc they want the “college experience” . And there’s this thing where if someone goes there that they’re perceived to be lazy. There’s pros and cons to each but I found cc to be great bc it eased you into college. And I still spent lots of time with my friends and my debt was close to none so hopefully in the future more students would consider it. I actually just transferred this semester and I found myself missing my cc. Idk if it’s bc I haven’t been on campus yet cuz covid but it seems like the teachers were nicer and more understanding there than at my four year university....",
      "author": "Worth_Disaster2813",
      "created": 1609105031,
      "upvotes": 32,
      "replies": {}
    },
    "gh80ysq": {
      "link": "/r/college/comments/klbczn/community_college/gh80ysq/",
      "text": "There is definitely a stigma attached to attending a CC. People make it seem like you are a lazy/bad student for going to one and that 4-years are for the “hard workers” of the world. I believe that is one of the only reasons not to go as the pros of attending one definitely out-way the cons. \n\nI attended a CC with a 2.8 gpa from high-school and ended my associates with a 4.0 transferring gpa. I only paid 2 grand for two years of education and got all of my GEs out of the way. I lived at home and paid nothing for housing or food costs. I made plenty of friends in the classes that I took there because everyone was just as lonely as I was.  \n\nIf you can attend a CC, definitely do it.",
      "author": "Lamp9106",
      "created": 1609104570,
      "upvotes": 715,
      "replies": {
        "gh86lip": {
          "link": "/r/college/comments/klbczn/community_college/gh86lip/",
          "text": "My brother was murdered my sophomore year and my mom died my senior year. I was a full IB student, involved in different local organizations/non-profits/national organizations - but I didn’t have the grades because of the depression that plagued me throughout the most important years of HS.\n\nFor me, community college has been a life saver. It gave me a second chance to take time to get help and then improve my grades.\n\nSenior year I graduated with a 2.0 (3.1 cumulative for all four years). This year for my first quarter as a college freshman I got a 4.0!! \n\nI love CC. I wish people didn’t believe that I’m worth less for being a CC student, but then again, I know the truth.\n\n(:",
          "author": "tiburonsol",
          "created": 1609107448,
          "upvotes": 392,
          "replies": {
            "gh8hdm3": {
              "link": "/r/college/comments/klbczn/community_college/gh8hdm3/",
              "text": "That's just amazing, good work!!!",
              "author": "PotlePawtle",
              "created": 1609113057,
              "upvotes": 47,
              "replies": {}
            },
            "gh8sbci": {
              "link": "/r/college/comments/klbczn/community_college/gh8sbci/",
              "text": "I’m so sorry for your losses. You brother and Mom would both be so proud of you and your hard work!",
              "author": "uxnewbie",
              "created": 1609118873,
              "upvotes": 58,
              "replies": {}
            },
            "gh91qto": {
              "link": "/r/college/comments/klbczn/community_college/gh91qto/",
              "text": "You're not worth less. It won't take you long to catch up to them—and possibly exceed them.",
              "author": "turquoiseblues",
              "created": 1609123854,
              "upvotes": 19,
              "replies": {
                "gh9avca": {
                  "link": "/r/college/comments/klbczn/community_college/gh9avca/",
                  "text": "Considering what they've been through, they've gone above and beyond what anyone could reasonably expect.",
                  "author": "max123246",
                  "created": 1609128858,
                  "upvotes": 11,
                  "replies": {
                    "gh9e6ne": {
                      "link": "/r/college/comments/klbczn/community_college/gh9e6ne/",
                      "text": "Exactly. My money's on u/tiburonsol.",
                      "author": "turquoiseblues",
                      "created": 1609130961,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gh9d2tj": {
              "link": "/r/college/comments/klbczn/community_college/gh9d2tj/",
              "text": "I'm sorry to hear about that man. But congratulations on the 4.0! Don't worry about what other people think, you know what you're worth",
              "author": "AeroRL",
              "created": 1609130241,
              "upvotes": 9,
              "replies": {}
            },
            "gh9maqf": {
              "link": "/r/college/comments/klbczn/community_college/gh9maqf/",
              "text": "Kudos to you.  Take care of yourself, friend.  \n\nI find that most of the people who go to CC are the ones most serious about their education.  I miss my days there, but being a junior and less than two years away from my BA feels amazing too.",
              "author": "distressed_amygdala",
              "created": 1609136905,
              "upvotes": 3,
              "replies": {}
            },
            "gh9mpz5": {
              "link": "/r/college/comments/klbczn/community_college/gh9mpz5/",
              "text": "i loved cc so much i miss it a lot, i'm so happy you're doing well <3",
              "author": "bananainpajamaas",
              "created": 1609137261,
              "upvotes": 3,
              "replies": {}
            },
            "gh9gcs1": {
              "link": "/r/college/comments/klbczn/community_college/gh9gcs1/",
              "text": "Congratulations on all your success in spite of all of the trials you faced. You should be proud.",
              "author": "Lamp9106",
              "created": 1609132434,
              "upvotes": 2,
              "replies": {}
            },
            "gh8uim4": {
              "link": "/r/college/comments/klbczn/community_college/gh8uim4/",
              "text": "Is this loss",
              "author": "ampjk",
              "created": 1609120060,
              "upvotes": -13,
              "replies": {}
            }
          }
        },
        "gh8bxij": {
          "link": "/r/college/comments/klbczn/community_college/gh8bxij/",
          "text": "I attended a CC and transferred to university, and I totally agree with the stigma. People definitely looked down on me for it. Once I transferred, suddenly no one was looking down anymore. I had a friend that failed half her classes, lost her scholarships, and had to change her major because she kept failing a certain required class. But she still looked down me because sure I had a 4.0 and got scholarships for it, but it was ~just community college. And let me tell you, I tutored the same class at both institutions and there was no difference in the content, just different textbooks. \n\nOn top of the reasons you listed, I think It doesn't help that America has a strong \"move out when you're 18\" mentality and so many people look down on others who still live in their hometown. People are sold the college experience of living in dorms, partying and having and fun with your friends and being away from your parents. You can't really do this at most CC's (most don't have dorms) and most young people who go to a CC are going locally, so they're probably living at home (most all of the young people my age at the CC lived at home). And making friends at commuter school's is hard! Most people want to go home, and lots of events don't have a huge turnout because people don't want to drive out of their way for free pizza at a mixer. \n\nAnd tbh I'll admit that I feel like I missed out because even though I transferred to a university, it was local one. I never got the college experience, and seeing my friends end up at the same place as me but with tons more experiences and fun, I definitely feel like I missed out. Sure I have like no student loan debt, but still.",
          "author": "scorodites",
          "created": 1609110209,
          "upvotes": 79,
          "replies": {
            "gh8fepc": {
              "link": "/r/college/comments/klbczn/community_college/gh8fepc/",
              "text": "I’d check out the student loan sub. It’s my main reason for staying local. Sure they have the college experience but then they go crazy paying their loans back. Also I was never a fan of partying😂",
              "author": "louisepesto",
              "created": 1609112040,
              "upvotes": 29,
              "replies": {
                "gh8hp5r": {
                  "link": "/r/college/comments/klbczn/community_college/gh8hp5r/",
                  "text": "Lol fair enough. I know logically that the student loan isn't worth the partying. And I know that I'm not a party person and clubs and parties and bars aren't my thing. But I guess it's the FOMO and the belief that I COULD'VE been that fun person with cool experiences and I'm not. \n\nAnd even if you're not a party person, there's still midnight walks around campus with friends, movie marathons and day trips on the weekends, study groups, doing dumb things to kill time with your friends, etc. It's more than partying, it's these small moments of fun and friendship and bonding that I'll never have. I grew up with strict parents so my high school experience sucked and I didn't have a ton of friend's.  While they softened up in college, they were still kinda strict, and like I said making friends at a commuter school is hard. So to me, college my last shot of the stereotypical \"having carefree fun with friends\" experience and now I'll never have it. I guess the grass is always greener 🤷🏽 \n\nEdit: wanted to add- all this being said, I think overall if I could do it again, I wouldn't change anything except try to be more outgoing in college and put more effort to make friends and keep up with the friends I made. I'm overall happy that I went to a CC and local university. I just wish I made better choices while I was there.",
                  "author": "scorodites",
                  "created": 1609113221,
                  "upvotes": 24,
                  "replies": {
                    "gh8hzlf": {
                      "link": "/r/college/comments/klbczn/community_college/gh8hzlf/",
                      "text": "Aww don’t be like that! I’m sure you can make friends!",
                      "author": "louisepesto",
                      "created": 1609113372,
                      "upvotes": 1,
                      "replies": {
                        "gh8jffb": {
                          "link": "/r/college/comments/klbczn/community_college/gh8jffb/",
                          "text": "Haha yeah I can, but I've seen just about everyone, both in real life and on reddit, agree that it becomes harder as you get older, as people get busy, settle down, have kids, etc. \n\n\nI'm only a couple years out of school and starting to see it already. That friend that always down to hang out is now like \"well I had work today (or work tomorrow) so I don't want to stay out past 9.\" I remember I used to get made fun of for wanting to turn in early because of work, and now I'm the only one willing to stay out past 10. Back in college that was never a huge deal. Going to the movies starts becoming \"let's just watch Netflix\" and going to a bar becomes \"well I can't get a sitter, maybe we can celebrate your birthday at the zoo?\" Things are bit different now with covid (I don't really see people now thanks to it) but before covid, I definitely noticed that it became a struggle to try to meet up and hang out. \n\nBack in college, it's like we had endless time. Sure I worked and studied full time, still I tons of free time. Now I'm an adult and never have time. Sure I can make friends, that element of carefree and excess time just isn't there anymore.",
                          "author": "scorodites",
                          "created": 1609114113,
                          "upvotes": 5,
                          "replies": {
                            "gh92m7k": {
                              "link": "/r/college/comments/klbczn/community_college/gh92m7k/",
                              "text": "There are still post-college grownups who party. After COVID, move to a big city, take a few dance classes, and go to nightclubs on the weekends. If you know how to cut up a floor, you'll make friends. (I'm way older than you and I have done this.)",
                              "author": "turquoiseblues",
                              "created": 1609124328,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gh9eb0r": {
                  "link": "/r/college/comments/klbczn/community_college/gh9eb0r/",
                  "text": "r/StudentLoans it is definitely useful and should be viewed by college students more. It seems people don't care about their loans until they reach the end or graduate which by then the damage has been done. \n\nThat said you can have a balance between taking out loans and enjoying your college experience while not putting yourself in a hole it just takes not going to a private school or doing years on end of schooling imo. Obviously more complex than that but thats the simple version",
                  "author": "HugeRichard11",
                  "created": 1609131043,
                  "upvotes": 3,
                  "replies": {}
                },
                "gh926u3": {
                  "link": "/r/college/comments/klbczn/community_college/gh926u3/",
                  "text": "You made the right decision",
                  "author": "turquoiseblues",
                  "created": 1609124095,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gh8h2mi": {
              "link": "/r/college/comments/klbczn/community_college/gh8h2mi/",
              "text": "I feel you with missin out on some of the experiences. I always got kinda jealous seeing people do all this fun stuff on Instagram. But tbh it doesn’t show the whole picture. I don’t think kids who just graduated hs understand how much work it is. I went to cc and was still so stressed my first semester bc so much responsibility is put on you, but no one who goes to college really emphasizes that. I couldn’t imagine being at a school with a dorm and in a new location, I would be even more stressed, but I know some people can’t wait to get out of the house. I think there’s equal pros and cons to both, but yeah I would say cc is pretty looked down upon",
              "author": "Worth_Disaster2813",
              "created": 1609112902,
              "upvotes": 6,
              "replies": {
                "gh8ibgc": {
                  "link": "/r/college/comments/klbczn/community_college/gh8ibgc/",
                  "text": "Yeah fair enough! College is super stressful. And definitely different than high school. And it's even more stressful knowing how expensive it is because if you make a mistake and fail, it's a lot of money to retake. And the CC was half the cost and I'd feel less guilty having to spend that money again if I failed.",
                  "author": "scorodites",
                  "created": 1609113540,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "gh9h20j": {
              "link": "/r/college/comments/klbczn/community_college/gh9h20j/",
              "text": "I hope you realize now that, that was not a friend.",
              "author": "anonomousbluefox",
              "created": 1609132922,
              "upvotes": 3,
              "replies": {
                "gh9hxly": {
                  "link": "/r/college/comments/klbczn/community_college/gh9hxly/",
                  "text": "Yeah I realize that now! And I haven't hung out with her in almost two years. I think the nail in the coffin was when I finished college (in time, first in my friend group to), and got a decent paying job so I was no longer the most broke, and no one congratulated or cared. \n\nBut I was stuck on that \"better to have toxic friends than no friends at all\" mentality and was afraid to be alone (that entire friend group was like that). It's crazy how much happier I am with practically no friends than I was with toxic friends. But I'll admit it gets lonely sometimes.",
                  "author": "scorodites",
                  "created": 1609133544,
                  "upvotes": 1,
                  "replies": {
                    "gh9iqua": {
                      "link": "/r/college/comments/klbczn/community_college/gh9iqua/",
                      "text": "Congratulations on all your success, and welcome to the club of adulting loneliness. Lol what gets me through it when i start feeling that itch... I sit back and think of ALL the drama left behind! All the petty crazy BS, cause you decided to wear the same black dress, but your the slut for wearing it BS!",
                      "author": "anonomousbluefox",
                      "created": 1609134129,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gh9ka93": {
              "link": "/r/college/comments/klbczn/community_college/gh9ka93/",
              "text": "I've commented this before but I'll say it again. I had a friend attend a 4 year university right after we graduated high school while my sister and I both attended CC. I paid maybe 2k for the first 2 years and she said \"after my first year I'm only going to owe 20k\". It's been 4 years, we owe nothing and she's still at the uni owing who knows how much",
              "author": "aylgar",
              "created": 1609135290,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gh863ku": {
          "link": "/r/college/comments/klbczn/community_college/gh863ku/",
          "text": "In my area they have a reputation for fucking over students that aren't there for the trade school. Particularly they tend to recommend classes that aren't correct for the degree the students want to get when they transfer to a university, then students lose hours of credits and waste a ton of time.",
          "author": "Aringhet",
          "created": 1609107188,
          "upvotes": 15,
          "replies": {
            "gh86vu7": {
              "link": "/r/college/comments/klbczn/community_college/gh86vu7/",
              "text": "So depending on the state/country you live in there may be websites online that could help you determine the classes that you need for transferring. \n\nFor example, I live in California and if you want to attend a public university in CA, the site [Assist](https://assist.org/), helps you determine the exact classes that you need without a councillor. \n\nI’m sorry that has been your experience though, councillors can be the worst.",
              "author": "Lamp9106",
              "created": 1609107599,
              "upvotes": 16,
              "replies": {
                "gh8f7th": {
                  "link": "/r/college/comments/klbczn/community_college/gh8f7th/",
                  "text": "Some colleges have sites that show you the classes offered at local community colleges and what they transfer as at their own school.\nUniversity of Pittsburgh offers this with CCAC.",
                  "author": "Ozymandias_2000",
                  "created": 1609111939,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "gh8ak7q": {
              "link": "/r/college/comments/klbczn/community_college/gh8ak7q/",
              "text": "I'm in a large city on the border of 2 states and there are quite a few colleges here and they all do that. Everything from the community colleges to the large public state schools to the several private schools. The only ones that don't do it are the small private schools that have a small number of degree programs.",
              "author": "squirrel8296",
              "created": 1609109503,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gh924za": {
          "link": "/r/college/comments/klbczn/community_college/gh924za/",
          "text": "> People make it seem like you are a lazy/bad student for going to one and that 4-years are for the “hard workers” of the world.\n\nNot just this -- in addition to the \"only dumb kids go to CC\" stigma, there's the \"only poor people go to CC\". Reminds me of a comment in another thread: \"money is only a proxy: Status makes the world go 'round\". People will go to a four-year and go into debt rather than saving their money, so as to not look poor.",
          "author": "TrekkiMonstr",
          "created": 1609124068,
          "upvotes": 10,
          "replies": {}
        },
        "gh814sq": {
          "link": "/r/college/comments/klbczn/community_college/gh814sq/",
          "text": "Yes! I love attending community college! Especially this year that it’s all online.",
          "author": "louisepesto",
          "created": 1609104653,
          "upvotes": 24,
          "replies": {
            "gh9377i": {
              "link": "/r/college/comments/klbczn/community_college/gh9377i/",
              "text": "Online is the best. I wish that all classes that don't require special amenities (like gyms and dance studios, science labs, mechanics workshops, art studios, theatre, A/V equipment) were available online all the time. And all print library materials should be converted to digital.",
              "author": "turquoiseblues",
              "created": 1609124639,
              "upvotes": 6,
              "replies": {
                "ghbaia2": {
                  "link": "/r/college/comments/klbczn/community_college/ghbaia2/",
                  "text": "There's a lot of textbooks in pdf format  if you don't mind piracy.",
                  "author": "whathaveyoudoneson",
                  "created": 1609182053,
                  "upvotes": 2,
                  "replies": {
                    "ghd4tra": {
                      "link": "/r/college/comments/klbczn/community_college/ghd4tra/",
                      "text": "I am aware 😈",
                      "author": "turquoiseblues",
                      "created": 1609217894,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "ghes04s": {
                      "link": "/r/college/comments/klbczn/community_college/ghes04s/",
                      "text": "I’d like to know if you don’t mind 👀",
                      "author": "Jadad03",
                      "created": 1609263298,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gh95i2v": {
          "link": "/r/college/comments/klbczn/community_college/gh95i2v/",
          "text": "Wow I’m a senior and I have a 2.8 gpa, It was higher the years prior but I couldn’t concentrate from problems I had at home, what would you say made you get a higher gpa in college the environment, or the way the assignments are set in CC?",
          "author": "dmslider69420",
          "created": 1609125861,
          "upvotes": 3,
          "replies": {
            "gh993dg": {
              "link": "/r/college/comments/klbczn/community_college/gh993dg/",
              "text": "So honestly CC classes were much easier for me. As long as you go on Rate-my-professor and find a good teacher for the class, you are almost guaranteed an A. \nHint: when in doubt, always look for a quizlet",
              "author": "Lamp9106",
              "created": 1609127817,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "gh91lon": {
          "link": "/r/college/comments/klbczn/community_college/gh91lon/",
          "text": "This is a great story. Congrats on your success.",
          "author": "turquoiseblues",
          "created": 1609123775,
          "upvotes": 3,
          "replies": {}
        },
        "gh9f9vm": {
          "link": "/r/college/comments/klbczn/community_college/gh9f9vm/",
          "text": "Yep, the stigma against community college is ridiculous. Had undiagnosed adhd throughout most of my high school years which led to a 2.17 gpa and flunking many classes, on top of the mental issues that arose from all of that. Went to community college for a couple of years and worked my ass off before transferring this fall. People would ask me what I was doing or which college I was going to and I would sheepishly have to say “community college”, waiting for a reply that seemed to put down where I was going. \n\nI received some unkind responses but never let it phase me and now I’m finishing out my undergrad at one of the most prestigious and rigorous engineering universities in the world (my major being Mechanical Engineering). And despite CC’s reputation for being “easier”, I still got 3 A+’s and 1 A for my first semester at my new university. \n\nI feel incredibly blessed that I was given a second chance at receiving a good education and am thankful for the time I spent at community college. I met so many hard working professors and students who I still keep in touch with and who are doing incredible things. I know people who are getting PhD’s in engineering at MIT and Stanford and who also started out at community college. Some people decide to go to community college cause of money and others because they didn’t do so well in high school. All of these reasons are perfectly valid and we shouldn’t think of anyone as being “less than” for not going to a 4 year university straight out of high school. It was a great choice for me and it allowed me to grow and gain skills and experiences that I probably would not have gotten if I went straight to university.",
          "author": "simerlinn",
          "created": 1609131683,
          "upvotes": 3,
          "replies": {
            "gh9g4iu": {
              "link": "/r/college/comments/klbczn/community_college/gh9g4iu/",
              "text": "Exactly! It is the perfect second chance for many people and is a great opportunity for everyone financially, academically, and mentally! Congratulations on your success, you should be proud.",
              "author": "Lamp9106",
              "created": 1609132272,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ghb75qv": {
          "link": "/r/college/comments/klbczn/community_college/ghb75qv/",
          "text": "Same here. I think CC teaches you how to be a successful college student. I have two associates and am now in an ABSN program. I had no debt when starting my program. Meanwhile all my classmates are already thousands of dollars in the hole with bachelors from universities.",
          "author": "FitLotus",
          "created": 1609180392,
          "upvotes": 3,
          "replies": {}
        },
        "ghb7ozl": {
          "link": "/r/college/comments/klbczn/community_college/ghb7ozl/",
          "text": "Two grand? When I went to CC in 2017 it was roughly 3 grand a semester! You got a good deal.",
          "author": "annirosec",
          "created": 1609180661,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh80dsq": {
      "link": "/r/college/comments/klbczn/community_college/gh80dsq/",
      "text": "AP wasn't super available where I was, and CC was definitely looked down on/was in a college prep class that really urged university admissions vs CC. \n\nI ended up going to a CSU, but dropped out to go to CC after some personal stuff + not really knowing what I wanted to do. I really value CC, as it allowed me to jump around majors and take more interesting classes to figure out what I wanted, with low risk in terms of time and money (compared to universities). Ultimately transferred to UC Berkeley after a while at CC, and I intend to go to grad school after/lowkey would like the option to teach at a CC as it was very meaningful to me.\n\nThat said, I'm in California, and the CC to CSU/UC track is VERY streamlined and have resources to help like assist.org. Not all states make it that straightforward, unfortunately.",
      "author": "Hellodeeries",
      "created": 1609104284,
      "upvotes": 127,
      "replies": {
        "gh87fz5": {
          "link": "/r/college/comments/klbczn/community_college/gh87fz5/",
          "text": "I have several friends in California who did the CC to UCLA path and they are doing well. Seems like it’s more common in California than where I’m from in Texas where CCs have stigma attached to them for some reason.",
          "author": "1warrioroflight",
          "created": 1609107887,
          "upvotes": 36,
          "replies": {
            "gh87z7l": {
              "link": "/r/college/comments/klbczn/community_college/gh87z7l/",
              "text": "There's definitely some stigma still, but the path has been really ironed out so like....it is a lot more feasible than it sounds in other states. But it was definitely emphasized for me in HS to go to a university and that was honestly a bad choice right out of HS. My parents even pushed for it, so I can't really say it was me wanting to leave home fully, as it was an enforced thing from all the adults in my life. But I think it is also worth noting they went to college when it was far cheaper so the loan burden I signed onto when I was 17 was like...already more than what my dad had after he got his master's 🥴",
              "author": "Hellodeeries",
              "created": 1609108167,
              "upvotes": 14,
              "replies": {}
            }
          }
        },
        "gh8e005": {
          "link": "/r/college/comments/klbczn/community_college/gh8e005/",
          "text": "It was similar where I'm from (Ohio). My school district is small so they didn't have a robust program for things like AP or dual enrollment, so that was out. There's still that stigma around CCs, but so many people in our region were poor or had awful grades that the transfer system we have funnelled a lot of people into CC for a year or two before a 4-year school and saved us a lot of debt.",
          "author": "torgoboi",
          "created": 1609111300,
          "upvotes": 7,
          "replies": {
            "gh9pejh": {
              "link": "/r/college/comments/klbczn/community_college/gh9pejh/",
              "text": "I was just about to comment this! I know we have the MTA in Michigan but transferring credits in Michigan is a bit of a headache sometimes. I live in SE MI so I study in Toledo. I’m so grateful that the education/ credit system is universal and pretty painless in Ohio. They def know what they are doing!\n\nEdit: To elaborate, I went to a CC in Ann Arbor. I wanted to transfer my credits to UMich or MSU but it was a lot easier to just transfer my credits to UToledo somehow.. So that’s where I went. And along the way, I figured out that most Ohio students don’t have this problem at all. Like if you wanted to transfer credits from Owens to UT or UT to Ohio State University you could pretty painlessly and without much thought. It just seems universal in Ohio. Can’t say the exact same for Michigan.",
              "author": "bpwk07",
              "created": 1609139633,
              "upvotes": 5,
              "replies": {
                "gh9snw8": {
                  "link": "/r/college/comments/klbczn/community_college/gh9snw8/",
                  "text": "That's wild that Michigan gave you a harder time than Ohio! That seems extremely frustrating. I hope the difference in tuition wasn't too bad for you to come out of state for school.\n\nWe've definitely been lucky with our system. I have credits from my CC that didn't transfer over as the same class (for example, my developmental psych counted as a separate psych credit) but overall, it wasn't bad, so I feel lucky that I'm from here and had that experience.",
                  "author": "torgoboi",
                  "created": 1609142847,
                  "upvotes": 1,
                  "replies": {
                    "gh9td13": {
                      "link": "/r/college/comments/klbczn/community_college/gh9td13/",
                      "text": "I live in a city near Toledo, so thankfully I only get charged in-state tuition due to a local agreement between my city and UT. Plus, I have scholarships so it’s not too bad overall.",
                      "author": "bpwk07",
                      "created": 1609143577,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "gh9tdvq": {
                      "link": "/r/college/comments/klbczn/community_college/gh9tdvq/",
                      "text": "That’s great!",
                      "author": "bpwk07",
                      "created": 1609143602,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gh89cf7": {
          "link": "/r/college/comments/klbczn/community_college/gh89cf7/",
          "text": "Florida has a really streamlined path from cc to state universities too",
          "author": "BylvieBalvez",
          "created": 1609108873,
          "upvotes": 8,
          "replies": {}
        },
        "gh93er1": {
          "link": "/r/college/comments/klbczn/community_college/gh93er1/",
          "text": "Can I ask what it takes to get into UC Berkeley? One academic counselor at CCSF told me that she's seen 4.0 students not get accepted into UCB.",
          "author": "turquoiseblues",
          "created": 1609124752,
          "upvotes": 2,
          "replies": {
            "gh954ui": {
              "link": "/r/college/comments/klbczn/community_college/gh954ui/",
              "text": "The major and which college it falls into impacts it a lot! [This](https://www.universityofcalifornia.edu/infocenter/transfers-major) page is from UC Admissions and breaks down each major at each UC and the average GPA ranges that were admitted and enrolled from 2019. If you go to a CCC, can also look up the breakdown of your CCC's admit to the different UC's (though idk how much that aspect matters tbh - my CCC had pretty average admits but I've seen Bay Area CC's get more which makes sense bc proximity while my closer UC is Davis).\n\nMy major is on the easier end to get in, and is in the L&S college. The range was something like 3.5-3.9 is the avg admit GPA, and I was about a 3.77 when I applied and a 3.89 when I transferred. I had a rocky start at CSU, and early CC was mediocre, but I also just had a crapload of classes and generally did well just changed majors like crazy. The last 2 years before I transferred is where I pretty much averaged 3.9-4.0 semesters and my GPA increased a lot. Generally I see it noted that an upward trend can work heavily in your favor if you have some rocky areas in your transcripts early on. There is also a section in the UC App that you can go into areas of your transcript, and explain the discrepancies a bit.\n\nGoing back to GPA and major, some are incredibly impacted and do expect that 3.9+ GPA, but you have figure out if yours actually is or what the admit range is. In these more impacted areas, I'd probably rec getting into EC's that are major related (honestly rec that for any major, but especially impacted ones) as it further shows your interest in the major + it can be used in your PIQ's in the App as well. My major I ended up a TA and lab tech in the department, and it lead to an outside school internship and job. Was able to use it in both EC section and PIQ section, but just went over different aspects of it (EC was more straight forward/what my tasks and expectations were, hours, etc - PIQ was what I learned and how I grew from it).\n\nBerkeley specifically really wants the IGETC to be finished - a lot of the others it can be partial, but Berkeley has a larger emphasis on it and it streamlines the transfer process considerably. None of my credits were contested/had to be redone bc I had the IGETC finished, so I transferred over the max allowed 70 np.",
              "author": "Hellodeeries",
              "created": 1609125663,
              "upvotes": 6,
              "replies": {
                "gh9emqj": {
                  "link": "/r/college/comments/klbczn/community_college/gh9emqj/",
                  "text": "Wow, this is very helpful—thank you! And congrats on all your hard work and success.",
                  "author": "turquoiseblues",
                  "created": 1609131260,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gh7zbry": {
      "link": "/r/college/comments/klbczn/community_college/gh7zbry/",
      "text": "Social stigma. So, instead of community college, local state university, while dorming at home, they go off for four years. They come home with $30,000 of stafford loans. Mom and pop have parent plus loans of another $60,000 to $120,000. All for a degree that they could and should have gotten down the street for less than $30,000. Then they complain about how debt sucks, how unfair it is, and demand debt forgiveness for their poor choices. Cry about having to live at home because they can't afford to make payments, pay rent and eat at the same time.\n\nAbove is the answer!!!",
      "author": "Kimmybabe",
      "created": 1609103792,
      "upvotes": 1,
      "replies": {
        "gh8kf27": {
          "link": "/r/college/comments/klbczn/community_college/gh8kf27/",
          "text": "Reddit is not ready for this kinda answer yet!",
          "author": "Cheap_Lead",
          "created": 1609114626,
          "upvotes": 0,
          "replies": {
            "gh8npfc": {
              "link": "/r/college/comments/klbczn/community_college/gh8npfc/",
              "text": "I didn't say it would be popular.\n\nI'm surprised that I only have -1.\n\nSpeak truth and the world will take offense.",
              "author": "Kimmybabe",
              "created": 1609116353,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "gh7ykwh": {
      "link": "/r/college/comments/klbczn/community_college/gh7ykwh/",
      "text": "Most likely the social scene and wanting to get away from home. I know most of my friends chose big state colleges to go to because they wanted the general college experience. They wanted to get away from home, expand their social circle, and have fun without the worry of parents or siblings. A community college experince and an experince at a big state school can be widley different. Another is connections and internships. Many can feel like where they live doesn't let them expand their professional life. This can be due to location or connections with professors and/or the connections that the college can offer. If you go to a R1 research college and make good connections with your professors early on you can get good recommendation letters and be in their research cohort.\n\nCommunity college is a great opportunity financially and it's definitely a better path financially, but for many people, especially for one's right out of high school, finances aren't the only thing that is being looked at.",
      "author": "noelblossom",
      "created": 1609103432,
      "upvotes": 97,
      "replies": {
        "gh8a9gv": {
          "link": "/r/college/comments/klbczn/community_college/gh8a9gv/",
          "text": ">I know most of my friends chose big state colleges to go to because they wanted the general college experience.\n\nI see this a lot and think its the worst possible reason to go to college ever. There are scenarios that it'd make sense such as receiving full-ride scholarships, or having someone else pay for your college. But if that's not the case (like it is for most people) then I think its an awful way to look at college and is probably why so many people are in as much debt as they are.",
          "author": "GennaroIsGod",
          "created": 1609109348,
          "upvotes": 12,
          "replies": {
            "ghar2gf": {
              "link": "/r/college/comments/klbczn/community_college/ghar2gf/",
              "text": "I mean many people look back at college as the best time of their lives. I’m not saying the social scene should be the *only* reason, but it being a reason I think is definitely legitimate. Last year was the most fun I’ve ever had in my life (I was a freshman) before COVID hit. I don’t see myself making any meaningful friendships in community college but since I go to a state school, I met a lot of people that I’m still close with in my dorm and we had very fun times that I will never forget. If you add on all of the other things this person mentioned, I think it’s worth it for in state tuition.",
              "author": "lil_layne",
              "created": 1609172156,
              "upvotes": 5,
              "replies": {
                "ghb1goa": {
                  "link": "/r/college/comments/klbczn/community_college/ghb1goa/",
                  "text": "Agree! I got a lot of financial aid and scholarships, so maybe I'm not the target group of this post, but being able to get out my parents' house for college did wonders for my mental health. I had the worst time mentally the latter half of high school, and I most definitely needed an environmental change along with the freedom of living alone to save me from fucking myself over grade wise. \n\nUnfortunately, COVID is fucking over my mental health again, but I look forward to the time where everyone is vaccinated and we can go back to relative normalcy.",
                  "author": "Zap_Apple",
                  "created": 1609177546,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gh9e8re": {
              "link": "/r/college/comments/klbczn/community_college/gh9e8re/",
              "text": "People are 17-18 years old making these major decisions and not realizing the long term consequences of student loans. Frankly, they just see a “college experience” and “free money right now”. I’d like to do a survey of all the people I know who are away for college that understand how loans and credit work. Chances are probably very few of them would be able to thoroughly explain it. \n\nWhile I do believe in personal responsibility, the American public high school system definitely has some onus in this problem. Most schools don’t teach personal finance or even explain the process & options for college. I was lucky to have an economics teacher my senior year who went over it outside of the curriculum and a dedicated college counselor who constantly was explaining the process. But even before that, my parents explained basic personal finance to me. Not many schools or students are as lucky.",
              "author": "danielr088",
              "created": 1609131001,
              "upvotes": 10,
              "replies": {
                "ghbg7f9": {
                  "link": "/r/college/comments/klbczn/community_college/ghbg7f9/",
                  "text": "I’m not saying CCs are bad (my local ones are though). However, not every student at a 4-year has student loans at all, and some internships explicitly do not hire community college students (while they are at the community college, once they transfer its fine). Also besides Ca CCs it can prolong your gradation.",
                  "author": null,
                  "created": 1609184909,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gh9avza": {
              "link": "/r/college/comments/klbczn/community_college/gh9avza/",
              "text": "Yup",
              "author": "turquoiseblues",
              "created": 1609128869,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh7y3fp": {
      "link": "/r/college/comments/klbczn/community_college/gh7y3fp/",
      "text": "There are some pros and cons to going to a CC and most involve resources and oppertunities offered at a CC. Personally it worked excellently for me, but I also felt like I was lacking a lot of things and the last two years after transfer was really a rat race to develope myself for graduate school.",
      "author": "safespace999",
      "created": 1609103181,
      "upvotes": 15,
      "replies": {
        "gh9b42i": {
          "link": "/r/college/comments/klbczn/community_college/gh9b42i/",
          "text": "What were you lacking?",
          "author": "turquoiseblues",
          "created": 1609129008,
          "upvotes": 1,
          "replies": {
            "gh9cb56": {
              "link": "/r/college/comments/klbczn/community_college/gh9cb56/",
              "text": "CC mostly do not prepare you for graduate school. Most of their goals are oriented to either rush students to get their AA, certificates, or to transfer out. Graduate school is really put on the back burner for most students.",
              "author": "safespace999",
              "created": 1609129751,
              "upvotes": 3,
              "replies": {
                "gh9e2sm": {
                  "link": "/r/college/comments/klbczn/community_college/gh9e2sm/",
                  "text": "It was my understanding that the track is generally two years of CC, transfer to a four-year university for upper-division classes, and then at that point graduate school is an option. So wouldn't those two years of upper-division classes at the four-year university prepare a student for grad school?",
                  "author": "turquoiseblues",
                  "created": 1609130892,
                  "upvotes": 1,
                  "replies": {
                    "gh9ek3m": {
                      "link": "/r/college/comments/klbczn/community_college/gh9ek3m/",
                      "text": "Not as much as you would think. By your third year you should be researching graduate programs and securing your internships, research oppertunities or work related experience to make you a competitive applicant ant. This is difficult for many students who just transfered and are getting the feel of campus especially if they have never really been told about graduate school or introduced to concept of a post grad program. By senior year you are already applying so really you have 1 year (I'd you choose to go directly after graduation) to basically wrap everything up and make yourself as competitive as possible. You also have a shorter time to establish rapport for letters of rec from unis whish is what grad programs expect.",
                      "author": "safespace999",
                      "created": 1609131211,
                      "upvotes": 5,
                      "replies": {
                        "gh9eshf": {
                          "link": "/r/college/comments/klbczn/community_college/gh9eshf/",
                          "text": "Oh, wow. Jeez, this seems much harder than it should be. It's basically a gate that keeps out the less privileged",
                          "author": "turquoiseblues",
                          "created": 1609131366,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "gh9q1ki": {
                      "link": "/r/college/comments/klbczn/community_college/gh9q1ki/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1609140241,
                      "upvotes": 3,
                      "replies": {
                        "gha41qy": {
                          "link": "/r/college/comments/klbczn/community_college/gha41qy/",
                          "text": "Thank you for this explanation! < _Sigh_ >",
                          "author": "turquoiseblues",
                          "created": 1609155095,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh7xxnz": {
      "link": "/r/college/comments/klbczn/community_college/gh7xxnz/",
      "text": "For the AP/college classes during high school, I’m guessing that some people are either intimidated/lack the confidence to take them, or they just don’t have those opportunities at their high school \n\nFor community college, ig it depends on the situation. Personally, CC wouldn’t have been worth it for me, but it works well for some ppl.",
      "author": "sohi_isherehehe",
      "created": 1609103099,
      "upvotes": 174,
      "replies": {
        "gh7ybjj": {
          "link": "/r/college/comments/klbczn/community_college/gh7ybjj/",
          "text": "Also, some people may not be fully aware of how much AP/other forms of high school college credit would help. I was blown away when I realized that I had over a semester’s worth of credits just from a few AP and related courses. It’s super helpful but I think a lot of high schoolers understandably just aren’t that familiar with how credits work in college.",
          "author": "SilverSquid1810",
          "created": 1609103297,
          "upvotes": 68,
          "replies": {
            "gh7z2iq": {
              "link": "/r/college/comments/klbczn/community_college/gh7z2iq/",
              "text": "Exactly. Compared to an actual intro college class, APs are a lot cheaper and easier. \n\nPlus if you took advantage of your AP curriculum, you should have most of your gen eds done, so no point to  2 years of CC anyway.",
              "author": "sohi_isherehehe",
              "created": 1609103667,
              "upvotes": 34,
              "replies": {
                "gh8e79g": {
                  "link": "/r/college/comments/klbczn/community_college/gh8e79g/",
                  "text": "I totally disagree, this must a regional thing or something? I’m in MN and taking college classes during high school was free and I felt like the classes were so much easier than my AP classes. With AP classes you have to pay $90 per AP test just to find out your college doesn’t give credit for AP.",
                  "author": "werikaa",
                  "created": 1609111405,
                  "upvotes": 9,
                  "replies": {
                    "gh8ete2": {
                      "link": "/r/college/comments/klbczn/community_college/gh8ete2/",
                      "text": "Maybe? I’m in NY. I did take CC classes during high school but it was like $300 per class :/ \n\nI would say the CC classes were easier than AP (like CC multivariable/linear algebra were easier than AP calc BC), but 4 yr college classes are much harder than both.\n\nMaybe it depends on the college tho. My college is kind of famous for trolling students with a terrible curve, esp for intro stem courses (I study engineering at Cornell).",
                      "author": "sohi_isherehehe",
                      "created": 1609111727,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "gh8o3b7": {
                      "link": "/r/college/comments/klbczn/community_college/gh8o3b7/",
                      "text": "Did you ever take CIS? Those were my favorite. Best of PSEO and AP combined.",
                      "author": "introvertedbassist",
                      "created": 1609116564,
                      "upvotes": 2,
                      "replies": {
                        "gh9qori": {
                          "link": "/r/college/comments/klbczn/community_college/gh9qori/",
                          "text": "Yes, I took one CIS class and we got to go on field trips to the U of MN. The class was so hard for some reason though lorddddd",
                          "author": "werikaa",
                          "created": 1609140863,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gh8a5fo": {
                  "link": "/r/college/comments/klbczn/community_college/gh8a5fo/",
                  "text": "Because of the number of APs I took in high school I had almost all of my Gen Eds out of the way when I entered college. I only had a class left here and there so going to a community college would have caused me to take longer to graduate.",
                  "author": "squirrel8296",
                  "created": 1609109288,
                  "upvotes": 11,
                  "replies": {
                    "gh8ctrm": {
                      "link": "/r/college/comments/klbczn/community_college/gh8ctrm/",
                      "text": "Same. I managed to rack in 20 credit hours through my AP classes. After one semester I was already a sophomore in college with most of my gen eds done and out of the way.",
                      "author": "RivenSpectrum",
                      "created": 1609110682,
                      "upvotes": 6,
                      "replies": {
                        "gh9ahex": {
                          "link": "/r/college/comments/klbczn/community_college/gh9ahex/",
                          "text": "That's astounding",
                          "author": "turquoiseblues",
                          "created": 1609128627,
                          "upvotes": 2,
                          "replies": {
                            "gh9cd0b": {
                              "link": "/r/college/comments/klbczn/community_college/gh9cd0b/",
                              "text": "Similar experience, personally. Combining my credits from community college classes in highschool and AP credits, I just graduated a year and a half early from undergrad just from the credits I was able to get done before even getting to college. Most of my Gen Eds were fulfilled and some prerequisites for other classes were covered by those credits too.\n\nIf people have the chance to, taking those classes can pay for themselves. I was basically taking all college classes my last two years of highschool and it helped me save a lot of money in college.",
                              "author": "Triston--",
                              "created": 1609129785,
                              "upvotes": 3,
                              "replies": {
                                "gh9dwhr": {
                                  "link": "/r/college/comments/klbczn/community_college/gh9dwhr/",
                                  "text": "Brilliant",
                                  "author": "turquoiseblues",
                                  "created": 1609130780,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gh8civl": {
                  "link": "/r/college/comments/klbczn/community_college/gh8civl/",
                  "text": "honestly i felt that AP classes were actually way harder than any intro class that it would cover",
                  "author": "ucantstopdonkelly",
                  "created": 1609110523,
                  "upvotes": 7,
                  "replies": {
                    "gh8cwtr": {
                      "link": "/r/college/comments/klbczn/community_college/gh8cwtr/",
                      "text": "It probs depends a lot on the rigor of your hs and college. \n\nPersonally I felt like the AP curves were a lot more lax compared to college (like getting a 5 in physics C is easier than even making a B in college physics), but that’s just my experience",
                      "author": "sohi_isherehehe",
                      "created": 1609110730,
                      "upvotes": 2,
                      "replies": {
                        "gh8gwpr": {
                          "link": "/r/college/comments/klbczn/community_college/gh8gwpr/",
                          "text": "I agree and it definitely depends on your hs teachers too. Mine taught APs the exact same way they’d teach a high school class, so we would be writing out 100+ vocabulary words per chapter every week which I have never had to do in college",
                          "author": "ucantstopdonkelly",
                          "created": 1609112817,
                          "upvotes": 1,
                          "replies": {
                            "gh8ix18": {
                              "link": "/r/college/comments/klbczn/community_college/gh8ix18/",
                              "text": "Wow that sounds like a grind. I would’ve hated that, my AP teachers were definitely not that bad (even memorization heavy classes like bio and us history)",
                              "author": "sohi_isherehehe",
                              "created": 1609113848,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gh8b2ln": {
                  "link": "/r/college/comments/klbczn/community_college/gh8b2ln/",
                  "text": "I get that AP is cheaper and easier than cc courses, but I'm not sure why we spend one year to finish one course at high school. I have finished College Biology, College Psychology, College Calculus 117, and College English 113 or 101 and if I took them like AP’s, I will spend one year to finish each of the courses while finishing them in one semester. Also for example AP Chemistry where we finish General Chemistry 1 semester 1 and General Chemistry 2 in spring. Why not take them at college and high schools should weight them the same as AP’s due to their rigor",
                  "author": "Omar-Dreaming",
                  "created": 1609109763,
                  "upvotes": 1,
                  "replies": {
                    "gh8co3d": {
                      "link": "/r/college/comments/klbczn/community_college/gh8co3d/",
                      "text": "Idk, personally I have no complaints, I think the pro of cheap and easy outweighs the con of being a year long \n\nDuring high school I did take some semester long dual enrollment classes at a CC (multivariable calc, linear algebra, economics) but my college didn’t accept that credit so now I just have to retake those math classes anyway lol",
                      "author": "sohi_isherehehe",
                      "created": 1609110600,
                      "upvotes": 3,
                      "replies": {
                        "gh8fdex": {
                          "link": "/r/college/comments/klbczn/community_college/gh8fdex/",
                          "text": "Damn, what college you are going to because my cc courses will be transferred to UIUC",
                          "author": "Omar-Dreaming",
                          "created": 1609112022,
                          "upvotes": 1,
                          "replies": {
                            "gh8g4hn": {
                              "link": "/r/college/comments/klbczn/community_college/gh8g4hn/",
                              "text": "Cornell, and they actually do take like AP calc BC credit and stuff, they’re just weirdly really not into dual enrollment credit \n\nI’m lucky bc I’m at the engineering college. For some reason the arts and sciences college is even pickier about AP Stem credit (no idea why)",
                              "author": "sohi_isherehehe",
                              "created": 1609112404,
                              "upvotes": 2,
                              "replies": {
                                "gh8gghq": {
                                  "link": "/r/college/comments/klbczn/community_college/gh8gghq/",
                                  "text": "What about college courses are they weight alike or are college courses even have a weight. Also luckily have taken some like AP Chemistry, Physics, and Honors Microbiology and etc\n\nI'm applying there and for Biochem, and yes I don't care about whether they take or not as if I were accepted in the first place",
                                  "author": "Omar-Dreaming",
                                  "created": 1609112578,
                                  "upvotes": 1,
                                  "replies": {
                                    "gh8je2n": {
                                      "link": "/r/college/comments/klbczn/community_college/gh8je2n/",
                                      "text": "Im not sure if I understand your question about college courses having a weight. If you’re asking about weight in the context of like GPA, my high school only used UW, and in college your credits that transferred from hs appear on your transcript but don’t count for your gpa",
                                      "author": "sohi_isherehehe",
                                      "created": 1609114094,
                                      "upvotes": 2,
                                      "replies": {
                                        "gh8jkn5": {
                                          "link": "/r/college/comments/klbczn/community_college/gh8jkn5/",
                                          "text": "Oh then that's good because my unweighted is 4.0 and have some AP’s within. I just took them because they are more rigorous than Honors and CP classes",
                                          "author": "Omar-Dreaming",
                                          "created": 1609114186,
                                          "upvotes": 1,
                                          "replies": {
                                            "gh8k250": {
                                              "link": "/r/college/comments/klbczn/community_college/gh8k250/",
                                              "text": "Yeah from what I’ve heard, colleges recalculate hs gpa anyway so no stress",
                                              "author": "sohi_isherehehe",
                                              "created": 1609114440,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gh8nu9e": {
                      "link": "/r/college/comments/klbczn/community_college/gh8nu9e/",
                      "text": "High schools gave different schedules than colleges so they generally have stretch out the curriculum over a year. Plus, a lot of the AP courses fulfill requirements to your diploma. If you have to take a year of high school biology, honors biology, or a year of AP bio, why not take the AP class? \n\nI do prefer college course programs like CIS or PSEO since you get credit just by passing the course but those kind of programs aren’t offered as often as AP classes.",
                      "author": "introvertedbassist",
                      "created": 1609116426,
                      "upvotes": 2,
                      "replies": {
                        "gh8nxtr": {
                          "link": "/r/college/comments/klbczn/community_college/gh8nxtr/",
                          "text": "Lol took them both, but anyway I hope I got in",
                          "author": "Omar-Dreaming",
                          "created": 1609116481,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gh89umd": {
          "link": "/r/college/comments/klbczn/community_college/gh89umd/",
          "text": "I know people who didn't take AP classes because they didn't want to fail. At least with the normal classes, you only risk failing the class (as with all classes). But the AP classes, you can pass the class and still fail the exam. I had a friend that refused to take them with me because he didn't want to fail it. \n\nNot to mention that, at least at my school, AP classes tend to be harder and involved more work. Lots of high school kids (and adults too) aren't willing/able to see that short term sacrifices can (potentially) lead to long term success. I took AP classes myself and even I didn't fully realize how valuable they were until I got to skip both English classes in college while my friends were writing essays. And going back to the first point, it sucks to put in all this effort all year just to fail that exam. At that point, it's like why take an AP when taking honors would've had the same result: high school credit and that's it.",
          "author": "scorodites",
          "created": 1609109134,
          "upvotes": 10,
          "replies": {
            "gh8bu4j": {
              "link": "/r/college/comments/klbczn/community_college/gh8bu4j/",
              "text": "Totally agree. Way easier to get a 5 on AP lang/lit than adding an writing class to a college course load later \n\nIt definitely sucks to not do well on the exam, but the AP curves are also lot easier than college curves. And even if you put in a lot of work throughout the year and don’t end up getting credit for it, imo no big loss, pushing yourself in high school will make adjusting to college a bit easier, and that has merit on its own",
              "author": "sohi_isherehehe",
              "created": 1609110161,
              "upvotes": 4,
              "replies": {
                "gh8df9v": {
                  "link": "/r/college/comments/klbczn/community_college/gh8df9v/",
                  "text": "Oh I agree with you 100%! I'm not afraid to admit that I passed as many AP exam as I failed (literally, failed and passed the same number of exams). But I'm also comfortable admitting this. I know someone in college that tried to retake a class because he got an A- in it. Not everyone is great at dealing with failing. And some people have extremely high expectations, either placed by themselves or their family.\n\nAlso, I kinda get that some people view failing as meaning they aren't smart/ capable. Ignorance is bliss. If you never take an AP class, you get to believe that you could've if you put in the effort, you just chose not to. You know, the \"I could quit at any time, I just choose not to\" rhetoric. But if you actually try then fail, you know now that you couldn't pass. Even if you failed because you had a terrible teacher or something, you still failed and have to live with that. Whereas if you never tried, you get to say \"well I'm sure I could've passed, I'm a great crammer and that subject is so easy.\" \n\nAnd yes, this used to be my mentality before I realized that I'd rather know than not know.",
                  "author": "scorodites",
                  "created": 1609110998,
                  "upvotes": 3,
                  "replies": {
                    "gh8dyfh": {
                      "link": "/r/college/comments/klbczn/community_college/gh8dyfh/",
                      "text": "Definitely, being comfortable with failing is something better learned sooner than later. I honestly still have to actively try to get out of that mindset. Let’s just say college classes have been a humbling experience for me and leave at that haha :D",
                      "author": "sohi_isherehehe",
                      "created": 1609111277,
                      "upvotes": 3,
                      "replies": {
                        "gh8eq8c": {
                          "link": "/r/college/comments/klbczn/community_college/gh8eq8c/",
                          "text": "Yeah for sure! To be honest it wasn't until after college that fully became comfortable with it. In grad school i got more okay with it as it was a lot harder than I thought it would be.\n\nBut I'm studying to become a CPA and this exam is kicking my ass. I remember having panic attacks in college over grades and now I'm like \"look if I fail, I fail. Not a big deal. I'll be okay. I am more than a grade on a test, this doesn't define me.\"  \n\nBut it took me a very long time to get to this point. I hope you get to this point too! And it sounds like you're getting there a lot sooner than me, which is awesome!! It might sound weird, but it's really freeing to accept that it's okay to fail and it doesn't define you.",
                          "author": "scorodites",
                          "created": 1609111683,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gh8c7vu": {
              "link": "/r/college/comments/klbczn/community_college/gh8c7vu/",
              "text": "Yeah i’m in only 1 AP and 5 honors this year(junior year). Am i screwed? I thought AP classes would be intimidating but apparently they aren’t. If i take a college class senior year and pass, can I still get the college credit or would it be too late?",
              "author": "peppathesheep",
              "created": 1609110360,
              "upvotes": 1,
              "replies": {
                "gh8e5kw": {
                  "link": "/r/college/comments/klbczn/community_college/gh8e5kw/",
                  "text": "You're not screwed at all! Tons of people don't take any AP classes at all. I'd recommend getting one of the AP exam review books though, I had a class that I thought was so easy (because our teacher wasn't the best at preparing us) and wound up failing the AP exam despite getting near perfect grades in her exams. \n\nAnd I took AP classes my senior year and it still applied for college credit! But just remember that (unless this changed), the exam scores come out in the summer. If you're registering for college classes in the summer, keep this in mind. I had a bit of a hassle because they insisted I enroll in stats for my first semester, but I wanted to wait and see if I passed the AP exam first. When I finally found out and tried to switch to a different class, the teacher I wanted was full.",
                  "author": "scorodites",
                  "created": 1609111382,
                  "upvotes": 2,
                  "replies": {
                    "gh8rel4": {
                      "link": "/r/college/comments/klbczn/community_college/gh8rel4/",
                      "text": "I’m registering for a college class for senior year during the regular school year. I chose not to take my AP exam this year in fear of failing and wasting my money. The class is AP Human Geography, which is one of the easier APs but is still a lot of work. I thought i wasn’t gonna learn anything during online school. I changed my mind but my AP coordinator wouldn’t let me. So next year I’m gonna actually take the exams for my classes(most likely Stats and Spanish) and do the dual credit class.",
                      "author": "peppathesheep",
                      "created": 1609118376,
                      "upvotes": 1,
                      "replies": {
                        "gh8tbcc": {
                          "link": "/r/college/comments/klbczn/community_college/gh8tbcc/",
                          "text": ">I chose not to take my AP exam this year in fear of failing and wasting my money.\n\nDo these cost money? I guess my school or state paid them. Damn that would suck to have to pay AP classes. \n\nAnd I think you should be fine! If you have to take stats and Spanish in college as part of your major, don't register for them for your first semester, and save it for the second semester or later. That way if you pass like I did, you don't have to scramble to change classes.",
                          "author": "scorodites",
                          "created": 1609119420,
                          "upvotes": 2,
                          "replies": {
                            "gh9q0ey": {
                              "link": "/r/college/comments/klbczn/community_college/gh9q0ey/",
                              "text": "My school doesn’t pay for them, but they subsidy it. But if it were free, I would have signed up for sure. I’m just worried about wasting money. And good advice! I’ll make sure i follow it if i have to take those courses.",
                              "author": "peppathesheep",
                              "created": 1609140210,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gh8fkwm": {
                  "link": "/r/college/comments/klbczn/community_college/gh8fkwm/",
                  "text": "You’re fine! You still have one year left. If any of your honors classes have an AP subject equivalent, taking the AP exam without being enrolled in the AP class is always an option (if you’re concerned about college credit). \n\nAnd any AP credit is good. I know international students who have 0 AP credit (not that they didn’t take advanced/rigorous courses, they just didn’t have AP classes available to them), and they still do fine in college, graduate on time (or earlier), etc",
                  "author": "sohi_isherehehe",
                  "created": 1609112127,
                  "upvotes": 2,
                  "replies": {
                    "gh8rksq": {
                      "link": "/r/college/comments/klbczn/community_college/gh8rksq/",
                      "text": "It’s too late to sign up for AP exams. i wish the deadline was closer to the exam day(like in March) because I would have more time to give my decision a bit of though. I have AP classes available to me, though, but I don’t think everyone takes the exams.",
                      "author": "peppathesheep",
                      "created": 1609118470,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "ghclpl4": {
                  "link": "/r/college/comments/klbczn/community_college/ghclpl4/",
                  "text": "You're not screwed! I would also advise looking into CLEP and DSST exams as well to get even more credits out of the way, without having to take a yearlong course.",
                  "author": "jenboas",
                  "created": 1609207052,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gh89k2a": {
          "link": "/r/college/comments/klbczn/community_college/gh89k2a/",
          "text": "I personally didnt have the opportunity to take college courses while in high school and the AP exams and my schools curriculum didn't allow students to excel in them.",
          "author": "biogirl787",
          "created": 1609108982,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634051557
}