{"sid": "e8de05", "link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/", "title:": "My parents are giving me so much shit for dropping out of college and doing something else. How do I deal with it?", "text": "So college wasn't for me. I ended never showing up to class, didnt really care if I failed a test or project. Honestly, it never phased me because I just had no motivation or desire to be there.I would just work. Took me like 3 years to realize I didn't have to do what my parents told me too. Though part of the problem, I think, is that I stayed in my hometown for college. Saved money but still have like $30k in debt, but I digress. \n\n\nSo I ended dropping out my junior year, crazy I know. But I was miserable. I couldn't take it anymore. My parents were pissed and dissapointed. I ended up joing the Marine Corps as an aircraft mechanic. Best job in the Marine Corps Btw.\n\n\nYeah, I dont make a lot of money. But I'm finally happy. I'm confident in myself and just feel great. I wake up WANTING to go to work even if it's only 4 am. I've made the best friends I've ever had and people I can count on.\n\n\nThe issue is, my parents dont even talk to me anymore. It's been like 4 months since I last went home didn't feel welcome. My little brother was the only one I can still bond with. But my parents don't treat me like before.", "author": "jorge921995", "created": 1575914188, "retrieved": 1632947813, "over_18": false, "upvotes": 792, "upvote_ratio": 0.97, "comments": {"fae2s5t": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fae2s5t/", "text": "Did your parents pay for your tuition costs?  I'd be upset if somebody fucked around on my dime for 3 years instead of just dropping out when they first realized they wouldn't succeed in college.", "author": "enyoron", "created": 1575992454, "upvotes": 2}, "fae1hzx": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fae1hzx/", "text": "Dude thats amazing that you found a career that you're happy with, not everyone gets to reach that path after dropping out. Don't worry man, eventually they'll learn that your happiness is greater than any high paying job out there. Also, how did you justify dropping out to them? Did you say that you were miserable?", "author": "Mistuh_Mosbi", "created": 1575991631, "upvotes": 1}, "fae13g5": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fae13g5/", "text": "My path was similar. I went to college for a couple of years and then joined the Army. When I got out I had the motivation and discipline to go back and do well in school. I got a degree in Information Systems and have worked in IT ever since. \n\nWhen you get out you can go back to school or get a great paying job with one of the air lines or aircraft manufacturers. Your parents should be proud of your service to your country. Shame on them!", "author": "WillieB52", "created": 1575991365, "upvotes": 2}, "fadvaqh": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fadvaqh/", "text": "Do what makes you happy, you’re not here for the approval of others, you’re here for o do what you love", "author": "Iron--", "created": 1575987262, "upvotes": 1}, "fadpgt6": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fadpgt6/", "text": "Parents always want more for you and believe that a college education will grant that. Ask anyone and they'll tell you that they are not what their parents expected to be. You've found yourself and your parents have to get to know the new you.   \nOne thing I will mention is maybe get some CLEP/DSST tests out of the way so if you do college again at some point, you'll have most of your generals out of the way.", "author": "Furzball", "created": 1575982251, "upvotes": 1}, "fadh6vh": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fadh6vh/", "text": "Did your parents both go to college and graduated? If no, then they have no right to bitch about you not doing it. I have the same issue with some older relatives. They never went to uni and think it's some kind of trade school you just show up and get a pass.", "author": "Thou-Shalt-Not-Thot", "created": 1575971362, "upvotes": 1}, "fad7qcc": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fad7qcc/", "text": "Bit the bullet and admit to being a failure", "author": "MotorButterscotch", "created": 1575958539, "upvotes": -2}, "fad5946": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fad5946/", "text": "Live in their basement, get obese, form a drug addiction, get multiple women pregnant, then leave and have your parents raise the kids, only for you to come back and have a tantrum because mom didnt buy you your chicken nuggies... the ultimate revenge plot. Fuck you Karen!", "author": "randomusername02130", "created": 1575955902, "upvotes": 1}, "fad4r2l": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fad4r2l/", "text": "You're a Marine!  That's awesome and too many people couldn't or wouldn't live up to their standards.  In the very least, you can look at it that way.  It's much better to realize your true calling than make your parents happy.  They love you, but they don't always know what's best.  This is all just so fresh and they need time to process everything.  I'd just let them work it out of their systems, then come to you and let them speak first.", "author": "xmarketladyx", "created": 1575955404, "upvotes": 1}, "fad2y78": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fad2y78/", "text": "You can always finish school when you get out if you want to. I don’t see the big deal.", "author": "ikilledtupac", "created": 1575953708, "upvotes": 1}, "fad1glh": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fad1glh/", "text": "Imagine having your kid understand that college wasn't meant for them so they go serve their country instead. Not only that, but they gain skills serving that directly translate into high paying jobs in the private sector\n\nTHEN IMAGINE BEING MAD AT THEM!", "author": null, "created": 1575952480, "upvotes": 1}, "fad0enn": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fad0enn/", "text": "You have a job now that is literally 100x better than nearly any college and you are learning one of the most obscurely well-paying low-intake trades in the world. Anyone who doesnt see that should realize how much better the trades are for this circumstance. (Alike me who hates schooling)", "author": "stalins_burnt_toast", "created": 1575951629, "upvotes": 1}, "facxwto": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facxwto/", "text": "If u ever go back to finish your degree one day you have the GI Bill in your back pocket now which is nice. Just don’t worry about them and do what’s best for you. It’s your life, if they don’t want to be a part of it then that’s on them.", "author": "Trip4Life", "created": 1575949737, "upvotes": 1}, "facxbg8": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facxbg8/", "text": "College is not for everyone that is extremely true. I hate how society acts as if college is the only way to be successful in life, there are soo many alternatives to a 4-year degree; You can start up a business, get a trade, go to community college and the military.\n\nA College degree will only get you a crappy 9-5 office job, or  a minimum wage job, or even unemployed with lots of debt for a degree that was not worth it at the end, unless you are lucky and get a good paying job with a degree you like and have little to no debt. Ask your parents about all of their nephews and nieces and kids they know who went to college, because the kids wanted to please their parents told them it's the only way to success, i bet those same kids have large student loan debt, working a shitty job, or unemployed living in their moms basement because they didn't follow their passion. No offense to parents but some of them can kill your dreams and passions.\n\nBut hey im happy for you, Aircraft mechanics make a decent salary i looked up.", "author": "Carloverguy20", "created": 1575949302, "upvotes": 1}, "facvl9d": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facvl9d/", "text": "Honestly do whatever makes you happy. If you weren't happy at college then why waste money doing it. I've gone and gotten my red seal in cooking and lasted 6 years in the industry but I've gone back to college to do something else because I wasn't happy. \nIf your parents aren't happy with you it's their fault not yours. If they don't see that you're happy with what you're doing then they need a reality check that people can be happy without going to college/university.", "author": "legot83592", "created": 1575948109, "upvotes": 1}, "facuptk": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facuptk/", "text": "You deal wit it by “dealing with it” and that means doing nothings \n\nThey will bitch and moan regardless of what they do", "author": "Xiscis", "created": 1575947503, "upvotes": 1}, "facra1t": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facra1t/", "text": "If you're happy, then that's all that matters. At the end of the day, when we die, we die alone. Not with anybody. No matter what anybody says to you, I strongly believe that you should follow your dreams and aspirations, no matter what anybody tells you. It's not like you went down a \"bad path\", through coping with drugs and alcohol, but rather decided to pursue a career where your passions lay. I suggest maybe going to therapy and talking about it with somebody, talking and discussing it with somebody always helps!\n\nGoodluck to you bud", "author": "rpoppop", "created": 1575945165, "upvotes": 1}, "facqwy7": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facqwy7/", "text": "30k in debt with nothing to show for it is beyond fucked.", "author": "PowSlayerr", "created": 1575944940, "upvotes": 5}, "facpl26": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facpl26/", "text": "The whole goal in life is to be happy so if your parents don't want you to be happy they can fuck off.", "author": "FakeFlipFlops", "created": 1575944198, "upvotes": 2}, "facphz7": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facphz7/", "text": "In my experience, I can never please my parents, so there's no use trying. All you can do is do you, and they'll either come around or they won't. Start sharing with them what you are doing in the Marines and how much you enjoy your job. If they see you being happy in what you're doing, they may be more likely to come around.\n\nI think part of it also is any parent would be disappointed to see their child get $30k into debt and have nothing to show for it. If you had gotten out before you accrued a ton a debt they might have been less pissed.", "author": "peregrin5", "created": 1575944149, "upvotes": 1}, "facoqs5": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facoqs5/", "text": "That's really sad, but it's honestly their loss. You're self-supporting and happy, and at the end of the day, those are the main goals of life. It takes most of us much longer than our mid twenties to get there.\n\nIf your parents can't be proud of who you actually are (as opposed to expecting you to fulfill their idea of who you should be), that's on them. Hopefully one day they will come around, but even if they don't, be proud of yourself for having the courage to take the path you knew was right for you.", "author": null, "created": 1575943728, "upvotes": 1}, "facmok7": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facmok7/", "text": "Please just be happy. Thing is you need to do well right now. Your parents will have to understand eventually that there is no point in making you feel miserable if they see that you truly are doing well for yourself in your chosen path. So, go ahead and feel great, man. All the best.", "author": null, "created": 1575942531, "upvotes": 1}, "facmgvn": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facmgvn/", "text": "Do you fam. Your parents get to make decisions over their life. You get to make decisions over yours. They can judge you but it’s not right. Let them know you don’t appreciate their lack of support and if they can’t learn to respect your autonomy then you can limit how much you tell them about your life decisions.", "author": "OTS_", "created": 1575942414, "upvotes": 1}, "facm97m": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facm97m/", "text": "Gonna get downvoted for this, but your parents did invest $30k into something you decided not to do. I would be pretty pissed too. If you dropped out your freshman year, it wouldent be as bad, but $30k is a lot of damage", "author": "jmora13", "created": 1575942296, "upvotes": 11}, "fackusx": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fackusx/", "text": "I feel the same way. I can't wait to get out of college and never look back.", "author": "theranger01234", "created": 1575941531, "upvotes": 1}, "fack9qy": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fack9qy/", "text": "It sounds like you were very immature and irresponsible. It's not like you even gave college a try. All you did was skip classes.\n\nI hope you are planning on paying back any costs your parents incurred during your three-year vacation.", "author": "ThatProfessor3301", "created": 1575941204, "upvotes": 0}, "facjqwn": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facjqwn/", "text": "DUDE, that an awesome job, plus in the marines is very bada$$!\n\nI feel about your parents expecting you to go to college, I am a freshman in CC and am expected to do the same thing", "author": "nateCod", "created": 1575940907, "upvotes": 1}, "facji1j": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facji1j/", "text": "Props to you for serving our country. I have so much respect for you. My dad was in the Marine Corps for 25 years. It sounds like you're doing well for yourself, and honestly, its your parents' problem that they are disappointed. They will wake up one day and realize how much of a mistake they made, not believing in you.  I'm sorry that your parents are acting the way they are. Everyone is amazing in their own way!", "author": null, "created": 1575940768, "upvotes": 1}, "facih7k": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facih7k/", "text": "In personal experience, college doesn't say what your life is going to be like. My father for example only has a high school degree. He took the test that lets you get out early and passed. He worked from then on out. He became manager of many different companies and even higher than that. Traveled all over the world doing presentations about stuff for the company he was with. He's an example that college doesn't mean everything.  \n\nCurrently, I'm going to college and wanting a PhD, but the biggest thing is that \\*you\\* are happy with your life. Not your family. You can show up to their house one-day, knock on their door and demand to talk to them. Tell them how you are happy with your life. That its ok if you aren't making as much as a doctor or whatever. You're making enough to support yourself. Tell them how you feel. I hope eventually they'll come around to see how happy you are. Invite them to important ceremonies you'll have in your life.", "author": "Deathly_Drained", "created": 1575940188, "upvotes": 2}, "facfd9s": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facfd9s/", "text": "Yeah you need that kind of happiness in your life but I think it's a little selfish for not consulting your parents about your decision. They're still your parents, they only want what's best for you, if you'd just talk and tell em it all, I think they'd understand.", "author": null, "created": 1575938418, "upvotes": 3}, "facdz72": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facdz72/", "text": "Tell them to pound sand. I’m proud of you for doing what you want instead of the norm. Best of luck.", "author": "staystoked001", "created": 1575937709, "upvotes": 1}, "facdsnc": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facdsnc/", "text": "My mom always told me that you know you've found the right job when you're happy to go to work. I graduated with a degree and a medical license, but I'm working at a retail store in the mall. Why? Because I'm happy with where I am! Sometimes we just need to find our own way. Everything falls into place eventually!", "author": null, "created": 1575937625, "upvotes": 1}, "facbfth": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/facbfth/", "text": "Some people come here with really tough situations.  This one is easy.\n\nFuck 'em.", "author": null, "created": 1575936524, "upvotes": 1}, "fac2zv3": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fac2zv3/", "text": "Are you parents immigrants? For my girlfriend finishing college was more so a way of showing appreciation for her parents' decades of hard work, rather than her personal goal. Often times immigrants come to America seeking better lives for their kids, and in their minds the main thing that will offer their kids a stable successful life is having higher education. Especially if you were three years in and they helped you with it or provided for your expenses or roof during that time, I'm not surprised they'd be upset. You're completely in the right in doing what you feel is right with your life, but make sure that its actually something you find value in and try to communicate your life goals and strategy with your parents. Make sure they know you have some time of trajectory planned out for yourself and aren't just \"going with the flow\" and because you find complacency in your lifestyle.", "author": "krazykarol123", "created": 1575932742, "upvotes": 17}, "fac1a50": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fac1a50/", "text": "I believe time will heal the issue with your parents. They just have to accept that you are your own person making your own. You're still being active in your own life and able to take care of yourself, and that is all that really matters. I think it is heavily ingrained in their mindset at a young age that college is the only way to be successful, but we are in 2019. They're so many different ways to be successful without going the traditional route.", "author": "Ether_of_Joti", "created": 1575931985, "upvotes": 2}, "fabylsx": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabylsx/", "text": "As long as you're doing your own thing and not relying on your parents its fine. \n\nI dropped college at 20 and joined the air force and now I'm back at 28.", "author": "Not_A_Greenhouse", "created": 1575930829, "upvotes": 2}, "faby4i4": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/faby4i4/", "text": "I don't know much about your parents or your upbringing, but not even talking to you anymore is such a painful length to go to for both parties. I grew up with a lot of pressure and conflict in my home that translated into trauma and I didn't even know it. Scrolling though r/raisedbynarcissists really helped me understand and cope with everything. You need to do what's best for your sanity and happiness. Super proud of you for making that bold life decision OP. It's badass that you're serving our country and having fun while doing it. I hope your relationship with your parents can heal with time and understanding, but know that no matter what the circumstances, their pride should never outweigh your mental health. If you know you're making a good decision for you, everyone else can fuck off. Peace & love from FL", "author": "spazbagz", "created": 1575930622, "upvotes": 1}, "fabx4kl": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabx4kl/", "text": "Do you plan on making the military your career?  If not, what do you want to do  as a career after your 4 years are up?", "author": "wolf2600", "created": 1575930202, "upvotes": 11}, "fabwdeb": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabwdeb/", "text": "You dropped out and immediately went into another career path. You didn't fuck off into the basement and do drugs all day. You've got nothing to be ashamed of and everything to be proud of. You figured out that college wasn't the path for you. The fact that you did poorly for a few years and ended up with debt isn't really your fault. Society and your parents pressure you and many others like you at too young of an age to make this big-ass expensive decision that isn't right for everyone. \n\nI'm sorry your parents are being asswipes. You don't deserve that. \n\nI can't tell you how to deal with it or convince them, but keep doing what you're doing and follow your own path. There's also /r/internetparents should you find yourself needing stand-in parental advice.", "author": "Naolini", "created": 1575929878, "upvotes": 233}, "fabw8ia": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabw8ia/", "text": "That’s rough man. Hope you can deal with this.       Semper fi", "author": "flynn-costa", "created": 1575929818, "upvotes": 3}, "fabux7j": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabux7j/", "text": "They’ll get over it once they see you thriving and realize that college alone doesn’t make someone successful in life.", "author": "GentleMenace", "created": 1575929220, "upvotes": 5}, "fabrbzu": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabrbzu/", "text": "If your parents aren't going to support you, what are you even gaining from continuing a relationship with them?", "author": null, "created": 1575927549, "upvotes": -3}, "fabr5bq": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabr5bq/", "text": "Become financially sound and prove you can be successful without your degree.\n\nAlso this is r/college so, to be honest, we aren't exactly the best resource for someone who isn't interested in college. I'd suggest posting on Ask Reddit too.", "author": null, "created": 1575927467, "upvotes": 28}, "fabpc74": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabpc74/", "text": "You don’t exist to make your parents happy. You are happy being an aircraft mechanic in the Marines and that is all that matters. Your an adult and forging your own path. Your parents should be proud of you but instead it shows a poor/toxic relationship since it appears that their love is conditional not unconditional. \n\nYou can always go back to school later if thats what you want do after you finish your time in the service.", "author": "Flashmode1", "created": 1575926698, "upvotes": 2}, "fabot8s": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabot8s/", "text": "I would try and have an honest converstation with you parents. I would explain to them that:\n\na) College isn't for everyone.  \nb) You gave it an honest go.  \nc) Right now your feeling very fulfilled in your current employment.  \nd) if things change you could consider going back to university/college.\n\nAs a parent one of my biggest fears is that my kid will turn into a fuck up, because nothing says I'm a shitty parent like a kid that's a fuck up. I'm sure they just aren't letting you know that. It's also hard for parents to let kids go ahead a try new things when they disagree. My sixty one year old dad has the same problem with his almost forty year old son (me).", "author": "reubendevries", "created": 1575926469, "upvotes": 4}, "fabe67s": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabe67s/", "text": "You won't be happy when that 30k turns into 60k and comes knocking.", "author": "Skueek", "created": 1575921855, "upvotes": -6}, "fabdeqc": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fabdeqc/", "text": "If you’re happy, then that’s what matters.  It’s true that college isn’t for everyone, and there is absolutely nothing wrong with leaving.  Don’t let anyone tell you there is.  I’m sorry that your parents are behaving childishly the way they are, but you do not need to feel any guilt about they way they choose to behave.  If I was your parent, I’d be wishing for you to find what makes you truly happy.", "author": "jon4702", "created": 1575921518, "upvotes": 91}, "fab9poy": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fab9poy/", "text": "I think you should still finish. A big part of college is seeing something that is difficult and time-consuming through the end. They shouldn't be shunning you, that is unfair and you are still their child. But honestly I understand why they would be upset.", "author": null, "created": 1575919901, "upvotes": 37}, "fab81d7": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fab81d7/", "text": "College isn't for everyone! You should be happy with what you chose for yourself. If you love it and stay in for a while you'll have the GI bill to pay off your loans and maybe when you get older you'll be ready to try the degree route again. If not, there is plenty you can do otherwise.", "author": "uglybutterfly025", "created": 1575919159, "upvotes": 3}, "fab61we": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fab61we/", "text": "All you really need is to be happy with what you do and figure out how to be financially stable with those choices. Also, college should not be more important than your own child. That's some family you have... if I could I'd tell you to join my family.", "author": "semelendez", "created": 1575918292, "upvotes": 346}, "fab35us": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fab35us/", "text": "Prove m wrong. Be happy with your choice and live with it. I fucked up my first 5 years in college (Dutch variant) and eventually ended up in a good spot", "author": "dutchbarbarian", "created": 1575917099, "upvotes": 7}, "fab0hpx": {"link": "/r/college/comments/e8de05/my_parents_are_giving_me_so_much_shit_for/fab0hpx/", "text": "I know you said it wasnt for you and you seem really happy with your new job, congrats btw for finding something you enjoy :) \n\nBUT\n\nyou were close to finishing school... would you want to finish school through online courses? just maybe 1 or 2 classes a semester. I mean if you finished school and your parents watched you cross that stage it would make them so proud BUT again its not just about them being happy, you need to be happy too. Just a thought though. Im really happy you found something you like.", "author": "Mackayme", "created": 1575916073, "upvotes": 83}}}