{
  "sid": "r3z56w",
  "link": "/r/college/comments/r3z56w/seeking_help_and_advice/",
  "title:": "Seeking help and advice",
  "text": "I am a first year mechanical engineering student in search of help. I have procrastinated far too much this semester and I think I am definitely going to need to withdraw from 2 of my classes. I have D’s in both classes and with only 2 weeks left in the semester I just don’t know what to do. Like these 2 classes are 4 credits each. That means I will pass the semester with 4 credits. I don’t even have a job. I see other people living much harder lives than me and I feel like I can’t even keep up with mine. I just don’t know what I should do. Any help is appreciated. Thanks.",
  "author": "ithinkiamonreddit",
  "created": 1638086075,
  "updated": 1638206829,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmdx4v0": {
      "link": "/r/college/comments/r3z56w/seeking_help_and_advice/hmdx4v0/",
      "text": "First off, don’t compre yourself to other people. I’m very guilty of doing that myself, but it’s not fair to put yourself in the place of others. We each have an amount of work we can deal with and that’s going to differ person to person. \n\nSecond, is it possible at all to raise any of your grades prior to finals? Look for extra credit, late assignments for partial credit, and just turning in any regular assignments from now until the end of the semester. Even a half a percent increase in your grade could mean the difference between passing and not passing and a D is not that far off from the passing range. \n\nThird, take advantage of any extra outside assistance. Office hours to have one on one time with your professors even if it’s just so they are aware that you care about your grade, tutoring or SI work, YouTube videos, study groups, ect. \n\nFourth. Extra practice problems. I was in basically the same predicament my freshman year. I was failing my Thermo class pretty badly with my two exam scores being a 64% and 37%. I think I had a 65% overall going into the final. And extra practice problems from my text book saved me. I did nearly every problem I could. I ended up passing the class with a 72 when I got a B on the final. If your professors are your standard ME professors, most will have problems similar to your text books on exams. \n\nIf at the end of the day, you still fail or need to withdraw, don’t beat yourself up about it. Even tho I passed that thermo class, the next year I ended up actually failing one of my courses. It’s not the end of the world even tho it sucks. The average amount of time it takes to complete undergrad is five years, and you’re in a tough major. Keep your head up, the first year is tough but if you make it through you’ll just keep getting better.",
      "author": "Former_Afternoon9662",
      "created": 1638094965,
      "upvotes": 1,
      "replies": {
        "hmfovry": {
          "link": "/r/college/comments/r3z56w/seeking_help_and_advice/hmfovry/",
          "text": "Thank you for your advice. I’ll take what you said into consideration.",
          "author": "ithinkiamonreddit",
          "created": 1638127640,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}