{
  "sid": "qnznj0",
  "link": "/r/college/comments/qnznj0/how_do_i_ask_my_professors_for_an_incomplete_in/",
  "title:": "How do I ask my professors for an Incomplete in their courses?",
  "text": "So I posted on here like a month ago asking for advice on what to do about flunking out of college due to my mental health. I got lots of great advice, as well as an appointment with a psychiatrist. I’m on the way to recovery and really want to fix what I’ve done with my academic career.\n\nI emailed my advisor and she told me to ask my professors for an Incomplete so that I still have a chance to pass. I’ve never had to do this before. I have no idea how to ask for this, like is it a big favor to ask? Do I need to do some groveling first? How much detail should I go into when talking about my mental disorders/mental health? Am I going to need documentation from my psychiatrist?\n\nAny help would be greatly appreciated because not knowing what to say is giving me really bad anxiety. I’m losing sleep over this!",
  "author": "lostgirl3000",
  "created": 1636203335,
  "updated": 1636655843,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjk1fu3": {
      "link": "/r/college/comments/qnznj0/how_do_i_ask_my_professors_for_an_incomplete_in/hjk1fu3/",
      "text": "At the universities I’ve worked for, Incompletes can only be given in the last few weeks of the course and when students are passing. If you’re already failing, you may be ineligible for Incompletes. If that’s the same situation at your university, then a better suggestion would have been to initiate a medical withdrawal due to your mental health. Advisors sometimes don’t give the best advice (ironically).\n\nIf there is no policy about Incompletes and you can just ask for them whenever, then it sounds like you could just email them and ask. It would be better, though, if you initiate the process with the Dean of Students, who will usually help you with documentation and advocacy. That will be taken much more seriously than a random individual email (even with documentation).\n\nYou don’t have to (and really should not) disclose specifics of your situation to your professors (this is part of what the Dean of Students can help with by providing their own documentation).\n\nGood luck!",
      "author": "PhDapper",
      "created": 1636210220,
      "upvotes": 6,
      "replies": {}
    },
    "hjknphf": {
      "link": "/r/college/comments/qnznj0/how_do_i_ask_my_professors_for_an_incomplete_in/hjknphf/",
      "text": "Depending on your situation with financial aid, it’s likely you’d be better off withdrawing from courses at this point. Everywhere I’ve taught, incompletes we’re reserved for students who had a major life event or illness right at the end of the semester so their was no time to make up the work. In grad school, incompletes will also be given sometimes when students need more time for research on a specific project/paper. But in both cases, the student had to already be in good standing. I have to put their current grade in with the request. If I tried to put in a request for an incomplete for a student who was not doing well in the class, the request wouldn’t be approved. I’m surprised that was your advisor’s recommendation.",
      "author": "begrudgingly_zen",
      "created": 1636219736,
      "upvotes": 2,
      "replies": {}
    },
    "hjte7zw": {
      "link": "/r/college/comments/qnznj0/how_do_i_ask_my_professors_for_an_incomplete_in/hjte7zw/",
      "text": "Hi there, i cant help you with your question but here is my short story to try and calm u a bit, since i have read your previous post.\n\n3 years ago i was going into second year of college, felt very depressed and down, which eventualy led from a guy with always very high grades to failing a year. I was in  bad spot, college very expensive and my parents put all their funds into it. I was lying to them that i was doing great and i ended up coming home having to explain why i failed. \n\nAfter long thinking i decided to give it a go once again. I was working and studying, helping out my parents as much as i could. I had only finished 1 year in college at that time, now i am in my last year, with a couple exams left, soon to get computer science degree, and i have never been in a better place. My grades are low, but who cares, i worked hard for them, back then i wanted everything perfect, probably the reason i failed.\n\nIn short, you are fine, its just a fluke. I think i red somewhere u are on your 3rd year, my advice is dont go on a brake, u are so close to finishing it, if you do take a year brake, u prob wont come back. Squeze out this year because 4th will be easier, seeing the end helps a lot! Explain to your parents, talk openly and state that you want to go again. Everyone makes mistakes.\n\nSorry for bad english, keep your head high, good luck!",
      "author": "Appropriate-Bat1067",
      "created": 1636387115,
      "upvotes": 2,
      "replies": {}
    }
  }
}