{"sid": "psoeji", "link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/", "title:": "Lurking professor with some study hacks... (long)", "text": "Hi folks, hope you don't find it bothering that I'm a professor who lurks.   But since Covid, I've joined this subreddit because I want to know what's going on with students' mental health, but don't want my students to feel weirded out if I ask.\n\nWhat I've learned is that a lot of you are Not Doing Okay.   And that Covid-19 and online learning is really, really stressing you out.   And I'm sorry that I don't have any good answers for that.\n\nBut the other thing I see is people struggling on how to study in college, which is so different from studying in High School.\n\nUnfortunately, a lot of students are missing out on the very thing that would help you out.  **I'm NOT SAYING THIS BECAUSE IT'S WHAT I THINK, I'M SAYING THIS BECAUSE THIS IS THE F\\*\\*KING SCIENCE.**\n\nThere have been SOOOO many epistemological studies about easy things you can change regarding note-taking that will literally improve your grades, your exams, and your general understanding.\n\nSome of you will know all of this already.  But note-taking isn't just something we're born knowing how to do and bugs the hell out of me that no one bothers to ever teach it.\n\nSo for those who don't know what are essentially \"study hacks\", here's the science:\n\n# #1) TAKING NOTES BY HAND AUTOMATICALLY STICKS INSIDE YOUR MEMORY MORE THAN TAKING NOTES ON A LAPTOP DOES, EVEN IF YOU NEVER LOOK AT YOUR NOTES AGAIN.\n\n(Link to the study: [https://cpb-us-w2.wpmucdn.com/sites.udel.edu/dist/6/132/files/2010/11/Psychological-Science-2014-Mueller-0956797614524581-1u0h0yu.pdf](https://cpb-us-w2.wpmucdn.com/sites.udel.edu/dist/6/132/files/2010/11/Psychological-Science-2014-Mueller-0956797614524581-1u0h0yu.pdf) )\n\nWhen it comes to remembering facts, like \"When did the civil war start?\" there wasn't much of a difference.  \n\nHowever, when it comes down to understanding the CONCEPTS, students who wrote longhand did unbelievably better.  As in three times better.   If you want to know why they did so much better, go to hack #2.\n\n# #2) USING YOUR OWN WORDS TO WRITE DOWN NOTES IS SO MUCH BETTER THAN WRITING DOWN EXACTLY WHAT THE PROFESSOR SAYS IN THE LECTURE.\n\nDirectly from the study: \"Overall, p**articipants who took more notes performed better whether or notebook or laptop,** β = 0.34, p = .023, partial R2 = .08. ***However, those whose notes had less verbatim overlap with the lecture performed \\[even\\] better,*** β = −0.43, p = .005, partial R2 = .12  \n\n\nFor instance, if the prof's slide says: \n\n`\"Psychologists have investigated a phenomenon known as “attitude inoculation,” which works on the same principle as vaccination, and involves exposing people to weak arguments against a viewpoint they hold.\"`  \n\n\nDon't write that down verbatim.  Write down what it \\*means\\* and in your own words.  Something like:\n\n`If you challenge someone's opinion with weak arguments, but a lot of them, they'll actually double-down on their opinion`\n\nOr, for real shorthand, fast\n\n`Lots of weak arguments = they'll double down`\n\nSo long as you can tell what that means.\n\n# #3) VISUALS HELP\n\nDraw whatever helps you understand the concept, be it graphs or maps or whatever.   Such as:  \n\n\nWATCH THIS VIDEO:  \n\nIt's from a guy that scored 99.9th percentile in his med school classes, and he attributes it to his note-taking skills:\n\nLINK:[https://medschoolinsiders.com/pre-med/study-less-study-smart-what-i-wish-i-knew-in-college/](https://medschoolinsiders.com/pre-med/study-less-study-smart-what-i-wish-i-knew-in-college/)\n\n&#x200B;\n\n# #4) HERE'S THE BIG BIG BIG BIG HACK THAT WILL SAVE YOU THE MOST TIME:\n\nReview your notes within twenty-four hours.  This can save you hours of extra studying in the long run.\n\nMake sure it's within 24 hours though!   Science isn't 100% sure why it has to be done within that time frame, but it could be because of (theoretical but certainly not debunked) \"neural dumping.\"  Basically, this means as you sleep at night your brain shits out all the information that is non-essential.\n\nGuess what's non-essential:  calculus.  history.  English lit.     Sure, not to you, but to your brain?  It says, \"F\\*\\*k it, we need the space.  Get rid of this crap.\"\n\nLet me know if any of this is helpful, or if it's just mostly annoying stuff that you already know.\n\nTake care guys.  It's only 4 years of hell, I promise.  After that, it's only 40 more years of hell in the workforce, but at least it's a different kind of hell.\n\n&#x200B;\n\nTL;DR:  You can save time with some easy changes.", "author": "emarcomd", "created": 1632247758, "retrieved": 1632800813, "over_18": false, "upvotes": 1500, "upvote_ratio": 0.98, "comments": {"he6vod3": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/he6vod3/", "text": "Think I have ptsd or rsd from number 1. Before my bp2/adhd diagnosis I had teachers yell at me for having a laptop. Being in my 30s and working in offices ment I can't write well. Very messy serial killer handwriting. The study you linked didn't load but the example my professors made came from a study done on teens. Yeah, in the 90s I could take notes and was an A student. As an adult I thought I was dyslexic but got diagnosed with other things. I also still write out my laptop notes. I'm an artist so drawing helps the most. That study didn't account for students writing things out after lecture. Which takes me hours. And the ODA office accommodations are trying to hold us to neurotypical standards. I failed a drawing class for instance but have sold thousands of pieces of art along with drawings and diagrams being published in books. I took biology 2 twice. Aced it at school 1. Transferred and had to take it again. Failed. Why? Couldnt use my laptop the second time. I spelled everything wrong or  couldn't read what I wrote or understand tricky wording. I know I misread things because I answered the same things correctly in other classes.", "author": "fsm888", "created": 1632550719, "upvotes": 1}, "he6n79r": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/he6n79r/", "text": "No offense to professor.....and I say this with respect......but I don't think these students need help figuring out how to take notes. These students are top of the class and they clearly do well in school. The topic of the discussion was the anxiety and very real problem of finding a job and having to acquire skills we don't have. We didn't need to use these type of skills to perform well in school.", "author": "Only-Perception-3755", "created": 1632545142, "upvotes": 1}, "hdv8fhh": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdv8fhh/", "text": "You are a good man. Thank you", "author": "idlimama", "created": 1632331214, "upvotes": 1}, "hdv6w4v": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdv6w4v/", "text": "Just use anki… 🤷‍♂️", "author": "Master-Commander93", "created": 1632330586, "upvotes": 1}, "hduz468": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hduz468/", "text": "From a first year college student coming back to academia after a decade lapse, THANK YOU. I do a lot of this already, exams are coming up and this was super helpful and made me feel less nervous. Big thanks, prof.", "author": "AmalgaNova", "created": 1632327436, "upvotes": 2}, "hduykbm": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hduykbm/", "text": "Thanks! I needed this as a freshman. Still having a hard time adjusting.", "author": "iamoftenclueless", "created": 1632327213, "upvotes": 2}, "hdunuph": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdunuph/", "text": "ur a saint fr 🙏🏽 ive barely been able to absorb anything lately", "author": "EdelwoodOil", "created": 1632322826, "upvotes": 2}, "hdue4m7": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdue4m7/", "text": "F**k it.This was super helpful.Arigato gozimasu", "author": "Classicrishi", "created": 1632318625, "upvotes": 2}, "hdue0sh": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdue0sh/", "text": "I don't usually do number #4. \n\nThanks for the tips Prof!!", "author": "StrawberryComplex613", "created": 1632318576, "upvotes": 2}, "hdtkttq": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdtkttq/", "text": "Train me for the next few days", "author": "MyOPservice", "created": 1632298277, "upvotes": 2}, "hdtffe0": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdtffe0/", "text": "Unfortunately, I’ve taken courses where the professors weren’t okay with note taking because they’d assure the slides and textbooks were enough. I’d start taking my notes once in a class and got called out, as well as others who did the same. Of course this doesn’t happen often as there are only 2 professors I know of that aren’t okay with this. I had to secretly take notes every time they turned their back to the board haha. But really, thanks for those tips, definitely worth a read to everyone no matter how their professors are.", "author": "detrimentalfallacy", "created": 1632293406, "upvotes": 2}, "hdt48ks": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdt48ks/", "text": "I recommend Apple Pencil + iPad (I got one for super cheap and in like-new condition on eBay) for notes. Also there are plenty of note taking apps out there, but I would recommend notability.", "author": null, "created": 1632285251, "upvotes": 2}, "hdt2xle": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdt2xle/", "text": "Wow. You’re post was amazingly helpful. Thank you OP -a first semester college student who is still trying to learn how to most efficiently study", "author": "Dream_catcher1111", "created": 1632284432, "upvotes": 2}, "hdt0l3j": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdt0l3j/", "text": "As someone who hand writes notes for multiple upper level science classes and can’t make heads or tails or other people’s notes I agree", "author": "Randomkindnessacts", "created": 1632283013, "upvotes": 2}, "hdsy0pb": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdsy0pb/", "text": "I adore you ♥️", "author": "strawberrysweetpea", "created": 1632281557, "upvotes": 2}, "hdsw5k1": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdsw5k1/", "text": "I definitely agree with the writing notes part. The classes that I took extensive notes on were usually classes where we could have a cheat sheet of 1 index card front and back. I would find a 0.5mm pen and rewrite important snippets and formulas that I needed. By doing so I knew exactly where to look for formulas and that eased both my time constraint and made me more proficient at taking tests too.", "author": "hippiesrock03", "created": 1632280542, "upvotes": 2}, "hdsqczw": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdsqczw/", "text": "\\+1 for writing things down. Made a huge difference for me.", "author": "tyttuutface", "created": 1632277541, "upvotes": 2}, "hdsq5la": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdsq5la/", "text": "I literally have a quiz tomorrow, thank you for this!", "author": "Aryll_", "created": 1632277441, "upvotes": 2}, "hdsnayl": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdsnayl/", "text": "This is so helpful, thank you!", "author": "SeaworthinessLocal21", "created": 1632276046, "upvotes": 2}, "hdslbr8": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdslbr8/", "text": "Cheers", "author": "MarshMallow1995", "created": 1632275100, "upvotes": 2}, "hdsktck": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdsktck/", "text": "Thanks Professor", "author": "Nevertrumper2019", "created": 1632274859, "upvotes": 2}, "hdshkns": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdshkns/", "text": "Thank you for the tips. This is really helpful.✨", "author": "Excellent-Letter-780", "created": 1632273319, "upvotes": 2}, "hdsfm2t": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdsfm2t/", "text": "Thank you professor for the hacks or tips I say", "author": "NonameideaonlyF", "created": 1632272387, "upvotes": 2}, "hdsexnf": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdsexnf/", "text": "Food for thought, especially for us slow writers...\n\nIf the lecture is prerecorded you can slow it to .75 speed.\n\nOr hit it at 1.25, and the pause when there is something you want to write down.", "author": "ROIIs360", "created": 1632272062, "upvotes": 1}, "hdscjft": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdscjft/", "text": "Hey professor,\n\nSome of my professors read off of powerpoints that only summarize the chapter. Said powerpoints leave out a substantial amount of information.\n\nI'm an ineffective note taker, and I learn more when I just do the readings prior to the lecture.\n\nSpring semester GPA - 3.75\n\nSummer semester GPA - 4.00\n\nCurrently taking 4 classes and I have near perfect scores in all of them, all are As (so far)\n\nI'm a business major, so I don't need to memorize all the chemistry formulas, or regurgitate information in say a history course. What I need to do is thoroughly understand the material.\n\nThoughts?\n\n(28 year old non traditional student, and I've found success by doing it \"my way\")\n\nI have taken notes when deemed appropriate, but I'm generalizing here.\n\nEdit: Also, I'm taking statistics, so although your posts do link to studies, could I just be an outlier if I were included in these studies?", "author": "SkeezySkeeter", "created": 1632270922, "upvotes": 1}, "hdsapmf": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdsapmf/", "text": "Honestly part of the reason why I am struggling is because I REALLY needed a gap year but can't because my parents will give me shit for it. I actually like the material I learn but right now I just want to focus on myself and work but I can't do that :(", "author": "TheRapidTrailblazer", "created": 1632270039, "upvotes": 2}, "hds8m4p": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hds8m4p/", "text": "It’s cool to see a prof sharing these tips, bless you.\n\nAs someone who recently finished my degree, I wanna second that tip about reviewing notes within 24 hours after. There were some classes where I had to record a lot of things verbatim because the profs talked so quickly, there wasn’t a chance to process a detail long enough to rewrite it in my own words. So I’d go back to my notes after class and rewrite them in a way that was more organized and personal, so it was easier to understand them when I needed to study.\n\nAlso if you have recorded classes, take advantage of that. Still go to your class, but if there’s a part of the lecture where your exhaustion is hitting you hard or you aren’t quite grasping something your prof is saying, write the time down on your notes. That way, you know what part of the recording you need to review later on.\n\nI will say I think « always write notes by hand » is one of those tips that everyone should try but some may not find it as helpful as others. I know the study it came from, but wow it just didn’t work for me. Remember most statistics have outliers. I always miss things when writing by hand, end up not even being able to read what I wrote later on, and get about 1/3 of the info down compared to when I type. It just made class stressful and I got hand cramps.\n\nWhat *did* work for me though was, if I needed to memorize information, going to my typed notes later and making flash cards of important details (or a hand written study guide) by hand. You still get the memorization benefit of writing things out but can do it on your own time.", "author": "TheConcerningEx", "created": 1632269024, "upvotes": 2}, "hds7m3t": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hds7m3t/", "text": "Thanks! It takes me a long fucking time to rewrite notes in my own words but I guess that’s college. I’ll have to try this again! I have trouble listening to lecture and note taking at the same time to be honest so I usually just scribble things to keep my brain involved and pray I remember.", "author": "crucifixioncruise", "created": 1632268543, "upvotes": 2}, "hds4iv9": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hds4iv9/", "text": "Your passion to see students succeed is admirable. Thank you", "author": "Timecounts", "created": 1632267087, "upvotes": 2}, "hds4hir": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hds4hir/", "text": "Never did this either.", "author": "Tyuiens", "created": 1632267069, "upvotes": 1}, "hdrzod6": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrzod6/", "text": "As one of the few people in my classed who takes notes by hand, I appreciate the validation 😌", "author": "marxistpiggybank_", "created": 1632264814, "upvotes": 2}, "hdry1v5": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdry1v5/", "text": "I have always written note with pen and paper but I do learn some things new from your post. Thank you professor!", "author": "vincentquy", "created": 1632264051, "upvotes": 2}, "hdrwsb1": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrwsb1/", "text": "I would write out all my notes by hand, but it takes up a lot of time and I have so many other things I need to do that I just feel like typing my notes out verbatim what the textbook says is an easy way to finish “studying” and do other work, and that sucks.\n\nAlso, sometimes the professor goes through lecture so fast that I feel like I have to write down exactly what they say in case I miss it.", "author": "konstellations", "created": 1632263463, "upvotes": 3}, "hdrv0bk": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrv0bk/", "text": "Thank you 😊", "author": "2legit2quit28", "created": 1632262644, "upvotes": 3}, "hdrt3og": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrt3og/", "text": "1 is why I love using my iPad or any sort of tablet that you can write on. While it is a screen, you’re able to write it down without using so many notebooks/paper youll probably throw out at the end of the semester.\n\nEdit: not sure why it’s bold but ok go off I guess\nEdit 2: I found out why it was bold thank you guy who gave me the suggestion", "author": "Jaded-Reporter", "created": 1632261772, "upvotes": 24}, "hdrruub": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrruub/", "text": "4 is the reason I do so well on exams. The night before class, I handwrite the notes with spaces on both sides (since most classes post the powerpoints for the week on sundays). In class I use the sides with space to write down things the professor says, paraphrased versions of big chunks, and examples! I find it works so well, since I’m familiar with the content before class. This way, I can focus on the professors explanations and class discussions instead of focusing on writing notes. To be fair, I study social sciences so math people, I don’t think I can be much help.\n\nEdited bc I forgot the hashtag makes text ginormous :)", "author": "hailiesandersl", "created": 1632261213, "upvotes": 2}, "hdrqxg9": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrqxg9/", "text": "Thank you so much! I've been struggling with finding ways to retain more information.", "author": "designingwoman", "created": 1632260800, "upvotes": 2}, "hdrog40": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrog40/", "text": "I definitely think witting down notes rather than studying them from, say, a powerpoint helps a lot! I took Biology in school and then again in college. In school, I used to handwrite all my notes but in college, I got an iPad and just highlighted stuff on the powerpoints.\n\nI saw the difference when it came to recalling information. Handwriting notes helps me immensely. \n\nI will try tip #4 though! It sounds helpful!", "author": "jennie033", "created": 1632259709, "upvotes": 2}, "hdrmv1q": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrmv1q/", "text": "I like your advice! For the pure memorization classes, I usually just stick to typed out notes and then copy and paste them into flash cards. But for more conceptual classes, hand written notes all the way.\n\nAnother thing I would suggest: start studying for tests early! Just do practice problems every week, reread the main concepts, and use flash cards apps like Anki, which uses spaced repetition. I’m telling ya, it is worth your time.", "author": "JupiterRocket", "created": 1632259024, "upvotes": 8}, "hdrmk28": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrmk28/", "text": "My issue is I write very slowly, so it’s pretty difficult for me to write notes by hand.", "author": "Megadog3", "created": 1632258892, "upvotes": 2}, "hdrlusg": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrlusg/", "text": "i honestly thought these were givens", "author": "abetternamethanthat", "created": 1632258588, "upvotes": 1}, "hdrl9do": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrl9do/", "text": "I would love to write all my notes. But for example, the notes for my first ecology exam are 24 pages, single spaced, 12 point font. Ive trimmed it down as much as i can and i could probably knock a few more pages off but still, writing out 20 pages of notes is a fucking *lot*. Whats your thoughts on that? Also, i write notes for a chapter before its covered in class, and when its covered i add things as needed. Thats way easier to do when its typed", "author": "taybay462", "created": 1632258330, "upvotes": 2}, "hdrhykr": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrhykr/", "text": "I have questions, I'd be very happy if you could answer them if it's not too much of a hassle:\n\n1 - Regarding the notes thing, I write very slow and when I try to write faster I end up not understanding much of what I wrote so to me writing on my laptop, on the pdf of whatever the professor's presenting, helps me a lot more. But I also feel like writing down makes me memorise things better so what I do is I write down my notes after, when I'm studying, I write them by hand and make my own notes by reading what's on the pdf's + the notes I took during class. Is that a good way as well?\n\n2 - The 24 hours thing, does it need to happen before we go to sleep? Because I work and go to college at the same time so I'm taking night-time classes so if I'm gonna study it's gonna have to be the day after the classes happen which means I already slept in between that and the classes I had.\n\nThanks for your time", "author": "Imaginary_Ad7841", "created": 1632256945, "upvotes": 3}, "hdrfwo3": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrfwo3/", "text": "Thank youu. I don’t start my first year of college till October and this is pretty helpful since I’ve never been the type to study for tests. I’m starting college pretty late because I had foot surgery so the corses I’ll take are condensed to catch me up faster.", "author": "Ghostly_katana", "created": 1632256083, "upvotes": 3}, "hdrcwh8": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrcwh8/", "text": "In regards to number 4: I've gotten into the habit of skimming my notes at the end of every day, and trying to come up with one thing I learned from each class, or a \"TIL List\". It's not super comprehensive, but it gets number 4 done, and it also simulates \"explaining\" the topic to somebody else, which is also a good study technique.", "author": "7thKindEncounter", "created": 1632254834, "upvotes": 18}, "hdrcq4x": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrcq4x/", "text": "Other suggestions - Treat school like a job. Schedule in study time and stick to it. That way when your time off comes its actually restful and refreshing rather than stressful about all the stuff you havent done. \n\n\\-Do active reading rather than passive. When you read, take notes and \"play professor.\" Each section think to yourself \"if I was the proff and I was writing the exam is there anything in here that I would put on an exam or in a review session?\" It serves a dual purpose, it makes sure you are actually thinking about what you are reading rather than just passivly taking info in. It also creates notes for you so that when its time to review for exams you wont have to read the whole book again. It also allows you to tease out any questions you may have so that if you go to office hours you know what you need. \n\n\\-Break up study sessions to about 45 min of any one activity. Doesnt mean only study for 45 min, but dont do much more than that of any one thing. Switch it up, strech, do a quick chore. After about 45 min learning fatigue checks in and often the brain checks out so while you may be putting in time you probably are not actually taking in the information. \n\nStudy smarter, not harder or longer.", "author": "cricketcounselor", "created": 1632254761, "upvotes": 41}, "hdrclra": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrclra/", "text": "Thanks prof, I feel like ur mad at students tho", "author": "Rickysmalls1010-", "created": 1632254710, "upvotes": 3}, "hdrc0uw": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdrc0uw/", "text": "Awesome", "author": "Zyrobe", "created": 1632254471, "upvotes": 2}, "hdr7n0d": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdr7n0d/", "text": "I used to re-write my notes in high school (which was way more challenging than my university). My first set of notes were rough, but the second notes I prepared were me assessing what’s most important, in my best penmanship.", "author": "jojoisland20", "created": 1632252682, "upvotes": 199}, "hdr7mwy": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdr7mwy/", "text": "Thanks prof; I've got 1-3 down but never heard of 4. Will begin trying it out.", "author": "neurostack", "created": 1632252681, "upvotes": 7}, "hdr5ltd": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdr5ltd/", "text": "Thank you for the helpful tips! I will definitely try these", "author": "ShyCoconut0_0", "created": 1632251857, "upvotes": 3}, "hdr53ml": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdr53ml/", "text": "You may not know this, but is there a difference between writing notes with pen and paper and using an apple pen and an iPad.", "author": "NavyApex", "created": 1632251650, "upvotes": 5}, "hdr4zv0": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdr4zv0/", "text": "Omg thank you so much! I'm 3 weeks in into college, and I felt so behind and stupid because I just couldn't understand anything, especially since I also have ADHD. When I'm starting to lose motivation or start feeling less determine to graduate, I always end up coming on reddit to find similar stories or advice to see what I can do to keep pushing myself (ง '̀-'́)ง", "author": "A1BeefSteak", "created": 1632251607, "upvotes": 62}, "hdr4uub": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdr4uub/", "text": "dude if i had an award i would definitely give it to you i was just talking w my brother about how to improve my study habits. Thank you so much!", "author": "jimbosteve713", "created": 1632251549, "upvotes": 20}, "hdr2kzp": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdr2kzp/", "text": "thank you so much!", "author": "palomamcg", "created": 1632250606, "upvotes": 4}, "hdr225l": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdr225l/", "text": "As a 90s kid who dropped out of college at 18 and returned a decade later for Physics, I cannot deny the fact of taking notes on an electronic device is sooooooooooo beneficial and convenient. And back when I started, laptops and tablets were not the norm and we all had 500 sheet notebooks and actually used the print textbook lol. Now let me clarify, taking notes on your laptop or tablet can be beneficial depending on the course. Don’t write math notes on a keyboard (although I do “re-type” my notes in Word using the equation function to make them pretty when I print them) and for the love of whatever god you pray to at night DO NOT get tempted to browse social media or YouTube or other distractions. I feel that’s the BIGGEST pet peeve for professors when students bring technology to class. I love writing notes on my Surface pro in one note. For programming, typing in Notepad++ was beneficial. For other gen Ed courses it was helpful. Heck, I’ve even recorded my lectures live on my webcam (audio only though with the webcam off) so I can finalize my notes at a later time. But if you start getting distracted then all the pros of using tech for note taking goes down the toilet (and you potentially ruin it for others who actually use tech in the correct way in a classroom setting).", "author": "XenOz3r0xT", "created": 1632250389, "upvotes": 10}, "hdr0qi6": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdr0qi6/", "text": "I can honestly say that I've never really studied for HS, since everything would \"stick\"  in class so this is very helpful since my college classes start next week, thank you!", "author": "IndividualBeliefs", "created": 1632249841, "upvotes": 128}, "hdqzubq": {"link": "/r/college/comments/psoeji/lurking_professor_with_some_study_hacks_long/hdqzubq/", "text": "Thank you!", "author": "Mineatron", "created": 1632249465, "upvotes": 17}}}