{
  "sid": "lc06q7",
  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/",
  "title:": "Anyone Else Baffled by Your Classmates Inability To Write?",
  "text": "Seriously. My classmates don’t use citations, and if they do, they use them wrong. These are seniors. Some of them also have a large amount of errors in their posts. Sometimes I think I do so well on writing assignments just because in comparison to my classmates, me doing the bare minimum or slightly above it is considered “excellent” by professors. Of course, I don’t mind the good grades. The lack of writing skills just baffles me.",
  "author": "haveagreatday97",
  "created": 1612391285,
  "over_18": false,
  "upvotes": 544,
  "upvote_ratio": 0.97,
  "comments": {
    "gm5jcl7": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm5jcl7/",
      "text": "Yes. Whenever there's peer review, I've noticed only about 10% or fewer of my classmates have high quality submissions. It seems a remaining equal amount have serviceable submissions, i.e., bare minimum with minor errors, or blatantly poor ones. I'm thankful I've never had to do group work, even if that sounds harsh.",
      "author": "Crocnoc",
      "created": 1612554955,
      "upvotes": 1,
      "replies": {}
    },
    "gm2au2k": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm2au2k/",
      "text": "Many people seem to respond to significant adversity with apathy, so people that aren’t good at language naturally will likely stop progressing early on.",
      "author": "slamweiss",
      "created": 1612488805,
      "upvotes": 1,
      "replies": {}
    },
    "gm1rdf0": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm1rdf0/",
      "text": "Me, an engineer with very poor writing ability, yeah I hate how my classmates can't write <.<; >.>",
      "author": "poonGopher6969",
      "created": 1612479670,
      "upvotes": 1,
      "replies": {}
    },
    "gm1l7wg": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm1l7wg/",
      "text": "“More better.”",
      "author": "cjmeigsy018",
      "created": 1612476960,
      "upvotes": 1,
      "replies": {}
    },
    "gm18p72": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm18p72/",
      "text": "Having somewhat of a sentence structure is rare",
      "author": "Budgetgitarr",
      "created": 1612471848,
      "upvotes": 1,
      "replies": {}
    },
    "gm0zr1g": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0zr1g/",
      "text": "Missing. Possessive.",
      "author": "hyperforce",
      "created": 1612468246,
      "upvotes": 1,
      "replies": {}
    },
    "gm0wz5s": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0wz5s/",
      "text": "My abortive attempt to enter academia in English began with a year as a graduate teaching assistant with two sections of English Comp 101 and 102 at a state university. I was shocked at how poorly the majority of the students wrote. With many of them, it wasn't even a matter of \"this needs some editing.\" There just wasn't much solid prose and coherent thought to begin to work with. It was sad. And quite frankly, being an absolute lover of writing and reading I was unable to bridge the gap and figure out how to communicate to them. It was so frustrating.",
      "author": "KSTornadoGirl",
      "created": 1612467123,
      "upvotes": 2,
      "replies": {}
    },
    "gm0tynl": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0tynl/",
      "text": "Yea. I feel the exact same. I barely put any effort into my writing and excel and people older than me still don’t know what first person and passive language are. It tests my patience everyday lol",
      "author": "Lucyfur1234",
      "created": 1612465915,
      "upvotes": 1,
      "replies": {}
    },
    "gm0hsr1": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0hsr1/",
      "text": "I just want to clear the air that I went to a shit school in a shit town in a shit state and if people don't know how to write at the bare minimum acceptable level, that's probably their own fucking fault. All you have to do in school is just pay the fuck attention for a few hours and you'll be okay. It does not take a 10,000 IQ genius to be able to construct a fucking sentence without sounding like a complete buffoon. We all whine about the education system in the US which absolutely has its faults, but for fuck's sake, it really isn't THAT bad.",
      "author": null,
      "created": 1612461170,
      "upvotes": 2,
      "replies": {}
    },
    "gm0fyhm": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0fyhm/",
      "text": "The best is when you have to peer review each other's work. It's fucking laughable. Maybe later I'll link to some screenshots of the comments my peers gave me on my paper. They can't even capitalize a fucking \"I\" and they're trying to \"fix\" my proper grammar. Usually people realize my writing skills are far superior than theirs and they'll say they have nothing to critique. But every now and then some dumb bitch will come in with an exaggerated opinion of themselves.\n\nTrue story: My sentence was \"Maxfield continues that the information we cling to regarding health is largely based on societal expectations, not solely on scientific data.\" Now I'm sure I made some minute error somewhere that some English wizard can correct. But this fucking idiot highlighted it and said \"I feel like this is another run on sentence.\" Hey, at least that person could spell and use a period for that one particular note!",
      "author": null,
      "created": 1612460452,
      "upvotes": 1,
      "replies": {
        "gm0glye": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0glye/",
          "text": "That’s fucking hilarious. Trying to fix your proper grammar, oh my god. “I feel like this is another run on sentence.” Oh, do you? That’s so funny.  They probably make up errors for your papers to feel better about themselves.",
          "author": "haveagreatday97",
          "created": 1612460704,
          "upvotes": 1,
          "replies": {
            "gm0x7kv": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0x7kv/",
              "text": "I'd have demanded factual proof for their \"feeling,\" LOL.",
              "author": "KSTornadoGirl",
              "created": 1612467219,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gm1nofz": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm1nofz/",
          "text": "That’s not a run on sentence; furthermore, that’s pretty standard and proper use of a comma. \n\nIf there was an issue involving of going over a word limit, then possibly some words could have been cut.",
          "author": "Remy_Riot",
          "created": 1612478030,
          "upvotes": 1,
          "replies": {
            "gm1pojg": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm1pojg/",
              "text": "Thank you, that's why it bamboozled me so much. Also, no word limit. If anything, I may have been stretching it to meet the minimum requirement. We just live in an age where many jobs worth anything require a degree, so every airhead and their mother are infiltrating institutions of higher education.",
              "author": null,
              "created": 1612478915,
              "upvotes": 2,
              "replies": {
                "gm2febu": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm2febu/",
                  "text": "My online classes were always full of people who should never have passed an English class. I always thought I was pretty average if not below average at writing. After a few online classes my mind has changed and I’m pretty sure I’m above average by just understanding the basics.",
                  "author": "Remy_Riot",
                  "created": 1612490952,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gm0e3xk": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0e3xk/",
      "text": "I can forgive someone for being bad at writing; written language is, after all, very unnatural, and wasn't a mode of expression in the ancestral environment. In the Paleolithic visual art (e.g. cave paintings and sculptures), singing, dancing, drama, music, and speaking were all prominent aspects of life.\n\nThe issue we have is that most of the people who can't write can't paint, sculpt, sing, act, play a musical instrument, or dance well either! A key, if not the key, goal of education is for the student to become at least some of these arts, these fundamental and primordial forms of expressing what it is to be human, and we are falling far short of that goal.\n\nFor that reason alone it's entirely fair to say that the education most people get is very poor.",
      "author": "AdamasNemesis",
      "created": 1612459728,
      "upvotes": 1,
      "replies": {}
    },
    "gm03o59": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm03o59/",
      "text": "I’m more worried about the people that can’t form a complete sentence during class discussion tbh. Worse English than actual ESL people that have to consciously think about their word order",
      "author": null,
      "created": 1612455726,
      "upvotes": 1,
      "replies": {
        "gm04i50": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm04i50/",
          "text": "I wonder how to help people like that. Writing, you can practice and become better, but that? I don’t know how you help people who can’t organize a sentence and then say it out loud.",
          "author": "haveagreatday97",
          "created": 1612456047,
          "upvotes": 1,
          "replies": {
            "gm05gmh": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm05gmh/",
              "text": "I imagine that writing will still help because it’s fundamentally about learning how to organize your thoughts in a coherent manner that others will understand. Whether you do this with a pen or your mouth is not that important.",
              "author": null,
              "created": 1612456410,
              "upvotes": 1,
              "replies": {
                "gm05nyz": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm05nyz/",
                  "text": "Yes, that makes sense. I really hope there’s a new emphasis on education in the future. It is clearly needed.",
                  "author": "haveagreatday97",
                  "created": 1612456488,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "glzztxm": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzztxm/",
      "text": "I'm a US student in the UK and I'm genuinely surprised that the education system here doesn't seem to teach basic citation. We had a group project and I had to tell people to do citations by hand instead of using the automatic generators because the automatic generators were coming up with different results...",
      "author": "birdpictures897",
      "created": 1612454203,
      "upvotes": 1,
      "replies": {
        "gm00cc9": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm00cc9/",
          "text": "That happens in my courses too. I think the citation generators can work, if you know how the citation style works and can fix it if the machine does it wrong. I see people who just input the information into generators and paste the citation as-is, not even making sure it matches APA format.",
          "author": "haveagreatday97",
          "created": 1612454406,
          "upvotes": 3,
          "replies": {
            "gm23vkd": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm23vkd/",
              "text": "Oh yeah, I love Noodle Tools but...I double check all of them against the format when I'm done. For more difficult formats (e.g. citing a book that I accessed through a photograph on a website) I just do it all by hand because the computer doesn't do that level of mental gymnastics.",
              "author": "birdpictures897",
              "created": 1612485480,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "glzxgjy": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzxgjy/",
      "text": "Absolutely. Every group writing project I’ve worked on in my time in college, my peers have written horribly. And I know I’m a pretty decent writer so I’m not expecting everything to be great, but my classmates write like 7th graders in a remedial English class. \n\nWhen I was in middle school and high school I always thought that all the emphasis on writing was nuts because this stuff was common sense, but now I realize that it’s not. \n\nIt makes me wonder how these kids made it though the mandatory English classes at my college. There’s no way those students should have actually passed with the skills they put on display.",
      "author": "Ms_Digglesworth",
      "created": 1612453254,
      "upvotes": 1,
      "replies": {}
    },
    "glzwqbw": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzwqbw/",
      "text": "There’s a few students in some of my classes who love writing things like “today I am writing about” or “the prompt says *blank* so I am going to argue that”. I have to legit close my laptop and do something else because I get so frustrated by the fact that I can’t even read their writing the entire way through.",
      "author": "hailiesandersl",
      "created": 1612452954,
      "upvotes": 2,
      "replies": {
        "glzwyfv": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzwyfv/",
          "text": "Noooo, we were taught not to do that in like middle school. A mess.",
          "author": "haveagreatday97",
          "created": 1612453048,
          "upvotes": 2,
          "replies": {
            "glzz4od": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzz4od/",
              "text": "an absolute mess",
              "author": "hailiesandersl",
              "created": 1612453930,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gm0f8sr": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0f8sr/",
          "text": "For short answer, it's fine (often very helpful) to echo the language of the question.\n\nFor an essay? Yikes.",
          "author": "bl1y",
          "created": 1612460172,
          "upvotes": 2,
          "replies": {
            "gm0sf8a": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0sf8a/",
              "text": "They’re discussion posts in a political science class, and each post is supposed to be 3-4 paragraphs. The most difficult part is being able to read the very childish language. It’s rough.",
              "author": "hailiesandersl",
              "created": 1612465300,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "glzuiui": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzuiui/",
      "text": "If you want help with writing, I've set up a Discord server just for that: https://discord.gg/ZQKbYXptEP\n\nI'd been teaching writing for 6 years until my classes got cancelled due to covid-induced low enrollment. So, now I have a new hobby.\n\nI'm still building out lessons, but while that's going on you can also get some individual advice.",
      "author": "bl1y",
      "created": 1612452027,
      "upvotes": 4,
      "replies": {}
    },
    "glzuaki": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzuaki/",
      "text": "I was shocked as a creative writing minor how many creative writing and English majors didn’t know how to write worth shit. Stories that didn’t make logical sense, run-on sentences, grammatical errors so bad I had to decipher what they were trying to say. A big flaw in those classes for me is that you get most feedback through peer review because most of the time I’d get paired with people who would read my story and say shit like “sounds good” or “perfect” when I want real feedback that helps me make it better, meanwhile I’ve tried really hard to nicely tell them their entire story is trash. \n\nI also had that happen in a class where we made online portfolios. The ones I had to review had barely any information to the point where I wasn’t sure if they even had any skills or what career they were actually going for, and then my portfolio got “wow that’s so good!” And all I wanted was an opinion that would actually help me.",
      "author": "kienarra",
      "created": 1612451927,
      "upvotes": 1,
      "replies": {
        "glzux7f": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzux7f/",
          "text": "Ugh, that’s how I feel about discussion boards. It’s all “I like how you said X! I agree with X! Great post!” Like please say something thought provoking I beg of you. I would find that frustrating too, especially in a creative writing course. You want feedback that helps you hone your craft, not empty compliments.",
          "author": "haveagreatday97",
          "created": 1612452197,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "glzt9pv": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzt9pv/",
      "text": "My boyfriend is in his fourth year as a history major where he almost exclusively writes papers.. he said there are some people in his current classes where he has no idea how they even got through their English 1100.",
      "author": "peachyypeachh",
      "created": 1612451474,
      "upvotes": 2,
      "replies": {
        "glztyru": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glztyru/",
          "text": "I really want to know more about how these people pass, honestly. Do professors just pass them to get rid of them? How do they justify the grades if the writing is so awful? Plus, so many of my classmates don’t use in-text citations. They just put the references at the bottom. Like no, that’s not how this works, that’s not any of this works.",
          "author": "haveagreatday97",
          "created": 1612451782,
          "upvotes": 1,
          "replies": {
            "glzulkb": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzulkb/",
              "text": "I’m truly unsure. I guess it depends on the instructor? I know a girl who’s writing is just god awful and she’s failed English 1100 twice. No offense, but as she should and for her own good. She’s a psych major and won’t make it if she can’t pass first year English. \n\nI guess if you can keep sliding by with C’s then that’s “enough” 😅",
              "author": "peachyypeachh",
              "created": 1612452059,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "glzt2q5": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzt2q5/",
      "text": "Yep. I took the CLEP for English Comp I and II so I'm a pretty decent writer.\n\nBut, I also am (was? I graduated last May) a Computer Science major. Holy fuck did all those little baby guys act like writing a paper was going to kill them. The amount of them that put off classes with a slight writing component until their last semester was baffling to me.\n\nI remember in one of my last semesters in one of my 4000 level CS classes there was a group project for a huge research paper that spanned half the semester, and the groups were premade. I had already signed myself away to writing the whole god damn 20 page paper by myself, until I got matched with one of the most attentative guys who asked the most questions in the class and one of the only girls other than me in the class as well. Her track was STEM education, one of the only people in the CS school with that specific track.\n\nWe killed the paper and our professor was super proud of us. I was so glad I didn't have to do everything. We brainstormed and decided the guy who was the most passionate about the class and project should organize us, he did, and then none of us slacked off.\n\nThat never happened again for any other group project or paper I had, but it was such a breath of fresh air compared to the shit that happens normally.",
      "author": "eternaforest",
      "created": 1612451389,
      "upvotes": 2,
      "replies": {
        "glzucne": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzucne/",
          "text": "That sounds absolutely amazing. God, I want to experience that so bad. I’m doing a group project this semester and I’m scared other people’s sections of the report we have to write will tank our grade. I have no idea how I plan to navigate if my group mates write garbage.",
          "author": "haveagreatday97",
          "created": 1612451952,
          "upvotes": 2,
          "replies": {
            "glzxy5q": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzxy5q/",
              "text": "I had already decided I was going to take the reins of everything until I got my group members, and we all agreed the one guy would take the lead. He came up with the topic and the sections and assigned them to us and we all basically agreed that we wouldn't wait until the last minute and proofread eachother's sections the day before it was due so we could submit early. It was such a fluke, but it worked perfectly. Our lead was super into the project and knew the most about the topic he chose for us so we felt comfortable with him directing everything. He also was able to correct our work from a technical standpoint if we didn't understand fully what we were writing about.\n\nSeriously was the only group project I have ever been in my entire life that just worked how it was supposed to. Of course we had to \"review\" eachother and we all raved about the guy who led us and how he deserved extra credit lol.",
              "author": "eternaforest",
              "created": 1612453455,
              "upvotes": 1,
              "replies": {
                "glzyin2": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzyin2/",
                  "text": "That’s beautiful, honestly.",
                  "author": "haveagreatday97",
                  "created": 1612453685,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "glzruoo": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzruoo/",
      "text": "Lol during my undergrad, somebody turned in their 40 page project and forgot the references.",
      "author": "Nerdlinger42",
      "created": 1612450844,
      "upvotes": 2,
      "replies": {
        "glzsm82": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzsm82/",
          "text": "This is it, this is my nightmare.",
          "author": "haveagreatday97",
          "created": 1612451185,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "glzrbvm": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzrbvm/",
      "text": "I'm a sophomore in polisci and I've peer reviewed papers from freshmen, sophomores, and juniors and other than a few exceptions pretty much all the papers I've read by fellow classmates have completely lacked any soul or finesse. The language is typically drier than the Sahara. The topics are usually boring and overdone when open-ended assignments allow for creativity. And structurally papers are typically so canned they put spam to shame.\n\nI think a combination of apathy, a lack in writing classes through high school, and a general disdain for reading books that has persisted through the last two generations are to blame.",
      "author": "Fedora200",
      "created": 1612450613,
      "upvotes": 2,
      "replies": {
        "glzsit9": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzsit9/",
          "text": "I have this issue with open ended assignments where I want to be *different* because everyone uses the same topics and then I regret challenging myself at first. It’s usually worth it, though.\n\nI don’t understand the reading aversion. I truly believe there’s a book out there for everyone. I agree there should be more emphasis on writing courses in high school. I feel like high school is radically different from when I went, and I graduated in 2016. I feel like we wrote papers often, though I haven’t used MLA since.",
          "author": "haveagreatday97",
          "created": 1612451143,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "glzql17": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzql17/",
      "text": "Whose fault do you think that is? Often times, lack of writing skills is associated with being from a lower-income, diverse/minority area where English is often a second language. Not saying that they have to be in that situation, but you can't blame people for resources and knowledge that was never given to them.",
      "author": "VexingMalice",
      "created": 1612450282,
      "upvotes": 0,
      "replies": {
        "glzrolc": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzrolc/",
          "text": "Oh yeah, I definitely agree that not everyone has access to the same resources. I also believe that ESL students should be cut some slack. If someone has the resources and refuses to learn from them, I find that problematic. I think the blame lies in the lack of education funding, and the way the K-12 system currently works. I hope that some day there’s an emphasis put on teaching students again, and giving them the resources they need to thrive. Whether that be extra one-on-one time with a teacher or something to eat.",
          "author": "haveagreatday97",
          "created": 1612450770,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "glzo444": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzo444/",
      "text": "will never forget the time i had to do a peer review of some dude's civil war paper in one of my history classes and the only way he was able to get up to the minimum page count was to insert whole ass blocks of blank space at various points in the paper, and there were all sorts of weird formatting errors like some text shadow effect on the first two or three pages. he also included a page-long quote from a primary source in a paper where we were only supposed to use secondary sources... big brain shit",
      "author": "sangyourrefrain",
      "created": 1612449164,
      "upvotes": 5,
      "replies": {
        "glzou32": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzou32/",
          "text": "See, I feel like if you’re willing to do all that it’s easier to just write the paper. And a page long quote? I genuinely can’t think of any class where that would fly with a professor. That paper sounds like a nightmare.",
          "author": "haveagreatday97",
          "created": 1612449500,
          "upvotes": 2,
          "replies": {
            "gm016ek": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm016ek/",
              "text": "it was awful - i don't know what grade he got on it, but i can't imagine it was a good one lmao. it was even worse because he was a history major - how do you expect to do well in that program if you can't even write and format a paper properly???",
              "author": "sangyourrefrain",
              "created": 1612454744,
              "upvotes": 2,
              "replies": {
                "gm01c6x": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm01c6x/",
                  "text": "Seriously. I want to know what goes on in their heads lmao.",
                  "author": "haveagreatday97",
                  "created": 1612454808,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gm12uwk": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm12uwk/",
          "text": "I used to get formatting problems on papers all the time until I started requiring students to submit .doc or .docx only. Suddenly the problems vanish.",
          "author": "bl1y",
          "created": 1612469511,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "glznrqv": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glznrqv/",
      "text": "Wait- senior as in college?! I really thought this sort of crap ended by freshman year. I'm in highschool rn and most of my class still thinks research=pasting a question word-by-word as it appears in the assignment onto google.",
      "author": "Hector_Martinez04",
      "created": 1612449002,
      "upvotes": 2,
      "replies": {
        "glzpkwl": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzpkwl/",
          "text": "Oh yeah, seniors in college. I had to write a discussion board reply and I mentioned how people in our future field need to be effective writers. As I was writing it, I felt like I was calling the person out on their bad writing. It is so funny to me that everything is like “You need to be a good written communicator!” and these people are so...not that.\n\nOh my god, my professor in my course had to tell people not to cut and paste too. Good news, you’re ahead of the pack in your class just because you can follow basic instructions, which is pretty cool.",
          "author": "haveagreatday97",
          "created": 1612449832,
          "upvotes": 2,
          "replies": {
            "glzsqdh": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzsqdh/",
              "text": "It makes sense that their skills don't just magically get better once they hit college. Although most of the time it's not about \"skill\" but rather common sense and just following instructions. Thanks for the compliment!",
              "author": "Hector_Martinez04",
              "created": 1612451237,
              "upvotes": 1,
              "replies": {
                "glztazz": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glztazz/",
                  "text": "Oh yeah, I definitely think it’s more of a failure of the school system itself than the students. But it’s like, I know these people are getting feedback on this stuff so...Do they not read it? Do they not apply it? It’s strange.\n\nYou’re welcome! Good luck with your schooling.",
                  "author": "haveagreatday97",
                  "created": 1612451490,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "glzlg2y": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzlg2y/",
      "text": "No, but I am baffled by my own inablity to write.",
      "author": "Puzzleheaded-Ear-426",
      "created": 1612447856,
      "upvotes": 3,
      "replies": {}
    },
    "glzkraj": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzkraj/",
      "text": "And somehow they let these people out of English 1. Like what’s the point of making us take English classes if people still can’t write afterwords?",
      "author": "NeonRose222",
      "created": 1612447508,
      "upvotes": 6,
      "replies": {
        "glzm0y3": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzm0y3/",
          "text": "Right? I think a lot of it is “oh, the next professor will teach them that” except it happens in every class so they never learn. I also think students don’t know that you’re supposed to apply what you learn in English 1 in every class. They just think it applies to English 1 and toss it out of their brain after they somehow pass.",
          "author": "haveagreatday97",
          "created": 1612448149,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "glzkbuf": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzkbuf/",
      "text": "Same. When I email professors or go to their office hours about term papers they are either surprised I'm showing up at all even though they say it's mandatory or are simply delighted.\n\nI tell them about my topic, thesis and the structure of the paper. They always love the idea and then warn me I should include secondary literature and not just analyze.\n\nDUH. That is so obvious to me that I don't even mention it. Like, I have already picked out 10+ relevant scholarly articles/books. Don't worry. I even have an MLA style list. I just don't bring it up because it's a given. I was seriously surprised about both my great marks and the fact that my peers apparently can't write even though they literally teach us left and right.\n\nNow, I do it for fun. I watch their horror grow bigger and bigger as I talk and before they can ask the dreadful secondary material question I present them with my flawless list. You should see their faces LIGHT UP! Best entertainment.",
      "author": null,
      "created": 1612447286,
      "upvotes": 3,
      "replies": {
        "glzlplw": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzlplw/",
          "text": "The fact they feel the need to tell you that. Oh my god. I also would assume you should use secondary literature. It sounds incredibly fun to mess with professors like that, especially since I can only imagine how happy they are when you show them your work.",
          "author": "haveagreatday97",
          "created": 1612447991,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "glzi874": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzi874/",
      "text": "Professors aren't allowed to fail many students, so they just get let through.  You would truly have to be an idiot to not be able to graduate from uni nowadays.",
      "author": "fnybny",
      "created": 1612446156,
      "upvotes": 4,
      "replies": {}
    },
    "glzhzzb": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzhzzb/",
      "text": "It’s like somehow they made it through high school without at LEAST MLA format not being drilled into their brains",
      "author": "headyslabs",
      "created": 1612446031,
      "upvotes": 5,
      "replies": {}
    },
    "glzat06": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzat06/",
      "text": "I was in this group project once. Part of the project was to write a short essay about what we learned.\n\nThe grammar in the essay was so horrendous that I spent an hour editing the whole thing so we would actually pass.",
      "author": "nonconformistnugget",
      "created": 1612441475,
      "upvotes": 6,
      "replies": {}
    },
    "glyvs0e": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyvs0e/",
      "text": "I think I realized this whenever I would help my sister out with writing. She's graduating HS this year, and I'm two years ahead of her (for reference). I helped her to redo her college applications, and man were they in rough shape. She was reluctant to do it, but my mom prodded her to let me. After I was gone making extensive changes, my mom asked, \"so what do you think now?\" My sister responded, \"yeah, it's actually really good.\" \n\nI find the biggest issue within essays and responses is that people have the idea, but they either never flush them out, or continue it. You can't expect this great idea to have two sentences, make it a paragraph were you fully develop your point. \n\n I've been told my writing is really good by various professors and I credit it all to my English teacher in HS, who I had for two years. Every paper I submitted would get ripped apart, and for the first year I never earned more than a 70% on any of them. \n\nWhenever I proof read things for friends or classmates, it just hurts. Its like I'm looking at an extremely rough draft of a paper, not a finalized copy. Incomplete thoughts and sentences, sentences that either add nothing or drift off to never be completed... stuff like that.\n\nI think at the end of the day, the problem stems from horrendous lack of proper education in English wiring skills in general. A lot of my HS classes in English were focused on reading and the language used... not so much how the sentence was structured or even how to write.",
      "author": "DoorBuster2",
      "created": 1612428543,
      "upvotes": 7,
      "replies": {}
    },
    "glys10q": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glys10q/",
      "text": "Yes and no. On one hand, it's wild when you get into an upper-level course (or any college course) and see that students study with the basics of writing. On the other, writing is a skill. If a student isn't taught a skill when they're in K-12, if they get in programs where they can get by without being pushed to improve their writing, if no one teaches them the importance of effective written communication, then of course they will write poorly. Besides that, I think there are plenty of people who want to write well but don't know what good writing *is* because they were never given instruction on that beyond the surface level stuff, which they then brush off as \"I'm just not a good writer.\"",
      "author": "torgoboi",
      "created": 1612425295,
      "upvotes": 7,
      "replies": {}
    },
    "glyo7sg": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyo7sg/",
      "text": "YES... And it almost gives me *major* imposter syndrome? Classmates talk about the amount of prep and studying they do for either actual papers or for exams with essay questions, meanwhile I'm a procrastinator who has never been much of an intense study-er or prep-er but then I always manage to get out loud compliments on my writing... and during high school I always figured I just have a knack for writing and it was cool to be recognized... now, I am also a college senior and definitely get a similar sense of: \n\n>Sometimes I think I do so well on writing assignments just because in comparison to my classmates, me doing the bare minimum or slightly above it is considered “excellent” by professors.\n\nI did a discussion post for a reading that I barely skimmed and my professor left a comment about my answers being \"incredibly thorough and profound,\" and after reading what some of my other classmates wrote, I can see how my ability to coast on just decent writing makes me seem so profound when I personally feel like I'm barely skating by... \n\nI mean maybe we don't give ourselves enough credit,  being an effective communicator can often be the factor that makes someone decide on you over the dud with a fluffy resume. Go us✌😅",
      "author": null,
      "created": 1612422148,
      "upvotes": 12,
      "replies": {
        "glyphtb": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyphtb/",
          "text": "Oh my god, I think we’re the same person. I’m an *awful* procrastinator, yet get As on the assignments I just throw together. I always think my work is terrible too, and then I’m shocked at the grade. I can’t imagine what these people’s papers look like if their discussion board posts look like that.\n\nI hope being an effective communicator can push me over the edge for a job, haha.",
          "author": "haveagreatday97",
          "created": 1612423167,
          "upvotes": 10,
          "replies": {
            "glys41v": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glys41v/",
              "text": "Whoa! This is a thing apparently bc this is me, too! I have 3 weeks to do my assignments but do them in a couple days before AND have maintained a 4.0 GPA the last 3 semesters somehow miraculously??? Feel like I have no idea how I get these grades?? Does no one else try at all..? I don't get it. I mean I do work well under pressure and have been working 20 years so maybe i just... Can??",
              "author": null,
              "created": 1612425367,
              "upvotes": 2,
              "replies": {
                "gm30v6z": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm30v6z/",
                  "text": "The only thing I can't relate to is the 4.0 🥲... unfortunately I *also* have a knack for struggling to maintain motivation for any class that I'm just not that into. So I'll get A's in most things but have a scatter of classes throughout my college career that drag my GPA to a *barely* 3.0... apparently I can't BS  ALL my classes through good writing🤧... that pressure works GREAT for critical thinking/analysis  essays, but not so much for the multiple choice on the fine details of the material I only skimmed💀 And the funny thing is I am a comm major, so a lot of my core classes revolve around critical thinking and effective communication. So I actually end up struggling in stuff like that random social science elective that requires more concrete answers🙄😅",
                  "author": null,
                  "created": 1612502125,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "glymfm5": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glymfm5/",
      "text": "Higher ed really did a great job of showing me that I am actually a step or two in front of the masses in terms of those types of skills. I didn’t believe it, I figured people were just blowing smoke to make me feel good, but no— mfs really be walking around out here thinking this type of writing is okay for adults. And also that things like meeting deadlines are mostly negotiable and that you can get everything you want doing the bare minimum and that not doing your work is okay if you are sad and don’t feel like it. Embarrassing.",
      "author": "Jasmotron3k",
      "created": 1612420802,
      "upvotes": 27,
      "replies": {
        "glzaqmf": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzaqmf/",
          "text": "There's evidence that grade inflation is real. I think it has to do with the price of college going up. People wouldn't stick with it if they were getting the grades they really deserve and colleges wouldn't get their money. It really does feel like a degree is simply a piece of paper you pay for when you can get passing grades by simply showing up and doing the bare minimum. I'm taking a english composition right now and we haven't actually done any learning about writing. It's essentially a gender studies class and the professor is horrible. Even the syllabus is full of errors. Part of me wants it to be a sick joke or phycology experiment.",
          "author": "whathaveyoudoneson",
          "created": 1612441428,
          "upvotes": 5,
          "replies": {
            "glzif37": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzif37/",
              "text": "I think it’s also partially that lowering our expectations and criteria for success  in US K-12 has become standard operating procedure. No Child Left Behind created a situation where plenty of kids who should have had to stay back and get extra help were just left to slide through the system and they came out with the same entitled attitude as all the other students with regard to college. That’s why students are constantly grade grubbing— it feels wrong to them that they get Cs even if they put in C level effort.",
              "author": "Jasmotron3k",
              "created": 1612446260,
              "upvotes": 8,
              "replies": {}
            },
            "gm0xkuc": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0xkuc/",
              "text": "> There's evidence that grade inflation is real. I think it has to do with the price of college going up.\n\nIt's no coincidence that attrition rates for law schools plummeted as tuition skyrocketed. I'd guess undergraduate programs are doing the same thing.\n\nAnd to make things worse, there's inter-departmental competition. If your program is notoriously hard, folks will major in something else.\n\nSorry to hear about your crappy writing studies class. That's what I teach, or did before my course got cancelled due to covid enrollment drops. I set up a discord to do writing instruction on though if you'd like to actually learn something: https://discord.gg/ZQKbYXptEP",
              "author": "bl1y",
              "created": 1612467366,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "glyky6b": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyky6b/",
      "text": "As an international student and second language English speaker, I'm baffled at how bad people are at English when they've been born into it",
      "author": "CrazyTechq",
      "created": 1612419738,
      "upvotes": 11,
      "replies": {
        "glyrsr5": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyrsr5/",
          "text": "Same! I am not an international student, I moved to the US 5 years ago, but my writing is so much better then anyone else in my class. And English is not my first language lol.",
          "author": "Essiejjj",
          "created": 1612425101,
          "upvotes": 7,
          "replies": {
            "gm03zc9": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm03zc9/",
              "text": "That's because we actually know how the grammar works. It's not a given to us. We had to formally learn the rules and understand them because we weren't able to develop a feeling of what is right and wrong as young children. Therefore, to us, it's much easier to use and apply these rules on purpose. I study English in Germany and one of our American professors, who taught Ivy League before, always says that German students are so much better when it comes to grammar.",
              "author": null,
              "created": 1612455845,
              "upvotes": 5,
              "replies": {
                "gm12i7v": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm12i7v/",
                  "text": "You're learning the formal grammar rules.\n\nWe learn the formal rules for a little while, but then it just becomes folk grammar, and we forget the rules.",
                  "author": "bl1y",
                  "created": 1612469368,
                  "upvotes": 2,
                  "replies": {
                    "gm141wi": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm141wi/",
                      "text": "Exactly, I'm way better at explaining English grammar than German grammar. I don't know any rules, really. I just know intuitively what's right or wrong but intuition can fail you.",
                      "author": null,
                      "created": 1612470002,
                      "upvotes": 1,
                      "replies": {
                        "gm3uuks": {
                          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm3uuks/",
                          "text": "One of the most common examples is people writing *ya'll* instead of *y'all.*\n\nThey learned that you put the apostrophe before the double Ls by looking at I'll, you'll, and we'll. They didn't learn the actual rule of putting the apostrophe where letters are missing.",
                          "author": "bl1y",
                          "created": 1612526764,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gm1tcg5": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm1tcg5/",
                  "text": "Tbh though, I acquired most of my English skills through reading books and watching Youtube videos. I didn't pay that much attention in English class. I could maybe tell you a couple of tenses but that's about it.",
                  "author": "FunkyBeans3000",
                  "created": 1612480564,
                  "upvotes": 1,
                  "replies": {
                    "gm54rdt": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm54rdt/",
                      "text": "Bruh, do you even past perfect continuous?",
                      "author": "bl1y",
                      "created": 1612548671,
                      "upvotes": 1,
                      "replies": {
                        "gm56oqb": {
                          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm56oqb/",
                          "text": "Lmao what",
                          "author": "FunkyBeans3000",
                          "created": 1612549496,
                          "upvotes": 1,
                          "replies": {
                            "gm5b6hc": {
                              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm5b6hc/",
                              "text": "Past, we all know what that one means.\n\nPerfect = Had concluded\n\nContinuous = Goes on for a period of time.\n\nI **had been looking** for an excuse to talk about grammar when I came upon your comment.\n\nThe looking took place over a period of time in the past, but concluded when I saw your comment.",
                              "author": "bl1y",
                              "created": 1612551388,
                              "upvotes": 1,
                              "replies": {
                                "gm5ddj1": {
                                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm5ddj1/",
                                  "text": "Yes",
                                  "author": "FunkyBeans3000",
                                  "created": 1612552337,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gm04pjj": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm04pjj/",
          "text": "If you’re from a country with a more functional and/or intense high school system whatever writing skills you picked up there will benefit you in all languages.",
          "author": null,
          "created": 1612456125,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "glyhn2j": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyhn2j/",
      "text": "Honestly, no. It's hard to teach high schoolers about citations and other advanced concepts when you get kids in 11th grade that can't even read a full paragraph. By the college level, it is assumed that you have a strong educational background and already have mastered these concepts. If you go to a school like I did with very low teacher retention rates and literacy rates below 20%, it is very easy to get stuck behind the rest of your peers in college.\n\nPlus, it isn't taught in college classes because its assumed students already have in-depth knowledge of these concepts. So students think they don't need to learn these concepts because they have never needed to before and most professors are lenient with grammar. (excluding english professors and those that teach majors that require a high-level of writing skills)",
      "author": "WhiteFarila",
      "created": 1612417504,
      "upvotes": 0,
      "replies": {}
    },
    "glyh5zt": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyh5zt/",
      "text": "Ummm I was in a Comp II class and compared to the other students I was the reason why my prof didn’t lost their sanity because I stg everyone was illiterate 😭😭. Like it got to the point where the prof had to make a PowerPoint for the class about HOMOPHONES.... yes you read correctly, a college comp II class needed guidance on the difference between things like “they’re, there and their”. I was shocked 😭💀.",
      "author": "Mhoover0108",
      "created": 1612417201,
      "upvotes": 2,
      "replies": {}
    },
    "glydxra": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glydxra/",
      "text": "I’m a graduate student and I agree. I’m working on my MA in History which makes it worse considering it is a very writing intensive field.",
      "author": "X-iomania077",
      "created": 1612415226,
      "upvotes": 1,
      "replies": {}
    },
    "gly3a34": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gly3a34/",
      "text": "This post reminded me of a few semesters ago I was peer-reading some papers for a (senior level!) Evolution course. While both papers had some glaring errors that made me go ???, one of the papers was literally 90% plagiarized word for word. I could instantly tell because the writing in the introduction was so poor then suddenly all these fancy terms and phrases appeared. It took me 5 seconds to find the plagiarized information. I was baffled, I was sure it had to be a plant to get students to bring it to the professor’s attention. But no, a real COLLEGE SENIOR did that. It still baffles me today. (And then, at the final presentation, the student’s presentation narration was also almost word for word from their original sources. How did they get away with that?)",
      "author": "ElephantsRTasty",
      "created": 1612409340,
      "upvotes": 12,
      "replies": {
        "gly5y4c": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gly5y4c/",
          "text": "That is absolutely nuts. The professor must not have cared at all if you could find the plagiarism source that fast and the student didn’t face any penalty.",
          "author": "haveagreatday97",
          "created": 1612410741,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gly04oo": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gly04oo/",
      "text": "Yep happens at least once a semester. The worst part is when some professors feel the need to then teach them how to do write. Like spending lecture time going over what is at best English 101 material in a upper level philosophy class (for example) is not a good use of anyone’s time. The only ones that should get away with this are international students and even then it’s still sad.",
      "author": "OmegaBornAndRaised",
      "created": 1612407753,
      "upvotes": 27,
      "replies": {
        "glzyweh": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzyweh/",
          "text": "One of the best writing lessons I got was when we took a week out of Honors Intro to Ethics (a 200-level philosophy course) to just cover succinct writing.\n\nMeanwhile, the writing program I teach in is now focused on the idea that having standards is racist. Not that our standards were racist, but that having standards at all is racist.",
          "author": "bl1y",
          "created": 1612453839,
          "upvotes": 2,
          "replies": {
            "gm2fbo9": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm2fbo9/",
              "text": "[deleted]",
              "author": null,
              "created": 1612490918,
              "upvotes": 1,
              "replies": {
                "gm3v7w8": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm3v7w8/",
                  "text": "The theory is that when we have standards, we're imposing our own objectives on students, and that is a slave-making white supremacist act. Students should be learning for their own purposes, and thus setting their own standards for themselves.\n\nAnd yeah, it's faculty.\n\nBut, I should point out that I'm aware my department is an extreme outlier in these regards. We're not at all a representative sample.",
                  "author": "bl1y",
                  "created": 1612527052,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gly01th": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gly01th/",
      "text": "I think it's largely a testament to the quality of some (many?) high schools... basic grammar, punctuation, sentence structure, proficiency in at least one common citation style, etc. should be in any students' back pocket well before college. I'm grateful to have attended a hs with a great English program, but there's certainly a disparity between the better and poorer funded high schools across the U.S.  \n\nAlso, some just scrape by on truly the bare minimum skills",
      "author": "bucs2013",
      "created": 1612407713,
      "upvotes": 68,
      "replies": {
        "glzq6b0": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzq6b0/",
          "text": "Definitely this. Depending on where you go to High School factors a lot into how college will be for you, bad high schools make college 10x harder.",
          "author": "Sxcred",
          "created": 1612450097,
          "upvotes": 9,
          "replies": {}
        },
        "glzp0jf": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzp0jf/",
          "text": "Not a college student yet, but recently moved on to high school and the same thing is happening here on a smaller, more age-acceptable scale. Kids from private and extremely expensive schools tend to, from my experience, have the worst reading and writing skills of everyone in the class. Don't get me wrong- there are exceptions, but it all depends on their mindset, and honestly, I don't see them improving at all before college.\n\nAt least from my account, I think I have solid writing skills. I've won essay competitions and all that in the past but I doubt it had anything to do with my previous school. Again, I think it's all about mindset and overall just some sense of responsibility.",
          "author": "Hector_Martinez04",
          "created": 1612449580,
          "upvotes": 12,
          "replies": {}
        },
        "gm1r64j": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm1r64j/",
          "text": "I mean, it's also a testament to the quality of universities if they're letting people who are barely literate (and definitely not literate to an acceptable adult level) get all the way to graduate level coursework. Those people should not have passed even the first year of most courses, so how did they get to the 4th? Sounds like the system that pressures HS teachers to pass substandard work is now in universities as well. It's unfair to the kids who had no say in their shitty writing/reading/math skills, but they do need foundational classes and shouldn't be allowed to \"fail up\" even further.",
          "author": "officially_anxious",
          "created": 1612479578,
          "upvotes": 2,
          "replies": {
            "gngly7a": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gngly7a/",
              "text": "I definitely see your point here.  On one hand, college should be relatively accessible and a place where previously disadvantaged people should be able to grow.  That said, the focus of revenue over anything by universities being more prevalent now than ever is a large part of why they pass (and keep passing) clearly inept students. \n\nI can see at least admitting someone with sub-standard skills to see if they can improve themselves over the course of a freshman year.  I strongly disagree, though, with universities continuing to pass those students if they clearly demonstrate that they haven't improved.",
              "author": "bucs2013",
              "created": 1613333604,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "glzv5b3": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzv5b3/",
          "text": "Eh yes and no. I took AP and Honors courses but never learned APA or Chicago Manual till college. Students in high school need to learn how to be able to learn on their own. I was able to figure out how to use other citation methods because I could think for myself.",
          "author": "veanell",
          "created": 1612452291,
          "upvotes": 1,
          "replies": {
            "gm06012": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm06012/",
              "text": "Yeah, high schools typically only teach MLA. It’s good enough for most lower level writing, but if you go into any degree where you need to write, good luck.",
              "author": "WinkyInky",
              "created": 1612456616,
              "upvotes": 3,
              "replies": {
                "gm2cozd": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm2cozd/",
                  "text": "APA isn't that much different from MLA overall, so it's easier to learn. God, I love Chicago though.",
                  "author": "_alex_perdue",
                  "created": 1612489682,
                  "upvotes": 2,
                  "replies": {
                    "gm2gfvp": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm2gfvp/",
                      "text": "Chicago supremacy",
                      "author": "WinkyInky",
                      "created": 1612491440,
                      "upvotes": 1,
                      "replies": {
                        "gm2wfko": {
                          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm2wfko/",
                          "text": "What can I say? It’s the superior system!",
                          "author": "_alex_perdue",
                          "created": 1612499494,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "glzl5ob": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzl5ob/",
          "text": "You really would think that’s how it would be but instead they think it’s more important that we read Romeo and Juliet, which isn’t going to teach anyone proper grammar and spelling.",
          "author": "NeonRose222",
          "created": 1612447710,
          "upvotes": -1,
          "replies": {
            "glzokp3": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzokp3/",
              "text": "Writing and reading are interconnected skills. \n\nSadly, most school programs don't focus on those skills enough, largely because they only care (or only have enough time to cram as much shit as possible) about SOL scores in a vaccumm.",
              "author": "KouNurasaka",
              "created": 1612449381,
              "upvotes": 21,
              "replies": {
                "glzqiy1": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzqiy1/",
                  "text": "You’re definitely right, but I just want to clarify that I called out Shakespeare because his writing is so far away from modern grammar, spelling, punctuation, and sentence structure. Reading is a great way to improve writing skills, but it works best if you read something written in the last hundred years, or at the very least an actual book instead of a play.",
                  "author": "NeonRose222",
                  "created": 1612450255,
                  "upvotes": 1,
                  "replies": {
                    "glzszlw": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzszlw/",
                      "text": "And high school English classes *do* involve *a lot* of readings that aren't Shakespeare. None of this is his fault.",
                      "author": "olympic-lurker",
                      "created": 1612451351,
                      "upvotes": 6,
                      "replies": {
                        "gm2d7uq": {
                          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm2d7uq/",
                          "text": "Depends on the class, honestly. Even at my school (which had a decent English program), the lower and mid-level English classes didn't read more than their summer assignment and maybe two other books. My classes (which were upper level, IB HL track if you really want to know) had us read like eight books a year. \n\nOf course, we spent time dissecting each book in detail, same as the lower-level classes, but I think that misses the mark a bit. In order to be better at reading and writing, yes, you need to learn \\*how\\* to do it, but I also think you need to do it intensively.",
                          "author": "_alex_perdue",
                          "created": 1612489929,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "glzwbvr": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzwbvr/",
              "text": "It is a serious problem that we've merged writing and literature into a single course.\n\nImagine if instead of math as its own subject you learned math only as a side issue in your science classes?\n\nYou do study writing as its own thing in elementary school. But in high school? It's not the norm. 4 years of not studying writing as its own subject, then all you get in college is typically two semesters of freshman comp.",
              "author": "bl1y",
              "created": 1612452785,
              "upvotes": 8,
              "replies": {
                "gm0aj0l": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0aj0l/",
                  "text": "That’s a good point. Most of the writing done in high school is about books, so students miss out on learning to write research papers and especially professional skills like emails, resumes, etc.",
                  "author": "NeonRose222",
                  "created": 1612458325,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "glzl6l9": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzl6l9/",
              "text": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[Romeo and Juliet]( https://snewd.com/ebooks/romeo-and-juliet/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)",
              "author": "Reddit-Book-Bot",
              "created": 1612447723,
              "upvotes": 6,
              "replies": {
                "glzud5k": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzud5k/",
                  "text": "Good bot",
                  "author": "eggnogwithextranog",
                  "created": 1612451958,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "glxwj62": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxwj62/",
      "text": "Lol premeds.",
      "author": "leeeelihkvgbv",
      "created": 1612405991,
      "upvotes": 1,
      "replies": {}
    },
    "glxvn4m": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxvn4m/",
      "text": "[deleted]",
      "author": null,
      "created": 1612405555,
      "upvotes": 6,
      "replies": {
        "glxvrpz": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxvrpz/",
          "text": "It is probably a mix of both of those things, haha.",
          "author": "haveagreatday97",
          "created": 1612405617,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "glxpz0t": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxpz0t/",
      "text": "Like every day I am and I still don't get it. I'm guessing it's either a lack of proofreading on their part or they're just plain, simple not good at English",
      "author": "jamayonaiz",
      "created": 1612402766,
      "upvotes": 5,
      "replies": {
        "glxqac2": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxqac2/",
          "text": "I agree with that. I also think people don’t read actual books anymore. I definitely think being a avid reader in high school helped develop my writing skills.",
          "author": "haveagreatday97",
          "created": 1612402920,
          "upvotes": 6,
          "replies": {
            "gm12nox": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm12nox/",
              "text": "Not just reading, but reading people who are great writers.",
              "author": "bl1y",
              "created": 1612469429,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "glxpffi": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxpffi/",
      "text": "I have actually noticed this and specifically thought \"how are you even passing any classes at this point?\" At this point we are all taking graduate level courses or damn near close to them. I remember doing a \"peer review\" a couple years ago on a rough draft of a paper and the person's paper I ended up peer reviewing was so horrid (not to mention had a total of zero citations) that the whole thing ended up being marked up. I felt bad but looking back I'm glad I took the time to really review it and I genuinely hope to this day it helped them even just a little.",
      "author": "OmieBloomie",
      "created": 1612402497,
      "upvotes": 95,
      "replies": {
        "glxq3x1": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxq3x1/",
          "text": "One of my professors had to make an announcement saying people had 40%+ turn it in scores. Like, huh? Then they said the students could fix it by writing in their own words. They’re seniors in college...They don’t know that already? \n\nIt’s definitely a good thing you marked them up. Hopefully, they eventually took it seriously.",
          "author": "haveagreatday97",
          "created": 1612402833,
          "upvotes": 46,
          "replies": {
            "glxsw9r": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxsw9r/",
              "text": "Haha! Yeah, never fuck around with turn it in. I don't know why people even try, it's not even worth it!!",
              "author": "OmieBloomie",
              "created": 1612404206,
              "upvotes": 20,
              "replies": {
                "glxt7m0": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxt7m0/",
                  "text": "Right? I was like, you’re making an announcement about this? You’re not just...getting the plagiarists for plagiarism? Maybe they were covering their ass, so once people do it again they can’t say they didn’t know.",
                  "author": "haveagreatday97",
                  "created": 1612404358,
                  "upvotes": 17,
                  "replies": {
                    "glxu0hr": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxu0hr/",
                      "text": "I think it really depends on the professor themselves but yes, I am surprised that with a 40% similarity report on turn it in that the professor would even think to consider a second chance. I feel like most of my professors over the years would have just instantly failed the student but who knows!",
                      "author": "OmieBloomie",
                      "created": 1612404751,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "glzuytp": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzuytp/",
              "text": "Students relying heavily on direct quotations is often a sign that they don't understand the underlying material.",
              "author": "bl1y",
              "created": 1612452217,
              "upvotes": 4,
              "replies": {
                "glzwn05": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzwn05/",
                  "text": "It’s worse because they’re not quoting. They’re cut and pasting with no quotes and then slapping a citation at the end of the sentence. My professor told them they could cut down on that by writing in their own words. I can’t imagine a 40+ turn it in score. I get 15% and I’m stressed until I realize it’s just my citations.",
                  "author": "haveagreatday97",
                  "created": 1612452915,
                  "upvotes": 3,
                  "replies": {
                    "glzxmzv": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzxmzv/",
                      "text": "This post is fucking triggering me. :-D",
                      "author": "bl1y",
                      "created": 1612453328,
                      "upvotes": 3,
                      "replies": {
                        "glzy5dw": {
                          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzy5dw/",
                          "text": "I couldn’t be a professor. I would have no idea how to tactfully explain that you need to write in your own words as a senior in college. I definitely feel sympathy for professors and commend them for all the work they do.",
                          "author": "haveagreatday97",
                          "created": 1612453535,
                          "upvotes": 1,
                          "replies": {
                            "gm0dud1": {
                              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0dud1/",
                              "text": "Why should it even have to be tactful?",
                              "author": "bl1y",
                              "created": 1612459623,
                              "upvotes": 1,
                              "replies": {
                                "gm0hk87": {
                                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0hk87/",
                                  "text": "I may be thinking student evaluations are more important for professors than they actually are, but I would think that enough students complaining about a professor being “mean” for trying to teach them could cause issues for the professor. That shouldn’t be the case, but I’d definitely prioritize keeping my job over trying to teach people who refuse to learn if it came to that.",
                                  "author": "haveagreatday97",
                                  "created": 1612461077,
                                  "upvotes": 1,
                                  "replies": {
                                    "gm0vw77": {
                                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0vw77/",
                                      "text": "For adjuncts, student evaluations are the most important thing, second perhaps to office politics.\n\nThere's also a difference between being mean and being blunt, though I imagine most students would take bluntness as meanness. We've shift the norms so far in the direction of trying to give criticism as gently as possible.",
                                      "author": "bl1y",
                                      "created": 1612466691,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gm033u3": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm033u3/",
          "text": "As far as I can remember, our teachers taught us left and right. The majority of kids just...didn't listen. My sister's teachers used to go over punctuation (big deal in German) EVERY SINGLE YEAR. She still can't do it and complains about her shitty teachers from the past. GIRL, had you not been binge drinking every weekend from 13 to 17 and paying attention in class instead of focusing on being 'cool', you would know.\n\nIn grade 11 and 12 (you can graduate after year 10 but if you want to go to uni/college, you have to take a special program afterwards...it's like A-Levels in Britain) all of my classmates would always tell me: \"How do you know that? Why are you so good at this?“. The answer is: I fucking paid attention in class, asked a question or googled when I had any issues and the rest of it is common sense. It's really not magic. Stop ordering shoes online and actually do the work.",
          "author": null,
          "created": 1612455508,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "glxi3yr": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxi3yr/",
      "text": "[removed]",
      "author": null,
      "created": 1612398888,
      "upvotes": 6,
      "replies": {
        "glxpjhb": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxpjhb/",
          "text": "Personally, I think I could. If I don’t write as well as I think, the workforce will teach me that real quick lmao.",
          "author": "haveagreatday97",
          "created": 1612402553,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "glxcgg9": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxcgg9/",
      "text": "I hope they teach all this in college, I haven't had many essay based assignments in hs..",
      "author": "warlockAES",
      "created": 1612396126,
      "upvotes": 10,
      "replies": {
        "glxqqef": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxqqef/",
          "text": "All these tips are great, I also recommend you read books. I don’t mean academic books but novel type books you’re interested in. Reading will help your writing. I promise you can find a book you like, just takes some searching.",
          "author": "haveagreatday97",
          "created": 1612403141,
          "upvotes": 11,
          "replies": {}
        },
        "glxozf7": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxozf7/",
          "text": "Highly suggest taking AP Lang and Comp. they don’t really teach it in college despite it being necessary to know for writing.",
          "author": null,
          "created": 1612402274,
          "upvotes": 16,
          "replies": {}
        },
        "glxe4wb": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxe4wb/",
          "text": "It’s not difficult to learn outside of college and it IS a skill you need no matter what.",
          "author": "FreezingDemon",
          "created": 1612396932,
          "upvotes": 15,
          "replies": {
            "glxhe2s": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxhe2s/",
              "text": "Yeah, I'll work on it.",
              "author": "warlockAES",
              "created": 1612398532,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "glzoqw1": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzoqw1/",
          "text": "Best thing you can do to help yourself is to write more and read more. Write things that you like, and read things you like. \n\nPractice each a little everyday, just like a workout.",
          "author": "KouNurasaka",
          "created": 1612449461,
          "upvotes": 4,
          "replies": {}
        },
        "glyghqo": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyghqo/",
          "text": "Most colleges will have a resource center (may go by a different name). It is literally filled with knowledgeable people who will help you at any point in the research or writing process. Not sure if a source is appropriate, or how to cite it? Have your ideas down, but stuck on that pesky hypothesis? Need help fine tuning a paper? They can help you with those things and many more. Don't be embarrassed to utilise this source! You're paying for it!",
          "author": "asimplekitten",
          "created": 1612416777,
          "upvotes": 4,
          "replies": {}
        },
        "glxhkm2": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxhkm2/",
          "text": "[deleted]",
          "author": null,
          "created": 1612398621,
          "upvotes": -1,
          "replies": {
            "glxz6si": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxz6si/",
              "text": "I'm curious, did you not have a gen-ed writing requirement?",
              "author": "RigaudonAS",
              "created": 1612407296,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "glxawxe": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxawxe/",
      "text": "Yes it baffles me, and it got me in trouble with academic integrity once with a group project. \n\nYou always have to be the one to personally go behind all of your group mates and make sure that your project isn’t going to get the whole group a zero. \n\nIt’s like trying to do a college level project with 4 12 year olds honestly.",
      "author": "ilikecacti2",
      "created": 1612395379,
      "upvotes": 201,
      "replies": {
        "glxpuh0": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxpuh0/",
          "text": "I've been in similar situations. If a group project requires a major write up portion I will be the first to jump in and offer to do this part because for one, I know I am good at it and secondly, I just do not trust most people to do the writing well enough.",
          "author": "OmieBloomie",
          "created": 1612402703,
          "upvotes": 61,
          "replies": {}
        },
        "glyt9jt": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyt9jt/",
          "text": "I'm in my last year of my English degree and was taking a module where we basically dissected 1 novel in exxtreme detail. We were given the regular kind of essay topics you would expect. Once we handed up the assignments, our lecturer said a large portion just summarised the novel in 2,500 words.",
          "author": "98Yeets",
          "created": 1612426351,
          "upvotes": 27,
          "replies": {}
        },
        "gm0vis8": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0vis8/",
          "text": "Hey, thats an insult to twelve year olds. The twelve year olds I went to school with always used citations and proper grammar.",
          "author": "AccountAn0nymous",
          "created": 1612466543,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "glx348w": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glx348w/",
      "text": "A lot of high schools don't teach this, and when you get to college, professors say \"you should know this already, you're in college!\" Ugh been there for sure. If you're lucky you'll get an engaged professor who is willing to actually explain this stuff. Librarians are awesome resources for citation help, too ... but most students don't know they can ask.",
      "author": "NashiPearl",
      "created": 1612391779,
      "upvotes": 27,
      "replies": {
        "glzylji": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzylji/",
          "text": "Unfortunately, a lot of the \"you should know this already\" stuff are things like subject/verb agreement, what independent and dependent clauses are, basic comma usage, and even things as simple as what a subject in a sentence is.",
          "author": "bl1y",
          "created": 1612453719,
          "upvotes": 7,
          "replies": {
            "gm1svbf": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm1svbf/",
              "text": "Remember that the current generation of students was largely taught under a different English model to you and other older adults. This kind of grammar simply is not taught to any depth in most places. I'm sure someone will say they learnt grammar 5 hours a day for 6 years, but it's the exception now. I'm nearly 25 and I vaguely remember nouns, verbs, clauses etc but it was perhaps only for a week in year 8 or something.\n\nThe new model of English teaching is focussed on \"natural\" learning, supposing that we can identify the \"correct\" grammar even if we don't know the formal rules. Young people are more likely to say that a sentence \"looks wrong\" but not be able to convey what's wrong with the structure using any standard terms.\n\nSo your students actually *shouldn't* know these things in any great detail. The curriculum has changed, so now whenever people try to give us feedback on grammar we lack the vocabulary to understand it. The system relied on us reading a lot of books and getting a lot of natural feedback, which obviously didn't happen in too many schools.",
              "author": "officially_anxious",
              "created": 1612480348,
              "upvotes": 4,
              "replies": {}
            },
            "gm181sm": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm181sm/",
              "text": "That's true. However, since student knowledge in these areas are likely closely tied to their school system and access to socioeconomic privilege, I'm inclined to find a way to get them access to writing resources anyway. One of my favorite books is William Zinsser's *On Writing Well,* but campus writing centers are good resources too.",
              "author": "NashiPearl",
              "created": 1612471589,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "glx2jck": {
      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glx2jck/",
      "text": "Yeah and I assume they are all freshmen tbh. \n\nA lot of STEM majors suck at writing since it’s not required. Writing is just like any other skill, it must be practiced.",
      "author": "Steakhuntt",
      "created": 1612391515,
      "upvotes": 108,
      "replies": {
        "glxnjye": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glxnjye/",
          "text": "OP says in the post they are seniors. And yes engineering students are terrible writers because the only formal writing we do in college is lab reports.",
          "author": "Marethyu38",
          "created": 1612401576,
          "upvotes": 43,
          "replies": {
            "glzv8ue": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzv8ue/",
              "text": "And this is why intro English classes are required for all students at many schools.",
              "author": "veanell",
              "created": 1612452332,
              "upvotes": 8,
              "replies": {
                "gm0bamo": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0bamo/",
                  "text": "Except when you test out of them. AP lit and an act english score of something meant no english classes for me",
                  "author": "Marethyu38",
                  "created": 1612458624,
                  "upvotes": 3,
                  "replies": {
                    "gm0rb16": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0rb16/",
                      "text": "Ideally that should have put you at the same level as students who didn't test out",
                      "author": "veanell",
                      "created": 1612464863,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "glyj1gx": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyj1gx/",
          "text": "I review resumes and can confirm that a large number of STEM majors suck at writing. The issue is also about the ability to communicate effectively and understand how other people make decisions, not just spelling/grammar. We tend to overemphasize numbers and neglect to consider many human elements in a given situation. A lot of the resumes I review are written without any errors but are missing a critical component: they don't consider how it comes across to the audience, what the audience wants to see, and how the audience makes decisions.\n\nWriting in many cases is about critical thinking and emotional intelligence. *How will he interpret it if I phrase it this way? What type of arguing style is this group most receptive to? What feelings does this person have about the topic and how can I write in a way that works with them?* You can practice writing to eliminate spelling mistakes but you need to grow as a person to write in ways that win over people.",
          "author": "br1039",
          "created": 1612418427,
          "upvotes": 16,
          "replies": {}
        },
        "glygbqb": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glygbqb/",
          "text": "As a STEM major I assure you we do PLENTY of writing.",
          "author": "Gj_FL85",
          "created": 1612416674,
          "upvotes": 32,
          "replies": {
            "glzmnty": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzmnty/",
              "text": "As a physics and math major I wrote very little. Bit me in the ass when I had to write my masters thesis and it was a pile of shit that my advisor told me he would be embarrassed to send to copy editing.",
              "author": "shadowcentaur",
              "created": 1612448462,
              "upvotes": 9,
              "replies": {
                "gm1rqq0": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm1rqq0/",
                  "text": "I wrote a lot as a physics and math major, especially for the 20-40 page term papers and lab reports! It's a *slightly* different style to creative writing, but still writing and still takes some skill. It's very obvious when someone is a bad writer in research papers. I mean, even research papers are persuasive writing, not just technical. No one is going to care about your research if it's purely technical, they won't even get past the first page before they're asleep.",
                  "author": "officially_anxious",
                  "created": 1612479836,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "glyhsdk": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyhsdk/",
              "text": "Sometimes it's true. It depends on the school. At the school I did my undergrad at, the Comp Sci/ Engineering Department offered to pay writers from the university paper to write research reports for their students. They did that because even the professors in the department thought their students were terrible writers.",
              "author": "OneTruePulisic",
              "created": 1612417600,
              "upvotes": 17,
              "replies": {}
            },
            "glzmgz4": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzmgz4/",
              "text": "I do feel like I'm writing a bunch, but if it's not an English class they don't check as hard for grammar vs. what you're saying.",
              "author": "PrinceBunnyBoy",
              "created": 1612448369,
              "upvotes": 6,
              "replies": {}
            },
            "glzu12m": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzu12m/",
              "text": "Same, im a cs major and writing *constantly.* tbf, my school is trying to squash the stereotype that engineers can't write for shit.",
              "author": "smallangrynerd",
              "created": 1612451811,
              "upvotes": 5,
              "replies": {
                "gm19mtm": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm19mtm/",
                  "text": "Yeah I'm Cybersecurity/IT and while that hasn't been an explicit goal, most of my non-technical assignments involve writing paragraphs or responses. Although tbf it's usually not full on essays/papers.",
                  "author": "Gj_FL85",
                  "created": 1612472216,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gly9c7e": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gly9c7e/",
          "text": "Just graduated from a STEM major, and I definitely feel like I have a deficiency in writing.",
          "author": "volfanatic",
          "created": 1612412588,
          "upvotes": 15,
          "replies": {}
        },
        "glypait": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glypait/",
          "text": "In my gen ed mandatory writing class of 30, only 3 people excluding me were decent writers. 1 of which was a journalism major. The other 2 were STEM, and my class had a decent split of majors.\n\n\nI'm STEM but came from a very humanities-heavy school and went from a solid B in English student to literally getting zero negative comments across the 20 pages of writing I submitted across 3 essays in that class. I went from thinking I was bad at writing to realizing the bar was just set really high from me. \n\n\nSo personally speaking, had the class been freshmen (which my class was entirely), then you couldn't say much about someone's writing based on their major, but if it's a class of seniors (like OP said) then I can agree it's pretty sad that some STEM majors lack writing skills. And I'm not just talking writing in general, I'm talking the ability to communicate ideas in a specific manner, as well as assert, defend, and refute arguments. I've never been exposed to actual \"bad\" writing until college, actually, and that's when all that became clear.",
          "author": "StoicallyGay",
          "created": 1612423000,
          "upvotes": 4,
          "replies": {}
        },
        "glz4lyg": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glz4lyg/",
          "text": "A STEM major and the amount of technical report you have to write it a lot so I guess I’m good in writing technical reports but that’s about it cause that’s the only report I ever had to write most of the time.",
          "author": "iSYNDICATExPRO",
          "created": 1612436564,
          "upvotes": 2,
          "replies": {}
        },
        "glyf9g1": {
          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyf9g1/",
          "text": "Ehh. I think it depends, I’m a doublemajor in a humanities and engineering field- but the worst writers I’ve seen come from the “social sciences.” (Think psychology, communications, etc.) Lots of engineering programs stress critical technical communication skills that can enforce some baseline competence, on top of increased quantitative/academic rigor. I know my school’s unit ops classes had four different eighty page reports due in the semester the class was taken. Meanwhile the capstone psychology class only required a single ten page paper.\n\nMost halfway credible programs know that communication skills and leadership are important and that need to be stressed- lots of the engineering stereotypes come from the cringe first years who fail out. \n\nStill, the people who are really screwed are the people in the social sciences— their degrees lack the technical/blunt quantitive communication skills of STEM, but also lack the more creative and qualitative skills that you’ll learn in the humanities. For example, a “upper level psych stats” class at my school is basically an introductory calc-based science stats class — minus the calc. While the writing-oriented classes will still do less intense writing than you would in an upper division philosophy or ethics class, not to mention increased grade inflation. This can be generalized to a whole class of degrees that a lot of people use to “just get a piece of paper.” \n\n(Bear with my typos, my phone is bugging out so I can’t type easily.)",
          "author": "catfeinee",
          "created": 1612416022,
          "upvotes": -1,
          "replies": {
            "glyhbgf": {
              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glyhbgf/",
              "text": "The social sciences include a lot more than just psychology. I think sociology and anthropology majors can attest to the fact that they do more reading and writing than students of many other disciplines.",
              "author": "OneTruePulisic",
              "created": 1612417298,
              "upvotes": 8,
              "replies": {
                "gm02b0f": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm02b0f/",
                  "text": "Philosophy def beats both of those majors with writing",
                  "author": "Steakhuntt",
                  "created": 1612455195,
                  "upvotes": 1,
                  "replies": {
                    "gm038vl": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm038vl/",
                      "text": "At some schools, it certainly does. That's probably not true at all schools, however.",
                      "author": "OneTruePulisic",
                      "created": 1612455562,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "glzseqw": {
                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/glzseqw/",
                  "text": "I’ve seen some pretty watered down texts in sociology, so even if it’s not as bad as psychology/communications I’m hesitant to believe it’s comparable to classics, philosophy, etc.\n\nNot to mention most social “sciences” have *huge* reproducibility issues, which largely come from developing any really quantitive skills- pair that with a the inability to have the same reading comprehension as a deep liberal arts major and you have the recipe for disaster. \n\nOf course, it’s still not as bad as psych, where more than half of academic papers sampled by Nature can not be reproduced- and sociologists rarely claim to be on the same playing field as their physical scientist counter parts in their claims to objectivity.\n\n\nI’m going on a bit of a tangent, but I have always seen sociology are more of a liberal arts- even though it’s classified as a social “science.” For example, sociologists often do qualitative research that they feel fine with publishing. While this certainly requires immense effort and can give non-scientific insight into problems, it’s not scientifically rigorous in the least. Pair that with a lacking quantitative education and now you have an even bigger mess. The label of science isn’t supposed to be a participation award, if you’re not doing scientifically rigorous work you’re closer to the humanities than you are a science.",
                  "author": "catfeinee",
                  "created": 1612451093,
                  "upvotes": -3,
                  "replies": {
                    "gm00ox4": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm00ox4/",
                      "text": "Not sure why you don’t think qualitative science counts as “rigorous” science. It’s a different approach used for studying topics that aren’t easily quantifiable. Not everything can be crunched into numbers, especially when it comes to social sciences. \n\nNot only that, but often qualitative science is how new theories are developed before being applied to more generalizable, quantitative studies. \n\nIt really sounds like you need to check your attitude toward qualitative research and social science in general. Just because it isn’t your thing, doesn’t mean it isn’t scientifically valid or important.",
                      "author": "beautifulsubterfuge",
                      "created": 1612454544,
                      "upvotes": 2,
                      "replies": {
                        "gm0h5sd": {
                          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0h5sd/",
                          "text": "When I say “rigorous” I’m not speaking to the difficulty, I’m speaking about it’s adherence to the scientific method.\n\nQualitative *aspects* of research are important, but they always need to be backed up by quantitive, reproducible results. In chemistry you may note the color of a mixture, but if I said it was “light green” that might mean slightly different things to different people, making that statement inherently less scientific than specifying the concentration, absorbance, etc. \n\nSo yes, purely qualitative research *is* less scientific, and if you disagree with that I would suggest you take a class in scientific philosophy/ethics. That is not to say it’s less important, just less scientific. The problem is that a lot of people the humanities-adjacent fields want the same call to authority as a “scientists” so they try to label themselves as such. \n\nThat harms science’s reputation on important topics like global warming, genetics/genomics, and other useful innovations, which hurts society as a whole. \n\nThat’s not to say psychology and sociology are any less *useful* than a scientifically rigorous field, they just aren’t a science.\n\nAlso, it’s absurd to say it “isn’t my think.” I literally have a liberal arts degree on top of the engineering degree I’m trying to get. It’s very important we make these distinctions for the aforementioned reasons. While psychology/sociology is useful and interesting to observe, the moniker of “science” isn’t a participation award. I would highly suggest taking a scientific philosophy class though, it’s an incredibly entertaining and important subject for people to look into.",
                          "author": "catfeinee",
                          "created": 1612460920,
                          "upvotes": 0,
                          "replies": {
                            "gm0la0v": {
                              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0la0v/",
                              "text": "Yeah sorry dude but it’s pretty clear you don’t have a good understanding of qualitative science or social sciences in general. I say this as someone who has done both qualitative and quantitative research in grad school.",
                              "author": "beautifulsubterfuge",
                              "created": 1612462532,
                              "upvotes": 0,
                              "replies": {
                                "gm0n17j": {
                                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0n17j/",
                                  "text": "your source: “just trust me bro”\n\n\nIt’s clear I can’t change your mind.",
                                  "author": "catfeinee",
                                  "created": 1612463208,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gm2dvym": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm2dvym/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1612490252,
                      "upvotes": 2,
                      "replies": {
                        "gm2govu": {
                          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm2govu/",
                          "text": "Oh no, I didn’t mean to imply it was because of crappy writing skills- I went off on a tangent haha. If anything it’s the opposite, it’s their lacking quantitive skills that lead to rampant p-hacking, intentional or not.\n\nI do think it is partially a scientific method issue, mainly because they’re not employing correctly.",
                          "author": "catfeinee",
                          "created": 1612491557,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "gm017m1": {
                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm017m1/",
                      "text": "I mean this as politely as possible, but you do not seem to be very well informed about sociology.",
                      "author": "OneTruePulisic",
                      "created": 1612454757,
                      "upvotes": 0,
                      "replies": {
                        "gm0fhpi": {
                          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0fhpi/",
                          "text": "One of my parents teaches sociology at university, the other teaches psychology. I received my degree in classics last year and am now getting one in chemical engineering, so I’ve seen both sides of the coin when it comes to qualitative academics being compared to quantitive academics. Unfortunately, growing up that means I’ve had to read some pretty poorly supported studies- not to mention listening to practicing professors complain about their field all day. \n\nMaybe my viewpoint is jaded from growing up with adults in both fields and being exposed to them at an early age- but dismissing what’s happening in your field all together is just burying your head in the sand. \nIf you can’t reckon with the reproducibility crisis in your own field you probably won’t be able to push it forward. Then again, it’s not like you’re a grad student- so you don’t really understand the field too well either. You’ll really only start to run into these troubles as you go up the academic food chain, when funding, prestige, and pedigree begins to overtake academic honesty. The pot is really calling the kettle black.",
                          "author": "catfeinee",
                          "created": 1612460270,
                          "upvotes": 1,
                          "replies": {
                            "gm0k1ip": {
                              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0k1ip/",
                              "text": "Actually, I am a graduate student.",
                              "author": "OneTruePulisic",
                              "created": 1612462048,
                              "upvotes": 1,
                              "replies": {
                                "gm0k9el": {
                                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0k9el/",
                                  "text": "First year or second year? \n\nIf you passed your candidacy exam and have not yet recognized the issues sociology has with reproducibility then I have some bad news for you. I do have a hard time believing you because  I don’t think any hopeful academic would blatantly ignore the problems in the field of choice. \n\nEven in chemistry/chE at my institution first years are required to go through ethics classes that teach them, in excruciating detail, the deficiencies in our academic system.",
                                  "author": "catfeinee",
                                  "created": 1612462134,
                                  "upvotes": 0,
                                  "replies": {
                                    "gm0krsg": {
                                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0krsg/",
                                      "text": "I'm not in sociology, although I'm in a parallel field. Criminology. I'm about halfway through an MS. \n\nI am well aware of issues of reproducibility within the field of sociology, but acting as if it is a pseudoscience is just plain ignorant.",
                                      "author": "OneTruePulisic",
                                      "created": 1612462335,
                                      "upvotes": 1,
                                      "replies": {
                                        "gm0kxqh": {
                                          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0kxqh/",
                                          "text": "I didn’t say it’s a pseudoscience, just that it’s not scientific. \n\n\nIt has inherent value, unlike pseudosciences.",
                                          "author": "catfeinee",
                                          "created": 1612462399,
                                          "upvotes": 1,
                                          "replies": {
                                            "gm0lfe5": {
                                              "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0lfe5/",
                                              "text": "Sociology follows the scientific method, making it a science. \n\nThat's fair. You also seem very down on qualitative research, acting is if that cannot be scientific. It can.",
                                              "author": "OneTruePulisic",
                                              "created": 1612462590,
                                              "upvotes": -1,
                                              "replies": {
                                                "gm0llp9": {
                                                  "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0llp9/",
                                                  "text": "It does not follow the scientific method in its entirety, just “experimenting” isn’t the scientific method. You need reproducible experiments with well defined variables. If you want to get a graduate degree you should know that a high-school level understanding of what a science is shouldn’t cut it. \n\nI highly suggest you take a class in scientific philosophy.",
                                                  "author": "catfeinee",
                                                  "created": 1612462657,
                                                  "upvotes": 2,
                                                  "replies": {
                                                    "gm0m82i": {
                                                      "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0m82i/",
                                                      "text": "I guess we can agree to disagree there. There are other ways of testing a hypothesis that do not require strict experimental control.  \n\nI have. Different disciplines have different orientations and philosophies.",
                                                      "author": "OneTruePulisic",
                                                      "created": 1612462899,
                                                      "upvotes": -1,
                                                      "replies": {
                                                        "gm0mhjw": {
                                                          "link": "/r/college/comments/lc06q7/anyone_else_baffled_by_your_classmates_inability/gm0mhjw/",
                                                          "text": "Yeah, I guess that’s what we’ll have to do.\n\nI want to say I wasn’t trying to disrespect your field or whatever- so I hope you weren’t offended. It’s just different definitions of the same thing, and by my definition what you believe in is fundamentally less scientific. Experimental control and reproducibility is the most important part of making a field scientific. If we disregard that we could say that even religions are “sciences.”\n\nHave a nice day!",
                                                          "author": "catfeinee",
                                                          "created": 1612463001,
                                                          "upvotes": 1,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634055459
}