{
  "sid": "qbcmyn",
  "link": "/r/college/comments/qbcmyn/withdrawing_from_a_class/",
  "title:": "Withdrawing from a Class",
  "text": "Hello, I’m a Sophomore in my 2nd year and right now I’m taking 17 credits. I have A’s in all my other classes and one F (Calculus 2). Tests make up 45% of the grade and I bombed my first test really bad. I don’t see the point in risking messing up my GPA even though this class is required for my planned major. Should I drop it, do you think? How best would I be advised? I feel really stupid and dumb for not doing so well in this class TBH… normally I’m at least B minimum.",
  "author": "Bed8",
  "created": 1634653629,
  "updated": 1634654336,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hh8j2fc": {
      "link": "/r/college/comments/qbcmyn/withdrawing_from_a_class/hh8j2fc/",
      "text": "First of all I feel for you mate .\nCalculus is not everyone's cup of tea that's why it needs lots of practice to be good at it .\nI can also tutor you, so hit me up",
      "author": "Due-Imagination4299",
      "created": 1634653923,
      "upvotes": 1,
      "replies": {}
    },
    "hh8jbcr": {
      "link": "/r/college/comments/qbcmyn/withdrawing_from_a_class/hh8jbcr/",
      "text": "If having to take this class later can delay your degree id say taking the C is better than spending an extra semester to graduate. You could also switch your major to something that doesn't have calculus on it, drop this class, and never have to take it again",
      "author": "cowfishAreReal",
      "created": 1634654030,
      "upvotes": 1,
      "replies": {
        "hh8jo1g": {
          "link": "/r/college/comments/qbcmyn/withdrawing_from_a_class/hh8jo1g/",
          "text": "I think there is literally a 0% chance of me getting a C with how I bombed my first exam. I’ve been thinking of maybe taking Calculus over a Winter or Summer semester at a community college or online to make up for the extra semester.",
          "author": "Bed8",
          "created": 1634654179,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh8jigt": {
      "link": "/r/college/comments/qbcmyn/withdrawing_from_a_class/hh8jigt/",
      "text": "Find the withdrawal deadline. I would wait and see for a bit more to find out if it was possible to still pass the class. I'd rather pass the class than delay it further.",
      "author": "GoldRequest",
      "created": 1634654114,
      "upvotes": 1,
      "replies": {
        "hh8jrka": {
          "link": "/r/college/comments/qbcmyn/withdrawing_from_a_class/hh8jrka/",
          "text": "Withdraw Deadline is November 1st.",
          "author": "Bed8",
          "created": 1634654220,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}