{
  "sid": "qgofr5",
  "link": "/r/college/comments/qgofr5/how_much_do_you_remember_from_your_classes/",
  "title:": "How much do you remember from your classes?",
  "text": "I barely remember anything from my classes. When something comes up from previous class I am not confident with my knowledge. I have to search it up. But I am able to recognize things.",
  "author": "nathani3l0g",
  "created": 1635308777,
  "updated": 1635457108,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hi7l0fe": {
      "link": "/r/college/comments/qgofr5/how_much_do_you_remember_from_your_classes/hi7l0fe/",
      "text": "Do you type on laptop or write out your notes?",
      "author": "MetaBrains",
      "created": 1635309733,
      "upvotes": 2,
      "replies": {
        "hi7lh8g": {
          "link": "/r/college/comments/qgofr5/how_much_do_you_remember_from_your_classes/hi7lh8g/",
          "text": "Some classes I type because there is too much information to actually write out. But I will make organized and written out things that are important.",
          "author": "nathani3l0g",
          "created": 1635310015,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hi7mrlt": {
      "link": "/r/college/comments/qgofr5/how_much_do_you_remember_from_your_classes/hi7mrlt/",
      "text": "Depends on the subject honestly. In my business classes now it all goes in one ear and out the other. But I can tell you everything I learned about freshman year in history and biology. Weird how that works.",
      "author": "notthelettuce",
      "created": 1635310822,
      "upvotes": 2,
      "replies": {}
    },
    "hi7muy7": {
      "link": "/r/college/comments/qgofr5/how_much_do_you_remember_from_your_classes/hi7muy7/",
      "text": "I’m an English/WGS major. It depends on the material and my interest but I usually focus on the big name stuff. you’re expected to reread a lot and come to your own conclusions. There’s been times I’ve read the same book for several different classes.\n\nFor example, the worst novel I ever read for school was villette. I had to read it last semester and write a paper on the little girl Lucy Snowe had to care for at her godmother’s. it’s so boring I can’t tell you anything about it beyond the superficial. I don’t even remember anybody’s name but dr John’s and Lucy snowe. The gist is an arrogant AF xenophobic jealous pathological liar, Catholic hating 20 something goes to France to teach at a convent and finds love. I can’t tell you why it was written or why she did what she did but I can recommend the book to you.",
      "author": "CapriciousSalmon",
      "created": 1635310882,
      "upvotes": 2,
      "replies": {}
    },
    "hi886tq": {
      "link": "/r/college/comments/qgofr5/how_much_do_you_remember_from_your_classes/hi886tq/",
      "text": "Engineering is annoying in a way where you take all these theory courses early for more practical courses later in your degree, only for some to be never referred to again\n\nI get that it's good problem solving, but stuff from Calc III? Out of sight, out of mind",
      "author": "SanderzFor3",
      "created": 1635327992,
      "upvotes": 2,
      "replies": {}
    },
    "hi8un7z": {
      "link": "/r/college/comments/qgofr5/how_much_do_you_remember_from_your_classes/hi8un7z/",
      "text": "No matter what, whenever you land your first job they will teach you their way and you will data dump everything you learned in college.",
      "author": "Spicybooiii",
      "created": 1635341880,
      "upvotes": 2,
      "replies": {}
    },
    "hi7w51o": {
      "link": "/r/college/comments/qgofr5/how_much_do_you_remember_from_your_classes/hi7w51o/",
      "text": "As a senior in Economics, I can’t tell you 90% of what I’ve learned. The more interesting/practical concepts stuck to some degree, but if I had to take tests again for those classes I’d fail.",
      "author": "Casual-Economist",
      "created": 1635317618,
      "upvotes": 1,
      "replies": {}
    },
    "hi9oce9": {
      "link": "/r/college/comments/qgofr5/how_much_do_you_remember_from_your_classes/hi9oce9/",
      "text": "A lot but definitely not everything. I'm not a robot",
      "author": "TragicalKingdom",
      "created": 1635354176,
      "upvotes": 1,
      "replies": {}
    },
    "hi9q1vh": {
      "link": "/r/college/comments/qgofr5/how_much_do_you_remember_from_your_classes/hi9q1vh/",
      "text": "I usually don’t really remember much but I usually learn on my own at a later date, using the little bits I remember to help form an understanding of the material.",
      "author": "Daoist_Fig",
      "created": 1635354859,
      "upvotes": 1,
      "replies": {}
    }
  }
}