{
  "sid": "qtbg5d",
  "link": "/r/college/comments/qtbg5d/college_major_advice/",
  "title:": "College major advice",
  "text": "I am currently a undergraduate sophomore at my college and I am soon going to declare my major. I want to make sure that I am picking the right degree/major/minor for becoming a business intelligence analyst/specialist and a data analyst. .The degree is called MIS (management information systems). The degree is a mixture between business and information technology. All the business classes I already finished like marketing, accounting, finance, management, etc. \n\n1. The soon to be technical classes I will take are python, database management systems, SQL, system analysis, data warehousing, ETL, data analytics, business intelligence, project management, and an internship.  Are those classes worth taking for the data field? I already now those are classes that are good in the data field but I just want to make sure.\n\n2. Are any of those particular subjects difficult to learn as in are the concepts hard to understand? If you need a comparsion for something I find difficult it's something that requires tremendous hours of studying to fully understand the concept of what is being taught in class like computer engineering majors. How would you rank them from being the most difficult to being the easiest?\n\n3.If it turns out that I don't like data analytics once I graduate, what other carrer fields can I go into that aren't a business intelligence specialist or a data analyst? \n\n4 .As for the minor, my college recommends I minor in marketing, applied economics, supply chain or finance. Out of those 4 options which one will be the best and most broad in the data analyst field?\n\n5. With that certain combination of the MIS major and whatever minor you recommend I get, what other types of career fields can I go into?",
  "author": "No_Helicopter9361",
  "created": 1636841675,
  "updated": 1637181970,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkiiq5i": {
      "link": "/r/college/comments/qtbg5d/college_major_advice/hkiiq5i/",
      "text": "For me, I wanted to be a production manager but I had no idea if I would like it or not. I started attending student summits from Disney and DreamWorks and started hearing real life production managers speak. Right now im in a mentorship with production managers and thats how I knew for sure I knew I wanted to be one.\n\nYou can contact a buisness intelligence analyst on LinkedIn or somewhere where you can network and ask them if they can tell you how they like the job or not. Hearing several people talk about their position in several companies helped me.\n\nAs for your major, its not binding to one pathway I believe. Just Google \"what can I do with a MIS management information systems degree\" and im sure several industries and positions would pop up.",
      "author": "Turtleisim",
      "created": 1636844546,
      "upvotes": 1,
      "replies": {}
    }
  }
}