{
  "sid": "q1cwdg",
  "link": "/r/college/comments/q1cwdg/talk_to_elder_people_helps_dealing_with_future/",
  "title:": "Talk to elder people: helps dealing with future related anxiety",
  "text": "Sometimes anxiety about the future really hits me. I frequently find myself thinking only about situations that I cannot yet control, it kinda feels like the world is moving really fast and I'm so so slow. Friends are thriving and I got stuck.\n\nThis constant feeling gets me, to a point where anxiety turns into desperation and sometimes depression. I have talked about it with my bf, and he supports me, but his words are not that useful because he is in the same place in life that I'm at.\n\nRecently I talked with my grandma about a couple of my concerns. You cannot imagine how well it felt. I didn't tell her how I was feeling, just talked about my problems. I guess she got it. She talked about her experiences, and other people's too. Somehow she guided me through little steps that may help me in my process, it was all more clear. She never told me what to do, just talked. \n\nAlso, last week we had a conversation panel, where ex students talked about their lives, and their different paths within the same career. It helped a lot. They gave tips, they were honest, saying at some point they were lost. But there they are, trying their best with what they got. It made me feel relieved. \n\nThe thing is, doesn't matter if they're 5, 10, 40 years older than you. People may have lived more, and have experienced more. Let them guide you. You have friends, yes, but if they're your age, they really are not going to help that much. It's OK to talk to other people, just try it. They have a different perspective and you need it. \n\nOpen your mind, it's not weird talking to your parents, teachers, people who graduated years before you, grandparents. They are glad to share things that will help you, because maybe they also needed those words back in time.\n\nFriends and other students sometimes just show us their best, they post about their jobs, they getting everything they wanted, but it's just social media, remember that. The truth is we are all kind of lost. Just find someone with a more realistic perspective of life.",
  "author": "GreenTurtlePotato",
  "created": 1633375517,
  "updated": 1634084200,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {}
}