{
  "sid": "m21cht",
  "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/",
  "title:": "Does anyone prefer online classes?",
  "text": "Yeah I know I’m most likely in the minority here, but I find online classes way easier to manage. I’m mostly in asynchronous courses so I don’t have to worry about attendance, which  helps.  When I had In person classes it was hard for me to keep up with strict attendance policies and attend every single class.  I also was really never effective in learning in class, I always had to do outside research and studying which is how I mostly learned my material, even since HS. \n\nThe only two problems I have with online classes are the lack of social interaction (with students and even your professor) and the fact that at times it can still be challenging to motivate myself.",
  "author": "moonlightred10",
  "created": 1615393477,
  "over_18": false,
  "upvotes": 1165,
  "upvote_ratio": 0.94,
  "comments": {
    "h6dikxj": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/h6dikxj/",
      "text": "I'm a freshman engineering student. When the subject is Calculus or maths, I find it effective since I can research stuff immediately and my mind is not so much tired because of other stuff like commuting.\n\nBut for technical stuff, I feel less-confident because I rely more on YouTube and virtual labs suck. Plus group works and projects require social interaction to be effective doing it all yourself doesn't help at all.",
      "author": "LeNewbiee",
      "created": 1627141358,
      "upvotes": 1,
      "replies": {}
    },
    "h4dzbat": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/h4dzbat/",
      "text": "College is extremely expensive so I say its best for classes to be in person to make most out of one's experience/education. Plus it becomes hard to concentrate during online classes/easier to slack off imo",
      "author": "aphroditeuwu",
      "created": 1625685854,
      "upvotes": 1,
      "replies": {}
    },
    "gqn5sf3": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqn5sf3/",
      "text": "No, they are the bane of my existence. But I'm glad some people are doing well",
      "author": null,
      "created": 1615513385,
      "upvotes": 1,
      "replies": {
        "gqn5ucp": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqn5ucp/",
          "text": "Thank you",
          "author": "moonlightred10",
          "created": 1615513414,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqm9gla": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqm9gla/",
      "text": "Yes, online has been way better for me. I don’t like async, but scheduled online zoom lectures are ideal for me. \n\nI have some chronic health problems, and now when I’m feeling sick I can just attend class from bed without any problem. If I’m really not feeling well, I can turn my camera off. If I need a heating pad or one of my meds it’s always there. And I never have to squeeze into an uncomfortable lecture deck — I can be at my desk set up which I have exactly how I like it. \n\nI also love all the time I save by not having to get to and from class — i just have a lot more time more than I used to and the extra free time is nice. Oh, and back to back classes are so much easier. Now I can go and make myself good food in between, or do all kinds of useful things instead of frantically running between classes. My room is actually clean bc i can straighten for a few min here and there during the day. And I don’t get stuck on campus aimlessly between classes. I can cook myself a real meal during lunch, or take a nap in a hammock like I did today.",
      "author": "Thunderplant",
      "created": 1615497310,
      "upvotes": 1,
      "replies": {}
    },
    "gqldnr0": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqldnr0/",
      "text": "There are some things I hate about it but then there are some things I like too. I like that I can watch or re watch lectures anytime without missing critical material. Being able to stay home is also nice. The teacher is often forced to show his notes on zoom very closely so theres a better line of communication from teacher to student. Some teachers still have unbelievablely bad handwriting though so it depends.",
      "author": "Ruvikify",
      "created": 1615483495,
      "upvotes": 1,
      "replies": {}
    },
    "gql2e9n": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gql2e9n/",
      "text": "I usually don't but because I have BPD, it's a struggle coming to in-person classes. Online is still hard but I can pace myself a little better. I do miss people because sometimes that's probably still better for me & my whackass mood swings",
      "author": "cassiusthetic",
      "created": 1615478553,
      "upvotes": 1,
      "replies": {}
    },
    "gqkplkq": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqkplkq/",
      "text": "It’s been a hell of a blessing for me, for the most part, with engineering classes. But I realize that everybody learns differently, and I just happen to learn best reading stuff on my own while listening to a professor drone on and babble is torturous for me. I would say that the biggest problem I’m seeing in asynchronous engineering classes is a professor will make the tinniest little mistake and it will leave you wasting so much time trying to figure out what the hell is going on and where the numbers are coming from when the problem could have been instantly solved in person (or through zoom) by asking a question.",
      "author": "youonkazoo53",
      "created": 1615472607,
      "upvotes": 1,
      "replies": {}
    },
    "gqkejy0": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqkejy0/",
      "text": "It depends on the course. I have some I do enjoy!",
      "author": "ohmymycelium",
      "created": 1615466082,
      "upvotes": 2,
      "replies": {}
    },
    "gqk8cf8": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqk8cf8/",
      "text": "It has its pros and cons, I imagine.\n\nMy first year of college was a lockdown year. I have never even been in my university building, and I notice I kind of 'miss' the experience. Surely it's nice to watch lectures at my own pace from the comfort of my room, but part of the appeal of college to me is nice old buildings and fancy lecture halls. I was looking forward to 'the whole experience' if you know what I mean.\n\nOnline lectures have also made it so that my teachers don't know who I am. Nor did I manage to make any friends so far. Nobody knows me and I don't know anyone. I need to do a bachelor thesis from behind my laptop, without having access to the recourses my college would normally have available for me.\n\nAnother problem I have with online lectures is that they are more boring. It is tedious to listen to. And since I am already on my PC I feel inclined to also do other things (such as Reddit). I just cannot stare at a screen for 6 hours a day, but that is what it often comes down to.\n\nI have also noticed the whole online lecture thing has led to teachers not sticking to their schedules. \"Y'all are home anyway so where do you need to go\" or whatever their mindset is. I have teachers whose 1,5 hour lectures take 2 or even 2,5 hours. There was one class where I wasn't able to sit any of the lectures through to the end, because I had to go to work and the teacher was still going. I get that they don't need to worry about classroom availability or tight schedules, but I still have things to do. You can't just consume an extra hour of my day because you feel like it.\n\n&#x200B;\n\nSo yeah: Long story short - it has its advantages. I do college from home, meaning I don't need to find an apartment, meaning I don't need to pay ridiculous rent fees. But boy is this a loss of quality.",
      "author": "SwampPotato",
      "created": 1615461512,
      "upvotes": 1,
      "replies": {}
    },
    "gqk36w7": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqk36w7/",
      "text": "Yes! Unfortunately, all my classes this semester are synchronous or in person though. I love taking asynchronous classes though. It’s just so nice! I take a full class load in the summer because those are always asynchronous at my school.",
      "author": "huskeya4",
      "created": 1615457934,
      "upvotes": 1,
      "replies": {}
    },
    "gqjzz96": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjzz96/",
      "text": "I absolutely love it. I’ve taken full classes for each semester and have had straight A’s. I don’t ever want to go back to campus.",
      "author": "cashmoneymay",
      "created": 1615455430,
      "upvotes": 1,
      "replies": {}
    },
    "gqjsgwd": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjsgwd/",
      "text": "I took Microbiology online last semester at community college.  Half of the class was cheating through an app for every single multiple choice quiz and exam.  When I told the professor in front of the whole class (without naming names) she told me that all the professors knew that cheating was rampant and what could she do about it?  When I suggested not doing multiple choices quizzes with the answers in Quizlet, she said it would take too much time.  When I suggested it was more important that we actually learn the material than take multiple choice quizzes and tests, I was laughed at by half of my classmates who told me I was old and that’s how school is done now.  I am in my 40s with a law degree.  No one I know cheated in law school.  You would have been expelled if caught and most of the exams were essays.  I dropped the class.  The Microbiology class was a prerequisite for all of the college’s allied health profession programs.  A whole slew of surgical techs, ultrasound techs, LPNs publicly cheated on every single test....I just hope they never pass their licensing boards.  I called the college as well and left a message with the Dean of that program.....no response.   So, not a fan of online classes.",
      "author": "ifihadmoretime_74",
      "created": 1615449922,
      "upvotes": 1,
      "replies": {}
    },
    "gqjs5fm": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjs5fm/",
      "text": "I feel the same way. No LRT rides and I can schedule my work around my time for the most part, so I’ve been able to get more hours in at work. The hardest part is definitely forcing myself to work in the same place I nap and Play Xbox. My professors have either been “watch the videos whenever you want as long as you do the test” and “ Zoom discussions with assignment in between, no recorded lecture”\n\nReading has been uped in every class, which does suck.",
      "author": "hisayn",
      "created": 1615449711,
      "upvotes": 1,
      "replies": {}
    },
    "gqjs0nn": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjs0nn/",
      "text": "Don't need to care much about laundry, food, commuting, waking up that much early. It has its upsides. I'm not in a STEM field I guess it would suck if you would need to do that online. Sounds super hard.",
      "author": "Zyrobe",
      "created": 1615449620,
      "upvotes": 1,
      "replies": {}
    },
    "gqjmoer": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjmoer/",
      "text": "I love online classes it’s way more efficient use of my time if the lessons are delivered correctly this way",
      "author": "Altomah",
      "created": 1615446100,
      "upvotes": 1,
      "replies": {}
    },
    "gqjlign": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjlign/",
      "text": "If it was not under the typical university system I would enjoy online classes a lot more. \n\nI dont mind online learning when it is on my own time, but in a formal education setting, I much perfer in person",
      "author": null,
      "created": 1615445349,
      "upvotes": 1,
      "replies": {}
    },
    "gqjkwb1": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjkwb1/",
      "text": "This. \n\nA lot of synchronous classes take up so much time in my schedule, and I'm finding this semester much more manageable with 90% of my classes being asyncrhonous.\n\nYes, the interaction part is a bit of a downside, but some teachers still find a way to keep us engaged (e.g. by discussion boards) :D\n\nI would say the instructor plays a big role in whether the course becomes a nightmare or your favorite class :)",
      "author": "theflyinghonu",
      "created": 1615444965,
      "upvotes": 1,
      "replies": {
        "gqjlkbe": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjlkbe/",
          "text": "My university is forcing synchronous classes for everything. It is very annoying",
          "author": null,
          "created": 1615445384,
          "upvotes": 3,
          "replies": {
            "gqk17v8": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqk17v8/",
              "text": "Wow, that is not nice :(",
              "author": "theflyinghonu",
              "created": 1615456440,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gqjk5da": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjk5da/",
      "text": "I had some pretty disorganized professors before the pandemic. However, my online classes are much more structured and organized. The only issue I have is the online lab portion of chem.",
      "author": "Orkney_",
      "created": 1615444502,
      "upvotes": 1,
      "replies": {}
    },
    "gqjh7pu": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjh7pu/",
      "text": "I prefer to be in an academic setting. It sets the tone better and you're more motivated. I miss my study spot. \n\n...But watching lectures in bed without having to leave it is also nice.",
      "author": "Chobitpersocom",
      "created": 1615442743,
      "upvotes": 1,
      "replies": {}
    },
    "gqjfbcd": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjfbcd/",
      "text": "Me!! I love online classes! I agree that it’s way easier to manage and the not worrying about attendance is definitely a plus. I’m taking 2 this semester and 4 in person and my in person ones are burning me out with so much work that I don’t even look at my online classes unless there’s an assignment due or if a test is coming up.",
      "author": "ahhsome99",
      "created": 1615441609,
      "upvotes": 1,
      "replies": {}
    },
    "gqjerq9": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjerq9/",
      "text": "[deleted]",
      "author": null,
      "created": 1615441297,
      "upvotes": 1,
      "replies": {
        "gqjescp": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjescp/",
          "text": "Happy Cake Day azzelf! I hope you will have a wonderful year, that you'll dream dangerously and outrageously, that you'll make something that didn't exist before you made it, that you will be loved and that you will be liked, and that you will have people to love and to like in return.",
          "author": "EncouragementRobot",
          "created": 1615441308,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqjeh9m": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjeh9m/",
      "text": "I agree with all these points, until it's time to do a group project and everyone goes ghost on you.",
      "author": "MissionCattle",
      "created": 1615441143,
      "upvotes": 2,
      "replies": {}
    },
    "gqjdk3q": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjdk3q/",
      "text": "yes so much. i can finally have a decent sleep schedule.",
      "author": "Basic-Butterscotch44",
      "created": 1615440627,
      "upvotes": 1,
      "replies": {}
    },
    "gqj67pu": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqj67pu/",
      "text": "No, there are two ways to interpret it. Online classes are better in the sense, we can complete our tasks easily at home living with family but it is very repetitive, so much so I feel like I don't spend some time for me and myself. And people just join for the sake of it, nobody actually wants to study online. People just copy stuff and find loopholes. Learning online is learning half heartedly. For those who procrastinate online classes suck because they only complete things last minute. If they had pressure offline they would have been more productive. Besides it's my first year of college and I haven't even met my friends in person so it feels awkward. I am sure if the classes were offline I would have performed better in exams. But few good things are that if you hang around in good servers then you can bs kinda productive.",
      "author": "madr1401",
      "created": 1615436095,
      "upvotes": 1,
      "replies": {}
    },
    "gqj52ab": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqj52ab/",
      "text": "I like the asynchronous classes but not the synchronous (synchronous have zoom meetings for anyone who doesn't know). Am I learning anything that I'll remember after the semester ends? No. But I'm a freshman and these are all prerequisites so I don't care atm.",
      "author": "pancakebirdpowder74",
      "created": 1615435386,
      "upvotes": 1,
      "replies": {}
    },
    "gqj4e2e": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqj4e2e/",
      "text": "I am extremely happy with online classes. I always disliked commuting/driving to school and finding parking, paying for the expensive pass, walking all the way to class, trying to find a spot to hang out with at my gaps, etc. \n\nI am also a person who learns a lot better on their own, and without having to commute I am able to dedicate a lot more time to homework and studying and is overall a more efficient use of my time. \n\nThe only downside I have noticed for myself was that I’m a lot more distracted in online lectures, but I still pay enough attention so it doesn’t affect my performance",
      "author": "sweetcheeks920",
      "created": 1615434931,
      "upvotes": 2,
      "replies": {}
    },
    "gqj34u3": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqj34u3/",
      "text": "I did as much in person as humanly possible. For my upcoming semester that I just registered for, I got into three in-person, two hybrid (half in person-half on zoom), and one fully online (no zoom). I learn better in person and don't really enjoy zoom. I find myself more easily getting distracted and less motivated, more likely to do other things during the zoom like read or play Sims 4 on my desktop.",
      "author": "MaiaOnReddit",
      "created": 1615434129,
      "upvotes": 1,
      "replies": {}
    },
    "gqj1a13": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqj1a13/",
      "text": "I WAY prefer online classes. I tried going to college many times and the only way I could do it was online. I had a hard time making myself go to class when it was in person, and then I was so insanely bored I couldn’t pay attention. At home I can just get my shit done and be done with it.\n\nI’m also the type of person that doesn’t study. The more I study, the worse I do. I’m actually kinda struggling with that in anatomy right now - it’s the first class I’ve been in where you can’t really get by without studying (unless you’ve taken it before/have the prior knowledge from somewhere else) and it’s hard for me. Usually I’m a read it once and it sticks type of person and I may review once right before a test but that’s it. But with anatomy there’s just so much I have to learn there’s no way it’s all gonna stick just reading it once. Which is another reason I didn’t like in person classes, showing up only to have the professor spend 15 minutes lecturing and then telling us we had “study time” the rest of the period but if we left class we’d be docked on attendance. It drives me insane even now in anatomy lab, except thankfully our professor doesn’t care if we stay or not. But it is frustrating to make the drive only to have him tell us something I could’ve read in our online portal and then say we can have study time or go home. \n\nHonestly I don’t really get all the hate towards online classes but I also know generally speaking it’s “traditional” for the majority of people to do in person learning - most of us do it throughout elementary, middle, and high school, so it makes sense most people would through college and would be more comfortable with it because it’s what they know and it still has some form of structure. We all learn differently but I feel like it gets a ton of hate. \n\nAlso I like online classes bc I can do a bunch of work when I’m feeling motivated and then I don’t have to worry about it for however long.",
      "author": "trippapotamus",
      "created": 1615433111,
      "upvotes": 1,
      "replies": {}
    },
    "gqizbdg": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqizbdg/",
      "text": "I’m a freshman studying Voice Performance and online is rough for my piano, studio, and ensemble classes. For my non-music classes, it’s not as bad. I try to take synchronous sections whenever that’s available since I have issues with motivation and prefer some social interaction. On the bright side, my community college is split into 5 different campuses, and I kind of like not having to worry about whether a class I need is offered at the campus I go to (all of the music classes are only offered at one campus)",
      "author": "Songibal",
      "created": 1615432001,
      "upvotes": 1,
      "replies": {}
    },
    "gqiyzvq": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqiyzvq/",
      "text": "I think it's mainly due to the professor. The major problem most people have with online classes is motivation, having a professor make you want to study erase that disadvantages.",
      "author": "nghigaxx",
      "created": 1615431826,
      "upvotes": 2,
      "replies": {}
    },
    "gqiysuj": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqiysuj/",
      "text": "It depends. Last semester, online class was fine. My classes were organized even when most of them were asynchronous. I thought I actually preferred online classes\n\nBut now it’s so much harder!! I can’t focus. Classes are disorganized. It’s very fast so I can’t catch up w lectures.\n\nDef online classes have pros but I guess it just depends overall",
      "author": "jukiiee",
      "created": 1615431719,
      "upvotes": 1,
      "replies": {}
    },
    "gqixviz": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqixviz/",
      "text": "          I disagree about that, I find it harder to focus during those videos lectures for my business classes.\n\nBut at the same time for easier classes it s mostly upside",
      "author": "frankrozier963",
      "created": 1615431218,
      "upvotes": 1,
      "replies": {}
    },
    "gqixrp3": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqixrp3/",
      "text": "I'm less likely to go to online class",
      "author": "SirThicccolas",
      "created": 1615431159,
      "upvotes": 2,
      "replies": {}
    },
    "gqixg5y": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqixg5y/",
      "text": "For me, my classes are online, and I don’t currently have a car (community college). I prefer online classes in the sense of I don’t have to drive to class. However, online learning is not the best way for me to learn. Not my favorite, but it’s being virtual is very convenient for me.",
      "author": "cynical_root24",
      "created": 1615430983,
      "upvotes": 1,
      "replies": {}
    },
    "gqivhh1": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqivhh1/",
      "text": "I honestly prefer online classes because I don't have to be waiting the effing day for a lecturer to appear, no paper wastage, no getting up early to go for a 15 min drive with my parents as well as organising transport for someone else to bring me home and I don't have to face with some classmates that I'm not super keen on. (I'm both introvert and extrovert but picky enough)\n\nThe disadvantages is worrying if I experience a power cut and internet going down. Other than that I bloody love it!",
      "author": "Different-Treacle979",
      "created": 1615429945,
      "upvotes": 1,
      "replies": {}
    },
    "gqiveic": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqiveic/",
      "text": "I love online school. I’m also very self-motivated and organized so that helps",
      "author": "Sand_Fair",
      "created": 1615429900,
      "upvotes": 1,
      "replies": {}
    },
    "gqitjch": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqitjch/",
      "text": "I prefer online classes because I’m physically disabled and getting around campus is a pain in the ass.  I also use a ton of energy getting ready to go to class, and for online classes I can pretty much just roll out of bed since no one can see if I’m pajama pants.  Staying at home means that I have a lot more energy to put into my schoolwork and my WFH job.",
      "author": "simplysydney22",
      "created": 1615428913,
      "upvotes": 1,
      "replies": {}
    },
    "gqisle8": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqisle8/",
      "text": "Yep, totally agree! Instead of wasting 2 hours trying to follow along, or with prof talking about his ex wife, or with other students distracting, etc, etc, etc, I can just do my work and learn on my own. Videos online help fill in any blanks I have, and I can still ask my profs for explanations when I get stuck. (Most of them anyway, lmao). I learn better when I can absorb at the rate I need to. \n\nA good teacher can teach anyone anything, right? And it's wonderful to take a great teacher's class. But most teachers are so so and I like it better when they just guide the learning and answer questions than when I have to attend lectures.\n\nPlus I hate going to class. Schedules annoy me.",
      "author": null,
      "created": 1615428425,
      "upvotes": 3,
      "replies": {}
    },
    "gqishsz": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqishsz/",
      "text": "I am dreading having to go to campus. Not only is it more expensive, because I have to actually buy a parking pass. And I just overall enjoy learning at my own pace, in my own space!",
      "author": "flowergurl1901",
      "created": 1615428373,
      "upvotes": 2,
      "replies": {}
    },
    "gqirlkv": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqirlkv/",
      "text": "100% better for me. No commute, no worrying about not being able to read from the back row, can get food and drink immediately upon need, can go to the gym or outside to exercise much more easily, just lots of saved time.",
      "author": "idoescompooters",
      "created": 1615427911,
      "upvotes": 1,
      "replies": {}
    },
    "gqiqxau": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqiqxau/",
      "text": "some clases yes but I'm in a community college rn so idk how it'll be at university but rn I like having more time to do certain things",
      "author": "ericce24",
      "created": 1615427560,
      "upvotes": 1,
      "replies": {}
    },
    "gqipjay": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqipjay/",
      "text": "I honestly just like the aspect where they record the lectures. I would skip classes all the time my previous semester anyway, but at least now I can just watch lectures at times 2 speed to catch up.",
      "author": "god_is_a_dead_meme",
      "created": 1615426854,
      "upvotes": 1,
      "replies": {}
    },
    "gqip2bb": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqip2bb/",
      "text": "Yes. I wish I could do online classes forever.",
      "author": "Ilaxilil",
      "created": 1615426613,
      "upvotes": 1,
      "replies": {}
    },
    "gqiobt2": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqiobt2/",
      "text": "If the professor is good and the class is asynchronous then the class will be easy. If the professor is bad and/or its synchronous, it is horrible. I have three online classes rn. All synchronous but luckily all good professors. I have two in person, one good professor one horrible and i fucking hate him.",
      "author": "goldxoc",
      "created": 1615426231,
      "upvotes": 2,
      "replies": {}
    },
    "gqimplc": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqimplc/",
      "text": "no",
      "author": "GloGangOblock",
      "created": 1615425390,
      "upvotes": 1,
      "replies": {}
    },
    "gqil3f6": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqil3f6/",
      "text": "I think we will see more college classes be online with the option of attending.",
      "author": null,
      "created": 1615424535,
      "upvotes": 1,
      "replies": {}
    },
    "gqikzt5": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqikzt5/",
      "text": "I took a science class a few years ago in person. It was pretty tough. A lot of information all at once. I got a D, but did figure out how to study in the process and got a B on the final. \n\nLast semester I took another class of this professors but online. We didn’t have a lab, just pictures of rocks instead. It was amazing. I passed with a B. Even got a 90% on the final exam. \n\nI really like online classes. I don’t like how sometimes you can feel the frustration from the teachers, like all this material that needs to be presented online and then made into assignments. It is so much work, but it works for me as the student.",
      "author": "taffypulller",
      "created": 1615424482,
      "upvotes": 1,
      "replies": {}
    },
    "gqiidkz": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqiidkz/",
      "text": "As this is my first semester in college, the pandemic has still relegated me to mostly online classes, with the exception for my communications course. Personally, I’m more of an in-person learner than an online learner. Sure I haven’t had to pay for textbooks since they’re free digital versions, the extra money comes in handy. But, I find it all too difficult to actually focus on my classes. I need physical books and an in-person setting to perform better. Hopefully next semester will be a return to normalcy.",
      "author": "emrgnccy",
      "created": 1615423074,
      "upvotes": 1,
      "replies": {}
    },
    "gqiibgm": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqiibgm/",
      "text": "I really do. My favorite part is being able to prioritize and schedule as needed instead of having to be in class for 3+ hours per week and hope that maybe it will be productive.",
      "author": "squirrel8296",
      "created": 1615423041,
      "upvotes": 1,
      "replies": {}
    },
    "gqihhc7": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqihhc7/",
      "text": "It's not the worst thing in the world.\n\nYour two problems are my two major complaints - I will forever miss meeting people and making friends. \n\nBut many of my professors give us time to take exams, and make them readily available for multiple days to take to give us time to prepare, which makes life more manageable. My GPA is way up because of this - because I have time. I will also forever appreciate having lectures readily available to watch online whenever I feel like it, especially when your Professor includes information that may not be in the textbook.\n\nMy Professors luckily haven't tried to compensate for online class in terms of difficulty and with most things open notebook, makes my academic life easier.",
      "author": "Athragio",
      "created": 1615422589,
      "upvotes": 1,
      "replies": {}
    },
    "gqiha7i": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqiha7i/",
      "text": "The in person classes are way better i give that no cap the professor already has the lecture pre organized for u jus have to do some readings on the main points of the classroom. But overall online learning ur pretty much on ur own dont feel as much pressure not being in a classroom so even tho being on zoom we all be in lala land. Lookin at the screen gets tiring sometimes i am taking a break until the real in person classes return.",
      "author": "chinowyte",
      "created": 1615422483,
      "upvotes": 2,
      "replies": {}
    },
    "gqih7xh": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqih7xh/",
      "text": "I agree because I can escape from being  a awkward turtle and my anxiety. I also don’t have to worry about traveling to college for 2hr+ spending 6hr with multiple classes when I am on my period lol. I am weak I can’t handle it but if college opens I will have to carry it on. So, ya I am loving it online but sometimes it gets hard because it can be hard to understand things online.",
      "author": "Ok_staged_seed",
      "created": 1615422451,
      "upvotes": 1,
      "replies": {}
    },
    "gqig2px": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqig2px/",
      "text": "I thought I did, but I’ve reached the tipping point lol. I’m so tired of sitting in front of my computer and watching videos. Now I can’t wait til we go back in the fall",
      "author": "harshalax31",
      "created": 1615421848,
      "upvotes": 2,
      "replies": {}
    },
    "gqidy88": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqidy88/",
      "text": "At first I didn't like it but now I don't want to go back and will most likely continue with mainly online.",
      "author": "Spheresdeep",
      "created": 1615420720,
      "upvotes": 1,
      "replies": {}
    },
    "gqidsdf": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqidsdf/",
      "text": "I agree with this, I like online classes but I miss the social aspect but hey I get to play video games during lectures no problem",
      "author": "Dascoolman",
      "created": 1615420633,
      "upvotes": 1,
      "replies": {}
    },
    "gqidcke": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqidcke/",
      "text": "For accessibility purposes, yes. I am legally blind and getting from clash to class on campus was a enormous hassle and I had to rely on other people to get me to where I needed to go.\n\nFrom a educational perspective, it depends. I know a lot of teachers have been trying to adapt to the new full mass, and the ones that have I commend greatly, but some have been so insufferable that I can hardly stand being in the class.\n\nmy university is offering the pass/fail option again this year and, as much as I hate to say it, I'm probably going to have to take full advantage of it.",
      "author": "Gamecool_10",
      "created": 1615420404,
      "upvotes": 1,
      "replies": {}
    },
    "gqiblhn": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqiblhn/",
      "text": "I've come to prefer online classes. I miss the social interactions, but with online classes I don't have to waste a beautiful day sitting in a classroom. I can plan my schoolwork around what I want to do for the day/week. Which keeps me interested and not burnt out. As for learning the material? It depends on the teacher.",
      "author": null,
      "created": 1615419482,
      "upvotes": 1,
      "replies": {}
    },
    "gqi9o8a": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqi9o8a/",
      "text": "I prefer online classes for general classes that don’t deal with my major. The flexibility and access to “resources “ is awesome. But I don’t like them for my major classes because I’m less engaged",
      "author": "ryscal16",
      "created": 1615418504,
      "upvotes": 1,
      "replies": {}
    },
    "gqi8avz": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqi8avz/",
      "text": "jesus when are you guys going to stop making 100000 posts about this",
      "author": "Puzzleheaded_Can_750",
      "created": 1615417821,
      "upvotes": 1,
      "replies": {}
    },
    "gqi4fx2": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqi4fx2/",
      "text": "As others have said, it depends on a lot of things. Some professors have not managed online very well. I also feel like actually learning, understanding, and applying the material in class has been difficult. This is especially concerning for classes I need for my major where I want to get the most I can out of it.",
      "author": "fascinatingly_stupid",
      "created": 1615415930,
      "upvotes": 1,
      "replies": {}
    },
    "gqi2nfd": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqi2nfd/",
      "text": "I don’t mind asynchronous courses but the constant synchronous / zoom classes are so annoying.",
      "author": "recexo",
      "created": 1615415077,
      "upvotes": 1,
      "replies": {}
    },
    "gqi1ho1": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqi1ho1/",
      "text": "Yes. I’m a freshman and I enjoy online school more. I hate having to drive all the way to school for a useless general Ed class. I can sleep in. I can get my work done whenever I want and I don’t have to worry about talking to anyone. I got straight As last semester because of online school and I am intending on continuing to take online classes when everything goes back to normal.",
      "author": "Cmtr2113",
      "created": 1615414530,
      "upvotes": 1,
      "replies": {}
    },
    "gqhy2aa": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhy2aa/",
      "text": "i love all the perks of online classes. it's very very convenient, considering i am a commuter. but i really miss campus and just the whole vibe of being a college student. feel like my brain needs a break from being closed doors most of the time.",
      "author": "lesgo_penguin",
      "created": 1615412986,
      "upvotes": 1,
      "replies": {}
    },
    "gqhxzg4": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhxzg4/",
      "text": "I would love them if I weren't struggling with my mental health.",
      "author": "AlexisFitzroy00",
      "created": 1615412952,
      "upvotes": 1,
      "replies": {
        "h4e0agr": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/h4e0agr/",
          "text": "omg sis me too. I suffered depression cuz of this (and my parents dont let me leave the house)",
          "author": "aphroditeuwu",
          "created": 1625686283,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqhwnuv": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhwnuv/",
      "text": "Pretty rough for engineering at my school. They except more from us since they see that we have all this time. And they make all the work harder to fight cheating. Online suck",
      "author": "Jilluminati1",
      "created": 1615412363,
      "upvotes": 2,
      "replies": {}
    },
    "gqhvhbz": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhvhbz/",
      "text": "[https://open.spotify.com/playlist/29jsmvsGZJdnOvdB3Ctrdq?si=qJAuAxf1TIuPpzs31W8p5g](https://open.spotify.com/playlist/29jsmvsGZJdnOvdB3Ctrdq?si=qJAuAxf1TIuPpzs31W8p5g)",
      "author": "ADRIANREY4",
      "created": 1615411853,
      "upvotes": 0,
      "replies": {}
    },
    "gqhv7rn": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhv7rn/",
      "text": "I've done a majority of my college online. It allows you to work a higher paying job and work ahead. Not every school does a good job organizing it though.",
      "author": null,
      "created": 1615411740,
      "upvotes": 1,
      "replies": {}
    },
    "gqhv2as": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhv2as/",
      "text": "For certain subjects classes, definitely.  The classes I'm not interested in but also don't find hard are the ones that I much prefer being online because I don't have to waste as much time on them.  I do prefer the more interesting or harder classes in person though.",
      "author": null,
      "created": 1615411675,
      "upvotes": 1,
      "replies": {}
    },
    "gqhumas": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhumas/",
      "text": "It does depends on Professor and what type of learner you are. If you’re the type that learns from experience or working with your hands that may be hard because you’re so used to being present with the teacher. It also would be hard if you or your teacher isn’t tech savvy or you have bad internet connection. But there are tons are benefits to online learning. Like today I overslept and managed to hop on the Zoom link so I didn’t walk in the minutes late. Or if you have to work a lot and can’t make it to class. Your professor may be understanding and put up zoom recordings of class or the prevention up online for you to look at.",
      "author": "You_Artistic",
      "created": 1615411480,
      "upvotes": 0,
      "replies": {}
    },
    "gqhtwuk": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhtwuk/",
      "text": "Converted classes are honestly amazing but I do miss classrooms... sometimes",
      "author": "Kekoa_ok",
      "created": 1615411172,
      "upvotes": 0,
      "replies": {}
    },
    "gqht5yp": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqht5yp/",
      "text": "I used to not but since covid hell yeah! I saved on gas",
      "author": "Will_I_be_happy",
      "created": 1615410841,
      "upvotes": 0,
      "replies": {}
    },
    "gqhsi6s": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhsi6s/",
      "text": "I completely agree with you here. I have all asynchronous classes and I feel that it’s way easier to manage the workload. In high school, I would also just not absorb anything from class, and learn everything from YouTube videos with good grades. I’m also able to maintain a full time job making $1k+ per week (doordash). It’s the best of both worlds tbh. Idk why people complain so much about it.",
      "author": "iGoatly",
      "created": 1615410549,
      "upvotes": 0,
      "replies": {}
    },
    "gqhsc3l": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhsc3l/",
      "text": "What I hate is that formerly in person classes forced online have all made classroom discussions into “discussion posts.” It feels like I’m being punished with extra homework because I was forced to take an online class",
      "author": "Voltaire_747",
      "created": 1615410475,
      "upvotes": 3,
      "replies": {}
    },
    "gqhsbvl": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhsbvl/",
      "text": "Great professors are honestly what makes online classes more manageable in my opinion. Now that I am doing my masters I really appreciate online classes since I can work full time an not have to worry about much interference from work. I have had to get creative with shift swaps a few times, but not having to worry about money while in school takes away 10000lbs of stress.\n\nOver all that this stage I prefer online. I do miss seeing people in person tho.",
      "author": "Eened",
      "created": 1615410472,
      "upvotes": 0,
      "replies": {}
    },
    "gqhs9se": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhs9se/",
      "text": "In school classes are nice but if they would record the lectures like in some online classes, that would be better.",
      "author": "jk41589",
      "created": 1615410446,
      "upvotes": 0,
      "replies": {}
    },
    "gqhrkoz": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhrkoz/",
      "text": "I think they're easier, but that's about it. I prefer in-person classes.",
      "author": "Aquarius_00",
      "created": 1615410140,
      "upvotes": 0,
      "replies": {}
    },
    "gqhqomx": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhqomx/",
      "text": "I completely agree, although I think it would be harder if I was going into a math/science field instead of the political science/sociology/legal studies majors I am currently studying. I think it would be perfect if common study areas on my campus were open.",
      "author": "plantifax",
      "created": 1615409756,
      "upvotes": 0,
      "replies": {}
    },
    "gqho2sk": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqho2sk/",
      "text": "i think it really depends on your major. for example, im majoring in geology so online school has made it extremely difficult for me to actually learn, and the same goes for my sibling who's majoring in biology.",
      "author": "biutifulpatata",
      "created": 1615408657,
      "upvotes": 2,
      "replies": {
        "h4dzxt6": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/h4dzxt6/",
          "text": "it also depends on the person i think but yeah major does play a huge role. I major in chemistry and am fucking bored with online classes. My sibling is studying media and constantly complains how they miss out on the hands on experience.",
          "author": "aphroditeuwu",
          "created": 1625686135,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqho1oc": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqho1oc/",
      "text": "I used to because I hate leaving my house, but I cannot sit in front of a laptop for 8 hours watching lectures. It’s the most soul crushing thing in the world. And online labs can go to hell. Right now is definitely the worst possible time to be any kind of science major.",
      "author": "yuxngdogmom",
      "created": 1615408645,
      "upvotes": 2,
      "replies": {}
    },
    "gqhntzw": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhntzw/",
      "text": "For me, I think the problem is just the courseload. With in-person class, you go to school and walk from class to class but with online school, you’re literally sitting at your desk for hours.\n\nOther than that, I love the flexibility and the absence of commuting.",
      "author": "ultimate_learner",
      "created": 1615408558,
      "upvotes": 0,
      "replies": {}
    },
    "gqhnmpf": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhnmpf/",
      "text": "Yeah, my gpa jumped a whole point",
      "author": "BluJayTi",
      "created": 1615408474,
      "upvotes": 0,
      "replies": {}
    },
    "gqhnazj": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhnazj/",
      "text": "I do way more. I only have another year left and I'm hoping I can finish at home",
      "author": null,
      "created": 1615408337,
      "upvotes": 0,
      "replies": {}
    },
    "gqhmzyq": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhmzyq/",
      "text": "I love online classes. I love that I don’t have to do hair or makeup, put on jeans, don’t have to make breakfast in the morning when I’m not hungry because I’m going to be gone all day, don’t have to fight for parking or pay for it, don’t have to walk through crowds of students, don’t have to listen to professors go off on tangents and lecture about off topics. If I could do my entire nursing degree online I totally would haha.",
      "author": "kateran723",
      "created": 1615408209,
      "upvotes": 0,
      "replies": {}
    },
    "gqhmvub": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhmvub/",
      "text": "i 180’d into this camp shortly after the start of the pandemic. throughout community college i hated online classes due to their more ambiguous nature and relatively weak structure compared to f2f. i always found myself worrying that i wasnt doing enough and that i had no idea what was going on in class. last semester at my uni, in person attendance was reintroduced but was entirely optional. i went for the first week and immediately felt like it was a complete waste of time. the content of the lectures were essentially cliff notes versions of the textbooks, which you would have to read anyway to get all the relevant information. whats even the point of going to a two hour lecture when i have a more comprehensive version of said lecture at home that im going to have to read regardless of my attendance? currently in my second semester of all online and im not sure ill be able to drag myself back to a classroom ever again😂",
      "author": "W0NDERxxBREAD",
      "created": 1615408162,
      "upvotes": 0,
      "replies": {}
    },
    "gqhm882": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhm882/",
      "text": "No commute, no ridiculously overpriced parking pass and fighting for a parking space only to come back and see someone hit your car, no overpriced cafeteria food, way less time wasted, overall it's pretty sweet.",
      "author": "TipOfLeFedoraMLady",
      "created": 1615407879,
      "upvotes": 0,
      "replies": {}
    },
    "gqhm3tt": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhm3tt/",
      "text": "Finished up my ged stuff online and for the most wasnt bad. I found it difficult to stay motivated at times, more so now than at the beginning, but it did make it easier to manage working 40 hour weeks ontop of 18 unit semesters. However now I am taking my major classes (biotechnology major) and its rough. I am ready to be in a classroom again especially for labs. Im feeling robbed of the experience at this point",
      "author": "biosplice",
      "created": 1615407827,
      "upvotes": 0,
      "replies": {}
    },
    "gqhl4ah": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhl4ah/",
      "text": "I absolutely despise getting up and going to class and probably wouldn’t have if my classes hadn’t been online, even though I was living on campus for the latter half of spring semester last year. Now that I’m in my own place? Never would’ve happened. Online classes have been a godsend in that regard, but it’s definitely a tradeoff. I don’t love having to basically teach myself everything, and I know for a fact that I’m not really retaining anything right now. I’m teaching myself what I need to know to pass quizzes.",
      "author": "WhalenOnF00ls",
      "created": 1615407398,
      "upvotes": 0,
      "replies": {}
    },
    "gqhl2vk": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhl2vk/",
      "text": "I agree entirely. I wouldn't say that I prefer online classes just because I like the structure of in person and the social interactions, but there are definitely pros to online! I think it's more manageable and more flexible for me to design my learning based on what I know about myself - when and how I study best. It's nice to get to skip the required hours of in-person lectures where I don't learn much and simply stick to the ways I learn best.",
      "author": "sgRNACas9",
      "created": 1615407382,
      "upvotes": 1,
      "replies": {}
    },
    "gqhkrtz": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhkrtz/",
      "text": "I study animation and I can tell you something, if you can manage to stay sane without the \"student life\" it's a lot easier to take advantage of the perks. I'm young so I personally usually live with my parents, so they help with shopping, cooking, cleaning, things I had to find time to do while handling up to 8 different projects that included animating full scenes,  writing scripts, editing videos, learning new programs etc. My last semester was so much easier and less intense because I could dedicate all my time to the academy works. So not to say I don't enjoy frontal lectures more (cause I personally do) but it does have it's perks especially with how intense the studies get.",
      "author": "rogat100",
      "created": 1615407251,
      "upvotes": 0,
      "replies": {}
    },
    "gqhkoxm": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhkoxm/",
      "text": "Honestly I do, I’m in my first sem and all of my teaches and classes have been way more manageable than I ever expected. I was a shitty hs student but for some reason I’m actually doing great. I guess it’s a case by case scenario and some people may prefer it to in-person? Idk",
      "author": "justfkndominic",
      "created": 1615407216,
      "upvotes": 0,
      "replies": {}
    },
    "gqhjxhx": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhjxhx/",
      "text": "Surprisingly yes. After trying out online classes I sometimes wonder if it wouldn't be better for me if I had chosen online college from the very beginning.",
      "author": "Brightbx",
      "created": 1615406884,
      "upvotes": 0,
      "replies": {}
    },
    "gqhiwhp": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhiwhp/",
      "text": "Depends what it is. If it's a boring class, yes I like them online bc then I don't have to pay attention. But if it's an interesting class I want to be with the teatcher.",
      "author": "Sakusko",
      "created": 1615406439,
      "upvotes": 0,
      "replies": {}
    },
    "gqhhxf4": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhhxf4/",
      "text": "I prefer online classes that were formatted to be online. The classes that were in-person originally and went online overnight, or the ones with professors who aren't tech-savvy are not my favorites.",
      "author": "SnowOverRain",
      "created": 1615406031,
      "upvotes": 1,
      "replies": {}
    },
    "gqhhnsf": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhhnsf/",
      "text": "  \n\nResidents of Georgia needed for a paid virtual research study in 2 weeks. If you qualify and participate, you will receive $100 for 90 minutes of your time! Complete the questionnaire below and BE HEARD! This study is for research purposes only.\n\n[https://survey.alchemer.com/s3/6230382/1298](https://survey.alchemer.com/s3/6230382/1298)",
      "author": "steelerfanjoey",
      "created": 1615405916,
      "upvotes": 0,
      "replies": {}
    },
    "gqhh8uk": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhh8uk/",
      "text": "since I’m first year, yes. Saves a lot of time getting intro classes out of the way so I can do 18 hrs per semester comfortably",
      "author": "Amxricaa",
      "created": 1615405739,
      "upvotes": 0,
      "replies": {}
    },
    "gqhh4nv": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhh4nv/",
      "text": "I do like them but I do like going to class it’s hard to choose",
      "author": "ClayDolfin",
      "created": 1615405691,
      "upvotes": 0,
      "replies": {}
    },
    "gqhfj15": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhfj15/",
      "text": "If I was a non-STEM manor obviously, just imagine so much free time and almost no stress, however I’m a STEM major and I’m undisciplined as hell, so I leave all the work and study until the last week (exam week) and having a bad time.\nBefore the pandemic I’d go to the gym and library on my free time in college, but now that I’m always at home I just keep surfing on the internet and playing video games.",
      "author": "raylolSW",
      "created": 1615405007,
      "upvotes": 1,
      "replies": {}
    },
    "gqhfcx4": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhfcx4/",
      "text": "No, I hate it. I do well grade wise, but I feel I've retained very little and also there seems to be a lot more busy work in online classes. So, while I don't go to class physically I spend far more time trying to maintain my grades.      \n      \nThis semester my college offered some in person and while it's 1 day versus the typical 2 days a week, I'm enjoying it infinitely more. I've missed the interactions with classmates, and professors. It feels effortless to pick up on concepts in comparison to online exclusive.",
      "author": "EyePlayFantasy",
      "created": 1615404935,
      "upvotes": 10,
      "replies": {
        "h4dzjn1": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/h4dzjn1/",
          "text": "this is literally me. I do extremely well (even better than when classes was in person) but honestly i felt like i put a minimum effort to receive those grades. I was also less engaged in general",
          "author": "aphroditeuwu",
          "created": 1625685958,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqhfcnv": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhfcnv/",
      "text": "[removed]",
      "author": null,
      "created": 1615404932,
      "upvotes": 0,
      "replies": {
        "gqj2smd": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqj2smd/",
          "text": "Sorry, it appears your thread or comment is in violation of /r/college Rule #2: No Spam, No Memes, No Advertising  \r\n\r\nThere are other communities within Reddit better suited for this content. Please share your content there.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
          "author": "VA_Network_Nerd",
          "created": 1615433943,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqheu26": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqheu26/",
      "text": "It depends honestly, if i’m taking easy classes online is better for me. If i’m taking difficult classes in-person is better.",
      "author": "Dn607ny",
      "created": 1615404714,
      "upvotes": 0,
      "replies": {}
    },
    "gqhc96o": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhc96o/",
      "text": "I love online classes, more so if they're asynchronous. Like you, I've always studied and did most of my learning outside of the classroom, so these types of classes are like a dream come true. Besides, I love the idea of taking the class whenever and whereverI want. I've always liked studying at late night (and not having to worry about waking up early for class) and I can do that with online classes.  I don't mind the lack of social interaction, I kinda prefer it because it makes me more motivated to do things instead of worrying about group projects and whatnot.",
      "author": "szatanna",
      "created": 1615403639,
      "upvotes": 0,
      "replies": {}
    },
    "gqhc3th": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhc3th/",
      "text": "I wouldn’t do it with my Biology teacher he just talks to us on zoom like we know what the hell he’s talking about. I believe if your taking hard classes they need to be on campus. I was lucky enough to pass statistics about barely lol.",
      "author": "OnceUpnASuit43",
      "created": 1615403579,
      "upvotes": 1,
      "replies": {}
    },
    "gqhbhpj": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhbhpj/",
      "text": "No. Social interaction is part of the college experience.",
      "author": "GoofyUmbrella",
      "created": 1615403324,
      "upvotes": 3,
      "replies": {}
    },
    "gqhbgyv": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhbgyv/",
      "text": "Online class can kiss my ass.",
      "author": "tattertottz",
      "created": 1615403315,
      "upvotes": 3,
      "replies": {}
    },
    "gqhbalh": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhbalh/",
      "text": "I prefer online and I'm disappointed that classes will likely be in person in the fall. I like that I don't have to commute, pay to commute, pack food everyday, run around to get to my classes, and always feeling like I'm gonna get sick. It's also worse to miss in person classes since they won't be recorded. And coming late to an in person class is embarrassing.",
      "author": "afunnywold",
      "created": 1615403240,
      "upvotes": 1,
      "replies": {}
    },
    "gqha6x1": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqha6x1/",
      "text": "Yeah I do. It allows me to work during my productive hours instead of having to drag myself through a class that I’m barely pay attention to. I also like being able to increase the speed of lectures.",
      "author": "Wonderful_Ruin_6438",
      "created": 1615402780,
      "upvotes": 1,
      "replies": {}
    },
    "gqha3iq": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqha3iq/",
      "text": "It's a mix for me. But one thing I've noticed is that profs think that online gives more time for school, which isnt the case. For a lot of people the pandemic is making things harder. \nI don't like self directed classes, I have some of those. And I hate classes with labs because they're disorganized and too dense.",
      "author": "Professional-Egg-7",
      "created": 1615402742,
      "upvotes": 0,
      "replies": {}
    },
    "gqh9mbs": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh9mbs/",
      "text": "I wish I could do online classes on campus haha. I find it much easier to concentrate in math. Also, professors post their notes online, so if I get confused, I can mute them and focus on my lectures. It's just far more convenient.",
      "author": "internally",
      "created": 1615402547,
      "upvotes": 1,
      "replies": {
        "gqhg5n7": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhg5n7/",
          "text": "[removed]",
          "author": null,
          "created": 1615405274,
          "upvotes": 0,
          "replies": {
            "gqhlkq3": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhlkq3/",
              "text": "Sorry, it appears your thread or comment is in violation of /r/college Rule #2: No Spam, No Memes, No Advertising  \r\n\r\nThere are other communities within Reddit better suited for this content. Please share your content there.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
              "author": "VA_Network_Nerd",
              "created": 1615407596,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gqh97i6": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh97i6/",
      "text": "Asynchronous is fine but I don’t learn anything in zoom classes",
      "author": "PartyBear9",
      "created": 1615402382,
      "upvotes": 2,
      "replies": {}
    },
    "gqh8xl4": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh8xl4/",
      "text": "I have online classes this semester and in Fall and I couldn't be happier. For me, online classes are easier to manage and I don't have a 60 minute drive to campus and back. Plus, I absolutely *hate* driving as it's super stressful and I'm a danger on the road. So ya, online classes are nice.",
      "author": null,
      "created": 1615402271,
      "upvotes": 2,
      "replies": {
        "gqhcmp0": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhcmp0/",
          "text": "I agree! I don't drive, I take the bus and it takes me like two hours to get to school. I dread going back to in-person classes because of this.",
          "author": "szatanna",
          "created": 1615403793,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqh8lq7": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh8lq7/",
      "text": "Yes. Helps when I can’t get out of bed (but at the same time doesn’t help that improve). Honestly the accommodation I never knew I needed.",
      "author": "GreedyGeologist",
      "created": 1615402141,
      "upvotes": 2,
      "replies": {}
    },
    "gqh8c8h": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh8c8h/",
      "text": "At least for me, I prefer in-person classes as I learn much better in a classroom setting rather than on Zoom where I often have a hard time paying attention.\n\nEdit: That being said online class does have its perks. I can eat, take a break, go to the restroom, etc. whenever I feel like doing so.\n\nEdit 2: I'm currently a freshman in college. Although I've had a few socially distant in-person classes, I've never had a true in-person college class. I would like to have one (once the pandemic is over obviously).",
      "author": "jgeorge20",
      "created": 1615402034,
      "upvotes": 0,
      "replies": {
        "gqhgsca": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhgsca/",
          "text": "[removed]",
          "author": null,
          "created": 1615405543,
          "upvotes": 2,
          "replies": {
            "gqj2r7j": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqj2r7j/",
              "text": "Sorry, it appears your thread or comment is in violation of /r/college Rule #2: No Spam, No Memes, No Advertising  \r\n\r\nThere are other communities within Reddit better suited for this content. Please share your content there.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
              "author": "VA_Network_Nerd",
              "created": 1615433921,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gqh7a66": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh7a66/",
      "text": "i think it depends on the class and what kind of work it entails. as a freshman who isn’t a STEM major i’m taking intro/ge classes and most of the time there’s not much to them. \n\ni’m curious as to how freshmen will adjust once we’re back in person since all we know is zoom/asynchronous lectures, open notes, etc. looking on the bright side, being at home has so far helped me get over the anxiety i had over transitioning to college. i was super stressed fall quarter and had lots of anxiety over tests and classes, while it was probably only really bad because of remote learning, i’m sure i would have experienced some of it if we were in person. now i know how to handle it better and i’m glad i didn’t have to go through it alone on campus",
      "author": "balladofmybrain",
      "created": 1615401609,
      "upvotes": 1,
      "replies": {}
    },
    "gqh70wp": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh70wp/",
      "text": "I way prefer online classes. I have so much more free time in the day. Plus I work a full time job, so it is pretty much impossible not to do school online for me",
      "author": "ethancknight",
      "created": 1615401504,
      "upvotes": 0,
      "replies": {}
    },
    "gqh6p87": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh6p87/",
      "text": "pros: Have extra time to sleep in before logging into zoom class, get to dress comfortably, can have as much access to food whenever I feel like during class, can go to bathroom whenever I want in comfort, and don't always have to talk to people (I'm an introvert anyway).\n\ncons: lack of immediate help resources, professor conducts an inefficient course, and lack of socialization (but ofc that doesn't bother me too much).\n\nIn conclusion, I prefer online class",
      "author": "FMG_99",
      "created": 1615401372,
      "upvotes": 0,
      "replies": {}
    },
    "gqh6k6h": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh6k6h/",
      "text": "Same here. I like online classes and I fear going back to regular in person classes since I'm a freshman and I have never attended a lecture hall. I like online classes because if I miss something or if I don't understand something, I can just rewind the video or watch the recording. With in person you can't do that. I also live off campus so not having to get up early in the morning and driving all the way to the school and having to park 20 min away is a huge plus for me.",
      "author": "FerThePro",
      "created": 1615401317,
      "upvotes": 0,
      "replies": {
        "gqhglci": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhglci/",
          "text": "Such good points here. I’m a data researcher in education and your right! Being Able to rewind and control your learning is key. \n\nBut why live off campus when it can live in a community of online learners and apply your learning in the real world[myx]?(www.themyx.com)",
          "author": "Willing-Knowledge-44",
          "created": 1615405458,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqh5c0l": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh5c0l/",
      "text": "I was super anxious about it and thought I'd hate but I'm loving it and dreading it changing back",
      "author": "Shhhhhh86",
      "created": 1615400843,
      "upvotes": 0,
      "replies": {}
    },
    "gqh4md7": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh4md7/",
      "text": "I would say I enjoy online classes better. I don't need to commute to campus, assignments and exams usually have longer availability so I can get them done on my own time, assignemetns are due at midnight instead of when the class starts, etc. \n\nHowever, I will say if I have an online class where the prof never responds to emails/questions then I would much rather prefer an in-person class",
      "author": "TheAnswerWithinUs",
      "created": 1615400566,
      "upvotes": 0,
      "replies": {
        "gqh4ocr": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh4ocr/",
          "text": "Agreed",
          "author": "moonlightred10",
          "created": 1615400588,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gqh489l": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh489l/",
      "text": "I totally agree with everything you said I find online classes great and there is even a record for the class to replay if you have missed anything, no need to attend unnecessary lectures you can study on your own or watch it whenever you have the time and for me no social interaction is a bonus rather than a drawback",
      "author": "sad_banaNa1",
      "created": 1615400412,
      "upvotes": 0,
      "replies": {
        "gqh6gvz": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh6gvz/",
          "text": "Why is it a bonus ? Out of curiosity",
          "author": "moonlightred10",
          "created": 1615401281,
          "upvotes": 1,
          "replies": {
            "gqh7ja9": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh7ja9/",
              "text": "It drains me having to go 4-5 days a week and interact even when I don't feel like it..don't get me wrong I like to socialize but just not on a daily basis it's like I need to recharge..1st yay it's great catching up with everyone 2nd it's still great 3rd ok not so great 4th ok kill me I just wanna be at home",
              "author": "sad_banaNa1",
              "created": 1615401711,
              "upvotes": 0,
              "replies": {
                "gqh8gvh": {
                  "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh8gvh/",
                  "text": "Yeah true I feel that . The going 4-5 times a week part is deff a reason I prefer online",
                  "author": "moonlightred10",
                  "created": 1615402086,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gqh2zrh": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh2zrh/",
      "text": "I enjoyed taking online classes when they were supplementary to normal in person courses. Having a full online schedule is draining though.",
      "author": "SwiftCEO",
      "created": 1615399942,
      "upvotes": 2,
      "replies": {}
    },
    "gqh26cz": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh26cz/",
      "text": "No not for stem classes I am dying",
      "author": "patriciajagb",
      "created": 1615399626,
      "upvotes": 17,
      "replies": {}
    },
    "gqh2005": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh2005/",
      "text": "Yes for the simple fact that they allow me to obtain a degree and work full-time simultaneously. By the end of this year, I will have eight months of work experience from a cooperative program and a significant amount of money invested in the stock market (because I am spending less by staying home) all the while attending school. Emotionally, online classes are not preferable, but that is okay when you recognize the other things that you can gain.",
      "author": "HiddenPopTart",
      "created": 1615399559,
      "upvotes": 0,
      "replies": {
        "h4e0jxw": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/h4e0jxw/",
          "text": "emotionally exhausted. parents ban me from getting a job and going outside. so online is  a big no for me",
          "author": "aphroditeuwu",
          "created": 1625686392,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqh1zm6": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh1zm6/",
      "text": "There are some classes that I appreciate being online and sometimes there's an advantage having them online but generally speaking I think in-person is more effective (at least for me).",
      "author": "yddadrovalf",
      "created": 1615399555,
      "upvotes": 0,
      "replies": {
        "h4e0gcp": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/h4e0gcp/",
          "text": "same sis",
          "author": "aphroditeuwu",
          "created": 1625686350,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqh1adr": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh1adr/",
      "text": "I miss in person classes for that person to person interaction, but I prefer online because it saves me a lot of time and money on commuting. It is easier to manage adult life.",
      "author": "Professional_Mine2",
      "created": 1615399291,
      "upvotes": 1,
      "replies": {
        "h4e06ed": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/h4e06ed/",
          "text": "bruh i lowkey miss commuting because my parents don't allow me to leave the house which extremely affected my mental health",
          "author": "aphroditeuwu",
          "created": 1625686238,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqh0idu": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh0idu/",
      "text": "For STEM classes, no. For most other things, yes.",
      "author": null,
      "created": 1615399013,
      "upvotes": 27,
      "replies": {
        "gqieodw": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqieodw/",
          "text": "RIP for whichever lab hires me after grad lol",
          "author": "Operation12",
          "created": 1615421101,
          "upvotes": 9,
          "replies": {
            "gqig91o": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqig91o/",
              "text": "Facts. It sucks cuz I’ve taken ochem online, but having those actual hands on lab skills would make me so much more appealing",
              "author": "harshalax31",
              "created": 1615421940,
              "upvotes": 4,
              "replies": {
                "gqizvvr": {
                  "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqizvvr/",
                  "text": "Oh man that sucks ochem labs made ochem worth it",
                  "author": "Operation12",
                  "created": 1615432320,
                  "upvotes": 5,
                  "replies": {}
                },
                "gufayzt": {
                  "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gufayzt/",
                  "text": "Chem was hard as hell in person I cannot imagine it online.",
                  "author": "MisunderstoodKT",
                  "created": 1618354161,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gqjhf7c": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjhf7c/",
          "text": "[deleted]",
          "author": null,
          "created": 1615442880,
          "upvotes": 3,
          "replies": {
            "gqnfwqx": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqnfwqx/",
              "text": "Not for geology. Field methods class got replaced with excel spreadsheets, whole year of people literally not learning a single thing actually related to what you are supposed to learn doing the degree",
              "author": null,
              "created": 1615518765,
              "upvotes": 2,
              "replies": {
                "gqpkgk0": {
                  "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqpkgk0/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1615569638,
                  "upvotes": 1,
                  "replies": {
                    "gqqi50a": {
                      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqqi50a/",
                      "text": "I'm honestly skeptical of the idea that online instruction is useful at all",
                      "author": null,
                      "created": 1615585172,
                      "upvotes": 1,
                      "replies": {
                        "gqqi5we": {
                          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqqi5we/",
                          "text": "Hi honestly skeptical of the idea that online instruction is useful at all, I'm Dad! :)",
                          "author": "dadbot_3000",
                          "created": 1615585184,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "gqqkmv7": {
                          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqqkmv7/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1615586396,
                          "upvotes": 1,
                          "replies": {
                            "gqrheg3": {
                              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqrheg3/",
                              "text": "It has less to do with the quality of the lecture and more to do with missing out on a lot of skills, not just hands on elements like lab and field work, but interpersonal skills, discussions, projects etc. On top of all that a lot of more straightforward elements of learning like test taking can't be done properly either because they don't allow you to show your work. I don't understand a point of a class which is just multiple choice questions and lectures on information you could get from a book or a video. I've been learning things from home my whole life and none of that comes even close to what I was able to learn taking lab and field classes. Commuting is fine, I miss it. There's a really strong relationship between environment and memory and I wouldn't have been able to get the out of class work done had I not been able to take the bus to the library on days I didn't have class.",
                              "author": null,
                              "created": 1615604810,
                              "upvotes": 1,
                              "replies": {
                                "gqrv03f": {
                                  "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqrv03f/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1615613785,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gqgzq5g": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgzq5g/",
      "text": "I like the online format better than in class (for the most part). It is much more convenient, and the main thing is I do not have to worry about transportation and getting to class. There are some features of in person lecture I miss, such as social interaction between peers and teachers, but half of it is made up if meetings are still held in an online classroom such as zoom.\n\nMy university has been really wanting to get back to in person classes, and I'm like \"NO.\" Haha.",
      "author": "ayu1234",
      "created": 1615398767,
      "upvotes": 3,
      "replies": {}
    },
    "gqgzdj1": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgzdj1/",
      "text": "Every time I sit down for a lecture in person I just zone out. Until current educational models about lecturing change, online 100%.",
      "author": "huckleberryrose",
      "created": 1615398649,
      "upvotes": 0,
      "replies": {}
    },
    "gqgyr5h": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgyr5h/",
      "text": "Not for me.. I've been struggling in online classes A LOT. Procrastinating becomes a habit, neglecting assignments is now a norm. I didn't take the classes with seriousness like before. I'm sophomore, and since 1st year in college I had a sedentary lifestyle, you can imagine how worst it has been for me since Covid hit. I'm socially retarded, and didn't care less about studying with friends or interact with them. But in-person classes students were -at least in my case- more *curious* about the lessons, and asking really interesting questions, but now all of them seem off and only let professor explain.\n+\nI've encountered professors who don't use a board, or a drawing tablet/laptop to explain math and physics. Merely reading the chapter and solve the questions phonetically with the help of the greatest learning tool to this day **mouse pointer**.",
      "author": "LoriYagami_1",
      "created": 1615398443,
      "upvotes": 34,
      "replies": {}
    },
    "gqgyjj2": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgyjj2/",
      "text": "No. A thread like this is posted every other day. We get it.",
      "author": "Thrillkilled",
      "created": 1615398374,
      "upvotes": 5,
      "replies": {}
    },
    "gqgyg3o": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgyg3o/",
      "text": "In some classes sure, but in some it's really hard without in person context.",
      "author": "smartymarty1234",
      "created": 1615398343,
      "upvotes": 5,
      "replies": {}
    },
    "gqgxx3x": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgxx3x/",
      "text": "There are things about online classes that I liked though I don’t prefer them. I liked being able to mute the people in class who I would hear talk more than the professor. I liked being able to zoom from bed. But most of my classes weren’t recorded so I had to view the live zoom sessions and I found that even for classes that were electives that I chose because they were interesting to me, I couldn’t pay attention to them at all. I never skipped class when they’re in person,  even if attendance isn’t required, but there were classes I didn’t sign into for months and just did the assignments from the syllabus. There was also something about break out rooms that I couldn’t stand. \n\nI also had a professor who I suppose was going through something and did 0 lecture all semester. The moment we joined the zoom he would immediately send us to a breakout room to discuss questions he put in the chat. I hated it so much because it would be other students saying wrong answers but saying them convincing enough for other people to agree and then the one minute he gave groups to share their answers before sending them back would be where he said the answer. I prefer lecture heavy classes over classes that focus on group work/participation so this class was the bane of my existence. Even more so after he sent out an email saying students could report us to him for not being active in breakout rooms and we’ll get kicked out",
      "author": "puterjess",
      "created": 1615398170,
      "upvotes": 6,
      "replies": {}
    },
    "gqgxo1c": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgxo1c/",
      "text": "I took my first-semester face to face and then the rest of my semesters online. I like it because all the material is online, I can go back and look at coursework at any time, I can schedule different parts of my homework and study depending on what is going on outside of school etc.\n\n And when I found out I could pick my own classes each semester? Even better! I started taking 5-6 classes a semester because I found my EDU classes easy and then I would take 1 hard class a semester like geology, English, Biology.",
      "author": "LikelyWriting",
      "created": 1615398087,
      "upvotes": 3,
      "replies": {}
    },
    "gqgx56o": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgx56o/",
      "text": "It's literally no different than in person except you can't meet people. And I feel like I have way more time because I don't have to spend 10 min walking to and from each class. Probably saves about an hour every day",
      "author": "Jay_Babs",
      "created": 1615397915,
      "upvotes": 0,
      "replies": {}
    },
    "gqgwwwu": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgwwwu/",
      "text": "No",
      "author": "reznov34",
      "created": 1615397842,
      "upvotes": 3,
      "replies": {}
    },
    "gqgwt1o": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgwt1o/",
      "text": "Honestly depends on the professor. If they are chill and just assign chapters from the textbook and a weekly assignment, then I find it much easier, more enjoyable, less stressful, and actually better when it comes to retaining the information. But if the professor assigns an absolutely ludicrous amount of busy work to “make up” for lost class time under the mistaken belief that it helps students learn, then the class is a nightmare (especially if their class isn’t well suited to be an online class).",
      "author": "JupiterRocket",
      "created": 1615397808,
      "upvotes": 0,
      "replies": {
        "gqgwxap": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgwxap/",
          "text": "Facts",
          "author": "moonlightred10",
          "created": 1615397845,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gqgwslb": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgwslb/",
      "text": "Somehow it’s easier to skip online classes than in person.  It’s easier to focus for in person classes in my opinion.",
      "author": null,
      "created": 1615397804,
      "upvotes": 3,
      "replies": {}
    },
    "gqgws6x": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgws6x/",
      "text": "I prefer them only right now because I've been taking the classes that I need that don't have anything to do with my major so I can breeze through them using quizlet. Since it's been a tough time with covid and everything I've enjoyed the break.When it comes to actually learning, online is garbage to me",
      "author": "ApexMeme",
      "created": 1615397801,
      "upvotes": 1,
      "replies": {}
    },
    "gqgwfxx": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgwfxx/",
      "text": "Damn, I was so used to hearing a lot of complaining about online classes . Had no clue many others felt this way",
      "author": "moonlightred10",
      "created": 1615397692,
      "upvotes": 1,
      "replies": {
        "gqgyon9": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgyon9/",
          "text": "Only on Reddit big man",
          "author": "Thrillkilled",
          "created": 1615398421,
          "upvotes": 4,
          "replies": {
            "gqgz8e3": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgz8e3/",
              "text": "Reddit or off Reddit ..still college kids tht feel this way",
              "author": "moonlightred10",
              "created": 1615398601,
              "upvotes": 1,
              "replies": {
                "gqh0y69": {
                  "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh0y69/",
                  "text": "Barely. Yet to meet one outside of this god forsaken website that doesn’t hate online learning.",
                  "author": "Thrillkilled",
                  "created": 1615399165,
                  "upvotes": 3,
                  "replies": {
                    "gqh1ovz": {
                      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh1ovz/",
                      "text": "If you hate this website so much just deactivate. They obviously exist as seen here. Maybe they’re just not vocal about it in person",
                      "author": "moonlightred10",
                      "created": 1615399442,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gqgwc6j": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgwc6j/",
      "text": "I mean, I just appreciate I don't need to commute. Saves my wandering brain time of being unfocused on work due to being distracted / brought out of focus by the commute. Still gotta worry about atttendance of Zoom classes, per syllabus. Wish the school saw learning by studying is far more effective for many.\n\n&#x200B;\n\nBut as you said, social interaction loss is a huge consideration. I took community college classes from home for 2 years, I relate to the motivation challenge bu t thankfuly I overcame it mostly. Just gotta  remind yourself how important the class is to your success, and how much money is being spentt for you to be there LOL",
      "author": "StardustNyako",
      "created": 1615397657,
      "upvotes": 116,
      "replies": {
        "gqhgjd9": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhgjd9/",
          "text": ">Just gotta remind yourself how important the class is to your success         \n      \nThis can't be stated enough. Keep the end goal in mind, sure it sucks sometimes, and gets stressful, but you put in a few years of hard work and dedication and you'll be at the doorstep of the life you dream of.",
          "author": "EyePlayFantasy",
          "created": 1615405435,
          "upvotes": 11,
          "replies": {}
        },
        "gqhfk95": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhfk95/",
          "text": "[removed]",
          "author": null,
          "created": 1615405022,
          "upvotes": -4,
          "replies": {}
        }
      }
    },
    "gqgvwux": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgvwux/",
      "text": "I've been doing online before the pandemic. To me online classes are easier and they let you do work at your own pace",
      "author": "thejimmycan",
      "created": 1615397517,
      "upvotes": 6,
      "replies": {
        "h4dzoy8": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/h4dzoy8/",
          "text": "I agree with how you can work on your own pace but honestly that takes out the whole college experience. Education is expensive so make most of it.",
          "author": "aphroditeuwu",
          "created": 1625686024,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqgvvj9": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgvvj9/",
      "text": "I love online classes too, it’s easier to learn for me. I like having the self pace and being able to rewatch lectures if I don’t understand something.",
      "author": "cartdriver1890",
      "created": 1615397505,
      "upvotes": 7,
      "replies": {}
    },
    "gqgvp4o": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgvp4o/",
      "text": "For me it’s easier, more convenient and less stressful. I hope universities offer more classes online in the future, I would like to take 1-2 online classes each semester. I also hope they record lectures.",
      "author": "ElBarro69",
      "created": 1615397448,
      "upvotes": 30,
      "replies": {
        "gqjh0xo": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjh0xo/",
          "text": "[deleted]",
          "author": null,
          "created": 1615442622,
          "upvotes": 4,
          "replies": {
            "gqkrs2i": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqkrs2i/",
              "text": "I hope so. It only makes sense to improve online infrastructure, considering how this pandemic shown it’s in a bad state, and this definitely isn’t the last pandemic we will face.",
              "author": "ElBarro69",
              "created": 1615473688,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gqhfpem": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhfpem/",
          "text": "[removed]",
          "author": null,
          "created": 1615405083,
          "upvotes": -3,
          "replies": {
            "gqonhvx": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqonhvx/",
              "text": "Sorry, it appears your thread or comment is in violation of /r/college Rule #2: No Spam, No Memes, No Advertising  \r\n\r\nThere are other communities within Reddit better suited for this content. Please share your content there.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
              "author": "VA_Network_Nerd",
              "created": 1615553346,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gqgviwt": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgviwt/",
      "text": "I personally love it. Having to work whilst at uni, it gives me a lot more flexibility, and I’m more comfortable in my own place.",
      "author": "saxo_life",
      "created": 1615397390,
      "upvotes": 0,
      "replies": {
        "h4e0emy": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/h4e0emy/",
          "text": "lmao i wish, my parents dont even allow me to get a job or leave the house. My mental health is seriously broken - plan on seeing a doc/therapist soon...",
          "author": "aphroditeuwu",
          "created": 1625686331,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqgvcrx": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgvcrx/",
      "text": "yes! with the past year being work from home and not out much socially, I actually prefer online classes right now. I actually initially held off on college due to it being online but when it was clear Covid would not be going away soon I decided to enroll and just try it out. I absolutely love it! I’m also an extremely optimistic person though so I understand many others are struggling, but my passion and determination towards my degree doesn’t let online bother me. \n\nI feel more comfortable in class, if I don’t have time for a shower I don’t feel weird, can grab a snack if I want, home all day with my kitties, I can just fart whenever lmao, turn off my camera to go to the bathroom, etc. \n\nI am still very much looking forward to in-person classes though, it’ll be nice to have more social interaction with my professors and students, utilize on campus resources, etc. but right now, I am enjoying online while it lasts and continuing to look at the bright side of everything.",
      "author": "xjulesx21",
      "created": 1615397333,
      "upvotes": 13,
      "replies": {
        "gqhg1zb": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhg1zb/",
          "text": "[removed]",
          "author": null,
          "created": 1615405231,
          "upvotes": -4,
          "replies": {
            "gqj2ry5": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqj2ry5/",
              "text": "Sorry, it appears your thread or comment is in violation of /r/college Rule #2: No Spam, No Memes, No Advertising  \r\n\r\nThere are other communities within Reddit better suited for this content. Please share your content there.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
              "author": "VA_Network_Nerd",
              "created": 1615433932,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gqgv9dp": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgv9dp/",
      "text": "Yes, it's been a year, I've managed to adapt and am back to great results and additional time saved by not commuting to classes, and saved money because I don't need to rent for the moment.",
      "author": "D_Leshen",
      "created": 1615397301,
      "upvotes": 0,
      "replies": {}
    },
    "gqguox8": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqguox8/",
      "text": "Teachers are so frekin soft these days that online or in person, either or there is no preference but in the end, online classes I find to be a lot less mind-boggling but yet it takes more to understand what the heck is going on. In the end, I would prefer to go back to the good ole days before the Rona :/",
      "author": "Equal-Building4177",
      "created": 1615397106,
      "upvotes": 1,
      "replies": {}
    },
    "gqgu98q": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgu98q/",
      "text": "Yeah I really like that I can just hop on classes 5 minutes after waking up and I don't have to spend a bunch of time getting ready and commuting. I have ADHD and time management is really hard for me so cutting out all that extra travel time and stuff is really nice for me. I also really like that all of the lectures are recorded so I can go back if I missed stuff or I can miss a class and still know whats going on pretty well.\n\nOn the downside asynchronous classes are the worst for me because of my terrible time management. Thankfully the only one I have this semester has short open note quizzes that go with each lecture so I'm forced to stay on track.",
      "author": "idunnobroseph",
      "created": 1615396952,
      "upvotes": 2,
      "replies": {}
    },
    "gqgu56r": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgu56r/",
      "text": "I do. I like that I can more easily attend classes, and it’s easier to do schoolwork around my full time job.",
      "author": "HouseTargaryen42",
      "created": 1615396909,
      "upvotes": 38,
      "replies": {}
    },
    "gqgu3zi": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgu3zi/",
      "text": "Yeah I agree. Online classes are super convenient, but the lack of social interactions (meeting people and talking to profs) really outweigh the convenience for me. My mental health has been severely affected due to the lack of social interactions. I used to think I could do online for the rest of my degree, but now I can't wait to go back on campus.",
      "author": "sea_otters077",
      "created": 1615396896,
      "upvotes": 1,
      "replies": {
        "gqhg9sr": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhg9sr/",
          "text": "[removed]",
          "author": null,
          "created": 1615405323,
          "upvotes": 1,
          "replies": {
            "gqj2rme": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqj2rme/",
              "text": "Sorry, it appears your thread or comment is in violation of /r/college Rule #2: No Spam, No Memes, No Advertising  \r\n\r\nThere are other communities within Reddit better suited for this content. Please share your content there.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
              "author": "VA_Network_Nerd",
              "created": 1615433927,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gqgu3vq": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgu3vq/",
      "text": "Since my major is graphic design absolutely",
      "author": "_ZiNoS_",
      "created": 1615396895,
      "upvotes": 8,
      "replies": {}
    },
    "gqgtu4p": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgtu4p/",
      "text": "Honestly I would say yes.\n\nEspecially, I'm taking Psychology as my undergrad course. I think that the subjects and the nature of my course is really manageable within the realm of online classes. \n\n+ having to review the video recording of discussions helped me whenever I dont feel like listenin (pls dont be like me hehehehe)\n\nAnd I cannot deny that it is hard.\n\nI am usually comfortable with people around me while studying such as group reviews and all. With the current condition we have, it is hard for me to cope and socialize again with my block mates through online",
      "author": "BriannDee",
      "created": 1615396786,
      "upvotes": 8,
      "replies": {
        "gqgtz0f": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgtz0f/",
          "text": "Psychology major here too. Agreed fully",
          "author": "moonlightred10",
          "created": 1615396841,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gqgtfpj": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgtfpj/",
      "text": "Easier, but so boring",
      "author": "Sargassso",
      "created": 1615396626,
      "upvotes": 10,
      "replies": {}
    },
    "gqgtdm4": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgtdm4/",
      "text": "It’s my first semester back after 10 years and I also have asynchronous classes. I like working at my own pace. I only have 3 classes this semester and two of them are accelerated so I only take 2 classes at any given time. I have adjusted to the online world pretty good. I am worried about subjects I was never good at that I will be taking in future semesters but I think I would prefer to continue online. I hope they offer majority of classes online even when it is more common to go back on campus.",
      "author": "Intelligent-View-952",
      "created": 1615396603,
      "upvotes": 6,
      "replies": {}
    },
    "gqgt5gq": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgt5gq/",
      "text": "It depends on the professor. I have a couple of online classes, and I wouldn't hesitate to take another online class with certain professors.\n\nSome professors are an absolute nightmare. I'm currently taking an online class that has no structure to it whatsoever and I'm struggling a lot with it.\n\nAt the end of the day, it just depends on the professor and how well they can manage an online class.",
      "author": "im_not_really_batman",
      "created": 1615396512,
      "upvotes": 452,
      "replies": {
        "gqhdrfe": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhdrfe/",
          "text": "For what it’s worth, I’ve had plenty of in-person classes with no structure whatsoever lol.",
          "author": "CongressionalNudity",
          "created": 1615404265,
          "upvotes": 90,
          "replies": {
            "gqhgaku": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhgaku/",
              "text": "It's so much harder to motivate myself to listen to disorganized class recordings, or to attend completely disorganized online classes than to just go to class and deal with the disorganized class. \n\nOnline, organization matters so much more, in lecture style, since you've only got a tiny screen available, and LMS organization, since all of the handouts and assignments and quizzes and tests are uploaded to the website, it can easily take a student an extra half hour to do an assignment if they have to search around the LMS for the various necessary resources. \n\nI have a lab class where, to complete the lab, you have to access three or 4 different folders on the LMS just to find the materials needed for the lab. There's a lab theory video, a lab method video, a lab manual, a data file, a powerpoint for each of the videos, and a file that explains what you need to do to complete the lab (literally just \"watch video A, download X, open file Z, etc.\" And instead of just sticking ALL the files needed in a folder called \"lab 3\", the professor sprinkles them out in different folders and sub folders all around the LMS.",
              "author": "symmetrical_kettle",
              "created": 1615405332,
              "upvotes": 40,
              "replies": {
                "gqjjsw8": {
                  "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjjsw8/",
                  "text": "I had a class just like this where it seemed the professor never bothered to learn how to use Canvas, so I just have to poke around in different module until I found what I needed. So annoying.",
                  "author": "werikaa",
                  "created": 1615444294,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gqhi00v": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhi00v/",
              "text": "Yea but those are easier in person because you can ask the professors questions that they answer right away in class. Plus if their not doing their job U can always threaten with telling superiors or just walking a few steps and telling superiors",
              "author": "mrcleeves",
              "created": 1615406062,
              "upvotes": -5,
              "replies": {}
            }
          }
        },
        "gqiifke": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqiifke/",
          "text": "That's true, before COVID, I took an online language class where the instructor didn't post a single grade until 2 weeks before finals (and most grades were not posted until right before they were due).",
          "author": "squirrel8296",
          "created": 1615423103,
          "upvotes": 7,
          "replies": {}
        },
        "gqisqys": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqisqys/",
          "text": "Yeah, I'm taking the same prof for chem and intro to astronomy and in both classes he has no structure and it has way slowed me down because half the time he won't even say what we're supposed to be reading in the books. But I don't think it would be much better in person. Maybe slightly, but he's just annoying himself.",
          "author": null,
          "created": 1615428506,
          "upvotes": 3,
          "replies": {}
        },
        "gqhj1vs": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhj1vs/",
          "text": "professors that are basically tech-savvy which usually is more on younger professors right?",
          "author": "Gamer651",
          "created": 1615406502,
          "upvotes": 3,
          "replies": {
            "gqhjefe": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhjefe/",
              "text": "Not typically. One if the professors I wouldn't hesitate to take his online class is 50-60 years old. Some of my younger professors couldn't figure out Zoom if their life depended on it.",
              "author": "im_not_really_batman",
              "created": 1615406654,
              "upvotes": 17,
              "replies": {}
            }
          }
        },
        "gqjsv2f": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqjsv2f/",
          "text": "I think it also depends on the subject. Even if I hate online classes, I’m an English major and I can easily do it at home. \n\nI’m horrible at science and hands on stuff but I had to do it online and I failed.",
          "author": "CapriciousSalmon",
          "created": 1615450175,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gqgsh8n": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgsh8n/",
      "text": "For me it goes both ways.\n\nI’m very independent and learn best with examples and by doing the homework so lectures feel pointless to me  in most cases (engineering) so if a class is built around individual work and just conceptual problem solving then I much prefer online*\n\n*the last week of classes and finals week were super stressful and it would have been nice to at least have access to campus at that time (I live 70 miles away) \n\nHowever many classes involve group work, projects, and labs, and online versions of those are trash, especially if I’ve never actually been to campus and haven’t met anyone. Classes like these should be in person. This semester I have 2 group projects, a group lab, and group discussions (Discord makes this a bit easier to stay In Contact ), and it’s much more stressful.",
      "author": "dwrend94",
      "created": 1615396241,
      "upvotes": 46,
      "replies": {
        "gqgsuxb": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgsuxb/",
          "text": "Interesting. Most of my classes don’t involve group work like that. I definitely agree that sometimes professors who are inexperienced with virtual education just try to throw everything that they’ve been doing before in an online class and it doesn’t work",
          "author": "moonlightred10",
          "created": 1615396393,
          "upvotes": 16,
          "replies": {
            "gqgu5nw": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgu5nw/",
              "text": "Yea unfortunately for engineering, group work and project are an understandable necessity.\n\nSome professors (especially ones who were struggling themselves with remote setup) did what the could to make it easier/more flexible. I had one make every lab report we had into a short memo (as opposed to short and long reports), another let us pick between a remote group project or a short research paper related to a class topic. Another gave us the option to work in groups or individually for lab reports. \n\nOn the flip side, I just had a long lab report in a group of 5, and another class (which I dropped) had a confusing term project in the works and the professor was moving quiz/exam dates (evening/weekend) only days prior, and largely didn’t adjust for remote at all.",
              "author": "dwrend94",
              "created": 1615396915,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gqgsid2": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgsid2/",
          "text": "70 miles is 112.65 km",
          "author": "converter-bot",
          "created": 1615396253,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gqgsh7q": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgsh7q/",
      "text": "No, but it's cool that you do! I'm glad that through all of this pandemic crap, some people can still enjoy themselves and get an education.",
      "author": "DaydreamerJane",
      "created": 1615396240,
      "upvotes": 23,
      "replies": {}
    },
    "gqgs4we": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgs4we/",
      "text": "Nope, this is the worst and it’s half assed education that we are being ripped off for. I don’t feel like the value of the education is the same and many graduates are going be behind in their fields cause of the crappy education that they have received during the whole pandemic",
      "author": "twalton18",
      "created": 1615396103,
      "upvotes": 19,
      "replies": {
        "gqgscqa": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgscqa/",
          "text": "If there’s one thing I do agree with is that the tuition price should definitely be reduced if you’re taking online classes without given any other choice. I see wym about the quality of education",
          "author": "moonlightred10",
          "created": 1615396191,
          "upvotes": 15,
          "replies": {}
        },
        "gqh288r": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh288r/",
          "text": "This.",
          "author": "yddadrovalf",
          "created": 1615399646,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gqgr7xk": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgr7xk/",
      "text": "Is here anyone hate school life? Yeah, me",
      "author": "Havebigbrain",
      "created": 1615395730,
      "upvotes": 1,
      "replies": {}
    },
    "gqgq3nt": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgq3nt/",
      "text": "nah, it's the worst",
      "author": null,
      "created": 1615395276,
      "upvotes": 5,
      "replies": {}
    },
    "gqgmszg": {
      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqgmszg/",
      "text": "Honestly I don't know anything different than online. I started school in Summer 2020, I have blended classes but that's only maybe once a week and we basically just reiterate stuff that we already learned at home. It'll be interesting to see how all the current freshmen adjust once classes start moving more and more back to in person. Honestly, I'll probably stick to what I'm doing now which is just being self reliant.",
      "author": null,
      "created": 1615394000,
      "upvotes": 106,
      "replies": {
        "gqh0a95": {
          "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqh0a95/",
          "text": "Same here, I keep hearing my peers complaining about online classes and how they're missing out on their college experience but honestly, I can't relate.",
          "author": "DaDudeNextToYou",
          "created": 1615398938,
          "upvotes": 38,
          "replies": {
            "gqhliir": {
              "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhliir/",
              "text": "I started college back in 2018. I still don’t get the complaining and can’t relate. I feel like people mostly are just annoyed that things are different than they’ve always known — people don’t like change. They aren’t supposed to party, they have to cook at home, they have to    *gasp*   create their own structure and routine. The number of people I hear talking about “things going back to normal” is really annoying honestly. You’d think that after a year people would just accept that this IS normal, at least for now, so you might as well appreciate the benefits of online classes and adapt your lifestyle to it. \n\nMark my words, if schools had OFFERED online/remote learning which allowed you to study from anywhere in the world, have a more flexible schedule etc. a few years ago, people would probably have loved the idea. But once you don’t have a choice, human psychology is just like “wow this sucks, X is better”.",
              "author": "Helllo_Man",
              "created": 1615407570,
              "upvotes": -8,
              "replies": {
                "gqhp2hx": {
                  "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhp2hx/",
                  "text": "Just because you can't relate to the complaints doesn't mean you should invalidate someone's struggles. I'm glad OP likes online classes and I know there are others who feel the same, but for me, this absolutely sucked. I'm a film production major and in person, hands on classes and film sets are so important to my study. I'm a senior and I couldn't produce a thesis film like I planned because the COVID restrictions weren't worth the anxiety. \n\nI've never been a partier, but COVID ruined my senior year in more ways than that. I'll never get to have a 21st birthday party with my friends, have a drink at the campus bar, go to Disneyland with my sorority. I lost my dream internship when we the pandemic hit, and I'll never get that time back. I understand how tragic the pandemic is and I'm privileged to be in the position I'm in, but it still sucks. \n\nOnline classes are inarguably a very different style of learning for people of any major. Some people, like OP, can thrive in an online learning environment. Some people can't adequately learn through a screen. Both are valid, the difference is we didn't get a choice in the matter.",
                  "author": "discodolphin1",
                  "created": 1615409078,
                  "upvotes": 26,
                  "replies": {
                    "gqhq2cy": {
                      "link": "/r/college/comments/m21cht/does_anyone_prefer_online_classes/gqhq2cy/",
                      "text": "Not trying to invalidate people’s experiences — I’m really sorry about your major, I used to be a film major myself and it would so totally have sucked to deal with COVID. As a journalist it still blows — been hard to do photojournalism these days too. I can’t deny that for certain majors the actual change is incredibly disruptive. \n\nI just know plenty of people who have struggled to adapt more than I would have expected and who keep focused on the negative aspects of the change. While there are negative aspects, I have relished the time that COVID has given me to improve myself, my apartment plant jungle, my personal routine and other things. It’s really been a bummer, I miss piling people in the car to go skiing and things, I’ve definitely been depressed, but I know I will miss this flexibility a LOT once classes return to in-person and I just don’t see a point in complaining about it anymore. It is what it is, focusing negative energy on it honestly just makes it worse and harder to adapt. That’s what I mean.",
                      "author": "Helllo_Man",
                      "created": 1615409496,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634055456
}