{
  "sid": "q5zphr",
  "link": "/r/college/comments/q5zphr/i_am_taking_21_college_credits_worth_of_classes/",
  "title:": "I am taking 21 college credits worth of classes in my last year of high school, how does this compare to a normal college load?",
  "text": "This is unbearable, I don't think I can take such a big load again. I moved to a new school and the councillor said I could get an associates degree before graduating if I took some extra classes, and that its common to do it, but now I have found out that it takes most students like three years to get it, and I am doing it in one. I am taking about 21 credits of classes per semester, with four dual credit classes and three online college classes.\n\nHow does this compare to what college is like? I am really getting overloaded by all this, they are just too long. I dont want to go to college if it will be like this. \n\nApologies for the English, it is not my most known language.",
  "author": "Slipers",
  "created": 1633969806,
  "updated": 1634082987,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.71,
  "comments": {
    "hg8uiev": {
      "link": "/r/college/comments/q5zphr/i_am_taking_21_college_credits_worth_of_classes/hg8uiev/",
      "text": "A normal college load can go anywhere from 12 credits to 21 credits, it depends on your major, your school, and how fast you want to graduate. You're basically doing what someone who wants to graduate early would do",
      "author": "cowfishAreReal",
      "created": 1633970000,
      "upvotes": 7,
      "replies": {}
    },
    "hg8zluy": {
      "link": "/r/college/comments/q5zphr/i_am_taking_21_college_credits_worth_of_classes/hg8zluy/",
      "text": "That’s a lot of credits and if it’s too much, it’s okay to drop some classes. Most associates degrees that I’m familiar with are 2 year programs and require about 60 credits to complete. \n\nA full time college student will take 12-18 credits a semester (about 4-6 classes). Some students will take up 21 classes but they usually have to get special permission to do so. \n\nA common saying is “15 to finish”, meaning you should take 15 credits each semester in order to graduate in 4 years. \n\nSo your current workload seems higher than the average college student.",
      "author": "usuallyConflicted",
      "created": 1633972090,
      "upvotes": 4,
      "replies": {}
    },
    "hg8zg2s": {
      "link": "/r/college/comments/q5zphr/i_am_taking_21_college_credits_worth_of_classes/hg8zg2s/",
      "text": "Most students at my college (I’m a community college prof) take 12-15 credits a semester. \n\nWhen I was a student myself at a liberal arts college, the cap for most students was 18 credits max, but honors students were allowed to take 20, so long as 2 of those credits were an honors seminar. One semester I got special permission to take 21 credits, with one of the classes being an audit (not for a grade) just bc I wanted to learn the topic for fun.",
      "author": "AceyAceyAcey",
      "created": 1633972025,
      "upvotes": 3,
      "replies": {}
    },
    "hgbkjpd": {
      "link": "/r/college/comments/q5zphr/i_am_taking_21_college_credits_worth_of_classes/hgbkjpd/",
      "text": "21 credit hours per semester is a lot. Everyone has their own limits, but there’s a reason the usual expectations are only 4-6 classes at once. Even if you’re failing these, I’m impressed you’ve kept up this long.",
      "author": "Smart-Abroad5861",
      "created": 1634015475,
      "upvotes": 1,
      "replies": {}
    }
  }
}