{
  "sid": "qrav1u",
  "link": "/r/college/comments/qrav1u/has_anyone_changed_their_major_in_later_years_and/",
  "title:": "Has anyone changed their major in later years and how did it affect you?",
  "text": "I am currently having a long awaited breakdown after months of regretting what major I chose and dreading the future classes I will have to take. I am a sophomore (about to be a junior after this semester) and I don’t know if it’s too late to change or if I should just tough it out until I graduate. I’ve been trying my best, but i am becoming more unhappy every day. If anyone has advice or experience with this, i would appreciate it very much.",
  "author": "tweedybirdie",
  "created": 1636598434,
  "updated": 1636654784,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hk5lm3w": {
      "link": "/r/college/comments/qrav1u/has_anyone_changed_their_major_in_later_years_and/hk5lm3w/",
      "text": "How much longer would it take you? How many new prerequisites would you need to take for the new major? If it’s not too drastic of a switch, you shouldn’t have too much of a delay in graduation as well as spending money on even more credits.",
      "author": "dalej42",
      "created": 1636599135,
      "upvotes": 2,
      "replies": {
        "hk7xmry": {
          "link": "/r/college/comments/qrav1u/has_anyone_changed_their_major_in_later_years_and/hk7xmry/",
          "text": "I am not exactly sure how much longer it would take. I have nearly all of my gen-eds done and I am two classes deep into my major requirements (which isn’t a lot compared to everything I have to do). I have been behind in school because I’ve taken semesters off to work and I also switched schools (university to community to a different university) and not all of my credits transferred. It has been complicated.",
          "author": "tweedybirdie",
          "created": 1636649056,
          "upvotes": 1,
          "replies": {
            "hk81gsw": {
              "link": "/r/college/comments/qrav1u/has_anyone_changed_their_major_in_later_years_and/hk81gsw/",
              "text": "You should be fine. I will caution that it seems like you do kinda need to pick a direction, constant changing of schools, semesters off and major changes are an easy way to end up with student debt and no degree. \n\nI assume it’s not a drastic change, you’re not going from engineering to music or something like that.",
              "author": "dalej42",
              "created": 1636650575,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk5rz0d": {
      "link": "/r/college/comments/qrav1u/has_anyone_changed_their_major_in_later_years_and/hk5rz0d/",
      "text": "Your only a sophomore, your less than halfway or halfway through your degree? I would have to guess a ton of sophomores change their majors, probably the most common year to change majors. If your serious about changing then do it.",
      "author": "DanHassler0",
      "created": 1636602120,
      "upvotes": 2,
      "replies": {}
    },
    "hk612fc": {
      "link": "/r/college/comments/qrav1u/has_anyone_changed_their_major_in_later_years_and/hk612fc/",
      "text": "Depends if it’s a similar major to the one you have. For example Computer Science vs Data Science, Business vs Econ or something idk. What I’m trying to say it that some core prerequisites could be in there already if it similar. My advice would to definitely sit down and see what prerequisites you have or don’t, what gen eds you have and don’t. And see how many credits you have left to graduate. You may have some electives to fulfill a few credits that would be like free classes anyway where you can chalk them down that you did. I’d definitely talk with an adviser after doing these things but it is possible if you feel like it’s not your cup of tea as a sophomore.",
      "author": "ThicccPanta",
      "created": 1636606861,
      "upvotes": 1,
      "replies": {
        "hk7yrs4": {
          "link": "/r/college/comments/qrav1u/has_anyone_changed_their_major_in_later_years_and/hk7yrs4/",
          "text": "I believe I will have completed all of my gen-eds after this semester so I would have a few prerequisites for a different major. I am two classes deep into my current major (I’ve been behind in school due to taking semesters off and changing schools). \n\nThank you for the advice, I will definitely plan on talking to an advisor because this is a lot to figure out when I basically have no idea what I’m doing in the first place.",
          "author": "tweedybirdie",
          "created": 1636649504,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk5k5sb": {
      "link": "/r/college/comments/qrav1u/has_anyone_changed_their_major_in_later_years_and/hk5k5sb/",
      "text": "Deez nuts",
      "author": "tobaccofromcuba",
      "created": 1636598487,
      "upvotes": -6,
      "replies": {}
    }
  }
}