{
  "sid": "q3p0om",
  "link": "/r/college/comments/q3p0om/what_should_i_do_when_im_worried_about_my/",
  "title:": "What should I do when I’m worried about my professors mental health?",
  "text": "No, I don’t want to tell my professor that I’m having mental health problems but rather it’s her that I’m worried about. She used to always be punctual and on time, all of the assignments have been neatly labeled and she always was engaging. Within the past few weeks, assignments stopped being uploaded regularly, the midterm assignment was uploaded two days before it’s deadline and she doesn’t teach anymore. She often leaves the zoom class early and let’s the other teacher teach. I’m worried about my teacher. Not because of my grades of anything, but because I’ve had depression for the most of my life and I see a lot signs. What should I do?",
  "author": "boiledbaboonegg",
  "created": 1633662283,
  "updated": 1634083538,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "hfuyv7t": {
      "link": "/r/college/comments/q3p0om/what_should_i_do_when_im_worried_about_my/hfuyv7t/",
      "text": "Ask her if she’s okay. Do NOT go to the chair/department head unless and until you’ve spoken with her first.",
      "author": "themathymaestro",
      "created": 1633704528,
      "upvotes": 2,
      "replies": {}
    },
    "hftrwet": {
      "link": "/r/college/comments/q3p0om/what_should_i_do_when_im_worried_about_my/hftrwet/",
      "text": "Maybe take this to the head of the department she is in and have him talk to her?",
      "author": "SinfullySinatra",
      "created": 1633675525,
      "upvotes": -2,
      "replies": {}
    },
    "hfuvxi4": {
      "link": "/r/college/comments/q3p0om/what_should_i_do_when_im_worried_about_my/hfuvxi4/",
      "text": "Contact the chair. Don't treat it as a complaint, but an honest concern. Don't try to diagnose or suggest what's going on, just state what you've observed and that you are concerned. Be sure to emphasize that you have no complaints with the quality of teaching and that this is less of a professional complaint and more of a personal concern.",
      "author": "hdorsettcase",
      "created": 1633703247,
      "upvotes": -1,
      "replies": {}
    }
  }
}