{
  "sid": "qdxc6k",
  "link": "/r/college/comments/qdxc6k/the_financial_services_at_my_school_misled_me_and/",
  "title:": "The financial services at my school misled me and tells me that I owe them money. Anything I can do?",
  "text": "I won’t get into specifics but I am in the United States. I’m a graduate student. \n\nThis semester, I withdrew from most of my courses due to health issues. Last month I made sure to email the appropriate departments to see how withdrawing from my classes would impact me. I emailed specifically the student account services and asked what would happen if I only took one course this semester. They said I would NOT owe anything to them. \n\nToday I get a voicemail saying if i don’t pay my balance they will drop me from the school. I emailed my academic department asking if they would be able to financially help me. Still waiting for a response from them. I received a phone call from the manager of the student account services expressing that whoever told me that I did not owe anything was wrong and I would need to pay. I forwarded her the emails about the email conversation. This was from her own damn department. Basically she said I would owe the assistantship money (12,000 some) since I am no longer full time. The thing is this was not mentioned last month when I planned to withdraw. I took the necessary steps before making a decision and somehow it backfires. \n\nHonestly I have no clue what to do. These people f***** me over. The financial aid office said unfortunately they could not help since I am maxed out on loans. \n\nIf anything, what can I do in this situation?",
  "author": "haloflower157",
  "created": 1634961523,
  "updated": 1635184655,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hhpjj2x": {
      "link": "/r/college/comments/qdxc6k/the_financial_services_at_my_school_misled_me_and/hhpjj2x/",
      "text": "Contact the source of the financial aid. It may take months of working with them, but you'll figure it out. Never trust your institution. Same thing happened with me, they told me I'd be fine and then I had to fight to get it all sorted. You should be able to cite medical reasons and get reinstated somehow. In addition, make sure to appeal your credit hours at your institution by submitting your medical records or other documentation.",
      "author": "ShesAlex",
      "created": 1634963999,
      "upvotes": 2,
      "replies": {}
    },
    "hhqz6vc": {
      "link": "/r/college/comments/qdxc6k/the_financial_services_at_my_school_misled_me_and/hhqz6vc/",
      "text": "Perhaps that office misunderstood that you were a GA. When you’re a GA you need to follow your GA contract first and foremost which dictates how many hours you work. The person probably meant you wouldn’t owe anything, assuming you weren’t a GA. That financial aid person has no access to your GA contract, that’s you, your department, and the graduate school",
      "author": "Concerned-23",
      "created": 1635002858,
      "upvotes": 1,
      "replies": {}
    }
  }
}