{"sid": "p8evzx", "link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/", "title:": "Extroverts are a different breed. Like, wow.", "text": "I'm an introvert who struggled to make friends all throughout college. I tend to be too nervous to start conversations unless it's a forced situation like with roommates, and I am guilty of judging a book by its cover. Someone who visually looks like the type of person who would not talk to me is someone I'm not talking to. My high school friends are still solid, and I just don't care anymore as a senior, but this just happened.\n\nI had the privilege of shadowing an extrovert at an event, and she had a friend group assembled in just minutes. This girl was indiscriminate about who she was talking to. She just went for it. Literally the next four people who approached our area were roped into a circle and added to a group chat, and everyone was invited to another event. This is the first time I've seen \"it's easy to make friends in college\" happen in real life. I was amazed lol. Like, what power is this???", "author": "IAlmostDieded", "created": 1629496554, "retrieved": 1632947769, "over_18": false, "upvotes": 846, "upvote_ratio": 0.98, "comments": {"h9tllp3": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9tllp3/", "text": "I am an extrovert to a fault. It is a cope to my social anxiety problems, and my talkative nature can sometimes get in the way of my professional life. Its something i have been working on and taking notes from introverts.", "author": "AreasofInterest", "created": 1629573621, "upvotes": 5}, "h9tkf4w": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9tkf4w/", "text": "I am an extrovert. I struggled socially mt first year of college. I love talking and meeting people, but I struggle to form lasting relationships. Being an extrovert isn’t everything.", "author": "ihatemathematica", "created": 1629573071, "upvotes": 3}, "h9tctmo": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9tctmo/", "text": "Hey, I am 17F and been an introvert until 14. Then I decided to at least try and change something about myself, because just hated the way I was. Now I can call myself an ambivery(can compliment random peopleat shops, etc.) However,  I would really love to become extroverted. What can you guys suggest?\nPs.: sorry for my English, it is not my native language:)", "author": "thelilpsycho", "created": 1629569572, "upvotes": 2}, "h9t89y1": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9t89y1/", "text": "Extroverts are not those shallow people as they are portrayed in mainstream. I love their energy to be around.", "author": "ppllmmm", "created": 1629567539, "upvotes": 4}, "h9t3yis": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9t3yis/", "text": "I’m extrovert but terrible at making AND friends. I think she was just someone who naturally pulls others", "author": "Cinnamode", "created": 1629565590, "upvotes": 2}, "h9syqy4": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9syqy4/", "text": "THEY’RE BUILT DIFFERENT. Like how??? I can’t talk to a person and keep eye contact for a long time. It’s either we have a silent staring contest or I talk to you while I look to the floor. They’re just so talkative and welcoming I feel like they want to scam me like those people that talk to you so easily just to get something out of you but they’re just people trying to make friends  aren’t shy to talk to strangers.", "author": "YourAverageThinker", "created": 1629563273, "upvotes": 3}, "h9sgwob": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9sgwob/", "text": "same situation here, against the narrative that college is the best/easiest time to make friends, it's been really hard for me. even if online school didn't interrupt everything for a year, i really have trouble putting myself in front of people and seeming interesting. happy to hear it's not just me in the world who feels similarly.", "author": "fowmart", "created": 1629555048, "upvotes": 1}, "h9rp3ma": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9rp3ma/", "text": "I don’t really understand either. It’s not really an anxiety thing for me as much as truly burning out socially super quickly. I can’t socialize at the level you described, but I can be friendly with strangers for a period of time or hang out with friends and talk for a while. Not a chance I could do that stuff you described though. It’s some black voodoo to me how people can both create and enjoy so much constant interaction with people they barely know.", "author": "XxNHLxX", "created": 1629535582, "upvotes": 4}, "h9rfos1": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9rfos1/", "text": "I'm an introvert and I have social anxiety 💀", "author": "Competitive_Space_43", "created": 1629527656, "upvotes": 13}, "h9r93fy": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r93fy/", "text": "Please tell me more lmaoo as an introvert I need these powers", "author": "shrimpynut", "created": 1629522875, "upvotes": 4}, "h9r5hlh": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r5hlh/", "text": "I feel like introverted people think too much of themselves sometimes, they’re always like “is this weird to say? What should I say?” Nobody is thinking about you as much as you are, and maybe  if you say something weird that relates with someone else, you can make a cool friend. Introverted people I’ve know always held back sharing niche interests and thinks in fear of judgement. but as an extrovert, I’d genuinely like to hear it. but also introversion and extroversion have nothing to do with confidence and charisma, it has to do with how much you yearn to actually connect with people. I make good conversation because I actually am interested in other people. other people I find can’t make friends because really, they don’t care and are just caring for the sake of having “friends” around. But also personally I’d rather be introverted, I care too much about feeling connected with people and most people would rather mostly be alone, and just have u by their side in case they feel like talking for once. Which feels isolating. I would say I have more friends than most but I probably feel alone more than someone who’s just content with being alone. I am only as secure as my surroundings are", "author": "FckMiDed", "created": 1629520540, "upvotes": 19}, "h9r1gl1": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9r1gl1/", "text": "i am intro , whenever i feel shy i just forcibly do it , thats the solution, ex: was afraid to ask for extra oreggano at dominos , went karen mode and aasked for 10 more , got only 3 btw", "author": "Embarrassed_Ear_1146", "created": 1629518143, "upvotes": 8}, "h9qxn3m": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qxn3m/", "text": "The college I currently attend has a ton of people like this. I feel like almost everyone has a group of friends, even the freshmen. It's certainly strange to me and makes me feel a little like the odd one out lol", "author": "Autumnleaves201", "created": 1629516016, "upvotes": 8}, "h9qvcys": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qvcys/", "text": "Chances are, this girl was probably good looking, making it easier for people to like her.", "author": "09ikj", "created": 1629514805, "upvotes": 11}, "h9qkvf4": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qkvf4/", "text": "Introversion =/= being nervous", "author": "Eddie_078", "created": 1629509662, "upvotes": 87}, "h9qkoxh": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qkoxh/", "text": "sure, same as people on facebook with 10k friends, but zero real ones.", "author": "ghostmode342", "created": 1629509576, "upvotes": 3}, "h9qjqiw": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qjqiw/", "text": "Being an extrovert isn't necessarily the same thing as having charisma, though. The person you were with clearly had charisma. Regardless it is awesome to be around someone who is like that", "author": "unholymanserpent", "created": 1629509115, "upvotes": 434}, "h9qhp9u": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9qhp9u/", "text": "I’m an introvert and it’s really not that hard to do this bro. When ever I go out which is like once or twice a week and I’m having fun I can just talk to people like it’s nothing and they can too. You gotta just relax lol they’re human too. Remember being introverted is not the same as being a shy and unsociable person, it just means you get your energy by being alone.", "author": "LuukeyBoy", "created": 1629508129, "upvotes": 61}, "h9q8rws": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9q8rws/", "text": "I believe that extroversion and introversion is a childhood habit, the path you go on depends on your household and family structure. Just with any habit, you can learn to break it, but you have to be committed and put yourself in uncomfortable situations to learn.", "author": "StillSadAboutJiraiya", "created": 1629503888, "upvotes": 73}, "h9q69w7": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9q69w7/", "text": "Personally, I would hate that.", "author": "PianoConcertoNo2", "created": 1629502712, "upvotes": 18}, "h9pza4w": {"link": "/r/college/comments/p8evzx/extroverts_are_a_different_breed_like_wow/h9pza4w/", "text": "I’d say I’m an extrovert/sociable, I’m very similar to the person you just described. To me, it’s always amazing how shy some people are. Like some of my friends are too shy to ask for something at a restaurant or greet someone who said hi to them. It’s just different brains working differently.", "author": "coolkidstone", "created": 1629499446, "upvotes": 137}}}