{
  "sid": "pwl96m",
  "link": "/r/college/comments/pwl96m/when_does_one_decide_to_drop_out/",
  "title:": "When does one decide to drop out?",
  "text": "I've been in college ever since graduating high school over 4 years ago. I got an associates with no issue from a local community college. I graduated with no debt and an honors certificate attached to my degree.\n\nI have since transferred to a 4-year institution following an involuntary gap year, because I couldn't afford the increase in price. During that gap year I was able to land a job in my field that typically only hires people with bachelor level education. This was great because now I can afford my own tuition regardless of what financial aid I received...\n\nHowever,\n\nSince picking up at my 4-year college, it's been an absolute slog. The new job has 50-60 hour workweeks with unpredictable (and mandatory) overtime - including weekends. The courses have become (expectedly) more demanding. And academic advisors are largely unhelpful. I was told for the past 3 semesters that my class load would let me graduate on time. I just had a meeting where I planned on beginning my petition to graduate and was told that I needed an entire extra year of classes before graduating. \n\nOver the course of my bachelor's education I've slowly fallen out of love for my degree/career path but have only stuck to it because of sunk-cost (\"if I've wasted this much time/energy/money, why not finish it for the piece of paper that I don't really want anymore?\"). At this point, I think I'm only pursuing this degree so that I can avoid poverty. If that's the case I could just go for an easy certificate that would drop me into an immediately higher-paying specialty. \n\nIt feels like I'm gaslighting myself that I really do want that bachelor's degree but it keeps getting harder to justify it especially when I still have an entire year of sleepless nights, stress-induced mania, and physical neglect of my needs just to get a piece of paper that isn't even special when the amount of college-educated people is so high nowadays.\n\nSo how do you know when it's time to quit?",
  "author": "_lucky_ted_",
  "created": 1632761542,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hehpzer": {
      "link": "/r/college/comments/pwl96m/when_does_one_decide_to_drop_out/hehpzer/",
      "text": "If you're doing ok, you can just stick it out. If you're ok with your job, you could even decrease your course load and take it slow. That job you have will always be on your resume, which is nice if you decide to quit and be a full time student.\n\nFor reference, I'm a 4th year who's parents pay for everything. So, take that as you will.",
      "author": "Chad_The_Bad",
      "created": 1632762495,
      "upvotes": 1,
      "replies": {
        "hei1go9": {
          "link": "/r/college/comments/pwl96m/when_does_one_decide_to_drop_out/hei1go9/",
          "text": "Would be nice to quit and be a full time student, but I need food, gas, shelter, and to pay for the classes.",
          "author": "_lucky_ted_",
          "created": 1632767659,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634057484
}