{"sid": "fwmun9", "link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/", "title:": "Are your professors giving you more work than usual because of being online?", "text": "I'm seeing a lot of people say this so I'm wondering how many other people are experiencing it as well.", "author": "abnormallyme", "created": 1586274708, "retrieved": 1632946964, "over_18": false, "upvotes": 1859, "upvote_ratio": 0.99, "comments": {"g3oestb": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/g3oestb/", "text": "I know this post is really old, but I'm absolutely drowning in busywork this semester, and I have to vent. I'm only taking 12 hours this semester, I've always been an A-student, and I can't keep up. There are discussion posts, required # of discussion post replies, reading quizzes, video quizzes, class google doc activities, and lecture notes that must be turned in but cover specific content from the lectures. That's in addition to actually watching/listening to lectures, doing readings, and writing essays. I'm learning absolutely nothing. I have no motivation (or time!) to do any of the side research I used to do when I come across something interesting in a reading. There's some tiny assignment due for multiple classes every day (x4 classes) and I have to make a chart at the beginning of every week to keep track since it doesn't all fit in my planner. I have 13 links to click on/take action on for just ONE of my classes for this ONE week. Stuff is already slipping through the cracks and it's week 3. I HATE this.", "author": "kaevlyn", "created": 1599016621, "upvotes": 1}, "fo1q8mb": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fo1q8mb/", "text": "It's not more work, but more solitary work! Remember \\[college success name\\] course? For every hour of class, 3 hours of homework, etc. etc. In an online class, there is no way to trim that down. You are putting the whole 9 hours for every 3 credits you take online, or you are not doing well.  Even the best laid-out asynchronous online course will have a ton of directions and reading. In fact, the best ones are typically have double sets of directions repeated everywhere. If they don't, you hate them because you don't know what to do. Just reading and understanding directions will take a significant portion of your time.", "author": "Matrix_spoon", "created": 1587438959, "upvotes": 1}, "fn7kvmg": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fn7kvmg/", "text": "I'm seeing all your comments here about online being double, sometimes triple the work of campus-based classes and YES, you are correct.  Welcome to the wonderful world of online learning (sarcasm).  It takes up entirely too much time.  You have NO life outside of school.  ZERO LIFE!  It affects family relationships, your mental state, and your attitude to those who complain you don't spend time with them anymore.  It's just an awful experience.  I much rather campus-based classes ANY DAY!  Most of the time you're teaching yourself so they shouldn't even be charging tuition if you ask me.", "author": "lmp32670", "created": 1586722357, "upvotes": 1}, "fn5qkyi": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fn5qkyi/", "text": "I feel like some of my prof's have been giving more work. I've taken other classes with one prof and have taken other classes in the series (with other professors) and I feel like I have 10x more work this term in that class than I usually would. It's very frustrating, on top of having so much stress and anxiety about everything else going on.", "author": "megawatt42", "created": 1586672552, "upvotes": 1}, "fmzfhpx": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmzfhpx/", "text": "Nope. Mine are giving me way LESS work. I couldn’t be more happy tbh.", "author": "TheOmegaWerewolf", "created": 1586518597, "upvotes": 1}, "fmw4grr": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmw4grr/", "text": "It feels like a lot more work than when I was sitting through lectures. It’s worth it in my personal opinion because I can go at my own pace and it’s so much better for me mentally.", "author": "Julesxprincess", "created": 1586439322, "upvotes": 1}, "fmvkx2n": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmvkx2n/", "text": "Yes. It’s ridiculous. I’ve had this same math teacher for three semesters and the online homework was more of a suggestion than mandatory. Usually studying the reviews is totally sufficient as they’re extremely reflective of the exams. So, I had only done maybe 2% of the homework. His classes are usually exclusively graded on the midterm (if there is one) and the final. This semester, we were supposed to have only the final and it was going to be collaborative. Now, all the homework is mandatory. So, 6 homework assignments each with 40 problems each... due by the end of the month. Oh, did I mention this is calc 3??? I’m totally screwed.", "author": "skiddle656", "created": 1586420730, "upvotes": 1}, "fmu8fxb": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmu8fxb/", "text": "My computer ethics professor is. I swear she wants us to earn that intensive writing credit, lol. \n\nAll the other teachers have been fine to be honest.", "author": "CSStudent500", "created": 1586386508, "upvotes": 1}, "fmtmkov": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmtmkov/", "text": "Yes. I am taking Graphic Design in college and usually all the reasearch and sketches that we do until we make the final design were shown directly to the teacher in class. Now that is impossible, so we are wasting our time making pdf documents with everything written so we could show our progress. My class has 60 sutdents so of course it's not easy for our teachers to give us all feedback, and we end up giving final assignments without any feedback.", "author": "mina_75", "created": 1586375312, "upvotes": 1}, "fmtm8wb": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmtm8wb/", "text": "Yes. Busy work. Thank you professor for realizing I am incapable of finding productive things to do with my time in quarantine.", "author": "hikyomamba", "created": 1586375152, "upvotes": 1}, "fmtf913": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmtf913/", "text": "It’s actually gotten easier for me.  Take home tests and open notes. The only thing that is a little more is that we know have a discussion board every week for one class and two quizzes a week for another class when normally it would be pop quizzes only like once a month or so.", "author": null, "created": 1586371718, "upvotes": 1}, "fmtbjwb": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmtbjwb/", "text": "It has stayed roughly the same for two of my classes, but holy crap the workload has basically doubled for my Poli Sci class.", "author": "mddailey2000", "created": 1586369982, "upvotes": 1}, "fmt9v9c": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmt9v9c/", "text": "My public speaking teacher is rushing our speeches instead of having 2 weeks we have 6 days and it's irritating\nAnd my medical history class is giving us like 10 videos for one topic", "author": "TheSkullKeeper", "created": 1586369192, "upvotes": 1}, "fmt5ynv": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmt5ynv/", "text": "One class is definitely doubling the workload and that is my US History class (yay for busy work classes the college requires you to do). We have to read a chapter or two out of our book then spend Monday-Tuesday writing an essay answering questions that are based on the chapters we just read (Each chapter is at least 20 long pages of small text). Wednesday we get another chapter or two to read and then have another essay to do that is due on Friday.  As half of our grade, we students must have two \"adequate\" responses to other classmates' essays (We post these in a class forum).  We used to do these once before every exam, but now it makes up our work to make sure we are reading the chapters (We also get no lecture notes or videos). Doing this while tackling my other classes who have a list of questions from their chapters and lecture notes that require lengthy answers is just so stressful. \n\nMy schedule now is: \"wake up, work for hours, neglect proper sleep if I want some time to myself, sleep, repeat\".", "author": "KaOsPest", "created": 1586367398, "upvotes": 1}, "fmsr6au": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmsr6au/", "text": "We still have the same amount of work as dictated in all of the original syllabi, but what’s wild is that I don’t know how I would get it done if I wasn’t required to sit at home all day working on it.... the thought of going to class, work, extra commitments, etc. AND doing all of this seems unreasonable and impossible now", "author": null, "created": 1586360686, "upvotes": 1}, "fmspakh": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmspakh/", "text": "My mechanics professor is uploading these laughably easy \\~25 minute lecture/lab assignments twice a week that take maybe an hour to complete...but somehow I'm still feeling great with the material and actually spend more time on it free studying.\n\nChemistry is about the same as usual but lab assignments are a little bit longer. I'm spending about the same amount of time with it as usual. Quizzes are extra tricky now to compensate.\n\nBiology is making me want to lose my will to live.  A massive dump of material compared to my other courses. Professor seems intent on compensating this implied \"extra free time\". I spend more time on it than my other courses combined(\\~30hr/wk) and feel its impossible to be prepared for my exam. The exams are an hour shorter than normal. At this point I don't even care and want to skate by.", "author": "nintendosexgod", "created": 1586359791, "upvotes": 1}, "fmsm10c": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmsm10c/", "text": "Yes, believe it or not the homework AND exams are both harder, while the quality of education has taken a nosedive. It is seriously ridiculous.", "author": "juicyjvoice", "created": 1586358065, "upvotes": 1}, "fmsjode": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmsjode/", "text": "Not really but it feels like more.", "author": "Dragon_Cat_", "created": 1586356799, "upvotes": 1}, "fmsgtcv": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmsgtcv/", "text": "yes and no, certain teachers have taken their original assignments and shortened them, but others have increased to \"stay on pace\"", "author": "mihelic8", "created": 1586355173, "upvotes": 1}, "fmsgik1": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmsgik1/", "text": "Professor started posting 2 hour lectures instead of the normal 75 mins. We were already behind before they moved classes online but then we extended spring break by a week. Now he thinks he can lecture for as long as he wants", "author": "Beowulf_27", "created": 1586354995, "upvotes": 1}, "fmsgerb": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmsgerb/", "text": "My work load is about the same.", "author": "gracefulspork", "created": 1586354932, "upvotes": 1}, "fms8vdi": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fms8vdi/", "text": "For sure more work. History class roughly doubled the readings and discussion garbage.  Poli Sci added a ton more as well but, we didn't do much to begin with.", "author": "CaptainNemoid1", "created": 1586349916, "upvotes": 1}, "fms3s8d": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fms3s8d/", "text": "My finance 2 professor is 67, he's been cancelling classes and limiting assignments because he \"Can't work the zoom or online.\"", "author": "Joker_Robinson", "created": 1586345639, "upvotes": 1}, "fmrrt5m": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmrrt5m/", "text": "I’m not, but one of my classes was already online anyway, and another we always just worked on computers the whole time but we were required to go to class in person anyways for no reason. Only my other two classes would have even drawn that concern, but thankfully one of my classes just opted to have one longer module each week but the same amount of homework, and my foreign language class actually might have less work if anything as some of the group projects were cancelled, or were at least converted in to solo projects. So my work load is about the same, I just have a harder time keeping up with it all. But I realize that I’m very likely the exception here, not the rule.", "author": "TellianStormwalde", "created": 1586333143, "upvotes": 1}, "fmrqhmp": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmrqhmp/", "text": "My workload has pretty much stayed the same", "author": "turkeypenguin0221", "created": 1586331769, "upvotes": 1}, "fmrov21": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmrov21/", "text": "It's really horrible professors are doing this to some people.\n\nNone of my 5 classes have changed. They function exactly as before just with recorded lectures online (no stupid Zoom crap, they're pre-recorded and can be watched whenever).\n\nI've kept up with all of my work too. I just don't like it and don't feel like I'm learning nearly as much. But if anything the professors have delayed dates very often and slightly reduced workload. Just seems like the rational thing to do, not sure wtf is wrong with other colleges.", "author": "JojiTX", "created": 1586330115, "upvotes": 3}, "fmro4js": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmro4js/", "text": "Honestly no, I finished most of my week's worth of work in probably 2 and a half hours. I'm so glad I only took 4 classes because that's all I needed left in credits to graduate lol", "author": "weeniehutsenior", "created": 1586329398, "upvotes": 1}, "fmrnuy9": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmrnuy9/", "text": "Mine’s been way less work actually 🤷🏻‍♀️", "author": "dustb300", "created": 1586329145, "upvotes": 1}, "fmrmry4": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmrmry4/", "text": "My classes now are : zoom meetings just to take attendance and the teacher just says the topic for the day and that's it ( we have to do homework without them explaining anything) \n\nAlso we have exam period after 2 weeks but instead our marks will be based on homework and attendance only ( and whether the professor likes u or not lol) \n\nSo all teachers/ professors are chilling \n\nBut here's the problem .. i study undergraduate medicine so classes are very important to me :/", "author": "uuvxuu", "created": 1586328116, "upvotes": 2}, "fmrkd3i": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmrkd3i/", "text": "My uni required professors to make their exams harder, to add essay questions where there were multiple choice. We're required to use lockdown and be watched and listened to with a webcam and mic, so it isn't like it's to compensate for open book. Ugh.", "author": "GeneralTree5", "created": 1586325882, "upvotes": 3}, "fmriqgi": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmriqgi/", "text": "Not so much “more” work but I have completely lost track of deadlines. I’ve turned in every assignment late and missed 3 lectures because I thought it was f u c k i n g Sunday yesterday. \n\nPlus I am pitifully behind. I had a lot of in class quizzes and now they’re online and I just can’t remember to write the dates they’re due all down.  So it’s always last minute finishing everything.", "author": null, "created": 1586324430, "upvotes": 2}, "fmrfe2k": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmrfe2k/", "text": "yes!! so much more busy work. i went from singing in my choir class to having to do discussion posts, listening assignments three times a week and then once a week i have to make a meme/tik tok?! like what even is that??\nthat’s not choir. they just feel like they need to make you do something to “earn” the credits", "author": "hijo10", "created": 1586321598, "upvotes": 3}, "fmrc5hy": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmrc5hy/", "text": "Yes because we had a week of class “cancelled” but in reality it just compressed the rest of the semester. Also my semester ends really early so I’m already studying for finals/ beginning final projects.", "author": "ns46", "created": 1586319068, "upvotes": 3}, "fmrbvr3": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmrbvr3/", "text": "Yes. I have one angel of a professor who has made it reasonably lighter (made one assignment optional + extended deadlines for everything else). Everyone else, same or more work, although one of the classes that made it more work also cancelled the final. \n\nI have pretty bad ADHD and executive function though, so it's been a lot harder to just get work done. \n\nMy normal job has also just got online and it makes it hard because I feel like it takes me less time to get the same amount of work done but my bills are the same (so I need the hours) but my brain still has the same productivity limit (which I often exhaust) so it's not like I can just do more work either.", "author": "milasbetterlife", "created": 1586318862, "upvotes": 3}, "fmrbjdr": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmrbjdr/", "text": "Yes online classes generally have double the content of the same class in person because you aren't wasting time with social niceties.", "author": "355822", "created": 1586318603, "upvotes": 1}, "fmr9xac": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr9xac/", "text": "Not more work per se, it's just that things like lectures have had to be turned into assignments. Which was more than I was prepared for honestly but I'm adapting. The first week after break was hell though, something like 10 assignments out of nowhere all due in one week.\n\nBut I think most professors I've heard about from other students have been basically providing a ton of leeway. Due dates have become suggestions basically in all my classes.", "author": "GBFMarineScientist", "created": 1586317413, "upvotes": 1}, "fmr8xi2": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr8xi2/", "text": "just makes me want to drink myself into a stupor, honestly. god I fucking hate school", "author": "flannyo", "created": 1586316710, "upvotes": 3}, "fmr8wb3": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr8wb3/", "text": "it sure more work than regular class,to the point where they want it finish after that class on the same day", "author": "studmuffin30", "created": 1586316688, "upvotes": 2}, "fmr6q9y": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr6q9y/", "text": "Yeah.. i mean my courses are more math based but for my non-math based courses, like federal gov. and philosophy i have a project due in less than a week from both and on top of that regular assignments i have to turn in and i have my midterm tomorrow for fed. gov. like whoaaa chill... for my physics class im more in control because i can self teach and my calculus course is also cake, self teaching", "author": "Real_Resacky", "created": 1586315175, "upvotes": 1}, "fmr6gxc": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr6gxc/", "text": "It definitely feels like it. I've been doing at least one assignment every day since this all started and I still feel like I can't catch up.", "author": "blissful_pixel", "created": 1586314996, "upvotes": 2}, "fmr668a": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr668a/", "text": "Yes it seems like it. Maybe because of extra frustration in submitting assignments.", "author": "Timmons_Leonard", "created": 1586314797, "upvotes": 2}, "fmr5okn": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr5okn/", "text": "2 out of 4 of my classes doubled their course load, it’s like professors are thinking that we have nothing better to do so they’re assigning busy work, i don’t even feel like i’m getting anything out of the extra work i’ve been doing, i’ve even had a professor tell me that they were going to give us less time on our exams since we can use other resources and that they were going to start grading our assignments harder", "author": "oldindianbat", "created": 1586314471, "upvotes": 12}, "fmr58li": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr58li/", "text": "We actually have a lot less work. I'm in all STEM classes. Thank god.", "author": null, "created": 1586314173, "upvotes": 1}, "fmr3wpu": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr3wpu/", "text": "Not at my college, but I know A TON of high schools are doing that.", "author": "SquireSyd", "created": 1586313297, "upvotes": 1}, "fmr3hc6": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr3hc6/", "text": "My English professor wants us to write a paper. I normally don’t mind it but I work in a hospital and since a lot of staff are not coming in , I pick up extra shifts so I just finished working 5 days straight 12.5 hour shifts so when I come home the last thing I want to do is write a research paper in that class .", "author": "_flacaa", "created": 1586313010, "upvotes": 1}, "fmr2fpe": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmr2fpe/", "text": "Mine are giving less.", "author": "smartymarty1234", "created": 1586312319, "upvotes": 0}, "fmqzvob": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqzvob/", "text": "No my classes are all easier. One exception is my chemistry teacher who completely f'd up his online exam. Basically he gave us 1.5 minutes per question on problems that take on average about 3+ minutes. Almost the entire class failed it, an average of 46% but he could care less. Might have to withdraw from it now.", "author": "Xayv", "created": 1586310681, "upvotes": 1}, "fmqz7ug": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqz7ug/", "text": "Dear god, YES.  I feel like some professors are thinking that just because we don't have to commute and that we're home all day, it's okay to give more work.  They're out of touch with the fact that our circumstances have drastically changed.  Some of us have no way to get distraction-free environments.  Some people's jobs are still considered essential so they're working or some have lost their jobs.  Some have utter garbage internet.  The fear and depression are real and the extra work for a grade is just rubbing salt in the wound.", "author": "LadyWolfshadow", "created": 1586310268, "upvotes": 17}, "fmqwnga": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqwnga/", "text": "Definitely. A lot of classes where I just had to show up and maybe study for a test now have weekly assignments and quizzes. Some classes have less work and I don’t hate being able to sleep in, but the busy work is annoying.", "author": "Talon_133", "created": 1586308671, "upvotes": 2}, "fmqt5je": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqt5je/", "text": "No not really. Tests are just a shit ton harder to prevent cheating", "author": null, "created": 1586306501, "upvotes": 3}, "fmqsv4e": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqsv4e/", "text": "I have ADHD. I might usually procrastinate but now it’s harder. I rely on my sorority sisters and friends and public pressure to get my work done. Now it’s just me. I’m not engaged, I’m not learning anything and I’m supposed to graduate this semester so it feels like nothing fucking matters. I’m losing my mind.", "author": "skategate", "created": 1586306322, "upvotes": 2}, "fmqs5f0": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqs5f0/", "text": "yes more work. it’s to make up for the in class attendance", "author": "septembersushi", "created": 1586305888, "upvotes": 2}, "fmqs2or": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqs2or/", "text": "No not extra work. But I'm loving staying at home.", "author": "wildcat777786", "created": 1586305842, "upvotes": 0}, "fmqrbsm": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqrbsm/", "text": "I feel like I’ve had less work idk. I don’t look at lectures bc they’re just recorded material that I can search on the exam later.", "author": "diegm9", "created": 1586305388, "upvotes": 1}, "fmqr56u": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqr56u/", "text": "No. A lot less actually. One of my classes even canceled tests and quizzes for the rest of the semester.", "author": "dyvrom", "created": 1586305277, "upvotes": 0}, "fmqqmaf": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqqmaf/", "text": "Less work for me. Lots of my assignments were cancelled and some final exams are optional. The hardest thing is finding the motivation though.", "author": "hypetastic54", "created": 1586304963, "upvotes": 1}, "fmqqgpq": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqqgpq/", "text": "For me it has varied, depends on the professor.\n\nI have had some classes that were far less of a workload before the online classes, yet I have classes that are vice versa. I am seeing a lot of people have issues with professors ramping up the workload and it is completely ridiculous. They forget that they aren't our only class we signed up for, and when that issue resides in multiple classes, the workload and stress just multiplies.\n\nJust because we are not there in person is not an excuse to overload work. Learning can still occur at the same rate with a proportional amount of work!", "author": "willkirsh21", "created": 1586304869, "upvotes": 1}, "fmqq7of": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqq7of/", "text": "Yes", "author": "lilysparkles23", "created": 1586304720, "upvotes": 1}, "fmqpod5": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqpod5/", "text": "less work", "author": "whatsupbr0", "created": 1586304400, "upvotes": 0}, "fmqpkau": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqpkau/", "text": "Maybe not more work per say, but things have gotten way messier. Syllabuses are getting updated left and right, sometimes four to five times over. Canvas pings have become so continuous that I simply ignore them. Canvas announcements have become the new syllabus in some case. Due dates from the professors don't match their due dates on canvas which don't match the due dates listed on the syllabus. \n\nIt's just a giant headache, which in turn adds to the workload and stress of it all.", "author": "17496634303659", "created": 1586304331, "upvotes": 1}, "fmqnp7u": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqnp7u/", "text": "Some of my classes are actually slightly less work now, but like everyone else lack of motivation is a very real thing. Especially as a senior :/", "author": "aron925", "created": 1586303243, "upvotes": 1}, "fmqmixo": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqmixo/", "text": "Yeah. But I'm not doing it lol", "author": "Jayytimes2", "created": 1586302557, "upvotes": 1}, "fmqlp5d": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqlp5d/", "text": "yes", "author": "NoTearsLeftToCry13", "created": 1586302083, "upvotes": 2}, "fmqlhty": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqlhty/", "text": "More work, less instruction, papa John's", "author": "p_ablo58", "created": 1586301970, "upvotes": 5}, "fmqjv51": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqjv51/", "text": "I just did a huge report that took a lot of time and work and when I submitted it realized it was only worth 10 points.", "author": "Nullveer", "created": 1586301039, "upvotes": 3}, "fmqjswv": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqjswv/", "text": "The workload is still the same, however, I think I've developed less motivation because I'm at home, not to mention the general apathy that I've been having toward school because it's my last semester lol.", "author": "capitaldinosaur", "created": 1586301002, "upvotes": 1}, "fmqipda": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqipda/", "text": "yup", "author": "Lucien_Lachanse", "created": 1586300378, "upvotes": 1}, "fmqihp3": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqihp3/", "text": "Yup. One of our classes usually take up 10-12 hours a week and it seems to have gone to 14-16 hours. (10 hrs of reading hw, 3 hours of online class. 2-3 hours of written assignments)", "author": "Phoreus", "created": 1586300259, "upvotes": 1}, "fmqidzo": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqidzo/", "text": "Mine are giving way more work. Some of the teachers are acting like they are punishing us for this. Constantly mad and assigning more and saying we aren’t doing good enough. At home dissections, lectures, labs, and everything else.", "author": "TheStuffieQueen", "created": 1586300204, "upvotes": 1}, "fmqiaw1": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqiaw1/", "text": "Technically yes, but only because I can no longer attend my practicum.", "author": "MythicalWhistle", "created": 1586300156, "upvotes": 1}, "fmqi5ny": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqi5ny/", "text": "Well my physics teacher has been sending us that data that we would have got from doing the lab. The problem is it is hard to understand the data with very little context. This turns a 2 hour lab into a 5 hour one.", "author": "xxplantjaysonxx", "created": 1586300074, "upvotes": 1}, "fmqhvyq": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqhvyq/", "text": "I got \"discussions\" and it's so annoying. I have enough work with 5 classes, I don't need more work.", "author": "Jujubini", "created": 1586299925, "upvotes": 1}, "fmqhhp7": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqhhp7/", "text": "Definitely more busy work but honestly I’d be doing similar problems to study so it’s not the worst. The only thing that bothers me is now I have professors prerecording lectures in addition to our synchronous ones.", "author": "judolphphph", "created": 1586299707, "upvotes": 1}, "fmqhftu": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqhftu/", "text": "Feels like it. My bio went from 0-100 real quick.\nComp is the same.\n\nBut finding the motivation and time to do a 6 page essay.... That's rough.", "author": "SaeInsanity45", "created": 1586299678, "upvotes": 3}, "fmqhdux": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqhdux/", "text": "Yeah, had one professor even reduce the weight of our exams and final and put more into homework and threw a bunch of assignments at us. I'm over this whole online thing. Taken a few online classes and they were all fine, but they were designed from the getgo to be done online moving these in-person classes to online has honestly sucked. Nice being at home getting to see my little puppy dog all the time though.", "author": "MrMustangRider", "created": 1586299648, "upvotes": 3}, "fmqgzg8": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqgzg8/", "text": "A lot less work. Usually we have a project to work on in class for five hours and a hw assignment, now we just have a meeting during class and work time and regents hw to finish it but one teacher hasn’t given us any instruction and I’m worried about my grade", "author": "cherrypie_momjeans", "created": 1586299427, "upvotes": 1}, "fmqftza": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqftza/", "text": "Yes. I woke up one morning with 7 assignments in one class. All due at the end of the day. I hate my English teacher.", "author": "Suicidal_Marshmallow", "created": 1586298799, "upvotes": 1}, "fmqfkg6": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqfkg6/", "text": "They are, but it's because my school's spring break was extended a week, and they have to play catch-up. It sucks, but fortunately my family has not been impacted yet so I am able to keep up with the assignments. I am very sympathetic for the many students who aren't so lucky, however. Many of my professors are being very childish and entitled about it, and this whole situation is really showing students which professors care, and which professors don't.\n\n&#x200B;\n\nAlso, don't forget to voice concerns over privacy if any of your professors demand that you share your screen or take a video of your workspace during a test. This is not acceptable, and there are likely services offered at your school that will fight for your rights.", "author": "TheJocktopus", "created": 1586298656, "upvotes": 2}, "fmqfizf": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqfizf/", "text": "My professors are 100% giving me more work. Before I was pretty fine and did a lot of my homework at home. There were definitely times it would take me a few hours in a day to get everything done but I've literally been working all day on weekdays and Sundays to get everything done. Just the amount of reading I normally would have to do has tripled it's ridiculous.", "author": "SkullCow", "created": 1586298634, "upvotes": 2}, "fmqewky": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqewky/", "text": "No, I think my professors are doing a really good job of keeping in mind how living and working off-campus, plus the whole global pandemic thing, can throw a wrench in a student's abilities to do work.", "author": "kulwop", "created": 1586298304, "upvotes": 1}, "fmqeie3": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqeie3/", "text": "Mine doubled the amount of quizzes ....", "author": "igortingz", "created": 1586298096, "upvotes": 2}, "fmqebbu": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqebbu/", "text": "I’ve honestly been receiving an overwhelming amount of work compared to the usual workload and it feels suffocating", "author": "Gilgeous", "created": 1586297993, "upvotes": 1}, "fmqdpd7": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqdpd7/", "text": "Definitely getting more work! It’s frustrating and the due dates are always super random so lm missing a lot of assignments too. This online stuff is a pain.", "author": "yogigoddess", "created": 1586297673, "upvotes": 1}, "fmqdj3z": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqdj3z/", "text": "Professors have been cutting a bunch of my work to try and satiate students, but my fiance's professors have about quadrupled her work load.", "author": "Daedalus0x00", "created": 1586297582, "upvotes": 1}, "fmqdity": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqdity/", "text": "Not more work, but making homework and test questions harder because we have notes and internet available.", "author": null, "created": 1586297578, "upvotes": 1}, "fmqd79o": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqd79o/", "text": "I’ve been hella undisciplined But scheduling my day and having a designated study area along with a short to-do list (3-5 things) daily helps me not get overwhelmed.", "author": "ACE-JHN", "created": 1586297410, "upvotes": 1}, "fmqd4ey": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqd4ey/", "text": "Yes they are completely delusional", "author": "Darude_Dank", "created": 1586297368, "upvotes": 2}, "fmqd2up": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqd2up/", "text": "For me a lot of in class non graded/participation activities are now graded quizzes", "author": "UnRenardRouge", "created": 1586297346, "upvotes": 1}, "fmqd0fw": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqd0fw/", "text": "Yes, significantly more work and I am exhausted. I was in 4 labs , which was a lot for me to handle already; somehow, the found a way to make the labs (and all the lecture work) take about 2-3 times as longer.  So instead of spending~19/20 hours a week total in class/working on assignments, I’m spending about 40 hours a week working.\n\nSeveral professors are uploading 2 hour lectures 3 times a week, regularly I’d have 1 hour lectures for each course 3 times a week.  \n\nI’m having more labs, more quizzes, more homework assignments, and more tests than I ever did before and I’m pissed about it ngl.", "author": "stickbugbitch", "created": 1586297310, "upvotes": 1}, "fmqci8k": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqci8k/", "text": " It really. I do online school anyways so this is business as usual for me.", "author": "wondering-soul", "created": 1586297042, "upvotes": 1}, "fmqchvj": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqchvj/", "text": "In my case we ended up getting one extra week off after spring break. I think this messed with all of my professors plans for which units/chapters we need to finish in a week. Due to this, we seem to have tests more often than before. The most annoying part is that I spend more time going through the chapters on my own compared to in the classroom with my professors. Typically they point out the important parts, answer any questions I may have, and offer an easier to understand explanation of the information is in our textbooks. I understand that this is not really a problem for most of you because Zoom but only one of my classes is doing an online meetup thing. And that class happens to be the only one with a bad professor who pretty much just reads the book out loud. I think overall I’m getting more work, and have to put in more effort, but it’s still pretty manageable since I am not currently employed.", "author": "TheTurtleFan", "created": 1586297036, "upvotes": 1}, "fmqbir6": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqbir6/", "text": "I used to go to the library to work on my papers.  At home there are too many distractions.  The libraries closed right away when this started.  I want my school to just give full credit for this semester.  I opted for credit/no credit anyway and I am an active student during classes.", "author": "Southferryrider", "created": 1586296514, "upvotes": 1}, "fmqb2l6": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqb2l6/", "text": "way more work. the teachers that can’t figure out zoom are making it our problem and assigning things almost every day without email notifications of new assignments. everything i’ve handed in has been at least an hour late and a lot of them close at the specific time. no updated syllabus either. honestly it’s my last year and they cancelled graduation so i just might stop", "author": "evildrtookmyteeth", "created": 1586296272, "upvotes": 8}, "fmqans5": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqans5/", "text": "less actually", "author": "crankthatshane", "created": 1586296043, "upvotes": 1}, "fmqaebf": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmqaebf/", "text": "Yes.  The zoom classes are full of glum faces and long silent pauses.  I thought I was bad but wow.", "author": "Southferryrider", "created": 1586295900, "upvotes": 2}, "fmq9jo4": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq9jo4/", "text": "Alot more in some classes", "author": "IdekBuddyDude", "created": 1586295433, "upvotes": 1}, "fmq99cx": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq99cx/", "text": "Not all my teachers have, but a few. We were out for spring break then they closed my university for one more week to move everything online, but we’re still finishing the semester on time. Some of my teachers have removed a week’s lesson so that we’re back on track, but I have a few that are expecting us to still do the week that we missed when the university was closed. So now I have all of my usual work for my classes, then extra work from the teachers who are trying to cram their missed lesson in. 😭", "author": "MariasGalactic", "created": 1586295273, "upvotes": 2}, "fmq99bc": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq99bc/", "text": "yes yes yes. \n\nbut at the same time two days out of the week i was at clinicals so there was no physical homework/test to hand in just protocols we needed to pass but still..... now i’m being sent four hours of case studies to watch every week and written assignments along with that - that may not even cover my clinical hours being missed (!!!!!)\n\non top of my other four classes IM SO DONE lol WHYYGG", "author": "mellerrzz", "created": 1586295272, "upvotes": 1}, "fmq98cf": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq98cf/", "text": "Yes, obviously.", "author": "DelverOfSqueakwets", "created": 1586295258, "upvotes": 0}, "fmq95tg": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq95tg/", "text": "I actually have less work now. One of my classes, there was a lot of hands-on stuff, now it's just theory. We just basically attend lectures, take notes... and prepare for the last exam which is coming up soon. I'm very happy and thankful that he didn't just assign a bunch of busy work.\n\nMy capstone class, I'm already pretty much done with it. I finished my video project. \n\nThe rest of my courses were already online, so not much change there... but I have one last assignment in one and then two more in my speech class... and a couple more quizzes and exams in my philosophy class.", "author": "BjornReborn", "created": 1586295219, "upvotes": 1}, "fmq7b3z": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq7b3z/", "text": "Many of my professors don't acknowledge speaking or being present in Zoom as anything but attendance, so they have added additional work on top of it to count participation. However, they don't realize that these additional assignments, like 250 word responses to the reading 2x a week, are more work than we were doing before and not equitable to raising your hand and speaking in class.", "author": "astrocat13", "created": 1586294211, "upvotes": 10}, "fmq77om": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq77om/", "text": "For me it’s the opposite, my professors have given me less work because they’ve had to change their assignments", "author": "givemeyourcheeses", "created": 1586294161, "upvotes": 1}, "fmq76d9": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq76d9/", "text": "My biology teacher added another chapter to our exam. Surprise surprise it was on viruses and COVID-19, and the only reason she added it was because of the current situation. The one chapter on viruses was larger than both of the original chapters in the unit combined. I really don’t think I passed that exam :/", "author": "russiartyyy", "created": 1586294141, "upvotes": 3}, "fmq6wix": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq6wix/", "text": "I don’t think it’s more work in my case, but you know what changed? Their fucking lecture speed. I’m in a virology class and while I understand these classes are usually fast lectured anyways, but it’s almost like the prof forced themselves to talk 2x faster than normal, even my Biochemistry class wasnt this fast back when we got in-class lecture. People asked the prof please slow down a little bit, and their excuse is that we can always go back and watch the recordings.\n\nOkay. Yes. I can always go back but I also have other materials in my other classes to catch up and learn. So no, I prefer to learn on the spot. OH, and of course I could always ignore my normal bodily functions too, fuck eating. \n\nAlright, I realized my frustration is not that big of a deal, but whatever.", "author": "BadNad", "created": 1586293992, "upvotes": 1}, "fmq6vfq": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq6vfq/", "text": "My professors have been adding more small assignments to prove we’re watching lecture videos. So many more due dates and changes it’s getting out of hand. Definitely more assignments for me. One of my classes is switching to weekly tests instead of 3 per semester.", "author": "alexarunyan", "created": 1586293976, "upvotes": 2}, "fmq6l69": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq6l69/", "text": "No actually I feel like it’s less work. All of my teachers changed their syllabuses. I seem to only have 3 or 4 assignments each week, minus large projects.", "author": "b0bcr4tch1t", "created": 1586293823, "upvotes": 1}, "fmq64bg": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq64bg/", "text": "Every time I’ve seen someone do an online class it’s immediately more homework. That being said I also surmise it’s more busywork because teachers in general probably find it harder to determine who is understanding the material better so daily, sometimes multiple daily, homework assignments are due. My girlfriend who I live with took 2 semesters of online Spanish and I’ve never seen someone get as much homework as her.", "author": "wushuwasher", "created": 1586293570, "upvotes": 1}, "fmq6302": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq6302/", "text": "Nope not really it's just sometimes I have zero motivation to do it at home :/", "author": "SassyHoe97", "created": 1586293550, "upvotes": 1}, "fmq61nf": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq61nf/", "text": "I would not say I've been given more work necessarily, it's just a lot more difficult having everything changed, different projects and assignments and schedules, which makes it a lot more difficult, which makes it seem like more.", "author": "superto3", "created": 1586293530, "upvotes": 1}, "fmq5upw": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq5upw/", "text": "Most of my professors have handled this really well. Except for one. My supply chain management professor has decided to increase workload tenfold. Article assignments and quizzes out of nowhere. Useless busy work PowerPoints on chapters that we have to record ourselves reading, why? And insisting on group projects that similar classes have adjusted into individual assignments. I wish I could drop it.", "author": "FullOfQuestions99", "created": 1586293426, "upvotes": 1}, "fmq5oqy": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq5oqy/", "text": "All my classes except for one has kept the same amount of work. The one class however actually doubled in work. It's not terrible because it's just two open book quizzes and two forum posts, but still, it was annoying.", "author": "CubicLugion", "created": 1586293338, "upvotes": 1}, "fmq4ktm": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq4ktm/", "text": "2 of my classes have changed. One said no more weekly assignments just zoom classes 1 a week and a paper as the finale. The other we do blog posts every week so she lowered the word count from 700 to 500 and made it so we don’t do one the last week of class. And she cut down the requisite our last project", "author": "True14216", "created": 1586292756, "upvotes": 1}, "fmq4cq6": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq4cq6/", "text": "I honestly got lucky with my classes. Two of them already had most of the work online (and you would learn the content in class, but it’s not hard to finish the work without the in person lecture), and one of my professors canceled all work for the rest of the semester except for the final reflection paper (we had just finished learning all the content and the rest of the semester was supposed to be a group project, which he decided would be too difficult with everything going on). The only class that somewhat feels like more work is my stats class, but that’s just because the professor disinterested use online resources at all before this, and it’s a little more confusing now to do the work online. Overall though, it’s pretty much the same, if not easier because of the one class I don’t have to worry about.", "author": null, "created": 1586292639, "upvotes": 1}, "fmq47y9": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq47y9/", "text": "it's depended on the class for me. my english professor definitely has - i now have to submit lecture notes to get an attendance grade and make multiple discussion posts to get a participation grade, when before i just had to show up to class.", "author": null, "created": 1586292569, "upvotes": 2}, "fmq477y": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq477y/", "text": "Well 3 of mine were already online and they actually cut back work, but my one in person class(no longer in person is online now too) has definitely added work. Usually we would have 3 hour lecture then a homework assignment due every other week, no it’s 2 online lectures and 2 homework assignments due every week. I’m not complaining or anything as I personally am just full time school and it gives me something to do, but I can imagine this being hard on essential workers in school. Kinda weird.", "author": "woollffprincess", "created": 1586292558, "upvotes": 2}, "fmq3vlx": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq3vlx/", "text": "Yes :(", "author": "bellatrixdemigod", "created": 1586292391, "upvotes": 1}, "fmq3ncm": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq3ncm/", "text": "I've had some mini quizzes and extra homework added onto normal classes, however, it's rather comparable time wise to being in class, so I don't mind. It can definitely feel like more than the usual, but I'm spending less time dedicated to class activities compared to how much time I use to spend in class.", "author": "The1LessTraveledBy", "created": 1586292273, "upvotes": 2}, "fmq3cs9": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq3cs9/", "text": "Yes! I am a bio major and my classes are already hard! and since they are online now, I guess the think we need more work. I am stressing out :-(", "author": "JMR3898", "created": 1586292123, "upvotes": 5}, "fmq1wgv": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq1wgv/", "text": "My professor is pissed that we are working digitally, and is taking it out on us by leaving really nasty announcements online. He threatened us with harsher grading etc because it would be “easier” for us to cheat. It’s a computer programming class so I don’t really see how lol. He also said that we should have “plenty of time” to complete his assignments so he wouldn’t be giving any extensions etc.", "author": "Ezpzjapanesey", "created": 1586291372, "upvotes": 2}, "fmq1wb2": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq1wb2/", "text": "Same amount of work, but I go to this tutoring room on campus that helps me out a ton. Now I'm copying chegg trying to make sense of things. Learning has stint quite a lot.", "author": "panda96734", "created": 1586291370, "upvotes": 2}, "fmq15rs": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq15rs/", "text": "Most of my teachers have actually cut the work a bit and extended deadlines. On the other hand, the one teacher who said explicitly that he would be BAD at teaching online has increased the workload and made the questions significantly harder and nonspecific. It’s for a liberal arts class that fulfills the statistics requirement. I honestly think it’s an ego thing so kids don’t think they can just slideeeee.", "author": "spazbagz", "created": 1586290991, "upvotes": 2}, "fmq0tsm": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq0tsm/", "text": "Well, not really personally.  It just feels that way because I've had no motivation to do anything and now everything is piling up. I have 4 tests this week, each taken one day after another, a lab, and other work that has to be done.  Everything in my environment is a distraction--And all libraries are closed.", "author": "NoodleEmpress", "created": 1586290823, "upvotes": 1}, "fmq0q97": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq0q97/", "text": "No. Less work. Flexible deadlines.", "author": "zninjamonkey", "created": 1586290775, "upvotes": 1}, "fmq0hum": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq0hum/", "text": "I have 3 research papers, one creative essay, and the only reason I finished a 50,000 word manuscript was because I got it done over a month ago. But fuck, I’m screwed on these other papers. -_-", "author": "SoriAryl", "created": 1586290655, "upvotes": 8}, "fmq0hey": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq0hey/", "text": "No. The syllabus for all of my classes has remained unchanged", "author": "ElonMuskIs_God", "created": 1586290649, "upvotes": 1}, "fmq0g39": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq0g39/", "text": "Tests are different. One professor made my exam extremely hard and gave us a day and a half to do it. I stayed up all night working on it. Another test i just finished made the anti cheating and online accommodations so challenging to work with that i spent half the exam just trying to take the exam. \n\nI have never felt shittier about my academics. Trying to take an exam with some rando with his mic on, my dog barking, and the professor not answering test related dms and changing the test questions near the end of the test is stressing me out so much i can feel it all over.\n\nNone of my professors are relaxed about the online setting and are pilling work on. I suspect because it's easy for them to forget that we are people when they can't see us. One of my professors whose class had a mandatory attendance policy hasn't had any online lectures. She instead has a plethora of assignments due at various times on most days of the week. She also uses two websites for the class so checking what's due requires checking around.", "author": "matttech88", "created": 1586290630, "upvotes": 32}, "fmq05g0": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq05g0/", "text": "For me it’s double the time. All of my classes have pre-recorded lectures to watch (that are our normal full lecture length) before we meet for live lecture at our scheduled lecture times (which are also full lecture time) to go back over it and answer our questions. So it’s double the lecture time for each class", "author": "_Conservative_Hippy_", "created": 1586290478, "upvotes": 68}, "fmq03f3": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmq03f3/", "text": "Yeah, all of them, waaay more work than usual", "author": "SheriffSpooky", "created": 1586290447, "upvotes": 7}, "fmpzz4r": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpzz4r/", "text": "My Spanish class has continued all regular work plus now 2 discussions a week with responses to classmates... seems absolutely pointless to add work during this time", "author": "catastronot", "created": 1586290385, "upvotes": 1}, "fmpztyb": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpztyb/", "text": "Yes. It’s like they want us to fail", "author": "Rissai", "created": 1586290309, "upvotes": 3}, "fmpzt52": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpzt52/", "text": "Somehow multiple of my professors have decided that since we are online and exams are by default online as well, that we can still attend class every day and get assigned the same amount of homework. So yes, we still have every class session but we are now expected to do homework AND exams outside of class time. With very few options for help and very limited interaction - if at all - with other students and professors. CS Senior by the way, which is heavily group/communication based. Very different experience than reading books and writing papers, which pose their own set of unique challenges.", "author": "SpencerJacobs13", "created": 1586290297, "upvotes": 4}, "fmpykiu": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpykiu/", "text": "I had one professor switch to response essays in place of in class participation. This created more work for me and made the class harder for me as I was leading in class participation, however it has improved the average standing in the class, so I’m not mad  about it.", "author": "redwallchronicles", "created": 1586289666, "upvotes": 1}, "fmpyjrf": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpyjrf/", "text": "My classes feel optional even though they're not", "author": "nova3482", "created": 1586289655, "upvotes": 5}, "fmpy5iq": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpy5iq/", "text": "It's only a little more work, because in classes where I formerly just attended lectures and studied independently I now have to prove I watched the lectures by doing assignments. But, as other have said, it mostly just feels like more work because I don't have any motivation left.", "author": "Cewells14", "created": 1586289453, "upvotes": 2}, "fmpxrxb": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpxrxb/", "text": "Can’t say for sure, but it certainly seems like it. \n\nI’ve found numerous classes giving 2-3 assignments per week, when the usual is 1 if that.\n\nGranted it’s just busy work like writing and responding to peer discussion posts, but still. It does feel overwhelming in the sense that I always feel as though I’m forgetting to do something.", "author": "bakedpotatowcheezpls", "created": 1586289264, "upvotes": 16}, "fmpxj91": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpxj91/", "text": "In lieu of some group projects that can't be completed, I now have additional individual assignments. \n\n&#x200B;\n\nOne of my professors outright cancelled our final project and final exam, so if anything I have less work now.", "author": "kewladria", "created": 1586289141, "upvotes": 1}, "fmpxhy7": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpxhy7/", "text": "I have less work but on the flip side only one of my 5 classes is meeting virtually, so it’s really tough to motivate and learn the content totally on my own", "author": "Milo-the-great", "created": 1586289124, "upvotes": 3}, "fmpxaid": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpxaid/", "text": "Since we \"have more free time spent at home\" we have more work and higher expectations for projects", "author": "LEGENDARY-TOAST", "created": 1586289022, "upvotes": 2}, "fmpx7cf": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpx7cf/", "text": "Yeah, they're doing that in my spanish class", "author": "RhyanHawghor", "created": 1586288978, "upvotes": 1}, "fmpx1vu": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpx1vu/", "text": "One has, but the others have given about the same amount.", "author": "little_tatws", "created": 1586288900, "upvotes": 1}, "fmpwyc2": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpwyc2/", "text": "A bunch of my friends are complaining about all the work they have too, but I would say my work load has been trimmed down slightly and honestly I don't hate the online set up. I feel more on top of my stuff because my professors are forced to have every single assignment listed online to be turned in, so there's no way to miss anything. I do prefer being in person though", "author": "Chief_Smuko", "created": 1586288848, "upvotes": 4}, "fmpwk55": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpwk55/", "text": "Mine has actually decreased, but to be fair I am a music major and it’s basically impossible to do a number of the things I would normally do in person. :(", "author": "geothermal_barometry", "created": 1586288643, "upvotes": 1}, "fmpwizw": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpwizw/", "text": "Mine didn't change significantly, but we had a one week break where classes were stopped and due dates were extended since we lost that one week teachers have basically been pushing all of the work as fast as possible so that they finish on time.", "author": null, "created": 1586288627, "upvotes": 1}, "fmpvzvu": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpvzvu/", "text": "My uni told every professor they had to assign at least one assignment. So now I have readings, powerpoints, and multiple weekly assignments for all of my classes", "author": "datesaremyfave", "created": 1586288352, "upvotes": 1}, "fmpvsbu": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpvsbu/", "text": "Yes, and it's so ass-backward. I don't even want to bring it up in fear of looking lazy, but I have to take finals in two weeks and I'm still being given major assignments.", "author": "paigediamant", "created": 1586288241, "upvotes": 2}, "fmpvs2p": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpvs2p/", "text": "Nope, all slacked ALOT. Two of which have said if your a hospital worker, medical manufacturing,  EMT/Fire your workload will be reduced even more.", "author": "GoldenMushroom1995", "created": 1586288238, "upvotes": 1}, "fmpvn4i": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpvn4i/", "text": "Engineering student here— homework has stayed the same, but my professors like to make what should be 50 minute lectures into my 1.5-2 hr lectures. It’s extremely annoying.", "author": "DoubleSly", "created": 1586288170, "upvotes": 1}, "fmpvkbd": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpvkbd/", "text": "For me its the opposite. I had a bunch of group presentations that aren't going to happen now, so my profs just make us do some simpler assignments instead.", "author": "Suotrpip", "created": 1586288130, "upvotes": 1}, "fmpv8nl": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpv8nl/", "text": "Yeah a bit more. Most of mine has changed from straight forward QandA to discussion based and PowerPoint projects and essays. \n\nThe PowerPoint presentations are pointless, I basically just have to summarize the info from a given website and make it look pretty by adding pictures and graphs. \n\nThe essay should be bullshit-able but idk yet because I'm procrastinating on it.\n\nThe discussion boards straight up piss me off because I try to do it as soon as it's assigned, but then I have to wait until 20 min before the due date to reply to people and I usually forget because it's last minute. \n\nChem labs are hell and I've been doing that last minute also. I have a feeling one day it'll catch up to me lmfao.", "author": "anon_throwaway13579", "created": 1586287958, "upvotes": 1}, "fmpv8ly": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpv8ly/", "text": "so many professors at my college have been loading work onto their students, who then complained to the college, that the college actually sent out an email to professors telling them to chill and stop overloading their students during such a difficult time.", "author": "morrisonsblues", "created": 1586287957, "upvotes": 27}, "fmpv8hy": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpv8hy/", "text": "My college has decided that the semester is going to end early. So all my online classes are sped up. My two lab classes definitely have added assignments. For instance, instead of our two dissection labs, we have to write 3 page papers on each. Also, my lab classes aren’t doing unit tests, we have to turn in large powerpoints on each chapter. All on top of studying for our comps.  While I love online classes, I am not enjoying my classes that are not meant for online.", "author": "hannahxroman", "created": 1586287955, "upvotes": 3}, "fmpv143": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpv143/", "text": "My professor gave us 15 minutes on a 156 question test.  That basically sums up my online learning experience.", "author": "digitaldiistort", "created": 1586287847, "upvotes": 24}, "fmpua52": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpua52/", "text": "Less mostly", "author": null, "created": 1586287457, "upvotes": 1}, "fmpu67u": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpu67u/", "text": "It feels like it. Shorter lessons and more work.", "author": "Se7enFan", "created": 1586287400, "upvotes": 1}, "fmpu618": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpu618/", "text": "Yes, I have had to do 8 assignments, 1 project and 1 Research Paper.", "author": null, "created": 1586287397, "upvotes": 1}, "fmpu41d": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpu41d/", "text": "It's a mixed bag. Some are, some aren't.", "author": "WashiBurr", "created": 1586287367, "upvotes": 1}, "fmpte6q": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpte6q/", "text": "I'm a ME junior. I feel that I've gotten a lot more work but as the same time I always have a lot of work due. It just feels more exhausting working at my desk all day opposed to the labs at school.", "author": "blackmatt77", "created": 1586286993, "upvotes": 6}, "fmpt0zz": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpt0zz/", "text": "Some classes have less, some have about the same amount. My math class has no final so there's two midterms, I think it's slightly less work now. One of my CS classes has the same amount of work, but another CS class i'm in has an optional project and paired partner hws now which is nice.", "author": "ch4nt", "created": 1586286801, "upvotes": 1}, "fmpt0vb": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpt0vb/", "text": "It’s about the same, but my anatomy lab actually has no final now. It’s the exam that is really stressful yet important but I’m grateful they took it out. \n\nIt’s foundational but it’s just one of those things that are too stressful and complex to try making online.", "author": null, "created": 1586286799, "upvotes": 1}, "fmpsvn5": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpsvn5/", "text": "Just in one class she’s making us listen to an audio book and attend class via zoom. My main issue is finding the motivation to do any course work at all lol", "author": "big_billford", "created": 1586286724, "upvotes": 2}, "fmpssga": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpssga/", "text": "One is giving more, on random days with random due dates buried in posts without announcements and I'm all over the place trying to work it out.", "author": "Bodidiva", "created": 1586286677, "upvotes": 2}, "fmpsnf6": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpsnf6/", "text": "two of mine are and the rest are actually being lenient \n\n(one of mine added so much stuff to blackboard that I got over 100 notifications. pray 4 me)", "author": null, "created": 1586286605, "upvotes": 1}, "fmpsn0x": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpsn0x/", "text": "Mine do. All my classes except my Calc 1 professor. Nice guy.", "author": "Cryptic_Rogue1", "created": 1586286599, "upvotes": 3}, "fmps4pm": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmps4pm/", "text": "Some more, some less. Really depends on the professor, and how well they adapt to the online curriculum.\n\nFor instance, one of my professors basically just scrapped the entire in-class portion of the class, so it's literally just half the work.\n\nAnother one of my professors has taken all the in class stuff and turned it into at-home research, that's definitely more work.\n\nMost classes though, kinda just feel the same. Although even with the same amount of work, some classes have gotten harder just because the professors aren't good at teaching online, so I'm having to spend more time trying to understand the material.", "author": "donnellca", "created": 1586286336, "upvotes": 23}, "fmprrh4": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmprrh4/", "text": "I’m telling y’all if this keeps up ya boi taking like 2 summer classes and then taking fall 2020 off. I’m not fucking with these online joints, I woulda took classes online in the first place if that’s what I wanted.", "author": "cagedbeast19", "created": 1586286145, "upvotes": 50}, "fmprg1u": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmprg1u/", "text": "Nah not really. And the work is easier as well. Which is good because sitting at home playing video games and watching Netflix has destroyed my productivity.", "author": "sapper512", "created": 1586285979, "upvotes": 12}, "fmpr3h1": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpr3h1/", "text": "My classes have been giving way more work than usual. I’m taking 21 units and I was doing okay before the switch, now I feel like I’m going to fail all of them because each class is giving 8hrs worth of assignments a day in videos, reading, discussion boards, etc. (and that’s without counting the 6 hours just spent in zoom classes 2 times a week- 12hrs total). I have 6 classes and they’re all adding more work.", "author": "draculasteeth", "created": 1586285799, "upvotes": 218}, "fmppq9g": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmppq9g/", "text": "No, less.", "author": "bluejedi24", "created": 1586285108, "upvotes": 1}, "fmpog35": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpog35/", "text": "My classes haven't really changed workload wise but I just have a hard time focusing and being motivated.", "author": "zionbeast1", "created": 1586284466, "upvotes": 38}, "fmpnr9d": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpnr9d/", "text": "Yeah, in my case. New things like “engagement” quizzes in my chem and my anthro classes as bonus assignments that we didn’t have before. Because showing up to class and doing weekly quizzes (chem) wasn’t good enough engagement ig.", "author": "robotdies", "created": 1586284107, "upvotes": 110}, "fmplr4y": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmplr4y/", "text": "One of my professors is adding more work to class. But, other than that, nothing much has changed. (except for my mental health and lack of motivation)", "author": "Tie-Dyed-Geese", "created": 1586283088, "upvotes": 93}, "fmpjtdq": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpjtdq/", "text": "Most of my classes are about equal in the amount of work they require, though there are times where I lack the motivation to complete assignments, etc. which makes it seem like more work. The exception to this is my classes that had lab or other hands-on aspects that can no longer be completed. These classes have replaced that work with discussion boards and papers, which is definitely more work than just merely showing up to a demonstration, meaning that I now have to watch documentaries outside of class time, do my own research, and learn underlying theories as opposed to surface level “doing”.\n\nI don’t yet know how all this will affect my grades but I find that many quizzes and exams have become harder, with short and long answer application style questions as opposed to multiple choice quick recall and shorter time limits to compensate for open-book/notes/internet.", "author": "PuFfEeShark", "created": 1586282112, "upvotes": 1}, "fmpi59j": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpi59j/", "text": "I don't think so. They seem to assign the same amount of work. It even feels like less work because I have more time since I don't have to commute or travel between classes. Also there are components to these classes that we simply can't do anymore since they require the use of a lab and hardware we don't have access to anymore.", "author": "peregrin5", "created": 1586281257, "upvotes": 11}, "fmpgf52": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpgf52/", "text": "I'm giving more/different work.\n\nI had to scrap an assignment that only worked in-person, and now have discussion board participation as a replacement.\n\nIf all my students did was post 2 moderately thoughtful comments each week, they'd sail by with an easy A for that grade. ...Median participation level is 0 comments per week.", "author": "bl1y", "created": 1586280380, "upvotes": 31}, "fmpewo6": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpewo6/", "text": "Not more work, it's just harder to have the motivation to do the work for me.", "author": "rainydayinmay9", "created": 1586279610, "upvotes": 1182}, "fmpeudo": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpeudo/", "text": "I have way less work I feel like I'm the only one lol", "author": null, "created": 1586279578, "upvotes": 13}, "fmpbis4": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmpbis4/", "text": "Mine hasn't really changed, but it feels like more work doing everything digitally. I can't just raise my hand in class, I have to type and proofread a comment on a discussion board. And reading 100 pages on the reg while I'm at school with access to a library is one thing, but I can't print everything out at home/don't have the books and I just don't understand stuff the same on screen.", "author": "pavonated", "created": 1586277901, "upvotes": 682}, "fmp6wyd": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmp6wyd/", "text": "I don’t think it’s more work. I think it’s the same amount of work they were already given, but they just let it pile up.", "author": "LittleHaitian", "created": 1586275562, "upvotes": 3}, "fmp6ra8": {"link": "/r/college/comments/fwmun9/are_your_professors_giving_you_more_work_than/fmp6ra8/", "text": "It's not more work, but a different kind of work in a similar vein. For example, a discussion board prompt in lieu of actual in class discussion on the topic.", "author": "mrbmi513", "created": 1586275476, "upvotes": 105}}}