{"sid": "i2ia9v", "link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/", "title:": "To help people who are wondering how much stuff they need to bring for college, here’s some guidance.", "text": "I was a transfer student, so I’ve lived in the dorms at multiple different schools. I’m generally a bit of a pack rat, so I’ve developed a minimalist approach to packing for college in order to keep clutter at bay. This minimalist approach is especially important this semester, since you might end up having to leave with short notice due to the pandemic. Here’s some advice:\n\n(Note: I am a girl, guys might pack a bit differently, but I think most of this advice is gender-neutral)\n\nClothes:\n- only bring clothes that are appropriate for the climate and season where your school is. Think to yourself, “will I realistically need this clothing item between now and the next time I come home?” If not, don’t bring it. \n\n- only bring two week’s worth of clothes. This will keep clothing clutter to a minimum and motivate you to do laundry regularly so you don’t have dirty clothes everywhere. \n\n- Most of your clothes should be casual and comfortable, but you should have one “going out” outfit (you shouldn’t be going to parties this semester, but you might want to dress up if you have a date or something) and at least one professional-looking outfit for if you have a job interview or presentation. \n\n- maximum 6 pairs of shoes. Any more than that will be difficult to find space for in your little dorm closet, and will take up a ton of space in your luggage. You will be walking around a lot more than you did in high school, so plan your shoe choices accordingly. Function over fashion. \n\nDecor:\n\n- This semester I’m actually not bringing any decor at all. I know it sounds depressing, but a lack of decor will make it much easier to pack everything up if I end up having to leave. Under normal circumstances, though, I recommend photos, posters, and string lights or garlands. \n\n- DO NOT BRING ANYTHING that takes up space on a horizontal surface. Your desk is small, and you will need it for your school supplies, papers, and as a space for eating and/or doing makeup. You will regret bringing anything non-functional that takes up space on your desk or other flat surface. If you want to decorate, use your walls!\n\n- I wouldn’t recommend bringing a tapestry. My roommate had two of them and they were constantly falling down because dorm-friendly wall adhesives (i.e. adhesives that won’t damage the wall) aren’t strong enough for tapestries. \n\n- Some dorms have really crappy lighting. In my first dorm, the light was so dim it was essentially useless. I ended up buying an LED floor lamp to solve this problem. If you don’t know what the lighting will be like, wait until after you move in and then buy a floor lamp from a local store if it ends up being necessary. \n\n- If you ever do makeup, bring a desktop mirror so you can do your makeup at your desk. Your roommates/floormates might get annoyed if you’re constantly using the bathroom sink mirror for applying makeup. \n\nOther things:\n\n- Don’t bring too many dishes. One or two of each item is good. Plus, some items can serve double-duty! For example, I didn’t have a bowl and whenever I wanted soup or something, I ate out of my coffee mug. Make sure to bring dish soap, a sponge, and a dish towel so you can wash your dishes in the sink. Your dorm probably won’t have a dishwasher. \n\n- Only bring the hair care stuff you actually use. My mom told me to bring a hairdryer, but I hate blow-drying my hair, so that hairdryer was a total waste of space. You know yourself best. Bring the stuff you know you will use, leave behind the stuff you probably won’t use. The same applies for makeup and jewelry. \n\n- Bring cleaning supplies to keep your room hygienic. If you have a bathroom in your dorm room, you and your roommate(s) will be responsible for cleaning it, so bring bathroom cleaning supplies. If you have a communal bathroom though, you will not be responsible for cleaning it. \n\n- For school supplies, bring the stuff that works best for you. If you prefer using pens instead of pencils for note-taking, bring lots of pens and only a couple pencils. If you love organizing with folders but you hate 3-ring binders, don’t bring binders. You are the boss of your organization system in college. There is no school supply list. Pick the supplies that have previously worked well for you, and leave the ones you’ve always hated behind. \n\n- Even after using these less-is-more tricks, you might still feel like you have too much stuff. At that point, you probably don’t have too much stuff. \n\nHope this helps! Feel free to add your own tips in the comments.\n\nEdit: One last thing... if you end up needing something that you didn’t bring, you can pick it up from home on your next trip back or order it online. Sometimes it’s actually better to underpack than to overpack. You might be surprised how much you don’t actually need.", "author": "kabea26", "created": 1596397339, "retrieved": 1632947267, "over_18": false, "upvotes": 1241, "upvote_ratio": 0.98, "comments": {"g08uqnz": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g08uqnz/", "text": "for hanging tapestries, I found most success in tying knots at the corner of my tapestry and then hooking those knots onto those big white command hooks. a lot of people also suggest putting command strips on clothespins, but my tapestry was too heavy for that to work very well", "author": "kingofbird", "created": 1596482293, "upvotes": 2}, "g08fkcl": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g08fkcl/", "text": "I love this thread! I was literally such a clown and thought I could bring 15 books and socks for each holiday, even non-obligatory holidays. I have learned my lesson lol. ONLY PACK WHAT YOU NEED! Especially since the future is so uncertain right now.", "author": "0hAdeline", "created": 1596476753, "upvotes": 2}, "g083ang": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g083ang/", "text": "*Laughs in virtual learning environment*", "author": "deez_nuts_77", "created": 1596472312, "upvotes": 2}, "g082zza": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g082zza/", "text": "What 6 pairs of shoes do you actually need? I only had 3.", "author": "shadowwolfsl", "created": 1596472202, "upvotes": 2}, "g080avp": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g080avp/", "text": "In terms of decor I love just putting up photos. Tho i was able to bring a tapestry last year and hang it up with comand strips and clothes pins. My roommates mom made her bring so much stuff we never needed and it was very overwhelming to me since I didnt have that much stuff as an out of state student.", "author": "acephotographer", "created": 1596471199, "upvotes": 2}, "g07y865": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g07y865/", "text": "Some dorms do still provide cleaning services for bathrooms in suites/apartments. Mine was cleaned by housing every other week. I would either call the housing office and ask or wait until you get there before buying any cleaning supplies for that.", "author": "Narwhal_Chicken", "created": 1596470439, "upvotes": 2}, "g070kcn": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g070kcn/", "text": "Great advice! I would also add - use facebook marketplace!! I didn't live in dorms (I'm in Europe and almost everyone lives off-campus) and I got 80% of everything through students selling off their furniture and decor.", "author": "killereverdeen", "created": 1596450472, "upvotes": 3}, "g06fwjt": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g06fwjt/", "text": "All ya need is a single pencil", "author": "mooncat_27", "created": 1596430714, "upvotes": 2}, "g06e0fi": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g06e0fi/", "text": "School supplies-is there any point in getting stuff like folders this year? I feel like everything is going to be digital bc of the virus.", "author": "SporkFanClub", "created": 1596429287, "upvotes": 2}, "g069p40": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g069p40/", "text": "[deleted]", "author": null, "created": 1596426259, "upvotes": 1}, "g05yuzp": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05yuzp/", "text": "Be ready to pack your shit and leave at a moment's notice, because that's what happened to a lot of people last Spring.", "author": "thatLifeVibe", "created": 1596419507, "upvotes": 4}, "g05trag": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05trag/", "text": "This is good advice!! However I am bringing wall decor because I know I'm going to be in my dorm so much more often this semester so I want it to be comfortable in that sense. How I look at it (and this is just personally) is that if I was able to pack up my stuff in less than 24 hours last semester when I had all my unnecessary freshman stuff and all of my winter things that I had yet to bring home, then I can easily pack it all up this semester when I know exactly what I need and don't need.", "author": "olivvia23", "created": 1596416448, "upvotes": 8}, "g05rwfw": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05rwfw/", "text": "As someone who just moved into a shared dorm, I agree with it being better to under pack than overpack. Unless it’s necessary items, you can always go out and pick up new items like decorations after you move in. \nOh, also don’t forget a towel or bedsheets if they don’t come with your room - happened to me and my roommates the first night!", "author": "dry_bucko", "created": 1596415333, "upvotes": 8}, "g05ou37": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05ou37/", "text": "A note on shoes and a jacket when things are back to normal. Have a pair of shoes and a jacket you don’t mind messing up or losing for when you party.", "author": "globalsponge", "created": 1596413514, "upvotes": 6}, "g05oe8u": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05oe8u/", "text": "[deleted]", "author": null, "created": 1596413257, "upvotes": -19}, "g05lmpa": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05lmpa/", "text": "To be honest, I decorated my freshman year and kept the pictures and stuff but I didn't really feel the need to in the subsequent years after that. I also was able to pack all my stuff in one suitcase and anything I really needed I bought there (it was much easier like that as an out of state student). I honestly think for anything extra you only need a mattress pad, a reusable water bottle, and some Clorox wipes to wipe down the whole room before actually moving in.", "author": "diplomatcat", "created": 1596411627, "upvotes": 6}, "g05lbu3": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05lbu3/", "text": "If you're a gamer bringing your desktop computer, I would highly suggest getting a mAtx case and motherboard. I hated lugging around my mid tower back and forth", "author": "DevilsHand676", "created": 1596411448, "upvotes": 3}, "g05ej1w": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05ej1w/", "text": "I think we’re all concerned about classes moving straight to online. I’m living at home, but I want to add in a few tips that might help. This semester, it might be useful to keep things in boxes/crates/bags to make packing up quickly easier. Also, DONT bring winter clothing right away. Wait until it gets cold and then switch it out when visiting home or through the mail. I honestly don’t think most schools will last long enough to start getting cold, but if it does, be prepared to swap out clothing and watch the weather. The one thing I’d stock up on is foods you can eat if you’re too nervous to go to the dining hall. Ramen noodles are your best friend. Keep a bunch of that, any other foods you want, and a stock of drinks with you.\n\nIf at all possible, use either a kindle or an app to get textbooks on. This will mean less stuff to carry around and you also get to skip the hassle of returning textbooks from home. \n\nMake sure to bring something along that you can kill time in your dorm with. Parties and outings will be out of the picture for a while. Since you’ll have plenty of free time, pick an activity that’s easy to keep in your room. If that’s playing an instrument, drawing, reading, or anything else simple like that, you’re set. Make sure to take care of yourself and have things to pass the time.", "author": "stevienotwonder", "created": 1596407557, "upvotes": 19}, "g05d2rv": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05d2rv/", "text": "I agree with most things in this post except the tapestries. I would bring just one that you really like and hang it with those adhesive velcro strips attached to clothes pins! They held onto my tapestry throughout both semesters of my first year. \nTapestries really add a lot of color to an otherwise dreary and boring room.", "author": "CleverCrows", "created": 1596406755, "upvotes": 2}, "g05b5o4": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05b5o4/", "text": "Thank you for this", "author": "Lewislankford", "created": 1596405721, "upvotes": 6}, "g05atou": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05atou/", "text": "I agree with everything but honestly I think being wall decor and decorations are completely fine even during this time I had to pack within a whole day when I was kicked from my apartment and I had wall decor and decorations and packed them really quickly, it wasn’t that much of a hassle", "author": "ExtremePower9", "created": 1596405547, "upvotes": 12}, "g058hl8": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g058hl8/", "text": "I'll toss in my thoughts, so here are a couple things for guys and gals to keep in mind. Especially if you have a room mate this year. \n\n* take two laundry bags, one for clothes you have worn in public, the other for clothes you have only worn around your room mate. This way you can keep things separated and you know which clothes need to get sanitized should someone contract covid. \n* to minimize research time in the library (this is for my fellow humanities majors who are doing research) geta scribd subscription and use it when you can. \n* If you normally take a gaming system and TV and you live near campus I would suggest leaving it at home until things smooth out (should be by labor day, I hope). \n* If you don't have one get a gym bag so you can keep workout stuff isolated from the rest of your room (keep all gym only items in it and wash it when you wash your public clothes or as needed) \n* if you aren't taking a daily multi-vitamin, this would be a good semester to do so (every little bit you help your body matters in case you contract it)\n* Explicitly for the people with roommates, this is not the semester to bring your hookup/ S.O. to the dorm.\n* keep one pair of shoes explicitly for the gym if financially possible (which means it stays in the gym bag except for washing day)\n* to my fellow dudes, please for the love of God, REMEMBER TO KEEP THE DEODORANT STOCKED! I know it shouldn't need to be said but after two years of college I am absolutely disgusted with my own sex sometimes. please please remember deodorant.", "author": "Lucien_Lachanse", "created": 1596404333, "upvotes": 60}, "g057jp1": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g057jp1/", "text": "fml I own fewer things than OP takes to uni", "author": "tomsmith856", "created": 1596403828, "upvotes": 6}, "g0563tb": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g0563tb/", "text": "Definitely agree on the whole minimalist approach.\n\nI brought **way** too much stuff with me. My college has its students switch dorms each year, so it was a total nightmare when moving out. Only bring things you really need.", "author": "timetravel_scientist", "created": 1596403063, "upvotes": 14}, "g05465o": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g05465o/", "text": "On the computer front I wouldn't bring a full size tower. This goes with the limited deskspace. Unless you are a huge gamer a small portable labtop/tablet will help make classroom-> study convenient due to having notes always with you. That doesn't matter much if you are a paper person. I was a paper person as well and one of those folding binders with different tabs helped so much for handouts. \n\nAlso for gamers discipline is a must. I watched friends fail out of semesters due to having full access to their console or gaming rig 24/7. Its not saying you can't find the balance, but if you have little control keep that in mind.\n\nEdit>> spelling", "author": "Shownkindness", "created": 1596402027, "upvotes": 59}, "g053j0h": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g053j0h/", "text": "I’m not sure how your roommate hung her tapestry, but I found a way to keep mine up. I put up four command hooks, then hung binder clips over each one and clipped them to the tapestry. Worked like a charm and never had issues with my stuff falling down. Might be helpful for someone!", "author": "Eyrmia", "created": 1596401684, "upvotes": 15}, "g0531b0": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g0531b0/", "text": "Bring something to entertain yourself that you can do in your room this semester, whether that be books, movies, or video games. A lot colleges are likely gonna have campus officers/public safety enforcing social distancing this semester, so they will probably be minimal socializing if any.", "author": null, "created": 1596401424, "upvotes": 52}, "g052qb1": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g052qb1/", "text": "I think it’s important to mention that you might actually want to bring decor. Even if you’re only in your dorm for a month before we all get sent back, it’s pretty likely that you’ll be in that dorm for 80%+ of your time at school due to the pandemic. \n\nLibraries and other study areas will be at limited capacity, so you’ll probably have to study at your dorm. Dining halls (at least at my school) will be to-go only so you’ll probably have to eat in your dorm too. And clubs, events, etc will be zoom only for large clubs, and in person events will be significantly worse. \n\nSince you’ll be spending so much time in your dorm, for the sake of your mental health, decorate your room and make it nice to spend all that time in!", "author": "alexsparty243", "created": 1596401260, "upvotes": 286}, "g052nkn": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g052nkn/", "text": "idk the desks in dorms at my school are kinda big", "author": "JesusRocksSocks", "created": 1596401220, "upvotes": 4}, "g052fyg": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g052fyg/", "text": "I disagree about only bringing one going-out outfit. Of course this semester in particular no one should be going out. But in general, you're going to be going out a lot more than once in a blue moon and you're not gonna want to be wearing the same exact outfit each time.", "author": "numberthangold", "created": 1596401110, "upvotes": 29}, "g052brg": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g052brg/", "text": "thank you so much for this advice, it was incredibly  helpful :) !!", "author": "jhil09", "created": 1596401047, "upvotes": 4}, "g051riq": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g051riq/", "text": "If you use command strips for your tapestry it stays up pretty well.", "author": "ste11arstar", "created": 1596400748, "upvotes": 75}, "g051h6i": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g051h6i/", "text": "this is such good advice, thank you!! also i hate blowdrying my hair too lmao", "author": "lanternriver", "created": 1596400595, "upvotes": 8}, "g050a0u": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g050a0u/", "text": "I would post this onto r/minimalism too", "author": "abft59", "created": 1596399957, "upvotes": 31}, "g04zdyw": {"link": "/r/college/comments/i2ia9v/to_help_people_who_are_wondering_how_much_stuff/g04zdyw/", "text": "Good thorough advice. I made the same mistake of bringing too much stuff to college. Each time I went back home I ended up bringing back a couple items", "author": "bunsupreme", "created": 1596399489, "upvotes": 234}}}