{
  "sid": "qy93av",
  "link": "/r/college/comments/qy93av/am_i_weird_for_not_liking_to_go_out/",
  "title:": "Am I weird for not liking to go out?",
  "text": "\nI’m a VERY social person. I keep a huge social circle, probably around 40-60 friends at school and 40-60 friends at home, all like actual friends as well. Like we text, call, hang out etc. however, I loathe going out on weekends. I get FOMO when all of my friends go but I would rather stay home, do homework and feel the FOMO than actually go. I love talking to new people, but the frat/bar scene is not up my alley at all. Is that strange because I’m such an extrovert? I feel like I’m wasting my youth and college years sitting in my dorm instead of going out, but every time I go out I just get anxious and want to leave early. I like drinking with my friends and people I know, but being surrounded by drunk strangers gives me anxiety. Is there a reason for this? Is this normal? Sorry this was so long I’m just confused by myself sometimes. Thanks a lot for any responses and advice I get. I just feel awkward always declining invites and staying home alone. (I’m Aware there are worse problems to have than “all 50 of my friends want me to go out but I don’t like to🥲”) (sorry for making you read this whole thing)",
  "author": "Nervous_Spinach69",
  "created": 1637425713,
  "updated": 1637689190,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.89,
  "comments": {
    "hlef77l": {
      "link": "/r/college/comments/qy93av/am_i_weird_for_not_liking_to_go_out/hlef77l/",
      "text": "I like to go out, but only with like 3 people at a time. Large groups make me very anxious. Maybe try a smaller group of friends in a smaller scene.",
      "author": "abortion__survivor",
      "created": 1637425912,
      "upvotes": 13,
      "replies": {
        "hleflw7": {
          "link": "/r/college/comments/qy93av/am_i_weird_for_not_liking_to_go_out/hleflw7/",
          "text": "Yep same here",
          "author": "gimmegimmecereal",
          "created": 1637426087,
          "upvotes": 3,
          "replies": {}
        },
        "hlefmgs": {
          "link": "/r/college/comments/qy93av/am_i_weird_for_not_liking_to_go_out/hlefmgs/",
          "text": "I have tried going out w smaller groups but the student body here doesn’t really have any smaller atmospheres like that, at least that I know about or get invited to lol. I’m sorry you get anxious, but I’m glad I’m not the only one, if that makes sense. 🙂thanks for the reply",
          "author": "Nervous_Spinach69",
          "created": 1637426094,
          "upvotes": 2,
          "replies": {}
        },
        "hlhcm2q": {
          "link": "/r/college/comments/qy93av/am_i_weird_for_not_liking_to_go_out/hlhcm2q/",
          "text": "can we chnage our usernames\non reddit?",
          "author": "Willing_Thought_2099",
          "created": 1637476965,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hleiyj4": {
      "link": "/r/college/comments/qy93av/am_i_weird_for_not_liking_to_go_out/hleiyj4/",
      "text": "i love people but i HATE going out, bars and clubs stress me out. i’ve found that voicing that feeling has helped me find other people who feel the same way, and we chill together and avoid the party scene",
      "author": "we-bought-a-zoo",
      "created": 1637427488,
      "upvotes": 5,
      "replies": {}
    },
    "hlg5alm": {
      "link": "/r/college/comments/qy93av/am_i_weird_for_not_liking_to_go_out/hlg5alm/",
      "text": "Username doesn't quite check out",
      "author": "NoDryHands",
      "created": 1637453253,
      "upvotes": 3,
      "replies": {}
    },
    "hliktbj": {
      "link": "/r/college/comments/qy93av/am_i_weird_for_not_liking_to_go_out/hliktbj/",
      "text": "Are you crazy? Who tf has this many friends!! I hardly have like 3 friends",
      "author": "watermelon_loml",
      "created": 1637507101,
      "upvotes": 2,
      "replies": {
        "hlk6jkz": {
          "link": "/r/college/comments/qy93av/am_i_weird_for_not_liking_to_go_out/hlk6jkz/",
          "text": "Me too. I feel like having many friends denies you the liberty of being yourself. Having many friends is great but you should have a smaller circle of friends who you are more comfortable with and who understand you.",
          "author": "FeedSpecialist611",
          "created": 1637530495,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}