{
  "sid": "qc7uds",
  "link": "/r/college/comments/qc7uds/should_i_go_to_art_school/",
  "title:": "Should I go to art school?",
  "text": "Hello. Im 16 years old and I’m having trouble figuring out my future. I’m currently failing my dual enrollment math class because math is just so incredibly hard for me. This definitely isn’t good for my record. What i want to know is: Is going to art school worth it? Can I get a job in art without going to college? Is art school hard?\n\nYou can find my art at akira\\_kojima\\_69 on Instagram (reddit won’t let me add images to this post). I’m no prodigy that’s for sure, but is my skill level good enough that i am capable of going? I dont ever use references btw which is bad but I’m willing to change that. Thank you",
  "author": "Jankypanky123",
  "created": 1634755435,
  "updated": 1634849296,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hhf2pmb": {
      "link": "/r/college/comments/qc7uds/should_i_go_to_art_school/hhf2pmb/",
      "text": "Short answer: No.\n\nLong answer:\n\nIf you want to do art for a living, as in get paid specifically to make art, no. An art degree won't help with that. Getting people to pay you for your art is going to hinge more on your portfolio than anything else. If your muse leads you more toward figure drawing and sketching as opposed to things like web design or architecture, you will have a hard time converting that into money.\n\nI agree with the other poster. These days, a BA (bachelor of arts degree) is basically the new high school diploma - get one as cheaply as you can, in a discipline you can stand to be immersed in for four years and that you can talk about in an engaging way, to meet that minimum qualification for a job with a decent salary. Most BS (bachelor of science) programs are more geared toward career training, as opposed to the BA, which tends to take a more academic or philosophical approach to the discipline in question.",
      "author": "tehzephyrsong",
      "created": 1634767957,
      "upvotes": 2,
      "replies": {}
    },
    "hhelrbj": {
      "link": "/r/college/comments/qc7uds/should_i_go_to_art_school/hhelrbj/",
      "text": "\"Is going to art school worth it?\"\n\nFinancially it is highly unlikely for an *art school*. Potentially if most/all of it is paid for. A state school would give you a better chance at breaking even. \"Art schools\" are usually for-profit and/or private: those things should be a red flag (see: tuition) since the field is very competitive and not high paying.\n\n\"Can I get a job in art without going to college?\"\n\nYes, it's mostly portfolio based. Which also means if you don't have exceptional skills, you can get a degree and it won't help you. A ton of people are great artists and the demand is low, so you will have to compete for a job.\n\n\"but is my skill level good enough that i am capable of going?\"\n\nI'm not an artist but I like making financially viable decisions. I would recommend going to a state school and getting a digital animation or graphic design degree. Potentially with a minor like advertising or marketing. You'd want to build a portfolio and focus on internships.\n\nFrom what I have heard, you probably won't be working on what you are thinking of. Not a lot of people end up doing anime and all the stuff that makes people want to get an art major. You'll have to be open to other work like ad design and freelancing.",
      "author": "darniforgotmypwd",
      "created": 1634760967,
      "upvotes": 1,
      "replies": {}
    }
  }
}