{
  "sid": "qtjyrh",
  "link": "/r/college/comments/qtjyrh/how_do_tell_my_professor_that_im_gonna_skip_an/",
  "title:": "How do tell my professor that I'm gonna skip an assignment?",
  "text": "This assignment isn't a submission. The teacher asked us to perform a skit which doesn't make much sense considering the fact that we are engineering students. I really want to skip this one and I don't care about my grades. How do tell the professor that I'm gonna skip without sounding like a douche delinquent?",
  "author": "Current_Ladder_8954",
  "created": 1636871895,
  "updated": 1637181969,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.38,
  "comments": {
    "hkk4h4v": {
      "link": "/r/college/comments/qtjyrh/how_do_tell_my_professor_that_im_gonna_skip_an/hkk4h4v/",
      "text": "You will sound like a douche delinquent. \n\nYou COULD try to find an assignment to replace with the skit. Maybe one that qualifies by showing some applicable skill or something tangential to what the skit was supposed to achieve.",
      "author": "Millerboycls09",
      "created": 1636872203,
      "upvotes": 6,
      "replies": {
        "hkk4pip": {
          "link": "/r/college/comments/qtjyrh/how_do_tell_my_professor_that_im_gonna_skip_an/hkk4pip/",
          "text": "I think that's a worse situation because not only are not doing the assignment but you are signaling to the professor that you can do their job better than them and things should bend to what your needs are and that might rub professors the wrong way especially if they have a big ego.",
          "author": "safespace999",
          "created": 1636872366,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hkkh34v": {
      "link": "/r/college/comments/qtjyrh/how_do_tell_my_professor_that_im_gonna_skip_an/hkkh34v/",
      "text": "Your teacher doesn’t care about your major. My teacher didn’t care that writing essays on world religion weren’t relevant to my Computer Science major.\n\nAssignments won’t be relevant to your major but the class which you are in. So tbh you sound like a douche delinquent already by thinking you’re above it.",
      "author": "kizeltine",
      "created": 1636881289,
      "upvotes": 5,
      "replies": {}
    },
    "hkk4jaq": {
      "link": "/r/college/comments/qtjyrh/how_do_tell_my_professor_that_im_gonna_skip_an/hkk4jaq/",
      "text": "maybe explain a little bit of why you don’t want to, but don’t use the explanation “we shouldn’t have to do this, we’re engineering students”. If nothing else, maybe say you’re uncomfortable performing in front of the class, or you could even go so far as to say you have social anxiety or something. I don’t know you personally or why you don’t really want to do this, but a reason like that may make the professor empathize with you. \n\nAlso, never make it evident that you don’t care about the grade. Say, “I understand if my aversion to this type of assignment will result in a poor grade, and I do not want this to be indicative of my work ethic as a student, but I do not wish to participate in the skit.”\n\nYou may even want to see if the professor could offer a supplementary assignment that you may complete in lieu of the skit. I know you said you don’t care about the grades, but this may make your professor more likely to let you skip it.",
      "author": "hands-off-my-waffle",
      "created": 1636872244,
      "upvotes": 3,
      "replies": {}
    },
    "hkk4uv4": {
      "link": "/r/college/comments/qtjyrh/how_do_tell_my_professor_that_im_gonna_skip_an/hkk4uv4/",
      "text": "Just don't do it. If you try and communicate your desire not to do it you will have to explain your reasoning and that will rub the wrong way in addition to your failure grade for the assignment.",
      "author": "safespace999",
      "created": 1636872469,
      "upvotes": 2,
      "replies": {}
    },
    "hklf5xb": {
      "link": "/r/college/comments/qtjyrh/how_do_tell_my_professor_that_im_gonna_skip_an/hklf5xb/",
      "text": "Don't. Just do the assignment. It won't hurt you. You'll be alright.",
      "author": "Temporary-Complex751",
      "created": 1636902515,
      "upvotes": 2,
      "replies": {}
    },
    "hklmlen": {
      "link": "/r/college/comments/qtjyrh/how_do_tell_my_professor_that_im_gonna_skip_an/hklmlen/",
      "text": "There is no way you could say this to a professor or to your classmates without sounding entitled. Either do  the skit, or don’t.",
      "author": "PhDapper",
      "created": 1636905832,
      "upvotes": 2,
      "replies": {}
    }
  }
}