{
  "sid": "qqgxdn",
  "link": "/r/college/comments/qqgxdn/i_have_a_total_of_four_ws_on_my_transcript_how/",
  "title:": "I have a total of four W’s on my transcript… how bad is this?",
  "text": "During my freshman year I was failing a math class but I dropped after the deadline resulting in a W. Then during the pandemic I dropped 2 more courses with a W. \n\nI told myself I wasn’t ever dropping a class again but this semester low and behold I’m dropping another class. Two of the classes I’ve dropped have nothing to do with my major and the other two were just not at a good time, I had a lot going on (at home during the pandemic) and I was getting behind in those classes.\n\nSo now I’m gonna have four W’s on my transcript. Is this bad? I feel like it is. It hasn’t affected my FASFA since I’m still a full time student but I feel like it just looks terrible. How can this negatively affect me? \n\nI’m (F, 21, Junior) an English Language Arts Education Major (undergrad) btw. Also the reason I dropped the classes is because I need at least a C (73% or 75% depending on the grading scale) in them to graduate as an ELA major and I was still gonna fail those classes if I continued.",
  "author": "Mightychickenwing420",
  "created": 1636502401,
  "updated": 1636655219,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hk0596y": {
      "link": "/r/college/comments/qqgxdn/i_have_a_total_of_four_ws_on_my_transcript_how/hk0596y/",
      "text": "If you're trying to get into grad school it can be pretty bad when they see that many Ws, you really can't afford anymore after this semester.",
      "author": "Sermos5",
      "created": 1636502552,
      "upvotes": 4,
      "replies": {
        "hk06asr": {
          "link": "/r/college/comments/qqgxdn/i_have_a_total_of_four_ws_on_my_transcript_how/hk06asr/",
          "text": "Definitely want to go to grad school :’) probably not a good one anymore…",
          "author": "Mightychickenwing420",
          "created": 1636503029,
          "upvotes": 2,
          "replies": {}
        },
        "hk0lr5a": {
          "link": "/r/college/comments/qqgxdn/i_have_a_total_of_four_ws_on_my_transcript_how/hk0lr5a/",
          "text": "Three of the Ws are during the pandemic though, surely grad schools would consider that? Or am I just being naive?",
          "author": "SouthernRhubarb",
          "created": 1636509959,
          "upvotes": 2,
          "replies": {}
        },
        "hk181s0": {
          "link": "/r/college/comments/qqgxdn/i_have_a_total_of_four_ws_on_my_transcript_how/hk181s0/",
          "text": "How many Ws are an issue? I have two and was told they don’t matter.",
          "author": "nashamagirl99",
          "created": 1636521067,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}