{
  "sid": "qaurgk",
  "link": "/r/college/comments/qaurgk/im_less_than_a_year_from_graduating_college_and/",
  "title:": "I'm less than a year from graduating college and just realized I have no idea what I want to do in my life",
  "text": "I figured since this is probably a fairly common problem people face, I'd post it here. If it's not allowed feel free to remove it.\n\nI'm 21, male, in my final undergraduate year at university in the US, I'm studying Economics, finance, and law, and I've been interning in finance jobs and have been applying to full-time roles in the area for next summer. Recently though I realized that working in finance is just about the last thing I want to do with my life. I don't want to sit at a desk for 12 hours a day working in investment banking, or asset management, in fact nothing sounds worse. I also realized I have had no enjoyment or intellectual stimulation in university for the last 3.5 years. I think I always liked the idea of working hard in a complex field but now that it's so close I don't want to do it at all.\n\nThis realization caused me to have a few anxiety attacks, and I am planning on seeing a therapist (never been to therapy before) to talk about it. I don't know what to do, I'm supposed to graduate next semester but I feel like I've wasted these four years of my life studying something I don't want to do. The thing is, I don't even know what I WOULD want to do; a part of me wants to pursue other passions like acting, and another part of me just has no idea what I want to do, I just know I DON'T want to work in finance. Also, please don't interpret this as just a college student being lazy and not wanting to work; I definitely to want to leave school as soon as I can and work but I just don't know in what field. My parents are expecting me to graduate but I'm fairly sure they'd allow me to stay another year at university if I want to, especially if I explain this to them.\n\nThat being said, I don't know if staying in uni longer to try to find my passion is just kicking the can down the road. If anyone has any advice on this, or if you've been in a similar situation, I am open to anything right now. I've never experienced this kind of existential dread before and I'm looking for any direction to go in. Sorry this was super long, thank you in advance.",
  "author": "polah2",
  "created": 1634587350,
  "updated": 1634654351,
  "over_18": false,
  "upvotes": 27,
  "upvote_ratio": 1.0,
  "comments": {
    "hh5tkry": {
      "link": "/r/college/comments/qaurgk/im_less_than_a_year_from_graduating_college_and/hh5tkry/",
      "text": "really relatable!! i feel like a lot more people than we think have feelings like this, especially as you move into the more serious core classes for your major. the majority of my classes this semester absolutely bore me to death and i’ve had a lot of second thoughts about my major and future in general. \n\ni would just try to push through and get your degree tho. having a degree you don’t like > not having any degree at all, especially since you’re this close to graduating already. a lot of really good jobs i’ve seen in my search so far just require that you have a college degree, but don’t require any specific degree, so maybe you could look into some jobs like that? \n\ngood luck with the rest of the semester/your college career buddy, you got this! :)",
      "author": "dakotaydg",
      "created": 1634594789,
      "upvotes": 3,
      "replies": {}
    },
    "hh5sdje": {
      "link": "/r/college/comments/qaurgk/im_less_than_a_year_from_graduating_college_and/hh5sdje/",
      "text": "how much in student loans have you taken out?",
      "author": "RollWave_",
      "created": 1634594252,
      "upvotes": 2,
      "replies": {
        "hh5tfng": {
          "link": "/r/college/comments/qaurgk/im_less_than_a_year_from_graduating_college_and/hh5tfng/",
          "text": "None. I have a full scholarship + stipend. Not sure if it’ll apply if I do another year though.",
          "author": "polah2",
          "created": 1634594725,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hh622p0": {
      "link": "/r/college/comments/qaurgk/im_less_than_a_year_from_graduating_college_and/hh622p0/",
      "text": "Finish you’re degree and while you’re at it, try to look for something you want to do.",
      "author": "NoSpaceAlien",
      "created": 1634598796,
      "upvotes": 2,
      "replies": {}
    },
    "hh6o8au": {
      "link": "/r/college/comments/qaurgk/im_less_than_a_year_from_graduating_college_and/hh6o8au/",
      "text": "Talk to someone who can give you advice !! My college has a mentorship program that helps people with this kind of problems, maybe your college does too?",
      "author": "_clownsocks",
      "created": 1634609462,
      "upvotes": 1,
      "replies": {}
    },
    "hh6pana": {
      "link": "/r/college/comments/qaurgk/im_less_than_a_year_from_graduating_college_and/hh6pana/",
      "text": "Me too. Gonna take it one step at a time",
      "author": "Nofapdeity",
      "created": 1634610000,
      "upvotes": 1,
      "replies": {}
    },
    "hh6zi0v": {
      "link": "/r/college/comments/qaurgk/im_less_than_a_year_from_graduating_college_and/hh6zi0v/",
      "text": "This is probably very common- I remember my friends in the 90s reporting this issue (I'm much older than you all lol). So obviously yeah finish what you started and then figure things out. Understand that just because you do not know what you want to be career wise specifically it doesn't mean you are a failure or that your future is ruined. It would be good for you post graduation depending on your personal circumstances to- network/socialize, do research and also set yourself up for new life experiences. A few bucket list type of things (doesn't have to be grand) to give your mind the space it needs to figure things out and also get more information about who you are and what your priorities are.",
      "author": "comfort_fiend",
      "created": 1634615265,
      "upvotes": 1,
      "replies": {}
    },
    "hh87s28": {
      "link": "/r/college/comments/qaurgk/im_less_than_a_year_from_graduating_college_and/hh87s28/",
      "text": "for what it's worth: your job doesn't have to be your passion. This is a lie sold to us by capitalism and a culture obsessed with work. \n\nYes, you want what you do to be fulfilling and at least not soul-sucking (sounds like finance is out for these reasons) but it's enough to find a job you can live with. \n\ncollege can be all-encompassing, finish up find a stable day job and look outside of work/school to find something you really enjoy.",
      "author": "gegolive",
      "created": 1634648581,
      "upvotes": 1,
      "replies": {}
    }
  }
}