{
  "sid": "qv0tur",
  "link": "/r/college/comments/qv0tur/what_is_community_college_like/",
  "title:": "What is community college like?",
  "text": "I’m 17 years old and considering going to community college in the fall of 2022 after I get my ged. I got kicked out of high school last year due to bad attendance and I’ve basically lost all my friends. I’m hoping to make new friends and build a new social life at community college. Is any of the party crowd in community college? I only went to one party in high school and I never got to live up the partying experience, ive also only had one relationship. I find it impossible to make new friends without high school and I’m hoping to search for an environment like high school and I always hear people say it’s high school 2.0. What is community college like?",
  "author": "throwaway698876",
  "created": 1637041818,
  "updated": 1637181432,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkusl7y": {
      "link": "/r/college/comments/qv0tur/what_is_community_college_like/hkusl7y/",
      "text": "You know for someone getting a GED, I’d think you would be more concerned about your future instead of partying at community college.",
      "author": "Spicybooiii",
      "created": 1637072158,
      "upvotes": 9,
      "replies": {}
    },
    "hktwd7r": {
      "link": "/r/college/comments/qv0tur/what_is_community_college_like/hktwd7r/",
      "text": "Community college really doesn’t have a social life due to transferring and commuting. Clubs and programs make up for it though, but it matters which community college classes you go to",
      "author": "fabe2020",
      "created": 1637049923,
      "upvotes": 6,
      "replies": {}
    },
    "hkv5c6n": {
      "link": "/r/college/comments/qv0tur/what_is_community_college_like/hkv5c6n/",
      "text": "Definitely don’t go to any type of college for the partying experience, seem like you would fail and drop out and lose all your money in this type of mindset",
      "author": "hellohello_2010",
      "created": 1637077697,
      "upvotes": 5,
      "replies": {}
    },
    "hkto9pr": {
      "link": "/r/college/comments/qv0tur/what_is_community_college_like/hkto9pr/",
      "text": "Community colleges differ __tremendously__ from state to state, (and even within the state).\n\nThere are members of the party crowd everywhere, but my guess is that the percentage is less than at universities. \n\nI’m curious: Why did you lose all your friends?",
      "author": "cajunsoul",
      "created": 1637043941,
      "upvotes": 2,
      "replies": {}
    }
  }
}