{"sid": "fe6tps", "link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/", "title:": "Is it strange to spend time on campus if you recently graduated?", "text": "In my case I graduated last year so I'm still college age but I don't have any other good place to meet people my age and the campus has lots of activities and events. There are opportunities and clubs available to alumni so I can technically join those too.\n\nWould people think it's weird or creepy?  I've gotten pretty mixed responses.", "author": "psldnth8", "created": 1583462447, "retrieved": 1632947943, "over_18": false, "upvotes": 641, "upvote_ratio": 0.98, "comments": {"fk0ul1j": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fk0ul1j/", "text": "I graduated almost 2 years ago from a small college. My college years were bad so I am still hurt by a lot of stuff that happened to me. I myself have been back to visit my old supervisors twice. I also have been back \"on campus\" for homecoming. But I visit the college town almost every month (for another side job).\n\nI do miss college and am slowly looking into getting my MS. It does not help that my current I am surrounded by 55+ year olds for most of the day. I am also planning on visiting with old friends who live elsewhere. \n\nI am slowly contacting former professors (slowly opening the door) to mentor the students. I told them about primary source research for capstone papers on a subject that I know people struggle on. I also told them about a academic research magazine that is looking for articles to get the students to start out. I am friends with the editor and its local based. But this is a slow thing.\n\nMy ex-friends (so to speak) still visit often as they were close to the now seniors-juniors. They were also frat/sororities so they go back to visit them or to mentor the students.\n\nMy college has a large alumni groups that I keep missing the events outside of homecoming.\n\nWhen I was in college, it depended on the case. Did the kids work for the school as employees (often case) or were they coming from a specific meeting or thing.", "author": "enoughstreet", "created": 1583766492, "upvotes": 1}, "fjscaj2": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjscaj2/", "text": "It's weird but honestly if you love the college so much just get a job there.", "author": "PupusaMasterSeb", "created": 1583595655, "upvotes": 1}, "fjo9gs6": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjo9gs6/", "text": "I think it's weird. If you're not at least like a tutor or ta or something that gives you another reason to be in the school, it's weird to join a student club.", "author": "Alaharon123", "created": 1583523256, "upvotes": 2}, "fjo1kwj": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjo1kwj/", "text": "I worked at the bookstore for 1.5 years after graduating cause my friends and Bf were still in classes. Not weird at all.", "author": "heytherec17", "created": 1583518663, "upvotes": 1}, "fjnxppp": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjnxppp/", "text": "Maybe take a few courses at a community college. Or a few courses at that school for fun. That way, it’s not as “creepy” as other people are saying. But I think it’s ok I mean if u like going there why not? Personally, I wanna gtfo my college already. (I hate it)", "author": "vuxxx_", "created": 1583516424, "upvotes": 1}, "fjnxpe4": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjnxpe4/", "text": "Yes, it is an important transition and not an easy one but your college years are over. You can atrend eventos for graduales, but don't be the creepy guy trying to befriend an 18 year old when you are way older.", "author": "dontAskNarnia", "created": 1583516419, "upvotes": 1}, "fjnvr2e": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjnvr2e/", "text": "It's not weird if you're a recent grad, I've seen it before. Usually after a year people stop doing it though. But if it's a friend group you've made, it's not weird", "author": "saved-by_grace", "created": 1583515311, "upvotes": 2}, "fjnvl78": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjnvl78/", "text": "Guess it kind of depends. I don't think it's too strange for recent (1-2 years) alumni to hang around campus. Just as long as you have a reason to be there and aren't being creepy or infringing on things intended for students. There's a point when you have to just move on, make new friends elsewhere and such. Join an alumni association, go to public events, or events with an organization you were in. It's less creepy if you're hanging out in a student center with friends once in a blue moon, and moreso if you're there every day.\n\nA friend I graduated with last year got a job on campus and started a certificate program, so it makes sense for her to hang around campus despite having graduated. Same with grad students. The only times I hung out on campus outside public and alumni events have all been just dropping into town for a few hours because I was already nearby. Like if I had a meeting in town, I'd just drop by some old haunts because I know my friends who are still students would be there. It would be creepy though if I were there more often since I don't really have a reason to be there.", "author": "driftingjoanna", "created": 1583515225, "upvotes": 1}, "fjntob5": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjntob5/", "text": "It’s weird cuz u gotta move on with ur life. Not cuz you have friends in college or are friends with 18-23 year olds. \n\nTry making friends outside school, it’s hard yeah but it’s a necessary skill. \n\nThat being said it’s completely normal to visit and use your schools facilities whenever you need. That’s what being an alumni is about. But u don’t need it as a crutch to make friends.\n\nAnd let’s be honest dude. Your stage in life is much better than being a college kid. Keep on moving", "author": null, "created": 1583514229, "upvotes": 3}, "fjnp3js": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjnp3js/", "text": "If they are alumni or general events, I think that's fine.  My school has alumni only job fairs, alumni accepted job fairs, an alumni, \"house\" where they meet and plan events for the school, and then in the school of Business; there's the Regions bank financial institution which hosts lectures monthly open to all students.  If you were to try and get on a sports team or any other club, it would be weird.", "author": "xmarketladyx", "created": 1583511833, "upvotes": 2}, "fjnkkb7": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjnkkb7/", "text": "Not at all.  People of all ages hang out on campus.  It’s refreshing.", "author": "Dsajames", "created": 1583509360, "upvotes": 1}, "fjngv5l": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjngv5l/", "text": "Just sign up for a class", "author": null, "created": 1583507103, "upvotes": 1}, "fjna67l": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjna67l/", "text": "I work full time at the school I graduated from. I feel a little old sometimes, but I don't think it's too weird.", "author": "EasilyEnabled", "created": 1583502458, "upvotes": 1}, "fjn984s": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjn984s/", "text": "Don’t worry about whether or not it’s strange. Is it beneficial to you? Are you hurting anyone? Are you making people overly uncomfortable? \n\nIf you’re concerned, those should take priority. If there’s no harm, there’s no harm.", "author": "This_is_your_mind", "created": 1583501724, "upvotes": 1}, "fjn5fcf": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjn5fcf/", "text": "Reminds me of Andy from the office reliving the good days.", "author": "WaveSayHi", "created": 1583498485, "upvotes": 5}, "fjn51vs": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjn51vs/", "text": "it’s a school, not a social club. you don’t have any business being there since you’re not a student anymore. that part of your life is over, time to move on my guy", "author": null, "created": 1583498137, "upvotes": 21}, "fjn4va1": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjn4va1/", "text": "Honestly it depends on the size of the school. We're a small school, and recent graduates hanging out for a weekend is normal. Coming for homecoming the same year you graduated? Considered creepy. People think Why can't you let go? \n\nIf you go to a big enough school it's probably fine, but I would try and connect with the local alumni chapter and do stuff with them, and try and go to public events on campus instead of say club meetings.", "author": "skelechel", "created": 1583497963, "upvotes": 5}, "fjn4kx3": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjn4kx3/", "text": "it is time to move on, find a job and meet people in other places.", "author": "turtlewatcher83", "created": 1583497683, "upvotes": 31}, "fjn2spu": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjn2spu/", "text": "I don’t think it’s strange at all. I don’t think anyone would notice anyway, just try to distance yourself from student oriented clubs I guess. But it’s definitely still a great place to meet people. I know people who don’t go to college/from a different college hang out here. \n\nSo weird tho. I’m in my last year and was just walking around campus today, thinking about how I’ll miss the overall atmosphere. Lots of great spots to relax and cafes. I still have friends who’ll be in college next year and my sister is going to the same one so I’ll definitely pay a visit. I might even utilise the library as it’s open for everyone (from 7 am - 8 pm anyways).", "author": "mostlikelytocry", "created": 1583495839, "upvotes": 2}, "fjn1356": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjn1356/", "text": "I think it’s weird.\n\nThere’s a dude who’s 25 and still hangs out around on campus. I met him at the beginning of last semester. He needs to go start a family or something", "author": "hopderp17", "created": 1583493854, "upvotes": 7}, "fjmxagb": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmxagb/", "text": "I think it's ok. \n\nThe only reason it might not be is if you're being creepy or lurking or something. \n\nBut going to events and clubs seems fine to me.", "author": "madjedininja", "created": 1583488629, "upvotes": 2}, "fjmtxgf": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmtxgf/", "text": "I graduated last year and go to some college events I think it’s normal especially since so many of my friends are still in school.", "author": "T-Solo", "created": 1583483847, "upvotes": 2}, "fjmte4m": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmte4m/", "text": "Yes it’s weird and kind of creepy.  You need to move on in your life. Join an alumni group or something.", "author": "nokiabby", "created": 1583483133, "upvotes": 22}, "fjmrffg": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmrffg/", "text": "Who cares if its strange.", "author": "bendadestroyer", "created": 1583480656, "upvotes": 1}, "fjmr4t5": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmr4t5/", "text": "Have you considered grad school?", "author": "Irkutsk2745", "created": 1583480297, "upvotes": 16}, "fjmqw0k": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmqw0k/", "text": "I always visit my alma mater even tho I graduated 3 years ago.", "author": null, "created": 1583479999, "upvotes": 1}, "fjmpmo6": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmpmo6/", "text": "I say it depends. I would only spend time with people I already know or organizations I was once involved with. For example, I’m in a social fraternity and as long as you didn’t cause problems during your time in college, we like having alumni out. That being said, I think it would be weird if you were just trying to meet random people or show up at random clubs.", "author": "throwaway13630923", "created": 1583478514, "upvotes": 2}, "fjmmv5d": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmmv5d/", "text": "Not at all. There's a lot of resources for alumni such as gym access, job preparedness workshops, etc.", "author": "Ryugi", "created": 1583475528, "upvotes": 2}, "fjmkntg": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmkntg/", "text": "My tuition money went to building a new student union  building , you bet I'm going to go every day and get my money's worth when I'm out", "author": "Yuri1kida", "created": 1583473459, "upvotes": 6}, "fjmkfjh": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmkfjh/", "text": "It’s only weird if you got kicked out of the school but still come back and hang around the campus like you still attend. (someone does that at my college).", "author": null, "created": 1583473247, "upvotes": 5}, "fjmjh16": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmjh16/", "text": "No not strange", "author": null, "created": 1583472389, "upvotes": 1}, "fjmjg9s": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmjg9s/", "text": "Graduated college a couple years ago but I go to college bars where I live now (not my alma mater) because nothing beats $5 AYCD when your Keeping up with the Joneses peers wanna go out and drop $100 bucks in the city.", "author": "BearTerrapin", "created": 1583472369, "upvotes": 0}, "fjmirdc": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmirdc/", "text": "Why would people care and why do you care. People make things out to be way more dramatic in your head it's inevitable but at the end of the day you're nothing more than a background character in someone else's life just like they are the same for your life. You're overthinking things that don't matter. It's weird if you think it's weird as then you'll make it weird. If you don't think it's weird and act like yourself, no one will really care.", "author": "SGKurisu", "created": 1583471774, "upvotes": 4}, "fjmig8w": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmig8w/", "text": "Honestly dude, yeah. College clubs are geared towards people in a certain stage in their life. It's not about age, so that isn't the issue.\n\nBut you're joining these clubs and you've already 'lived' the experience so to speak. You've done the college thing, you earned your degree and now you're in the real world.\n\nIf someone at work told me they still hung out at their campus and they graduated, I'd get weird vibes.", "author": null, "created": 1583471511, "upvotes": 89}, "fjmi35e": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmi35e/", "text": "Let it go dawg, it’s over", "author": "ParrotG", "created": 1583471204, "upvotes": 228}, "fjmhlvd": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmhlvd/", "text": "I think it's usually fine if you're not a creep. But I feel like you'll get some interesting looks if you're striking up a great conversation with a new person and they ask, \"what year are you?\" and you say \"Class of 2019.\"", "author": "powerfulAHS", "created": 1583470821, "upvotes": 78}, "fjmh9lb": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmh9lb/", "text": "I can't believe you'd want to. The day I graduate is the last day I'll ever set foot in this godforsaken college town", "author": "deadmanskidney", "created": 1583470569, "upvotes": 26}, "fjmgpv3": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmgpv3/", "text": "Honestly stay away from student oriented clubs but feel free to join the Alumni groups. Alumni groups tend to be of various ages and have events that are less campus life driven anyways.", "author": "The_Gandaldore", "created": 1583470136, "upvotes": 73}, "fjmgb05": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmgb05/", "text": "Make sure to be an Andy and not a Broccoli Rob.", "author": "FloraFelix", "created": 1583469810, "upvotes": 12}, "fjmfwtt": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmfwtt/", "text": "IMO, It’s ok if you recently graduated and have friends still there you can talk to. If it’s been ten years, then absolutely.", "author": "Jcampbell000", "created": 1583469500, "upvotes": 163}, "fjmflpq": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmflpq/", "text": "Naaa not at all. Why would it?", "author": "huey764", "created": 1583469255, "upvotes": -2}, "fjmfffy": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmfffy/", "text": "I feel insecure every time I go back too, Im always afraid someones's gonna think Im that kid who graduated with no life who has nothing better to do and cant let go of college. But I have a good job and im pretty content with my life, I just like to see my friends and school. And if I was close by a nice campus I would def hang out there. I don't think youre being weird at all but I understand he feeling.", "author": null, "created": 1583469116, "upvotes": 4}, "fjmdyp6": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmdyp6/", "text": "It’s strange", "author": "dukwrth", "created": 1583468003, "upvotes": 19}, "fjmdlzy": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmdlzy/", "text": "I’m in the same boat as you only I moved back home after I graduated last semester. Don’t have a job yet and I don’t have anyone to talk to at home so why not I drive about 90 miles just to see them and socialize again. Two weeks ago, my org that I was president of had a hide and seek event. Everyone missed me and I loved seeing them. And last week I went on a hike with them (which was my first one ever) one of my friends ended up getting a full time job there and I think I’m about to do the same. I really miss the freedom you had while away for college.", "author": "AXXII_wreckless", "created": 1583467738, "upvotes": 22}, "fjmdcfk": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmdcfk/", "text": "Yes it is weird. I'm sorry, but it is. That said, it could be fun.", "author": "bennyandthef16s", "created": 1583467540, "upvotes": 78}, "fjmcv0x": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmcv0x/", "text": "Just use your intuition. Don't overstep if the club is obviously meant for or geared towards current students. You wouldn't want to step on their college experience. \nBut if it's a general interest club or one that's not specifically for current students, I'd say it's fine up to a certain age (like 25-26 you might start getting too old to make friends with freshman and sophomore). That's my 2cents!", "author": "ImGettinThatFoSho", "created": 1583467183, "upvotes": 9}, "fjmcf6c": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmcf6c/", "text": "Its not weird! Just be careful though -- I've had issues with alum trying to run student organizations and clubs when its *student run* for a reason. Don't turn into that guy, cause no one likes that guy.", "author": "SensitiveWeb8", "created": 1583466863, "upvotes": 414}, "fjmb8vn": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmb8vn/", "text": "If you got mixed reactions from college students then what makes you think that it will be any different asking a subreddit for college students?", "author": "RileyG00", "created": 1583466018, "upvotes": 24}, "fjmap6n": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjmap6n/", "text": "I think its a good idea and not strange at all!!\n\n\nAs a side note — i doubt that this would apply to you at all since my school’s administration is pretty wack, but be aware of any rules stating that non-students can’t use facilities for students. At my school, someone who was of college age, was on leave of absence from our school, and lived in the neighborhood got in trouble for attending church services at our worship building. They got a Persona Non Grata filed against them. And our school is giving those out in other similar cases, to students on leave of absence, etc.", "author": "ElephantsRTasty", "created": 1583465613, "upvotes": 143}, "fjm886a": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjm886a/", "text": "Colleges have community events to involve the community so get it get it get it!", "author": "A_Gif_Horse", "created": 1583463889, "upvotes": 3}, "fjm6so4": {"link": "/r/college/comments/fe6tps/is_it_strange_to_spend_time_on_campus_if_you/fjm6so4/", "text": "Na dude, u do you. If you have fun go for it, don’t care what others think. I had a friend who gradded 10 years ago (work colleague) come to campus for clubs. He loved it!", "author": "SuperBubsy", "created": 1583462935, "upvotes": 243}}}