{
  "sid": "qo8948",
  "link": "/r/college/comments/qo8948/worth_it_to_graduate_early/",
  "title:": "Worth it to graduate early?",
  "text": "I’m currently a freshman, and I’m trying to decide if I should graduate a year early or not. I came in with a boatload of credits, so the workload to graduate early wouldn’t be very different, if at all.\n\nPros of graduating early:\n\n* save money (I don't need to take summer classes to graduate early)\n* enter workforce earlier and start getting work experience\n* there really is no need for me to stay in for longer than 3 yrs, since i'm not planning to double major or minor or anything\n* family pressure (not exactly a pro, but my family basically does expect me to graduate early)\n\n&#x200B;\n\nPros of not graduating early:\n\n* more time to explore my interests/take classes I want to take, or maybe pick up a minor\n* easier to take classes with the professors I want (professors don't always teach the same classes and some of the classes aren't offered every semester)\n* more time to boost resume (cs major, I don’t have many projects and frankly, I really don’t have time to during classes)\n* I'm in my school's honors program, and we have to write a honors thesis, so it'll be less bit of a cram trying to get all my requirements down than within a shortened timeline\n\n&#x200B;\n\nAnyone in a similar situation or can offer some thoughts? Anyone who graduated early, how did that work out for you?",
  "author": "unpotato7313",
  "created": 1636229581,
  "updated": 1636655815,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {
    "hjlxt5z": {
      "link": "/r/college/comments/qo8948/worth_it_to_graduate_early/hjlxt5z/",
      "text": "Speaking from a college grad who took my time graduating:\n\nIf you:\n\n* already have a strong sense of direction for your career\n* have a solid plan after college\n* have at least some kind of experience in your field or even just have any work experience prior to college\n* aren't interested in exploring non-essential courses or campus clubs\n\nI'd say it would be good to graduate early and get a head start into your career to save money and get industry experience right away. However, if you relate to the following I'd recommend setting some time for these before graduating\n\n* Meeting new people / explore interests with clubs\n* Working on yourself both professionally and personally\n* Studying abroad\n* Getting a part time job if you lack work experience\n* Internship / co-op opportunities to boost your career-related professional experience for your resume\n\nThis will be different for everybody but most of the time I would recommend taking the time to enjoy college and make the most out of it while you are still there. A lot of things change after graduation.",
      "author": "Cheezyaj",
      "created": 1636240174,
      "upvotes": 7,
      "replies": {
        "hjp9pic": {
          "link": "/r/college/comments/qo8948/worth_it_to_graduate_early/hjp9pic/",
          "text": "thanks so much! i really appreciate your insight",
          "author": "unpotato7313",
          "created": 1636308542,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjlixxb": {
      "link": "/r/college/comments/qo8948/worth_it_to_graduate_early/hjlixxb/",
      "text": "For me, there's nothing special about school. Granted, I'm not fresh outta high school, but there's things I'd rather be doing. When I started, I wanted to absorb everything and thought I might shoot for grad school and all the trimmings. Pretty quick, I realized I wasn't into it and began loading my schedule to graduate much much sooner. Max credits each term, summers, all of it. I would only advise to play it by ear and be flexible. Anything can happen.",
      "author": "SemanticBattle",
      "created": 1636233444,
      "upvotes": 3,
      "replies": {}
    },
    "hjlmxeg": {
      "link": "/r/college/comments/qo8948/worth_it_to_graduate_early/hjlmxeg/",
      "text": "If you can handle it, do what saves you money. I know that’s not the only thing that matters, but it’s a very important aspect.",
      "author": "lauthom93",
      "created": 1636235242,
      "upvotes": 3,
      "replies": {}
    },
    "hjmwdju": {
      "link": "/r/college/comments/qo8948/worth_it_to_graduate_early/hjmwdju/",
      "text": "Personally, I’d graduate early. I’d rather be in the workforce making money than doing some Professor’s busywork. If you cherish the whole “college experience” then I’d say go ahead and graduate at the normal time.",
      "author": "danielr088",
      "created": 1636257075,
      "upvotes": 2,
      "replies": {}
    },
    "hjmwkr1": {
      "link": "/r/college/comments/qo8948/worth_it_to_graduate_early/hjmwkr1/",
      "text": "lol I'm also a freshman studying CS, and I transferred \\~55 credits. I also study at the University of Minnesota, small world.\n\nI've been thinking about this a lot as well. As it stands, I could pretty easily graduate in Dec 2033 with a BS. However, with the MS/BS 5-year program, I could graduate in Dec 2024 or May 2025 with a MS. I don't really like taking classes, but the extra time would be invaluable for internships, and the masters could open up possibilities for more specialized MLE roles.\n\nI have no idea what your long-term goals are, but I'm sure you're already aware of how important internships are for CS, no matter what you want to do in the future. It all depends on what internships you can land this or next recruiting season.\n\nIf you're killing it with internships, graduate early. If you need a little extra time to \"stack\" internships, take an extra semester or two to do so. Also, consider that you could leave the university for a semester for fall/winter semesters. This would delay graduation, but you wouldn't have to worry about tuition so much.\n\nJust some things I've observed from my friends who have studied here, some of whom also had a large amount of credits coming in. All that being said, it's still pretty early for the both of us, so it's difficult to assess the best steps \\~2-3 years from now.\n\nIf you ever want to chat or anything, just shoot me a msg! :)",
      "author": "ashyboye",
      "created": 1636257191,
      "upvotes": 2,
      "replies": {
        "hjp9j7i": {
          "link": "/r/college/comments/qo8948/worth_it_to_graduate_early/hjp9j7i/",
          "text": "haha lol, what a coincidence! yeah i've been having trouble finding internships, so that's one of the reasons why I'm considering staying later too. \n\nthanks for the info too! I'm probably just gonna take it slow and see how it goes.",
          "author": "unpotato7313",
          "created": 1636308474,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjlcr98": {
      "link": "/r/college/comments/qo8948/worth_it_to_graduate_early/hjlcr98/",
      "text": "I don’t have any advice, but you may find that you enjoy the whole experience of college and don’t want to cut it short by a year...",
      "author": "NapkinTheBatDad",
      "created": 1636230681,
      "upvotes": 3,
      "replies": {}
    }
  }
}