{
  "sid": "q4a5a3",
  "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/",
  "title:": "How to deal with being your professor’s favorite student?",
  "text": "There’s maybe 15 people in my class, so the favoritism is obvious. I do participate more and probably pay attention more, but I also refrain from saying the answer a lot of the time because I don’t want to be that person. But every single class, he compliments my intelligence and/or creativity while lecturing at least once. Most of the time he also compliments my clothing at the beginning of class. While lecturing, he also looks at me most of the time, probably to gauge how interested I am, but I can feel him forcing himself to look at other students. If he gave similar compliments to other students I would be okay with it, but I feel like it can be discouraging to my classmates. It’s nice to be complimented, but sometimes I feel like it’s borderline flirting and it’s also just embarrassing. I’m an older, non-traditional student who already feels odd about going to school with people in a completely different mindset than me, but I don’t see myself having the courage to ask him to stop. Does anyone have advice on how to navigate this?",
  "author": "jellobiafra4prez",
  "created": 1633737965,
  "updated": 1634083141,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.93,
  "comments": {
    "hfxcz0e": {
      "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hfxcz0e/",
      "text": "The complementing the clothing is very unusual … I am one of those people who really dresses up wherever they go and my professors don’t really acknowledge it because it would be awkward ( and I know I look good lol all my classmates have commented on it). Are you sure he is not flirting with you? I feel like professors do their best not to show favouritism, even in a small class. If it’s this obvious it could be something more… especially if you feel embarrassed. The instincts never lie. I assume you are a female and he is a male, so I would say this sounds like flirting to me. I would honestly talk to a classmate who I can trust to make sure it’s not just in my head and he is obviously flirting. Once it is confirmed If you are scared to confront him directly ( which is totally understandable) I would just try to be very brief and cold to get the message across. No small talk, nothing more than what you absolutely have to do in class, extremely professional.",
      "author": "Dry-Razzmatazz8352",
      "created": 1633741873,
      "upvotes": 14,
      "replies": {
        "hg1qa7y": {
          "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg1qa7y/",
          "text": "My class is mostly boys fresh out of high school and the distance between students due to Covid makes it difficult befriend anyone :( After reading these comments, it’s good to know I’m not imagining this to be unprofessional",
          "author": "jellobiafra4prez",
          "created": 1633826982,
          "upvotes": 2,
          "replies": {
            "hg1r4lx": {
              "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg1r4lx/",
              "text": "I’m sorry you are put in this position. It must be very unconfortable for you. I hope you will be able to solve this issue in a calm way",
              "author": "Dry-Razzmatazz8352",
              "created": 1633827400,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfygb2e": {
      "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hfygb2e/",
      "text": "Are you a woman? The clothing commenting is unusual. I wouldn’t be surprised if said professor made a move to make you his TA next semester to try to get you alone with him to sleep with him. \n\nBe careful. Just reading this gave me the creeps",
      "author": "BjornReborn",
      "created": 1633764866,
      "upvotes": 7,
      "replies": {
        "hfzcxws": {
          "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hfzcxws/",
          "text": "Yea I feel the same way. There's really no cause to complement student attire ever.",
          "author": "johnnyplato",
          "created": 1633787737,
          "upvotes": 4,
          "replies": {}
        },
        "hg1qek1": {
          "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg1qek1/",
          "text": "Yes and his current TA happens to be an extremely attractive women",
          "author": "jellobiafra4prez",
          "created": 1633827041,
          "upvotes": 1,
          "replies": {
            "hg1qnt7": {
              "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg1qnt7/",
              "text": "Does she look anything like you?\n\nI would be very careful and definitely don’t find yourself alone with him.",
              "author": "BjornReborn",
              "created": 1633827168,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfxo7r2": {
      "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hfxo7r2/",
      "text": "Are you closer to his age? Perhaps that is why he feels a connection with you. I still think his relationship with you is kinda weird, especially if he is only complimenting you and not anyone else who is doing the same thing as you are (participating and paying attention). I would keep on a lookout to see if he says or does anything inappropriate to you. Hopefully, he just thinks you are a good student and nothing else is going on.",
      "author": "iamsojellyofu",
      "created": 1633747429,
      "upvotes": 2,
      "replies": {
        "hg1qsdp": {
          "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg1qsdp/",
          "text": "I would guess he’s about 15 years older than me. He has also winked at me while talking to each individual student about our assignment",
          "author": "jellobiafra4prez",
          "created": 1633827231,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfzgws8": {
      "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hfzgws8/",
      "text": "Compliment great work when it happens is not favoriting \n\nCOmmenting on clothes can be iffy.  I mean, I have said to other people of my gender and size, wow that is a great raincoat, where did you get it mine isnt long enough, but I am pretty sure the compliments were not about waterproof gear.\n\nAlmost all the time when women feel like this is “borderline flirting “and they dont have the courage to say something  it is because there is actually something to say something about.\n\n\nA couple things\n\nIf you speak to another professor about this, they are mandated reporters, so if you want confidentially  and advice , your best first stop is actually the mental health counseling service.\n\nNot becasue YOU are crazy or at fault , but becasue 1) you should get support in how to deal with this and 2) they are the only ones that have some privacy leeway.  And 3) they know the system in your school.\n\nYou dont have to ask him to stop,  You can report it to other people who will intervene. (If you choose to do this).\n\n\nI HIGHLY recommend going this route, however reluctanct you are (although I understand and am not judging ) becasue the long term consequences to YOU for trying to ignore it and just move past is are really underestimated and can be a big deal.  \n\nAnd of course, these people are repeat offenders most of the time.",
      "author": "PersephoneIsNotHome",
      "created": 1633789720,
      "upvotes": 2,
      "replies": {}
    },
    "hfyrvly": {
      "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hfyrvly/",
      "text": ">Most of the time he also compliments my clothing at the beginning of class.\n\n🙅‍♂️🙅‍♂️🙅‍♂️🙅‍♂️🙅‍♂️🙅‍♂️🙅‍♂️NOPE nope nope nope nope nope, he could get in BIG trouble for this.",
      "author": "civis_romanus",
      "created": 1633773991,
      "upvotes": 0,
      "replies": {}
    },
    "hfz3bu3": {
      "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hfz3bu3/",
      "text": "As an older person, 32, if this shit started happening I'd be pulling some hellacious passive aggressive shit. \n\nFind the seat FURTHEST from the professor. Stop engaging. Get that cell phone in front of your face when you walk in so he's talking to nobody. Don't acknowledge him. \n\nYou're an adult. Quit supporting what he wants. \n\nSend an email that says his comments are making you uncomfortable. Go to HR.",
      "author": "Awkward_Mail_2786",
      "created": 1633782335,
      "upvotes": -4,
      "replies": {
        "hfzh4lx": {
          "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hfzh4lx/",
          "text": "This would be Title IX in most places and pulling passive aggressive shit does you no good.",
          "author": "PersephoneIsNotHome",
          "created": 1633789824,
          "upvotes": 6,
          "replies": {
            "hg3jh2j": {
              "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg3jh2j/",
              "text": "Removing yourself from the situation and trying to stop it from happening won't do you any good? \n\nIt's more passive than passive aggressive anyways. Fucking sit in the back, quit giving him a chance to be a creep. I don't understand what's so hard about that.",
              "author": "Awkward_Mail_2786",
              "created": 1633870186,
              "upvotes": -1,
              "replies": {
                "hg3oa6m": {
                  "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg3oa6m/",
                  "text": "For one thing, this mostly doesn’t work.  Generations of women (and men) have tried to deal with such things by modifying their own behavior, and it very rarely has any affect on the perpetrator.  \n\n\n\nSecond. It is counterproductive and wrong to put the onus (you are an adult, stop supporting  what he wants ) on OP.  This is precisely the same problem as saying that if she wore something different , it would not encourage or elicit this behavior from him.  \n\n\n\nSo you move to the back, NOW he says, come sit in the front again, Why are you sticking your pretty face in that phone?  Or you know I said no phones in class\n\nAlso,  OP has to and should be able to interact with her professor without fear.  The stress of trying to avoid this and actually avoiding class build up and cause new problems \n\nYou can of course say this is making me uncomfortable please stop.\n\nSometime the person really had no idea , and stops.",
                  "author": "PersephoneIsNotHome",
                  "created": 1633872885,
                  "upvotes": 1,
                  "replies": {
                    "hg60oho": {
                      "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg60oho/",
                      "text": "A lot of assumptions going on here.",
                      "author": "Awkward_Mail_2786",
                      "created": 1633909558,
                      "upvotes": 1,
                      "replies": {
                        "hg65s8t": {
                          "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg65s8t/",
                          "text": "No, this is data",
                          "author": "PersephoneIsNotHome",
                          "created": 1633912095,
                          "upvotes": 1,
                          "replies": {
                            "hg7z5o4": {
                              "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg7z5o4/",
                              "text": "I mean, we are in a college sub reddit. Can you provide sources?\n\nNone of this is data. Don't fool yourself into thinking it is. Nothing you've posted even remotely looks like data. It looks like you're making some situation up in your head to fit what you want.",
                              "author": "Awkward_Mail_2786",
                              "created": 1633955461,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hg3o5qy": {
                  "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg3o5qy/",
                  "text": "I meant students don't go to hr in college about anything.  There are other appropriate channels for reporting. Hr would be for faculty, if anything. I wouldn't even know how to get in touch with my campus hr.",
                  "author": "maddsjanep",
                  "created": 1633872821,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "hfzfgd2": {
          "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hfzfgd2/",
          "text": "HR at college? As a student?",
          "author": "maddsjanep",
          "created": 1633788997,
          "upvotes": 2,
          "replies": {
            "hg3j6eo": {
              "link": "/r/college/comments/q4a5a3/how_to_deal_with_being_your_professors_favorite/hg3j6eo/",
              "text": "It doesn't matter who you are, harassment on college campus especially by a college professor will be handled swiftly. Unless the college is cool with lawsuits.",
              "author": "Awkward_Mail_2786",
              "created": 1633870011,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    }
  }
}