{
  "sid": "quyqzk",
  "link": "/r/college/comments/quyqzk/was_this_professor_a_bad_influence/",
  "title:": "Was this professor a bad influence?",
  "text": "Aside from this former professor e-mailing me from his personal e-mail  telling me that he loved me when he is 40 years older than me, I think he behaved inappropriately. On that first day, he told us that he was against professors dating students. I guess he meant students, not \"former\" students. I was probably one of the many students he pursued.\n\nHe had an ego the size of Brazil and thought highly of himself. He didn't really teach anything. When he talked in class, he cursed a lot. Every other word that came out of his mouth was a curse word. He would tell offensive jokes that were racist, incest, and about religion. I remember one joke he told in class, it was some incest joke, and I don't remember exactly what it was, but it was something along the lines of a sister saying to her brother \"Hey, dad was really good last night. \" Then the brother said, \"So was mom.\" He also would tell sexual innuendos, like he would talk about boners and sex.\n\nHe wouldn't talk only school related  things when he lectured, he would talk  about his personal life and things that happened. Like, when he went to a jewelry repair shop, he met a woman who was the owner of the shop and they got along and he said, \"Don't get any ideas, my dears! I don't think she and I 'go to the same church,' if you get the drift.\" What the hell? Why did he need to tell us this? What does this even have to do with school?\n\nHe would make us watch shows like  South Park in class and movies that had sex, violence, and profanity, when some of us were even minors. He never put his university e-mail on the syllabus for us to contact him.  He put his personal home phone number and personal e-mail on the syllabus. He even gave his  home address to students so that they \"could stop by and turn in papers.\"",
  "author": "Flyaway_5",
  "created": 1637034772,
  "updated": 1637181440,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hktie7s": {
      "link": "/r/college/comments/quyqzk/was_this_professor_a_bad_influence/hktie7s/",
      "text": "I had a professor in community college. He taught college algebra he was a great teacher but he blurred the lines. He would have study session at Starbucks which wasn’t too bad but then he started hosting at his house. I was studying with a friend so I wasn’t threatened but it was for sure shaky ground. He also dated a young 20 year old former student. My point is sometimes you have these professors who blur the lines a bit. Your professor seemed like he blurred the lines a lot. I’m my state school for jr year I had a philosophy professor who met people off campus too he had a philosophy club. It was a little bit more professional then the math teacher. I would say file a complaint if it bothered you. I never filed but if my teacher was saying incest jokes I would.",
      "author": "beanie1816",
      "created": 1637040240,
      "upvotes": 1,
      "replies": {}
    },
    "hktkmaj": {
      "link": "/r/college/comments/quyqzk/was_this_professor_a_bad_influence/hktkmaj/",
      "text": "Sounds like a chill guy",
      "author": "Away_Peak_5054",
      "created": 1637041587,
      "upvotes": -5,
      "replies": {}
    }
  }
}