{
  "sid": "q372e8",
  "link": "/r/college/comments/q372e8/how_do_you_guys_stay_mentally_healthy_with_a/",
  "title:": "How do you guys stay mentally healthy with a heavy course load and extra curricular?",
  "text": "I am a double major in comp sci and business who also works 15 hours a week and is in the recruitment process for a sorority (roughly equivalent to the work for 1 class with a lab). Over the past 2 weeks I feel as though I am dragging my body through hell having to accomplish everything I need to do throughout the day. I honestly feel like I'm going insane a bit. I've been having to allocated even the smallest minutes of my day to doing something productive or I fall off my schedule and it is so draining, but I genuinely cannot drop any of my responsibilities. I've barely had time to see my friends or sometimes even eat. How do you all take care of yourselves and not feel so drained with such a heavy load?",
  "author": "lilduckiee",
  "created": 1633606230,
  "updated": 1634083629,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hfpxbl4": {
      "link": "/r/college/comments/q372e8/how_do_you_guys_stay_mentally_healthy_with_a/hfpxbl4/",
      "text": "Coffee. Lots and lots of coffee",
      "author": "harry01772",
      "created": 1633608916,
      "upvotes": 4,
      "replies": {}
    },
    "hfpzqu7": {
      "link": "/r/college/comments/q372e8/how_do_you_guys_stay_mentally_healthy_with_a/hfpzqu7/",
      "text": "simple. i dont",
      "author": "EdelwoodOil",
      "created": 1633610274,
      "upvotes": 4,
      "replies": {}
    },
    "hfq2o3l": {
      "link": "/r/college/comments/q372e8/how_do_you_guys_stay_mentally_healthy_with_a/hfq2o3l/",
      "text": "Get a girlfriend/boyfriend",
      "author": "theRealMrReaver",
      "created": 1633611822,
      "upvotes": 3,
      "replies": {
        "hfqbkl4": {
          "link": "/r/college/comments/q372e8/how_do_you_guys_stay_mentally_healthy_with_a/hfqbkl4/",
          "text": "this feels counterproductive",
          "author": "lilduckiee",
          "created": 1633616123,
          "upvotes": 1,
          "replies": {
            "hfs9t1t": {
              "link": "/r/college/comments/q372e8/how_do_you_guys_stay_mentally_healthy_with_a/hfs9t1t/",
              "text": "Hey now, if your girl is from the same major/class as you\nBam study partner",
              "author": "theRealMrReaver",
              "created": 1633645682,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfqs9oj": {
      "link": "/r/college/comments/q372e8/how_do_you_guys_stay_mentally_healthy_with_a/hfqs9oj/",
      "text": "Getting good sleep and nutrition is an absolute must. If you fail to sleep or eat well, you will not be able to function and your schedule will be even more difficult to maintain. \n\nWhen you have so many things to stay on top of, it is always good to write out a very detailed schedule. You might discover that you have some free minutes that can be used to do homework. Even so, writing everything prevents surprise deadlines that can be stressful.",
      "author": "myCloggedArteries",
      "created": 1633623193,
      "upvotes": 1,
      "replies": {}
    },
    "hfrl8iv": {
      "link": "/r/college/comments/q372e8/how_do_you_guys_stay_mentally_healthy_with_a/hfrl8iv/",
      "text": "Your title describes my life exactly (I’m working as well). Tbh it gets difficult sometimes but it’s helpful to 1.) make sure the classes and activities you’re involved in are topics you are interested in/passionate about. Don’t just do a class or club just for your resume because if you aren’t excited about the subject or don’t like it at all it will be that much more of a burned. 2.) Take some self care time. Have a day in the week that’s reserved all for you (no work of any kind unless you’re extra busy and need to, then makeup for it a different way). For me, that’s Saturday. Hope this helps!",
      "author": "ImpossibleParadox_17",
      "created": 1633635054,
      "upvotes": 1,
      "replies": {}
    }
  }
}