{
  "sid": "qk470g",
  "link": "/r/college/comments/qk470g/today_i_missed_my_first_assignment_this_semester/",
  "title:": "Today I missed my first assignment this semester. This is bad.",
  "text": "I know how it happens. I do every assignment near flawlessly until one day, I don't do one. All it takes is missing one and suddenly it becomes a habit to miss the next, and the next. This pattern persisted all through high school, though I could still bum rush everything and get decent grades, but now I'm in year 1 of community college when others my age should be in year 2.\n\nHow do I stop doing this to myself?",
  "author": "laidbackagain",
  "created": 1635732829,
  "updated": 1635779343,
  "over_18": false,
  "upvotes": 27,
  "upvote_ratio": 0.97,
  "comments": {
    "hiuaunb": {
      "link": "/r/college/comments/qk470g/today_i_missed_my_first_assignment_this_semester/hiuaunb/",
      "text": "Set reminders in your phone. Alarms if you have to. That’s the only way I remember to do anything. Or find someone else in the class with you to hold you accountable.",
      "author": "yougotknoped",
      "created": 1635734736,
      "upvotes": 5,
      "replies": {
        "hiugosv": {
          "link": "/r/college/comments/qk470g/today_i_missed_my_first_assignment_this_semester/hiugosv/",
          "text": "It's not about forgetting. I'm acutely aware that I need to do the assignment, but I didn't do it. I'm not even sure, it's just a habit of procrastinating. I've been doing better this semester overall, doing work earlier than it's due, but I've been slipping and now I missed this assignment.\n\nThe problem is less that I'm being neglectful. With one assignment, I had to record a video, and I just wasn't comfortable with that. It took me the whole week to mentally \"prepare\" to do it. Not only that, but my mind also felt like it needed to complete this assignment before I could do the other one (i.e. the one I ended up missing). As a result, I completed the video  but didn't do this assignment. It's crazy but that's just how my brain works.\n\nI'm just worried that my brain, since it's missed one assignment, will want to give up on doing any assignments at all. I feel like I'm very all-or-nothing, either I get everything done or I get nothing done. logically I know it's only one assignment, but it's like my brain takes it as an invitation to not do anything from that point forward. Typically I reach this point by late September, but since I've tried being more proactive, I guess I delayed it to October.",
          "author": "laidbackagain",
          "created": 1635737837,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hiuhcrz": {
      "link": "/r/college/comments/qk470g/today_i_missed_my_first_assignment_this_semester/hiuhcrz/",
      "text": "Most colleges use some sort of web-based system for assignments like Canvas or Blackboard. If this is true for your school, all you have to do is sift through the software or call your school’s IT department to sync a digital calendar to your phone. (Professors are kinda hit or miss on these types of tech things, just go to IT if you can’t find answers on Google).\n\nSuper easy, shows all your due dates, and is live for whenever due dates change or assignments get added. \n\nAs a freshman, there were lots of things I had no idea about and wish I had known. Feel free to ask upperclassmen at your school or counselors what their “must-knows” are, you’d be surprised what they tell you.",
      "author": "theactualwhomst",
      "created": 1635738194,
      "upvotes": 3,
      "replies": {}
    },
    "hiuzz8h": {
      "link": "/r/college/comments/qk470g/today_i_missed_my_first_assignment_this_semester/hiuzz8h/",
      "text": "I'm the same way. I'm extremely aware of due dates and assignments, it's not about forgetting. It's about being a perfectionist. Once you mess up, you pretty much fall into a \"depression.\" At least that's how it is for me. I didn't equate it to perfectionism until my therapist brought it up. I still don't know how to combat it, but I just want you to know there are others who feel the same way :)\n\nPretty much \"if I'm not perfect, then what's the point of doing it at all?\"",
      "author": "justasimplegg",
      "created": 1635752549,
      "upvotes": 3,
      "replies": {
        "hiv6iv2": {
          "link": "/r/college/comments/qk470g/today_i_missed_my_first_assignment_this_semester/hiv6iv2/",
          "text": "That’s what happened to me! It really sucked missing one assignment and I had time to turn it in late and blew it all. Sometimes the best thing you can do is try and let it go and move forward with your studies",
          "author": "milk1tea",
          "created": 1635758981,
          "upvotes": 1,
          "replies": {}
        },
        "hivmljq": {
          "link": "/r/college/comments/qk470g/today_i_missed_my_first_assignment_this_semester/hivmljq/",
          "text": "I'm in this response and I don't like it.",
          "author": "resident_bee",
          "created": 1635770982,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiubamy": {
      "link": "/r/college/comments/qk470g/today_i_missed_my_first_assignment_this_semester/hiubamy/",
      "text": "Check your schedule every day so that way you can see when something is due for example if you check your schedule on Monday and something is due on Wednesday then you will remember.",
      "author": "Competitive-Ninja449",
      "created": 1635734973,
      "upvotes": 1,
      "replies": {}
    }
  }
}