{"sid": "ovliua", "link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/", "title:": "Is it possible that we're going to be online again?", "text": "I'm just worried with the rise of the delta variant. This is my last year of college and I would really like to spend it on a campus. I hope that doesn't sound too selfish.", "author": "Themysxciras", "created": 1627791480, "retrieved": 1632948043, "over_18": false, "upvotes": 582, "upvote_ratio": 0.96, "comments": {"h8pxihc": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h8pxihc/", "text": "It’s definitely a possibility. They are bringing back mask mandates due to new variants that have a chance of infecting vaccinated people. I know the cdc is now giving a third vaccine to at risk groups. New variants that are deadly and spread easier + many college students refusing to listen to the new mask mandates = not a good mix", "author": "ElBarro69", "created": 1628812165, "upvotes": 2}, "h7fdpkc": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7fdpkc/", "text": "It sucks because with the way the delta cases are rising its not looking so good, but colleges already missed out on money from the previous year so they’re going to wait it out until the bitter end i think", "author": "Nejious", "created": 1627911015, "upvotes": 3}, "h7dvoht": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7dvoht/", "text": "i'm not too worried honestly, my school is in a blue state and  we still don't even have to mask up on campus at the moment. vaccination is required to attend tho so i'm sure it's wildly different for schools without that policy", "author": "freshguy2002", "created": 1627871861, "upvotes": 3}, "h7do6kq": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7do6kq/", "text": "I will straight up withdraw from all my classes if school goes back online. I’d finish the semester but deregister from all of the second semester. I’ll wait as long as it takes to do normal school again, I can’t do this again. I can’t let myself go through that again.", "author": "annoyedpsychstudent", "created": 1627867906, "upvotes": 3}, "h7dllsb": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7dllsb/", "text": "Possible... we're talking about DELTA", "author": "Adrien0715", "created": 1627866548, "upvotes": 1}, "h7dimki": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7dimki/", "text": "We don’t know, I think it is preference. I actually like online classes but I need a balance , so I opt to do hybrid because I recently found it  harder to concentrate for online class.", "author": "Wide-Iron8830", "created": 1627864951, "upvotes": 2}, "h7dbxxm": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7dbxxm/", "text": "Covid has become a normal illness in our society, just like the cold or flu, so we have to get back to normal eventually. So no, definitely not selfish - your education is being impacted.", "author": "britishsaintsfan", "created": 1627861350, "upvotes": 4}, "h7damr4": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7damr4/", "text": "I think when kids finally get the vaccine we'll see cases decrease. So, maybe not for first semester, but when second semester rolls around when a lot more people are vaccinated (children and adults alike) everything will be normal (or mostly) again. At least I hope", "author": "Chungulungus", "created": 1627860655, "upvotes": 2}, "h7d4n1i": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7d4n1i/", "text": "We’ve been getting about 500 new cases daily in the whole country (Canada) for a while, got 71% of population vaccinated and my classes are going to be online this fall :(", "author": "iamnotapopstar", "created": 1627857572, "upvotes": 2}, "h7czvjc": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7czvjc/", "text": "Welcome to indoctrination and control.", "author": "Luftgekuhlt_driver", "created": 1627855196, "upvotes": 1}, "h7cr2rr": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7cr2rr/", "text": "We can’t shut down, we unfroze tuition and lose too much money when online only. They’ll do everything in their power to be on campus all year.", "author": "drock13", "created": 1627850904, "upvotes": 4}, "h7cnvf8": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7cnvf8/", "text": "I will end it all. I seriously can’t do that shit again.", "author": "NoOutlandishness9892", "created": 1627849388, "upvotes": 13}, "h7cm68c": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7cm68c/", "text": "My university is requiring the vaccine and making pretty much everything in person. I hate it", "author": "wolfy321", "created": 1627848580, "upvotes": 1}, "h7ckodf": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7ckodf/", "text": "My summer class just went online for the last week because 2 students tested positive. It's like a 16 person class.\n\nIt's entirely possible if enough students test positive when the semester starts, it's probably something schools really want to avoid though because they will lose a lot of money. I think it's likely they'll start mandating masks again.", "author": "walkingshadows", "created": 1627847868, "upvotes": 2}, "h7cbeuq": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7cbeuq/", "text": "My state is not allowing a mask mandate and my college isn't requiring vaccines. Our cases are already rising during summer school. I can't see many options expect to go online.", "author": "Gtaglitchbuddy", "created": 1627843430, "upvotes": 2}, "h7c9a9p": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7c9a9p/", "text": "I just transferred from cc after working really hard for 4 years and I want to have some college experience so I’m really hoping things turn ok so I can have friends and stuff", "author": "sAvage_hAm", "created": 1627842420, "upvotes": 2}, "h7c4lnh": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7c4lnh/", "text": "It is def a possibility which sucks.", "author": "Background-Bake-8597", "created": 1627840202, "upvotes": 3}, "h7c45ki": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7c45ki/", "text": "My college says they will reopen fully from fall, but whether it happens or not is unknown. Online learning sucked last year.", "author": "EwanAdams", "created": 1627839998, "upvotes": 2}, "h7c1ltp": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7c1ltp/", "text": "Not selfish at all man. It’s pretty ridiculous that they’re putting such extreme restrictions on college students in the first place considering 99%+ of us are healthy and will be perfectly fine if we end up catching covid.\n\nMy college is even requiring the vaccine so theoretically we should all be fine even if cases go up.", "author": "BillerBillions", "created": 1627838825, "upvotes": 2}, "h7c09ui": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7c09ui/", "text": "It’s a possibility but I wouldn’t be surprised if it we go back to a remote/ in-person hybrid now that vaccines are available.", "author": "FlyingPenguinsXXII", "created": 1627838208, "upvotes": 2}, "h7c02fd": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7c02fd/", "text": "To be honest, I don’t think so. It’s getting out of control again and we are faaaar away from having a safe environment in in-person classes.", "author": "Mahtabss", "created": 1627838111, "upvotes": 3}, "h7by13u": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7by13u/", "text": "I don't think it sounds too selfish and I would love to be on campus, but I spent my last semester of undergrad and my entire first year of grad school online so I'm definitely biased because online SUCKED for me and has totally screwed me over.\n\nAs far as the possibilities, I'm only a TA so I don't know the real dirt behind the scenes, but I'm pretty sure the faculty here has gotten the \"we're in person, but have a backup plan in case we have to go back online\" thing.  TAs are still being told to expect to teach in person at this point, but anything can happen with delta being SO transmissible.  I'm hoping for the best, but preparing for the worst.", "author": "LadyWolfshadow", "created": 1627837163, "upvotes": 7}, "h7bxuga": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bxuga/", "text": "It probably depends on how many cases your state/city gets. Most of my classes are hybrid, so I doubt my college will completely shut down.", "author": "JupiterRocket", "created": 1627837076, "upvotes": 2}, "h7bxoxb": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bxoxb/", "text": "Absolutely not in Texas or Florida. Perhaps in other states.", "author": "Alikat-momma", "created": 1627837003, "upvotes": 2}, "h7btkt2": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7btkt2/", "text": "I feel your pain. For the 2020-2021 school year, I transfered from a community College to a university. That year was completely online too. Now, I only have 2 years left(plus the possiblity of a summer semester) before my time is up and I have only been on campus once, which was to pick up books. I hope that it won't be completely online, I have a course so far that's in person, but if it follows through, then the rest of my courses in both degrees will pretty much have to be f2f.", "author": "Ok-Assumption-9986", "created": 1627835068, "upvotes": 4}, "h7bspzj": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bspzj/", "text": "I’m mainly concerned that my school is too hesitant to address the fact that we will have covid cases and active community transmission. It seems like it’s political suicide to say “we know there will be transmission and we intend to continue with in-person classes” but that’s kinda what administrations need to come out and say \n\nLet it be known that the vaccines work and effectively eliminate the chance of severe covid cases, and thus some level of transmission is inconsequential and acceptable", "author": "Oh2BeAGunner", "created": 1627834671, "upvotes": 27}, "h7brhyc": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7brhyc/", "text": "Just did my last year undergrad and it really took the enjoyment out of it being at home. My grades didnt suffer it just wasnt the same experience at all.", "author": "astonaidan", "created": 1627834099, "upvotes": 2}, "h7br5r8": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7br5r8/", "text": "Depends on the school. I’m fortunate enough to go to a SLAC in the middle of nowhere where the admin’s requiring *everyone* in the community (students, faculty, and staff, ignoring legitimate medical exemptions) to be fully vaccinated at least two weeks before returning to campus, so I’m pretty sure we’re going to have a fairly normal semester.", "author": "dsch_bach", "created": 1627833941, "upvotes": 2}, "h7bqn5s": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bqn5s/", "text": "I hope not since my college is requiring vaccination but it’s impossible to know for sure.", "author": "GoodManDavid", "created": 1627833703, "upvotes": 5}, "h7bptte": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bptte/", "text": "My university isn’t testing if you’re vaccinated, no testing means no rise in cases (on paper at least)", "author": "joc307", "created": 1627833322, "upvotes": 2}, "h7bpjpw": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bpjpw/", "text": "I really hope not, because it seems that a lot of med schools won’t accept online lab classes, and I’ve pushed off taking any lab classes until this fall for this reason 🙃", "author": "The-Night-Court", "created": 1627833193, "upvotes": 9}, "h7bh4y8": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bh4y8/", "text": "I know a lot of people are worried about this but when I imagine those huuuge crowds of students packed like sardines at my uni pre-covid I get nervous", "author": "unholymanserpent", "created": 1627829328, "upvotes": 7}, "h7bgly7": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bgly7/", "text": "It really depends on whether your school is requiring vaccines or not - I think that’s a big game changer, honestly. If they require vaccines I think it’ll be very unlikely for you to be forced home again. If not, then… I guess you’ll see? Hopefully your school has been good about testing and staying on top of cases.", "author": "LCHolland82700", "created": 1627829068, "upvotes": 8}, "h7bf7hy": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bf7hy/", "text": "It won't happen if people start actually looking at the statistical and empirical data instead of trusting what they hear on the news and what the politicians spit out. If people actually knew that the Delta variant killed less people than the actual virus that we were on lockdown for last year things would change big time Delta variant only spreads faster doesn't kill as bad as the original virus.", "author": "Old-Measurement4504", "created": 1627828366, "upvotes": -3}, "h7beko9": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7beko9/", "text": "It depends where you live. Blue state? Probably. Red state? Probably not.", "author": "jmg850", "created": 1627828043, "upvotes": 2}, "h7bc2ne": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bc2ne/", "text": "Death rates", "author": "penny__", "created": 1627826731, "upvotes": 2}, "h7bar2e": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7bar2e/", "text": "I really hope not. Being old af is a enough of a hurdle. I need a classroom with people I can talk to. Not another semester in my living room.", "author": null, "created": 1627826028, "upvotes": 5}, "h7b5exf": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7b5exf/", "text": "While I don't think we'd be sent home (given last year with online and how much more prepared staff are with using tools like Zoom), but I wouldn't be surprised if they started requiring masks regardless of vaccination status / limiting the number of people at events/classes.", "author": "Clarinetist123", "created": 1627823191, "upvotes": 9}, "h7b5dpe": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7b5dpe/", "text": "No. At least for me my school was in person w masks during the pandemic and held several events each week (upstate NY) w a large student body in 2020-21. They mandated vaccines for us do we are at “green” and covid cases in the neighboring city are down to 40 a day. I wouldn’t worry too too much unless you hear things from your college. The media is a circus rn, covid rates are very low at the moment. Just focus on school and enjoying these last few weeks", "author": "smelltheskinny8", "created": 1627823173, "upvotes": 4}, "h7b58pf": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7b58pf/", "text": "I already spent a few thousand $$$ for a new apartment, parking permit and other stuff I need to live near campus. If we are going online again, the money I spent will go down the drain. I could easily stay at home and only pay for tuition.\n\n&#x200B;\n\nI rather have them tell me now than 3 weeks in.", "author": "Omeole", "created": 1627823096, "upvotes": 75}, "h7b241b": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7b241b/", "text": "I think schools that have enforced vaccine mandates will be in person. from my knowledge it seems that the current vaccines are sufficient to avoid severe covid & death in almost every single case so long as you're vaccinated", "author": "Farconion", "created": 1627821055, "upvotes": 8}, "h7azyo3": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7azyo3/", "text": "I think it all depends on the school at this point. My school in the southeast is requiring vaccines, we must wear masks in the buildings and since its a pretty small school they were able to keep their number of cases last year at around 5. I would be shocked if my school and similar schools were to shut down because the rise in cases is what pushes people to act but if you can avoid a rise in cases then should be all good.", "author": "uss_soup", "created": 1627819513, "upvotes": 5}, "h7ayvb5": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7ayvb5/", "text": "Ya online sucks :(", "author": "Rickysmalls1010-", "created": 1627818673, "upvotes": 8}, "h7aw02a": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7aw02a/", "text": "Well my former school and the ones nearby are requiring the vaccine in the COVID record which some claim wasn’t going to happen due to the reports going down but that was a lie lol. Hopefully this variant comes down but I really don’t want COVID 2.0", "author": "BigMiami", "created": 1627816322, "upvotes": 5}, "h7atlz3": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7atlz3/", "text": "I think when we go home for thanksgiving we won’t go back till second semester.", "author": "cuppa_tea_4_me", "created": 1627814270, "upvotes": 21}, "h7aicg1": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7aicg1/", "text": "True answer: nobody knows, and it doesn't matter to universities the preference of their students.", "author": null, "created": 1627804141, "upvotes": 415}, "h7ai11z": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7ai11z/", "text": "In Thailand we've been online since March last year. \n\nWe don't live in normal times, and we're not gonna have a normal education experience. It's not selfish to want some normality, because everyone wants it. But, we all have to get used to this being the way things are.", "author": "Sea_Programmer3258", "created": 1627803867, "upvotes": 7}, "h7ahjrd": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7ahjrd/", "text": "A new virus has been released by the CCP at the Tokyo Olympics. Classes will be online this fall. LET'S TAKE DOWN THE CCP! watch warroom at 10am eastern monday-saturday to learn more!", "author": "FlexentOneBTS", "created": 1627803450, "upvotes": -26}, "h7ah36j": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7ah36j/", "text": "Maybe, depends on state and college", "author": "FCHusky", "created": 1627803053, "upvotes": 14}, "h7agz52": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7agz52/", "text": "It’s not selfish at all I’m kinda worried about the same thing I don’t want spend my college time online anymore!", "author": "RefrigeratorFuture61", "created": 1627802957, "upvotes": 49}, "h7afbnb": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7afbnb/", "text": "It’s my last year too, and I’m worried as well. My school is requiring the vaccine so I’m trying to stay hopeful but I don’t know. I could not do another year of remote learning that’s for sure, I’d lose my mind.", "author": "shiverglow", "created": 1627801538, "upvotes": 8}, "h7ae26d": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7ae26d/", "text": "[deleted]", "author": null, "created": 1627800473, "upvotes": 16}, "h7act2c": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7act2c/", "text": "I think it’s a possibility. I’ve been looking at the news and a lot of people who took the vaccine got infected with this new delta variant. I know a lot of universities and the CDC are enforcing mask mandates even for those vaccinated so that should tell you how serious this is.", "author": "ElBarro69", "created": 1627799434, "upvotes": 13}, "h7a9eve": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7a9eve/", "text": "I doubt it. COVID is here to stay and we can only keep deaths as low as possible. As long as students are vaccinated, there shouldn't be too much of an issue on college campuses.", "author": "SwiftCEO", "created": 1627796746, "upvotes": 36}, "h7a8cmr": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7a8cmr/", "text": "I hope not. It’s my last year of college and my previous two were spent with an emotionally abusive roommate do this is my chance to make it count basically :/", "author": "hh200077", "created": 1627795939, "upvotes": 48}, "h7a70if": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7a70if/", "text": "From Texas here, and nope we are going back to normal even if people die. Our politicians are on crack.", "author": "Mariah_Kits", "created": 1627794957, "upvotes": 89}, "h7a6gdo": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7a6gdo/", "text": "My college is in the southeast and had in person classes throughout the 2020-2021 school year, but no on campus events. What I’m starting to notice is more and more professors opting for online classes even though they can technically teach in person. What I think is going to happen is starting out with on campus events for the fall and then shutting them down once cases rise.", "author": "cocolarue_", "created": 1627794554, "upvotes": 200}, "h7a5tee": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7a5tee/", "text": "My school didnt gaf thankfully, we were online, but we all got to go to dining halls and hang out in the dorms no one was sent home. It was lame as fuck, but i still got to go to parties and shit so its chill. I dont think my school would go back online, but if you go to a libtard college then yall might.", "author": "Aringhet", "created": 1627794093, "upvotes": -47}, "h7a508o": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7a508o/", "text": "I'm concerned about it as well. I'm hearing about public schools that are planning to do in person but with masks, I imagine universities are going to do the same. Lots of universities are not requiring vaccines which is concerning. \n\nEven if we classes are in person, schools might switch back to online when the virus begins to spread throughout campuses.\n\nIt's not selfish to want a normal experience. I'm likely going to be taking a leave of absence. Lost 3 semesters, made no friends, had no experiences and didn't learn much because of Covid so I'm not taking my chances with this next year.", "author": "HeyYouPazuzu", "created": 1627793518, "upvotes": 163}, "h7a40vl": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7a40vl/", "text": "[deleted]", "author": null, "created": 1627792845, "upvotes": 25}, "h7a3sug": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7a3sug/", "text": "That doesn’t sound selfish at all. I don’t think it will happen since the colleges kind of have a grip on the whole thing now. But I do find myself thinking “god what if I unpack everything and a month later I have to pack it all up” you know?", "author": "therealnuttyboy", "created": 1627792692, "upvotes": 106}, "h7a3p8c": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7a3p8c/", "text": "Week ago I would've said no chance in hell. But apparently some governors don't want to be reelected so maybe if you live in a solid blue state.", "author": "DaBigBlackDaddy", "created": 1627792624, "upvotes": -15}, "h7a2v8g": {"link": "/r/college/comments/ovliua/is_it_possible_that_were_going_to_be_online_again/h7a2v8g/", "text": "No", "author": "CastleDasher", "created": 1627792061, "upvotes": 5}}}