{"sid": "px8rqc", "link": "/r/college/comments/px8rqc/how_do_i_make_friends/", "title:": "How do I make friends?", "text": "Hey, I’m a freshman 6 weeks into my first semester at university. I’m a commuter and I am having a damn hard time making friends. \n\nI’m not struggling with confidence, fear or any of that stuff. I’m mainly just new to approaching others and trying to get to know them. The main questions I have is when is it a good opportunity to approach someone and what exactly should I be saying?\n\nI’ve been going to events at college in hopes to meet others, so far it hasn’t worked out that well either. Not really interested in any of the clubs that are offered, I also work so my schedule is tough. \n\nAny recommendations as to:\n\n1. How should I introduce myself to others?\n\n2. How to respectfully ask for there contact info; snapchat, IG or number?", "author": "mctrumpo", "created": 1632842718, "retrieved": 1632945382, "over_18": false, "upvotes": 15, "upvote_ratio": 1.0, "comments": {"herdqso": {"link": "/r/college/comments/px8rqc/how_do_i_make_friends/herdqso/", "text": "The best thing I can tell you is to just make yourself seen. Even if you’re not really “doing” anything, at least go out and do nothing where people can see you and approach you. Try to strike up a conversation on something mutual. If you see them wearing a shirt for a hobby/band/organization that you like, bring it up.", "author": "115machine", "created": 1632943762, "upvotes": 1}, "heqsm9f": {"link": "/r/college/comments/px8rqc/how_do_i_make_friends/heqsm9f/", "text": "I (19F) had an excuse to sit next to someone in college so I could charge my laptop and she just stood up and walked away 😔", "author": "avocado_casey", "created": 1632935086, "upvotes": 3}, "heqba2n": {"link": "/r/college/comments/px8rqc/how_do_i_make_friends/heqba2n/", "text": "U don’t unless you’re just a innately sociable person. If you’re not your only hope is to find someone as damaged and anti social as u are to cling to 😉", "author": "kojohn11", "created": 1632928153, "upvotes": 2}, "heq3ing": {"link": "/r/college/comments/px8rqc/how_do_i_make_friends/heq3ing/", "text": "Same. I’m a commuter and it sucks clubs and stuff is always at 7 or 8 I’m tired after classes to even go.", "author": "youworry", "created": 1632924844, "upvotes": 3}, "hemh0ok": {"link": "/r/college/comments/px8rqc/how_do_i_make_friends/hemh0ok/", "text": "Start by talking to people in class. In terms of ice breakers you have a wealth of them. Major, where they’re from, what high school (if local), etc. ask to form study groups or like “have you done the homework yet”. You can get contact information that way if you’re gonna do a group or study later. Try to find people with the same major you’ll probably be seeing them again. I met one of best friends from college while I was commuting for community college. I literally asked him about a quiz or hw and hes been a gaming buddy and school carry for 3 years now.", "author": "NinjaLorian", "created": 1632852700, "upvotes": 6}, "hem19pa": {"link": "/r/college/comments/px8rqc/how_do_i_make_friends/hem19pa/", "text": "Literally in the same boat except all of people posted on this class of 2025 instagram page and they said some stuff about themselves so how am I suppose to start a convo through text or dms lol", "author": "Responsible_Ad_561", "created": 1632846222, "upvotes": 3}}}