{
  "sid": "psb11q",
  "link": "/r/college/comments/psb11q/does_study_homework_in_college/",
  "title:": "Does \"study = homework\" in college?",
  "text": "So I'm a freshman and I'm taking a few math classes and a few engineering classes. Outside of doing homework for these classes, I don't study for them. I think I'm grasping the concepts well enough for quizzes and exams. Am I doing things correctly, or should I just spend more time studying for my classes, even though I'm able to finish all homework questions?",
  "author": "Ok_Bat4262",
  "created": 1632196892,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hdomayv": {
      "link": "/r/college/comments/psb11q/does_study_homework_in_college/hdomayv/",
      "text": "If you are handling the assignments well enough, and are able to do practice problems, chances are you know the material well enough.  If you don't, do more practice problems.",
      "author": null,
      "created": 1632199865,
      "upvotes": 1,
      "replies": {}
    },
    "hdoi31y": {
      "link": "/r/college/comments/psb11q/does_study_homework_in_college/hdoi31y/",
      "text": "If just going to class and doing the homework works for you, then you’re doing things correctly. Don’t be afraid to make adjustments if it starts to not be enough, but otherwise, I wouldn’t stress too much about it. Everyone learns differently so there isn’t a universally “correct” way to study.",
      "author": "KittyAutor",
      "created": 1632197250,
      "upvotes": 2,
      "replies": {
        "hdoi9fc": {
          "link": "/r/college/comments/psb11q/does_study_homework_in_college/hdoi9fc/",
          "text": "\\^ Some classes I just do the hw, some classes I study. Honestly if you're getting good grades, no reason to change what you're doing. Just wait til your first test and if you get an A, then you probably don't need to study unless that class ends up getting harder.",
          "author": null,
          "created": 1632197355,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdoi09u": {
      "link": "/r/college/comments/psb11q/does_study_homework_in_college/hdoi09u/",
      "text": "[deleted]",
      "author": null,
      "created": 1632197204,
      "upvotes": 7,
      "replies": {
        "hdoj8kb": {
          "link": "/r/college/comments/psb11q/does_study_homework_in_college/hdoj8kb/",
          "text": "We had 2 in-class quizzes in calc 3, I got 100% in both of them. I do spend a lot of time actively understanding material of the class, thinking of why the current method work, and my own methods to solve the problem. \n\nSo should I just grab a book for these classes and start going through exercises?",
          "author": "Ok_Bat4262",
          "created": 1632197941,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054325
}