{
  "sid": "qqlhyp",
  "link": "/r/college/comments/qqlhyp/i_never_had_girlfriend_in_college_i_regret_but_i/",
  "title:": "I never had girlfriend in college, I regret but I don’t k ow how to fix it",
  "text": "I never had girlfriend I tried to hard to find girlfriend but in the first year of college, 1 girl that I tried to approach she left me because She asked me to study together and she used me to have good grades because I was so good in math, later I tried to approach a trainer from a course and she didn’t want to me and rejected me, later I tried with another girl that I was so in the same course, and when I tried to talk with her she never answers my texts, later I tried with a friend of my group of friends and obviously she didn’t want me because it could ruined our friendship, on at least there was 30 girls more that I wanted to approach but each time that I stalked them I saw that they had already boyfriend. In many times I tried too hard to get near and talk with woman but any success than only a simple conversation or about the courses, I had been so depressed all quarantine because I couldn’t had girlfriend and the social anxiety that I suffered in that moment, maybe for bullying of High school but in any case I am so bad right now I don’t know how to fix and finally have girlfriend, I am so fucking depressed about all this, I never get so effort probably in college but I want to change and try to approach, maybe I wasn’t persistent enough or never did more effort to talk with them or so naive that they didn’t really like me but I really didn’t know how to do that. Please help",
  "author": "Manusargal",
  "created": 1636516485,
  "updated": 1636655247,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hk10hu4": {
      "link": "/r/college/comments/qqlhyp/i_never_had_girlfriend_in_college_i_regret_but_i/hk10hu4/",
      "text": "It’s not a big deal to never have been in a relationship. You’re probably still young. Having a girlfriend isn’t magically going to make your life better. It’s a lot of responsibility to be in a relationship and to make it work. It takes a lot of time too and you already have school so it’s tough to balance everything.",
      "author": "Prestigious_Union521",
      "created": 1636516831,
      "upvotes": 3,
      "replies": {
        "hk11t5u": {
          "link": "/r/college/comments/qqlhyp/i_never_had_girlfriend_in_college_i_regret_but_i/hk11t5u/",
          "text": "No, I graduated now in October of 2021, college finished",
          "author": "Manusargal",
          "created": 1636517514,
          "upvotes": -2,
          "replies": {
            "hk12idx": {
              "link": "/r/college/comments/qqlhyp/i_never_had_girlfriend_in_college_i_regret_but_i/hk12idx/",
              "text": "Do you think in any way that you may be turning girls off when you talk to them? Are you afraid to talk to women? They’re just humans beings. You should learn how to be friends with women and from there it will be easier. It’s simply as asking someone out on a date. You just have to make sure you’re not doing anything that scares them away. Learn how to be a man. Read, work out, have manners, etc. And since you are out of school, it’ll be easier since you won’t be focus on studying at the same time",
              "author": "Prestigious_Union521",
              "created": 1636517892,
              "upvotes": 2,
              "replies": {
                "hk13ewe": {
                  "link": "/r/college/comments/qqlhyp/i_never_had_girlfriend_in_college_i_regret_but_i/hk13ewe/",
                  "text": "Yes, I tried many times to approach them like I putted in the text, but maybe because I studied in the most expensive college of my country the girls was so conceited, in any case I tried to hard but I couldn’t now I have to know where to approach them maybe in bars",
                  "author": "Manusargal",
                  "created": 1636518389,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk1gfn2": {
      "link": "/r/college/comments/qqlhyp/i_never_had_girlfriend_in_college_i_regret_but_i/hk1gfn2/",
      "text": ">maybe I wasn’t persistent enough\n\nBruh when a girl says she is not interested, she is not interested.  I don't think that's the issue though.\n\nNow that college is over try online dating.",
      "author": "safespace999",
      "created": 1636526781,
      "upvotes": 5,
      "replies": {}
    },
    "hk1p2sw": {
      "link": "/r/college/comments/qqlhyp/i_never_had_girlfriend_in_college_i_regret_but_i/hk1p2sw/",
      "text": "Man ur weird focus on yourself first",
      "author": "SoftBlackberry1103",
      "created": 1636533669,
      "upvotes": 2,
      "replies": {}
    },
    "hk1glvy": {
      "link": "/r/college/comments/qqlhyp/i_never_had_girlfriend_in_college_i_regret_but_i/hk1glvy/",
      "text": "Well thank you, I fell better now",
      "author": "Manusargal",
      "created": 1636526912,
      "upvotes": 1,
      "replies": {}
    },
    "hk2xjjt": {
      "link": "/r/college/comments/qqlhyp/i_never_had_girlfriend_in_college_i_regret_but_i/hk2xjjt/",
      "text": "You dont need to have a girlfriend to feel successful. The way youre talking about women makes me worry you think of us as an accessory rather than people. Work on yourself first and take your time, this isnt a race, you got this man",
      "author": "Caskinbaskin",
      "created": 1636559890,
      "upvotes": 1,
      "replies": {}
    }
  }
}