{
  "sid": "q6b8fk",
  "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/",
  "title:": "Anyone else losing their purpose?",
  "text": "I’m currently a junior and have suddenly just lost all momentum to keep trying. I find myself asking “what’s the point?” daily and crying and not focusing in classes. With the job market and housing prices right now, I’m terrified of graduating. I don’t even want to wake up knowing how fucking hard this is. I reached out to the campus counseling center a week ago and got on the waitlist for a callback to set up an appointment. Still haven’t heard from them and it’s just adding fuel to the fire. I haven’t felt more lost and I don’t know if I can handle this any longer.",
  "author": "nevadabeach",
  "created": 1634003247,
  "updated": 1634082575,
  "over_18": false,
  "upvotes": 49,
  "upvote_ratio": 0.99,
  "comments": {
    "hgb1exj": {
      "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hgb1exj/",
      "text": "Senior here. I pretty much live in a constant cycle of “this is pointless” these days. While I say my work is pointless, I always find a way to get motivated after long bouts of procrastination because of my fear of failure. Good on you for contacting your counseling center because I have not had the guts to do so yet. \n\nIn the end, there is no point, really. The only thing that keeps me going and motivated, like I said earlier, is the fact I should do well since I’m here and because failure is a worse option. \n\nWhat has caused you to feel like this now?\n\nEdit: typo",
      "author": "-Leethul-",
      "created": 1634005543,
      "upvotes": 19,
      "replies": {}
    },
    "hgc2o6g": {
      "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hgc2o6g/",
      "text": "I feel the exact same way. I’m a senior and after my fiancé committed suicide two years ago then Covid, it’s like I’m not even the same person with the same motivations. I worry about what comes after graduation all the time too. My biggest motivation is that I want to see something all the way through. I have a tendency of giving up on things when they get hard or uncomfortable and this is my chance to prove I can finish something I started, no matter how hard it got.",
      "author": "_OhayoSayonara_",
      "created": 1634030666,
      "upvotes": 12,
      "replies": {
        "hgdy2u1": {
          "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hgdy2u1/",
          "text": "Stay strong",
          "author": "WhiteKoala__",
          "created": 1634064596,
          "upvotes": 3,
          "replies": {
            "hge08x4": {
              "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hge08x4/",
              "text": "Thank you! I am trying.",
              "author": "_OhayoSayonara_",
              "created": 1634065482,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgcjulz": {
      "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hgcjulz/",
      "text": "Yup. I’m a sophomore and I am realizing how much I hate college. Feels like a massive waste of time, pretty much just a way to keep me from living with my family for four years. I have a meeting with someone from the school today tho. Maybe it’ll help.",
      "author": "Hopefulaccount7987",
      "created": 1634042969,
      "upvotes": 3,
      "replies": {}
    },
    "hgcdn5q": {
      "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hgcdn5q/",
      "text": "Worrying about the job and housing market is a waste of time. \n\nIf they are going to tank, they are going to tank. I'm sure the assholes of reddit will crawl out of the greasy woodwork to tell me I'm wrong to suggest buying a fucking house anyways. You don't know when it'll crash or even if it will. Waiting won't do you any good. If you want a house, go buy one. \n\nI think there's a certain level of misunderstanding about it with the younger generations too. It's not that expensive unless you're trying to live like your parents. You have to buy what you can afford. Generally, it's a lot easier with 2 peoples incomes. \n\nI seriously think the young generations are completely convinced that it's IMPOSSIBLE to buy a house. Reddit seems to keep that idea flowing real hard through here. It's just not true. Yeah, you're not going to buy a house in fucking California. But uh... there's a shit ton of other states out there. \n\nI bought a house for 150k and the monthly payment, which includes escrow, is only 20 bucks more than what I was paying to rent a much smaller house. We moved to a tiny ass little town about 45 minutes from the city. You're telling me that college graduates can't afford 900 dollars in a house payment a month? That's fucking bull shit. \n\nI've always felt kind of confused about the view on housing around here. All the headlines make it seem impossible when it isn't. The news is all bullshit anyways. Get out there and figure it out yourself. Definitely don't rely on reddit for good advice. It's still just another shitty social media platform with it's on set of VERY LEFT LEANING flaws. \n\nIf you don't realize how far left Reddit leans... you need to do research!",
      "author": "Awkward_Mail_2786",
      "created": 1634039229,
      "upvotes": 1,
      "replies": {}
    },
    "hgbcrqg": {
      "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hgbcrqg/",
      "text": "The housing market will crash eventually, although it sucks staying in an apartment for too long since your money isn’t going into an asset",
      "author": "Jaxsoy",
      "created": 1634010839,
      "upvotes": 1,
      "replies": {}
    },
    "hgcx47p": {
      "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hgcx47p/",
      "text": "26 year old sophomore here and yes it gets boring. The only thing keeping me going is that I get paid to go to college. Kinda hard to give up when I got $7,200 in my pocket this semester lol.",
      "author": "Ph03n1x_5",
      "created": 1634049351,
      "upvotes": 1,
      "replies": {}
    },
    "hge3jk8": {
      "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hge3jk8/",
      "text": "With the job market and housing market the way it is, you will be better prepared if you have a degree. That's the point. Look at statistics for bachelor holders vs high school grads. The bachelors will help. It won't be as bad as your imagining, you'll find your way. We all do.",
      "author": "orangesNH",
      "created": 1634066824,
      "upvotes": 1,
      "replies": {}
    },
    "hgegjsi": {
      "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hgegjsi/",
      "text": "Every year has been more and more \"what's the point\" for me. Very strongly considering changing majors, but I'm terrified of giving up a higher probability of a good stable job that I'm realizing I would probably hate for something that's constantly at risk and pays far less (Leaving CS for music education)",
      "author": "BecomingCass",
      "created": 1634072099,
      "upvotes": 1,
      "replies": {}
    },
    "hgbvktg": {
      "link": "/r/college/comments/q6b8fk/anyone_else_losing_their_purpose/hgbvktg/",
      "text": "I believe this is a normal feeling for all fine arts majors",
      "author": "Turtleisim",
      "created": 1634024074,
      "upvotes": 0,
      "replies": {}
    }
  }
}