{"sid": "pvtsiy", "link": "/r/college/comments/pvtsiy/does_anyone_ever_get_pregnant_in_college_and/", "title:": "Does anyone ever get pregnant in college and actually finish? Just a random question", "text": "I have kids but I had them way before I started school. I have 5 classes left for my associates and a couple years of school after that. Has anyone ever gotten pregnant in school? Or know anyone? How does that work out? Curious what the difference is. I’m sure it’s a lot harder than having kids beforehand. I’m also curious if they finish school provided they’re determined and whatnot.", "author": "Coffeeislife1119", "created": 1632662733, "retrieved": 1632945959, "over_18": false, "upvotes": 1, "upvote_ratio": 0.66, "comments": {"heqv7ow": {"link": "/r/college/comments/pvtsiy/does_anyone_ever_get_pregnant_in_college_and/heqv7ow/", "text": "Not done yet, but I started classes back after the birth of my daughter.\n\nI had to take an incomplete the semester she was born because my mental health took a very sharp, sudden nosedive.  I started back the semester after.\n\nI'm now in my second semester after her birth and it's... Rough.  I got used to online classes where I could learn at my own pace, but online classes and my degree don't mesh very well haha (lotta lab classes).  I don't have time except for when I'm on campus to fully focus on school work, which on Mondays and Fridays is great (last class on those days end at 11:50 and I have until 3:20 to work on stuff) but other days like Tuesday I'll have ~2 hours maximum to work on stuff.\n\nThe only thing holding me back from stopping pre-cal 2 rn is money.  Thankfully though if I fail I can retake it either at the cc I used to go to *or* try again here.\n\nBut the time we all get home, it's time for dinner, a bath, and nighttime routine.  I could *theoretically* stay up longer but I barely can function with the sleep I have now lol.\n\nI think a lot of it has to do with the support you get from others in your life and having daycare available.", "author": "BenignRaccoon", "created": 1632936142, "upvotes": 1}, "hef126n": {"link": "/r/college/comments/pvtsiy/does_anyone_ever_get_pregnant_in_college_and/hef126n/", "text": "Eh I got pregnant towards the end of my associates degree. I got pregnant mid-fall semester finished it but had really bad morning sickness and would have to leave class frequently to be sick. I could barely drive. The Spring semester was better, I was very pregnant. I finished that semester in May and had my baby in June. I needed one more class (4 credit) for the associate's so I went back in the fall while baby was very little. \n\nI took a year and a half off. I returned in the summer right before my baby turned 2. I am now almost a senior and she is 2. It's doable but very hard if you have a young child.\n\nWould like to add that going back full time, involved having to enroll my daughter in daycare. I take her to and from school each day and do all my classes while she is there. I pick her up and spend several hours on our dinner/nighttime routine and once she is asleep, I do homework, chores, shower ect. Her dad takes her for most of the weekends too.", "author": "Victorian_Era2", "created": 1632703996, "upvotes": 1}, "hecogpw": {"link": "/r/college/comments/pvtsiy/does_anyone_ever_get_pregnant_in_college_and/hecogpw/", "text": "I have had students get pregnant while in college. \n\nLike anything else related to student success it is a mixed bag.\n\nSome life experiences change your mind about where you want to go and why (or when).  \n\nSome people who are borderline functioning or just keeping it together can't handle the added issues.\n\nSome thrive .\n\n\nIt also depends on the pregnancy and the health of the baby and mother after.", "author": "TheRightSideOfDumb", "created": 1632667629, "upvotes": 3}, "hecjmim": {"link": "/r/college/comments/pvtsiy/does_anyone_ever_get_pregnant_in_college_and/hecjmim/", "text": "I know someone who did this. It was her 5th child, but it seemed that she had how to handle everything planned out before she even signed up for her degree program. I suspect an \"oops\" baby would be much harder to handle, as would being a first time mom. \n\nShe was also 30, in a master's program, and in a stable, healthy, marriage, which I'm sure also helped. \n\nAs far as I'm aware, she graduated in a reasonable amount of time with good grades. Even with all the planning, I'm not sure how she managed, especially with 5 kids at home, but the point is that someone has done it and succeeded.", "author": "HumanDrinkingTea", "created": 1632665437, "upvotes": 2}, "hecf8yu": {"link": "/r/college/comments/pvtsiy/does_anyone_ever_get_pregnant_in_college_and/hecf8yu/", "text": "Yea I know people who have gotten pregnant and finished school, I personally have not. Those individuals did have incredible support systems in their life who could help them raise their child while they were also going to school. Most of the individuals I knew did take a semester off around the time they were due, because they needed time off at home with the baby the first few weeks", "author": "Concerned-23", "created": 1632663408, "upvotes": 2}}}