{
  "sid": "qi5aay",
  "link": "/r/college/comments/qi5aay/whats_the_point_of_gen_eds_money/",
  "title:": "What's the point of gen Ed's? Money?",
  "text": "I can see taking high school math to make sure you can at least do 12th grade math and English. I'm in college going for infomation technology and why do I need calculus in engineering? Also, why do I need to take history? Wasn't high school the point of being well arounded?",
  "author": "MechanicExtension565",
  "created": 1635484142,
  "updated": 1635779905,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.29,
  "comments": {
    "hih8rtl": {
      "link": "/r/college/comments/qi5aay/whats_the_point_of_gen_eds_money/hih8rtl/",
      "text": "1) Not every high school teaches to the same standards\n\n2) College standards for writing, math, etc are higher than they are in high school.\n\n3) Well rounded professionals are better at their jobs than people who only know how to do whats in the job description. It makes the difference between being the guy who has been fixing computers for 20 yeats and the guy who gets promotions and manages the computer fixers\n\nedit: just noticed you asked why you need calculus in engineering, thats like asking why you need to know your abcs to write",
      "author": "RevolutionaryLeave77",
      "created": 1635485035,
      "upvotes": 15,
      "replies": {}
    },
    "hihh78z": {
      "link": "/r/college/comments/qi5aay/whats_the_point_of_gen_eds_money/hihh78z/",
      "text": "There are sometimes a few required gen eds or subjects that make you think when you would ever need it, but for the most part they're made to give you at least a little knowledge in other fields that you don't plan to major in. It's not a good thing to be extremely knowledgeable about one subject and one area only. \n\nBeing well rounded and having a base level knowledge of things like basic science, maths, social science, humanities etc. is important. Also English because no matter what field you go into, you're going to have to know how to communicate effectively. \n\nAs for high school, not every school's curriculum is strong or diverse enough to even give you that level of basic knowledge. College has people from all sorts of backgrounds and gen eds try to set everyone on the same level before they venture into their own majors. \n\nAs for the calculus as an engineering major thing, I hope that was a joke.",
      "author": "NoDryHands",
      "created": 1635491465,
      "upvotes": 1,
      "replies": {
        "hii71nt": {
          "link": "/r/college/comments/qi5aay/whats_the_point_of_gen_eds_money/hii71nt/",
          "text": "No I'm going for infomation technology. I'll have to take it at one point",
          "author": "MechanicExtension565",
          "created": 1635511035,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hikhas3": {
      "link": "/r/college/comments/qi5aay/whats_the_point_of_gen_eds_money/hikhas3/",
      "text": ">why do I need calculus in engineering\n\nEverything I've been doing in engineering is based on calculus to some degree. It's how a lot of the equations are derived. I think it comes up in CS circles a lot too, but I could be wrong there.",
      "author": "NinjaLorian",
      "created": 1635544481,
      "upvotes": 1,
      "replies": {}
    },
    "hih9ele": {
      "link": "/r/college/comments/qi5aay/whats_the_point_of_gen_eds_money/hih9ele/",
      "text": "Gen Ed’s are 1000009% done for money. Waste of time and brain power for the most part. If you go into a college with your major you shouldn’t be required to waste your time in psychology or political science but if it keeps you an extra year/semester it’s more cash for them",
      "author": "harry01772",
      "created": 1635485483,
      "upvotes": -6,
      "replies": {
        "hihm73y": {
          "link": "/r/college/comments/qi5aay/whats_the_point_of_gen_eds_money/hihm73y/",
          "text": "Man is being downvoted but he’s right lmao. Unless you graduated high school without learning anything the classes are definitely useless",
          "author": "evasiveshag",
          "created": 1635495805,
          "upvotes": -3,
          "replies": {}
        }
      }
    }
  }
}