{"sid": "bdwvpk", "link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/", "title:": "Professor raised a concern that I might have plagiarized my last paper", "text": "In one my classes (I don't want to risk someone from her looking back in my post history to figure out it's me so I won't say the subject but I will say it's a gen ed class) we recently had to write a research paper. We picked the topic and had to make a at minimum 5 page paper using 4 sources (1 having to be a psychical book) that we found. \n\nThe papers were assigned at the beginning of the semester and we were allowed to resubmit the paper to get a better grade (if we chose). Last week on Monday I submitted my copy of the paper to see what my professor thought and to see what needed to be worked on it. He handed back papers yesterday (Monday the 15th) and asked me to stay after class to talk with him, I am doing well in the class (B/A or 3.5) so I didn't think anything of it and that maybe he just wanted to discuss a critique in person to get his point across. \n\nHe handed me my paper and said \"the language and style you used in this paper is not something I normally see out of a college student, like this wasn't typed out by a person if you know what I mean, it doesn't feel or look right to me, I am not going to jump to any conclusions but my two thoughts are either you plagiarized this paper or your a really above average writer.\" I was shocked, speechless actually. Some backstory (if this helps at all) I wrote a another paper for the same class and professor earlier in the semester and got a 4.0 on it, same language of writing, same style of writing, same everything. \n\nHe gave me the paper back and said \"here, look it over and see what you can do to it, I don't really want to report you for plagiarism or give a 0 for this assignment.\"\n\nI took the paper back and took it home with me, stared at it and was just like \"what the fuck was that?\"\n\nI reviewed the paper for plagiarism on Grammarly and it came back with a 4% match, I am so confused now.\n\nWhat did my professor see that I didn't? Is my writing style really that \"odd\"\n\nI'd like to hear what you guys/gals think.", "author": "ImpulseDecider", "created": 1555436784, "retrieved": 1632947984, "over_18": false, "upvotes": 606, "upvote_ratio": 0.98, "comments": {"el4s8sg": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el4s8sg/", "text": "A little warning, if your submit a paper into turn it in and then resubmit it the entire paper will light up as plagiarized. It was this way a few months ago so I’m not sure if they’ve changed it but I just wanted to warn you becaus eave had friends get in trouble for a “plagiarized” paper when really they just submitted their paper twice.", "author": "kennadoops", "created": 1555533580, "upvotes": 2}, "el4rz0m": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el4rz0m/", "text": "English professor here. This is why I *never* accuse anyone of plagiarism unless I know I can prove it.  I'd simply tell the prof that you didn't plagiarize it; that you will be happy to show him examples of other essays you've written and turned into other classes (or elsewhere) that show equal competence; and that unless he can provide evidence of plagiarism, you expect to be graded on the quality of your work, not unfounded suspicion. If the response isn't satisfactory, take it to the chair of the dept. or the dean.", "author": "sporifix", "created": 1555533438, "upvotes": 2}, "el37m8i": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el37m8i/", "text": ">your a really above average writer.\"\n\nI'm not going to jump to any conclusions either, but I can *sea were their* getting at", "author": "cruisetheblues", "created": 1555492634, "upvotes": 0}, "el2yhny": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el2yhny/", "text": "Imagine requiring attention enough to make up a story about your professor literally not believing you’re such a good writer", "author": "hector19922", "created": 1555478971, "upvotes": 1}, "el2y9r5": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el2y9r5/", "text": "Please Please Pleaseeeee go meet with your professor in person to discuss this. Bring any evidence you have of early drafts, and be prepared to run it through the plagiarism detector. It sounds like he's a nice guy and he wants to give you a good grade. Do not resubmit it without speaking to him-- that's just asking to get a 0 and reported for academic dishonesty.", "author": "HighTechPanda", "created": 1555478725, "upvotes": 2}, "el2wezy": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el2wezy/", "text": "Coming from someone who has had this same thing happen to, I wouldn’t worry about it. He’s saying you’re a good enough writer that it stands out from everyone else. He’s not intending it as a compliment though, because he’s obviously suspicious. Stand by your work. Don’t dumb it down for the sake of him.\n\nIf I were you I’d meet with him one on one and just explain that’s how you write. Show him examples of your work in other classes.\n\nI’m an English major that has been writing for a really long time, so when I started taking college classes I had a professor outright accuse me of plagiarism and told me to rewrite it or get a zero.\n\nWhich is exactly what I didn’t do. Instead I gathered several examples of my other essays to show the quality of my work, as well as achievements I’ve received for writing contests and newspaper articles. I proved that that was my quality of work across the board and not some fluke because I plagiarized. \n\nBe proud of your work. Don’t self doubt because some professor thinks all the students they’re teaching are idiots.", "author": "whos_a_heretic_now", "created": 1555476845, "upvotes": 3}, "el2ug2n": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el2ug2n/", "text": "I am a professional writer.  I was accused of plagiarism back in 6th grade.  My teacher gave me an F saying there  is no way I at 11 years old could write that well.  This was back before the internet.  She told me I had to have cheated by copying a book.  I told her I had written it myself but she did not believe it. I was a good student who always worked hard and got As and this traumatized me.  She insisted I bring all the books I used to class.  After going to library to recheck them out, I could not get them as someone  else had them. I felt so guilty even though what she said was untrue.  I had no way to prove my innocence. I told her I could not get the books but that I had written it.  The bitch said ok, I’ll give you a B because the paper was torn crooked.  It made me feel like I had been robbed. \n\nI bet this professor suspects because your writing is better than everyone else.  So many people do just cut and paste from the internet. But if you did not, go talk to the professor.  \n\nThis happened to my husband as well.  He is now a professor himself.  But as an undergrad he was accused of it because his paper was so good that his teacher did not think a freshman could have written it. He told him if he did write it, it was the best paper by a freshman he ever read. \n\nAt least this guy believed him after talking to him and gave him an A plus. \n\nIf you go talk to him and show him your thought process how you came to your ideas and maybe show him other writing you have done then maybe he will be the type that believes you. Good luck.", "author": "mollymarie123", "created": 1555475021, "upvotes": 5}, "el2s6sd": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el2s6sd/", "text": "He's probably butthurt that he can't write as well as you.", "author": "Luminousdemiurge", "created": 1555473061, "upvotes": 0}, "el2re3r": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el2re3r/", "text": "No matter what you do, do not run it through Turnitin or other plagiarism checking sites like some are suggesting. This can cause it to be saved by the checking sites’ database and then when your professor goes to run it through similar or the same sites, it will come up as plagiarized since it already saved it when you ran it through.", "author": "gameheros", "created": 1555472396, "upvotes": 2}, "el2it9r": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el2it9r/", "text": "When I taught undergraduates, I had conversations with a few students to that effect.  For example, one time, it was because I knew one of my students translated an academic paper that was published in German.  Another time, it was because I knew the student did not write the paper but had her graduate student boyfriend (who I knew) write the paper. \n\nWe had a fairly sophisticated plagiarism detection software program where I taught.  Since about 2005, every student term paper for that department had been submitted and was compared against that.  We could also compare the papers to other papers that students in similar classes had submitted at all levels (undergraduate through graduate) at the universities who subscribed to that service.  \n\nGrammarly is not the software we used. The software (this was in 2011-2015, when I was teaching) was not flawless, however.  It yielded a lot of false positives because it used several different methods to detect patterns in writing based not only on linguistic congruity (basically, the degree to which a set of words are similar to another set of words, which is what Grammarly uses); but also analyzed the degree to which the word usage, style, and syntax were consistent throughout the paper, or varied.\n\nSo, for example, let's say you were a good student and you wrote 70% of your paper, but you got lazy and then paraphrased without citing a source and you were careful enough to change a minimally adequate number of words that there wasn't more than 20% similarity between your paraphrasing and the underlying source.  Our program would still detect the consequential change in your linguistic usage.  We could detect that fairly well.\n\nThis software was expensive, though it was pretty popular at the time and I know the company is still around.  It might be what your school is using, and it may be that your professor doesn't know how to interpret the results.  On the other hand, it may well also be that you're an above-average writer whose proficiency exceeds that of a typical undergraduate.\n\n(Note: in my experience, most undergraduates, if not all of them, are not very good writers.)\n\nMy advice to you is that if you did not cheat, to resubmit the paper as you initially wrote it and without changes.  You might relate to your professor that you are confused as to why he thought you were cheating, and explain to him how it was that you wrote the paper.  Another thing you might do is offer to submit the native format document with the original metadata that includes editing time, if there is any ongoing concern.\n\nMetadata in a document is important because good tech people can figure out the number of keystrokes that were involved in generating a document; it can itemize the document's changes at various stages of development based on auto-save functions; and it can show how long was spent, over how many days, working on the document (assuming you weren't copying and pasting your final draft into a new document).  Metadata can also trace a document to a specific device, and match up the keystrokes to a particular device, created by a particular user account, at a particular time.  This information, competently interpreted, is proof that you did the work yourself.", "author": "theoryofdoom", "created": 1555465924, "upvotes": 8}, "el2cpoh": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el2cpoh/", "text": "Obviously we don’t know what he saw, we didn’t read the paper nor do we know you. You are an above average writer and have surprised your professor. I believe that’s what you came to hear yeah?", "author": "degoes1221", "created": 1555461602, "upvotes": 1}, "el23656": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el23656/", "text": "You should meet with him as soon as possible to find out what the \"red flags\" are for him.  In that face to face meeting, you will either be able to convince him that you know and understand and can articulate the material to the standard you wrote in the paper and you will be fine, or you will figure out what the problems are and will have a chance to fix them before there is a big hassle.\n\nThere are other ways to breach academic honesty besides straight up copying.\n\nSometimes a decent student is a much better or worse writer than you gave them credit for, but not often, and if the vocabulary, level and depth of understanding, etc are not what you have so far demonstrated in class, it is usually because someone is not really doing their own thinking.   \n\nIf that is NOT what happened, the prof is being relatively chill about this (compared to the other options) so I would bet he would be open to meet you during office hours so you can figure out what is going on.", "author": "PersephoneIsNotHome", "created": 1555454481, "upvotes": 12}, "el1vr3a": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1vr3a/", "text": "[removed]", "author": null, "created": 1555449320, "upvotes": -3}, "el1v7xl": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1v7xl/", "text": "I'm surprised this isn't being discussed more, but seriously just schedule a meeting with your professor. Say \"Hey Prof. I didn't plagiarize this paper but could I meet with you sometime and we can discuss what parts of this seemed suspicious to you\". You then have an open-dialogue with the professor showing your willingness to learn and improve (assuming your professor at least had a legitimate concern and wasn't just out to get you) and you can then talk to them about ways to improve the paper so that - plagiarism aside - you can submit an even better paper. Worst case scenario your professor is being stupid and even if he decides you plagiarized for whatever reason then you don't have anything to worry about and can just appeal to the dean.", "author": null, "created": 1555448969, "upvotes": 48}, "el1up3b": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1up3b/", "text": "I don’t  know the size of the class, but if it is pretty large, your professor might not remember that previous paper.   Is the writing similar for both papers?  You could bring that paper along and meet with the professor to resubmit your paper. Show him your old paper and that could help him realize that you write that way. If you felt like it could help your argument, you could bring along papers you’ve written for other classes. It could be that he read a bunch of dreadful papers and then he read yours and the contrast seemed too great.", "author": "ILoveCreatures", "created": 1555448639, "upvotes": 3}, "el1svww": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1svww/", "text": "Check the fuck out of your citations. Offer examples of work from other classes.", "author": "poondi", "created": 1555447516, "upvotes": 2}, "el1oshl": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1oshl/", "text": "First of all, don't change the paper because then it looks like you did, in fact, plagiarize. Second, you should have a sincere talk with your professor about it. Tell him you swear you did not plagiarize it, and if you did, it was not at all on purpose. Explain how you ran it through Grammarly which said it was only a 4% match (you can even print a page with this out on it, if you think it will help; I would just to cover all my bases). Maybe even find other software to compare the Grammarly results with. If he doesn't believe you, then he'll run it through some software himself and see that there were no instances of plagiarism, and you will be absolutely fine. \n\nFrom your casual writing, your style definitely is not weird, but I am actually super curious to see a sample of your formal writing because I cannot imagine what he might be perceiving in your work. Of course, I am not going to ask you to post any papers or something, his concern just comes off as strange to me!", "author": null, "created": 1555445012, "upvotes": 26}, "el1ogqq": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1ogqq/", "text": "Do your works cited / works referenced pages contain everything you used during your research? \n\nI agree don’t change the paper but make sure you’re citing your sources", "author": "OnefortheMonkey", "created": 1555444821, "upvotes": 6}, "el1n8zp": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1n8zp/", "text": "Run it through turnitin and see the match. If it's low like grammarly show it to him and call it a day.", "author": "SalmonellaSushi", "created": 1555444120, "upvotes": 32}, "el1mq9f": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1mq9f/", "text": "The last thing I would do in this situation is to change the paper.", "author": "CyberArchimedes", "created": 1555443822, "upvotes": 49}, "el1m8wg": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1m8wg/", "text": "Even though he has no evidence for the plagiarism claims, I would run the paper by your campus writing center if you have access to one to double check that you've cited everything correctly just in case and then resubmit. Good luck!", "author": "rllyuncomfy", "created": 1555443545, "upvotes": 31}, "el1lmpd": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1lmpd/", "text": "you definitely didn’t do anything wrong and should just resubmit it because he can’t prove you plagiarized. if it’d make you feel more comfortable, you could go to him with writing samples from other essays you’ve written to prove that you just write in that style.", "author": "maxington420", "created": 1555443186, "upvotes": 9}, "el1jn3z": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1jn3z/", "text": "Send him the grammarly results and have him compare it to your last paper for proof.", "author": null, "created": 1555442038, "upvotes": 57}, "el1e2t3": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1e2t3/", "text": "It sounds like the professors thinks you plagiarised but doesn't have proof and gave you a chance to fix it if you did indeed plagiarise. \n\nIf you didn't- just resubmit the paper. The professor will probably run it through some tools and if they find nothing then you'll be fine. You can't get in trouble for plagiarism without proof.", "author": "chevybow", "created": 1555438714, "upvotes": 595}, "el1dwse": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1dwse/", "text": "He has absolutely no evidence to prove plagiarism. If you saw only a 4% similarity, then he as well can only prove a 4% similarity. That is not enough to be considered plagiarism. Therefore he has no evidence or proof or plagiarism.\nHim stating that he believes it is plagiarism simply because it was very well written is also not evidence of plagiarism. He has no proof of anything, his argument is completely invalid. So then when he gives you the 0, go to the Dean. You have proof of the percentage of plagiarism and you can explain that you received a 0 simply because your professor couldn’t believe you had the ability to write as well as you can. Stand up to the professor, that’s bullshit. Don’t waste time rewriting it only to conform to his unwarranted request.", "author": "Ducks-12", "created": 1555438617, "upvotes": 187}, "el1duzb": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1duzb/", "text": "[deleted]", "author": null, "created": 1555438584, "upvotes": 120}, "el1cla1": {"link": "/r/college/comments/bdwvpk/professor_raised_a_concern_that_i_might_have/el1cla1/", "text": "If you’re being sincere and you really did write the paper without outside help then turn it back in. You’ve done nothing wrong and you can bring it up to the dean.\n\nHe saw the original and said it needed work. You worked on it and now he says it’s too good. This is crazy to me.", "author": "YouMcFuckedup", "created": 1555437817, "upvotes": 264}}}