{
  "sid": "r2a75v",
  "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/",
  "title:": "Productive things to do over winter break?",
  "text": "Any ideas for boot camps, classes, etc.? I feel like I don’t want to waste my break.",
  "author": "uuufffu",
  "created": 1637885535,
  "updated": 1638206936,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hm4mzj0": {
      "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm4mzj0/",
      "text": "Senior chiming in, please just chill. The couple of weeks winter breaks lasts for are not long enough for you to get any significant experience. Recharge your batteries, vibe with friends, spend time with your family. Then charge into the next semester energized and ready to kick ass.",
      "author": "VeryStink",
      "created": 1637909079,
      "upvotes": 9,
      "replies": {}
    },
    "hm3ih61": {
      "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm3ih61/",
      "text": "Im doing an online winter course, but maybe you could do someone on like Coursera or EdX? Read a book? Start coding?",
      "author": "thatgirltag",
      "created": 1637886143,
      "upvotes": 4,
      "replies": {}
    },
    "hm57qsg": {
      "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm57qsg/",
      "text": "For the most part, I’m going to chill, but I’ll probably also study a little bit of coding and linear algebra to make my life easier next semester.",
      "author": "SussyVent",
      "created": 1637925965,
      "upvotes": 4,
      "replies": {}
    },
    "hm40ijl": {
      "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm40ijl/",
      "text": "Try starting a hobby that relates to the subject you're studying. For me, I make soap and draw reaction trees to help me better understand organic chemistry. If you're studying engineering, try getting into robotics or structure building from legos or toothpicks. If you're into biology, try indoor gardening with small plants like aloe vera that are easy to handle, or bonsai trees! They may not seem like much, but being \"productive\" over break shouldn't feel like work. If it does, you'll exhaust yourself before the spring semester even starts. If you learn in an enjoyable or relaxing way however, you'll likely start ahead of the curve feeling refreshed and ready to go!",
      "author": "LeapingSalmonCB",
      "created": 1637895664,
      "upvotes": 3,
      "replies": {}
    },
    "hm3j3cd": {
      "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm3j3cd/",
      "text": "Get your textbooks early and start reading them. I did that with one of my lit classes and it saved me so much time to just skim over the books again than it would have to stress read some of them and try to retain while taking other classes.      \n  \n\nTalk to people who have already taken your Spring classes and see if they have the syllabus (or ask the prof if you can get a copy of the current one).",
      "author": "Oplatki",
      "created": 1637886482,
      "upvotes": 2,
      "replies": {
        "hm3odhl": {
          "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm3odhl/",
          "text": "This a way to get As imo. What I did over the summer was look at the syllabus for my courses and figured out what to study. Found YouTube lectures and guides and spent about 4 weeks “loosely” studying them. Once the semester began I had about a “2 month” advantage in two science courses and the material was way easier to grasp. I’m already studying for next semester because I have this semester in the bag with 3 weeks left.\n\nYou really don’t have to study but the key is to be productive. Maybe you want to lose weight or get in shape? It’s a good time to build good habits!",
          "author": "kyeelee",
          "created": 1637889267,
          "upvotes": 3,
          "replies": {
            "hm3xoai": {
              "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm3xoai/",
              "text": "Great advice. I did this with my math and accounting classes.",
              "author": "Royal-Progress",
              "created": 1637894165,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hm49iyd": {
      "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm49iyd/",
      "text": "Reading ahead on my math class",
      "author": "Normal_Flan_1269",
      "created": 1637900572,
      "upvotes": 1,
      "replies": {}
    },
    "hm4wagl": {
      "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm4wagl/",
      "text": "chill esp if ur in the quarter system..there isn’t much of a break until summer and burn out is very real",
      "author": "card-master-101",
      "created": 1637916097,
      "upvotes": 1,
      "replies": {}
    },
    "hm7r7mo": {
      "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm7r7mo/",
      "text": "No matter what field you're studying in, learning to code will always be beneficial.",
      "author": "NoDryHands",
      "created": 1637971965,
      "upvotes": 1,
      "replies": {}
    },
    "hm3i6rf": {
      "link": "/r/college/comments/r2a75v/productive_things_to_do_over_winter_break/hm3i6rf/",
      "text": "Read some good nonfiction. Check out these [book recommendations](https://books.wonkedition.com)\n- r/NewsForTeens",
      "author": "WONKedition",
      "created": 1637885991,
      "upvotes": 0,
      "replies": {}
    }
  }
}