{
  "sid": "pu8a5x",
  "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/",
  "title:": "Girlfriend just barely failed a class final; class condition caused failed class (TLDR @ bottom).",
  "text": "As the title says, my gf failed a written final exam; but just barely. The class condition is she has to pass the final (though her final grade would be a 78% if that wasn’t the condition). I feel really bad for her cause this program is something she’s waited years for (waiting list) getting into and she’s gonna have issues with her second term cause this one class. \n\nI wanna send a message to her professor and ask them about any grace/leeway he could have but I’m worried it’ll make her look bad or may be considered unprofessional. I’ve always been professional and charismatic so I’m certain I could get to this professor and have him come up with some options for her that won’t jeopardize her from moving on. But like I said I’m concerned about how it’d look on her, considering this is her battle with her class and her professor doesn’t know me.\n\nWhat do you think redditors?\n\nTLDR: girlfriend failed class and I wanna talk to her teacher about accommodations for her, is it a bad idea?",
  "author": "vinni8989",
  "created": 1632442709,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.25,
  "comments": {
    "he1guph": {
      "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he1guph/",
      "text": "Professors do not like it when the students themselves come groveling for a grade change. It is far, far worse when someone who isn't the student does the groveling on their behalf. Do not do this.",
      "author": "patrdesch",
      "created": 1632448641,
      "upvotes": 8,
      "replies": {}
    },
    "he184ht": {
      "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he184ht/",
      "text": "Bad idea, if it was a big problem she can be a big girl and bring it up to the professor herself. It basically make her and you look bad and like someone in the comments said it's essentially a FERPA violation so don't even expect an answer.\n\nAlso it's not like she didn't know the importance of the exam. It seems like that is a day one syllabus review item so the ability for grace/leeway is probably zero (I've had that experience with several classes and it was very clear from the professor point of view.)",
      "author": "safespace999",
      "created": 1632444492,
      "upvotes": 5,
      "replies": {}
    },
    "he16hoc": {
      "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he16hoc/",
      "text": "Holy smokes! What is wrong with you? Emailing your gf's professor? Are you out of your mind? What next? Contact professor's mother? Honestly, if I were your GF, and you suggested/did this, I would probably dump you.",
      "author": "Nyquil_Jornan",
      "created": 1632443718,
      "upvotes": 7,
      "replies": {
        "he16sz5": {
          "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he16sz5/",
          "text": "Hahaha okay now. No need to be rude, thanks for sharing that it’s a bad idea.",
          "author": "vinni8989",
          "created": 1632443869,
          "upvotes": 5,
          "replies": {}
        },
        "he18yz3": {
          "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he18yz3/",
          "text": "What is wrong with you? Telling off and being mean to someone on Reddit just because they asked for a piece of advice on what to do? What next? Meet them in real life and kill them? Honestly, if I were OP, and you suggested/did this, I would probably report then block you. Why did you fail to present your point of view in a civilized way literally like everyone else who commented?",
          "author": "MedS03",
          "created": 1632444891,
          "upvotes": 1,
          "replies": {
            "he1h483": {
              "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he1h483/",
              "text": "Because if you even considered emailing your gf's Prof, you really have some issues to deal with. First, why you think you need to step in for your GF, who is capable of handling this herself. Second, it is wildly inappropriate to contact the Prof. This, if the OP would have decided to do it, would go way beyond normal behavior. It is necessary to emphasize that.",
              "author": "Nyquil_Jornan",
              "created": 1632448771,
              "upvotes": 1,
              "replies": {
                "he1j8h8": {
                  "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he1j8h8/",
                  "text": "I never ever said that it was a good idea and neither do I disagree with you that it is a bad idea, in fact, it is a really terrible one. What I do disagree with you on is how you presented that opinion. You could be completely against it but at the same time still be polite (look at other comments) they said that it is TOTALLY not okay but didn’t attack OP. I am not defending OP as I don’t know him but I don’t understand people who are so mean for no reason whatsoever, it is just as if they are like “a chance to be mean? I cannot miss it!”.",
                  "author": "MedS03",
                  "created": 1632449792,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "he151oy": {
      "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he151oy/",
      "text": "[deleted]",
      "author": null,
      "created": 1632443026,
      "upvotes": 18,
      "replies": {
        "he15mbv": {
          "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he15mbv/",
          "text": "Absolutely! And for OP who is Canadian, we don’t have FERPA but we have similar provincial acts e.g. freedom of information and protection of privacy act (FIPPA).",
          "author": "InsulinBlue",
          "created": 1632443304,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "he15073": {
      "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he15073/",
      "text": "Absolutely DO not email on her behalf. It’s college, your girlfriend is expected to be adult enough to be able to send an email on her own if she feels its necessary. Sending one on her behalf would not make a good case for how she is able to handle the program. You could help draft a letter with her, or help her find different strategies for studying and different supplementary resources for learning for her next attempt at the course but omg please don’t email for her.",
      "author": "InsulinBlue",
      "created": 1632443007,
      "upvotes": 16,
      "replies": {
        "he161o8": {
          "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he161o8/",
          "text": "Yeah I agree, I feel like it’s a really bad idea so I figured I’d see the opinions of others. She emailed him and he wouldn’t go forward with any informal appeals and said to go straight with a formal appeal to the head. He doesn’t seem to wanna give any leeway. I just hate to see her like this and I’m trying to come up with solutions for her. \n\nI’ve had professors work with me on failed exams in the past and I’m not sure why this ones being difficult. For context she is the type of person to put lots of effort into her work and shows hunger to learn.",
          "author": "vinni8989",
          "created": 1632443505,
          "upvotes": 0,
          "replies": {
            "he16zpx": {
              "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he16zpx/",
              "text": "I hear you and I know that’s tough and it’s sweet you want to help. But the problem is when it comes to a final, it’s too late to be asking the professor what can be done. If there were struggles, she has to reach out early not at the end. If there was something unfair or unpredictable about the exam then the profs advice is the best one honestly and she needs to take it to the head of the program. Its likely not even within his power once final grades are submitted. I am sure she is great and she will do well, and one set back wont change that. If she has to retake it, its an opportunity to come in prepared and fill in the gaps and ace the final. Just be there for her like you’re doing (:",
              "author": "InsulinBlue",
              "created": 1632443959,
              "upvotes": 3,
              "replies": {
                "he17pgd": {
                  "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he17pgd/",
                  "text": "Yes that’s what I mean though, she had a great average going into the final (89) but got a 44 on her final. From my view that’s why I feel like there has to be something the Professor can do but I definitely understand what you’re saying. \n\nThanks for your kind words! I’ll just be there to support her and encourage her; and if she needs, give her advice :)",
                  "author": "vinni8989",
                  "created": 1632444295,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "he14vt3": {
      "link": "/r/college/comments/pu8a5x/girlfriend_just_barely_failed_a_class_final_class/he14vt3/",
      "text": "Do not message your girlfriend's professor. That is the worst thing you could do. \n\nIf something needs to be done, she needs to talk to them herself and see if there's anything she can do. They will not take either of you seriously if you reach out for her, and professors are not allowed to talk about their students to anyone but that student. \n\nIt's also possible that the professor could tell others about it and that will look bad on her for all time.",
      "author": "dyorknine",
      "created": 1632442948,
      "upvotes": 37,
      "replies": {}
    }
  },
  "updated": 1634050716
}