{"sid": "pr1ccy", "link": "/r/college/comments/pr1ccy/i_never_go_to_parties_or_hang_out_with_people_and/", "title:": "I never go to parties or hang out with people and it’s the worst", "text": "I’m a freshman in my schools marching band, and they are very inclusive and want everyone to have fun and feel included in the environment. I love everyone in the band and I really enjoy making memories with them. Every weekend, the whole band goes to a party on friday and they always have so much fun. I’ve lied my way out and opted out of going to these parties because I get so nervous in that kind of environment, I don’t know why. People are confused why I never show up to these parties because I am very outgoing within the classroom. It’s frustrating because people are having great times, wishing for me to be there, when I’m in my dorm knowing I should’ve gone to the party. Do you guys have any advice for people in my kind of situation?", "author": "hUeHuEhUeHuEhUeHu3", "created": 1632026012, "retrieved": 1632801504, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"hdgnq1d": {"link": "/r/college/comments/pr1ccy/i_never_go_to_parties_or_hang_out_with_people_and/hdgnq1d/", "text": "Just go at least one time. If you don't like it, you can leave after a little while and there's nothing wrong with that. I was at party on Friday (I even knew a decent amount of people there), and after about an hour or so, me and a friend weren't vibing with it and decided to leave. She's not a party person and neither am I, but we didn't regret going. Right now it seems you already regret not going, so what do you really have to lose by going? Just stay safe there and don't make stupid decisions.", "author": "Irish-kimchi", "created": 1632059395, "upvotes": 1}, "hdflyfu": {"link": "/r/college/comments/pr1ccy/i_never_go_to_parties_or_hang_out_with_people_and/hdflyfu/", "text": "It’s entirely valid to not go to parties. I’ve never been to a college party and feel my social life is no less vibrant for it.\n\nThere’s so much stuff you never have to worry about (or have to worry about less) if you DONT go to college parties, such as: the legal, social, health, and/or moral ramifications of drunk driving, underage drinking, over drinking, hookups, drugs, vandalism, exposure to covid and god knows what other diseases, taking care of drunk friends, and general rowdiness \n\n\nNot saying that all of these things happen at all college parties, but they happen at some and you never know until you leave the party what’s going to happen at it.", "author": "Robot_Biologist", "created": 1632032723, "upvotes": 1}, "hdfkl1a": {"link": "/r/college/comments/pr1ccy/i_never_go_to_parties_or_hang_out_with_people_and/hdfkl1a/", "text": "Easiest way is most likely to go with a friend you know in there. Another option is to suck it up and go there yourself.", "author": "Good_Guy13", "created": 1632031710, "upvotes": 1}, "hdfev8r": {"link": "/r/college/comments/pr1ccy/i_never_go_to_parties_or_hang_out_with_people_and/hdfev8r/", "text": "Just wondering which college you attend, I am also in the marching band", "author": "Either_Barracuda8755", "created": 1632027918, "upvotes": 1}, "hdfe9ra": {"link": "/r/college/comments/pr1ccy/i_never_go_to_parties_or_hang_out_with_people_and/hdfe9ra/", "text": "Make yourself go. Tell yourself if you don’t like it, you don’t have to go again, just try it! If you don’t want to drink, don’t drink. Just try it out. You’ll never know unless you try it :)", "author": "livonyote", "created": 1632027550, "upvotes": 2}}}