{
  "sid": "js8wb0",
  "link": "/r/college/comments/js8wb0/a_letter_to_professors/",
  "title:": "A letter to professors",
  "text": " \n\nDear college professors,             \n\n*We are doing our best*\n\nI know it may seem like we are slacking and not participating, but these last few months have been tough for all of us. Our school years were cut short, trips were cancelled, and we were *forced* inside all summer. As college students have all faced some sort of hardships during this time that need to be understood—and possibly given some compassion in how you deal with us.\n\nI am now a freshman in college, and it honestly does not feel like it. I sit at home all day, losing the motivation to do anything—especially school. I sit behind a camera and listen to...\n\n**Lecture after**\n\n**Lecture after**\n\n**Lecture...**\n\nIt is getting Exhausting\n\nIn high school, I was never one to procrastinate, but ***now*** it’s normal for me because home was always a place for relaxing, and limited learning. Online classes make me feel like I have all the time in the world to finish assignments, but then I get assigned even more homework in another class. At that point, I get stressed with all the work I have to do that *could* have been finished at an earlier time.\n\nThere are many distractions surrounding us at home and it is hard to block them out. Whether it be our family talking, our pets making noise, or just our minds wandering. It is not easy to keep one’s mind focused on a screen for a whole class period, the mind does start to wander.\n\nThere have been times where I am in a class and **BOOM** I completely blank and I start to think about other things and miss something important that the teacher was talking about. Yes, I had this problem in person-to-person classes too, but *never* as bad as I do now. Teachers are not there to get you back on track, so it is up to you to keep yourself engaged, which is hard when you are on a screen for most of your day and have little to no interaction with fellow classmates or teachers. \n\nTo help us stay engaged small group discussions often can help. This gives us time to talk to our peers we usually don’t get to and hearing other people’s comments can really help to understand a subject.\n\nThis little to no interaction with teachers and fellow classmates is difficult, but it is also hard because I was looking forward to making new friends during college, and now, it seems almost impossible. There’s no time for us to get to know each other, other than when we get put in a breakout room for no more than 20 minutes. Even then, I feel isolated. \n\nWhen you cannot make new friends due to not having the time to get to know each other, life becomes lonely. And loneliness has had a huge effect on my school year, forcing me to shut down at times because I do not know where to go for help when I need it, and I do not want to disturb my friends when they are going through the same things.\n\nWithout the interaction I’m used to, I find it hard to wake up in the morning knowing that I will have to stare at a screen for how many hours of homework I happen to get that night. I feel like my whole life is school now and there is no time for me. I know I am not the only one feeling this way. \n\nMy friends and I have talked about our experiences with online college and most of the opinions were *not* positive. Our lives have become the same routine everyday.\n\n# Wake up, get online, do homework. \n\n#                            Wake up, get online, do homework. \n\n#                                                     Wake up, get online, do homework. \n\nWith all of the screen time everyday that students have, you could give us breaks throughout the lecture and give us time to take a step back and breathe. Time away from the screen is important. \n\nFor me, school is easier to get through when you have friends that are there to help you. Since the start of the fall semester, I have not talked to many of my friends that I used to talk to everyday. \n\nPhysically being at school was *so* much easier because we knew that it was a place to focus and get work done. Now after a long school day, we just close our laptops and *pray* we make it through the semester.\n\nThis is a new experience for all of us. Most students were going to school in person before the pandemic started and now everything is different. It is hard to go through change so fast and sudden. We never expected a pandemic to derail our lives, but it has. \n\nTake the time to think of the way we are feeling and understand that many of us would rather be in person, just like you would.\n\nSincerely,\n\nA Stressed Student",
  "author": "ILoveCats924",
  "created": 1605104290,
  "over_18": false,
  "upvotes": 1923,
  "upvote_ratio": 0.96,
  "comments": {
    "gclz2ks": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gclz2ks/",
      "text": "I feel related here. Couldn't agree more.",
      "author": "RY_Charis",
      "created": 1605621802,
      "upvotes": 1,
      "replies": {}
    },
    "gc3n37q": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc3n37q/",
      "text": "Honestly, I think it is hard on both sides. I've had professors break down in class and have seen my class mates struggle. I did online community college through out most of high school but this seems to be a different monster. None of my teachers are trained in online learning and end up making it closer to onsite learning through zoom. This isn't healthy for either side so the current format is not the best. Some students don't have an appropriate place to turn their camera on in class and then the professors complain about us being lazy. Most of my classmates have never had to deal with online school before so it is a challenge. The professors aren't used to this  format and end up making waaaay harder than it needs to be. We need to understand each other more in this hard time and be more compassionate on both sides. I see this comment section becoming into an age war when it isn't. We all miss our friends and we are all anxious to go back on campus. Just don't start pointing fingers at each other on who's to blame and who's harder to deal with. I do agree that the homework needs to be a little easier for those who have not been online but I also agree that the students need to give their professors grace. Most of us have lost a family member to this pandemic and we are all grieving.  Just go easy on both sides and things will run more smoothly.",
      "author": null,
      "created": 1605224769,
      "upvotes": 1,
      "replies": {}
    },
    "gc166f4": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc166f4/",
      "text": "my school got rid of spring break but i just found out fall sem ends next week and spring sem doesnt start until february! thats so long! however its going to make spring sem seem stupid and unimportant and ill just be lounging around so like. probably gonna drop out. anyways yeah having to plod along really sucks and ive taken to helping homeschool my sisters just to interact with other people",
      "author": "Chrysomaline",
      "created": 1605175687,
      "upvotes": 2,
      "replies": {}
    },
    "gc0tyod": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0tyod/",
      "text": "As an instructor it always makes me really sad to hear things from my students like this.\n\nHonestly, it's a huge puzzle. What I'd be interested in would be your concrete suggestions for how to be better.\n\nHere's the puzzle:\n\nImagine you are instructing an 800-person intro to sociology lecture. \n\nYou have to give everyone a grade based on their mastery of the material. All of your policies have to be fair and will be used by try-hard students, students who are trying to game the system, depressed students, students who are working, students who have families and full time jobs. So you better make them fair. \n\nAlso, you have to manage 8 TAs, who have weekly sections.\n\nHow do you make people show up for section and actually interact with each other (and turn on their cameras)? \n\nHow do you have the TAs grade them? Based on participation? Do you force students to turn on their cameras? Do you make them do unsupervised breakout rooms? Do you have them all in a big conference call? One way to help them participate is to force them to turn on their cameras. That is considered cruel by many. Another way is to give them a pre-section assignment so they all show up prepared. But that's extra work (busywork)--the price for a better discussion. The payoff is that students get to talk to each other. \n\nHow do you do lectures? Live lectures are incredibly awkward. You're talking to an empty room of 800 squares. And if you mess up in some way you could be recorded and distributed on the internet as a meme. Plus managing the chat is difficult.\n\n Asynchronous lectures are boring for students and unmotivating to watch.\n\n... Do you upload slides? Well, if you upload slides with every word, they won't watch the lectures. They'll just use the search function when they need to, thus not learning the material.\n\nHow do you do exams? You can't stop cheating. Students create massive group chats and share answers. Do you make them open note? Now you have to write a tricky exam for students that's hard enough, easy to grade 800 of, and not easy to cheat on. Good luck.\n\nYour best bet in many cases is to just give more individual, un-cheatable assignments... But it's more work. And not just for the students--for you too, grading. And with extensions.\n\nPlus, how do you deal with it when a student misses an exam because of internet issues? Or because their family member dies? Or because they have to work? How strict are you?  If you're not strict at all/have no rules, you're making it demotivating to do the work. \n\n(And also, it's a royal pain to give extensions in a class over 20 people--you have to keep track of them, and remember them and enter them correctly. Good luck with your 800-person lecture). \n\nAnd if you're kind/lenient, what happens when it becomes a pattern? If a student misses 6/10 sections, do you grade them the same as other students who didn't? If a student doesn't do half their assignments because they're depressed, what grade do they deserve? (Which is to quantify their learning of the material). \n\nAlso, as others have mentioned, teaching isn't fun right now. I'm getting so many emails all the time, and they're all bad news. They have some issue with the class, or they need an extension with something. Almost all of my interactions with students are time consuming, and neutral or mildly unpleasant.\n\nPlus, we are dealing with the isolation too.  We all live in our rooms also. Many of the students have moved home. You are living with your families, near your friends. A lot of instructors are graduate students, or professors who aren't from here. They often have very few friends, and no family nearby. Plus, we are supporting ourselves. Many have children too. Grad students are instructors, students, AND research slaves. \n\nAnd... it's a lot of work to plan a class, and make the above decisions. Plus, to write tests. Plus, to be familiar with the material well enough to teach. Teaching a class (especially for the first few times) is about the same amount of work as taking 2-3 classes. You are responsible for all the deadlines and assignments (you have to do them to design/explain/grade them). You have to answer to a lot more people.\n\nBut the hardest part is the emotional labor to show up, and deal with students. Not only do we have to make these decisions, but we are expected to make material that's so engaging that it can compete with other things on your computer--that you'll want to do it over Netflix, or video games, or other content put out by massive corporations with huge budgets, huge teams, or at least (like tik tok) no educational material to bake into their entertainment.\n\nIt's not that teachers don't care. (Well, sometimes they dgaf, but that's not a coronavirus thing, that's a problem with the incentive structure for tenure... They're graded on their research, and their teaching is like small homework assignments).  \n\nIt's more that it's a truly difficult task, and we don't know how to deal with it better. But real suggestions are helpful.",
      "author": "fiftycamelsworth",
      "created": 1605166637,
      "upvotes": 3,
      "replies": {}
    },
    "gc0spou": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0spou/",
      "text": "It sounds like you’re having a harder time adjusting to college than to online school.\n\nWhat exactly gave me this impression is you saying that you procrastinate, then get assigned more work in a separate class and then wonder why your professors do not give you an extension on the initial work.\n\nUltimately it is not on your professors to motivate you, it is on you. Either do the work or don’t but it isn’t your professors job to pass you just because you prefer in person to online.",
      "author": null,
      "created": 1605165710,
      "upvotes": 2,
      "replies": {}
    },
    "gc0l26v": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0l26v/",
      "text": "As a college freshman, living the same way , I feel exactly the way you do :( solidarity",
      "author": "xwintercandyapplex",
      "created": 1605160760,
      "upvotes": 2,
      "replies": {}
    },
    "gc07t9q": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc07t9q/",
      "text": "im sure they know this. also, how are you lonely but then say your friends are going through the same things but refuse to get closer with them? if you're all lonely that would be a good step to feeling a tad bit better",
      "author": "zarnonymous",
      "created": 1605152708,
      "upvotes": 1,
      "replies": {}
    },
    "gc07f7q": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc07f7q/",
      "text": "As a senior, the burnout is absolutely real. I don’t even want to do a spring semester because I know I’ll have no motivation to finish it out.",
      "author": "NaranjaEclipse",
      "created": 1605152472,
      "upvotes": 2,
      "replies": {}
    },
    "gc04xap": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc04xap/",
      "text": "This is my last semester of college. I've worked full time for the last two years while in college full time. I've never really had free time but before things went online, I felt more motivated to do my homework. I was able to push myself to work on homework and study from the minute I got home to the minute I went to bed. \n\nI haven't been able to do that since everything went online. I'm struggling to force myself to work on assignments. I understand senioritis is a thing, but it feels like there's no point right now because we're alone and overwhelmed.",
      "author": "Cat_Panda_Canda",
      "created": 1605150981,
      "upvotes": 1,
      "replies": {}
    },
    "gc03tlb": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc03tlb/",
      "text": "When I was 19, I was at war. Zero Pity from me.",
      "author": "CrazyHorse_CFH",
      "created": 1605150336,
      "upvotes": -1,
      "replies": {
        "gc1l5p3": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc1l5p3/",
          "text": "Were you conscripted, or did you join the military voluntarily?",
          "author": "Carnot_Efficiency",
          "created": 1605188773,
          "upvotes": 1,
          "replies": {
            "gc2uu99": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc2uu99/",
              "text": "Volunteer",
              "author": "CrazyHorse_CFH",
              "created": 1605210606,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gc02uj1": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc02uj1/",
      "text": "My school announced that there will be no spring break this year to “discourage” traveling. Not all college students are 18-20ish. My kids still get their thanksgiving break and I would like to actually spend time with them, even if it’s at home 😭",
      "author": "meowdeline420",
      "created": 1605149778,
      "upvotes": 5,
      "replies": {}
    },
    "gc02fkw": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc02fkw/",
      "text": "A lot of us have work still also so it’s like more time to study, more lectures, then working. Honestly there isn’t really a day that I just feel okay. It’s like constantly feeling behind or discontent.",
      "author": "ThatWhiteBoah",
      "created": 1605149537,
      "upvotes": 3,
      "replies": {}
    },
    "gc02fkd": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc02fkd/",
      "text": "Same situation with professors. We don’t write open letters. Let me elaborate and give you a real life scenario.\n\nWaking up to kids unexpectedly crying, or maybe parents who need medical attention, have to drive to pharmacies to pick up meds. Kids getting sick/needing shots/ etc.\n\nOk, you ran and handled kids needs, but now you have to skip breakfast, ok just coffee, fuck coffee no time, prepare mic and laptop ASAP, lecture, answer emails, grade homework, write/revise research proposals, online office h, update lecture materials, answer colleagues emails, zoom meeting with student, zoom meeting with department head or admin, zoom meeting with program officer, screen applicants, zoom meeting with undergrad committee A B C D, international zoom meeting with collaborators, zoom meeting with conference organizers. Review grants, review peer-reviewed papers.\n\nLearn this new online platform that the department proposes to use, learn how to use another platform that your colleague prefers to use. Switch from Microsoft to Google to Apple accounts and whatever the fuck the Univ decided to use within several min. Meanwhile got emails from impatient students “did you get my email my dear servant professor?” “I’m submitting a regrade request because I deserve partial credit and I know how to grade my exam better than you do”\n\nAs you make the plan to Write and revise academic papers, handle student complaints, ... then it hits you.\n\nOh, spouse is washing the dishes and changing the diapers, at least I have to cook lunch, and dinner, and kids want to play with you. Wait we are out of milk... pick up your phone, and got a text from dept head. Oh one student got corona, now you have to switch assignment and make it “not too stressful”. Oh one colleague also caught it, and potentially others, another zoom meeting to discuss worst case scenario. \nOh now conference can’t go but it’ll switch to online.\nHey new online platform to learn.\n\nThen as you tried to wind down, catch a quick rest, spouse said “I think I will have to quit my job/ our company is doing massive layoffs”\n\nAnd you sighed .. you also remembered that you haven’t showered or... (did I skip brushing my teeth? Did I shower yesterday? Do we still have enough toilet papers?).\n\nAnd you get an email. Your best friend/colleague, a non citizen, told you that his parents have passed away but he cannot go to visit because our case is the highest. By the time he finishes his quarantine his parents would have been buried. You are wondering .. how do I console him..saying nothing is the best perhaps but.. you can’t be there with him because he is in a state with the highest outbreak rate!!\n\nYou think students life is tough?? Are you that self-centered?? Sorry to say this, fuck your motivation. Just imagine that we are in the midst of another World War. People back then don’t think about losing motivation. We just need to think about how to SURVIVE this stupidity.\n\nDon’t get me wrong I understand but EVERYONE is suffering, greatly. And professor is not at the worst situation, doctors, nurses, grocery store workers, funeral workers are at a much worse situation. At least you don’t hear in the news that one professor is dying after another.\n\nEveryone is greatly suffering here because the leaders of this country have been grossly incompetent, and approx. half of the America wanted another 4 years of this.\n\nAnd to boldly said “liberate state X Y Z !!” , “open the country” “I think the science doesn’t know.” “We have to take back the country from doctors”.\n“Don’t let COVID dominate your life”\n\nHa? Like what Dave Chappelle said, with that mf getting on a chopper and receiving VIP treatments, it’s like you drive down to a homeless neighborhood, eating a juicy burger walking around and saying to homeless people “don’t let hunger dominates your life my people, nom nom nom”\n\nSorry for the long rant, but fuck this open letter, fuck the anti intellectual movements and please wake up.",
      "author": "chulala168",
      "created": 1605149537,
      "upvotes": 2,
      "replies": {
        "gc06fbl": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc06fbl/",
          "text": "As if college students are immune from real life? I had to bury my father this semester. Miss me with the gigantic chip on your shoulder.",
          "author": "survivorfan95",
          "created": 1605151867,
          "upvotes": 8,
          "replies": {
            "gc06pt8": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc06pt8/",
              "text": "Nobody said that college students are immune from real life. You think professors don’t have to bury their family members too? As I said, everyone is in the same boat. College students are in their early 20s. Stop whining for God’s sakes, learn together and try to help each other.",
              "author": "chulala168",
              "created": 1605152044,
              "upvotes": 3,
              "replies": {
                "gc07ch7": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc07ch7/",
                  "text": "I don’t know what being in my early 20s has to do with anything. I’m at the top of my class and bust my ass day in and day out; that’s what makes your comment seem all the more insulting. \n\nI, along with many of our peers, are working together to get through this semester, but it sometimes seems like an insurmountable task. I understand that we’re all humans and all deserve to be treated with complete decency, and I have had quite a few professors really step up to the plate. The ones who have not, however, have made the experience even harder than a “normal” semester, as not only are there normal college stressors, but also stressors of real life that some (notice I didn’t say all) instructors fail to take into account that are occurring on both ends of the Zoom meeting.\n\nI understand that profs don’t get nearly amount of credit they deserve, and there have been some awesome ones in my academic career.",
                  "author": "survivorfan95",
                  "created": 1605152426,
                  "upvotes": 4,
                  "replies": {
                    "gc080v3": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc080v3/",
                      "text": "As I said, if you want to apply the same standard, professors have seen some of the worst from their students. Nobody wakes up in the morning and say, “ I want to make my students suffer”. \nThe problem is that students treat their professors like customers treating a service provider like Comcast. Contrast that with how Asians treat their professors with respect, considering it a noble profession. The truth is, only a tiny fraction of your tuition goes to the professor. \n\nYou want a better quality of education? Eliminate the sports, and demand for transparency in the admins. Ask them to justify the salaries given to higher admins (not the lower ones) and football/sport coaches. \nIf you halve their salary (hey they don’t have to prepare and do online lectures, right?), the university can double the hiring and reduce the workload.\n\nImagine you own a grocery store, and you only hire one employee, he has to do the cashier, stocking, purchasing, delivery, cleaning up, handling angry customers, handing returns. Oh, and have meetings after meetings with suppliers and distributors. That is roughly the number of students per faculty, and most of them were asked to write grants to get federal and state money.\n\nOr to court the endowment people. People who are so endowed they want their names on the building. They want their names on your job title.",
                      "author": "chulala168",
                      "created": 1605152838,
                      "upvotes": 3,
                      "replies": {
                        "gc09czy": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc09czy/",
                          "text": "Maybe I’m missing your point, but I’m not quite sure what has to do with my points. I come from a big football school, though, and yes, I do agree that some of those funds need to be diverted to better salaries for those on the “front lines” so to speak.",
                          "author": "survivorfan95",
                          "created": 1605153656,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gc00rr6": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc00rr6/",
      "text": "It feels like I'm on my laptop all day every day, seven days a week with 16 units. I take some breaks, but the only times I've left my home since the quarter began were to get groceries and to go to the dentist, I've gone on a walk twice. I just want to cry all the time. Right now I'm just laying in bed with my laptop and homework next to me, taking a quick break. All I want to do is sleep.\n\nI was just now assigned a paper in one of my classes too, due Thanksgiving week.\n\nI'm also a new transfer, this is my first quarter at a new college and I just feel so alone. I get emails for random zoom events but I have no motivation to attend them because they're just more things to worry about.\n\nAn edit an hour later: I'm just mentally exhausted, my homework is tomorrow me's problem lol. 😔",
      "author": "Sunnyroses",
      "created": 1605148587,
      "upvotes": 12,
      "replies": {}
    },
    "gbzwg5h": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzwg5h/",
      "text": "This. This is exactly what I’ve been feeling and you put it to words, thank you so much.  I hope this moves some professors to a different type of action.",
      "author": "-MythicKnight-",
      "created": 1605146121,
      "upvotes": 1,
      "replies": {}
    },
    "gbzvqyw": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzvqyw/",
      "text": "I don't even do homework. At this point, I just wake up, go to class, play games, take a break to do some homework, and then play more games, rinse and repeat",
      "author": "Daxmvarg",
      "created": 1605145732,
      "upvotes": 1,
      "replies": {}
    },
    "gbzqgoq": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzqgoq/",
      "text": "It especially hasn’t been better after I got Covid. I went from being forced to sit in a lightless room to being back at home since my parents didn’t want me to stay. I’ve spent some of the past few days just crying or barely able to get out of bed as the work from weeks before pile up . I’m trying my hardest but it still doesn’t feel like enough.",
      "author": "Wringl_-_-_",
      "created": 1605143169,
      "upvotes": 1,
      "replies": {}
    },
    "gbznqeg": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbznqeg/",
      "text": "Well I’m depressed and shit and have anxiety out the ass so I guess I am slacking but it’s not because I don’t care",
      "author": "KING_COVID",
      "created": 1605141792,
      "upvotes": 0,
      "replies": {}
    },
    "gbzg9yc": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzg9yc/",
      "text": "I am not crying your crying",
      "author": "That_Type_Of_Guy399",
      "created": 1605137772,
      "upvotes": 1,
      "replies": {}
    },
    "gbza6v4": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbza6v4/",
      "text": "I was hospitalized for poor mental health and my professors were NOT understanding or helpful",
      "author": "ka-it-",
      "created": 1605134501,
      "upvotes": 6,
      "replies": {}
    },
    "gbz3uu0": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz3uu0/",
      "text": "I have a stupid research paper to write and we literally need scholarly sources which which aren’t free. When told to go to the library, I told my English professor “you do know the library is shut down right?” Because our school is back on lockdown after over 500 on campus cases.",
      "author": "RogueApollo01",
      "created": 1605131125,
      "upvotes": -4,
      "replies": {
        "gbz711m": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz711m/",
          "text": "Librarian here (though probably not your librarian). Your physical library building might be closed, but your library provides access to scholarly articles and other resources online. Your library probably has a virtual way to get in touch with librarians, either through chat or email, where you can ask for help getting started with finding scholarly articles. Alternatively, you can connect Google Scholar to your library's holdings. This allows you to access full text articles you find because it will log you in through your university credentials. If you go to scholar.google.com, on the top left corner, look for the three lines. Click on those, and then click \"settings.\" From there, click on the \"library links\" tab. You'll get a search box, where you can type in the name of your college. You can then select your college from the list. Now you can research your topic and get access to many articles without hitting a paywall. Hope that helps!",
          "author": "badgersssss",
          "created": 1605132832,
          "upvotes": 15,
          "replies": {
            "gbz7frn": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz7frn/",
              "text": "Thank you so much! There wasn’t an alternative method provided in terms of explanation from my school or professor, so this really helps!",
              "author": "RogueApollo01",
              "created": 1605133049,
              "upvotes": 0,
              "replies": {
                "gbz95g9": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz95g9/",
                  "text": "You're welcome! I'm happy to answer any questions, though getting in touch with your school's librarians will be the most helpful since I don't know what resources you have. It's possible they are offering virtual appointments, have a chat service, or a way to get in touch over email so that they can answer your research questions. Good luck with your paper!",
                  "author": "badgersssss",
                  "created": 1605133952,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "gbzf1zu": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzf1zu/",
          "text": "Your professor is almost certainly telling you to use the library database which you should be able to access with your student # and other login credentials. If it's an English lit course, you might want to start with JSTOR.",
          "author": null,
          "created": 1605137092,
          "upvotes": 6,
          "replies": {
            "gbzfdlq": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzfdlq/",
              "text": "Uh, no. He told us to use physical resources, like, in no uncertain terms he told us to go to the library and use the actual physical library computers, books, etc., \n\nThis has been an issue with my World Religions teacher also, where everything is closed down and he expects us to do a tour and attend the worship of a religious building like a church in person.",
              "author": "RogueApollo01",
              "created": 1605137270,
              "upvotes": 1,
              "replies": {
                "gbzfwyu": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzfwyu/",
                  "text": "Well, I'm sorry to hear that both of your professors are out of their minds. The World Religions tour, in particular, is a nasty requirement. \n\nThe library recommendation can be easily worked around, though. I'm still assuming that research paper is for a Lit. class, but if your university has JSTOR access, you should be able to find all you need.",
                  "author": null,
                  "created": 1605137570,
                  "upvotes": 4,
                  "replies": {}
                },
                "gbzisix": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzisix/",
                  "text": "I don't know how to do this in a good way, but maybe ask here if there's a good way to report the physical house of worship requirement. Maybe that's something concrete enough and stupid enough that reporting it to a departmet head or the campus general counsel would do some good.",
                  "author": "podkayne3000",
                  "created": 1605139181,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "gc0rorb": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0rorb/",
          "text": "Also, if you can't find a scientific paper, here's a way:\n\n-find the paper online, follow it until you find the doi number. Copy that. \n\n-google sci-hub. It's a pirating website that moves sites when it's shut down, so take the most recent link. \n\n-paste the doi into the search. 9/10 times it gives you full text.",
          "author": "fiftycamelsworth",
          "created": 1605164981,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gbz3h4d": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz3h4d/",
      "text": "I’m a senior next semester and worked 60+ hours a week as a freshman and 40+ as a sophomore and half of my junior year. I don’t remember being this exhausted doing it then. It’s really bad being stuck on campus in your dorm, wake up, shower, sit at your desk next to your bed and go through lectures, homework, maybe get dinner if you aren’t too tired, bed and repeat. I’m a history major and rec and park admin minor so it’s really weird not being able to go to the library or having in person classes.",
      "author": "KaiserThrawn",
      "created": 1605130900,
      "upvotes": 1,
      "replies": {}
    },
    "gbyvj58": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyvj58/",
      "text": "[removed]",
      "author": null,
      "created": 1605125484,
      "upvotes": 10,
      "replies": {
        "gbzyc5v": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzyc5v/",
          "text": "What? I’m in my third year and this year is absolutely ridiculous. This isn’t just a “new kid” issue.",
          "author": "all_hail_to_me",
          "created": 1605147206,
          "upvotes": 14,
          "replies": {}
        },
        "gbzpol8": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzpol8/",
          "text": "Agreed. College has always been hard. It has always been THIS hard. There are always professors who don't care, there are always distractions to be had. Welcome to college.",
          "author": "FreshJambalaya",
          "created": 1605142781,
          "upvotes": 6,
          "replies": {}
        },
        "gciu07a": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gciu07a/",
          "text": "We're glad you want to contribute to r/college, but there are some things we try to avoid, and your post was removed because it falls into one of those areas. \n\nExamples include but are not limited to:\n\n- memes, reaction gifs\n- surveys, \n- videos, \n- self promotion,\n- posts with titles that are non-specific/alarmist/unprofessional/deceptive/all caps/etc.\n\nWe do hope you'll post again in the future with a good discussion-oriented topic.",
          "author": "VA_Network_Nerd",
          "created": 1605553197,
          "upvotes": 1,
          "replies": {}
        },
        "gc00xsb": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc00xsb/",
          "text": "Why would a freshman even post something like this? They'd probably just assume this is the regular college workload and experience.",
          "author": "hobbygeologist",
          "created": 1605148680,
          "upvotes": 1,
          "replies": {
            "gc0528q": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0528q/",
              "text": "Freshman did post this",
              "author": "49_1",
              "created": 1605151061,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gbyrhck": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyrhck/",
      "text": "Noted!",
      "author": "Marky_Marky_Mark",
      "created": 1605123481,
      "upvotes": 2,
      "replies": {}
    },
    "gbyp4ro": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyp4ro/",
      "text": "Slightly unrelated, but you mentioned how you struggle to wake up because you know you’ll just sit in front of a screen. I’m a senior in high school taking mostly community college course, and over the last two years I have done everything I can to immerse myself in a virtual work environment - digital notes, calendars, todo lists, lecture recordings etc. I even went and spent a summer’s worth of savings on an iPad Pro, and a custom PC a year later, just to improve my setup. Now that I’m being forced to use technology 100% of the time, I feel so sick and tired of school, and I’ve gone back to taking notes on paper and spending a little extra to rent a physical copy of a textbook, rather than buying the ebook version. \n\nI absolutely hate that professors are assigning so much more work this semester because were at home and they feel like it’ll make it easier, because now I’m so sick of everything I do. I stopped watching shows on my computer, I stopped playing video games, hell I even stopped writing music, because I’m already spending so much time on zoom that I just can’t stand it. I really wish professors were a little more understanding and compassionate.",
      "author": "Kachi3",
      "created": 1605122320,
      "upvotes": 12,
      "replies": {}
    },
    "gbyofy9": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyofy9/",
      "text": "I'm still on campus but we have NO breaks this semester. I got incredibly burnt out for a few weeks and ended up doing only 4-5hrs of work per day on average for 1-2 weeks. Last week was midterms and next week is finals. I've been doing 8-10hrs of actual work (excluding breaks and being unproductive) per day for the past 1.5 weeks. I'm tired. I'm stressed. Yesterday I only had one meal and a snack. Last week I went maybe 3-4 days without showering cuz I was so busy. I couldn't sleep from stress",
      "author": "Isekai_Trash_uwu",
      "created": 1605121971,
      "upvotes": -1,
      "replies": {}
    },
    "gbykjeq": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbykjeq/",
      "text": "I just wish some Professors didn't have a double standard this semester - We keep on getting assigned more work, but they're at least a month behind on grading. I understand that they're just as busy as us, but I honestly have no idea how they can expect something to be due on a certain date when they're not gonna look at it for at least a week. Some of my Professors are understanding in that way and have allowed extensions for basically any reason, but it's just a crap situation.",
      "author": "spencefunk",
      "created": 1605120037,
      "upvotes": 104,
      "replies": {
        "gbz26d5": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz26d5/",
          "text": "\n**This.**\nI still don't have a clue what my grade is in one of my labs. Could be an F. Could be an A. Could be anything in between. I have emailed and asked what my grades are but they just said that they can't determine because my assignments aren't graded. \n\nWe have like a week and a half left of this semester and I don't even know if I'm passing. Insane.",
          "author": "xxplantjaysonxx",
          "created": 1605129624,
          "upvotes": 27,
          "replies": {}
        },
        "gbyxktf": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyxktf/",
          "text": "[deleted]",
          "author": null,
          "created": 1605126494,
          "upvotes": 23,
          "replies": {
            "gc07t52": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc07t52/",
              "text": "Not to mention the people who are laid off a semester in advance but still have to teach for that entire semester... I think any reasonable person in that situation would just do the bare minimum needed and spend the extra time/energy looking for a new job.",
              "author": null,
              "created": 1605152706,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "gbzkvg1": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzkvg1/",
          "text": "A lot of my professors (3/4 of them) don't even live lecture. Instead two of them post video lectures to the class that they recorded last semester/over the summer, and one of them doesn't even lecture or post lecture slides or anything. He just gives us homework and quizzes and expects the book to teach us. 😒\n\nSeriously seems like a lot of professors are taking the opportunity to have their work cut this semester due to the online aspect, and are taking advantage of the fact that they can post old lecture videos instead of taking the effort to live lecture over zoom. And then they give students more work to do that the professors would do during a normal semester, essentially forcing students to teach themselves.\n(I understand that not all professors are like this, I have seen some rather dedicated professors on this subreddit. I am simply speaking from my own perspective.)\n\nAs a sophomore, I got straight A's my first two semesters of college. I loved classes when they were in-person and was highly motivated, much more than when I was in highschool, but this ain't it. \n\nI'm seriously thinking of taking a semester or two off and coming back when classes return in-person. Not out of laziness, but because next semester is when I start taking my major classes, and I don't want to struggle with those classes online. I wonder if enough students drop out, will classes return in-person sooner?",
          "author": "ThoughtCenter87",
          "created": 1605140339,
          "upvotes": 4,
          "replies": {
            "gc096fl": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc096fl/",
              "text": "I don't get the hate for asynchronous classes. I much prefer them over in-person classes as they allow me to work on the class at whatever time works for me (which is seemingly later and later at night these days) instead of compromising on sleep for class. They also allow me to speed it up or pause it to write down notes which means I can use my time more efficiently for difficult class material.\n\nIf they release them all at the beginning of the semester, it's even better (at least if they also release the homework) so I can get ahead and balance my workload between weeks in addition to between days.",
              "author": "big-b20000",
              "created": 1605153544,
              "upvotes": 11,
              "replies": {}
            },
            "gbzyimb": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzyimb/",
              "text": "Making lecture videos is far, far, far more work intensive than lecturing online. It takes me almost three times as much time. The reason that a lot of professors are using pre-recorded videos is because students don't have the flexibility to commit to a weekly time slot. We are doing more work to accommodate the chaotic schedules of students in the COVID era.",
              "author": null,
              "created": 1605147309,
              "upvotes": 10,
              "replies": {
                "gc068r1": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc068r1/",
                  "text": "THIS. I have spent more time on this one class during COVID than I did when teaching two in-person courses. I think many students assume we already had pre-recorded lectures on hand or that we don't update lectures each semester. In actuality, I'm spending 4+ hours each week creating a 60-minute lecture, all the while responding to the 200 daily emails and attempting to catch up on the grading. I get the students have it rough, I really do. I would *not* want to be in college during COVID. But I'm also running on literal fumes and I take it too hard when I see so many students assume we're taking it easy this semester. I'm not embarrassed to admit I've cried more than once this semester because I've felt so overwhelmed and like a failure of a teacher. (thanks for letting me vent, Reddit lol).",
                  "author": "Admirable_Mud_7423",
                  "created": 1605151757,
                  "upvotes": 10,
                  "replies": {
                    "gc08now": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc08now/",
                      "text": "Yeah, the e-mails are a different beast. I haven't figured out how to manage them yet, other than imploring students to use scheduled office hours. I'm actually considering trying to make the case that I need a TA just to spend 20 hours a week doing e-mail work.",
                      "author": null,
                      "created": 1605153222,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "gbzzenv": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzzenv/",
                  "text": "The thing is though, you only need to record a lecture video once, and then you can continue using that one lecture video over multiple semesters. You only need to put in the effort once and then you have that lecture video for use during different semesters as opposed to doing the same lecture multiple times live.\n\nHow is making pre-recorded lecture videos more intensive than live lecturing? I genuinely don't understand.",
                  "author": "ThoughtCenter87",
                  "created": 1605147809,
                  "upvotes": 3,
                  "replies": {
                    "gc0201x": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0201x/",
                      "text": "Filming, Editing, Reshoots. Restructuring your material. Also, most professors are making these videos for the first time, so all that upfront cost is this semester. It is a lot of time, that we have to put in. And that's assuming you aren't making a new course. Then you have to make 50 minute powerpoints 3x a week, and then film, edit. It is so so much time.\n\nLike for example, I recorded 1 weeks worth of lectures for 1 class. \n\nThat's 2.5 hours of filming. \n\nThen I have to edit it, so I have to essentially watch that 2.5 hours of footage + plus actual editing (1 hour)\n\nAnd then I have to slice it up into thematic chunks. \n\nAnd then after all of that, I still have to render the video and upload it. (So my computer is out of commission for another 2.5 hours)\n\nAnd most professors teach more than 1 class. So multiply that number by the number of classes they're teaching. And that's the baseline before they even do all the other stuff for the class.\n\nSo that's easily 2.5+2.5 +2.5 if everything goes right.\n\n7.5 hours for 2.5 hours of content.\n\nAnd heaven forbid you lose footage or audio, then you have to start over.",
                      "author": "Quant_Liz_Lemon",
                      "created": 1605149283,
                      "upvotes": 13,
                      "replies": {
                        "gc053dn": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc053dn/",
                          "text": "Thank you. That makes more sense and I see now that it isn't as easy as I once thought. That puts things into perspective.",
                          "author": "ThoughtCenter87",
                          "created": 1605151080,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    },
                    "gc03eh3": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc03eh3/",
                      "text": "As you say, re-use might pay dividends in the future but we aren't there yet. Most professors don't teach the same class every semester/quarter. Usually we teach a class once a year, if that. What this means is that I'm recording videos for every lecture for my fall classes, then my winter classes, then my spring classes. My classes next year aren't the same either -- some of them are only offered every two years. It will probably take at least a year, but as long as two or three years in some cases, for the videos to be able to be re-used.\n\nAs for the work involved, look at Quant_Liz_Lemon's post below; it covers it pretty well.",
                      "author": null,
                      "created": 1605150094,
                      "upvotes": 6,
                      "replies": {
                        "gc061gb": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc061gb/",
                          "text": "I apologize. I thought most professors taught the same/similar classes each semester, however that's probably just my professors or college. I am at a community college and several of my professors admit to having been teaching the same class for multiple years (one has taught the same class for two decades, however he is also teaching astronomy and he's the only professor at my community college who does so that might explain it). My community college/professors are probably the exception and not the rule, it does make sense that most professors would not teach the same class each semester, especially because some classes are divided into two semesters from what I've seen, although I haven't taken these types of classes yet because I'm taking gen ed classes. That puts more into perspective the effort involved and I appreciate you sharing this.",
                          "author": "ThoughtCenter87",
                          "created": 1605151636,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gbyiesp": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyiesp/",
      "text": "I just feel like college is a waste of time at this point in general. None of us are getting paid to stress over a petty assignment for hours at a time. Education is not experience and education dosent matter if you dont have experience in the thing your studying because apparently spending 4 years or more of your life equates to barely training.",
      "author": "ShalidorsSecret",
      "created": 1605118981,
      "upvotes": 6,
      "replies": {}
    },
    "gbyfohp": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyfohp/",
      "text": "How do you think us professors feel? I could write almost the exact same letter as above but address it to students. The day-in-day-out creation of online lectures is soul-crushing. Students don't turn on their cameras or even let me know they are participating. I lecture each day to an empty room. \n\nThe only time I hear from students are the last minute e-mails before a major assignment comes due begging for mercy. Students expect unlimited slack and sympathy over COVID-related matters, while I have to triage more complaints about my lectures and course material than ever before.\n\nOften, the same students that demand compassion from me are merciless in their reviews. We, too, are just doing our best in a radically altered teaching environment without adequate resources. And yet, we receive no sympathy or leniency. \n\nI am willing to listen to students and adapt, but you have to meet me half-way. If students want me to alter my expectations, I'm going demand the same of my students.",
      "author": null,
      "created": 1605117620,
      "upvotes": 106,
      "replies": {
        "gbze4zb": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbze4zb/",
          "text": "Thank you. It is so exhausting -- and frankly, I have cut assignments, trimmed lectures, and reduced content tons. And yet, students still think I'm adding work. I am working an insane amount of hours a week on my classes. And, it seems so pointless. Frankly, I am starting to wish I phoned it in because it doesn't seem like my hard work (filming, editing, uploading, being accessible) is making any difference at all. 😫\n\nI caught students cheating on my last exam. It was so disheartening.",
          "author": "Quant_Liz_Lemon",
          "created": 1605136592,
          "upvotes": 32,
          "replies": {
            "gc0cpji": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0cpji/",
              "text": "This idea that some people are likely getting away with cheating in this new environment of online exams is terrifying for us students who pour our heart and soul into the material in order to succeed the right way. What sort of preventative measures have you put into place to prevent students from participating in academic dishonesty?",
              "author": "PhilosophicalElk",
              "created": 1605155813,
              "upvotes": 1,
              "replies": {
                "gc0il8q": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0il8q/",
                  "text": ">PhilosophicalElk\n\nHonestly, it's most students that are getting away with cheating. I don't think there's that much you can do to stop it.",
                  "author": "emilyctrl",
                  "created": 1605159268,
                  "upvotes": 2,
                  "replies": {}
                },
                "gc1x2kd": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc1x2kd/",
                  "text": "I've made my tests short answer and speeded, so students that cheat run out of time because they spend their time looking up the answers. I also have them sign honor code pledges. (I know those sound so dumb, but they actually reduce cheating and tax fraud. There are some supercool papers about it.) \n\nI also let them know that canvas collects a ton of data, so it is really obvious when students work together. Not just submitting at the same time, but they have a tons of information about when you're looking at specific questions. So it is really obvious who is working together and who isn't. \n\nI hate doing it, but I scrap the metadata from every exam now, and non-parametrically evaluate whether the similarity is due to chance versus cheating. On the last test, it was 3/10,000 that 3 specific students weren't working together. (so like only 3 in 10,000 times would this similarity be a false positive).\n\nI've also made my tests open everything but other people. So it is really clear what is and isn't cheating. (And also, I give students a warning, show them their data, and a harsh re-grade the first time rather than sending them straight to honor council.)",
                  "author": "Quant_Liz_Lemon",
                  "created": 1605195330,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gbz3k83": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz3k83/",
          "text": "Strong agree here. I see so many posts like OP’s here that at this point are beating a dead horse, border on whining, and don’t acknowledge anyone else’s perspective in this situation.  I mean I think this sub always had a bit of an entitlement issue to begin with, but it has increased 10,000x since corona began.",
          "author": "Ms_Digglesworth",
          "created": 1605130952,
          "upvotes": 25,
          "replies": {}
        },
        "gbyge7o": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyge7o/",
          "text": "How do I upvote this more than once?",
          "author": "Richard_Chaffe",
          "created": 1605117974,
          "upvotes": 33,
          "replies": {}
        },
        "gbz7hih": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz7hih/",
          "text": "If I have to hear one more \"I had wifi issues so I couldn't turn my assignment in on time,\" I will go postal.",
          "author": "I_am_Not_A_Robot_13",
          "created": 1605133074,
          "upvotes": 10,
          "replies": {}
        },
        "gc067in": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc067in/",
          "text": "I think part of the difference is that professors are paid and students are not. Once my zoom classes are done, I have to go to work in order to make enough to live.",
          "author": "zeph_yr",
          "created": 1605151738,
          "upvotes": 7,
          "replies": {
            "gc091q5": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc091q5/",
              "text": "This is probably going to lead to a debate that I've hashed out with others on reddit before, but balancing school and work has been precarious even before the epidemic. \n\nIf students are taking a full course load, they really aren't supposed to be working. For every 3 credit hour class, they are supposed to have 3 hours of instruction plus 12 hours of homework. I understand that this isn't the reality and that the growing costs of education in the U.S. have forced students to take part-time, and even full-time jobs, but that particular dilemma isn't really unique to COVID-times.",
              "author": null,
              "created": 1605153461,
              "upvotes": 6,
              "replies": {
                "gc0dgh7": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0dgh7/",
                  "text": "You're right in arguing that the dilemma of work/life/school balance shouldn't have changed just because of covid, but I think that it has. Covid has made school more stressful for all of the reasons discussed in this thread (primarily because of perceived or actual workload increases due to the shift to online instruction). Covid has made many college jobs more stressful for more varied reasons, possibly including mask enforcement, risks associated with catching covid or job market turbulence. \n\nFor all of my sophomore year, I worked full time retail while doing 12 credits. It sucked, but it was manageable. I found my work/school balance to be perfect when working 20 hours per week and taking 15 credits. This semester, I retained that exact 20 working hours at 15 credits, but it's absolutely awful. \n\nThis could be redeemed by quality time with my friends, or by looking forward to a cool vacation, or by looking forward to finding a good job after graduation-- but all of these rewards are off the table.",
                  "author": "zeph_yr",
                  "created": 1605156316,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "gbzj344": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzj344/",
          "text": "But college students are 18-22 years old. They’re not as emotionally mature as 40+ y/o faculty. It’s natural to assume the transition has been especially harsh on the younger and more vulnerable population.\n\nCollege students’ social lives were annihilated by this. The isolation is incredibly unhealthy. Most faculty/professors have families and friends already. Going into the office was not their sole social outlet. They are grown-ass adults in their established adult lives.\n\nSo when people say ‘it’s hard for the professors too’... I get it. And it is. But it’s disingenuous to try to compare that to an isolated 20 y/o trying to do college on a laptop in their childhood bedroom.\n\nProfessors are not appreciating the extent of the isolation their students are experiencing right now and how detrimental it is on a young person’s emotional health.",
          "author": "supremeleaderbub",
          "created": 1605139347,
          "upvotes": 13,
          "replies": {
            "gc0cfa4": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0cfa4/",
              "text": "This comment is bursting with bad assumptions and I’m tired of reading comment after comment here and holding my tongue.\n\nCollege students in the 18-22 age group grew up with social media and tons of ways to keep in touch with friends and family. You’ll see a lot of young adults in this age range sitting on their phones even when they are in close physical proximity to one another. A lot of them are connected with friends and even romantic partners they’ve never met or spoken to on the phone. This age group was practically born and bred to be able to maintain social interactions online and now suddenly it’s a huge problem. That doesn’t discount the importance of in-person socializing for this age group, or any group, but I’m done with this victim mentality going on about how doing things online is so difficult for the typical college undergrad right now because technology.\n\nContrast that with the average 35-, 45-, 55-year-old professor (or older). If you’re mid-30’s, as I am, some of this is new and some is familiar. (I am currently in school for a third degree so I’m experiencing this all first-hand as a student myself—and did this for summer classes as well.) In my case, I have worked remote full-time for 5 years already, so COVID is not a change for me at all. And that’s the thing. A lot of the world was already moving to doing things online before this hit. If an adult preparing to graduate from business school thinks sitting through class on a laptop all day is difficult, through a schedule of classes they got to plan for themselves, they’re in for a rude awakening when they get that offer letter for their first real job. And in many ways that is the intent of college. To prepare students for the real world. This is the real world now. Believe me when I say learning the ropes in a college setting is going to be far less stressful than showing up to your new job and being expected to know how to do all this stuff on day one. Your new boss will not be as patient with you as your professors.\n\nYou also make the assumption that, what, this isn’t as difficult for instructors because they’re married, have kids, etc.? So they’re not lonely? Is that what you’re saying? Spare me. Are you aware of how time-consuming higher education is for faculty and how it severely limits how much free time they have available to foster relationships outside of work, even pre-COVID? Have you ever stopped and asked yourself why so many professors are unmarried and childless? They literally do not have time for a whole lot outside of their jobs. They do what they do because it is what they love, not because it affords them leisure time.\n\nI’ve been dating a professor for the past few months (not one of my professors, to be clear) and what we define as dating is probably nothing like how most people would define that term, although it works great for us. We see each other once a week and we usually have to plan that time around when he’s not recording lectures or grading. We’re only able to do overnight stays every couple of weeks because most weekends he is so burned out that he desperately needs the time alone. He teaches five classes (to make ends meet) and has about 200 students between two separate universities (yes, did you know some of your professors do not just teach at YOUR school?). He had a lot of his lectures recorded already but they were done with Adobe Flash which is “dying” this year so he has been re-recording all of them. IF HE IS LUCKY, he can fit two into one day. And on those days he doesn’t check email, do admin tasks, etc., otherwise he won’t get the lectures done. Those still end up being 10-hour days at minimum. He has had to do this for all five of his classes this semester because all of them are different. He will not have a winter break because he’ll be busy recording lectures for the five classes he has coming up in spring as they are different than his fall classes, as well as re-writing mid-term and final exams, on top of loads of paperwork, then getting everything set up to “publish” on Canvas. That doesn’t even include any of his research requirements, planning for study abroad in 2022, acting in his capacity as director of undergrad for one university, etc.\n\nBut yeah, professors have it so much easier than the students.\n\nI am the only person he sees on a regular basis. (Despite all this, we’re super happy—just having to work through these tough times.) He hasn’t seen his parents/siblings in weeks. He barely even has time to call his best friend in Australia every week for a chat. I’m his only real sense of relief right now, and I live 30 minutes away and have work commitments of my own. All in all, the only people he has seen since summer are me, his parents, and one of his friends who lives down the street. It’s not glamorous. Not in the least.\n\nStudents need to get rid of this notion that professors are tap dancing their way through this. Maybe even enjoying thenselves. No way. My boyfriend tells me regularly, COVID has made their jobs exponentially more difficult. He has said every professor he knows misses being in the lecture hall with their students. It is far less time-consuming on the front end. They’re not loading you up with work just for fun. They are fulfilling learning objectives set forth for them by their department. If their coursework doesn’t meet those objectives the program goes away entirely. Trust me when I say the last thing they want to do is create more work for themselves by having you submit more assignments. But they do have pre-defined metrics they need to follow as well.\n\nAs a student myself I will also tell you that my own professors are much more sympathetic to the students that are treating them with kindness, respect, and consideration right now. It takes two minutes to drop them an email once a month or so and thank them for all their hard work this semester. And it makes all the difference in the world to them when you actively participate in live classes. That’s not sucking up, that’s being professional. This skill will take you a very long way when you graduate.",
              "author": "pearlsnvodka",
              "created": 1605155632,
              "upvotes": 3,
              "replies": {
                "gc0sx2n": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0sx2n/",
                  "text": "You talk about bad assumptions then go on to say the current college generation was ‘born and bred’ to maintain social relations online. Sorry but you don’t know as much as you think you do. Social media is incredibly superficial. Current college kids are just as human as college-aged kids 20 years ago. The complete social isolation (social media and FaceTime are not substitutes for in-person, human interaction) is beyond unhealthy for an undeveloped mind. I never said professors don’t have it bad too. I said they’re grown, salaried, independent adults—who in most cases should be more resilient to the stresses of remote instruction compared to literal teenagers with spiraling mental health.",
                  "author": "supremeleaderbub",
                  "created": 1605165856,
                  "upvotes": 6,
                  "replies": {
                    "gc0td54": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0td54/",
                      "text": "You honestly believe that because someone is “grown and salaried” they have the mental strength to deal with a literal fucking pandemic, or really ANYTHING ELSE the world hands them? This is probably the most ignorant position I’ve ever seen regarding mental health in modern Western society. I hope you are not a sociology major.\n\nAlso, you honestly believe professors are salaried? At my state university they are paid $2,800 PER CLASS and only the lucky ones have permanent work. With COVID many of them are being laid off or incentivized to go through temporary retirement programs. But, yeah, at least they’ve got the “grown” part down you were talking about.\n\nEducate yourself before you make yourself look even more foolish.",
                      "author": "pearlsnvodka",
                      "created": 1605166185,
                      "upvotes": 3,
                      "replies": {
                        "gc1ry9u": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc1ry9u/",
                          "text": "Wow. I didn’t say that. You continue to assert I said things I didn’t to use as an opportunity to write paragraphs about how things are so difficult for you. I don’t deny it’s tough for you. Now imagine LITERAL teenagers dealing with the same thing.",
                          "author": "supremeleaderbub",
                          "created": 1605192686,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gc4oh03": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc4oh03/",
                  "text": "To add to this, as a 20 year old, a lot of us acknowledge that social media is making us depressed. Its not a good thing that its such a large part of our lives. I think it has a lot to do with the rising mental health crises in our generation and younger.",
                  "author": "Smalmthegreat",
                  "created": 1605247768,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "gbylkho": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbylkho/",
          "text": "[deleted]",
          "author": null,
          "created": 1605120542,
          "upvotes": 3,
          "replies": {
            "gbz1eah": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz1eah/",
              "text": "Many of us, myself included, are adjuncts. We are underpaid, get no benefits, and are expected to do as much work as full-time professors (other than research). I am not established nor crying myself to the bank. I also have student loan debt and work a second, part-time gig to make up the gap in my income. But, I love teaching, most of us do. We're not doing it for the money.",
              "author": "GobHoblin87",
              "created": 1605128783,
              "upvotes": 14,
              "replies": {}
            },
            "gbyxe3y": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyxe3y/",
              "text": "If you're unable to adjust to an increased workload and set of expectations now then you're not going to adjust post-graduation either. Professors should exercise leniency but you need to pull your weight too.",
              "author": null,
              "created": 1605126403,
              "upvotes": 15,
              "replies": {}
            },
            "gbyxrh1": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyxrh1/",
              "text": "[deleted]",
              "author": null,
              "created": 1605126586,
              "upvotes": 16,
              "replies": {
                "gbz7m7t": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz7m7t/",
                  "text": "layoffs right now insane. one of my departments down about 30 adjuncts. Who needs to eat, right?",
                  "author": "I_am_Not_A_Robot_13",
                  "created": 1605133142,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "gbyntxk": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyntxk/",
              "text": "UpperEchelon666 said\n> Only difference is students going into major debt for the lectures for a chance at landing a good career in life, whereas you’re getting paid to do your job and have established your career. You get to cry yourself to the bank whereas your students are fucked\n\n---\n> students going into major debt for the lectures for a chance at landing a good career in life\n\nAnd many squander that chance. If debt was such a real, important issue, the opportunity would not be squandered.",
              "author": "cowbell00",
              "created": 1605121663,
              "upvotes": 11,
              "replies": {
                "gbyy3wi": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyy3wi/",
                  "text": "Students are forced to spent $100k+ and four years of time as a prerequisite for any decent job and you’re surprised that many lack the motivation to get high grades 24/7? The system is so broken, that we are forced to grind and be miserable with work that likely will not be necessary for our future vocation. 20s should be spent doing a healthy amount of work, making money and becoming independent, going out and meeting new people, and falling in love. Not marching through bullshit exploitative institutions.",
                  "author": "xocelyk",
                  "created": 1605126758,
                  "upvotes": -4,
                  "replies": {
                    "gbyz9qx": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyz9qx/",
                      "text": "Original post:\n\n> Students are forced to spent $100k+ and four years of time as a prerequisite for any decent job and you’re surprised that many lack the motivation to get high grades 24/7? The system is so broken, that we are forced to grind and be miserable with work that likely will not be necessary for our future vocation. 20s should be spent doing a healthy amount of work, making money and becoming independent, going out and meeting new people, and falling in love. Not marching through bullshit exploitative institutions.\n\n----\n\n> Students are forced to spent $100k+ and four years of time as a prerequisite for any decent job\n\nWrong. There are many decent jobs out there that do not require a college degree. \n\n> you’re surprised that many lack the motivation to get high grades 24/7? \n\nNo, quite the opposite actually. Teaching hundreds of students per semester has made this unsurprising. \n\nThose that keep making excuses for students (expensive, broken system, etc.) are seriously underestimating the human spirit. Students are *capable* of doing well. Many are not *willing* to make the effort.",
                      "author": "cowbell00",
                      "created": 1605127341,
                      "upvotes": 12,
                      "replies": {
                        "gbzc0sw": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzc0sw/",
                          "text": "I work in advising & counseling - I can't tell you how many students call US to complain about their profs. I get not knowing chain of command (or going through the dept specifically), but i've had a student call and request an excused absence... she missed class for whatever reason and after talking with her prof, I guess that was the first time she learned excused absences aren't really a *thing* in college. So she wanted my office to provide a note excusing the absence. I have had students call asking us to tell their prof they’ll be late/absent like what??And all of that was pre-covid. I've been doing this five years  and I can confirm that student's don't understand college is a privilege, not a right. You're literally paying to be here whether you're on financial aid or not. The profs aren't like your high school teachers and they're not required to pass you through to stay in good standing with state funding. I keep seeing these posts about profs needing to be more understanding/give a little leeway and the like. But the flip side of that is pre-covid, a prof can do their course however the hell they want. Take it or leave it. Sorry for the rant, but the past few semesters have been hard for everyone and your institution's faculty and staff are no exception.",
                          "author": "OHmyblueberries",
                          "created": 1605135457,
                          "upvotes": 8,
                          "replies": {}
                        },
                        "gbz34h6": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz34h6/",
                          "text": "Jesus, that is such a tired excuse. Obviously there are SOME decent jobs that don’t require a college degree. You know why they pay decently? Because they are highly undesirable. The median job in the US does not offer an income that lends itself to high quality of life. And as graduation rates increase, this will only become more true. \nHave you considered that your disillusion with the ethic of your students is perhaps more the result of your failure to understand/accept human nature, rather than “the kids don’t work hard enough!!!” \nYou can maintain the illusion that the institution(s) you have worked for aren’t a part of a corrupt, elitist business model that, without government intervention, will surely fall into the ground, but the resentment among the victims of this exploitation will only build and your job won’t get any easier.\nAt this moment in time, education technology is sufficiently robust that the role of an instructor in undergraduate education is mostly obsolete, if one’s goal is merely education. Colleges only remain relevant as signals of status/prestige/intelligence, their value dependent on decades-long pervasive social engineering that has conflated college with the American dream.",
                          "author": "xocelyk",
                          "created": 1605130676,
                          "upvotes": -2,
                          "replies": {
                            "gbzc56c": {
                              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzc56c/",
                              "text": "> Jesus, that is such a tired excuse. Obviously there are SOME decent jobs that don’t require a college degree. You know why they pay decently? Because they are highly undesirable. The median job in the US does not offer an income that lends itself to high quality of life. And as graduation rates increase, this will only become more true. Have you considered that your disillusion with the ethic of your students is perhaps more the result of your failure to understand/accept human nature, rather than “the kids don’t work hard enough!!!” You can maintain the illusion that the institution(s) you have worked for aren’t a part of a corrupt, elitist business model that, without government intervention, will surely fall into the ground, but the resentment among the victims of this exploitation will only build and your job won’t get any easier. At this moment in time, education technology is sufficiently robust that the role of an instructor in undergraduate education is mostly obsolete, if one’s goal is merely education. Colleges only remain relevant as signals of status/prestige/intelligence, their value dependent on decades-long pervasive social engineering that has conflated college with the American dream.\n\n\n\nClearly this is an emotional topic for you. I'm not here to argue the broken education system.  The student I am referring to can be factually broken down into three categories:\n\n1. Those who lie for academic gain\n2. Those who cheat for academic gain\n3. Those who do little to participate\n\nThe fraction of those that fall into one or multiple of these categories easily pushes 1/3 or 1/2 of the hundreds of students I teach each semester. One could argue that these traits are all \"human nature\" but I refuse to defend them with excuses. That would be a slap in the face to those that actually work hard and take their education seriously. \n\nI am not disillusioned. I am stating facts. I am here to tell you that nearly every single student I get is perfectly *capable* of meeting their academic responsibilities. It is most unfortunate that many *choose not to* which is odd given that an education is, as you stated, quite expensive. I find the level of resentment quite appalling as there are *so many people* who would sacrifice so much more just for the opportunity to sit in one of the many empty chairs in these lecture halls *each and every class meeting*. \n\nIts a free country. If a student wants to squander that opportunity, no matter how expensive it is, that is their own decision.",
                              "author": "cowbell00",
                              "created": 1605135520,
                              "upvotes": 7,
                              "replies": {
                                "gc07skj": {
                                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc07skj/",
                                  "text": "It is frankly unrealistic to expect all your students to be more conscientious than the average human, the way we are biologically engineered. It’s not an excuse, and as a prof or teacher you’d be better served acting understanding than trying to warp students’ personalities, because this idea, that personalities are malleable and you can be anyone you want to be, is unscientific and more the result of convoluted attempts to justify a bullshit meritocracy whereby those with certain personalities are afforded great quality of life. This is coming from a 4.0 college student and high school valedictorian. Because I was everything you probably expect your students to be and ultimately miserable and intellectually constrained because of people who pushed upon me philosophies like your own.\n\nIf you’re a student out there reading this please don’t listen to the prof who makes you feel like a piece of shit because you lack the focus to work on tasks that don’t really matter at all. Either decide “this matters to me” and grind or that it doesn’t and coast by with a B-average in an easy major, spend the time you would’ve spent studying making friends, and your life will be fine (if not better).",
                                  "author": "xocelyk",
                                  "created": 1605152696,
                                  "upvotes": 0,
                                  "replies": {
                                    "gc0b329": {
                                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0b329/",
                                      "text": "You really are a class act /u/xocelyk\n\n> It is frankly unrealistic to expect all your students to be more conscientious than the average human\n\nCorrect. But I do expect them to push their standards.\n\n> you’d be better served acting understanding than trying to warp students’ personalities\n\nI try to make each and every one of them to believe in themselves. People like you tell them its okay to perform poorly under the guise of \"being happy\". You know what isn't happy? Having discussions with students who flunked a quiz, an exam, or worse yet, the course. Nothing about that feels good on *both* sides of the desk.\n\n>  because this idea, that personalities are malleable and you can be anyone you want to be, is unscientific and more the result of convoluted attempts to justify a bullshit meritocracy \n\nBut the fact is many personalities are malleable. This is quite evident when students email me all excited about their high exam score and how they had turned their bad habits around and started working harder. Those emails are the best. I keep every single one.\n\n> Because I was everything you probably expect your students to be and ultimately miserable and intellectually constrained because of people who pushed upon me philosophies like your own.\n\nSo I make students believe that they have the *capacity* and *capability* to perform well in an academic environment and that's somehow evil? I'm sorry you couldn't handle being a 4.0 student. So many would sacrifice to have that. And guess what... they do and they earn it.\n\n> If you’re a student out there reading this please don’t listen to the prof who makes you feel like a piece of shit because you lack the focus to work on tasks that don’t really matter at all\n\nThis is where your jaded past really shines through. You see absolutely no \"good\" in telling *anyone* that they don't work hard enough and that it is the \"system's\" or \"the man's\" fault. \n\n> spend the time you would’ve spent studying making friends, and your life will be fine (if not better).\n\nI completely agree with this. If you are not willing to push yourself, college shouldn't be for you and you should focus on other things that make you happy! Not everyone has to go to college and there are a near limitless number of ways to pursue a life that you want! I'll be a huge cheerleader on the sidelines.\n\nI get that this is a sensitive topic for you. You have your own view based on your experience, but trying to discredit me by subtlety describing me as a terrible person is quite desperate of you. You know what the biggest joke class is on campus? The one where you do nothing and everyone gets an A (looking at you whoever teaches art appreciation). College does not and should never cater to lowest common denominator.",
                                      "author": "cowbell00",
                                      "created": 1605154758,
                                      "upvotes": 1,
                                      "replies": {
                                        "gc0gudq": {
                                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0gudq/",
                                          "text": "I didn't mean to disparage you, lol, I may have a particular teacher from my past in mind.",
                                          "author": "xocelyk",
                                          "created": 1605158211,
                                          "upvotes": 0,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gbzcz6i": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzcz6i/",
              "text": "Lol look into adjunct work buddy. Guarantee most if not all of your classes are taught by adjuncts",
              "author": "nlh1013",
              "created": 1605135967,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gc0t9g0": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0t9g0/",
          "text": "It’s 1:30am... I have litterally been at my computer ALL DAY since 8am (took quick breaks and a 30 minute break to cook dinner for my family, but I ate it at my computer). I’m still grading and writing material.\n\nIt’s been like this all week. My feet are swollen from sitting so long. I’m tired and stressed and have students emailing me constantly complaining about having to do work while at the same time admin is on my ass about getting petty trainings, committee work done, and our performance evaluations done. Oh! And don’t forget to keep up rigor (because if we drop rigor too low this semester won’t be worth shit and we will have all wasted a massive amount of both of our times)..\n\nSo yea. This sucks for everyone.\n\nI give my students AMPLE slack right now..  I mean, I’ve bent myself into a damn pretzel to make sure they have what they need and have extended every single deadline all damn semester (and still have a ton of zeros in the grade book). \n\nAll my lectures are to empty rooms and quiet chat rooms. Though, some days are better than others. I have some great classes that are actually active in conversation and say stuff like “WOW” or even the elusive “lol” that makes my day.\n\nSeriously, we are all human, and we are all trying our best.",
          "author": "Nerobus",
          "created": 1605166113,
          "upvotes": 2,
          "replies": {}
        },
        "gbyq02w": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyq02w/",
          "text": "[deleted]",
          "author": null,
          "created": 1605122750,
          "upvotes": -7,
          "replies": {
            "gbze2ss": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbze2ss/",
              "text": "I don't know why you think that professors are taking out stress on students by assigning heavier workloads. From discussions with my colleagues, I think almost all of our online classes are actually lighter than before. \n\nThe difference is that students are now having to do more learning on their own, and they are struggling with that. \n\nRemote learning isn't really the hurdle, either. Putting together videos and online content was something that I figured out in the Spring. The real issue is that students' lives are being affected by the pandemic outside of the classroom. Consequently, I can't design an online course that requires much engagement because students aren't able to engage. I can't require attendance because students aren't able to attend. It's one thing to put together good lectures, but if the people on the other side of the screen aren't watching, the situation is pretty hopeless. Student attrition rates are way up and many are failing.  I am willing to go above and beyond to help my students but they need to be willing to work with me. So many students have already given up, and I can't fix that.\n\nAnd from a professors point of view, all of this chaos is only 1/3 of my job. When you say \"consider a different profession,\" remember that teaching is only 1/3 of mine. Nonetheless, that sad third is now taking up all of my time as I try to pull students out of the muck.",
              "author": null,
              "created": 1605136559,
              "upvotes": 8,
              "replies": {
                "gbzfbu0": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzfbu0/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1605137243,
                  "upvotes": 0,
                  "replies": {
                    "gbzt7zc": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzt7zc/",
                      "text": "I keep hearing that professors are assigning more work, but does anything think how much more effort it takes for us to create those assignments and also grade them? Not all of us have TAs.",
                      "author": "innominata_name",
                      "created": 1605144476,
                      "upvotes": 3,
                      "replies": {
                        "gbzy22b": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzy22b/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1605147045,
                          "upvotes": 0,
                          "replies": {
                            "gc03xip": {
                              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc03xip/",
                              "text": "Ranting is fine. I am sorry you have to deal with that. I only hope that professor is just having a hard time this semester and isn’t always like that?",
                              "author": "innominata_name",
                              "created": 1605150399,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gby8ieb": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby8ieb/",
      "text": "I’d award this if I could. It describes my experience—all of our experiences, really—perfectly.\n\nIn addition, my school decided to break this fall semester into two 7.5 week periods so that we would only have to take at max 2-3 classes versus 5-6 at a time. In some ways it’s helped, but in others it just causes more stress.\n\nMy professors haven’t condensed the material they’d normally teach under normal circumstances. They’ve just accelerated the rate at which we cover things. We skim over topics that would justify a deep dive for the sake of time. I retain next to nothing from Zoom classes and have to find ways to regurgitate as much of it as I can into assignments to receive passing grades. For the first time in my career as a student, I’m solely concerned about my grades and grades alone rather than my comprehension of the actual material.\n\nAdditionally, because we’re compressing 15 weeks of material into 7.5 week chunks, my school has elected to hold classes on days we’d normally have off. Labor Day, Columbus/Indigenous People’s Day, Veterans Day, etc. In addition to being a student, I also work a part time job 5-6 days a week to help my family make ends meet. I haven’t had a day where I didn’t have school, work, or both since the end of August. Even weekends are spent either catching up on assignments and studying, or working at my job. \n\nI know I’m fortunate to be able to receive an education and working during these times, but honestly, I’m so stressed. I haven’t had a day to myself. A day to sleep in. A day to binge-watch Netflix. A day to play video games. A day to read a non-school related book. A day to spend quality time with my family and friends. A day to go on a walk my dog.\n\nI’m spread thinner than I’ve ever been as a student, and am just hoping I finish this semester with my head above water.",
      "author": "bakedpotatowcheezpls",
      "created": 1605114103,
      "upvotes": 3,
      "replies": {
        "gbys0pd": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbys0pd/",
          "text": "Hang in there.  I graduated in August.  From December 2018 through February 2020, I worked 40+ hours/week and was a full-time student (even during the summer).  I lumped all my classes into two days per week and worked the other five. \n\nI know you can do it.  It sucks, and it will continue to suck, but you can do it.",
          "author": "keithhannen",
          "created": 1605123749,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gby8d2q": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby8d2q/",
      "text": "[removed]",
      "author": null,
      "created": 1605114032,
      "upvotes": -20,
      "replies": {
        "gby9b2x": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby9b2x/",
          "text": "Wow you tell em",
          "author": "anorexicpig",
          "created": 1605114494,
          "upvotes": 8,
          "replies": {}
        },
        "gcitzfe": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gcitzfe/",
          "text": "We're glad you want to contribute to r/college, but there are some things we try to avoid, and your post was removed because it falls into one of those areas. \n\nExamples include but are not limited to:\n\n- memes, reaction gifs\n- surveys, \n- videos, \n- self promotion,\n- posts with titles that are non-specific/alarmist/unprofessional/deceptive/all caps/etc.\n\nWe do hope you'll post again in the future with a good discussion-oriented topic.",
          "author": "VA_Network_Nerd",
          "created": 1605553187,
          "upvotes": 1,
          "replies": {}
        },
        "gby9qwl": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby9qwl/",
          "text": "[deleted]",
          "author": null,
          "created": 1605114705,
          "upvotes": -4,
          "replies": {
            "gbymido": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbymido/",
              "text": "More like \"found the troll\". Seriously, spend like 2 minutes looking at this douchebag's post history. I'm surprised he hasn't been banned from every sub he's posted to.",
              "author": "StuckAroundGotStuck",
              "created": 1605121004,
              "upvotes": 9,
              "replies": {}
            },
            "gby9vuy": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby9vuy/",
              "text": "I mean really, you signed up for this shit. You didn’t think college required a bit of work??? This isn’t elementary school where you have a movie day on Friday’s. Get your ass back in the library and quit complaining",
              "author": "LargeMark",
              "created": 1605114772,
              "upvotes": -16,
              "replies": {
                "gbycefb": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbycefb/",
                  "text": "The libraries aren’t open LOL",
                  "author": "Thrillkilled",
                  "created": 1605116012,
                  "upvotes": 12,
                  "replies": {
                    "gbzjepr": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzjepr/",
                      "text": "Yes they are mine are at least you just have to make a reservation. Maybe go to a better school?",
                      "author": "LargeMark",
                      "created": 1605139532,
                      "upvotes": -2,
                      "replies": {
                        "gbzjqnx": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzjqnx/",
                          "text": "Congratulations. Your shit community college has open libraries. Good luck with your gender studies degree.",
                          "author": "Thrillkilled",
                          "created": 1605139725,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gby742e": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby742e/",
      "text": "Honestly, One of my professors is terrible. She does the same thing, So many of her students fail that class and she doesn't change anything about it. She makes the exams so hard and each problem takes 25 minutes to do correctly. That is how long she takes to do a certain problem. Her average class GPA is a 2.5.",
      "author": "ZiOnIsNeXtLeBrOn",
      "created": 1605113429,
      "upvotes": 24,
      "replies": {
        "gbyfgl4": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyfgl4/",
          "text": "Going with the same problem too. A big red flag was the first class where my professor said that the last class average was a 65%, and only a couple of people pass each exams with B’s or higher out of 30 students in the class.",
          "author": "blackrag",
          "created": 1605117513,
          "upvotes": 13,
          "replies": {
            "gbyfmrx": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyfmrx/",
              "text": "Right. All other class I am doing extremely well in. And I am taking a python class and python isn’t my strong suit. But I am passing with a good grade and this professor doesn’t curve or do anything.",
              "author": "ZiOnIsNeXtLeBrOn",
              "created": 1605117596,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gby6pma": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby6pma/",
      "text": "I’m a student who is struggling with this as well but you need to remember that professors are dealing with the same exact thing as you. They were *forced* inside all summer. They had their trips canceled. They hate using the technology that you hate for them to use. They sit behind a camera and deliver...\nLecture\nLecture\nLecture\n\nThey have to wake up, lecture, lecture, go to meetings, grade papers, sleep. And they’re in the same exact quarantine as you and I. \n\nI agree that some professors don’t take student concerns seriously enough, because I’ve had some of these professors. But what you’re going through isn’t that different than what they’re going through.",
      "author": "xFaro",
      "created": 1605113232,
      "upvotes": 142,
      "replies": {
        "gbydf1s": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbydf1s/",
          "text": "Agree. I recently had to deliver a presentation through zoom. And the lack of interaction like eye contact or nodding or basically any body language is just terrifying. Not to mention you always have to pay attention to the chat box for people to give any technical feedback (e.g: my mic is muted or the wifi cut me off, etc.). The worst thing is the dead silence as you speak on for 1 hour. I felt much more empathy to the profs who are trying their best to give online lectures. It sounds easy, but it's not. Much more challenging and terrifying than actual in-person classes.",
          "author": "ArmchairChemist",
          "created": 1605116518,
          "upvotes": 70,
          "replies": {}
        },
        "gc0342i": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0342i/",
          "text": "I actually collapsed one time 1 h before delivering an online lecture. You gotta be kidding me if you think professors are some arrogant fools taking advantage of the COVID situation. If students can’t even handle studying at home, how do they think professors are handling everything that is going on with their life and numerous responsibilities?",
          "author": "chulala168",
          "created": 1605149931,
          "upvotes": 10,
          "replies": {}
        },
        "gc0du0g": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0du0g/",
          "text": "And research, and attend conferences, and manage grad students and whatever joke of a lab exists and write letters, grant applications, emails",
          "author": "Murderous_squirrel",
          "created": 1605156554,
          "upvotes": 2,
          "replies": {
            "gc0i4nk": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0i4nk/",
              "text": "Correct",
              "author": "xFaro",
              "created": 1605158994,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "gbyp4m1": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyp4m1/",
          "text": "[deleted]",
          "author": null,
          "created": 1605122318,
          "upvotes": -4,
          "replies": {
            "gbzhhsr": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzhhsr/",
              "text": "I knew I should've not read the comments, but alas, here I am- a current college instructor, graduate student, and *human*, who may be a more \"educated, mature adult who have had years to develop flexibility, resourcefulness, and coping skills\" but is still struggling during these times because you know, I'm juggling a spouse losing his job and being worried about the mortgage, our family (including myself) getting COVID yet still needing to create \"compelling lectures\" for students and respond to the 100+ emails received daily in fear of being called lazy or incompetent by parents like you, and also feeling the isolation, stress, and anxiety since this is a period of time *novel* for nearly all of us.\n\nWe're *all* struggling. So, please have some empathy for your daughter's teachers too. I assure you that we're trying out best, and if some aren't doing so well at that, it's because this has been a very new and difficult transition for everyone involved.\n\nEdit: Because I read some of your other comments, just know, nearly all of us have reduced our coursework for the semester. Students just don't realize that because some of the work they are assigned would've been done in the actual class period. For example, for my class, the students often have chapter readings, a discussion post, and an activity each week. The activity would've normally been done during class, but because everything is online, students consider it homework outside of class (which is just a perception issue).",
              "author": "Admirable_Mud_7423",
              "created": 1605138451,
              "upvotes": 15,
              "replies": {
                "gc0i6pf": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0i6pf/",
                  "text": "Thanks for chiming in. That lady’s response was totally invalid and frustrating",
                  "author": "xFaro",
                  "created": 1605159028,
                  "upvotes": 1,
                  "replies": {
                    "gc0j4on": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0j4on/",
                      "text": "No, thank you! Your original comment honestly made my night much better.",
                      "author": "Admirable_Mud_7423",
                      "created": 1605159557,
                      "upvotes": 2,
                      "replies": {
                        "gc0kphw": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0kphw/",
                          "text": "I’m glad to have helped. Mind if I ask what you teach?",
                          "author": "xFaro",
                          "created": 1605160548,
                          "upvotes": 1,
                          "replies": {
                            "gc0liiv": {
                              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0liiv/",
                              "text": "Sure! This semester I'm teaching an introduction to research methods course (mostly to adpr, business, and marketing students). It's honestly not that bad of a class to teach online (my students seem to like it), it's more just the time it's taking to transition it online in the first place/restructuring the whole course as it used to be based mostly on group projects.",
                              "author": "Admirable_Mud_7423",
                              "created": 1605161045,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gbz4rq9": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz4rq9/",
              "text": "In my experience as a college freshman, teachers and professors are NOT taking out their own stress by assigning more difficult work. My chemistry professor certainly doesn't want to be teaching to a zoom full of black screens and no interaction. I personally know a lot of high school teachers who are MISERABLE recording their lessons in an empty classroom. Teachers and professors teach because they want to, not because they want to make students' lives miserable. \n\nIn some classes, where every assignment is designated open book/internet (because it's near impossible to regulate cheating without using programs like Proctorio), yes, the tests and assignments are harder. That's not the professor wanting to make me cry, it's the professor trying to make sure I know the material instead of just getting really good at using the internet. \n\nI get that this makes it harder. I've been there. We all have to push through and work together and have empathy for others. Just as we are learning to take our classes remotely, educators are learning to teach classes remotely. It's not a smooth transition, and everyone involved is under a lot of stress. Be kind to your children, students, teachers, and your children's' teachers, because everyone is just doing their best.",
              "author": "psycho-pisces",
              "created": 1605131629,
              "upvotes": 23,
              "replies": {}
            },
            "gbytjs4": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbytjs4/",
              "text": "> It’s selfish and unprofessional for professors to take their own stress out on students by assigning heavier, more difficult workloads and having zero empathy.\n\nI couldn’t agree with this more. That’s why I included the caveat that some professors have been terrible, but I was assuming it to be a small minority. Maybe I’m wrong since I’m mostly going off of anecdotal experience from me and my friends, but OP seemed to be implying it was a large majority of professors who act this way, which I don’t think is true. \n\nI’m wondering if there is a difference in how high school teachers act versus college professors?",
              "author": "xFaro",
              "created": 1605124497,
              "upvotes": 10,
              "replies": {}
            },
            "gbzdnyj": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzdnyj/",
              "text": "I could be totally wrong here but I get the feeling you’re a parent that calls us on behalf of your child and then raises hell when we kindly explain FERPA.",
              "author": "OHmyblueberries",
              "created": 1605136338,
              "upvotes": 6,
              "replies": {
                "gbzeemu": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzeemu/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1605136737,
                  "upvotes": 3,
                  "replies": {
                    "gbzkirl": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzkirl/",
                      "text": "I respect that and my bad for the false impression.",
                      "author": "OHmyblueberries",
                      "created": 1605140155,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gby5eh2": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby5eh2/",
      "text": "I graduated a few years ago and let me tell you I feel for you guys. I get paid to work from home now and I beat myself up mentally because I am not motivated at home. I never have been. I’m not even that social, but the routine of going to the classroom or going to work and having a scheduled day is actually really important to my mental health. \n\nYou guys not only aren’t getting paid, but you’re actually paying for this disaster. Don’t get me wrong some people are thriving doing online school/work, but there’s a lot of us that aren’t. Humans aren’t built to live in isolation. It’s unnatural to us and that shows in our reaction to it. So don’t beat yourself up over it. You’re totally normal and not alone. Give yourself days where you don’t do any work and other days actually write out a realistic schedule and follow it. Make time for exercise even if it’s just putting on music or a podcast and doing some stretching for 10 mins. \n\nAlso, don’t do anything super dangerous, but you should still be visiting with friends/family. Outdoor coffee shop, backyard, Skype, whatever. Depression for a young person is very serious, and much more serious than Corona in my opinion for young people. Just take reasonable precautions.",
      "author": "nailpolishlover12",
      "created": 1605112583,
      "upvotes": 70,
      "replies": {}
    },
    "gby24g3": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby24g3/",
      "text": "Ever since this semester started (this is my 2nd year in college going for electrical engineering) and all my classes have made a discord group chat, it has helped everyone incredibly and it makes the class go by smoother and better, you make good friends and just talk about things other than class and homework, I recommend everyone doing this, because you can't do everything on your own. \n\nHaving a discord for every class is so much helpful because if you're stuck on homework or whatever the case may be, you can hop into the group chat and someone will most likely be up and help out, when the prof isn't able to help at 2am. Hell if and when we get back to physical classes still make a discord chat or whatever you like to use for the class because it is helpful.",
      "author": "edlightenme",
      "created": 1605110938,
      "upvotes": 169,
      "replies": {
        "gbygwx1": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbygwx1/",
          "text": "I second this. Also makes you feel a whole lot less alone in the semesterly struggle. I'm in a discord group for 2 of my classes and a groupme for another. It has made everything so much more bearable, and even enjoyable at times.",
          "author": "BiggerAntMan",
          "created": 1605118235,
          "upvotes": 30,
          "replies": {
            "gbyhemv": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyhemv/",
              "text": "Hey that awesome! Yeah Idk how I've managed to do it without a group chat, plus it brings everyone closer and you talked to people who you would probably not talk to in physical classes. Going from talking to maybe 1 to 2 people to talking to many in the class. Truly goes to show how the internet can bring people close.",
              "author": "edlightenme",
              "created": 1605118479,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gbyxph2": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyxph2/",
          "text": "I'm so grateful for my colleges CS discord. A bunch of students set up a really nice and professional discord for any student in CS you can \"enroll\" in your classes that semester to get access to the class specific chat rooms, alot of the TAs join to help, they have a great team of mods to watch for cheating, voice chat study rooms, and a bunch of non school related chat channels to talk about hobbies. Throw in a bit of networking and an opensource bot for all the CS students to work on and it's just amazing.",
          "author": "TheBlackNight456",
          "created": 1605126558,
          "upvotes": 15,
          "replies": {}
        },
        "gbyk6zh": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyk6zh/",
          "text": "[deleted]",
          "author": null,
          "created": 1605119866,
          "upvotes": 8,
          "replies": {
            "gbynhna": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbynhna/",
              "text": "What's funny is that while we're in a a lecture we just talk shit and send memes about how boring the class is 😂",
              "author": "edlightenme",
              "created": 1605121492,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "gby0za1": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby0za1/",
      "text": "I don’t get why professors don’t realize that we’re stressed out",
      "author": "RandomRedditor44",
      "created": 1605110354,
      "upvotes": 77,
      "replies": {
        "gbzge00": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzge00/",
          "text": "I don't get why you think they don't.",
          "author": "jacxy",
          "created": 1605137834,
          "upvotes": 12,
          "replies": {}
        },
        "gbyf0nf": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyf0nf/",
          "text": "We, teacher's, are stressed out too. However,  the educational system demands us to get grades, to assign homework.  We are all tired. It is not us the ones to blame.",
          "author": "rioschala99",
          "created": 1605117297,
          "upvotes": 29,
          "replies": {}
        },
        "gby3dpx": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby3dpx/",
          "text": "Students are always stressed out, whether there's a pandemic or not. For professors not much has changed in that regard.",
          "author": "Bozzz1",
          "created": 1605111565,
          "upvotes": 57,
          "replies": {
            "gbybqod": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbybqod/",
              "text": "The point they were making I think is that there’s even more stress than usual because we have normal school stress mixed in w pandemic stress",
              "author": "breadstick49",
              "created": 1605115686,
              "upvotes": 21,
              "replies": {
                "gbze2ia": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbze2ia/",
                  "text": "As do your institutions faculty and staff! You guys keep missing that part.",
                  "author": "OHmyblueberries",
                  "created": 1605136555,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "gbycdr2": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbycdr2/",
              "text": "Well then professors need to lay off if they’re aware",
              "author": "drkcty",
              "created": 1605116003,
              "upvotes": 2,
              "replies": {
                "gbydesd": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbydesd/",
                  "text": "Professors have curriculum they need to teach. If they just \"~~layed~~ laid off\"  every time a student felt stress no one would learn anything.",
                  "author": "Bozzz1",
                  "created": 1605116515,
                  "upvotes": 37,
                  "replies": {
                    "gbz4up3": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz4up3/",
                      "text": "They can teach the curriculum without assigning ridiculous amount of work",
                      "author": "TexasGulfOil",
                      "created": 1605131673,
                      "upvotes": -5,
                      "replies": {}
                    },
                    "gbyxtrj": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyxtrj/",
                      "text": "Laid*. Secondly tho, they can make changes to curriculum or alter the schedule to allow different times for the work to be turned it. My professors do a great job with that.",
                      "author": "drkcty",
                      "created": 1605126618,
                      "upvotes": -6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gbxyv00": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbxyv00/",
      "text": "I’m sorry but even with in-person learning, in college, home is no longer a place for limited learning. Sorry to disappoint you.",
      "author": "maustinv",
      "created": 1605109269,
      "upvotes": 32,
      "replies": {
        "gby10e6": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby10e6/",
          "text": "I do terrible work at home. I do my best work in the library, coffee shops or office. Sometimes I go and sit in my car in the driveway (I still get WiFi) to get work done.",
          "author": "wives_nuns_sluts",
          "created": 1605110369,
          "upvotes": 63,
          "replies": {}
        },
        "gby385z": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby385z/",
          "text": "It's hard to go to other places during Covid.  I never studied well at home, I always studied at a coffee shop or the library.",
          "author": "InformalScience7",
          "created": 1605111487,
          "upvotes": 39,
          "replies": {}
        },
        "gby18m0": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby18m0/",
          "text": "That is what I am slowly realizing now (I am a freshmen)",
          "author": "KubaSv",
          "created": 1605110487,
          "upvotes": 11,
          "replies": {
            "gby1fzd": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby1fzd/",
              "text": "Yeah it’s a huge adjustment from high school and I’m sorry you have to acclimate during remote learning.",
              "author": "maustinv",
              "created": 1605110592,
              "upvotes": 12,
              "replies": {
                "gby1sn5": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby1sn5/",
                  "text": "I was prepared for a lot of studying (law degree, it lasts 5 years in the Czech Republic) But it still caught me off guard.",
                  "author": "KubaSv",
                  "created": 1605110773,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "gbyih27": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyih27/",
          "text": "It very well can be, why would you say otherwise? We had libraries that were open quite late (til midnight even on weekends), I had a place to study at work during breaks or just before/after clocking out, there was always plenty of coffee shops to study in… I literally almost never did schoolwork at home. The stuff I did at home was stuff I considered easy or rote. For example, practicing flash cards, reading a short or interesting article, etc- but usually not even that. And I was in the top of the class. \n\nObviously none of these are really options anymore.",
          "author": "starshappyhunting",
          "created": 1605119013,
          "upvotes": 6,
          "replies": {}
        },
        "gbzlp1r": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzlp1r/",
          "text": "When I was doing in-person classes, the majority of my work was done at college in the library/on campus. I was able to separate school from home with in-person classes, but with remote learning I can't.",
          "author": "ThoughtCenter87",
          "created": 1605140761,
          "upvotes": 2,
          "replies": {}
        },
        "gbyp2bq": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyp2bq/",
          "text": "And just like that, my mental illnesses that make me easily distracted and staying motivated while working from home are gone forever. Thank you stranger. If only I had thought of this sooner, school during COVID wouldn’t be harder than my 9 months in Afghanistan when I was staring at screens for 12+ hours a day.",
          "author": null,
          "created": 1605122287,
          "upvotes": 1,
          "replies": {
            "gbyq1br": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyq1br/",
              "text": "I’m not trying to discourage anyone. And I’m not trying to insult the efforts and struggles of students right now. I’m just sharing from past experience that college is a shitton of work whether in-person or online. And you don’t get the same separation of home life and work life as you do in high school, even with in-person classes. It bleeds over into all aspects of your life. Also, thank you for your service.",
              "author": "maustinv",
              "created": 1605122767,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gbyncuv": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyncuv/",
          "text": "I’m sorry but it really is. I had a very toxic home environment and wouldn’t have been able to do any work. All my work was done in the library, empty classrooms, or any open spots on campus.",
          "author": "FearDontExist1124",
          "created": 1605121426,
          "upvotes": 1,
          "replies": {
            "gbyoouu": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyoouu/",
              "text": "Okay I keep getting a lot of comments like this. I get that not everyone works in their rooms, and people have different circumstances. I guess I’m surprised people are able to limit work at home. I can spend 20hrs in the library each week, and I’ll still be working almost every waking moment I’m at “home” (my dorm).",
              "author": "maustinv",
              "created": 1605122096,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gbxwg9o": {
      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbxwg9o/",
      "text": "I feel like a big part of the problem is department heads so detached from reality they don’t realize the course requirements are literally grinding their students to the bone. Hang in there brother",
      "author": "pilotdude7",
      "created": 1605108017,
      "upvotes": 740,
      "replies": {
        "gby1af1": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gby1af1/",
          "text": "I got so lucky because one of my professors had to suddenly step down, and the *head of the math department* came to teach the class. And she's WAY better than my professor ironically. She already is way more lenient and is much better at explaining things imo.",
          "author": "pancakebirdpowder74",
          "created": 1605110512,
          "upvotes": 207,
          "replies": {}
        },
        "gbykujq": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbykujq/",
          "text": "My uni has eliminated all 3-day weekends this semester, so we literally haven’t had a single break (minus weekends, which are used for catchup) since late August. We are absolutely drained by now, esp since some of our professors have ramped up the difficulty to accommodate for everything being open book/notes.\n\nNext semester, they’re taking away our Spring break and replacing it with two “Wellbeing Wednesdays”, because that’s obviously a fair trade. /s\n\nI’m burnt out, I’m depressed, and I’m ready to give up on school any second now.\n\nFuck the department heads, fuck the chancellor, and fuck my life. This shit fucking sucks.",
          "author": "PlowDaddyMilk",
          "created": 1605120189,
          "upvotes": 164,
          "replies": {
            "gbz4ig6": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz4ig6/",
              "text": "We have no thanksgiving break, no fall break, no three day weekend, no breaks at al!! OH and the REAL kicker is that Spring Break is also cancelled!! I can’t wait!",
              "author": "slantedsc",
              "created": 1605131489,
              "upvotes": 49,
              "replies": {
                "gc0k88b": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0k88b/",
                  "text": "Wait what how can they do that, what reason could they possibly have",
                  "author": "purpleplaza777",
                  "created": 1605160246,
                  "upvotes": 4,
                  "replies": {
                    "gc0t3im": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0t3im/",
                      "text": "The idea is to not let students go home and come back. They don't want them to catch the virus at home and bring it to campus or vie versa. It sucks for students, but I do understand the rationale.",
                      "author": "katsteve",
                      "created": 1605165990,
                      "upvotes": 14,
                      "replies": {
                        "gc16ir2": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc16ir2/",
                          "text": "The thing is we’re not coming back for spring semester, it’s all gonna be online. nobody’s even there now. They’ve just not officially announced it and keep pretending they’re planning it around us coming back potentially, in which case they wouldn’t want people leaving for a week during breaks etc, but all our classes are online so the teachers need breaks, the students need breaks, and it’s just a lose lose.",
                          "author": "slantedsc",
                          "created": 1605175996,
                          "upvotes": 6,
                          "replies": {
                            "gc1zv31": {
                              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc1zv31/",
                              "text": "It's for the students living on campus and working on campus. Even if all classes are online, they don't want people spreading disease to one another in campus housing or in campus buildings. As an example, most of our classes are online, but students still come into the library to study and are in contact with employees in the building. Same for campus dining. Unless all buildings are officially closed, it's risky to have long breaks. That said, I am very much going to miss spring break.",
                              "author": "badgersssss",
                              "created": 1605196686,
                              "upvotes": 1,
                              "replies": {
                                "gc51qwn": {
                                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc51qwn/",
                                  "text": "No i mean it’s online as in it’s completely remote and campus is completely closed. No campus jobs, all dorms are closed, completely deserted campus and everyone is remote.",
                                  "author": "slantedsc",
                                  "created": 1605260731,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gbz9u8h": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbz9u8h/",
              "text": "My school scheduled classes on the weekend as well to make for days lost after Thanksgiving. It's been a long semester for everybody.",
              "author": "WoodlandWizard77",
              "created": 1605134319,
              "upvotes": 10,
              "replies": {
                "gc02uk3": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc02uk3/",
                  "text": "Same for me. Fantastic idea, imo- five extra lectures, a one-day weekend, *and* no time to finish my assignments!",
                  "author": "ibleedconfetti",
                  "created": 1605149778,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gbysufo": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbysufo/",
              "text": "ha we have weekend projects and proctorio",
              "author": null,
              "created": 1605124152,
              "upvotes": 14,
              "replies": {
                "gbyta6t": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyta6t/",
                  "text": "i see your weekend projects and raise you a 2-semester design project with four 30-minute presentations and a lazy group",
                  "author": "PlowDaddyMilk",
                  "created": 1605124366,
                  "upvotes": 9,
                  "replies": {
                    "gbyzua6": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyzua6/",
                      "text": "not until the final two semesters for me thank fuck",
                      "author": null,
                      "created": 1605127629,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gc083tg": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc083tg/",
              "text": "thank god for a 5 week break soon",
              "author": "zarnonymous",
              "created": 1605152887,
              "upvotes": 2,
              "replies": {}
            },
            "gc0g65x": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0g65x/",
              "text": "That man's (chancellors) salary lmfao, shit is wack  I assume we go to the same school because of the oh so generous \"wellness wednesdays\"",
              "author": "Desto2014",
              "created": 1605157838,
              "upvotes": 2,
              "replies": {}
            },
            "gc2wngr": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc2wngr/",
              "text": "brooo is this UMass?",
              "author": "puffinmunkin",
              "created": 1605211475,
              "upvotes": 2,
              "replies": {
                "gc2wskx": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc2wskx/",
                  "text": "unfortunately yes lol",
                  "author": "PlowDaddyMilk",
                  "created": 1605211544,
                  "upvotes": 1,
                  "replies": {
                    "gc2yfud": {
                      "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc2yfud/",
                      "text": "yeessss ahaha i dont understand how they're inviting all freshmen back regardless of in person classes and then expecting the canceling of spring break to change anything... if freshmen live on campus with all remote classes,,, they can still leaveee and have spring break remote somewhere... make it make SENSE",
                      "author": "puffinmunkin",
                      "created": 1605212321,
                      "upvotes": 2,
                      "replies": {
                        "gc339by": {
                          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc339by/",
                          "text": "legit that’s exactly how i feel about it. Like they’re taking all these precautions to mitigate covid spread (which is obviously good), and taking away our spring break to do so, but then they turn around and say that all the freshman are being welcomed on to campus? The fuck??\n\nOnly thing i can think of is that they’re saying this to get a bunch of people to pay tuition, only to turn around at the last minute and be like “oh hey sorry, we’re switching back to online-only for freshmen.” I could def see swammy pulling some scummy shit like that",
                          "author": "PlowDaddyMilk",
                          "created": 1605214623,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gc3mm1p": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc3mm1p/",
              "text": "Two well being wednesday lmao what a joke. My college also canceled spring break. A random Wednesday off does nothing. Yay I get to miss a 50 minute lecture but I still have thousands of things due!",
              "author": "lovingtolive",
              "created": 1605224490,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gbyls9c": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbyls9c/",
          "text": "I honestly think you could recreate American Psychopath and have it take place in a university with Patrick Batemen as a professor and it would only make the movie more realistic. \n\nI have never seen more lack of sympathy and coldness than I have from professors - and this is coming from somebody that works retail.",
          "author": "Sir_Meowstro",
          "created": 1605120647,
          "upvotes": 19,
          "replies": {}
        },
        "gbykbgl": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbykbgl/",
          "text": "Sometimes, I feel like stupid General Education requirements are worse!",
          "author": "lifeofahistorymajor",
          "created": 1605119929,
          "upvotes": 12,
          "replies": {}
        },
        "gbzk39h": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzk39h/",
          "text": "I don’t think most undergraduates understand the professors role at the University (unless at community college). \n\nTheir primary role is not teaching. They not only make most of the content which takes way longer than it does to present it (please make a 50min fast paced powerpoint and present it if you don’t believe me), but they need to be constantly writing grants, submitting proposals, managing research labs, dealing with admin and school operations, and keeping up with publications and literature. \n\nEven from my perspective as a grad student who works 65 hour weeks (only 20 of which is teaching) college is not a 9-5 job type deal. For every credit your registered for you need to spend 3 hours outside lecture to master the material. For full-time (takes 5 years to graduate at this pace) you should be spending a minimum of 36 hours doing assignments and studying outside lectures. \n\nMy boss is in 7 days a week 11 hours a day trying to fulfill what the school is asking of him. So there’s zero tolerance for people complaining about the workload unfortunately. \n\nBut he does try to give extensions when he is recognizing someone who is overwhelmed, and he still has seen lower scores than ever before in his 35 years teaching. I respect him, and he cares even though he does push his students to learn as much as possible. \n\nI do get sitting at the computer all day though, it’s tough but either you learn the material or fail. We cant lessen the standards even farther (especially the US as education has gotten really bad here). \n\nIf your having a hard time, please take a year or two off and come back when things get back to normal. You will still need to work your butt off to get through it but hopefully the social aspect and “suffering together” with peers will help you get through it. It did for me. Another option is to take less classes until things get back to normal so your not suffering so much. \n\nHaving the right environment is key to success in a full time school load. Zoom and online makes this near impossible for most.\n\nI feel the pain believe me. I do think we all need to work together to get through but I’m sure some professors are being dicks, but they are likely that way in person as well. \n\nEven with in person classes, I had a a few professors who would assign 40+hour take home exams during exam week. I did not sleep for several days straight when in their classes during exam weeks. Many times I thought I would not make it. \n\nWas I pissed? Yes. Did I work alone? Yes (or it’s cheating) Did I suffer? Immensely. Do I hate the professor? Hate their guts. Are they different online? NO! \n\nDid I get through it? Yes. \n\nStay strong guys you can do it but it won’t be easy. \n\nGood luck!",
          "author": "chemnerdgirl",
          "created": 1605139920,
          "upvotes": 14,
          "replies": {
            "gbzkthe": {
              "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzkthe/",
              "text": "Yeah professors are hired for research first, teaching second. It makes alot more sense now when I see why my teachers are so bad or uncaring",
              "author": "alarosteo",
              "created": 1605140311,
              "upvotes": 8,
              "replies": {
                "gc07gyn": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc07gyn/",
                  "text": "Actually, I'd say the vast majority really care about teaching. The problem isn't our lack of caring. The problem is the incentive system.\n\nYour education frankly doesn't matter. Incredible professors don't get rewarded for their effort or for their class results. I'll get a slap on the hand if my students underperform, but I get absolutely nothing if they all ace the course. If anything, we're punished because the only metric anyone cares about is research, and by spending time caring about *you*, we neglect that research work. Any idiot in that system will immediately figure out the best course of action is to sacrifice teaching. The alternative is to lose your job and not be teaching *or* doing research at all.\n\nPeople who don't enjoy teaching are put in charge of intro courses they hate and have teaching loads too high. People who love teaching are forced to spend most of their time worrying about research, or are earning below minimum wage and living out of their car. \n\nYour professors are doing *at least* double the amount of work you're doing: research as their full-time job *plus* teaching *plus* marking *plus* admin *plus* service work like paper reviews, committees, PhD vivas all around the world, etc. If you're slacking, procrastinating, and finding it hard to be chipper in your 9am lecture, then your professor is obviously not having a good time either. Most of your professors are struggling *at least* as hard as you are right now, but students expect leniency while professors are allowed none. \n\nThe only reason half of them haven't had a total breakdown is because they're not allowed to. There's no one else to teach. They have no choice but to carry on, to show up to every lecture, to mark every assignment, to post updates to the LMS. They get snappier, slower, and make more mistakes, but it has to be done.",
                  "author": null,
                  "created": 1605152501,
                  "upvotes": 9,
                  "replies": {}
                },
                "gbzluwi": {
                  "link": "/r/college/comments/js8wb0/a_letter_to_professors/gbzluwi/",
                  "text": "Yeah I hate that aspect of Universities. I decided I am not going to be a professor for these reasons as it drives me mad. \n\nSo give extra kutos to the professors who are good at teaching and are helpful to you. They don’t have to do good to keep their job, but they are ones that make the extra effort even tho they don’t have to because they care about YOU! \n\nSadly you can’t say that about all of them (or even most of them). \n\nI would love to be a professor but I can’t stand working with those types of professors who don’t care about student development and are just jerks who can’t be fired cause they have tenure. 😢",
                  "author": "chemnerdgirl",
                  "created": 1605140844,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gc0mzzi": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0mzzi/",
          "text": "Department heads are struggling too. Aim higher, also take a good look at football coaches.",
          "author": "chulala168",
          "created": 1605161939,
          "upvotes": 1,
          "replies": {}
        },
        "gc0ssph": {
          "link": "/r/college/comments/js8wb0/a_letter_to_professors/gc0ssph/",
          "text": "The course requirements are no different than they ever have been. If anything, they are more lenient now that classes are online. This is completely backwards.",
          "author": null,
          "created": 1605165769,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634055470
}