{
  "sid": "qg9thk",
  "link": "/r/college/comments/qg9thk/what_is_proper_office_hours_etiquette/",
  "title:": "what is proper office hours etiquette?",
  "text": "Never been one to go to a lot of office hours but now I have to go pretty often for my senior sem class. If there is someone already in the office, should I sit outside or leave and come back later? I don’t want to be rude but I also can only come during one period of her office hours.",
  "author": "what2000",
  "created": 1635264643,
  "updated": 1635302368,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hi4si57": {
      "link": "/r/college/comments/qg9thk/what_is_proper_office_hours_etiquette/hi4si57/",
      "text": "It may depend on the instructor - I personally prefer that students come in and listen because often multiple students have the same questions so it's more efficient. I have seen others who prefer to talk to students one at a time. (I think this also depends a little on discipline, since my approach is pretty standard in my department)\n\nYou could try knocking lightly on the doorframe. They'll likely either tell you to come in or to wait. Or you can just ask the instructor what they would prefer.",
      "author": "reyadeyat",
      "created": 1635266211,
      "upvotes": 5,
      "replies": {}
    },
    "hi5rnvr": {
      "link": "/r/college/comments/qg9thk/what_is_proper_office_hours_etiquette/hi5rnvr/",
      "text": "If its during office hours, let the professor know you are there and wait outside. The professor should do their best to meet with all students during office hours (within reason) and needs to know you are waiting. \n\nIf its outside office hours, but there's a student in there just leave and come back later. Likely the professor is choosing to spend their time with that student for a reason. It is not a sign of 'open' office hours.",
      "author": "hdorsettcase",
      "created": 1635279911,
      "upvotes": 2,
      "replies": {}
    },
    "hi5yk81": {
      "link": "/r/college/comments/qg9thk/what_is_proper_office_hours_etiquette/hi5yk81/",
      "text": "Depends on the professor and the kind of class. If this is the kind of class that has homework assignments that everyone is working on it might be better just to go in the classroom and there's a chance to questions already being answered. If this is a much more individualized class where you want to talk about a research project or a paper or an individual project then it's more polite to wait outside so that the professor or the other student don't feel",
      "author": "Thelton26",
      "created": 1635282589,
      "upvotes": 1,
      "replies": {}
    },
    "hi5cf12": {
      "link": "/r/college/comments/qg9thk/what_is_proper_office_hours_etiquette/hi5cf12/",
      "text": "> Or you can just ask the instructor what they would prefer.\n\nThis always works.",
      "author": "PersephoneIsNotHome",
      "created": 1635274042,
      "upvotes": 0,
      "replies": {}
    }
  }
}