{
  "sid": "q00zsb",
  "link": "/r/college/comments/q00zsb/best_class_to_take_in_8_weeks_time/",
  "title:": "Best Class to Take in 8 Week’s Time?",
  "text": "I’m a biology major at my local community college and was hoping on graduating within 2 years.  This means I have to take a lot of math/science heavy courses, I was hoping to split some of them into 8 weeks so I can take more at once in addition to summer classes.  I was wondering which would be the best to take in that regard, as in the least material and stress?  There is going to be calc of biology and medicine, physics, chem, organic chem, and botany/zoology.",
  "author": "Weird_Dragonfruit704",
  "created": 1633200592,
  "updated": 1634089689,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hf4zqcu": {
      "link": "/r/college/comments/q00zsb/best_class_to_take_in_8_weeks_time/hf4zqcu/",
      "text": "Don’t do physics in just 8 weeks, it’s a tough course for most bio majors, and needs time to soak in. \n\nDo the gen eds in 8 weeks if you can, those will be relatively easy.",
      "author": "AceyAceyAcey",
      "created": 1633205824,
      "upvotes": 5,
      "replies": {
        "hfb138k": {
          "link": "/r/college/comments/q00zsb/best_class_to_take_in_8_weeks_time/hfb138k/",
          "text": "Definitely! Especially since I realized I haven’t ever taken that class before.",
          "author": "Weird_Dragonfruit704",
          "created": 1633315177,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hf5ogu0": {
      "link": "/r/college/comments/q00zsb/best_class_to_take_in_8_weeks_time/hf5ogu0/",
      "text": "I took bio 1 over 5 weeks and it was do-able. I’m glad I did it because I could just spend all my time focusing on just one class. It took all my free time but it was not hard. I don’t have experience with taking chem/physics over winter but I’d be careful before doing that. \nBtw I took my bio course online during the pandemic.",
      "author": "QuickEquivalent0",
      "created": 1633216686,
      "upvotes": 2,
      "replies": {
        "hfb14zc": {
          "link": "/r/college/comments/q00zsb/best_class_to_take_in_8_weeks_time/hfb14zc/",
          "text": "May I ask how you were able to do in it?  I’m thinking of taking chem then bio for the 8 week.",
          "author": "Weird_Dragonfruit704",
          "created": 1633315202,
          "upvotes": 1,
          "replies": {
            "hfbghla": {
              "link": "/r/college/comments/q00zsb/best_class_to_take_in_8_weeks_time/hfbghla/",
              "text": "It was through my community college. They had a winter intercession that was normally 6 weeks, but for whatever reason, they shortened it to 5 weeks. My school no longer offers this intercession anymore, but you could still do the same thing over a summer session. I think it was a great course to do online. Best science one to do online.",
              "author": "QuickEquivalent0",
              "created": 1633324007,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}