{
  "sid": "q8tjba",
  "link": "/r/college/comments/q8tjba/studying_in_europe_as_an_international_student/",
  "title:": "studying in europe as an international student",
  "text": "i posted [this](https://www.reddit.com/r/college/comments/q881gr/how_do_people_afford_college/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) yesterday and i got a lot of mixed responses\n\na lot of people talked about education being very cheap in europe. i've been looking for options in europe and tbh i haven't found any as good as some people commented on the OP so if any of you guys know about any art school / uni with visual arts degrees in europe it would be VERY helpful 🥺",
  "author": "cocteautwinx",
  "created": 1634319873,
  "updated": 1634583362,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hgrr7jf": {
      "link": "/r/college/comments/q8tjba/studying_in_europe_as_an_international_student/hgrr7jf/",
      "text": "There's a lot of countries in Europe, they vary wildly. And cheap prices most of the time only apply for citizens of the European Union, which get national prices instead of international ones.\n\nThough there are exchange programs that could cost less money.\n\nEdit: which languages do you speak?",
      "author": "Xavier_Carax",
      "created": 1634323233,
      "upvotes": 2,
      "replies": {
        "hgs2u9d": {
          "link": "/r/college/comments/q8tjba/studying_in_europe_as_an_international_student/hgs2u9d/",
          "text": "english spanish and italian (kinda) but something about italy doesnt completely sit right with me and im looking for a BA in engish",
          "author": "cocteautwinx",
          "created": 1634328122,
          "upvotes": 1,
          "replies": {
            "hgs5579": {
              "link": "/r/college/comments/q8tjba/studying_in_europe_as_an_international_student/hgs5579/",
              "text": "In the case of Spain, I know that several universities have exchange programs with non-EU countries. If you are interested you can search the specifics on the Internet.\n\nI don't know the price for non-EU students. My tuition fee this year costed me 350 euros (around 400$), but I was eligible for a discount, it usually costs 800 euros (840$). That is the price in the Autonomous Community of Andalusia, concretely Granada. The prices of tuition fees vary from Autonomous Community to Autonomous Community.",
              "author": "Xavier_Carax",
              "created": 1634329124,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgsv7v6": {
      "link": "/r/college/comments/q8tjba/studying_in_europe_as_an_international_student/hgsv7v6/",
      "text": "Usually those very low prices are only for EU citizens. Look into Germany, I believe they offer free tuition to international students too ( but they might not offer your program in English).",
      "author": "Dry-Razzmatazz8352",
      "created": 1634341425,
      "upvotes": 1,
      "replies": {}
    }
  }
}