{
  "sid": "qsdf12",
  "link": "/r/college/comments/qsdf12/college_cooking/",
  "title:": "College & Cooking",
  "text": "Hey there, so I recently moved out for uni and I'm struggling quite a lot to eat. I am not a bad cooker it's just that I'm too lazy to cook and even too lazy to buy food. RN I just have 3 eggs on my fridge but I am extremely behind the term so I have no time to lose to go and buy food. What should I do? IK it may sound stupid but I am dead serious.\n\nThank you so much!",
  "author": "universitykiddo",
  "created": 1636730390,
  "updated": 1637399889,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkcbfwe": {
      "link": "/r/college/comments/qsdf12/college_cooking/hkcbfwe/",
      "text": "Either motivate yourself to cook the eggs, go to the dining hall if you live on campus, or pay for a delivery service to bring you a meal or groceries.",
      "author": "kizeltine",
      "created": 1636730876,
      "upvotes": 2,
      "replies": {
        "hkce2c0": {
          "link": "/r/college/comments/qsdf12/college_cooking/hkce2c0/",
          "text": "This- OP should check with local grocery stores, most if not all offer delivery options.",
          "author": "whatistheformat",
          "created": 1636731958,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkcbmcd": {
      "link": "/r/college/comments/qsdf12/college_cooking/hkcbmcd/",
      "text": "r/eatcheapandhealthy",
      "author": "Brandon_partain",
      "created": 1636730951,
      "upvotes": 1,
      "replies": {}
    },
    "hke2va5": {
      "link": "/r/college/comments/qsdf12/college_cooking/hke2va5/",
      "text": "What is your kitchen set up? \n\nOnce a week or every other week, do a grocery run. Buy a basic food that you can eat with other foods, like minute brown rice. Have a basic seasoning or sauce on hand that you can eat with a lot of things, like soy sauce. Add your eggs to it, or whatever else you like to eat. Avocados are easy to add and don't need to be cooked. Other veggies? Have a cooking oil, like olive oil. \n\nIf you need something fast-- peanut butter sandwiches with banana is cheap and quick. Go for the healthy breads, like whole wheat.\n\nTry meal prepping. Basically, make a big batch of something that you could eat over multiple days. I like to always have a big tub of hummus in my fridge for emergency eating. Goes with veggies, bread, and crackers. Having a big block of cheese can also work.\n\nI like frozen vegetables for their convenience and nutrition, especially cauliflower and carrots..",
      "author": "zifmer",
      "created": 1636757626,
      "upvotes": 1,
      "replies": {}
    }
  }
}