{
  "sid": "qrkz93",
  "link": "/r/college/comments/qrkz93/community_or_state_university/",
  "title:": "Community or State University?",
  "text": "Hi Everyone (●’◡’●)ﾉ\n\nCurrently, I (19) am going to a state University that is costing me around $30k a year. I thought I had chosen a college that was on the cheaper side but with the cost of loans, that idea quickly diminished. I have been searching online for community colleges. They are way more affordable but many of them don't offer my specific degree program. \n\nI have been thinking about changing my degree anyway so that isn't a problem. My question is, is state University worth the money? And how is going to a community college different? I really need some help. Thank you!!! 🍄",
  "author": "Kayepekia",
  "created": 1636636220,
  "updated": 1637389793,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hk76ahs": {
      "link": "/r/college/comments/qrkz93/community_or_state_university/hk76ahs/",
      "text": "What degree? A community college is there to just knock out your prerequisites from Freshman and Sophomore year to save money, they don't really do specific upper level classes. A CC should have the prerequisites required later for your major, especially if its a feeder school for your University.",
      "author": "Sermos5",
      "created": 1636636842,
      "upvotes": 9,
      "replies": {}
    },
    "hk764ju": {
      "link": "/r/college/comments/qrkz93/community_or_state_university/hk764ju/",
      "text": "Even if a community college doesn’t have your specific major, you can still take classes there undecided. Just look at the state school you’d like to finish at and find their academic plan and graduation requirements for your major, and take classes that transfer at your CC. If done right, CC is 10000000% worth it IMO. The “college experience” is a total sham, and just an excuse for people to get fucked up on drugs and alc. I loved my time at my CC more than my 4 year",
      "author": "Garrettcarr102",
      "created": 1636636759,
      "upvotes": 7,
      "replies": {
        "hk769im": {
          "link": "/r/college/comments/qrkz93/community_or_state_university/hk769im/",
          "text": "Thank you for being so helpful. The college experience was never in my plans because I'm an introvert. But community college definitely seems worth it.",
          "author": "Kayepekia",
          "created": 1636636829,
          "upvotes": 3,
          "replies": {
            "hk76gsb": {
              "link": "/r/college/comments/qrkz93/community_or_state_university/hk76gsb/",
              "text": "Just make sure you communicate with advisors, and transfer services, and do a lot of research on your own about what classes you’ll need. Saved me about $25,000 in tuition 🤷‍♂️",
              "author": "Garrettcarr102",
              "created": 1636636931,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hk7ozcn": {
      "link": "/r/college/comments/qrkz93/community_or_state_university/hk7ozcn/",
      "text": "my biggest regret was not going to either community college or a cheaper university to at least do my gen eds . state school is not worth the price.",
      "author": "thot_bryan",
      "created": 1636645506,
      "upvotes": 1,
      "replies": {}
    },
    "hk7rpd1": {
      "link": "/r/college/comments/qrkz93/community_or_state_university/hk7rpd1/",
      "text": "A four year state university really isn’t worth it the first two years if you have to take out loans and it’s an unnamed state school.\n\nI’m currently going to CC for free which means two years of no debt. If I chose to go, I would’ve had to loan out a minimum of $20k per year.",
      "author": "kizeltine",
      "created": 1636646672,
      "upvotes": 1,
      "replies": {}
    },
    "hk8j6z9": {
      "link": "/r/college/comments/qrkz93/community_or_state_university/hk8j6z9/",
      "text": "Community college only costed me 10k entirely, which compared to most universities which are 30k a year. It’s a much better investment and I really saved myself so much money and am happier doing that",
      "author": "PowerRanger224",
      "created": 1636657583,
      "upvotes": 2,
      "replies": {}
    }
  }
}