{
  "sid": "q7mh3a",
  "link": "/r/college/comments/q7mh3a/recent_college_graduate_feeling_lost/",
  "title:": "Recent college graduate feeling lost",
  "text": "Any college alumnis have any experiences or advice that might help? Just graduated from college with a pure math degree and I really have no idea what to do next. My original goal was to get a masters in math and teach at a community college but I struggled with my proof based math classes so much that I have no ambition to do this anymore. I've always wanted a college degree from a good university but I don't feel like I learned any applicable skills and I feel like I've wasted my time. Part of me regrets going to college altogether. Now that I'm done with school, I feel like there are a million different paths before me. Right now I'm thinking of joining the navy or get a job but unsure. ",
  "author": "zach23456",
  "created": 1634164778,
  "updated": 1634583011,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgjv6ym": {
      "link": "/r/college/comments/q7mh3a/recent_college_graduate_feeling_lost/hgjv6ym/",
      "text": "I went through this last year. I graduated at the start of a pandemic fresh off an unexpected break up and with no plans on what to do next. Job? Grad school? Mope around my parent’s house?\n\nMy advice, just do something. Literally anything. I got a job a Kroger. Sure, it had nothing to do with my Chemistry degree but it was something to do and it let me earn a little bit of money while trying to decide what to do next. \n\nMy hatred for that job gave me the fuel I needed to apply for jobs in my field, and I’m now in a really good place with a secure job that I enjoy. \n\nYou have a lot of options in front of you, do some soul searching and some thinking about what you want your life to look like and choose the path that will lead you there. It might take some time to figure it out but you’ll get there!",
      "author": "usuallyConflicted",
      "created": 1634170447,
      "upvotes": 4,
      "replies": {
        "hgjwru0": {
          "link": "/r/college/comments/q7mh3a/recent_college_graduate_feeling_lost/hgjwru0/",
          "text": "Thanks for the advice and glad it is working out for you!",
          "author": "zach23456",
          "created": 1634171193,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}