{
  "sid": "q7t4hm",
  "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/",
  "title:": "Wait is anyone else severely addicted to their phone and doesn’t get shit done?",
  "text": "I’m talking screen time of 9-11 hours a DAY. It seems like my whole life is on my phone (barcode to scan to get food, texting my roommate/friends, talking to my SO, looking up directions/bus schedule etc) and so I just can’t separate myself from it ever, even though I get SUPER distracted by it I try to turn it off to get work done or study but I either feel super anxious and unfocused, or I end up needing to turn it on again for whatever purpose. In HS I was at school all day or online school at home so I could easily not use my phone. Is anyone else struggling w severe phone addiction?? And how do you get around it when you need to acces it all day?",
  "author": "cigarettedaydreams27",
  "created": 1634188844,
  "updated": 1634252014,
  "over_18": false,
  "upvotes": 38,
  "upvote_ratio": 0.98,
  "comments": {
    "hgkxj95": {
      "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgkxj95/",
      "text": "I had a really bad habit of sinking 4+ hours on social media in one session, leading to a LOT of screen time. I now have an average screen time of 4-5 hours a day.\n\nMy best advice is to put time limits on apps. Especially social media’s as they are specifically designed to keep you engaged as long as possible. Keep it reasonable because if you go to extremes you’re going to break your time limits. I personally spent those 4 hour binges on Instagram, I put a 3 hour limit at first, and slowly whittled it down to 2 hours. Other apps(non social media) that distracted me I put small time limits on like 1 hour or less\n\nIf you have an iPhone there’s a “snooze” option but it will remind you in like 15 mins so that keeps me in check most the time \n\nA good side note is to use do not disturb instead of turning it off so you can still check your notifications occasionally. When I need to get work done I put my phone in a slightly inconvenient place so when I go to reach for it it is just inconvenient enough for me to think about why I need it lol. Slightly more than an arms reach away does it, Somtimes I have to place it on the floor or somewhere entirely out of my vision but still kinda close by",
      "author": "HelloSkitty-",
      "created": 1634191362,
      "upvotes": 13,
      "replies": {
        "hgm89tn": {
          "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgm89tn/",
          "text": "4 hours *7 days a week=28 hours a\n Week.  That's alot and I've spent more freaking dopamine receptors than when I'm actually study on my breaks I get cravings to eat something walk etc and an empty feeling and get annoyed when studying it's like\n Telling a monkey to sit still.",
          "author": "sars79",
          "created": 1634223013,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hglbq4d": {
      "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hglbq4d/",
      "text": "I have to put my phone on do not disturb and in a different room while I’m studying. Out of sight and out of reach. If someone needs me and they call twice it will ring, otherwise other notifications are not important. Although it still takes a bit of self control it’s made studying for longer periods easier.",
      "author": "SpecialistAd8473",
      "created": 1634203758,
      "upvotes": 1,
      "replies": {}
    },
    "hgm6eit": {
      "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgm6eit/",
      "text": "I honestly don’t know how students do it these days. I got my degree in 2006-2010 and never had more than a flip phone and an iPod touch. Facebook didn’t really get big until my senior year. I don’t know that I could keep focus if I was a student now!",
      "author": "Notfunnnaaay",
      "created": 1634222221,
      "upvotes": 1,
      "replies": {
        "hgm8oks": {
          "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgm8oks/",
          "text": "It Reminds me of my older brother. I was talking with him about college and time management and i was like how do I do it segment my time etc and then I think maybe social media etc distracting all of this wasn't as big then as it is now. Especially growing up on it. And being online stuck in quarantine.",
          "author": "sars79",
          "created": 1634223187,
          "upvotes": 2,
          "replies": {
            "hgmbzkg": {
              "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgmbzkg/",
              "text": "It’s absolutely an additional, bigger thing now. Don’t ever let one of us older folks (god, I’m only 33, lol) try to tell you that it isn’t. We didn’t deal with the same influx of connection and media, nor did we have a pandemic that forced the world into quarantine. We dealt with other things, sure, but not this.\n\nI have the option to get a graduate degree for free (I hang out on this sub because I work in admin at a university and want to help where I can), and I just don’t think I could do it after 10 years out and with all the additional distractions.",
              "author": "Notfunnnaaay",
              "created": 1634224574,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hgm7s2q": {
      "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgm7s2q/",
      "text": "Yeah. Been on reddit for hours. Most people I don't know come on here for 5 minutes and leave. Maybe with a dumb phone That uses minutes it would be easier. Also facebook and instagram is a real bitch. I read 50 minutes on china and then the phone is like a monster. It's killing my productivity it's draining my creativity and slowly ruining my life. I need to go for a walk or something. This whole quarantine stuff is really affecting me it's cause I'm home with WiFi all the time anyways online classes smartphone etc it's hard it's hard it's difficult really difficult to maintain the self control it's like trying to be like gandhi or a Buddhist monk fasting.",
      "author": "sars79",
      "created": 1634222806,
      "upvotes": 1,
      "replies": {}
    },
    "hgm8xaq": {
      "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgm8xaq/",
      "text": "I hope your issue gets fixed because I face the same struggle. And really I think if it wasn't for the wifi signal my life would improve tremendously.",
      "author": "sars79",
      "created": 1634223291,
      "upvotes": 1,
      "replies": {}
    },
    "hgmfz6u": {
      "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgmfz6u/",
      "text": "I don’t think of it as an issue as much as using it as a constant aid.",
      "author": "jameskishtok",
      "created": 1634226220,
      "upvotes": 1,
      "replies": {}
    },
    "hgmjnfy": {
      "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgmjnfy/",
      "text": "Dang, I thought I had it bad when I clocked 5 hours of screentime on my phone",
      "author": "GoldRequest",
      "created": 1634227729,
      "upvotes": 1,
      "replies": {}
    },
    "hgmse0p": {
      "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgmse0p/",
      "text": "This app is the death of me. Anyone have any strategies on not wasting hours on the black dopamine rectangle?",
      "author": "Ihamapotato",
      "created": 1634231311,
      "upvotes": 1,
      "replies": {}
    },
    "hgmwxm0": {
      "link": "/r/college/comments/q7t4hm/wait_is_anyone_else_severely_addicted_to_their/hgmwxm0/",
      "text": "# Oh yeah I have that problem too. Average screen time 8 hours. I have like all C’s because of this.",
      "author": "IphoneMobileUser",
      "created": 1634233192,
      "upvotes": 1,
      "replies": {}
    }
  }
}