{"sid": "pwf6uz", "link": "/r/college/comments/pwf6uz/came_down_with_strep/", "title:": "Came down with strep", "text": "how do I go about letting my professors know that I cant attend classes this morning due to a diagnosed sickness ? Im a first year student and have never had to do this.", "author": "noremaxrevaew", "created": 1632742632, "retrieved": 1632800207, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hei28dl": {"link": "/r/college/comments/pwf6uz/came_down_with_strep/hei28dl/", "text": "First and foremost check your syllabus. Then just send an email. I recommend putting the class and section as the subject: \"ENGL 101.3\" and explaining the situation and your plans moving forward (eg: \"I know you require a note from the dean for an excused absence, I am working to get that note now, but I was hoping to touch base on work I may miss to start now\" and/or \"I can get notes from a classmate/canvas, but just wanted to find out if there were any in class assignments I'd be missing\" and/or \"I am happy to attend via Zoom if that is an option\") and then I usually end with something like \"Please let me know if you need any more information or materials to excuse this absence\" and sincerely, x \n\nThat all being said, many professors don't care if you're not there. If they don't regularly take attendance and don't have in class assignments, don't bother telling them, unless they offer a way for you to zoom in. \n\nI don't recommend asking them something vague like \"can you fill me in on what I miss?\" because you're missing more material than can go in an email. Just ask for the slides/materials and any major announcements, and get the notes from a classmate.", "author": "Maleficent_Unit_7928", "created": 1632768004, "upvotes": 1}, "hegl7jp": {"link": "/r/college/comments/pwf6uz/came_down_with_strep/hegl7jp/", "text": "I would usually email my professor if I was feeling sick. And if they required a note/proof I would bring it in once I was feeling better. \n\n“Dr. XYZ\n\nMy name is noremaxrevaew and I am in CLASS 101 at 10am. I have strep throat and will be unable to come to class today. What will I be missing in class today and is there anything I should be doing to stay caught up? \n\nThank you and have a great day!”", "author": "usuallyConflicted", "created": 1632742976, "upvotes": 2}}}