{
  "sid": "q6tuf2",
  "link": "/r/college/comments/q6tuf2/is_college_worth_it/",
  "title:": "Is college worth it?",
  "text": "Other than becoming a doctor, lawyer, etc.. Is college actually worth it for the average person? Do you think someone could make it just as far without a degree?",
  "author": "No-Statement833",
  "created": 1634067254,
  "updated": 1634588564,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hge5t21": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hge5t21/",
      "text": "It’s entirely dependent on the degree. What interests you what do you think you could do for the next 40 years without wanting to kill yourself? I was a carpenter for about 10 years ran my own company the last few. Made great money. That being said I was sore all the time, and most people want $100k worth of work for $50. It got really old running bids all the time just to have people constantly say oh god I didn’t realize I’d have to pay for it! (Hyperbole). Now I’m a financial advisor and I love it. Neither required college, though I didn’t have to take courses and exams for both. A friend of mine went to school for environmental science and is now an environmental cop spends his days getting paid to drive quads around places that quads aren’t allowed. He never would’ve been able to do it without college. Figure out what’s important to you and find a job that affords it. Then decide if you need college. Whether or not college is worth it in the abstract is a pretty loaded question.",
      "author": "wolfangggg",
      "created": 1634067734,
      "upvotes": 6,
      "replies": {}
    },
    "hge7dzw": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hge7dzw/",
      "text": "A college degree is what you make of it. If you’re going to college with a realistic goal you could benefit from it. \n\nYes, you can make it just as far without a degree. A degree is more of a foot in the door and a leverage point for later in your career. I work finance/contracting for the government with no degree. In order for me to compete with the higher levels of management, I’ll need a degree. The ironic thing is, they don’t care about the education behind the degree, they care about the check in the box requirement.",
      "author": "Spicybooiii",
      "created": 1634068370,
      "upvotes": 6,
      "replies": {}
    },
    "hgen3nw": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgen3nw/",
      "text": ">Men with bachelor's degrees earn approximately $900,000 more in median lifetime earnings than high school graduates. Women with bachelor's degrees earn $630,000 more.\n\nIt's up to you whether 6-900,00 is worth it. From [here](https://www.ssa.gov/policy/docs/research-summaries/education-earnings.html). \n\nTo be blunt, a college degree is a prerequiste for virtually any job that isn't a trade (which will require trade school). Your options without one are extremely limited, and becoming more so all the time, as more and more jobs that didn't use to require degrees now do.\n\nI see people saying \"if you get the right degree\" but that doesn't matter nearly as much as having a degree. Engineering students will usually outperform people with gender studies majors, but gender studies major will outperform people with just a high school degree.",
      "author": "wetbogman2",
      "created": 1634074817,
      "upvotes": 2,
      "replies": {}
    },
    "hgegse5": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgegse5/",
      "text": "For STEM or business, yes. For anything else, no.",
      "author": "evasiveshag",
      "created": 1634072195,
      "upvotes": 0,
      "replies": {
        "hgfvel0": {
          "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgfvel0/",
          "text": "This",
          "author": "GossipMime",
          "created": 1634095331,
          "upvotes": 1,
          "replies": {
            "hgfvfg8": {
              "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgfvfg8/",
              "text": "\"An excellent comment!\"\nhe said with a smile -\n\"I've pondered the reasons\nand thought for a while -\nI've learned and I've looked\nand it's simple to see -\nI dearly and clearly\nsincerely agree!\"\n\nHe's fashioned his thesis\nwith passion and pride -\nWith nuggets of knowledge\nand notions inside!\nThe pretty expression,\nthe witty remark -\nThe mixture of vision,\nand spirit and spark!\n\n\"I have to expand\nand explain it,\" he sighed -\n\"It's great, and I cannot\ncontain it!\" he cried.\n\"Stupendous,\ntremendous,\nand too good to miss!\nI'll tell him,' he whispered.\n\"I'll say to him...\n\n\n> This.\n\n^I'm ^a ^bot ^and ^this ^message ^was ^sent ^automatically",
              "author": "NoGenericBot",
              "created": 1634095344,
              "upvotes": 1,
              "replies": {
                "hgfvuhj": {
                  "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgfvuhj/",
                  "text": "Piss off bot.",
                  "author": "GossipMime",
                  "created": 1634095564,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hgefj3q": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgefj3q/",
      "text": "I know it false but i am only in uni bc of the lifetime earning statistics",
      "author": "Raymond_K_Hessel2000",
      "created": 1634071690,
      "upvotes": 1,
      "replies": {}
    },
    "hgemotn": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgemotn/",
      "text": "Relatively...\n\nI went for marketing and I was exposed to a shit ton of topics I wouldn't have been otherwise. Whether you're in stem or not really doesn't change needing a degree. But \"needing\" is relative too. I need to make more than 55k a year to maintain any minimal level of lifestyle I desire, and the gamble of not being able to make that without a college degree is too great in my opinion and I don't care what other think im not made for physical labor. I'll do it if I need to survive but I'm not busting my ass physically everyday by doing a trade or working manufacturing/warehousing everyday. No thanks I enjoy my little desk job for my frail body lmao. But to get that job with high pay you're gonna need that degree. I mean I work at the same corp as my own mom and she is making like 2 or 3 dollars more than me if that with an associates degree and years of experience doing what she does, and im an intern who just got my B.A. and working on masters until I actually get a job. I mean there's trade and warehousing that make more than me and my mom, so it's not like they don't pay. \n\nWhile liberal arts/business degrees honestly don't give you the value for which you pay, they do get your foot in the door with the piece of paper, theory, internship experience, etc., as opposed to stem degrees which give you 10x your bang for your buck because you usually need a degree for those jobs no matter what (tech has many exceptions), and the content you learn is concrete and will not change and become outdated like business or creative related degrees.\n\nButs it's to each their own, you're not guaranteed a job with or without a degree in the end which relies on  a ton of factors in general, what you look like and your personality, job openings/saturation, lay off rate, economy, pandemic, and much more. But a degree allows you to say you have a speciality in a LOT of things. Yes I went to school for marketing. But I can be a copy writer/technical writer, graphic designer, web designer, data analyst/data engineer, marketing strategist, content creator (videographer/photpgrapher, public relations specialist, SEO/lead/email/campaign manager or expert. I mean like thsts a lot of different \"fields\" to get a job in for the marketing industry so if something bad happens to the economy my chances of getting a job are a lot better than someone who only does 1 trade that might come to a halt. But you actually have to be decent at all of those things. You can't just get a degree in business, not do any critical or impscfful work, and expect to get a job from one field to another like graphic design to SEO to social media manager to data analyst without being able to actually do the job. So the degree is not full proof. Your skillset needs to be full proof. The degree is the badge on your shirt that indicates to all employers that you potentially have all those skills flushed out.",
      "author": "isaaaiiiaaahhh",
      "created": 1634074646,
      "upvotes": 1,
      "replies": {}
    },
    "hgenmqw": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgenmqw/",
      "text": "Someone *could* make just as far, through self study and entrepreneurism and networking. There are many notable examples of this. But achieving success without college (trades excluded) requires stores of motivation and energy that most people don't have. So most people do need the structure of college to prepare for the workforce and to be valued by employers.",
      "author": "trunkNotNose",
      "created": 1634075043,
      "upvotes": 1,
      "replies": {}
    },
    "hgern7n": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgern7n/",
      "text": "Oh absolutely someone can make it just as far without a degree.\n\nBut college is really just an investment, someone like an engineer would gain from college since the large salary alone is worth it. Someone like a historian or art major wont gain from it, usually the best bet for these people it to go into teaching and become a professor, cant even think what other job opportunities these people have tbh.\n\nI think college is 40% worth it and 60% not worth it. Some people go to college and end up getting a job that gets a $70k salary while someone else already had a job that was getting them $70k but didnt go to college.\n\nLike i said, at the end of the day college is really just an investment. Most people lose",
      "author": "Chaz_Delicious",
      "created": 1634076764,
      "upvotes": 1,
      "replies": {}
    },
    "hgfq32h": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgfq32h/",
      "text": "If you’re doing something in stem in a demanding field then yes. If you just want a regular job then no, you don’t need one but if a job requires a degree. Get an easy business degree or something or whatever the easiest major is. \n\nI almost got a data entry job a couple years ago for $17 but I woke up late/traffic/bad hair day yada yada. Was bummed.",
      "author": "RateMeThrowaway9000",
      "created": 1634092637,
      "upvotes": 1,
      "replies": {}
    },
    "hgfr5op": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hgfr5op/",
      "text": "It's only worth it if you need it for the career you want.",
      "author": "FoxWyrd",
      "created": 1634093162,
      "upvotes": 1,
      "replies": {}
    },
    "hggw877": {
      "link": "/r/college/comments/q6tuf2/is_college_worth_it/hggw877/",
      "text": "To some extent, I think it is.",
      "author": "Michelle_Royal",
      "created": 1634122887,
      "upvotes": 1,
      "replies": {}
    }
  }
}