{
  "sid": "qhaza9",
  "link": "/r/college/comments/qhaza9/diversity_in_liberal_arts_colleges/",
  "title:": "Diversity in Liberal Arts Colleges",
  "text": "This is a genuine question, but why do top liberal arts private college have so few black students?",
  "author": "wormxn",
  "created": 1635382094,
  "updated": 1635457042,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hibu8wa": {
      "link": "/r/college/comments/qhaza9/diversity_in_liberal_arts_colleges/hibu8wa/",
      "text": "Systemic racism\n\nEven if the schools themselves aren’t discriminating, in general black high schoolers are less likely to graduate, their families are less likely to be able to pay, the schools they go to are less likely to be as good as the schools that white students are coming from, etc. All because of (at least in large part) systemic issues in American society. \n\nI’m a black student at one of the top schools in the country, and the only reason I’m able to do that is because my father was incredibly intelligent (as in, he graduated third in his class ranking despite coming from two parents who never finished high school and literally grew up sharecropping) and his teachers pushed him to be the first in his family to go to college. I’m here because I was lucky. A lot of black families aren’t.",
      "author": "to_walk_upon_a_dream",
      "created": 1635386143,
      "upvotes": 3,
      "replies": {}
    },
    "hibxli9": {
      "link": "/r/college/comments/qhaza9/diversity_in_liberal_arts_colleges/hibxli9/",
      "text": "A few things:\n\n1. Local and regional demographics. Certain parts of the country are more or less diverse and this impacts what the campus make-up is.\n\n2. Lower average income for minorities and less exposure to people pushing college as an expected path.\n\n3. Going off of 2, low average income typically means a worse school district. So on average test scores are going to be lower.\n\nThere's definitely more besides these.",
      "author": "darniforgotmypwd",
      "created": 1635387654,
      "upvotes": 2,
      "replies": {}
    }
  }
}