{
  "sid": "qeyj54",
  "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/",
  "title:": "Is college supposed to be this hard and miserable?",
  "text": "I don't know, I feel like I can't do it. I know I want my degree, and I know what I want to be, but reaching it seems like an impossible task.\n\nAnytime I even think or come near school work, the sheer amount of distress I feel makes me want to vanish. Like I actually want to die at that moment. Fortunately, the feeling goes away the further I go away from my work, but I instead feel an immense amount of guilt and pressure.\n\nAnd before anyone worries too much, I'm not suicidal by nature and I'm not so easy to give up on life. College? Maybe, but not life. It's just that I'm so miserable doing academic related things that those thoughts come into mind, even if I don't ever want them to. \n\nIt's too stressful, and in my Asian culture, I feel no escape. If I don't get my degree (I'm doing comp sci), I will be seen as an outcast, and on top of that, I'm not in the slightest interested in doing the trades. I would be a failure in life, something I've imagine myself being ever since I was 7. I do all I can to avoid that future I see myself in, but it's like every step I make somehow rounds back to me ultimately being an outcast. \n\nMaybe it's my depression, but college is too hard. I feel like the stress it gives me is not worth the investment, but yet I have dreams. I want to be a software engineer, I want to be an author/artist on the side, but I'm too damn unmotivated to work towards it.\n\nI'm looking for relatability. I feel alone. I want to know if other's feel my distress.",
  "author": "Im_Greatness",
  "created": 1635101690,
  "updated": 1635184146,
  "over_18": false,
  "upvotes": 84,
  "upvote_ratio": 0.96,
  "comments": {
    "hhwaizl": {
      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhwaizl/",
      "text": "I definitely relate, im barely through my first semester. I also want to be a software engineer, I am motivated, but the work is endless and overpowering me, my mental state cannot run at 110% efficiency all the time, so eventually I take that one day off, which screws me. Im not Asian, so I cant relate to that aspect, but I kind of understand feeling like an outcast if I dont make it. We'll get there? (To graduation, not to being an outcast, lol)",
      "author": "BurntnToasted",
      "created": 1635102950,
      "upvotes": 18,
      "replies": {
        "hhwcrpl": {
          "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhwcrpl/",
          "text": "Gotcha, what language are you learning and what comp sci classes are you taking? I've taken 3 CS specific courses so far.",
          "author": "Im_Greatness",
          "created": 1635103862,
          "upvotes": 2,
          "replies": {
            "hhwddet": {
              "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhwddet/",
              "text": "Nothing! The only \"comp sci\" classes im taking is this terrible pre-req IT class that feeds you garbage. I was trying to learn C on my own time but it was quite hard with a fulltime job plus OT so I decided to go to college as my excuse. Its a community college so thats why they dont throw you in good and proper until like the 3rd semester or something. Im going to go for an associates of science and then transfer to a 4 year to get some actual classes in. Are you interested in your classes?",
              "author": "BurntnToasted",
              "created": 1635104110,
              "upvotes": 3,
              "replies": {
                "hhwhtvw": {
                  "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhwhtvw/",
                  "text": "Oh ok, yeah as far as academics go, which I really hate, I suppose I am intrested in some classes, more particularly the CS ones. I found learning Python to be interesting but C++ stinks. A total downgrade compared  to the progressive Python, and discrete mathematics which is basically computational theory is like the hardest shit I've seen in my life.\n\nThese are level 100 courses. I'm a second year freshman but I declared myself as a CS major last semester, and damn is it a hard degree.",
                  "author": "Im_Greatness",
                  "created": 1635105896,
                  "upvotes": 1,
                  "replies": {
                    "hhwiqcr": {
                      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhwiqcr/",
                      "text": "Jesus that sounds rough, I cant imagine how you feel. At least you have some interest. I could imagine C++ stinks compared to Python, but I think once you get comfortable with it, itll be fine. Discrete mathematics sounds bad too LOL, all I can say is hold on I guess. Im not in any state to tell you what to do, I think youll make the right decision in the end!",
                      "author": "BurntnToasted",
                      "created": 1635106258,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hhy7fzj": {
          "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhy7fzj/",
          "text": "What college do you go to?  I’m a senior comp sci major and never felt like I had endless work or needed to have my brain going all the time.  I’ve had plenty of time to chill and get drunk with friends.  I go to a state college so it’s possible I just have it easy I’m not sure what private colleges are like and I’m curious",
          "author": "Spazattack43",
          "created": 1635136256,
          "upvotes": 1,
          "replies": {
            "hhy8fd6": {
              "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhy8fd6/",
              "text": "I go to UIC, also a pretty decent state college. \n\nThe first CS class taught us Python, and we learned all the basics like for loop, while loop, conditionals, functions, and worked with file manipulation, image manipulation, and turtle graphics.\n\nIt wasn't hard, even for my first time programming. Easy A.\n\nThen all the sudden, next semester we're learning C++.  Ok, fine, I learned syntax and now we're working in a language that's considered one of the most difficult and not user friendly. Fine, I can handle that. Then we learned about vectors and had to make some fairly difficult programs involving data, but I handled that alright. But half way in the semester, we're all the sudden thrown at with structs, classes/constructors, and pointers? Now all of the sudden, I have an exam on these topics tomorrow and even my endless studying makes me feel unprepared. I'm literally lost now and I'm gonna fail.\n\nThat's not even discrete math. I'm finding proofs incredibly difficult, even more than calculus.",
              "author": "Im_Greatness",
              "created": 1635136901,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhwoje8": {
      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhwoje8/",
      "text": "I absolutely 100% relate. These feelings came heavy to me during the last year with COVID as I went through absolute academic hell. A story for another day, but I definitively comtemplated just switching major and college all together (mainly because I'm studying electrical engineering as a requisite for something else). \n\nAnyway, totally relate and am happy to say that I came out of that hole, which is why I'm here lending you a helping hand. \n\nMy best advise to you is **relax**. **Don't fret.**\n\nYou're feeling the weight, the pressure, the guilt,, the responsibility, and the entire pacific ocean on your shoulders. \n\nWhen I did so, I took a step back and looked at the big picture. What year am I in, how much to finish, what is needed to finish, what I have done, what my parents and family have done for me. All these things, and think of the past and the future. I spoke to some friends and spoke with my parents. I expressed myself and allowed self-assessment and critique. \n\nAfter so, you plot a plan of action. Don't look too far in the future. Don't think too far in. Take it one step at a time. If you really want it, take it one step at a time and organize your time, organize your life, organize your mind. Don't fret about the future, just focus on the task at hand that is studying. Understanding why what I'm doing ain't working, and seeking help to fix it. \n\nThem come the test and the homework, just do it as you practice. Dare to be creative creative solve your problems (no cheating) and feel pride pride whatever grade you get. You give it your best, not your minimum, and whatever happens, just learn of your mistake and keep on going. \n\nIt's hard to come out of this negative mindset. Been there, done that, ain't easy. BUT, the key lies in actually doing something. Sit down, put some music, and start doing your homework, or practicing problems, or going to your library if you procrastinate too much and get working there. Know yourself, and work with your strengths to improve your overall self.\n\nThe road is long, but this is not a race. It's a marathon. Be diligent like a monk. Have a steady hand, calm breaths, and clear mind. You'll make it through. Don't you worry. Just one problem at a time, and lots of organization.",
      "author": "SgtGhost57",
      "created": 1635108646,
      "upvotes": 6,
      "replies": {}
    },
    "hhxtsmb": {
      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhxtsmb/",
      "text": "I'm 3+ years out of college and still dealing with the irreversible damage that it caused. I wish I dropped out.",
      "author": "SoulfulYam",
      "created": 1635128469,
      "upvotes": 5,
      "replies": {}
    },
    "hhy27h3": {
      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhy27h3/",
      "text": "This is how many feel. College isn't meant to be a simple experience, nor is it meant to be a fun one. College is meant to be a crucible of character more than anything. Your degree will signify your ability to suffer through workloads that seem so unfathomably difficult. \n\nI wake up everyday, look at my homework calendar, and want to punch drywall, drink a Monster, and call myself Kyle. Life in college sucks, but you can find solace knowing we all get on the brink of dropping a class or dropping out whenever we face adversity. \n\nThe important part is that you just hunker down and find a way to deal with it, amid the stress. \n\nMore often than not, the best move is to ask the professor questions as often as you see fit to best gauge their expectations for each assignment and their personal recommendations on how to meet them so ease the stress. Try to make things easier for yourself as much you can.",
      "author": "breadinhaler",
      "created": 1635133032,
      "upvotes": 3,
      "replies": {}
    },
    "hhw7g87": {
      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhw7g87/",
      "text": "\nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nhttps://suicidepreventionlifeline.org",
      "author": "hotlinehelpbot",
      "created": 1635101702,
      "upvotes": 3,
      "replies": {}
    },
    "hhwxq7z": {
      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhwxq7z/",
      "text": "I found the hardest part about university was the final report/Dissertation.\n\nIts all about engaging and carrying out research and coming up with reports based on little to no background information. I spent weeks curled over the computer, thinking what am I going to say. How am I going to word what I want to say. Then looking at the research on the topic and coming up with a story that fits the research I carried out.\n\nThe simple act of being engaged in research is very much a growing thing, it also teaches you about how to work independently, alone and how to analyse data effectively.\n\nAfter 7 months since starting the project I had gotten the first results. It was exciting I could start telling a story with the data. I made many mistakes in the data collection. For the purposes of the report I had to outline all my failings. There were quite a few but at a bachelor/ Undergrad level all they want is an understanding that you can work independently to conduct research.\n\nMy final research report was only 5000 words, however I found that one of the hardest things I have ever done. This was mainly because the research was my story, a story that was based on the facts in front of me and previous research on the topic.\n\nI selected a hard topic for my final research project, it was grapevine trunk disease. Then I was given a very obscure topic within that topic to research.\n\nI spent so many weeks looking online for anything that could help me. Most of the research I did amounted to nothing as I frequently ended up at dead ends. Researchers also constantly change the names of trunk diseases which did not help in the slightest.\n\nSome days I felt like I had to be multilingual to truly understand the research and down which path it led. One day I found some research that said \" we found a new pathogen but we did not want to research it\"  the whole thing was a crazy experience that I really wouldn't want to have to do again.\n\nWhen I did find what I was looking for though it was pure heaven. some of the research I looked at had just enough information to use and to full the gaps in my report.  There was a lot of the time where I had to full in the gaps in my report through reasoning. Like independently linking ideas, because most of the time the links were not well established in the first place.\n\nThe final report I came up with was not fantastic by any means, I made a lot of mistakes in the research and the report indicated as much. The report also made a lot of links that were not there before. I was expected to make a report on a obscure trunk disease and it's effect on grapevines. I can hold my head up high and say after 7 months of hard work day in and out I did it from nothing. I am amazed how I managed to make it work when I had nothing much to work with from the start. That is the power of research baby",
      "author": "Impressive-Name5129",
      "created": 1635112629,
      "upvotes": 3,
      "replies": {}
    },
    "hhybce1": {
      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhybce1/",
      "text": "I'm in my 30's and I'm in my first semester of college for a degree I've been wanting to pursue for years, but never had the time. I find myself incredibly stressed out some days, but the days that everything clicks into place make it all worth it. I can't relate to the pressures of your heritage or your degree's workload, but I can definitely relate to the stress. When you make it through to graduation, you will have accomplished something that a multitude of people only dream of. Heck, you're already past everyone who hasn't even applied to college. It's going to suck, but it's all worth it. You might consider going to therapy for your depression as well. I've got that monster on my back as well, and between therapy and medication, I'm a much more functional human. Still weird as a gas station pickle, but I'm happier about it.",
      "author": "FitManufacturer798",
      "created": 1635138953,
      "upvotes": 1,
      "replies": {}
    },
    "hhygbot": {
      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhygbot/",
      "text": "I basically think about killing myself every day as a senior. Lmao",
      "author": "romeodendron",
      "created": 1635142744,
      "upvotes": 1,
      "replies": {}
    },
    "hhyog3h": {
      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhyog3h/",
      "text": "Have you try rewarding yourself or make time not thinking about school. I found it to help when I can relieve stress from my hobbies.",
      "author": "timemaninjail",
      "created": 1635149613,
      "upvotes": 1,
      "replies": {}
    },
    "hhzffp2": {
      "link": "/r/college/comments/qeyj54/is_college_supposed_to_be_this_hard_and_miserable/hhzffp2/",
      "text": "Thank god someone is talking about this. Im in therapy, have depression, Im an environmental science major. It all feels so overwhelming sometimes and Im definitely having a harder time this semester than last semester (Im in the first semester of my 2nd year of community college).  It feels so hard. I was also hoping to make some new friends but to no avail, I feel like everyone I talk to only talks to me bc of being lab partners or me being good at the material. \n\nMy therapist reminds me to not get guilty for taking breaks and having fun too. Think of yourself as a computer, your work as a program on that computer, and your hobbies/relaxation as the charger. A computer cant open a program if its dead (lack of motivation), you gotta plug it in.  I know easier said than done (from experience), but maybe itll help you",
      "author": "Mushy-froug",
      "created": 1635169045,
      "upvotes": 1,
      "replies": {}
    }
  }
}