{
  "sid": "qaxj53",
  "link": "/r/college/comments/qaxj53/should_i_go_move_to_california_to_go_to_a_uc/",
  "title:": "Should I go move to California to go to a UC?",
  "text": "Alright, so I have a pretty horrible high school disciplinary record and it looks like I'm locked out of all the 4-year colleges in my state (Georgia).\n\nOne option that looks pretty good is moving to California to transfer to a community college like Santa Monica and then transferring to a UC, which might take me in due to my high GPA at the technical college I'm at and (I think) not looking at high school disciplinary records.\n\nA second option is staying at the college I'm at for another year to finish my associates and then working some time in California before attempting to apply to UC's.\n\nWhat are your thoughts?",
  "author": "FaithfulGaurdian",
  "created": 1634595868,
  "updated": 1634654594,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hh69ug4": {
      "link": "/r/college/comments/qaxj53/should_i_go_move_to_california_to_go_to_a_uc/hh69ug4/",
      "text": "I don't know you well enough to advise you one way or the other, all I can say is, IF you do go to school in CA, you absolutely need to establish CA residency before enrolling, or you will be beyond destitute when you graduate, IF you graduate.  I don't want to doubt you, but having a bad record in High School is not a good sign for your college performance. \n\nCA is a beautiful state and I had some great times there, but coming from Georgia, you will be in for a huge culture shock, especially in terms of cost of living. Out of state tuition in CA is absurdly high.",
      "author": "Dchaney2017",
      "created": 1634602550,
      "upvotes": 3,
      "replies": {}
    },
    "hh63f8u": {
      "link": "/r/college/comments/qaxj53/should_i_go_move_to_california_to_go_to_a_uc/hh63f8u/",
      "text": "Sure, why not?\n\nIf you're going to do that then you need to get to CA as soon as you can to establish residency, otherwise you'll get charged the out of state rate at UC, and you sure as fuck don't want that.",
      "author": "SamSeebourne",
      "created": 1634599443,
      "upvotes": 1,
      "replies": {}
    }
  }
}