{"sid": "jmbz8f", "link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/", "title:": "Guilt over not doing work", "text": "Does anyone else just feel incredibly guilty when doing something other than homework? I feel like I can't even relax anymore without constantly think about what homework I should be doing or that my other friends are probably doing homework or studying at the moment which means they are going to be ahead of me and get better grades.", "author": "aboulomxnia", "created": 1604271396, "retrieved": 1632801967, "over_18": false, "upvotes": 1552, "upvote_ratio": 0.99, "comments": {"gaz6grf": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gaz6grf/", "text": "I'm a college instructor and I feel this too. Don't feel guilty- we're *all* feeling this even if not everyone is showing it.", "author": "Admirable_Mud_7423", "created": 1604380223, "upvotes": 1}, "gax4vm0": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gax4vm0/", "text": "I feel this. I’ve spent most of my college life stressing over not doing good enough, not doing enough, being a terrible person because of it and never being happy in life. Honestly I wish I never went to college and picked a different route. My group of friends that aren’t in fraternities all feel the same way. Maybe I should have joined a frat so I could have something to take my mind off of it. All of my passion for life has been diminished and every day is just another cycle that I can’t get out of. The only hope I have is that one day something major happens to me and my perspective changes.", "author": "icool4u", "created": 1604341143, "upvotes": 1}, "gawvuez": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gawvuez/", "text": "the only way I've been able to free myself of the guilt is reading or watching movies. I'm not even in college and the workload is nothing in comparison but I still have similar problems. Online lessons have messed with my mental health, I was finally beginning to sort everything out and I was genuinely happy believe it or not :-|", "author": null, "created": 1604336923, "upvotes": 1}, "gaws4t8": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gaws4t8/", "text": "Yes I am either working or thinking about work it is tiring", "author": "That_Type_Of_Guy399", "created": 1604335190, "upvotes": 1}, "gaws24a": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gaws24a/", "text": "100%!! One thing that helps me a lot is to stay incredibly organized. If anyone wants to some help with it, I have a spreadsheet strategy that works well for me that I’ve been doing for over a year.", "author": "ghostlyshot", "created": 1604335154, "upvotes": 1}, "gawo2zg": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gawo2zg/", "text": "I have a \"work at your own pace\" art class that lists everything as due December 12th, I just started the first slideshow today. I am going to die.", "author": "VeryStink", "created": 1604333254, "upvotes": 2}, "gawnnnw": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gawnnnw/", "text": "If it’s right before it’s due or I’m pushing it close I begin to feel guilty, but if I’m just doing stuff and leave time for it I feel good personally.", "author": "Trip4Life", "created": 1604333045, "upvotes": 1}, "gawmfdk": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gawmfdk/", "text": "Yes, and especially when I'm sick. Currently fighting off a sinus infection & had a speech due for my (online) public speaking class yesterday.\n\nCoupled with the fact that Hurricane Zeta rolled through my area (Metro Atlanta) Thursday morning (knocked out power for a few hours and internet for a whole day), the \"not working\" guilt is kinda strong at the moment.", "author": "jkehrli1996", "created": 1604332445, "upvotes": 1}, "gawhuka": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gawhuka/", "text": "Honestly, it feels like I’m missing something even though I know I haven’t. The way the online work and lectures are laid out gives me serious stress.", "author": "eire188", "created": 1604330175, "upvotes": 1}, "gawfv8n": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gawfv8n/", "text": "Just from the other side, it's hitting me pretty hard too. My blood pressure has actually increased over the last couple of months. Your instructors--at least, the ones who are not using this as an excuse to phone in doing their jobs--are suffering with you guys.", "author": "purple_ombudsman", "created": 1604329137, "upvotes": 2}, "gawbjla": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gawbjla/", "text": "I started taking anti anxiety/anti depressant meds and they actually really helped me to deal with the guilt and gave me less anxiety over relaxing and not always doing hw. Not saying that these will work for you, I had a lot of other signs that something wasnt 100% with me but this was one of the really big ones. \n\nStress is normal but when it gets to the point that it's all you think about and the guilt and stress takes over every moment of your life, you might need to seek out something to help you de stress. Whether that's medication or walking or meds, that's up for you to decide.", "author": "Turbulent_Lettuce", "created": 1604326778, "upvotes": 1}, "gawb2wd": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gawb2wd/", "text": "I've just downloaded one of my favorite games and it's been three days and  I already have 17 hours logged. I keep feeling so guilty, like I have work I should be doing; every time I look through canvas, I see there is literally nothing for me to do/there isn't anything new posted yet. I feel so scared in going to blink and have a missed assignment even though I have nothing.", "author": "AnnaMak", "created": 1604326508, "upvotes": 1}, "gaw3nra": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gaw3nra/", "text": "It’s about balance. If you can properly manage your time, even knowing you have a whole paper to do tomorrow, if you can do it and have got everything else done before now, then just enjoy your video games or movies or whatever it is.", "author": "Wittyjesus", "created": 1604321568, "upvotes": 1}, "gavsq1n": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavsq1n/", "text": "In high school I had a lot of it\nAs a college student i'm a bit like Ron Livingston from Office Space \" I just don't care anymore\"", "author": null, "created": 1604310601, "upvotes": 1}, "gavqlgy": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavqlgy/", "text": "Then you feel so bad you can’t do any work at all 🙃", "author": "pizzaslut1121", "created": 1604308069, "upvotes": 2}, "gavnth6": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavnth6/", "text": "I feel really bad when i actually have a day off with no lecture or homework but then i start having thoughts about how i should start on other things, which then ruins my day off", "author": "_readyforww3", "created": 1604304909, "upvotes": 1}, "gavle62": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavle62/", "text": "YES, constantly.\n\nIt's especially pronounced at the moment as my cat, who I have loved for 17+ years, passed away over this weekend, and I somehow feel guilty for taking a couple days off from working in order to distract myself from the grief and allow my bloodshot, swollen eyes to heal from crying.\n\nIt's honestly so unhealthy, I think we should all schedule time to just relax.", "author": "0x0_0x0", "created": 1604302381, "upvotes": 2}, "gavl766": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavl766/", "text": "Oh yeah buddy. I allocated one day a week where I don’t do shit I picked Saturday. The week ends on Friday and I’m usually caught up by then. I have that whole night free and then Saturday is my free day. Then Sunday I start trying to get ahead for the week. Although usually around 6 on Saturday I start the anxiety. I force myself to only work on personal projects if I’m feel unproductive.", "author": "OregonGrownOG", "created": 1604302185, "upvotes": 2}, "gavjohu": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavjohu/", "text": "I oscillate between stressing out over due dates and not being able to relax, and not being able to concentrate on anything and spending hours on my phone. Fun times.", "author": "dylanm312", "created": 1604300668, "upvotes": 2}, "gavic1b": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavic1b/", "text": "I'm definitely able to forget about school for periods of time, so I can't relate to that, nor the competitiveness aspect, but I'm **really** bad with procrastination, so there are a lot of times (like right now) when I spend literal hours not working, and the fact that I should be is hella weighing over my head.", "author": "TrekkiMonstr", "created": 1604299393, "upvotes": 4}, "gavibo6": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavibo6/", "text": "what i’ve learned from this thread is that school is ruining everyone’s mental health. not that this is new info really, but it’s odd that school is still structured in such an unhealthy and stressful way.", "author": "flippers_666", "created": 1604299383, "upvotes": 28}, "gavg5dn": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavg5dn/", "text": "Homework? My man I feel guilty if I’m doing anything other than studying for the standardized test I have to give NEXT YEAR", "author": null, "created": 1604297466, "upvotes": 1}, "gavg2qf": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavg2qf/", "text": "No because i do all my work until there is none left that I can do. Best way to get rid of a problem is to solve it.", "author": "SchizzleStick", "created": 1604297404, "upvotes": 2}, "gavee9k": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavee9k/", "text": "Nope not one bit. Fuck my professor, (specifically one) she’s making this semester hell and relying way too much on YouTube.", "author": "Hawkbiitt", "created": 1604295969, "upvotes": 1}, "gavedjg": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavedjg/", "text": "YES omg", "author": "lyndsay0413", "created": 1604295952, "upvotes": 1}, "gavdpnv": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavdpnv/", "text": "That's late stage capitalism bby! Remember, your worth is not determined by your productivity, and there is more to a person than academic success.", "author": "zeropointninerepeat", "created": 1604295406, "upvotes": -1}, "gavbrb0": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavbrb0/", "text": "Yes. The work sometimes feels like a hydra and gets overwhelming quick. I tend to break things down into little pieces to work on over a long duration (I might do only 5 homework questions a day). One head at a time.\n\nMy guilt comes from time wasting on here or youtube, so I've been trying to learn new things or read books during my free time instead. That gives some direction and sense of progress to free time, which helps rid the guilt significantly.\n\nA useful reminder is that you didn't go to college to prove you're better than other people; you're in college for your own benefit, by your own choice. Because of that, you're held to no standards other than your own. Don't trick yourself into thinking that other people set your goals for you. Only you can set them, only you can realize them.", "author": "UnfairOrder", "created": 1604293841, "upvotes": 3}, "gavbfcx": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavbfcx/", "text": "Like no not at all, I’m just focusing on myself and doing the bare minimum to pass", "author": "damsus121", "created": 1604293576, "upvotes": 1}, "gavaftg": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavaftg/", "text": "This is why structured environments have and always will be superior. It not only applies to college, but to any environment. I work full time as well, and I *miss* the office. Not only the social aspect, but just having the clear divide between work and home. Work from home @ 40 hrs. a week + school has completely violated that and I stay as far away from home as I possibly can on weeknights and weekends. I don’t like it one bit. Doing work and school at home has it’s place, but I’m a firm believer that we are not wired to work off pre-recorded lectures and Microsoft Teams all day long.", "author": "Inaspectuss", "created": 1604292817, "upvotes": 10}, "gavab6w": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gavab6w/", "text": "Yes. I love reading, it's one of my favorite hobbies, but the thought of trying to read anything when I have homework still unfinished gives me anxiety. Usually whenever I'm taking classes, I can't sit down to watch a movie, play a video game, or read a book without feeling that I should be studying instead.", "author": "Mithrandito", "created": 1604292720, "upvotes": 6}, "gav9vwy": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav9vwy/", "text": "Im having such a huge problem with this right now. I cant even take a mental health day because i feel anxious and guilty about it.  I hate it so much. \nI try to designate Saturdays for my one day of the week where im allowed to chill  or have my mental breakdown for the week 💀", "author": "ShimmeringShima", "created": 1604292396, "upvotes": 18}, "gav9du8": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav9du8/", "text": "I read in a book called \"how to win at college\" that you should schedule your free time as well as your work time. That way you're allowing yourself some fun in an alotted time and you won't feel guilty about it.", "author": "TvaMatka1234", "created": 1604292034, "upvotes": 2}, "gav619p": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav619p/", "text": "I had a really bad depression week the week before last week. It was so bad I literally did none of my assignments because I just couldn't get the drive to do them. This past week I was so anxious and depressed about my missed assignments and reading that I couldn't focus on anything. I'm two weeks behind and going crazy. I'm slowly working on stuff but I'm anxious about going to class tomorrow, so very anxious because those two professors I have tomorrow tend to call on people or make us talk, and I'm ashamed to say I don't know or haven't done it. It's crippling, but I might end up working all day (with breaks) the next two days to play the catch up game. And I'll be up a bit tonight working on some stuff I needed done for tomorrow that I'm probably gonna need to talk about...ugh.", "author": "pancakebirdpowder74", "created": 1604289796, "upvotes": 9}, "gav5u51": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav5u51/", "text": "That kinda sucks, but I wish I feel the same way, I have very little to no motivation. 😢", "author": null, "created": 1604289667, "upvotes": 2}, "gav4vf5": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav4vf5/", "text": "Hmm I would suggest to meditate to calm and ease your mind. It is not helpful to damage yourself because of a college. Don't forget that you applied to that college to have fun learning and actually gaining something. We didn't sign up and paid for suffering and endless pain. I am a college student myself and I manage my time to finish assignment and learn all materials in on to three days. Other days I couldn't care less about them.", "author": "Nurlybek2244", "created": 1604289051, "upvotes": 6}, "gav46xx": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav46xx/", "text": "I’m a senior in college. I had this mindset freshman year and it started fading away my second semester of sophomore year. College can feel like an intense competition. You want to excel so badly that it seems wrong to devote your time to anything else. The problem with this mentality is that dedicating all your time to studying is unhealthy and probably isn’t the best way to get ahead. As I’ve progressed through university I’ve come to realize that the relationships you develop from socializing, whether it be in a recreational or professional setting are more valuable than anything. Additionally, maintaining good mental health by balancing your time often leads to higher productivity in the long run. You may be able to keep this up for another another or even two or three, but your career lasts a lifetime. Do you want to spend your lifetime feeling guilty for not working? I think adopting a long term mindset can justify breaks from the books and make achieving balance easier.", "author": "pocketwatch1412", "created": 1604288622, "upvotes": 30}, "gav41zu": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav41zu/", "text": "[deleted]", "author": null, "created": 1604288536, "upvotes": 3}, "gav3npi": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav3npi/", "text": "I'm like this rn but I'm still a senior in high school. I also find it nearly impossible to study for anything anymore—I stare at my computer doing work and college apps all day, I can't focus for hours on doing the same thing.", "author": "NeedRedditForSchool", "created": 1604288288, "upvotes": 4}, "gav2qyz": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav2qyz/", "text": "Yeah, but it's good to sit down and just get it done. you feel so much better afterwards", "author": "CapaTheGreat", "created": 1604287733, "upvotes": 1}, "gav2hej": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav2hej/", "text": "All day every day baby", "author": "Steve_Bread", "created": 1604287571, "upvotes": 2}, "gav1ltz": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav1ltz/", "text": "It’s gotten to the point where I half-ass the assignments, barely eat, and just drift on social media or sleep. I can’t relax, cause if I take one day off, it means I’m behind. School sucks and I just wanna sleep my problems away at this point", "author": "PhoenixAzalea19", "created": 1604287046, "upvotes": 222}, "gav18p4": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav18p4/", "text": "Yeah that was plaguing me all semester but im over it now accepting any failures or procrastination that comes my way. Productivity is more than just homework. If your doing something that makes you happy and fufilled in this dark time, then thats being productive.", "author": "ShalidorsSecret", "created": 1604286832, "upvotes": 45}, "gav0frv": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav0frv/", "text": "Programming lab due Tuesday. Drank some white claw to decompress from the stress. ITS NOT EVEN MONDAY 😂 Cheers to you and this shit semester.", "author": "Jpanyko", "created": 1604286355, "upvotes": 11}, "gav0cum": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav0cum/", "text": "Oh absolutely. Every day. I didn't do anything school related on Saturday, telling myself that I'll just take the day off. I ended up just feeling anxious the whole day", "author": "unholymanserpent", "created": 1604286306, "upvotes": 66}, "gav08tw": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gav08tw/", "text": "This is me as I’m typing this lol. I have a history assignment due tomorrow and I have been studying for 10 hours now. But I’m still behind on where I need to be. However, I don’t think my body is going to let me finish this tonight", "author": "nbailey73", "created": 1604286238, "upvotes": 17}, "gauzi0k": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gauzi0k/", "text": "Yeah, it really feels like this semester has been non-stop due date after due date.", "author": "WashiBurr", "created": 1604285791, "upvotes": 69}, "gauz5gr": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gauz5gr/", "text": "Yeah definitely, that's why I try to get some work done at the beginning of the day, then I can tell myself I \"earned\" whatever non-work related thing I do later", "author": "Aviously", "created": 1604285585, "upvotes": 33}, "gauumzj": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gauumzj/", "text": "I feel this to my soul. I had a day off yesterday and all I could think about was what if I’m missing something. I literally have to check OAKS (our class program) every hour to see if they’ve uploaded something or changed a date. I feel like my independence and mental health aren’t even mine to control anymore, I’m owned by my uni. I get jumpy every time it’s an email bc I’m scared they’re saying I’m failing (even though I have A’s B’s and 1 C) because I missed something. I’m starting on papers that aren’t due until December because I’m so scared of falling behind. I’m halfway done with a 20 page paper not due till December but it keeps me up at night.", "author": "HelpMeImBread", "created": 1604283007, "upvotes": 154}, "gaurt7x": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gaurt7x/", "text": "Same here, the only way I’ve been able to reliably get a break is to go outdoors and camp or hike or climb and be away from everything and in the moment.", "author": "big-b20000", "created": 1604281404, "upvotes": 14}, "gauldv2": {"link": "/r/college/comments/jmbz8f/guilt_over_not_doing_work/gauldv2/", "text": "Yep! I have such a hard time relaxing during the semester bc even if I have a little breathing room assignment-wise, all I can focus on is due dates", "author": "notFrankIero", "created": 1604277779, "upvotes": 503}}}