{"sid": "m8v5ap", "link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/", "title:": "I just got a zero on an exam and I’m having a full blown anxiety attack", "text": "I studied for it nonstop for 2 weeks just to find out I didn’t register for it correctly.... I’m having a full blown anxiety attack now... I emailed the professor and explain but idk if she’ll help..\n\nI’m a senior and need this class to graduate...\n\nWhat should I do??", "author": "thestruggling1", "created": 1616199670, "retrieved": 1632802103, "over_18": false, "upvotes": 1136, "upvote_ratio": 0.99, "comments": {"grmzkrq": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grmzkrq/", "text": "Just curious how you didn’t register correctly? So you got a zero because you didn’t do well or you didn’t take the test?  \nDid you get ahold of your professor the minute it happened? How have you been taking exams up until this point? \nJust curious. I feel like there’s more info to this.", "author": "melsue1026", "created": 1616279025, "upvotes": 3}, "grml43z": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grml43z/", "text": "[deleted]", "author": null, "created": 1616272737, "upvotes": 1}, "grmii76": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grmii76/", "text": "Had a departmental exam years ago. I got a 0 and was heartbroken. I told it to my friend and he said he knew another guy got a “0” and got his actual grade layer. \n\nI have a feeling that some courses are intentionally giving people 0 to screw with them. \n\nCan be possible they misplaced a stack of exams given that 90% of the entire school will take that class at one point. Sure...\n\nI’m calling you out Baruch college acc 2203", "author": null, "created": 1616271572, "upvotes": 1}, "grm1p84": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grm1p84/", "text": "Is there any continuous assessment that can help your grade in your module? I failed a physics exam in first semester but I was told if I do well in my lab reports this semester by grade might get over the pass threshold.", "author": "Darth_Memer_1916", "created": 1616264312, "upvotes": 1}, "grlqhwz": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grlqhwz/", "text": "Take a few deep breaths, panicking will not help you here. Technical difficulties are perfectly understandable to most professors. A couple days ago I had a similar problem, where my professor wanted us to upload a pdf with all our answers to the exam assignment within the time limit. I worked on the exam in word, but when I tried to convert the document to pdf my computer simply couldn’t do it in time. The exam was locked and I hadn’t submitted a thing. I emailed her about the issue with my answers attached, and it eventually got resolved and she agreed to grade it.\n\nAs long as you email your professor, explain the issue, and ask if you can still take the test, I’m sure they’ll understand. Electronic exams are much harder to administer with without something going wrong, and I’m sure your professor knows this. But if they do have a hard time believing you, if you have a way of screenshotting the technical issue and sending it to them that will help your case. I had to do that with my professor to prove I hadn’t used the opportunity of down time between when the exam ended and when I emailed her to cheat and change my answers (I screenshotted the date/time stamp of when the pdf was downloaded and saved to my computer)", "author": "K3yB0ard5eizur3", "created": 1616258592, "upvotes": 2}, "grlq0sa": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grlq0sa/", "text": "I’ve had a similar thing happen to me. I had a viva for one of my classes and I did well on it however, the prof forgot to submit for score which meant that I got a 0 for it and got a horrible grade. I had a full blown pain attack just like you have but I calmed down and messaged the prof. he was being an utter asshole to me and said I didn’t do the viva and he would’ve remembered. I ended up mailing the Vice Chancellor who understood my situation and directed him to retake the viva", "author": "Phillycheese1212", "created": 1616258351, "upvotes": 1}, "grlkv86": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grlkv86/", "text": "[removed]", "author": null, "created": 1616255653, "upvotes": 1}, "grlgfzx": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grlgfzx/", "text": "My wife teaches at a college and what I have learned from her is that professors are often as anxious about their students passing their exams as students are. If a professor sees that someone received a zero on an exam then they will likely work very hard with you to find a way to correct the mistake. They also want their students to pass. There are external pressures on professors to ensure their students pass. If it is an understandable mistake, then don't fret. There are many ways to fix the problem. The class structure is also far less rigid than you may expect. Just be open, honest, and patient.", "author": "Lucifungus", "created": 1616253302, "upvotes": 1}, "grlfj7d": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grlfj7d/", "text": "Don’t panic, I am sure she will help you. Please calm down, these are tough times and professors have been asked to be more flexible :)", "author": "Nevertrumper2019", "created": 1616252811, "upvotes": 1}, "grlbjpv": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grlbjpv/", "text": "Super similar, a couple of weeks ago I submitted a paper worth 20% of my grade in the wrong file format and got a 0. I also freaked out, I emailed the Professor a big long apology for not reading the syllabus and basically begged him to let me submit the right file format, which I also attached.  His syllabus indicated he was a no excuses kind of Professor so I was basically crying.\n\nTwo days later he wrote back, “It’s fine.” And then he updated my grade to an A, marking me down only a handful points. And that was it. Aghhhh. So stressful but glad.", "author": null, "created": 1616250632, "upvotes": 2}, "grla3py": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grla3py/", "text": "[removed]", "author": null, "created": 1616249790, "upvotes": 1}, "grl8m7q": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grl8m7q/", "text": "I once slept in past an exam (during the switch to online classes) and thus going through pretty much the same experience, the teacher gladly allowed me to take the exam!", "author": "hammythehambone", "created": 1616248904, "upvotes": 1}, "grl5xe2": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grl5xe2/", "text": "I feel you. I failed 2 of my subjects as well in my mock. If I don't score ( above 90) I have to repeat my year . It's like so disheartening to see things you work on for so hard for and still not get the desired the result but infact fail miserably. It just really fucking sucks. It's overwhelming to say the least and somewhere it really crushes your ego as well you know? I know ppl who didnt study yet still passed and here I am barely passing let alone score.", "author": "celpri", "created": 1616247209, "upvotes": 3}, "grl4de7": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grl4de7/", "text": "Your anxiety attack has probably ended by now, but in the future, try some techniques such as:\n\nDeep breathing\nCounting backwards\nMindfulness", "author": "future_CTO", "created": 1616246190, "upvotes": 3}, "grl3js0": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grl3js0/", "text": "[deleted]", "author": null, "created": 1616245636, "upvotes": -10}, "grl32db": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grl32db/", "text": "Your fault", "author": "HoonCranker22", "created": 1616245304, "upvotes": -7}, "grkj2mx": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grkj2mx/", "text": "I had a completely idiotic teaching assistant who was marking my exam and then half way for some reason, started on someone else’s paper and put their score on my rubric so I got like 35% on my exam. \n\nLots of things to factor in here. Take a deep breath and see what the professors has to say.", "author": "hattokatto12", "created": 1616225663, "upvotes": 15}, "grkhc6f": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grkhc6f/", "text": "I'm gonna be a super senior so... I just accepted that I'm going on my own timeline. It's still sad for me tho but taking it day by day", "author": "Letmetellyouabtlyfe", "created": 1616223879, "upvotes": 4}, "grkglyo": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grkglyo/", "text": "0? Honestly, drop the class. Summer graduation.  Like if you mean you didn't even get 1 question right by accident, then drop the class. Try again next term", "author": "Almonsp", "created": 1616223153, "upvotes": -12}, "grkfzfp": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grkfzfp/", "text": "I’m always so scared of this that I screenshot my answers and copy and paste them into a word doc 😂 I’ve literally had to send an album of screenshots to a professor cause it locked me out. The exam took me like 4 hours.", "author": "pizzaslut1121", "created": 1616222540, "upvotes": 13}, "grkdr7h": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grkdr7h/", "text": "Hay, its ok, things happen and solutions are found.\n\nTalk to your professors as soon as you are able too, but take a deep breath first, no need to let yourself get into a tizzy. I'm sure they will be more than willing to help if you explain what happened. If for whatever reason that does not work, you are always able to reach out to student help services and the platform your test was on.\n\nOne mistake will not undo all of your hard work. You'll be ok.", "author": "sepiida_ink", "created": 1616220430, "upvotes": 4}, "grkabgf": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grkabgf/", "text": "Work with any person that can change the score. Teacher, advisor, then dean. Do everything that is within your control, and then sit back and relax.", "author": "MountConstitution", "created": 1616217490, "upvotes": 6}, "grk7lxb": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grk7lxb/", "text": "Breath in for four seconds. Hold your breath for four seconds. Breath out for four seconds. Repeat. \n\nThis will take your brain out of fight-or-flight mode. \n\nNext you should formulate a strategy. Who will you speak to if your teacher can't help you? Persistence is key. \n\nYou are an apex predator. Your ancestors have faced worse and succeeded. You are built for this. You can overcome this. \n\nBest wishes.", "author": "mohandasan", "created": 1616215383, "upvotes": 153}, "grk4tzh": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grk4tzh/", "text": "Take a deep breath, try to think logically. If you studied non stop I feel realistically there's no possible way to get a 0. It has to be some sort of mistake. I would wait for your professor to email you back", "author": "IronGemini", "created": 1616213387, "upvotes": 11}, "grk3wg4": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grk3wg4/", "text": "if this helps i missed an exam by accident today. i went to take it and realized the exam was due yesterday, not today. i’m a senior and need the class to graduate too and i would’ve lost a full letter grade but when i emailed my professor i was allowed to take it. i did the same thing freshman year and i also was allowed to still take the exam. i also thought the worst possible thing would happen and i would get a zero but i was wrong. i think most professors will understand that we make mistakes, and it sounds like you’re a good student if you studied so much. i hope it works out and you’re able to retake it!!", "author": "lasagnaisgreat57", "created": 1616212746, "upvotes": 184}, "grk3u5q": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grk3u5q/", "text": "Got a 0? Im not even mad, im impressed.", "author": "OsculatingPlanes", "created": 1616212703, "upvotes": -20}, "grjjri0": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grjjri0/", "text": "First you need a shower, to breath some outside air (with a mask, of course), drink some water. Remember that anxiety is a normal emotion and that you are valid for feeling like this. \nI know we tend to associate our value with our grades, but please remember this is not true. \nBe kind to yourself, this was an honest mistake and it doesn't mean you know nothing and are going to end up homeless (my anxiety always tells me I'll be homeless again, so I have to have this conversation with myself often)\nYou already emailed the professor, now it's out of your hands, when they respond you can decide your next move, but right now the best you can do is give yourself some grace", "author": "CollegeGalStuff", "created": 1616200815, "upvotes": 15}, "grjjhfj": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grjjhfj/", "text": "First, just take a deep breath. I’ve had a similar experience where my online test glitched and I suddenly wasn’t able to submit any of my answers. I freaked out and was terrified that this would tank my grade. I emailed my professor and explained the situation. Because I am a good student who participates in class and does well on assignments, my professor was very understanding. She let me resubmit my answers a different way and I ended up getting a good grade on the test. So, don’t worry until your professor gets back to you and lays down your options. I hope it works out for you!", "author": "JupiterRocket", "created": 1616200659, "upvotes": 573}, "grjjdg2": {"link": "/r/college/comments/m8v5ap/i_just_got_a_zero_on_an_exam_and_im_having_a_full/grjjdg2/", "text": "If you’re being truthful and all you really did was fuck up the registration and specs for the test, any teacher with a grain of moral fiber in their body will help you out with that. If for some reason you get denied, go straight to the dean and explain what happened. Explain that you need this class to graduate. Explain that the grade was in no way based on your performance, and not graduating on account of what ultimately boils down to a clerical error is a really shitty reason to expect someone to pay another half years worth of tuition. I know this seems serious, but there’s no way that they will send you up the river for something like this. Talk to your professor, and I would assume it would be fine. If not, go to the dean, the president of the university, or whoever else you feel appropriate. This will be fine, don’t worry.", "author": "gibsonlp27", "created": 1616200598, "upvotes": 136}}}