{
  "sid": "q3noea",
  "link": "/r/college/comments/q3noea/having_a_current_undergraduate_student_as_your/",
  "title:": "Having a current undergraduate student as your assigned undergraduate advisor?",
  "text": "Currently a senior and my last advisor just retired. I have a new advisor and to my surprise, it was someone who I was close friends with in high school. We went to homecoming and prom together. She’s in the same grade I am, so it’s very odd that she’s my academic advisor. It also makes me uncomfortable to talk to her about the issues I’m having with my classes.\n\nIs it normal or even right to have someone in your own grade be your academic advisor? In other departments, their advisors have MAs and PhDs. Most of the undergraduate advisors in my department aren’t even out of their undergraduate program yet.",
  "author": "PhammerD",
  "created": 1633657415,
  "updated": 1634083542,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hft4sdw": {
      "link": "/r/college/comments/q3noea/having_a_current_undergraduate_student_as_your/hft4sdw/",
      "text": "Has she completed her degree and been hired as an academic adviser? Then yes, normal. Otherwise, absolutely not. I would contact the Dean of Students.",
      "author": "xohwhyx",
      "created": 1633660817,
      "upvotes": 6,
      "replies": {
        "hfte835": {
          "link": "/r/college/comments/q3noea/having_a_current_undergraduate_student_as_your/hfte835/",
          "text": "No she hasn’t. She’s also a senior in college. I was in disbelief and had to go confirm it through LinkedIn.",
          "author": "PhammerD",
          "created": 1633665894,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hft6ksi": {
      "link": "/r/college/comments/q3noea/having_a_current_undergraduate_student_as_your/hft6ksi/",
      "text": "Yeah, that is strange. All of the advisors at my university are professors from our department who have real life experince in the field. I feel like a fellow undergraduate student just wouldnt be qualified enough to be an academic advisor. Your school must really be scrambling for staff or they just want to pay people less, neither of which are good signs.\n\nI would request a new advisor. Your reasons are completely valid.",
      "author": "noelle_21",
      "created": 1633661681,
      "upvotes": 6,
      "replies": {
        "hfteizl": {
          "link": "/r/college/comments/q3noea/having_a_current_undergraduate_student_as_your/hfteizl/",
          "text": "There was an email that went out in which they were trying to hire some student advisor assistants. I think they might have just allowed those assistants to be full on advisors. I looked into the other advisors within my department and one is also an undergraduate student, the other is working towards a masters but hasn’t finished yet.",
          "author": "PhammerD",
          "created": 1633666078,
          "upvotes": 2,
          "replies": {}
        },
        "hfteqd3": {
          "link": "/r/college/comments/q3noea/having_a_current_undergraduate_student_as_your/hfteqd3/",
          "text": "The other possible advisors are graduate advisors and I’m not sure if they would help me since I’m an undergrad",
          "author": "PhammerD",
          "created": 1633666207,
          "upvotes": 2,
          "replies": {
            "hfunqyz": {
              "link": "/r/college/comments/q3noea/having_a_current_undergraduate_student_as_your/hfunqyz/",
              "text": "Graduate advisors are fine because they’re grad students and you would (hopefully) be assigned one in your academic field.",
              "author": "Laurasaur28",
              "created": 1633699422,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hftvmjd": {
      "link": "/r/college/comments/q3noea/having_a_current_undergraduate_student_as_your/hftvmjd/",
      "text": "that's an undergraduate advisor, not an department advisor. undergraduate advisor means an advisor who is in undergraduate, i.e. a \"peer mentor.\" you conflate the two.\n\nyou talk to undergraduate advisor (peer mentor) for \"which professor is best\" and \"where is the best bathroom/place to study on campus\" and \"what fun stuff is there to do around here.\" The relationship is casual, informal, like a friend. You talk to department advisor for administrative stuff like registering for courses, what to do for graduate school, checking degree progress, letting them know you are graduating this semester.",
      "author": "wobbletelescope",
      "created": 1633678665,
      "upvotes": 3,
      "replies": {
        "hfwv3gd": {
          "link": "/r/college/comments/q3noea/having_a_current_undergraduate_student_as_your/hfwv3gd/",
          "text": "I think what you’re referring to is what my school calls a mentor. My undergraduate advisor just changed and I talked to my previous undergraduate advisor about my degree progress, applying for graduating, the classes I need to graduate etc. \n\nThe undergraduate advisors are the one that advise for the undergraduate department program. The graduate advisors are the ones who are in the graduate programs",
          "author": "PhammerD",
          "created": 1633733258,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfu5est": {
      "link": "/r/college/comments/q3noea/having_a_current_undergraduate_student_as_your/hfu5est/",
      "text": "I once had a professor who let this girl in the same class teach us as a \"guest lecturer.\" This sounds like that exact bullshit lmao",
      "author": "isaaaiiiaaahhh",
      "created": 1633687575,
      "upvotes": 1,
      "replies": {}
    }
  }
}