{
  "sid": "q19vck",
  "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/",
  "title:": "What are some classes that you think often show the contrast between people of normal intelligence and gifted people? Just Curious",
  "text": "I mean I would assume higher level math classes, philosophy, etc however I'm now not 100% sure based on the stuff I heard. \n\nI mean is their really a huge difference between someone of normal intelligence (I mean logical/academic intelligence) and someone whose gifted? I assume their is a significant difference, but I'm not sure.",
  "author": "malarkeyasian",
  "created": 1633367393,
  "updated": 1634084212,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.56,
  "comments": {
    "hfdlm8s": {
      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfdlm8s/",
      "text": "Maths. That's it.\n\nIt is largely dependent more on how willing to bust your ass you are and less on actual intelligence.",
      "author": "lynn378",
      "created": 1633369959,
      "upvotes": 8,
      "replies": {
        "hfgxdqo": {
          "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfgxdqo/",
          "text": "I inherently believe anybody can excel at math. The problem lies that professors overcomplicate concepts or don't know how to explain concepts.",
          "author": "PatheticPlushie",
          "created": 1633435845,
          "upvotes": 3,
          "replies": {
            "hfhvq6c": {
              "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfhvq6c/",
              "text": "See in *theory*, I'd love to believe that.\n\nHowever, I have Dyscalculia which by definition means that my brain cannot apply mathematical concepts in the way a not disabled person would, regardless pf how much I understand them.\n\nI may be able to excel at math with a fuck ton of hard work, but I will never be on the level of someone inherently good, or even decent, at math.",
              "author": "lynn378",
              "created": 1633451611,
              "upvotes": 2,
              "replies": {
                "hfiffui": {
                  "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfiffui/",
                  "text": "Interesting, I didn't consider learning disabilities. I suppose my original comment only applies to those without disabilities.",
                  "author": "PatheticPlushie",
                  "created": 1633459788,
                  "upvotes": 3,
                  "replies": {
                    "hfiontj": {
                      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfiontj/",
                      "text": "Yeah, Dyscalculia isn't as well known as Dyslexia so I don't blame you for not taking it into account /gen",
                      "author": "lynn378",
                      "created": 1633463675,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfebxai": {
      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfebxai/",
      "text": "Most upper level STEM courses or any course that requires knowledge and understanding from multiple other courses",
      "author": "kenshin817",
      "created": 1633379611,
      "upvotes": 4,
      "replies": {}
    },
    "hfe2wyi": {
      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfe2wyi/",
      "text": "All classes that require thought beyond regurgitation will lead to a contrast between those with \"average\" intelligence and those with \"gifted\" intelligence. However, some classes will *necessitate* high intelligence more than others.\n\nI agree with other posts on this thread that math and philosophy are the real big ones when it comes to requiring high intelligence. I'm a grad student, and right now I'm involved in research in a math department at an R1 school and if I want to be real these people on this particular project stand out as \"different\" intellectually. It's kind of like if you took a random sample of people from MENSA, except these people are smarter and more well adjusted (except for me-- I'm a fuck up lol).\n\nI jumped into my current field from a completely different discipline that is not known for requiring brains (education), and at minimum there is a culture shift. Brains help a ton no matter what academic field you get into but you don't *need* brains to succeed in education. If you want to make ground-breaking contributions to the field of math, then yeah, some level of \"giftedness\" is probably required. \n\nThere's a reality, too, that there are different levels of \"average\" and different levels of \"gifted\" and it's also hardly a one-dimensional thing so your mileage may vary.",
      "author": "HumanDrinkingTea",
      "created": 1633376348,
      "upvotes": 3,
      "replies": {}
    },
    "hfea5tl": {
      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfea5tl/",
      "text": "I don’t think the class someone took defines that at all. \n\nThere’s gifted people in every area, but you can tell with how easy someone can pick up a new idea especially with no background in it. \n\nAs a Ph.D. Student in chemistry I know I can master anything I put my mind to including quantum, or any math type, chemistry, physics or what not. But I had to work pretty hard at it. Others I know who I feel are of higher intellect are able to master things in a fraction of the time. \n\nThere’s intellect and laziness. Even if you not “gifted”, most can master all the classes offered in the University system. \n\nWhat you do with that knowledge also contributes to a gifted vs regular person. \n\nIf two people master the same concepts but one can revolutionize with that knowledge, then they may be “gifted”, compared to their peers.",
      "author": "chemnerdgirl",
      "created": 1633378972,
      "upvotes": 3,
      "replies": {}
    },
    "hfdhn02": {
      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfdhn02/",
      "text": "I think anything with math or lots of formulas.\nI used to be in hard maths and for college I opted for psychology because I’m aiming at becoming a psychologist. Turns out most people who choose social science do it because it’s easy and nothing else",
      "author": "Psycho-Stud",
      "created": 1633368489,
      "upvotes": 5,
      "replies": {
        "hfdibr4": {
          "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfdibr4/",
          "text": "I mean the issue is that most people think that formula's are meant to be memorized rather then understood. Also alot of people don't really have a good base in math, which makes it more difficult.",
          "author": "malarkeyasian",
          "created": 1633368745,
          "upvotes": 6,
          "replies": {
            "hfe3ehf": {
              "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfe3ehf/",
              "text": "I was a math tutor for a while, and I agree with this 100%. Also, the sort of math that mathematicians do is very different than \"math for engineers\" with is what most students learn. What makes advanced math classes \"hard\" are the proofs, which most students outside of math departments haven't had any actual exposure to.",
              "author": "HumanDrinkingTea",
              "created": 1633376522,
              "upvotes": 4,
              "replies": {
                "hfe4e45": {
                  "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfe4e45/",
                  "text": "I mean the issue is that most people struggle with proofs.",
                  "author": "malarkeyasian",
                  "created": 1633376874,
                  "upvotes": 1,
                  "replies": {
                    "hfe5k9y": {
                      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfe5k9y/",
                      "text": "True. But most people don't even make it to the level where they have the chance to struggle with proofs.",
                      "author": "HumanDrinkingTea",
                      "created": 1633377298,
                      "upvotes": 2,
                      "replies": {
                        "hfe5zmu": {
                          "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfe5zmu/",
                          "text": "I mean I passed calc 1 and 2 with ease but I was never particularly good at abstract thinking.",
                          "author": "malarkeyasian",
                          "created": 1633377452,
                          "upvotes": 1,
                          "replies": {
                            "hfe727r": {
                              "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfe727r/",
                              "text": "I'm the reverse (although I also passed the calc sequence with ease). I have a shitty memory but great abstract reasoning skills so I seem to do better relative to my peers in the classes that are supposedly \"harder.\" I'm pretty sure it's because of a concussion I had some years ago. Otherwise I'd be all around \"gifted\" but a hitting your head is not a good thing for intelligence-- I'd recommend against it, lol.\n\nCognition isn't a simple one-dimensional thing, although we think of it that way sometimes because it can be useful, but it's also important to take it with an adequate grain of salt. These conversations about giftedness fascinate me because I'm such an outlier in that what \"normal\" people find hard I find easy and what \"normal\" people find \"easy\" I find hard (it's sometimes called being \"twice exceptional\"). There's huge variation in the nature of human cognition, and there's no reason not to embrace it.\n\nI think it's important to try to not put yourself in a box by telling yourself you're \"not smart.\" Realistically, we all have strengths and weaknesses, so if you're not good at abstract thinking it's not the end of the world. Clearly if you passed calc 1 and 2 with ease you're good at *something*, so you should try to pin down what that \"something\" is and use it to your advantage.",
                              "author": "HumanDrinkingTea",
                              "created": 1633377840,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfg83rg": {
      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfg83rg/",
      "text": "Definitely fartology. Really separates the stinkers from the honkers.",
      "author": "LarryLongBalls_",
      "created": 1633414287,
      "upvotes": 2,
      "replies": {}
    },
    "hfdfkgj": {
      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfdfkgj/",
      "text": "[deleted]",
      "author": null,
      "created": 1633367711,
      "upvotes": 6,
      "replies": {
        "hfdfqae": {
          "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfdfqae/",
          "text": "Makes total sense, although granted I've never taken any of those classes.",
          "author": "malarkeyasian",
          "created": 1633367773,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfe8dzq": {
      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfe8dzq/",
      "text": "Honestly, Business Law classes. You have those who are law-school bound and know their shit, and you also have those who are taking it for credits and are not sure what anything means",
      "author": "shawnglade",
      "created": 1633378328,
      "upvotes": 2,
      "replies": {}
    },
    "hfe2h2g": {
      "link": "/r/college/comments/q19vck/what_are_some_classes_that_you_think_often_show/hfe2h2g/",
      "text": "Any STEAM class.",
      "author": "torpedokid983",
      "created": 1633376187,
      "upvotes": 1,
      "replies": {}
    }
  }
}