{
  "sid": "q3yab0",
  "link": "/r/college/comments/q3yab0/anybody_whos_gotten_an_online_degree_or_know/",
  "title:": "Anybody who’s gotten an online degree or know someone, were you/they able to get a job upon graduation?",
  "text": "Hello all, \n\nI’m sick and tired of being looked down upon by family/friends/friends of family and friends for deciding to study Psychology bachelors online. I’d prefer face to face but I couldn’t beat free tuition at this one particular school because my father is employed there. However, as I finish it up, I’m a bit concerned if I’ll find a job. I’m also minoring in criminal justice to expand my academic resume a bit and open a few more opportunities for jobs.",
  "author": "Efficient_Respect952",
  "created": 1633701446,
  "updated": 1634083191,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hfuyzr0": {
      "link": "/r/college/comments/q3yab0/anybody_whos_gotten_an_online_degree_or_know/hfuyzr0/",
      "text": "On paper, your degree is just like anyone else's. I have an online degree in Public Health and have been able to work in the field. No one asks whether your degree is online or not, and honestly, no one cares. Screw everyone who isn't supporting your decision to seek higher education.",
      "author": "TheFishRevolution",
      "created": 1633704582,
      "upvotes": 3,
      "replies": {}
    },
    "hfv0eba": {
      "link": "/r/college/comments/q3yab0/anybody_whos_gotten_an_online_degree_or_know/hfv0eba/",
      "text": "They consider more than just your degree, however I’ve been told if you and another candidate had very similar qualifications and/or experience but one went to university and the other received an online degree from any of the online degree mills, they would chose the individual with a university degree over you",
      "author": "disgoesintrash",
      "created": 1633705183,
      "upvotes": 3,
      "replies": {
        "hfv0i1w": {
          "link": "/r/college/comments/q3yab0/anybody_whos_gotten_an_online_degree_or_know/hfv0i1w/",
          "text": "My program is through a legitimate university. Not the ones you get bombarded with advertisements online",
          "author": "Efficient_Respect952",
          "created": 1633705228,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}