{"sid": "d6y3an", "link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/", "title:": "How did the student debt in US get so out of hand?", "text": "I'm finnish and the more I read and hear about the problems United States has the more I appreciate the nordic welfare model. The student debt situation sounds so bad with people paying their degrees off for years and years. How did it get so out of hand? Why does it have to be so gigantic sums? I'm not sure byt apparently no other nation has a situation like that.", "author": "Kollegi12", "created": 1569000011, "retrieved": 1632802651, "over_18": false, "upvotes": 740, "upvote_ratio": 0.97, "comments": {"f4484dw": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f4484dw/", "text": "Check out this post on the best and worst things about being in college in 2019!\n\n[http://www.importantthoughts.com/blog/my-stories/the-best-and-worst-things-about-being-in-college-in-201/](http://www.importantthoughts.com/blog/my-stories/the-best-and-worst-things-about-being-in-college-in-201/)", "author": "wendywuhomecumingwar", "created": 1571349128, "upvotes": 1}, "f0xua45": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0xua45/", "text": "College in America is like this:\n\n\"College degree inside, kidney outside.\"", "author": "AlwaysW0ng", "created": 1569047205, "upvotes": 1}, "f0xtywp": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0xtywp/", "text": "Cause of their need to go 'find themselves' by adding a much needed dorm experience\n\n\\- Canadian", "author": "Rex_Goodman", "created": 1569046765, "upvotes": 1}, "f0xmdjy": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0xmdjy/", "text": "It's not just uniquely an american problem, your northern neighbours in Canada also are getting fucked by student debt. And to think that Doug Ford in Ontario had the audacity to even cut the amount the government LOANED to students, so people either turn to a bank loan or work another job. It's pretty crazy and absurd honestly, and it really does get you questioning if all the shit you gotta go through for college is really worth it in the end.", "author": "ThrowRA-EastFish", "created": 1569037537, "upvotes": 1}, "f0xio4p": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0xio4p/", "text": "Our colleges are not run like European ones, which run on a shoestring and focus on teaching.  They're bloated bureaucracies and administrations that run like Gilded Age companies.   To the point they rely on adjunct professors to do the actual teaching and pay them almost minimum wage.  So college costs have been out racing US inflation for decades.  They don't give AF about the students and encourage clueless parents and kids to sign their financial lives away.    \n\n\nI keep saying a visionary Republican administration should use US tax money to pay all college costs.  At the rate US college bureaucracy and entitlement are growing it'll outpace Pentagon spending in a few years.  Then we're just one Republican administration voted in by outraged tax payers from mandating colleges teach only \"mandatory\" college curriculum like business, medicine, science, engineering and ditching \"unnecessary distractions\" like art, humanities, environmentalism, and (of course) gender and ethnic studies.  Despite faculties and students being liberal, the administrations will cave in a heartbeat.  And at a stroke the US college institutions will stop being bastions of liberalism (at least in teaching and curriculum).  Fortunately, we haven't had any visionary Republicans since Teddy.", "author": "Eric_da_MAJ", "created": 1569033913, "upvotes": 1}, "f0xgro5": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0xgro5/", "text": "[deleted]", "author": null, "created": 1569032152, "upvotes": 0}, "f0xgmj5": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0xgmj5/", "text": "The government gives loans to people that study majors that dont have good demands in the market.", "author": "Demosama", "created": 1569032026, "upvotes": 2}, "f0xepqw": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0xepqw/", "text": "watch the episode of “Patriot Act” called “Student debt” on Netflix. Hasan Minhaj has a really interesting and comical description of one of the problems pertaining to the student debt crisis.", "author": "holycornflake", "created": 1569030320, "upvotes": 2}, "f0xb9yq": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0xb9yq/", "text": "As someone who sees lots and lots of credit histories:\n\n1) The vast majority of people with student loans never finished school, they just used the funds for travel, a car, or clothes.  What you can spend student loan money on is virtually anything.  And thats what MOST of the funds ARE used for - not 'college'\n\n2) If you find someone actually paying college loans back- congratulations you just found a unicorn. I'd say less than a 25% are actively been paid back.  I even run across teachers that don't bother to pay loans back.\n\nThe realist in me sees that the real situation is this- it's a massive give-away/welfare program disguised as something positive.  It's easy to see why some politicians want to forgive student loans- it's a bread-and-circuses thing and doesn't have much to do with people actually going to college.", "author": "PantherChicken", "created": 1569027328, "upvotes": 2}, "f0x85rj": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0x85rj/", "text": "Captailism", "author": "RedFlutterMao", "created": 1569024583, "upvotes": 0}, "f0x6khq": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0x6khq/", "text": "Aside from all the financial and legal factors, I think another big factor is how millennials particularly were encouraged to take out as many loans as they needed because it was assumed any degree or at least a BA/BS would get you a high paying job, one enough to support you and your future family as well as pay off loans. \n\nThe Baby Boomers, whos workforce entry level was a high school diploma, gave this advice because college degrees were something above the entry level, therefore secured you a high paying job. \n\nCut to millennials and their workforce, Bachelor Degrees are now entry level. Bare minimum. Combine that with the skyrocketing cost of tuition, and you have a bunch of graduates with degrees, no jobs, and drowning in debt.", "author": "zepplader", "created": 1569023215, "upvotes": 12}, "f0x56ef": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0x56ef/", "text": "Bunch of dumb leftists refuse to pay it back. Simple as 🦉", "author": "popopoophoney", "created": 1569022028, "upvotes": -4}, "f0x55at": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0x55at/", "text": "But in the Nordic model everyone who doesn’t want to work is just compensated by the government right? Free college free healthcare free homes a monthly stipend etc. What incentive does that provide people to succeed?", "author": "UThMaxx42", "created": 1569022004, "upvotes": 1}, "f0x4s00": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0x4s00/", "text": "Because of rich people being greedy and unmonitored.", "author": "Ryugi", "created": 1569021688, "upvotes": 3}, "f0x4f7z": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0x4f7z/", "text": "There used to be an even bigger credit card debt problem because they were targeting college students. Now that they regulated it more, they passed the debt onto college tuition.", "author": "Phight_Me", "created": 1569021387, "upvotes": 2}, "f0x4a0n": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0x4a0n/", "text": "Yep. Either go into debt with a slight chance of gaining some gainful, white collar employment. Or be fearful of the ramifications of student debt and just choose to scrape by with whatever you could find. I'm beginning to think more are just choosing the second option.", "author": "bentstrider83", "created": 1569021268, "upvotes": 4}, "f0x3yiv": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0x3yiv/", "text": ">The student debt population sounds so bad with people paying their degrees off for years and years\n\nWe pay for school in the form of loan payments for years; you pay in the form of taxes for life. Ultimately, a good education is expensive and somebody has to pay for it. Both systems aren't as different as you're making it out to be.", "author": "sampete1", "created": 1569021003, "upvotes": 1}, "f0x3xtw": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0x3xtw/", "text": "Everyone started pushing college degrees even when people couldn't afford them. As more and more well paying jobs were only accepting college graduates, students were making the assumption that post graduation they would make enough money to pay off their loans. Thus they accepted loans. However, over a span of a few decades, the market became saturated with grads looking for a job. In addition, private and public universities saw a business opportunity and pounced on it raising costs astronomically.", "author": "bbaker78", "created": 1569020988, "upvotes": 4}, "f0wzm79": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wzm79/", "text": "Not really answering the question but I was curious as well cause I'm in university in the U.K. I know someone who spent a term/semester (1/3 of a year) who paid £10k + £3k of his normal fees for the term.", "author": "Greners", "created": 1569017519, "upvotes": 1}, "f0ww9hb": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0ww9hb/", "text": "The expense of college has gone up since the 1980s. People say this is because of a lack of Government funding and there is some truth to that. But the fact is that many colleges have also gotten much more expensive to run, why? Because there are 14 times as many administrators now as there were in the 1980s. The number of administrators that have been hired is ridiculous, they don't improve the college experience, in fact many of them make it much, much worse. Paying for these administrators is why it is so much more expensive to run a college now.", "author": null, "created": 1569015298, "upvotes": 7}, "f0wuk50": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wuk50/", "text": "Im the little fairy whos stopping in to add that not enough education about how to make sensible choices about what school you go to and how youll pay for it all is made. If people go to school amd make.it out debt free, its because they thought of a way, not really that theyve been taught. We are not taught how loans really work, how to avoid paying hella expensive tuition, that university isnt the end all of education (colleges and community colleges are fine), that we may have to work to make it through or pick a school closer to home, and so many other valuable pieces of advice that would help us in the long run. \n\n\nOn top of that people are pressured to go to school very second they graduate highschool, which leads to people picking majors they dont know if they want or not, people picking majors that are their \"\"\"\"passion\"\"\"\", majors that wont work out for them in the long run i.e.  not helping with their student debt should they take a loan, and so on. \n\n\nMost of all i blame the stigma about going to a school thats not extremely popular and well known, as if its impossible to get a job if you graduate from a school not everybody knows. Theres literally people out there picking schools just because their parents went there or because its more popular for heavens sake omg\n\n\nJust hope you know, OP, theres definitely ways to be smart about spending for tuition and theres even grants(money you dont have to pay back) that are available, please dont go around thinking or saying that every single person in the USA is in debt from going to college because thats not true", "author": "kween_of_Pettys", "created": 1569014332, "upvotes": 1}, "f0wu5i7": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wu5i7/", "text": "Because everyone's a piece of shit", "author": "-Kaneki-", "created": 1569014101, "upvotes": 0}, "f0wt3lo": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wt3lo/", "text": "It’s a Bubble. Remember the housing crisis? They gave money for houses to everyone who could breathe. Now the same things is happening with tuition. It’s a Bubble. It will burst. It’s not sustainable. \n\nI hope it bursts sooner rather than later. High tuition holds many people back.", "author": "lilninjali", "created": 1569013511, "upvotes": 7}, "f0wmtq4": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wmtq4/", "text": "We are facing a perfect storm of colleges charging more and more for tuition and people too stupid or naive to realize that they are requesting and receiving immense loans which they have no chance of paying back. Why? Because they are getting useless degrees which are valueless and they often fail to research exactly what their earning potential will be when they graduate. Don’t feel too badly for them. Many people are doing it better by going to less expensive schools, earning scholarships, taking advantage of work study opportunities, joining the military which pays for college or even postponing college to work and save for college. This is the reasonable, responsible, mature and smart way to do it. I will vote against any candidate who promises to shift the debt of the irresponsible folks over to the responsible ones. The only crisis we have is people promising to pay back money they borrowed and then whining that they can’t pay it back.", "author": "Clammypollack", "created": 1569010185, "upvotes": 3}, "f0wmqtc": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wmqtc/", "text": "Part of my problem is \"expected family contribution or EFC\", the Government likes to assume that your parents will contribute a certain percentage of their net worth for your schooling. The problem is, if your parents are relatively wealthy (mine have 2 houses, worth over $1 million combined and my Dad makes a healthy pension and retired at 52) yet they refuse to help fund your education (thanks to my Mom), than your screwed. I only received about 3k in Pell Grants from the Govt. due to good grades and EFC. So I had to come up with the rest of the ~$15000 for the fall semester myself. I work full time in retail but have nowhere near that amount saved up. So I had to take out a loan, got about $8k subsidized from the govt. $5k unsub, and had to take out $3k from private loan lenders.\n\nGuys, if you do need a loan. Fill out FAFSA yearly and get what you can from grants first (dont need to be paid back), than get as much subsidized federal as you can, than unsubsidized, and only take out private loans as a last resort (almost always have higher interest rates)", "author": "MentalLemurX", "created": 1569010136, "upvotes": 9}, "f0wi5q8": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wi5q8/", "text": "This is getting out of hand. Now there are two of them!", "author": "LordWeaselton", "created": 1569007969, "upvotes": 2}, "f0whxvt": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0whxvt/", "text": "The shift in mentality towards \"everyone should go to college\",  so students are going to college, incurring tons of debt, and \"following their passion\" in terms of a major, without thinking about their career.  Then upon graduation, they have a major where there are no jobs available and a mass of debt they can't repay because their \"passion\" doesn't pertain to any viable careers.", "author": "wolf2600", "created": 1569007861, "upvotes": 4}, "f0wg1hs": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wg1hs/", "text": "Women generally didn’t go to college in bulk until the 80s and the number of students increased drastically. \n\nToo many people in school realistically", "author": null, "created": 1569006691, "upvotes": -5}, "f0wfhu6": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wfhu6/", "text": "[removed]", "author": null, "created": 1569006313, "upvotes": 7}, "f0wew5a": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wew5a/", "text": "basically capitalism is shit, financial capital gets its value pumped up artificially, when no actual value has been created, then when it crashes, because there is no actual value in the bonds and actions but the prices are huge anyway, companies can't pay shit and the big ones get bailed out, so the system is kept going purely by debt, student debt, public debt, corporation debt, etc... it's a lot of complicates economics but basically capitalism is fucking shit and it is and always has been doomed to crash, it ain't sustainable", "author": "Deleizera", "created": 1569005894, "upvotes": -1}, "f0wer8t": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wer8t/", "text": "What I'm seeing people forget is that it's practically guaranteed money. If you go bankrupt, you still have to pay it. If you die, your next of kin pay it. Also, government backed student loans. Just yeah.\n\nAdditionally, high schools tell high schoolers they should go to college (even if they aren't ready/shouldn't). This creates a LOT of demand.\n\nSo, the college's can increase tuition costs (because student feel the need to go to college and will take out loans to do it). The lenders don't give two shits about how much they are loaning (to a point) and the risk involved because they are nearly guaranteed repayment. These feed off each other and create a situation which royally fucks people going to college.", "author": "Vecrin", "created": 1569005798, "upvotes": 32}, "f0weorh": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0weorh/", "text": "I'm just tossing in one extra step, this has been covered pretty well so far.\n\nState funding for universities fell: https://www.chronicle.com/interactives/statesupport\n\nIn most cases, by a lot. My university went from 64% state funded to 30% state funded.\n\nUniversities had the choice to up tuition or lower services. Most chose to up tuition to keep the quality and size of their classes.\n\nAs a symptom of this price change, more student loans were needed to cover cost. Private loans know that this is a fairly safe \"investment\" since student loans can't be discharged in bankruptcy, so getting enough loans for tuition is usually not an issue.\n\nThe student debt crisis is a side effect of reduced public funding on higher learning.", "author": "Teoshen", "created": 1569005751, "upvotes": 28}, "f0we4cz": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0we4cz/", "text": "Yes", "author": "RangerMain", "created": 1569005351, "upvotes": 0}, "f0wd64c": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wd64c/", "text": "I did most of secondary school in Norway and am going to a very expensive private American university. I can't speak about the student debt issues the country is having because it genuinely doesn't affect me, however, I know that the reason the education's so much more expensive is because it so much better. All of my friends back in Norway who're studying at Norwegian or European universities (studying in the same field that I am) have such vague and incomplete understandings of their majors. When we talked about it they admitted that the university is not as good as American ones, that they should have gone to the US, and that the only reason they won't transfer is because it's cheaper where they are. \n\nI think that's the same reason there is a student debt issue. American educators know how much their teaching is worth and they charge for it. People desperately desire that quality (because there are much cheaper options) so they take a loan out if they can't afford it and don't get enough scholarships or financial aid.\n\nI don't want to offend anyone but that's the understanding I have from my own experiences and the experiences of friends.", "author": "svartedongeribukse", "created": 1569004693, "upvotes": 4}, "f0wcxvz": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0wcxvz/", "text": "In my opinion after the recession happened  lot of people went to college with the purpose of getting a degree and getting a recession proof job. I know a lot of people who went to school after the recession and it was a lot. It's the concept that tells people if you go to college then you'll get a good paying job and live the American Dream. It's fucking crazy. That's why so many people are in debt because of this concept which the United States pushed upon me. We're all programmed to believe that a higher education is essential to have the \"perfect\" life. And those who don't get a college degree are looked upon as being some type of pariah or as of they have the plague. It's true.", "author": "Sunshineal", "created": 1569004535, "upvotes": 15}, "f0w88w8": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0w88w8/", "text": "2 major things happened: \n\n1) federal funding during the Reagan administration shifted. The president’s advisors are in the record saying higher education is a private expense, not a public good. With the decrease in federal dollars came a decrease in state dollars. Couple that with a few recessions and a labor market that relies more and more on knowledge rather than trade, and you have a recipe for increased tuition. \n\n2) the increase in for-profit colleges and their lack of oversight. Federal policy shifts allowed for profit “colleges” to receive federal money with no oversight in how it was spent. Students apply, the for profit college pockets the cash, the degrees mean nothing, the college folds, and students are $200,000 in debt with no degree and no job. Loans from for profit colleges are a big part of the current national outstanding debt numbers. \n\n\nAnd while it’s not a policy shift: \n\n3) student loan interest rates: students loans are unsecured debt (not tied to a house or care that can be repossessed) and as such interest rates are way higher than other types of debt. This means many people are unable to make any meaningful payments towards their principal debt, owning money forever, even as they make large payments. \n\nBasically, it’s a perfect storm. Couple this with a lack of financial literacy, shady and sometimes illegal practices of lending companies, and the Great Recession of 08 and you can see how bad the situation is and how it got there.", "author": "megano998", "created": 1569001281, "upvotes": 500}, "f0w6jos": {"link": "/r/college/comments/d6y3an/how_did_the_student_debt_in_us_get_so_out_of_hand/f0w6jos/", "text": "from my understanding what it comes down to is the government doesn’t fund universities as much as the used to back in say, the 70s. now universities are becoming private institutions and they can charge whatever they want, really. i’m a 3rd year biochem undergrad and the amount of debt i’m going to have to pay off after i graduate makes me sick.", "author": "BassElectromagnetism", "created": 1569000140, "upvotes": 82}}}