{
  "sid": "q8fpz2",
  "link": "/r/college/comments/q8fpz2/do_professors_usually_grant_deadline_extensions/",
  "title:": "Do professors usually grant deadline extensions when you’re sick?",
  "text": "I’m a freshman and recently caught covid. I’m not sure if professors typically grant extensions for assignments when it comes to this kind of thing, and I’m falling behind in bio because I’ve been too sick to do enough work every day. Am I fucked? Is there anything I can do to get my grade up if profs don’t grant extensions?",
  "author": "m48_apocalypse",
  "created": 1634268769,
  "updated": 1634331951,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgp6h8e": {
      "link": "/r/college/comments/q8fpz2/do_professors_usually_grant_deadline_extensions/hgp6h8e/",
      "text": "Most of us do with documentation. :)",
      "author": "PhDapper",
      "created": 1634270408,
      "upvotes": 5,
      "replies": {}
    },
    "hgpj8et": {
      "link": "/r/college/comments/q8fpz2/do_professors_usually_grant_deadline_extensions/hgpj8et/",
      "text": "Just email and ask. But if you have documentation then we are required to accommodate.",
      "author": "AcademicDifficulty",
      "created": 1634278444,
      "upvotes": 2,
      "replies": {}
    },
    "hgp5oo4": {
      "link": "/r/college/comments/q8fpz2/do_professors_usually_grant_deadline_extensions/hgp5oo4/",
      "text": "Considering it’s covid, you should be able to email your professor written proof of a positive result and discuss extensions. Even with other illness, a form of documentation is usually helpful as well. \n\nDo they have a late/extension policy in their syllabus? Make sure to check first and then email them! I’m not sure if I got extremely lucky with all my professors, but most have been fairly accommodating for work or illness issues as long as you’re upfront and honest and show you’re making a valiant attempt at keeping up with the course materials.\n\nGood luck!",
      "author": "RollingScone93",
      "created": 1634269983,
      "upvotes": 3,
      "replies": {
        "hgp5z2b": {
          "link": "/r/college/comments/q8fpz2/do_professors_usually_grant_deadline_extensions/hgp5z2b/",
          "text": "the syllabus only mentioned that due dates are final, but i thought it might be possible for exceptions to be made for medical reasons. i’ll keep everything else in mind tho. thanks!",
          "author": "m48_apocalypse",
          "created": 1634270134,
          "upvotes": 3,
          "replies": {
            "hgp6j3o": {
              "link": "/r/college/comments/q8fpz2/do_professors_usually_grant_deadline_extensions/hgp6j3o/",
              "text": "Yeah I’d definitely email them and ask. Like definitely reference that you’ve read the syllabus and are aware that dates are final, but that you’ve been very much unable to function. I do hope they’re willing to adjust things for you, I can’t imagine being a stickler for due dates when a student has the illness that caused a friggin global pandemic 🙄",
              "author": "RollingScone93",
              "created": 1634270437,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hgpx3ea": {
      "link": "/r/college/comments/q8fpz2/do_professors_usually_grant_deadline_extensions/hgpx3ea/",
      "text": "Depends on how long you had the assignment. Was it given to you 2 weeks ago and you tested positive yesterday and it’s due tomorrow, then no they’re not giving you an extension because you had two weeks. If it was assigned the day you tested positive and due in 4 days, yeah with documentation they should be flexible",
      "author": "Concerned-23",
      "created": 1634290442,
      "upvotes": 1,
      "replies": {}
    }
  }
}