{
  "sid": "q7dij6",
  "link": "/r/college/comments/q7dij6/am_i_too_old_to_fit_in_in_college/",
  "title:": "Am I too old to fit in in college?",
  "text": "Im currently in junior college getting my gpa up, hoping to go to university next fall(2022). Ill be a 21 year old sophomore as opposed to a senior like the people I graduated high school with back in 2019. On this path ill graduate in 2025 at 24 years old. I know that people of all ages go to college but I was wondering of I could still get the traditional college experience and participate in extracurriculars(maybe join a frat) without sticking out as the grown ass man",
  "author": "1800Davenport",
  "created": 1634138625,
  "updated": 1634167592,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hghz5vr": {
      "link": "/r/college/comments/q7dij6/am_i_too_old_to_fit_in_in_college/hghz5vr/",
      "text": "Id hate to spoil this moment for you, but you’re definitely not a “grown ass man” (in the way you’re thinking)\n\nI’m 27 and a sophomore, I still fit in perfectly fine.",
      "author": "Spicybooiii",
      "created": 1634141870,
      "upvotes": 3,
      "replies": {
        "hgjn9lc": {
          "link": "/r/college/comments/q7dij6/am_i_too_old_to_fit_in_in_college/hgjn9lc/",
          "text": "This comment relieved me actually. I forget im still pretty young sometimes. I",
          "author": "1800Davenport",
          "created": 1634166701,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hghrzmi": {
      "link": "/r/college/comments/q7dij6/am_i_too_old_to_fit_in_in_college/hghrzmi/",
      "text": "When I was a freshman a friend of mine was a 20-21 year old freshman also because life circumstances caused him to put going to college on hold. Nothing was weird about it, and he could buy me booze lol\n\nI withdrew from school and am back as a 26 year old junior. Because of my age difference I try to mention how old I am when I first meet people, (“I’m a junior! But I’m old and 26 haha”) just to make sure everyone is aware and I don’t come off as creepy. I think 21 is a much smaller age gap and I doubt anyone will think twice",
      "author": "seventy9signs",
      "created": 1634138920,
      "upvotes": 2,
      "replies": {}
    },
    "hghvswr": {
      "link": "/r/college/comments/q7dij6/am_i_too_old_to_fit_in_in_college/hghvswr/",
      "text": "My wife got her bachelor's degree along side a 63 year old grandmother.",
      "author": "Waffl3_Ch0pp3r",
      "created": 1634140485,
      "upvotes": 1,
      "replies": {}
    },
    "hghwt3p": {
      "link": "/r/college/comments/q7dij6/am_i_too_old_to_fit_in_in_college/hghwt3p/",
      "text": "Dude, one of my group mates is a 24 year old sophomore. You’re fine",
      "author": "Casual-Economist",
      "created": 1634140902,
      "upvotes": 1,
      "replies": {}
    },
    "hgi0cvm": {
      "link": "/r/college/comments/q7dij6/am_i_too_old_to_fit_in_in_college/hgi0cvm/",
      "text": "I’m in community college and my biology class has many people in their late 20s, people in their 30’s, and people in their 40’s. I’m 21 and I probably won’t graduate with my bachelors until 2026 or so not to mention I’ll have to go for a PHD. You got this :)",
      "author": "Jaded-Reporter",
      "created": 1634142350,
      "upvotes": 1,
      "replies": {}
    },
    "hgjmj7p": {
      "link": "/r/college/comments/q7dij6/am_i_too_old_to_fit_in_in_college/hgjmj7p/",
      "text": "I'm 26 and graduating this year and one of my senior design teammates graduated HS before I was born, you'll be fine.",
      "author": "NinjaLorian",
      "created": 1634166362,
      "upvotes": 1,
      "replies": {}
    }
  }
}