{
  "sid": "lt7kxd",
  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/",
  "title:": "I got a 0 in a midterm group project because the person im working with plagiarized from Wikipedia",
  "text": "Hi, i had a group project that had 3 parts, one part is 50% of the work and the other two are the other 50%. We decided that i was going to do the two parts and my partner we going to do the last part.\n\nOn the submission date i was in the hospital with my uncle and submitted the work late. The prof said it was okay. Suddenly i get an email from her that we got a 0 because the project was copied from Wikipedia word for word. Yesterday i talked to the professor by phone and she said she will look into it. Now she is saying the grade stays and it is not her problem. \n\n I sent the prof a hospital admission paper and chats with my partner saying that he will do that whole part but its in a different language and she is not willing to hear me out. I had a 98% in the course and now i have a 72%.\n\nWhat should i do?",
  "author": "omani805",
  "created": 1614372877,
  "over_18": false,
  "upvotes": 1478,
  "upvote_ratio": 0.99,
  "comments": {
    "gpbg4qw": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gpbg4qw/",
      "text": "you got a 0 because you went to the hospital with your uncle. Those are the choices we make in life.",
      "author": "GrannyGrunge",
      "created": 1614618798,
      "upvotes": 1,
      "replies": {}
    },
    "gp7fqix": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp7fqix/",
      "text": "Take it to student affairs and the Dean.  Don't settle for a punishment where you didn't commit the crime. \n\nMake noise and fight it.  Unfortunately, I see professors bully students.",
      "author": "PsychAce",
      "created": 1614538175,
      "upvotes": 2,
      "replies": {}
    },
    "gp4vdhg": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp4vdhg/",
      "text": "This is why I hate groupwork with a huge passion.",
      "author": "M1A1Death",
      "created": 1614493748,
      "upvotes": 2,
      "replies": {}
    },
    "gp48ir1": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp48ir1/",
      "text": "I would take this up with the dean of the department. It's worth a shot!",
      "author": "arrakis21",
      "created": 1614483822,
      "upvotes": 2,
      "replies": {}
    },
    "gp1oy77": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1oy77/",
      "text": "Hi Omani,\n\nI am sorry to hear that you have a family member who is hospitalized. I think that your professor could have taken a more nuanced approach in this particular situation, but their behavior sounds like it is within the bounds of reason.\n\nIn response to your question, \"what should I do?\": \n\nChin up. You are still passing with 72% and it does not sound like you are facing disciplinary action for the plagiarism issue. Look at this as a valuable lesson that you will always remain responsible for any work you choose to delegate, even in a group of peers. In future assignments, remain involved in all parts of a group assignment throughout the process. Include time for verifying, and possibly correcting, any delegated group work. Otherwise, you are just gambling on the quality of the final product, which reflects poorly on you. Employers will respect your ability to manage and lead others to consistently produce quality work. Also, consider including what you learn from this situation in a future personal statement when you apply for things after college. Stories of personal growth are valuable in themselves.",
      "author": "Snoo_12140",
      "created": 1614449226,
      "upvotes": 2,
      "replies": {}
    },
    "gp1ldhp": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1ldhp/",
      "text": "Schedule an appointment with her over Zoom where you can explain how the work was divvied up & show her screenshots of your conversations with your partner regarding who did which parts of the project.",
      "author": "meggs_png",
      "created": 1614447941,
      "upvotes": 2,
      "replies": {}
    },
    "gp1js8k": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1js8k/",
      "text": "Escalate it. Take it to a dean, a department head, just someone with higher power than the teacher and bring your evidence.",
      "author": "hound30",
      "created": 1614447359,
      "upvotes": 2,
      "replies": {}
    },
    "gp1cxb3": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1cxb3/",
      "text": "Ugh what a horrible prof",
      "author": "Zeyn0202",
      "created": 1614445225,
      "upvotes": 2,
      "replies": {
        "gp1dnni": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1dnni/",
          "text": "Ikr. Sometimes, as soon as you see the prof you know if they are easy to work with or not. I really thought i would talk to her and show her everything and she would be like we will find a way to fix this.",
          "author": "omani805",
          "created": 1614445391,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gp0z3qi": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0z3qi/",
      "text": "This is why you don’t attend a shitty school.",
      "author": "arkonix1000",
      "created": 1614441753,
      "upvotes": -1,
      "replies": {}
    },
    "gp0lc0v": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0lc0v/",
      "text": "I want to emphasize a comment above for OP. The syllabus matters. OP -- and most students if r/college is anything to go by -- seems to be making assumptions about the pedagogical purpose of group work. It's usually _not_ to be a way to divide a time-intensive project; instead it's to mirror how academic (and most professional) work is done beyond the undergraduate world. There is no such thing as a co-produced biology article, op-ed, legal brief, architectural design, etc. where one party produces one part of it and the others assume their work is fine; rather, every person checks it, because every person is signing their name to it.\n\nIf that's who OP's professor views it (and if that's what the syllabus says or implies), the professor should reasonably expect OP to 1) mention there is a family reason the work may be turned in late -- which OP did -- but 2) use some of that time to review the partner's work.",
      "author": "dcgrey",
      "created": 1614438291,
      "upvotes": 3,
      "replies": {}
    },
    "gp0l8x3": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0l8x3/",
      "text": "Drop the class. Or just finish out and pass. But you probably don’t want to take it up with the academic misconduct office if it hasn’t been reported there already.",
      "author": "Happens_2u",
      "created": 1614438266,
      "upvotes": 0,
      "replies": {}
    },
    "gp0f4iy": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0f4iy/",
      "text": "If you have evidence that your partner copy-pasted or admits that he plagiarized, that should be okay. If you don’t have evidence if you used google docs you can check the document history.",
      "author": "TuriSosa25",
      "created": 1614436731,
      "upvotes": 3,
      "replies": {}
    },
    "gp0dm01": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0dm01/",
      "text": "You can probably speak to the chair person in your University",
      "author": "artistj11",
      "created": 1614436372,
      "upvotes": 2,
      "replies": {}
    },
    "gp0dh9d": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0dh9d/",
      "text": "That's why I like to do all my group projects on google docs--why? Because you can literally see who edited what, and when. If you used google docs, you can check which parts written by who--giving your professor proof on who plagiarized what.",
      "author": "artistj11",
      "created": 1614436341,
      "upvotes": 3,
      "replies": {}
    },
    "gp06wm4": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp06wm4/",
      "text": "could you go to the deans office?",
      "author": "beepbop290",
      "created": 1614434690,
      "upvotes": 2,
      "replies": {}
    },
    "gp01yem": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp01yem/",
      "text": "The only way I see this turning any good for you is if your partner takes one for the team, admits he solely cheated, and says you deserve a better grade.",
      "author": "AllamandaBelle",
      "created": 1614433568,
      "upvotes": 1,
      "replies": {}
    },
    "goz3gf1": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goz3gf1/",
      "text": "Go to the department Dean. Loop on the president or whoever is head of the whole thing.  I hate group projects.",
      "author": "OhioMegi",
      "created": 1614424441,
      "upvotes": 2,
      "replies": {
        "goz6cpp": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goz6cpp/",
          "text": "This is what i did. He said this “\n\nHi omani805,\n\n \n\nI will review everything and then discuss it with Professor.  Unfortunately, with remote learning you need to have partners you can trust and Professor cannot rely on just what you tell here.\n\n \n\nI will probably get back to you by Monday.\n \n\nRegards, Doc”",
          "author": "omani805",
          "created": 1614425546,
          "upvotes": 2,
          "replies": {
            "gozdpep": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gozdpep/",
              "text": "Partners you can trust?  Did you get to pick them?  Did you even know them before this?  I don’t trust anyone when it comes to group projects!  I hope it works out for you.",
              "author": "OhioMegi",
              "created": 1614427208,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "goyyh7s": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyyh7s/",
      "text": "What are the odds your partner would vouch for you to your prof? Are they a friend or just a random classmate?",
      "author": "sticky-dynamics",
      "created": 1614422912,
      "upvotes": 2,
      "replies": {}
    },
    "goytso6": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goytso6/",
      "text": "There should be a student advocacy group you can go to at your school.  If they can't help you they should be able to point you in the right direction.",
      "author": "ncaughneeto",
      "created": 1614419803,
      "upvotes": 2,
      "replies": {}
    },
    "goyqnlk": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyqnlk/",
      "text": "For reference I go to a state school in the US so hierarchies might be a little different per college. I would recommend you do this.\n\n1. find out who the professor‘s boss is, whether or not that is a department head or just another slightly ranking professor and contact them. Explain the calmly and impartially, make sure to include that you’ve had contact with the professor.\n2. Make sure to wait 1-2 days on a reply before you resend or escalate\n3. I would ask around your school (Facebook, Reddit, etc) and depending on how good of a chance you have it might be worth it to have a student or university honor board look at your case. \n\nI was in a similar situation where I got a zero on a final paper because a professor thought I had cheated by allowing someone to proofread my paper. I contacted the professors boss after the professor refused to change my grade back. I told the boss I was going to escalate to the honor board. A few days later my grade went back to its original score.",
      "author": "Jarboner69",
      "created": 1614416643,
      "upvotes": 3,
      "replies": {}
    },
    "goynjlk": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goynjlk/",
      "text": "I would be really upset so first, I’m sorry this happened to you. I think your first mistake was letting it slide that your partner waited so long to start the assignment. I hate group projects, I think we all do, but we still all have to get through them. In the future I would suggest staying on top of your partner early on. I know you said you were asking him to get started but there should have been regular communication about the progress of the protect etc. personally if I have a group project due in 3 days and haven’t received reassurance from my partner that their part is done or that progress has been made and they have a plan to finish on time I would have already voiced my concerns to my professor to give them a heads up of what I’m dealing with. If someone is starting a rather substantial midterm assignment two days before it’s due the chances are that they don’t intend to put a whole lot of effort into their work and the likelihood that they might cheat is definitely increased.",
      "author": "lch_xo",
      "created": 1614414858,
      "upvotes": 2,
      "replies": {}
    },
    "goyl3qj": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyl3qj/",
      "text": "Go to her boss and try to get her fired. Dipshit professors think they can get away with whatever but that isn't the case.",
      "author": "TheTrueQuarian",
      "created": 1614413338,
      "upvotes": 1,
      "replies": {}
    },
    "goyihog": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyihog/",
      "text": "I would try contacting the dean and explaining your situation, the only thing is your partner will probably get in more trouble if the dean is involved, but he also put you in this situation sooo...",
      "author": "Brodys-Boo",
      "created": 1614410891,
      "upvotes": 2,
      "replies": {}
    },
    "goyhjwv": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyhjwv/",
      "text": "If she won’t budge, go to the department chair and if that doesn’t work go to the dean and explain exactly what happened including the details with the hospital and why your part was late. Throw the other student under the bus it’s their fault for cheating and taking a two letter grade drop for their laziness is unacceptable. Don’t let them sweep it under the rug, bug whoever you need to until it is resolved.",
      "author": "mrcheese14",
      "created": 1614410056,
      "upvotes": 3,
      "replies": {}
    },
    "goyf37o": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyf37o/",
      "text": "For crying out loud they're a grown adult already. After four years of high school, how can anyone still not know by now that a) plagiarizing is a guaranteed fail, and b) Wikipedia is never considered a reliable source?\n\nI'm so sorry you had to go through that. Group projects can be a drag.",
      "author": "rtren_570",
      "created": 1614408455,
      "upvotes": 5,
      "replies": {}
    },
    "goy9y2f": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy9y2f/",
      "text": "What's with group assignments during a pandemic where we have to do online courses?  We can't rely on other people we only see on zoom who are less likely to respond to calls/texts/emails etc.  I'm beginning to think its more due to laziness and grading one project rather than for each student.  Its not fair for us, we're not the ones getting paid, we're paying the school and get stuck doing group projects over zoom?  Its almost laughable that this would even be allowed.",
      "author": "aaden08",
      "created": 1614404639,
      "upvotes": 12,
      "replies": {}
    },
    "goy6vje": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy6vje/",
      "text": "This isn't fair. She's not supposed to grade u because of one person cheated. I hope you get the justice u deserve",
      "author": "PuzzleheadedMail",
      "created": 1614403128,
      "upvotes": 3,
      "replies": {}
    },
    "goy54ao": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy54ao/",
      "text": "I’m a professor. You shouldn’t be penalized for a mistake your partner made. No way you could have known they cheated. You don’t have access to the tools we have. \n\nHere is what you do. First, get as much documentation as possible to prove your case. If you can forward the email of their contribution (since you said they sent you the parts and you sent in the compiler document) to show that the content came from the other student helps. Moreover, if you can get your partner to admit it, that’s the easiest route. You might be able to get them if you plead your case to your partner. I’ve had students come in in the past and state it was their fault with proof. Once you’ve collected this evidence, pass it on to your professor and write a professional (non confrontational) email. If she gives you a hard time, you go to both the department chair and dean of students. If that doesn’t work, DM me, there are other mechanisms in place. \n\nSorry, some professors are assholes.",
      "author": "BigBoosh37",
      "created": 1614402527,
      "upvotes": 8,
      "replies": {}
    },
    "goy39yc": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy39yc/",
      "text": "Both google docs and word have a revision history. Assuming you used one of these services pull it up and you can prove he was the one who added the plagiarism.",
      "author": "boulderss",
      "created": 1614401797,
      "upvotes": 5,
      "replies": {}
    },
    "goxzlbj": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxzlbj/",
      "text": "If you have anything written (text, groupme, email) stating who does which part of the assignmenbt, show her you did your part. Group assignments can really hurt a GPA.\n\nMake sure you communicate to the professor that you did everything you were suupose to do. If the prof still doesn't do anything THEN contact the department head.",
      "author": "kmars127",
      "created": 1614400264,
      "upvotes": 5,
      "replies": {}
    },
    "goxvhaj": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxvhaj/",
      "text": ">and chats with my partner saying that he will do that whole part\n\nSo you didn't contribute at all for the project?\n\nI'm confused. You said the project had 3 parts, and you would do the first 2, while your partner do the last one. Did you do the first 2?\n\nIf you did 2/3 of the project, and the 3rd part caused the project to fail, then show her the proof. If you have enough proof to separate your work from your partner's, then you have some ground for grade appeal.\n\n**But if you didn't make any contribution, then your professor is completely correct in not giving you any grade.** At best, you might not go down with your partner if your professor report this as an official academic dishonesty incident. (doesn't sound like she would do that.)",
      "author": "AcademicDifficulty",
      "created": 1614398846,
      "upvotes": 1,
      "replies": {
        "goy96hj": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy96hj/",
          "text": "They did the first two parts and the group member did the whole third part which is what caused the 0. \n\nThe proof honestly doesn't matter in all cases though because group projects are meant to be done as a group not divvied up and tend to be graded as one. Honestly since he submitted part of the blame does fall partly on him for not double checking. The professor could be nice about it, but I think he's just gonna have to suck it up at this point.",
          "author": "gpgc_kitkat",
          "created": 1614404086,
          "upvotes": 3,
          "replies": {
            "goy9gmx": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy9gmx/",
              "text": "OP's description was very confusing...\n\nBut anyway, I think OP should hold onto any evidence that could separate himself from the partner who cheated.\n\nIf I'm the professor, I would not give the project any credits. But if I am to file a formal academic dishonesty record, then I would make it against the partner who did cheat, and leave OP out of it.",
              "author": "AcademicDifficulty",
              "created": 1614404293,
              "upvotes": 4,
              "replies": {
                "goy9kqf": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy9kqf/",
                  "text": "I agree with this entirely",
                  "author": "gpgc_kitkat",
                  "created": 1614404367,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "goxta3g": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxta3g/",
      "text": "What’s considered a pass?? 72 still sounds good to me",
      "author": "miszswimming",
      "created": 1614398121,
      "upvotes": -3,
      "replies": {
        "goy5u25": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy5u25/",
          "text": "This is a huge blow to their gpa, if they can't bring this up it could ruin their life (depending on what they plan to do after uni.)",
          "author": "toofeduptocare",
          "created": 1614402769,
          "upvotes": 4,
          "replies": {
            "goy9cv0": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy9cv0/",
              "text": "One C is not going to completely ruin their GPA don't be dramatic",
              "author": "gpgc_kitkat",
              "created": 1614404216,
              "upvotes": 2,
              "replies": {
                "goyb03t": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyb03t/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1614405442,
                  "upvotes": -1,
                  "replies": {
                    "goyb9f5": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyb9f5/",
                      "text": "The less classes you have the worse it will look, but in the grand scheme of thing one C will not affect your overall GPA that much.\n\nIt sounds like your C came from a JuCo or some other 2-year college. Since you have only half(ish) of your anticipated classes by end of year 2 your GPA will look worse with one C than it will once you're done and have your overall GPA. \n\nI promise you that a single C cannot ruin your life if you have good grades otherwise.",
                      "author": "gpgc_kitkat",
                      "created": 1614405640,
                      "upvotes": 3,
                      "replies": {
                        "goybwcf": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goybwcf/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1614406144,
                          "upvotes": 1,
                          "replies": {
                            "goycr00": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goycr00/",
                              "text": "It definitely depends on how many classes you take but I have all As and 1 C and I have a 3.6 rn",
                              "author": "gpgc_kitkat",
                              "created": 1614406834,
                              "upvotes": 2,
                              "replies": {
                                "goyd0pe": {
                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyd0pe/",
                                  "text": "I can't believe I spent all that time stressing over something that would have balanced itself out regardless of whether or not it would transfer, thank you for the info though! :((",
                                  "author": "toofeduptocare",
                                  "created": 1614407057,
                                  "upvotes": 3,
                                  "replies": {
                                    "goyd55r": {
                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyd55r/",
                                      "text": "Don't worry. I definitely did the same thing until my advisor showed me how the math worked for GPAs. I honestly had no idea either!!",
                                      "author": "gpgc_kitkat",
                                      "created": 1614407161,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "goxst5c": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxst5c/",
      "text": "I’ve tried to fight this sort of thing before without any luck. They’ll say that it is still your responsibility to review the assignment before submission and they’ll refuse any logic you give them. When I tried to fight it, they basically said “you can either take the 0 and this doesn’t have to leave the department or you can take it to an academic misconduct hearing which you really don’t want to do”. I hate to say it but unless you can get your partner to get down on their knees and beg the professor to take all of the blame I’m not sure there’s going to be a good resolution to this.",
      "author": "xthatguy339x",
      "created": 1614397969,
      "upvotes": 6,
      "replies": {}
    },
    "goxncxn": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxncxn/",
      "text": "You should have checked what your partner was submitting.",
      "author": "jaysonm007",
      "created": 1614396206,
      "upvotes": 4,
      "replies": {
        "goxnht7": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxnht7/",
          "text": "https://www.reddit.com/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxeqs9/",
          "author": "omani805",
          "created": 1614396249,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "goxmjkq": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxmjkq/",
      "text": "I won't be of help or maybe even support, it's true that the main responsible is your work partner for not being able to keep up with college/university work's basic standards, I hope there's a way to make them re do the class or something similar.\nIn some cases plagiarism is considered a crime, and the lowest thing you can do while in college, in some extreme cases they expell the student from the University, and that also affects their future possibilities for going into another university.\nPlease think that while this situation was BS, you can still better your grade and the consecuences could've been worse.\nMaybe there's a way to re do the work on your own? I don't really know how universities work outside of Latin America",
      "author": "Tuca1225",
      "created": 1614395948,
      "upvotes": 2,
      "replies": {}
    },
    "goxly9w": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxly9w/",
      "text": "There should be some sort of honor code hearing thing you can go to at your school. Maybe they can help you out if you prove you didn’t plagiarize, so you shouldn’t be punished for it.",
      "author": "rosiewitchy",
      "created": 1614395753,
      "upvotes": 2,
      "replies": {}
    },
    "goxl8xk": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxl8xk/",
      "text": "I nearly had this happen to me. Thank god I recognized the person I worked with clearly didn't have the level of writing capability and I reversed looked it up on Google. \n\nGently reminded them to reference, use their own words, because it's considered plagiarism. My luck that they actually pulled though and learned and made up for it. You can't fucking cheat especially with such a dumb tactic.\n\nIf I didn't cover my own ass I'd be in the same situation as you. Hopefully you can get it fixed but otherwise you can come out of this with that lesson in mind (I'm sure you already knew that though..)",
      "author": "Map-leaf",
      "created": 1614395526,
      "upvotes": 12,
      "replies": {
        "goyapd8": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyapd8/",
          "text": "I have no idea why this is so common (or if I just have bad luck), but this exact situation has happened to me multiple times in the past year. I've been in group papers where things have literally been copied word for word or had a couple words changed. In one of these situations, I was working in a group mostly with international students and had difficulty communicating this with them, so I just ended up rewriting one member's entire section.\n\nI just want to know why people do this. Do they not understand what plagiarism is? Do they just not give a shit? Because honestly I'd way rather take a poor grade than face the consequences of plagiarizing something and getting caught. You would think that someone plagiarizing something wouldn't be so blatantly obvious. It's honestly easier to do the work than plagiarize.",
          "author": "throwaway13630923",
          "created": 1614405214,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "goxh7h0": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxh7h0/",
      "text": "All of that is true, however, that does not necessarily mean that the OP needs to bear it. At worst, he is guilty of academic misconduct through negligence, not academic dishonesty. There are obvious mitigating factors at play here and most people will see that. For a degree to be worthless, no action would have to be taken at all in a situation like this. You are creating a false dichonomy. You cannot just assume people have perfect foresight no matter how unexpected something is. Warnings exist for a reason.",
      "author": null,
      "created": 1614394129,
      "upvotes": 2,
      "replies": {}
    },
    "goxgkq3": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxgkq3/",
      "text": "That sucks bro",
      "author": "xyeIIow",
      "created": 1614393865,
      "upvotes": 0,
      "replies": {}
    },
    "goxfund": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxfund/",
      "text": "I think your next move is just to ask nicely if your professor can offer you some extra credit work.\n\nIn group projects you are supposed to work as a group. If you had worked together instead of just doing parts individually, you likely would have noticed the plagiarism. I'm very sorry about what you are going through outside of school, and I know this must feel unfair. Unfortunately, this is a pretty standard policy for group projects. \n\nIt's time to work your butt off and get that grade back up through other means.",
      "author": null,
      "created": 1614393540,
      "upvotes": 5,
      "replies": {}
    },
    "goxf02e": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxf02e/",
      "text": "It doesn't matter if your partner plagiarized, what matters is that YOU don't submit any plagarized work. You need to pay attention to what you submit. \n\nUnless if you submitted parts 2 and 3 and your partner submitted part 1 without your knowledge there's nothing much you can do.",
      "author": "academic96",
      "created": 1614393122,
      "upvotes": 4,
      "replies": {
        "goxfh8q": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxfh8q/",
          "text": "This is kind of a catch 22. When I submitted the work i was told i plagiarized. If I didn’t submit the work, I would’ve been told its a group project, its both our responsibilities to submit. Im not saying you are wrong  but I would’ve been fucked either way",
          "author": "omani805",
          "created": 1614393350,
          "upvotes": 4,
          "replies": {
            "goxfykg": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxfykg/",
              "text": "If you submit half the project you're getting 50% partial marks for that (I assume) so you'd be half as fucked. While not great I think that'd still put you in the mid 80s.\n\nAlso if you specifically emailed the prof \"I can only submit half because my partner plagiarized and I cannot submit plagiarized work\" then it's more likely that she would put more effort in to make alternate arrangements.\n\nedit: another reason why group projects suck",
              "author": "academic96",
              "created": 1614393595,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "goxeq5m": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxeq5m/",
      "text": "If I was you I would ask for a hearing with your school’s academic integrity board, and hire a lawyer. An academic integrity lawyer could get you off for this since you didn’t do the plagiarizing and you have proof.",
      "author": "ilikecacti2",
      "created": 1614392982,
      "upvotes": -1,
      "replies": {}
    },
    "goxduk7": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxduk7/",
      "text": "This is just another reason why group projects, especially during the pandemic, are a fucking waste of time.\n\nYour professor obviously just doesn’t want to do anymore work and you’re basically asking her to work overtime without pay. I bet the whole reason she assigned a group project was to only have to grade 1 item for multiple people - just like every tenured professor who assigns group projects.",
      "author": null,
      "created": 1614392484,
      "upvotes": 37,
      "replies": {
        "goyz0fz": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyz0fz/",
          "text": "I wouldn't apply this to all professors. In my field (software development) group work is pretty much standard to the professional industry, so learning to work with a team is very much applicable.",
          "author": "sticky-dynamics",
          "created": 1614423074,
          "upvotes": 2,
          "replies": {}
        },
        "gp6edc6": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp6edc6/",
          "text": "I would encourage you to broaden your perspective a bit. Group work is an important and pedagogically sound method of teaching/learning. I get that many students do not like it, but there is a lot of research on group work and its effectiveness. \n\nIf I wanted to do less work, I would just assign quizzes in the LMS and then I don't have to grade anything.",
          "author": "DD_equals_doodoo",
          "created": 1614524800,
          "upvotes": 0,
          "replies": {
            "growyyf": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/growyyf/",
              "text": "[removed]",
              "author": null,
              "created": 1616326763,
              "upvotes": 1,
              "replies": {
                "grox7nk": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grox7nk/",
                  "text": "That doesn't really address my point. My point is that there is quite a bit of research supporting the effectiveness of group work which is one of the reasons why it is so frequently assigned.",
                  "author": "DD_equals_doodoo",
                  "created": 1616326963,
                  "upvotes": 1,
                  "replies": {
                    "grp8ay6": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grp8ay6/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1616334783,
                      "upvotes": 1,
                      "replies": {
                        "grpydt3": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grpydt3/",
                          "text": "I don't think there is any research supporting your perspective. I can find research that suggests quite the contrary.",
                          "author": "DD_equals_doodoo",
                          "created": 1616347900,
                          "upvotes": 1,
                          "replies": {
                            "grpygvy": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grpygvy/",
                              "text": "[removed]",
                              "author": null,
                              "created": 1616347940,
                              "upvotes": 1,
                              "replies": {
                                "grq20t1": {
                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grq20t1/",
                                  "text": "Go for it because I'd love to see it. Look, I get that you don't like group work. I teach. I assign group work because it is required by my college and it is effective. Why do you suppose that colleges require group work for some classes?",
                                  "author": "DD_equals_doodoo",
                                  "created": 1616349616,
                                  "upvotes": 1,
                                  "replies": {
                                    "grq35s3": {
                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grq35s3/",
                                      "text": "[removed]",
                                      "author": null,
                                      "created": 1616350176,
                                      "upvotes": 1,
                                      "replies": {
                                        "grsd814": {
                                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grsd814/",
                                          "text": "If I want to grade less, I can just make M/C quizzes and exams and grade nothing. So that doesn't really make sense. \n\n>  It's also a learning process where bad students can learn from the good  ones, which comes at the expense of good students. Overall less work for  the university. \n\nI've seen no evidence to support this. Again, I encourage you to think critically about why faculty and universities assign group work beyond your opinion and consider that universities generally have your best interest in mind when it comes to learning.",
                                          "author": "DD_equals_doodoo",
                                          "created": 1616397176,
                                          "upvotes": 1,
                                          "replies": {
                                            "grsnwez": {
                                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grsnwez/",
                                              "text": "[removed]",
                                              "author": null,
                                              "created": 1616408067,
                                              "upvotes": 1,
                                              "replies": {
                                                "grsvj1h": {
                                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grsvj1h/",
                                                  "text": "> Well at my university they don't make MC quizzes or at least only like  10% of the grade can be that. I doubt the university would let a  professor do 100% MC given how incredibly easy it is to get high marks  on those. What a bad point. \n\nSure they can. I have the ability to make them 100% of the course grade. In several years at a few institutions I've never heard of a \"cap\" on quizzes or exams. \n\n> No, universities have in mind to profit from as many students as  possible. Professors have incentive to do as little as possible for  their students so they can focus on research. Group work is one of the  laziest ways a teacher can give out work, and like I said yes, it helps  out poor students at the expense of the hard work of the good students.  The only way to properly have a university is to separate the professors  who teach and the professors who research, and also make the university  not dependant on tuition, otherwise there is always a conflict of  interest between the students and the university. \n\n This is a lot of opinion without any evidence. If universities wanted to profit as much as possible, they would just have a model where the professor teaches as many sections of 100+ students and all M/C exams. \n\nGroup work actually takes a lot of time if done well. I don't know why you keep saying it is \"lazy\" without evidence. \n\n> Instead of repeating like a parrot about studies and thinking  critically, how about actually giving a response? Can you critically  think and give a response? Or are you going to bullshit like every other  teacher about oh that's the way things are as they prepare you for real  life or this is good for you do to 100% of the work of the people in  the group. From your responses it sounds like you yourself aren't  exactly sure given how you don't actually want to give a direct response.\n\nYou say that I'm \"repeating like a parrot about studies.\" Are you suggesting that faculty not follow research on pedagogy and effective learning strategies? Of course I am going to say I follow best  practices in class learning - which is also my answer here. I would strongly encourage you to read the literature before you pass any judgements.",
                                                  "author": "DD_equals_doodoo",
                                                  "created": 1616414364,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "grswifl": {
                                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grswifl/",
                                                      "text": "[removed]",
                                                      "author": null,
                                                      "created": 1616415049,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "grsy1uw": {
                                                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grsy1uw/",
                                                          "text": "Teaching expectations actually increase as university rank declines. So you should be pointing in the other direction. \n\n> At my university the examination of courses is reviewed against  standards to make sure they are of some quality which implies little to  noMC. \n\nThat's not how accreditation and auditing works. I've served on accreditation reviews. \n\n \n\n>I'm  not sure if you're being disingenuous at this point or have some  reading disability. I'll assume disingenuous given you are a professor.  For the third time in the row, yes it is helpful for the poor performing  students which comes at the expense of the hard working ones. If the  hard working student had put his efforts of managing his braindead  teammates into studying more, thered without a doubt be better learning  outcomes for the hard working student with regard to academics. If this  is the way you converse with people where you just tell them no and to  look at evidence without even mentioning what evidence, then you really  are a lazy professor with zero critical thinking skills. \n\nOr, perhaps, a third option that a faculty member knows more than a college student about teaching effectiveness? I know the literature. I don't have to prove it to you. If you want to convince faculty like me, you need some sort of evidence - the point I'm trying to show you here. Right now, you're just complaining about group work which solidifies that I'm right to continue assigning group work. \n\n>  \n>  \n>How can you  know I did not read the literature and this is the conclusion I came to?  How do I know you are not bullshiting and making stuff up? Do you know  how to build up an argument? What about evaluating evidence and not  blindly following it?\n\nBecause you've 1. cited none. 2. It flies in the face of research. Again, the onus is on you to convince me. My courses are reviewed and approved. I see no reason to change them because of someone complaining about the possibility that they *might* have to work harder than someone else.",
                                                          "author": "DD_equals_doodoo",
                                                          "created": 1616416064,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "grt1lck": {
                                                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grt1lck/",
                                                              "text": "[removed]",
                                                              "author": null,
                                                              "created": 1616418221,
                                                              "upvotes": 1,
                                                              "replies": {
                                                                "grt2la0": {
                                                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grt2la0/",
                                                                  "text": "Again, I don't have to cite anything. \n\n> I bet the literature you use to justify group work is just surveys done  after the group work which are utterly useless as nobody is going to  rate it poorly as of course complications in group work can lead to  negative effects on marking for students.  \n\nYou bet wrong. Any other guesses? \n\n> You not caring about issues related to group work like how people leech  off of other or not do anything, while putting the onus on certain  students to carry the group just shows you don't care and are lazy. I  understand in your head it's not a big deal but from the perspective of  students it screams laziness and lack of care. You still haven't  justified why you give group work except some studies out there say it's  good and that's how it's always been. Classic excuses which piss  students off. Explain to a student whose teammates do literally zero or  submit garbage work which cannot be used what exact academic value this  brings. \n\nI care, which is why I follow research on best practices on education and learning effectiveness! \n\n> You're just going to repeat yourself and not actually say anything of  value. You think you're right, and admitted you're not even gonna try to  provide evidence or build any form of argument. It's just academic  elitism which is rich from a professor at a  third rate university. I  guess at least the students are your university are below you in your  mind so you like to act as a figure of authority. If a student were to  be right and you were to be wrong about group work, this would be a  personal hit to your personality which is not acceptable, so you won't  even give the chance for a person to provide good counterpoints to you. \n\nQuiet  the contrary. I care about their learning and so I follow best practices in research. \n\nBest of luck! As you get older and learn more, I hope you look back at this conversation with a much different mindset.",
                                                                  "author": "DD_equals_doodoo",
                                                                  "created": 1616418782,
                                                                  "upvotes": 1,
                                                                  "replies": {
                                                                    "grt3h8g": {
                                                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grt3h8g/",
                                                                      "text": "[removed]",
                                                                      "author": null,
                                                                      "created": 1616419271,
                                                                      "upvotes": 1,
                                                                      "replies": {
                                                                        "grt5xp8": {
                                                                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grt5xp8/",
                                                                          "text": "If that makes you feel better!",
                                                                          "author": "DD_equals_doodoo",
                                                                          "created": 1616420581,
                                                                          "upvotes": 1,
                                                                          "replies": {
                                                                            "grt68rl": {
                                                                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grt68rl/",
                                                                              "text": "[removed]",
                                                                              "author": null,
                                                                              "created": 1616420739,
                                                                              "upvotes": 1,
                                                                              "replies": {
                                                                                "grt987s": {
                                                                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grt987s/",
                                                                                  "text": "If you say so! Good luck in school and I hope you create the next Apple!",
                                                                                  "author": "DD_equals_doodoo",
                                                                                  "created": 1616422188,
                                                                                  "upvotes": 1,
                                                                                  "replies": {
                                                                                    "grtdidr": {
                                                                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grtdidr/",
                                                                                      "text": "[removed]",
                                                                                      "author": null,
                                                                                      "created": 1616424190,
                                                                                      "upvotes": 1,
                                                                                      "replies": {
                                                                                        "gru628c": {
                                                                                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gru628c/",
                                                                                          "text": "If there were any evidence to support it outside of your opinion, I would! :).",
                                                                                          "author": "DD_equals_doodoo",
                                                                                          "created": 1616436585,
                                                                                          "upvotes": 1,
                                                                                          "replies": {
                                                                                            "gru9m84": {
                                                                                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gru9m84/",
                                                                                              "text": "[removed]",
                                                                                              "author": null,
                                                                                              "created": 1616438165,
                                                                                              "upvotes": 1,
                                                                                              "replies": {
                                                                                                "gruao5r": {
                                                                                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gruao5r/",
                                                                                                  "text": "I wasn't born yesterday. I know how this works. I'll provide citations. You'll argue they aren't good enough and criticize them despite lacking any qualifications to do so. You've demonstrated you're not open to new information or evidence. I have shown I'm willing. At it's face, you're not debating in good faith so there isn't any reason for me to provide anything until you've shown you're willing to consider it.  \n\nIn reality, you've chosen to make remarks about my career mediocrity which are a bit perplexing given I have a terminal degree in my field, publications in top journals, etc. instead of focusing on the topic. You're clearly angry about this for some odd reason and not willing to listen to an expert's perspective.",
                                                                                                  "author": "DD_equals_doodoo",
                                                                                                  "created": 1616438641,
                                                                                                  "upvotes": 1,
                                                                                                  "replies": {
                                                                                                    "gruccpl": {
                                                                                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gruccpl/",
                                                                                                      "text": "[removed]",
                                                                                                      "author": null,
                                                                                                      "created": 1616439393,
                                                                                                      "upvotes": 1,
                                                                                                      "replies": {
                                                                                                        "grudcir": {
                                                                                                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grudcir/",
                                                                                                          "text": "Because of your comments criticizing studies before I even presented them? \n\n> Your opinion isn't really expert given you haven't been able to respond to a single one of my points. \n\nMy opinion is expert, because I'm an expert. \n\n> I'm not angry, I'm just pointing out how completely unwilling you are to  make responses to any arguments and want your authority to be taken at  face value. \n\nFriend, I've made several efforts to point this out to you. Reread your comments. You've expended more effort arguing than simply opening a new google scholar tab in your browser and searching efficacy of group work learning and reading a handful of the 3.8M results on the subject. This is how we start comprehension of a topic, not by me handselecting articles for you to rebut.",
                                                                                                          "author": "DD_equals_doodoo",
                                                                                                          "created": 1616439835,
                                                                                                          "upvotes": 1,
                                                                                                          "replies": {
                                                                                                            "grudzdd": {
                                                                                                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grudzdd/",
                                                                                                              "text": "[removed]",
                                                                                                              "author": null,
                                                                                                              "created": 1616440121,
                                                                                                              "upvotes": 1,
                                                                                                              "replies": {
                                                                                                                "gruh67t": {
                                                                                                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gruh67t/",
                                                                                                                  "text": "I already mentioned 3.8M results. Common sense should tell you that. But again, I can't provide you any evidence when you've already outright indicated you will ignore research you deem insufficient despite lacking any qualifications to do so. \n\nI'm not pushing any arguments of authority. I'm telling you that you need to search the evidence yourself instead of arriving at the conclusions then working backwards. You've arrived at your conclusion based on what? You say group learning is ineffective. You've indicated no evidence for how and why.",
                                                                                                                  "author": "DD_equals_doodoo",
                                                                                                                  "created": 1616441560,
                                                                                                                  "upvotes": 1,
                                                                                                                  "replies": {
                                                                                                                    "gruishq": {
                                                                                                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gruishq/",
                                                                                                                      "text": "[removed]",
                                                                                                                      "author": null,
                                                                                                                      "created": 1616442296,
                                                                                                                      "upvotes": 1,
                                                                                                                      "replies": {
                                                                                                                        "grulhi4": {
                                                                                                                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grulhi4/",
                                                                                                                          "text": "I'm asking you to look up at least one. What study?\n\nSaying you're not qualified to assess academic peer reviewed journals is a statement of fact, not an opinion. \n\n> how studies which are based on group work evaluations are flawed \n\n1. You're not qualified to make that judgement 2. What part of the research design is flawed. \n\nI'm not saying this to be rude. Just understand that research takes years to understand and considerable training.",
                                                                                                                          "author": "DD_equals_doodoo",
                                                                                                                          "created": 1616443505,
                                                                                                                          "upvotes": 1,
                                                                                                                          "replies": {
                                                                                                                            "grulyjd": {
                                                                                                                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/grulyjd/",
                                                                                                                              "text": "[removed]",
                                                                                                                              "author": null,
                                                                                                                              "created": 1616443718,
                                                                                                                              "upvotes": 1,
                                                                                                                              "replies": {
                                                                                                                                "gruo5tg": {
                                                                                                                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gruo5tg/",
                                                                                                                                  "text": "That wasn't an actual study. You disagreed with the method. You're referring to common method bias, which can be controlled for in a variety of ways. Again, you lack a fundamental understanding of research design (and statistics) necessary to have a conversation about research validity. You're prejudging studies without having any understanding of how research methods work. \n\n> I'm qualified to read them and  evaluate them in the context that they are written. I'm not qualified to  peer review them, but definitely I can read and assess them because I  can read.\n\nThat's absolutely not how it works.",
                                                                                                                                  "author": "DD_equals_doodoo",
                                                                                                                                  "created": 1616444714,
                                                                                                                                  "upvotes": 1,
                                                                                                                                  "replies": {}
                                                                                                                                }
                                                                                                                              }
                                                                                                                            }
                                                                                                                          }
                                                                                                                        }
                                                                                                                      }
                                                                                                                    }
                                                                                                                  }
                                                                                                                }
                                                                                                              }
                                                                                                            }
                                                                                                          }
                                                                                                        }
                                                                                                      }
                                                                                                    }
                                                                                                  }
                                                                                                }
                                                                                              }
                                                                                            }
                                                                                          }
                                                                                        }
                                                                                      }
                                                                                    }
                                                                                  }
                                                                                }
                                                                              }
                                                                            }
                                                                          }
                                                                        }
                                                                      }
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "goxcqaz": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxcqaz/",
      "text": "Idk about yours but my university has a clear rule about that. If one of the members cheat you all get zero. Apparently we are supposed to check each other’s work. Tough luck.",
      "author": "MaleficentDistrict22",
      "created": 1614391833,
      "upvotes": 41,
      "replies": {
        "goxe09a": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxe09a/",
          "text": "This is what everyone keeps saying but i feel like in my situation she should at least make me do the plagiarized part for 75% of the grade. I feel like people would think im entitled. There was more to this but i cant put my thoughts into words",
          "author": "omani805",
          "created": 1614392574,
          "upvotes": 21,
          "replies": {
            "goxptzi": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxptzi/",
              "text": "The whole situation sucks for sure, but try to look at it as a learning point. Group projects can definitely suck,  especially during a pandemic, but you will face similar scenarios in the workplace. For example, if you were working with a few coworkers on a project and they majorly effed up their portion, but you didn’t take the responsibility to double check their work, that’s on you too. Hence why colleges often give one grade for everyone. It’s your responsibility to make sure that the project is up to par, as well as everyone else’s. Next time, take the extra time to check someone’s else’s work.",
              "author": "Raven_Em",
              "created": 1614397011,
              "upvotes": -18,
              "replies": {
                "goxqjc4": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxqjc4/",
                  "text": "I get what you are saying and i agree with you. The problem is that I wasn’t home chilling watch Netflix, i was at the hospital because of an emergency.",
                  "author": "omani805",
                  "created": 1614397231,
                  "upvotes": 27,
                  "replies": {
                    "goz7uzi": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goz7uzi/",
                      "text": "How many days were you at the hospital for? If it was only one day, the professor can say that you shouldn’t have put it off till the last minute. If you were there for more than just a day it will be a lot easier to fight it with the dean.",
                      "author": "Raven_Em",
                      "created": 1614425883,
                      "upvotes": -6,
                      "replies": {
                        "gozfigp": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gozfigp/",
                          "text": "It isn't OP's fault that their partner didn't submit their work until last minute. According to previous comments, OP tried to get their partner to work on it *at least* 2 weeks earlier and they consistently pushed it back. Why should it then be on OP that they weren't able to check their partner's work last minute while in the middle of an emergency? And besides that, why would it be held to OP at all? If someone is seriously stupid enough to copy/paste Wikipedia, it clearly wasn't a coordinated effort to cheat, and is the fault of 1 member not both. How are you supposed to avoid that as the member who did their work legitimately? Are you supposed to see that your partner finished their work last minute, but that it's all plagiarized, and write the equivalent of days of work yourself in the timespan of an hour just so it isn't plagiarized? How are you even supposed to tell that your partner plagiarized their work if it isn't as obvious as this case? The whole \"if one person cheats, everyone fails\" argument is absolutely ridiculous, especially in cases where you don't get to choose your partners. It's clearly only the fault of one person here, so why should the blame be extended beyond that? At the *worst*, OP should be given an opportunity outside of the group setting to make up the work that their partner plagiarized. It's just ridiculous to hold a student accountable to the actions of someone outside of their control.",
                          "author": "para_lyzed",
                          "created": 1614427617,
                          "upvotes": 13,
                          "replies": {
                            "gozi5nu": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gozi5nu/",
                              "text": "I’m not saying it’s all the OP’s fault. I was saying that if the OP was at the hospital for than one day, it will be easier to fight. Since the professor already seems like an asshole, if OP told the dean they were only at the hospital for one day, the professor would most likely give a speech about doing work at the last minute.",
                              "author": "Raven_Em",
                              "created": 1614428572,
                              "upvotes": -5,
                              "replies": {
                                "gozo2su": {
                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gozo2su/",
                                  "text": "And my argument is that OP should not be held liable for the work of others in this setting *period*, which directly contradicts your previous statement. Sure, if you were employed and worked on a paper with other employees, each member should check the paper on at least a basic level. However, in a work setting, the manager in charge of the project would keep track of who wrote what and hold them accountable for their mistakes. The *manager* and/or a team of editors are the ones that will do a deep chack on everything and ensure everything is fact checked and not plagiarized. After all, it wouldn't make sense to risk firing a good employee for the mistake of someone else, as that would cost the company money in the long term.\n\nThere's no reason then, that each member of a team should be held accountable for the mistakes of others if they dramatically impact the project. After all, college students aren't employees, and they have no inherent control over how another group member chooses to complete their portion of a project, and that's assuming they even submit anything. It doesn't matter how many times you ask them to do their work, they aren't at risk of getting *fired*, so if they were willing to cheat, you better bet they don't care how it'll affect other group members. If it's the way they would've handled an individual project, then it'll still be the way they handle a group project, no matter what they're told.\n\nIn this scenario, the member who plagiarized should receive proper reprimand, be taken off the group project, and the work of the group should either be graded by what the rest of the group was able to complete themselves, or the group (or individuals) should have an option to make up the work of the student who cheated. In the worst case scenario, the group should have an opportunity to compare an entirely new make-up project. In *no* case should students who completed their work legitimately be held liable for those who did not. Teachers use paid software to check for plagiarism, and students don't have access to that software without purchasing it themselves. Even if the students went through and checked for plagiarism in that manner, they can't be guaranteed that the student who plagiarized submitted their work in time for them to catch it and rewire the section. After all, the whole group has a single due date that the project needs to be in by, it's inevitable that some students will post their sections within hours of the due date, not allowing time for it to be rewritten. In fact, the same students who cheat are almost certainly going to procrastinate beforehand, so I'd *expect* that plagiarized work would be turned in last minute.\n\nNo matter the case, if someone is willing to plagiarize, they will plagiarize. It doesn't matter if the rest of their group wants them to do it legitimately, the rest of the group *doesn't have a choice*, nor do they know beforehand that someone is going to plagiarize. The only solution to that would be that every group member wrote the entire project on their own just in case *anyone else* plagiarized their work, and replaced it with their own work immediately upon finding out. But at that point, it's better off being an individual project, since everyone is writing the entire project themselves anyways.",
                                  "author": "para_lyzed",
                                  "created": 1614430256,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "goykmyv": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goykmyv/",
                  "text": "College group projects are nothing like the workplace, at least the ones I have been associated with so far. That’s a bullshit line professors continue to push so that they can justify these crappy assignments, nothing more.",
                  "author": "MC_chrome",
                  "created": 1614412909,
                  "upvotes": 15,
                  "replies": {
                    "gp1ize1": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1ize1/",
                      "text": "Yeah, I’ve been working in my field for about 10 years. At no point has my boss ever been like, hey if Joe fucks up his work you both are going to be fired.",
                      "author": "Dont_Blink__",
                      "created": 1614447056,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "goxbsxd": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxbsxd/",
      "text": "Talk to a student advocate from you school. Judgements on academic misconduct (plagiarism) are often not left to the professor to make a judgment on (in the US). Good luck.",
      "author": "Thestruggleisfeels",
      "created": 1614391301,
      "upvotes": 15,
      "replies": {
        "goye2kw": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goye2kw/",
          "text": "This is accurate; students often don't know about the appeals process b/c many instructors do not want to fill out the paperwork [or give the student an official mark on their record]. However, the formal recourse is to go through the university's office of academic integrity.\n\nIn this specific circumstance, going to the chairperson informally first is the easier choice, then move into formal procedures as necessary.",
          "author": "MatthewHWood",
          "created": 1614407838,
          "upvotes": 10,
          "replies": {}
        },
        "goya5gn": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goya5gn/",
          "text": "Yep, professors at my school are required by school rules to refer students suspected of cheating to the academic integrity office or honor court, not sure which. I have no idea how OP's school works, but if it's anything like mine, the professor might be doing him a favor to only give him a zero on the project and not escalate it further.",
          "author": "throwaway13630923",
          "created": 1614404794,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "goxb7fw": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxb7fw/",
      "text": "Did you submit the work?\n\nWhy on earth would anybody not run their assignments through a similarity/plagiarism test?",
      "author": "Jarrrad",
      "created": 1614390962,
      "upvotes": 4,
      "replies": {}
    },
    "goxa3r6": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxa3r6/",
      "text": "ooof thats rough. I hate group projects",
      "author": "iTrade_and_iGame",
      "created": 1614390337,
      "upvotes": 37,
      "replies": {
        "goxal97": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxal97/",
          "text": "Yeah. I would’ve rather did the whole project myself, got an A and forgot about it.",
          "author": "omani805",
          "created": 1614390611,
          "upvotes": 36,
          "replies": {}
        },
        "gp0zd5t": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0zd5t/",
          "text": "Group projects are a necessary evil, you go work an internship or a real job after college, you're rarely working alone. If you can't figure out how to get others to pull their weight then you're not gonna have a fun time for the rest of your life.",
          "author": "thiskidlol",
          "created": 1614441807,
          "upvotes": -6,
          "replies": {
            "gp1ic2v": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1ic2v/",
              "text": "Working in groups in a job setting is nothing like group projects in school.",
              "author": "Dont_Blink__",
              "created": 1614446797,
              "upvotes": 7,
              "replies": {
                "gp1lrny": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1lrny/",
                  "text": "You don't have that one person on the team that's always busy with some other project so they don't contribute to the team leaving the rest of the team to pick up slack? \n\nThere's no one on your team despite you showing them exactly how to do something, they still fail to learn from it and make the same mistakes? \n\nYou're telling me that your job does not have some one who just couldn't care less about being there? \n\nYou're working a REALLY good job in that case, hats off to you, keep that job!",
                  "author": "thiskidlol",
                  "created": 1614448083,
                  "upvotes": -1,
                  "replies": {
                    "gp1m05x": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1m05x/",
                      "text": "Sure, but I’ve never been threatened to be fired because Kevin didn’t do what he was supposed to do or did it wrong. I’ve also never been held responsible for someone else having a bad work ethic or not holding up their end. Those people get transferred or fired. The boss doesn’t tell me it’s my fault that they suck at their job.",
                      "author": "Dont_Blink__",
                      "created": 1614448161,
                      "upvotes": 9,
                      "replies": {
                        "gp1macf": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1macf/",
                          "text": "You're again working a really good job and have a reasonable management in place. I'm not saying this facetiously. A lot of times a team failure means the whole team failed to management.",
                          "author": "thiskidlol",
                          "created": 1614448258,
                          "upvotes": -2,
                          "replies": {
                            "gp1mlli": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1mlli/",
                              "text": "I’ve worked at several places, I’ve never been held responsible for someone else’s ineptitude. Usually, it they are that big of an issue it’s well known by management.",
                              "author": "Dont_Blink__",
                              "created": 1614448375,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gox9x9u": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox9x9u/",
      "text": "How can you turn in a group project in two different languages? A group project means everyone takes responsibility for the entire project, it’s part of college and learning how to work in groups. If that guy thinks he can plagiarize from wiki none the less he should be taught a huge lesson and either get expelled or an f in the class. Plagiarizing is a huge mistake and no college let’s students get away with it. You being that persons partner should’ve looked it over. I would accept the grade and be glad you’re not getting an F in the class. Why didn’t he give credit to his source?",
      "author": null,
      "created": 1614390238,
      "upvotes": 10,
      "replies": {
        "goxah8j": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxah8j/",
          "text": "The project is in English , the hospital admission is in a different language because I’m learning from home in a different country. \n\nThat guy was a huge pain in the ass, i had to remind him about the project everyday and he would be like don’t worry i will get it done. And this is what i got in return.",
          "author": "omani805",
          "created": 1614390547,
          "upvotes": 19,
          "replies": {
            "goxb4iy": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxb4iy/",
              "text": "Oh. It’s up to the professor to accept the doctors note or not. Doctors excuses can permit you from being late, which she did. I would definitely be glad you aren’t getting in trouble for his plagiarism. Writing papers and knowing how to give credit to sources is a huge part of college and rule number one is not using Wikipedia and if you absolutely have to you give credit. I would’ve kicked him out of class and given the group an F. That’s what happens when people cheat, and that person is lucky he’s not expelled. Working with people is another important part of college, I would accept the F... make it known that that was his part of the paper to the School and that you would never have done that... and be happy you didn’t fail the class. Cheating from wiki none the less... that almost rule number one- never use wiki in papers\nAs sources. A person that stupid should be expelled from college... cheating from wiki? Don’t students know professors have very intelligent programs they enter papers into to check for plagiarism? If he is that stupid he shouldn’t be in college.\nEdit: I would tell the school, that he cheated and should have repercussions while you did the majority of the work on your parts.. and that you were on him all the time and he wasn’t working well with you. Again, you should’ve looked over his part. Sucks you had a stupid partner.",
              "author": null,
              "created": 1614390915,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gox9en6": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox9en6/",
      "text": "Under the bus your classmate goes. \n\nSeriously -- If everything here is true run them over with the bus. Back up over them. And then drive away over them again one more time for safe measure. \n\nCopy / pasting wiki this day in age is the DUMBEST thing to do in a college setting and if you do it you absolutely deserve to get fucked.",
      "author": null,
      "created": 1614389944,
      "upvotes": 161,
      "replies": {
        "gox9p8a": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox9p8a/",
          "text": "This is literally what i did. Screenshots, chats, everything. I never thought someone could be this dumb",
          "author": "omani805",
          "created": 1614390111,
          "upvotes": 80,
          "replies": {
            "goy4lbt": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy4lbt/",
              "text": "[removed]",
              "author": null,
              "created": 1614402339,
              "upvotes": 17,
              "replies": {
                "gp9cl6x": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp9cl6x/",
                  "text": "Sorry, it seems your thread or comment is in violation of /r/college Rule #5: Keep it legal and safe.  \r\n\r\nWe permanently ban members whose posts or comments either describe participation in or advocate for illegal or dangerous behavior. The number one offense in this category is piracy. If you link or otherwise refer someone to a repository of pirated material, it's a no questions asked permanent ban. Same for drugs, same for any other activity that breaks the law or endangers safety.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
                  "author": "VA_Network_Nerd",
                  "created": 1614567121,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gp0wkgk": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0wkgk/",
              "text": "Does your school have an Honor Court system you might be able to bring this up to?",
              "author": "DazedPenguin15",
              "created": 1614441237,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gox79st": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox79st/",
      "text": "I had the same problem in two exercises I had to make last year and I have done nothing so far. I am also thinking about it... should I try something?",
      "author": "dzn_m",
      "created": 1614388746,
      "upvotes": 1,
      "replies": {}
    },
    "gox31nl": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox31nl/",
      "text": "What does the syllabus say about grading  group projects?  If it says that all students receive the same grade, all students receive the same grade: in this case, a zero. The expectation is that group-assigned work will be completed as a group, not divvied up and glued together at the last minute.  \n\n  \nI'm sorry about your uncle, but this is likely how your professor sees it.",
      "author": "Judythe8",
      "created": 1614386529,
      "upvotes": 27,
      "replies": {
        "gox90o5": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox90o5/",
          "text": "I mean, you’re right to an extent, and OP should’ve done a final check (perhaps they didn’t have time due to the uncle). But not divvying up the work? It’s not really realistic imo to expect the team members to be together actively working as they write the entire thing, particularly if it’s a fairly long paper. You should have a decent idea of what your fellow group members are going to write, and review each others’ work, but I’m not sure how writing an essay only as a group would even work.",
          "author": "spleedge",
          "created": 1614389726,
          "upvotes": 22,
          "replies": {
            "gozrsro": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gozrsro/",
              "text": "In a group project, work should be divvied up... but not just then blindly accepted by the rest of the group. Everyone is in charge of QC.",
              "author": "bl1y",
              "created": 1614431121,
              "upvotes": 4,
              "replies": {
                "gp2lvv6": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp2lvv6/",
                  "text": "Yes, as I said “OP should’ve done a final check” and “you should... review each other’s work”",
                  "author": "spleedge",
                  "created": 1614457305,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "goxssrg": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxssrg/",
              "text": "Oh, I'm definitely right.  But I also understand where you're coming from.  \nIf you were the professor in this instance, how would you deal with this situation?",
              "author": "Judythe8",
              "created": 1614397966,
              "upvotes": -1,
              "replies": {
                "goy0hpt": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy0hpt/",
                  "text": "Hey, I respect that attitude. \n\nI’m not a professor, so I am sensitive to the time it might take to do something like this. But I would make an effort to determine whether both students are guilty or only one. Even if I had a rule like that in the syllabus, this seems like a prime example of an exception (and that would be possible, right, since 99% of syllabi are subject to change at any time?). \n\nThis is particularly the route I’d take because at my school any academic integrity/plagiarism violation the professor wishes to punish is supposed to be reported by the professor to Student Judicial Affairs. I’m fairly certain OP would be found guilty, which is at minimum a fail in the class and at maximum expulsion. Personally this is not grounds to go that route. \n\nMaybe that’s my bias as a student talking, but I feel for OP. I certainly wouldn’t refuse to listen to their story. If I could determine certainly that they were unaware of the violation, I would give them the chance to re-do the work their partner was supposed to do honestly, and then re-grade the assignment in its entirety as if that was originally handed in. Give OP that grade and report the other student. \n\nAgain, maybe too time-consuming or idealistic. I feel it’s pretty fair to all parties involved, though.",
                  "author": "spleedge",
                  "created": 1614400616,
                  "upvotes": 5,
                  "replies": {
                    "goy3ncm": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy3ncm/",
                      "text": "First of all, I really understand where you’re coming from.  The whole situation is shitty. And like you I’m taking the OP at their word that they weren’t involved in the plagiarism.  But if I were the professor, it wouldn’t be so straightforward.  Students pull all sorts of crazy shenanigans.  Assuming you as professor accept OP’s total innocence regardless of syllabus language, how do you assign credit?  Do you give full credit for a portion of the work that was explicitly designed as a collaborative project?? We don’t know what the intended learning outcomes were here, the details of the assignment, what portion the OP fulfilled and did not fulfill, etc.  So, not knowing the details except that it is a shitty situation, I don’t know that just giving OP full credit for their work is necessarily the right or the most just answer, despite the way it is presented here\n\nETA:  there is no indication that the professor is pursuing an academic integrity action in this case, though it would not be inappropriate in this situation",
                      "author": "Judythe8",
                      "created": 1614401958,
                      "upvotes": 1,
                      "replies": {
                        "goy9dei": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy9dei/",
                          "text": "I made some assumptions simply because you asked how I’d handle it, when in reality of course there would be some complicating factors. I made sure to highlight that I’d have to be sure of their innocence, not just take them at their word. Also, for a solution to your issue with the grades I had suggested that the professor assign the part OP’s partner plagiarized to OP. They would then complete this and submit it as a whole, finished project. Yes they’d have to do some more work, but they could receive a whole grade. \n\nFinally, giving a student a 0 as punishment at my school is not generally something a professor can do unless the student admits to an academic integrity violation. Anything in dispute goes to judicial affairs to be reviewed and they award the punishment. So assigning a 0 essentially is equal to pursuing an academic integrity case, at least for me. It’s another assumption, but it’s one I did make.",
                          "author": "spleedge",
                          "created": 1614404227,
                          "upvotes": 1,
                          "replies": {
                            "goybrm8": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goybrm8/",
                              "text": "Okay, that's fine.  How do you make \"sure of their innocence\" in an age of rampant plagiarism? \nOnce you have somehow determined that the OP was not involved, you assign OP the remainder of the project?  How do you then evaluate the work, produced by a single student, using a rubric designed a group assignment? When other students inevitably hear of it, who are displeased with their group assignments, what is your response to the inevitable emails demanding individualized assignments/grading? \n\nI can assure you that giving a student a 0 as punishment is absolutely something professors do all the time because we don't want to deal with the bullshit of having to substantiate the most obvious plagiarism cases by having to answer questions like \"but does your syllabus explicitly say that plagiarism isn't allowed?\" Also, while higher education is a Kafkaesque bureaucracy, it doesn't work in the way you describe.  A 0 in no way triggers some kind of academic integrity Rube Goldberg that automatically results in a disciplinary hearing.  We have to initiate them and, as I have already explained, we have to substantiate them in order to be taken seriously (unlike frivolous complaints by students against faculty, which is this sub's preferred kink).",
                              "author": "Judythe8",
                              "created": 1614406041,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gp0klrg": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0klrg/",
                  "text": "I don’t think I’ve seen someone ever say “oh, I’m definitely right” before. LOL",
                  "author": "Happens_2u",
                  "created": 1614438082,
                  "upvotes": 0,
                  "replies": {
                    "gp0pfs5": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0pfs5/",
                      "text": "It happens when you know what you’re talking about and aren’t in a persecution circle jerk reaffirming inane and uninformed  theories about how college works",
                      "author": "Judythe8",
                      "created": 1614439688,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gox4om7": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox4om7/",
          "text": "[removed]",
          "author": null,
          "created": 1614387307,
          "upvotes": -17,
          "replies": {
            "gp6cuhs": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp6cuhs/",
              "text": "Sorry, it appears your thread or comment is in violation of /r/college Rule #4: Don't be an asshole.  \n\nAnything threatening or harassing is immediately removed and often results in a ban. That includes slurs against oppressed or disadvantaged people of any stripe.  \n\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \n\n\n-----  \n\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \n\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
              "author": "VA_Network_Nerd",
              "created": 1614524170,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gowzmm5": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowzmm5/",
      "text": "Take the situation with the department head. Aka if the employee wont listen to your complaints, demand her boss. I figured this out much after college, but if something doesnt feel right, you need to speak with the person up top.\n\nDont think of yourself as just a student, YOU ARE A CLIENT. You pay the school to assess your knowledge, the school is not above you. They work side by side with you. You aren't even just a customer, you are basically their partner. Sometimes its easy to forget. Explain the unfair situation with the department head, send them an email or call them. \n\nIve complained about a professor's credibility due to their sloppy and factually incorrect lectures, which resulted in the department head coming in to assess them in class. Ive gotten wrong information from school office clerks and had to speak to the department heads personally to get right answers about programs. Ive gotten denied from my program application, and also spoke to a department head about how I only needed one class in it to complete, which resulted in them letting me in after a short appointment. \n\nI have even stupidly FORGOTTEN to drop classes for a masters degree program and didnt find out I was enrolled until the semester ended, resulting in me owing tuition, but I came in and spoke to the necessary party, explained my unfortunate situation and did the necessary paperwork to get an application approved for tuition costs being removed.\n\nUnless you are speaking to someone at the very top of the chain, you need to speak up more. If the professor wont listen, go to their boss, their department head, make yourself heard. Im telling you right now, reading through the list of comments here and I see alot of BS. Forget the professor, talk to their department head. \n\nAs I said before, its easy to forget, especially if you are out of highschool where you have no voice or power. But in college, there are alot higher expectations for schools to adhere to. Professors are unwise to think they decide whats fair. So ask the department head to mediate. Best of luck, be brave and speak up.\n\nEdit: seeing some of the replys so let me say this. If you think you deserve to take the L and not do anything, then thats fine, learn a lesson by dropping 2 letter grades. If you already learned the lesson, its time to pursue action and start remedying the situation instead of letting your education fall apart.",
      "author": "bltbaybee",
      "created": 1614385306,
      "upvotes": 79,
      "replies": {
        "gp11e49": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp11e49/",
          "text": "Echoing everyone, this is horrible horrible mentality. This is why people make fun of \"Karens\". \n\nSchools are non profit institutions for the most part. Non profit schools are not a business where you exchange money for services rendered. If that was the case, every student would demand to be entitled to 4.0 GPA and glowing letters of recommendation as they PAID for it. \n\nThere are formal complaint processes and policies at school to address professor deficiencies. Follow those, don't just write an email to the department head asking to see the manager.",
          "author": "thiskidlol",
          "created": 1614442226,
          "upvotes": 18,
          "replies": {}
        },
        "goynr11": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goynr11/",
          "text": " I know this will get down voted but no, students are not clients for the school. And no, you are not paying 20,000 for the professor. Actually look at the bill. Tuition is maybe half of the other costs on there. What is really in there to make it go up are the fees, dining, housing, etc. You are paying for the opportunity to learn and be taught by an expert. If you have legitimate concerns, and actual problem, not \"I overslept and I need an extension but they didn't grant me one\" or \"my other classes have a lot of work and I didn't have time to study\" then yes, going higher up is a solution.",
          "author": "macearoni",
          "created": 1614414973,
          "upvotes": 23,
          "replies": {
            "gp0e2zx": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0e2zx/",
              "text": "This whole thread sounds like karens.",
              "author": "KaiserPhilip",
              "created": 1614436485,
              "upvotes": 13,
              "replies": {}
            },
            "gp04oek": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp04oek/",
              "text": "You have just perfectly described a client, someone who is using (often paying for) the services of a professional. Okay so half of your tuition goes to room and board but that's still 10 grand you're paying for the teacher. For that you can at least expect them to treat you fairly.",
              "author": "Noxious_1000",
              "created": 1614434181,
              "upvotes": -4,
              "replies": {
                "gpmjnsl": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gpmjnsl/",
                  "text": "Lol... Do you know how much LMS, campus wifi, building maintenance, road maintenance, servers, general technology, electricity, water and everything else the school has to cover to cost is costs... Students only cover a small fraction of the cost of university. The government, grants and alumni cover the rest. You really don't understand the true costs a university faces.",
                  "author": "veanell",
                  "created": 1614838088,
                  "upvotes": 1,
                  "replies": {
                    "gpo2376": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gpo2376/",
                      "text": "Apologies, I live in the UK, where universities ABSOLUTELY rely on tuition fees.",
                      "author": "Noxious_1000",
                      "created": 1614875360,
                      "upvotes": 1,
                      "replies": {
                        "gppajcc": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gppajcc/",
                          "text": "Here in the US they most definitely don't. Students pay a small percentage of the overall costs but act like they can have any professor or university staff member fired the second we say no.",
                          "author": "veanell",
                          "created": 1614894129,
                          "upvotes": 1,
                          "replies": {
                            "gppj5bz": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gppj5bz/",
                              "text": "But they are still paying to be taught, that is the point. They may not be single handedly running the college but you pay to be taught by a professional, that is the entire point of university. I really don't think the % of campus costs paid by students should have anything to do with how they expect to be treated by professors.\n\nColleges advertise themselves to students as having the best teaching and resources. Its the whole point of students going to college.",
                              "author": "Noxious_1000",
                              "created": 1614898070,
                              "upvotes": 1,
                              "replies": {
                                "gps5pyv": {
                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gps5pyv/",
                                  "text": "I think it comes down to the fact that students don't respect professors, so why should professors. Professors choosing to be a harsh grader and stubborn regarding group work (I question any professor that is doing group work in the first place - much less in these times of online courses in the pandemic) still deserve respect. Students are the products of higher ed not degrees.",
                                  "author": "veanell",
                                  "created": 1614958297,
                                  "upvotes": 1,
                                  "replies": {
                                    "gptxoaw": {
                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gptxoaw/",
                                      "text": "We are talking specifically about this example. Where the professor is clearly at fault.",
                                      "author": "Noxious_1000",
                                      "created": 1614987693,
                                      "upvotes": 1,
                                      "replies": {
                                        "gq1ketx": {
                                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gq1ketx/",
                                          "text": "Except this is underneath another remark...",
                                          "author": "veanell",
                                          "created": 1615075090,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "goxgpt4": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxgpt4/",
          "text": "One thing you’re forgetting here is that this project was clearly plagiarized from Wikipedia - the head of the department won’t have much sympathy if the students didn’t do their own work.\n\nNow, if the student can prove that only their partner cheated, and that their part of the project was done correctly, then the professor might have sympathy. But you are better off talking straight to the professor in this situation.",
          "author": "dan-55",
          "created": 1614393925,
          "upvotes": 40,
          "replies": {}
        },
        "goxxuif": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxxuif/",
          "text": "I’m going to be downvoted to oblivion, but this is nonsense. You are looking at your education as  business model, and I don’t blame you because this is what higher education is advertised as today (using the language of business).\n\nUnfortunately, when you “buy in” to this model, you are treating education as a product. *The learning transactions and the knowledge being produced by the student is the product*. \n\nIn fact, *the student is the product* of the school.\n\nIn traditional conceptions of organizations, the teachers are the inputs, the students are the outputs, and the learning that happens is the transformative properties.\n\nIt seems that in the OP’s situation, the learning that needed to happen was to budget time to look over everyone’s contribution to the project and not just the material being taught.\n\nTo go over the professor’s head simply to demand a grade is to say *you know better than the professor.* I suppose you know what’s best for your career trajectory than the professor does, sure—we all want to get by on our own ideal vision of the world—but life doesn’t work that way. And when you treat school as some sort of model you can force yourself into and shoe-horn your ideal situation as manifest... well, you are doing yourself a disservice.\n\nSometimes it takes a failing grade to realize where the learning actually needs to take place.\n\nDownvote me to oblivion. I don’t care. I had to speak to this, because this is the problem with higher education today.",
          "author": "biglybiglytremendous",
          "created": 1614399637,
          "upvotes": 41,
          "replies": {
            "goyrsb9": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyrsb9/",
              "text": "I agree with you. Well said.",
              "author": null,
              "created": 1614417689,
              "upvotes": 12,
              "replies": {}
            },
            "goy14mk": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy14mk/",
              "text": "Sorry, but I disagree. I don't pay $20000 for my professors to half-assedly give me a zero when I'm dealing with a family emergency and I don't go over my partner's work with a fine-tooth comb to see if they plagiarized. The student who plagiarized should be punished, and I think OP deserves more than being written off and possibly academically marred for someone else's laziness. \n\nTo go over the professor's head is to say the professor is being unfair, which is within OP's boundaries to do as a student. A failing grade can mean a lost scholarship, tuition, housing, grants, internships. It's a lot more than just a humbling moment.",
              "author": "SuperpositionCell",
              "created": 1614400888,
              "upvotes": 3,
              "replies": {
                "gozqf12": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gozqf12/",
                  "text": "> I don't pay $20000 for my professors to half-assedly give me a zero when I'm dealing with a family emergency\n\nUnfortunately, you did. You just didn't understand that's what you were paying for at the time. You may like to have paid for something else, but that's not what the school was offering.",
                  "author": "bl1y",
                  "created": 1614430803,
                  "upvotes": 12,
                  "replies": {}
                },
                "goy51cc": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy51cc/",
                  "text": "OP said they were in the hospital the day of the submission. This means they didn’t budget time appropriately to ensure all parts of the assignment were complete to satisfaction on all group member’s sides. If I were looking to earn a passing grade, I would ensure my group members met all criteria before the day something was due.\n\nFurther, the time to take umbrage with group work/group grading practices is *before* the assignment is due, not after. If you enter into the assignment with the understanding all group members are going to be graded in X, Y, or Z way, and you don’t approach your professor then, you’re clearly okay with the way you’re being graded. If you only find it an issue after you score less than you wanted to, then you clearly only cared when it worked to benefit you by dividing labor.\n\nRegardless, a family emergency isn’t a free pass. For some professors it is, but not for all. When you wait until the last minute—the day of the deadline—to submit work, you are putting yourself in a precarious situation and at the mercy of all the *fucked up shit* life throws at you at the most inopportune times. \n\nI agree that this sucks. I really do sympathize with OP. And I probably would revisit the group project and see what actually happened. But this isn’t about any of that. This is about how I fully disagree with the author of the reply to whom I replied.",
                  "author": "biglybiglytremendous",
                  "created": 1614402499,
                  "upvotes": 14,
                  "replies": {
                    "goyffqa": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyffqa/",
                      "text": "I read another of OP's comments stating the reason why they submitted at last minute was that their partner turned in their part only a few hours before the due date.",
                      "author": "nnonelol",
                      "created": 1614408666,
                      "upvotes": 4,
                      "replies": {}
                    },
                    "gozkxi7": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gozkxi7/",
                      "text": "You can’t control when your partner finishes their portion. You can be on them to do it but if the partner is a procrastinator there’s really nothing OPcan do.",
                      "author": "sanguinesecretary",
                      "created": 1614429528,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "goy72a3": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy72a3/",
              "text": "Wrong.\n\nUnless you are getting a STEM degree, almost nothing you are taught in college is applicable to your work life after college unless you continue in academia. It's its own weird little world and has almost nothing to do with the way the rest of the world works.\n\nThe purpose of college is to get a piece of paper that is a validation check you have the ability to perform at some level of competency to employers looking to hire you, and it is only the baseline for the most part. It's just a checkbox that HR needs to fill to get you in the room to be able to interview. \n\nAll of this bullshit justification mental pretzel you are trying to tie yourself into is just doing yourself a disservice. Fuck that guy who is going to bring your grade down with his stupid bullshit. Throw his ass under the bus and ABSOLUTELY go over the professor's head to get justice from the department head if they are willing to listen.\n\nCollege is like 90% bullshit, but so is a lot of other shit in life. Learn how the system works and how to make the system work for you. If you come out of college understanding how to do that, you're ahead of like 98% of other kids coming out of there.",
              "author": "90DollarStaffMeal",
              "created": 1614403198,
              "upvotes": -11,
              "replies": {
                "goy8132": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy8132/",
                  "text": "So what’s going to happen “in the real world” when one of your colleagues rips off something last minute to save their ass and hope nobody notices—and then it bites everyone in the ass because now the organization has an intellectual property lawsuit on their hands? Certainly the person who did the ripping off with be fired, but most likely everyone else on the team who failed to notice will also be at fault and likely fired as well.",
                  "author": "biglybiglytremendous",
                  "created": 1614403542,
                  "upvotes": 18,
                  "replies": {}
                }
              }
            }
          }
        },
        "gp0qrrl": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0qrrl/",
          "text": "This is terrible, terrible advice that I hope OP is ignoring. If you're planning on continuing at school wherever you are, do not do this.",
          "author": "EggDogCat",
          "created": 1614440004,
          "upvotes": 7,
          "replies": {
            "gp8wseo": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp8wseo/",
              "text": "If you want to be passive and take a huge permanent loss in order to learn a lesson, go ahead.",
              "author": "bltbaybee",
              "created": 1614558207,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "gox8oku": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox8oku/",
          "text": "This is the only thing he need to read. Great reply you’re so right they’re not “above him” sounds like he/she just had a nasty teacher. I’m just like you I’m gonna go all the way to the top until it’s figured out. They may not get the zero taken off but at least he/she will know where the school stands",
          "author": null,
          "created": 1614389535,
          "upvotes": 3,
          "replies": {}
        },
        "goxo8uw": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxo8uw/",
          "text": "[removed]",
          "author": null,
          "created": 1614396495,
          "upvotes": 1,
          "replies": {}
        },
        "gpmkbpw": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gpmkbpw/",
          "text": "[deleted]",
          "author": null,
          "created": 1614838592,
          "upvotes": 0,
          "replies": {
            "gpowoum": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gpowoum/",
              "text": "as someone who pays for higher education, i prefer not to be evaluated by my partner's mistakes",
              "author": "bltbaybee",
              "created": 1614888236,
              "upvotes": 1,
              "replies": {
                "gpp9iz1": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gpp9iz1/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1614893688,
                  "upvotes": 1,
                  "replies": {
                    "gqiq20f": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gqiq20f/",
                      "text": "Ya i know, your response is to my comment bro o_o",
                      "author": "bltbaybee",
                      "created": 1615427115,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gowttyx": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowttyx/",
      "text": "Escalate it to an advisor and ask them what to do. Gather documentation from your uncle about the hospital visit as it will help your case. Keep escalating it one position up until you find someone that will help you. Request an oral exam on the essay content that you wrote to show that you did it. Offer to take a 25% penalty instead of a 0. If that fails, start a change.org position at the college to give them bad PR for not handling the case fairly using philosophical principles of utilitarianism.",
      "author": null,
      "created": 1614383422,
      "upvotes": 154,
      "replies": {
        "gp0rlat": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0rlat/",
          "text": "This is also terrible advice. Lots of terrible advice in this thread. Some of the things being recommended have the chance (being serious) to ruin your academic career, depending on where you are.",
          "author": "EggDogCat",
          "created": 1614440191,
          "upvotes": 8,
          "replies": {}
        },
        "gox0rba": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox0rba/",
          "text": "100% agree",
          "author": "bltbaybee",
          "created": 1614385709,
          "upvotes": 28,
          "replies": {}
        },
        "goxatow": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxatow/",
          "text": "It’s not a negotiation. You don’t have anything they want or any leverage to negotiate with. Why would they give you 25% instead of a 0? How is that an “offer”? Also why would the professor take time out of their day to make up an alternate assignment for you?",
          "author": "Blackberries11",
          "created": 1614390743,
          "upvotes": 30,
          "replies": {
            "goxgki9": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxgki9/",
              "text": "By \"offer to take a 25% penalty\", I think he meant that he would get 75% (for not checking the partner's work) instead of 0.",
              "author": "existentialepicure",
              "created": 1614393863,
              "upvotes": 27,
              "replies": {}
            },
            "goxev4l": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxev4l/",
              "text": "I meant 75% credit. They are a service institution and some of them actually do want to help students. If they want to help students, as a position such as a department chair, they will. This is especially true if OP is at a community college. The difference here is that the student had a reason and they were not the one doing it.",
              "author": null,
              "created": 1614393052,
              "upvotes": 21,
              "replies": {
                "goxfu2n": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxfu2n/",
                  "text": "They help students by enforcing the academic integrity policy. If they don’t enforce that the program and the degree will eventually become meaningless.  My advice as a professor to avoid this situation: if your partner isn’t doing their share of the work and communicating with you, you need to talk with your professor about that so that they can help you before it’s the last minute. What you should not do is turn in something you haven’t even read before. As with most things in life, being proactive is the key to dealing with these kinds of problems.",
                  "author": "Blackberries11",
                  "created": 1614393532,
                  "upvotes": 8,
                  "replies": {
                    "goykjn2": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goykjn2/",
                      "text": "Why assign group work in the first place though? These issues have a near certainty of popping up, so why risk putting anyone in a sticky situation caused by a groupmate’s academic failings?",
                      "author": "MC_chrome",
                      "created": 1614412820,
                      "upvotes": 10,
                      "replies": {
                        "gp08prt": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp08prt/",
                          "text": "Because a large proportion of real work is done in teams, so students need to get used to collaborating. Part of that includes learning to address issues in the team upfront rather than ending up with a poor quality project.",
                          "author": null,
                          "created": 1614435100,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    },
                    "goyrzfa": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyrzfa/",
                      "text": "What if you read it, ran it through multiple plagiarism checking softwares that returned showing that it was not plagiarized, but it still was. How much due diligence is enough?",
                      "author": "cereal-kills-me",
                      "created": 1614417885,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gp0ygx3": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0ygx3/",
              "text": "Because this is a stupid situation OP has been put in, and honestly the professor is being difficult for no reason.",
              "author": "stillslightlyfrozen",
              "created": 1614441622,
              "upvotes": 0,
              "replies": {}
            },
            "goykmtm": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goykmtm/",
              "text": "Cause that's the dumbfuck professors job.",
              "author": "TheTrueQuarian",
              "created": 1614412906,
              "upvotes": -2,
              "replies": {
                "gp1ii4a": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1ii4a/",
                  "text": "And the \"dumbfuck professor\" did her job and ran it through a plagiarism check and failed everyone in the group as is required by academic integrity policies.",
                  "author": "BigGing91",
                  "created": 1614446866,
                  "upvotes": 4,
                  "replies": {
                    "gp1lnkh": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1lnkh/",
                      "text": " \"academic integrity policies\" don't require that you fail students that didn't plagiarize.",
                      "author": "TheTrueQuarian",
                      "created": 1614448042,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gowebsk": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowebsk/",
      "text": "That sucks but its up to you to check also. I run any writing in a group project through a plagiarism checker from grammarly. You should not be punished for cheating you did not do. I understand her POV if it was up to you and your partner you agreed to give them that task and they failed to do so.",
      "author": "Kirkthewebsurfer",
      "created": 1614378485,
      "upvotes": 16,
      "replies": {
        "gox7ou3": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox7ou3/",
          "text": "Do you have the paid version of grammarly? Do you think it’s worth it?",
          "author": "Fuckcody",
          "created": 1614388985,
          "upvotes": 3,
          "replies": {
            "goxykwl": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxykwl/",
              "text": "No it’s not worth it they charged me 139$ but I just decided to keep it. There are plenty of free ones on google that get the job done. I use grammars often and felt it was worth it.",
              "author": "Kirkthewebsurfer",
              "created": 1614399875,
              "upvotes": 2,
              "replies": {}
            },
            "gox8yew": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox8yew/",
              "text": "I have the paid version and I think it’s completely worth it. I got it subsided through my school tho. Not sure what the real price is",
              "author": "Caitmaree",
              "created": 1614389690,
              "upvotes": 2,
              "replies": {}
            },
            "goxb4pw": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxb4pw/",
              "text": "Um do you realize you can accomplish the same thing with google? The copied sections were literally from Wikipedia.",
              "author": "Blackberries11",
              "created": 1614390918,
              "upvotes": -7,
              "replies": {
                "goxbcz7": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxbcz7/",
                  "text": "Yeah you can simmer down bout 10% there bud, I just wanted this person’s opinion on if grammarly is worth it as a paid service. Have a good day 😅",
                  "author": "Fuckcody",
                  "created": 1614391050,
                  "upvotes": 8,
                  "replies": {
                    "goxgbnu": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxgbnu/",
                      "text": "If you want to pay for something that does the same thing as google help yourself",
                      "author": "Blackberries11",
                      "created": 1614393761,
                      "upvotes": -6,
                      "replies": {
                        "goxhu9f": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxhu9f/",
                          "text": "If you want to make assumptions, help yourself and keep being an ass. Remember you don’t know everyone’s situations nor the reasoning I’d ask this question. Take a smoke break bro",
                          "author": "Fuckcody",
                          "created": 1614394351,
                          "upvotes": 4,
                          "replies": {}
                        },
                        "goxvlsi": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxvlsi/",
                          "text": "The paid version of Grammarly doesn't just give you a plagiarism checker you moron, it gives you other things that you can't easily access with Google",
                          "author": "Hyperzoom",
                          "created": 1614398883,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gowdkdn": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowdkdn/",
      "text": "If what you’re saying is true, that only your partner used Wikipedia, then you should schedule a meeting with your professor to explain the situation. You might be able to increase your grade a bit.",
      "author": "dan-55",
      "created": 1614378249,
      "upvotes": 304,
      "replies": {
        "gowdx2w": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowdx2w/",
          "text": "I talked to her and she is saying that she doesn’t care. The killer part? My uncle was hospitalized on the day that the assignment was due and i just submitted what i had because my colleague didn’t bother submitting it himself.",
          "author": "omani805",
          "created": 1614378364,
          "upvotes": 254,
          "replies": {
            "gowfc5f": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowfc5f/",
              "text": "My apologies if I’m not understanding you correctly, but it seems to me from this comment that you are the one who used Wikipedia? If that is the case, then you will not be able to change your grade. Also, the professor won’t care about your uncle because he was hospitalized on the due date of the project - you could have easily completed the project before that day.",
              "author": "dan-55",
              "created": 1614378811,
              "upvotes": 55,
              "replies": {
                "gowfs7k": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gowfs7k/",
                  "text": "My colleague did this entire part, i did other stuff. He copied from Wikipedia. He didnt submit the project and waited for me to submit it the next day ( i was with my unlce) . He only gave me the project a few hours before the due date, so the next day meant that it was late",
                  "author": "omani805",
                  "created": 1614378944,
                  "upvotes": 139,
                  "replies": {
                    "gox7cuk": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox7cuk/",
                      "text": "So on the day that you turned it in, you had access to both your partner's work and your own after he gave you his part, and then you turned in all of the work for both of you? If that is the case then I think the professor can still see you as being at fault. If you had access to his work before you turned it in then you should have checked it to make sure everything fit together and was up to snuff. A simple check would have shown that he used Wikipedia. Your professor also saw this as a group project where you both were supposed to actually work together, and not just divide up the work to do individually.",
                      "author": "BigGing91",
                      "created": 1614388795,
                      "upvotes": 30,
                      "replies": {
                        "goxdfiy": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxdfiy/",
                          "text": "Hmmm but how would the OP know if the partner's plagiarized or not? even if OP could get the partner's work, OP can't go through all the websites and just compare them one by one right?",
                          "author": "lisagg9",
                          "created": 1614392239,
                          "upvotes": 101,
                          "replies": {
                            "goytjb3": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goytjb3/",
                              "text": "Is there a program that scans papers and figures out if they were plagiarized or not? I wonder if OP uses that program and proves that only his partners work was copied, that would make a difference",
                              "author": "taffypulller",
                              "created": 1614419520,
                              "upvotes": 2,
                              "replies": {
                                "goytmog": {
                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goytmog/",
                                  "text": "Agree",
                                  "author": "lisagg9",
                                  "created": 1614419620,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            },
                            "goy5yjm": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy5yjm/",
                              "text": "The professor figured out it was Wikipedia, so I'm assuming it wasn't that hard to find out.",
                              "author": "Sea_Prize_3464",
                              "created": 1614402818,
                              "upvotes": 0,
                              "replies": {
                                "goycc0v": {
                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goycc0v/",
                                  "text": "Assignments usually get run through software that highlights phrases that plagiarized or found in other places and shows the articles they're found in.",
                                  "author": "coastalsagebrush",
                                  "created": 1614406494,
                                  "upvotes": 47,
                                  "replies": {}
                                }
                              }
                            },
                            "gp1ivxw": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1ivxw/",
                              "text": "There is this free website called \"google\"",
                              "author": "Snoo_12140",
                              "created": 1614447017,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "goxf9mr": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxf9mr/",
                              "text": "You should assume everyone is cheating when your grade and academic integrity are at stake. If the work was as egregiously plagiarized as OP says then it is not hard to catch it. She probably just typed in the first sentence of his paper into google and watched the Wikipedia page popped up. I have seen it happen. I know no one wants to feel like somebody is being treated unfairly, but there is a certain level of personal responsibility you have to take for ALL parts of a group project. At this point, OP should stop worrying about the grade so much and perhaps thank their lucky stars they are not being brought up for an academic dishonesty violation; because the professor easily could have done it just to be a hardass.",
                              "author": "BigGing91",
                              "created": 1614393251,
                              "upvotes": -48,
                              "replies": {
                                "goxjrj6": {
                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxjrj6/",
                                  "text": "This is some really dumb logic. If you assume everyone is cheating then  everyone shouldn't be in groups.",
                                  "author": "Detective-E",
                                  "created": 1614395037,
                                  "upvotes": 52,
                                  "replies": {
                                    "gp0b959": {
                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0b959/",
                                      "text": "Do you wait at green lights for a second to make sure some idiot not paying attention or trying to make the light doesn't t-bone you? Do you check your order before you leave the drive-thru line in case they forgot something or got your order wrong? Every day you have to take a little responsibility for other people's actions to protect yourself. This is no different. The problem here is OP trusted that his partner was doing the work legitimately. When someone else's work affects you then you should absolutely take some responsibility and look twice. I don't know why this is such a hard concept to understand.",
                                      "author": "BigGing91",
                                      "created": 1614435825,
                                      "upvotes": 0,
                                      "replies": {}
                                    }
                                  }
                                },
                                "goxpxic": {
                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxpxic/",
                                  "text": "If everyone’s cheating, why the fuck would you ever work in a group and not just do it entirely yourself?",
                                  "author": "Pocketpine",
                                  "created": 1614397040,
                                  "upvotes": 18,
                                  "replies": {
                                    "gp0bzd4": {
                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0bzd4/",
                                      "text": "Because in the real world when you have a job you will sometimes be asked to work as a collective to achieve a task. Usually, this is much simpler because there is a project manager to double-check on everyone, but in this case, it's just two students. They were both equally responsible for all parts of the project, so they both should have checked the others' work.",
                                      "author": "BigGing91",
                                      "created": 1614435989,
                                      "upvotes": -1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "goxq0co": {
                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxq0co/",
                                  "text": "Hmmm  I think the problem with your logic is that you are assuming OP knew the other partner plagiarized at first, and ofc if OP knew it everything would be much easier- If OP knew the partner borrowed certain materials from online, OP could easily type several sentences to check. The problem is(granted what OP said was true): which sentences should OP put on google to run the test when there're probably like hundreds of sentences? If some sentences were not borrowed from online and passed the test, could it be the rest of the sentences? how would OP know the work was even from online to start with, instead of from other sources?  If the OP insisted to continue, the ultimate solution seemed to be run an official plagiarism test as there are infinite combination of plagiarized words and sentences that could come from online and offline as well.\n\n&#x200B;\n\nNot that I'm saying one should leave the work and take no responsibility for the authenticity, but I do believe to make sure the to confirm no plagiarism beforehand was pretty much about a personal credit, and there's no way to check that unless once it's been revealed after. (I'm not sure if students have accesses to official plagiarism test tho. If so, OP could just run the test beforehand.)",
                                  "author": "lisagg9",
                                  "created": 1614397063,
                                  "upvotes": 2,
                                  "replies": {
                                    "gp0eil0": {
                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0eil0/",
                                      "text": "Grammarly has a plagiarism check and it is not that expensive. The only flawed logic around here is the people who do not realize that both students were equally responsible for all parts of the project regardless of how they divided the work because truthfully dividing up the work and being completely uninvolved in the other part of the project is not the point of group work. Also, it doesn't matter if OP knew whether or not his partner cheated. I am saying he should have assumed that from the get-go. On every group-project assume there is one knucklehead that is not pulling his weight or screwing up. You can be a baby and let the project fail because of it, or you can take responsibility for GROUP WORK, and figuratively be your brother's keeper on this one. The choice is yours, but I can tell you, in the real world refusing to take responsibility for collective work shortfalls will lead to you getting fired. No one wants someone who every time a group-project comes up, \"Hey, I'm just gonna do this part, and I don't want to give you all any input on any other parts of the project.\" The nature of our world, and business as a whole, is that stuff has to be done together a lot of times. You can't get around it, and deflecting blame for a group shortfall is childish.",
                                      "author": "BigGing91",
                                      "created": 1614436591,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "goxcq0j": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxcq0j/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1614391828,
                          "upvotes": 17,
                          "replies": {
                            "goxk729": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxk729/",
                              "text": "You would hope that you could trust your own partner not to plagiarize. I don't think it's on the student to have to check for cheating by their partner and I'd suggest OP still try to advocate further for themselves in this situation.",
                              "author": "max123246",
                              "created": 1614395184,
                              "upvotes": 39,
                              "replies": {
                                "goxmxj7": {
                                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxmxj7/",
                                  "text": "Right. Also how is a student supposed to check for plagiarism? Usually professors have access to better plagiarism checkers than students. And I've seen instances where students run work through a plagiarism checker, then it's entered into the database, and next time the professor runs it through the whole thing gets flagged for plagiarism.",
                                  "author": "soggybutter",
                                  "created": 1614396073,
                                  "upvotes": 27,
                                  "replies": {
                                    "goy94fp": {
                                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy94fp/",
                                      "text": "Annnnd now I’m freaking out because I recently submitted this paper where I thought of something that sounded really good. I ran it through some random checker to make sure I hadn’t just remembered this from something I’ve read before. Before this comment I was thinking, “ok, now I know I need to check all my group’s project papers for plagiarism”, because it didn’t occur to me before, but I guess I’m fucked either way aren’t I.",
                                      "author": "paranoidandrea",
                                      "created": 1614404044,
                                      "upvotes": 4,
                                      "replies": {
                                        "goyg7jz": {
                                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyg7jz/",
                                          "text": "You're probably totally fine!! Forreal. I also checked my papers frequently before I graduated. I teach high school now, I know I have kids that run their work through checkers. It was an instance that used an in house checker and I think it's something that has been resolved. Take a deep breath!\n\nI was just using it as an example as to why it's stupid to expect students to police one another for plagiarism. Students are expected to be responsible for their own work, and while double checking work is nice, it's not a realistic expectation.",
                                          "author": "soggybutter",
                                          "created": 1614409136,
                                          "upvotes": 3,
                                          "replies": {
                                            "goyi4ya": {
                                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyi4ya/",
                                              "text": "Oh thank you for pulling me off that ledge there. With things being online, my dept in particular worrying about their prestige, the professors are (rightfully) foaming at the mouth waiting to catch any cheaters. I got a little caught up just because I never realized this can happen, with either the group or the checkers, thinking of all the possibilities, just yikes.",
                                              "author": "paranoidandrea",
                                              "created": 1614410573,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gox74ib": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox74ib/",
                      "text": "See if you can fix it and resubmit",
                      "author": "userdk3",
                      "created": 1614388663,
                      "upvotes": -4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "goykvek": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goykvek/",
              "text": "Student union/Representatives like, right now. This is their job, to advocate for the students' interests in the university.",
              "author": "StarvinPig",
              "created": 1614413133,
              "upvotes": 2,
              "replies": {}
            },
            "gozj5u0": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gozj5u0/",
              "text": "maybe try taking it to someone higher up than the professor. this is really unfair",
              "author": "vainqueen",
              "created": 1614429011,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "gow9125": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gow9125/",
      "text": "The issue seems to be that you're both responsible for the entirety of the work. If your partner agreed to do a section of it, you're still responsible for the final product.\n\nPractically, what you should do is bust ass for the remainder of the semester.\n\nAnd then consider the lower grade a relatively cheap price to pay for a very important lesson: Everything that can negatively impact you is your responsibility. It's like when you're walking and go to cross the street at a crosswalk. You still look both ways. Doesn't matter if drivers are supposed to yield to you; what matters is not getting hit by an inattentive driver.",
      "author": "bl1y",
      "created": 1614376832,
      "upvotes": 34,
      "replies": {
        "goy4qmn": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy4qmn/",
          "text": "> And then consider the lower grade a relatively cheap price to pay for a very important lesson\n\nIf all OP got was a failing grade on this assignment, I would consider him lucky. I don't know about most college honor codes, but at my school (public state school) plagiarism usually results in a zero and a reference to the student academic integrity office. Depending on the extent of the plagiarism and the type of assignment you could be pretty screwed doing something like this. And yeah, professors I've taken have told stories of people being held responsible for plagiarism done by other group members.",
          "author": "throwaway13630923",
          "created": 1614402399,
          "upvotes": 7,
          "replies": {}
        },
        "gox9sta": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox9sta/",
          "text": "Wouldn't that be like blaming a pedestrian for getting hit by a drunk driver?",
          "author": "lanternriver",
          "created": 1614390167,
          "upvotes": 11,
          "replies": {
            "goxeumd": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxeumd/",
              "text": "No it isn't and I don't think that it was a very good analogy.\n\nIt's like if you're a manager (or a boss for a company) and your worker illegally uses proprietary code. Your company would get smacked down with the lawsuit.\n\nOr if I, a grad student, fake data to get a paper published. My supervisor would suffer from a bad reputation too. \n\nEverything you submit is subject to academic integrity checks. Consider this a lesson learned. You submitted it, so you're responsible for it.",
              "author": "academic96",
              "created": 1614393046,
              "upvotes": 14,
              "replies": {
                "goxvi77": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxvi77/",
                  "text": "Hm, I understand what you mean. I guess I am thinking more about whose fault it is than the repercussions",
                  "author": "lanternriver",
                  "created": 1614398853,
                  "upvotes": 0,
                  "replies": {
                    "goyarje": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goyarje/",
                      "text": "Sadly fault doesn’t really matter when it’s a group project. If one partner plagiarizing it counts as both plagiarizing. Honestly just getting an F, while not fun, is definitely better then getting reported as academic integrity violation and potentially getting expelled.",
                      "author": "Toastybutter2020",
                      "created": 1614405260,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "goxa7le": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxa7le/",
              "text": "Yeah, just because there were possible precautions doesn’t mean he’s responsible",
              "author": "socratespoole",
              "created": 1614390397,
              "upvotes": 8,
              "replies": {}
            },
            "goxg1sd": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxg1sd/",
              "text": "No, this is an incongruous arguement. The pedestrian and the drunk driver are separate entities. In that scenario, the pedestrian is responsible for their own actions and the driver theirs. The nature of a group project is that you and the other person are responsible for the collective work. You have been tied together and are not separate entities for the sake of the project; even if you choose to act individually.",
              "author": "BigGing91",
              "created": 1614393641,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "gow0kms": {
      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gow0kms/",
      "text": "Has you team member admitted to cheating? If you have proof that he was solely responsible for his part and there was no way you could’ve checked it the. You may have a leg to stand on. If you were to fight this, that you be your biggest obstacle explaining how you submitted the work without knowing that your partner cheated. Unless they come forward and say they did it all on their own. There’s nothing stopping anyone from assuming, yes your partner cheated but you knew and submitted anyway",
      "author": "smartwin02",
      "created": 1614374276,
      "upvotes": 738,
      "replies": {
        "gox7hen": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox7hen/",
          "text": "I have experienced something similar to what the author of the post related. In my situation, I can prove that my teammate did it by accessing Google Docs history. I can see who (which gmail account) wrote each paragraph. Maybe this info will help someone.",
          "author": "dzn_m",
          "created": 1614388867,
          "upvotes": 298,
          "replies": {
            "gox7ou8": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gox7ou8/",
              "text": "I’m pretty sure any software can do that now too. It’s a little harder with Microsoft Word but you can track changes. \n\n\nThis doesn’t negate the fact that OP could’ve known their partner cheated before submitting and chose not to do anything about it. Just because they can throw someone under the bus doesn’t mean they aren’t without fault",
              "author": "smartwin02",
              "created": 1614388985,
              "upvotes": 117,
              "replies": {
                "goxeqs9": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxeqs9/",
                  "text": "Imagine coming back from the hospital after a whole night there and realizing that your dumbass partner sent you the project at 4AM instead of submitting it himself. It is partly my fault for not it checking it carefully but can you say that you wouldn’t have opened the file, checked that there is readable text and submitted it and went to sleep?",
                  "author": "omani805",
                  "created": 1614392991,
                  "upvotes": 159,
                  "replies": {
                    "goxfepc": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxfepc/",
                      "text": "No I would do exactly what you did. I’m not saying you weren’t put in a crappy situation or that you weren’t given the short end of the stick and your partner did you dirty. But assuming you had more than 24 hours to submit the assignment, these are the concerns you’re up against. Which is why your professor isn’t budging.",
                      "author": "smartwin02",
                      "created": 1614393318,
                      "upvotes": 82,
                      "replies": {
                        "goxoht5": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxoht5/",
                          "text": "I have messages of me telling him to start the project from 2 weeks before the due date. A couple of days before the due date, he told me that he was going to start doing it. What more could i have done? ( I genuinely want to know, so i have good arguments when i talk to the prof/dean)",
                          "author": "omani805",
                          "created": 1614396581,
                          "upvotes": 61,
                          "replies": {
                            "goxsxqc": {
                              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxsxqc/",
                              "text": "Honestly hospital aside, there’s always the argument that you guys were supposed to be working on the assignment together so you should’ve been able to check and see your partner cheated or you guys were working together to cheat and you’re just throwing your partner under the bus. If you can prove those claims false, you have a leg to stand on",
                              "author": "smartwin02",
                              "created": 1614398007,
                              "upvotes": 36,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "goxa1py": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxa1py/",
                  "text": ">It’s a little harder with Microsoft Word but you can track changes. \n\nIn word you have to set it up beforehand, and it's possible to disable if you're an ass.  Properly versioning documents should be done with dedicated software like git.",
                  "author": "Treyzania",
                  "created": 1614390306,
                  "upvotes": 14,
                  "replies": {}
                }
              }
            },
            "gp0dwv7": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp0dwv7/",
              "text": "Yep, I do the same thing. I try to do all my group projects on google docs/slides. The history is a game changer, I hate group projects lol",
              "author": "artistj11",
              "created": 1614436444,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "goxh19r": {
          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxh19r/",
          "text": "You gave me an idea. I went to message him as if im surprised that the got a 0 and asked “ why did she give us a 0!!!” Lol i want to kill him",
          "author": "omani805",
          "created": 1614394056,
          "upvotes": 57,
          "replies": {
            "goy3n1t": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goy3n1t/",
              "text": "Text him back and tell him that the professor said it was because the project was copied off of wikipedia then ask him why he did that knowing that it was gonna affect you too. \n\nBe careful about mentioning any personal or embarrassing info about yourself in this convo because you may need to show it to the dean/professor if he happens to indirectly confess to cheating on the project.",
              "author": "toofeduptocare",
              "created": 1614401954,
              "upvotes": 17,
              "replies": {}
            },
            "goxhjiu": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxhjiu/",
              "text": "Oh yeah if classes are in person, I would suggest getting a few hits in since your grade dropped so low. \n\nBut I’d be surprised your friend isn’t fighting too and throwing you under the bus. Like if he’s shady enough to do what he did, it would be no surprise if he tries to act like were the one who plagiarized which could be another reason why your teacher won’t budge. You guys could essentially be throwing each other the bus and your prof doesn’t know who to believe",
              "author": "smartwin02",
              "created": 1614394241,
              "upvotes": 26,
              "replies": {
                "goxkv66": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxkv66/",
                  "text": "https://ibb.co/TLJj8T9 \n\nis this any help? Her last arabic message she says “ i wrote the sources, what does she want more” but i dont know if they would believe me. \n \nMy last messages were “it doesn’t matter that you cited your sources if you copied them”",
                  "author": "omani805",
                  "created": 1614395419,
                  "upvotes": 28,
                  "replies": {
                    "goxlg2b": {
                      "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxlg2b/",
                      "text": "If that’s the case and your partner truly doesn’t know what plagiarizing is then you can maybe use that to your advantage. But your partner would still need to be the one to come clean and confess they don’t know what plagerisim is and if there’s anyway this can just be a teachable moment that doesn’t affect your grade. I doubt it will work to be honest but that’s all I got",
                      "author": "smartwin02",
                      "created": 1614395589,
                      "upvotes": 36,
                      "replies": {
                        "gp49dst": {
                          "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp49dst/",
                          "text": "This is why the first offense is usually a 0 and not academic suspension. It’s a shitty situation but much easier to deal with than a trip to the Dean.",
                          "author": "Contntlbreakfst",
                          "created": 1614484351,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gp1gfzm": {
              "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1gfzm/",
              "text": "ask him why we got a 0 and then send the pic of the text to the prof",
              "author": "deathworld123",
              "created": 1614446117,
              "upvotes": 3,
              "replies": {
                "gp1gmss": {
                  "link": "/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/gp1gmss/",
                  "text": "https://www.reddit.com/r/college/comments/lt7kxd/i_got_a_0_in_a_midterm_group_project_because_the/goxkv66/",
                  "author": "omani805",
                  "created": 1614446181,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634051797
}