{
  "sid": "qxhkkw",
  "link": "/r/college/comments/qxhkkw/i_hope_someone_reads_this/",
  "title:": "I hope someone reads this",
  "text": "I have a 2.6-2.7 weighted gpa in senior year of my high school and I live in Texas. I transferred from one high school to another and my grade level went from 90s to 70s and 78s and a few B’s spread around my freshman-sophomore year, they only got half of my freshman year on the transcript as they won’t add the first part of my transcript when i was in Oklahoma from the other school for some reason and overall it makes my grades look very bad and my gpa worse, i went from averaging literal 70s and at best low 80s through freshman and sophomore year to straight As and high Bs junior year and now doing even better more As than Bs this year than junior year and my gpa is still a 2.6 i’m scared as i want to get into a good school after high school and feel this is impossible at this point",
  "author": "777Vibe",
  "created": 1637332758,
  "updated": 1637353747,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hl9csvc": {
      "link": "/r/college/comments/qxhkkw/i_hope_someone_reads_this/hl9csvc/",
      "text": "I wouldnt be too worried about it. Just get the best gpa you can. Schools just want your money 🤷",
      "author": "Danger541",
      "created": 1637333126,
      "upvotes": 1,
      "replies": {}
    },
    "hl9jrrz": {
      "link": "/r/college/comments/qxhkkw/i_hope_someone_reads_this/hl9jrrz/",
      "text": "Non-selective schools provide great educations to motivated, engaged students. Ask yourself why getting into a \"good school\" matters—most of the reasons people give to that question don't matter.",
      "author": "trunkNotNose",
      "created": 1637336117,
      "upvotes": 1,
      "replies": {}
    },
    "hl9kvx4": {
      "link": "/r/college/comments/qxhkkw/i_hope_someone_reads_this/hl9kvx4/",
      "text": "Worst thing that happens is you spend freshman year at different school, as long as you do well you’ll be able to transfer",
      "author": "ba-len-ci-10",
      "created": 1637336576,
      "upvotes": 1,
      "replies": {}
    }
  }
}