{
  "sid": "pqsotq",
  "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/",
  "title:": "Scared of accidental plagerism",
  "text": "Im scared of accidently plagerising and its effects. I dont want my future to be ruined because i didnt cite something. Because of this i feel the urge to put a citation on every sentence I write. I dont know what ideas are mine and what are ones ive found anymore. This all stresses me out and i feel like the higher ups at my college would be cold and not show mercy on me if i mess this up or belive it was an accident. This has me scared to write and idk what to do. I dont want to be kicked out of college and branded a cheater to other colleges.",
  "author": "321ECRAB123",
  "created": 1631992899,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "hdfj9w6": {
      "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hdfj9w6/",
      "text": "Literally the only class that has ever made it seem like I'd be thrown in a dungeon and branded a cheater forever for even using 'the' in the same place in a sentence as my source was my freshman English class. As a senior taking 400 courses taught by Ph.Ds, every one of them has advised, \"Don't blatantly copy someone's research and please at least attempt to cite in some way so I know who you are referencing.\"",
      "author": "Mammoth-Title-2102",
      "created": 1632030786,
      "upvotes": 1,
      "replies": {
        "hdfk0x8": {
          "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hdfk0x8/",
          "text": "If you need a Plan B, do some reading on Zeitgeist. Basically it's a sociological theory that no idea is an original one, therefore we are all plagiarizing everyone else without even knowing it. So you could technically argue under Zeitgeist that you didn't know your idea wasn't original, or that you didn't want to cite your source and give him/her credit because their idea wasn't original, either! Worth a shot. I'd make a case out of it.",
          "author": "Mammoth-Title-2102",
          "created": 1632031317,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdexghg": {
      "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hdexghg/",
      "text": "Don’t worry it’s not that big of a deal. Check your citations carefully but mistakes do happen. They are not gonna nail you if you cited something incorrectly.",
      "author": "VoiceofReason541",
      "created": 1632019070,
      "upvotes": 1,
      "replies": {}
    },
    "hdekj57": {
      "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hdekj57/",
      "text": "So I just wanted to comment as a TA who has recently been grading a bunch of papers from a 200 level class that had nearly none cited correctly. As in tons of people didn't cite anything and most are not citing enough. Now since this paper only was using sources from class readings and not outside research, I'm just taking off some points and not failing or turning anyone in for plagiarism. For the people that missed a citation here or there, I just reminded them that they needed to cite everything and took off like a single point since this is a lot of students' first college paper. \n\nWhile I can't speak for all of your professors, as long as I see people are trying to cite, I'm never going to turn them in for plagiarism. If its really bad but I can tell they tried and just don't know what they are doing they will loose some points and I might ask them to come see me in office hours or go to the writing center for help with citing. Its generally better to over cite than under cite if you aren't sure. I will say in some of my research papers nearly every sentence does have multiple citations in certain sections. \n\nEssentially, very few professors want to deal with major accusations of plagiarism unless it is very intentional (i.e. copying and passing it off as your own work). We don't expect students to understand perfectly how to cite starting out. Basically, what I am saying is don't stress about this. If you are still worried try your writing center or set up a meeting with the professor or TA.",
      "author": "archaeob",
      "created": 1632013411,
      "upvotes": 2,
      "replies": {}
    },
    "hddwsbh": {
      "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hddwsbh/",
      "text": "Don’t worry about it. Usually a paper can be like 25% plagiarized before a prof says anything. Just cite to the best of your ability and you’ll be fine.",
      "author": "Agua_Fresca_Cuh",
      "created": 1632002961,
      "upvotes": 1,
      "replies": {}
    },
    "hddsprx": {
      "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hddsprx/",
      "text": "The people who get into serious trouble over plagiarism are the people who know 100% that they are plagiarizing and are purposely. You will NOT get written up, or kicked out because you cited something incorrectly. At most you will get points knocked off of your essay and a note saying \"you need to cite this\"",
      "author": "im_not_really_batman",
      "created": 1632001261,
      "upvotes": 4,
      "replies": {}
    },
    "hdd9szj": {
      "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hdd9szj/",
      "text": "when you are directly citing someone else’s words, always use parentheses when citing the direct quote. if you’re paraphrasing someone else’s words and ideas, always make sure to cite the original author. \n\nif you’re paraphrasing someone else’s ideas in one single paragraph, you can put the citation after the period. for instance:\n\nwriting papers can be incredibly daunting because of the fear of accidental plagiarism. plagiarism, whether it be intentional or not, could have immense academic consequences on the student. this can lead to a student facing disciplinary action or being kicked out of their institution and being branded a cheater. (OP, 2021)\n\nif you’re directly citing someone else’s words or ideas in a single parent, you put the citation before the period:\n\ni think writing papers are daunting because of the possibility if “accidentally plagerising and it’s effects. I don’t want my future to be ruined because I didn’t cite something” (OP, 2021).\n\nhope that helps",
      "author": "stressinglucy",
      "created": 1631993534,
      "upvotes": 3,
      "replies": {}
    },
    "hdd9d7z": {
      "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hdd9d7z/",
      "text": "You’re stressing too much over it. Cite the things you think you should cite, and don’t the things that you think don’t warrant it. \n\nIt’s kinda like using commas, people will overuse them and have to train themselves to only use them when necessary. \n\nIntrusctors have a good eye for what might be plagiarism, and you not citing a general statement isn’t it.",
      "author": "Cult_of_Sly",
      "created": 1631993351,
      "upvotes": 10,
      "replies": {}
    },
    "hdd95ik": {
      "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hdd95ik/",
      "text": "[deleted]",
      "author": null,
      "created": 1631993263,
      "upvotes": 0,
      "replies": {
        "hddbhst": {
          "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hddbhst/",
          "text": "You absolutely can plagiarize ideas.  If you read the idea somewhere else, you must cite.",
          "author": "FamousCow",
          "created": 1631994230,
          "upvotes": 3,
          "replies": {}
        },
        "hdd9g1s": {
          "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hdd9g1s/",
          "text": "Ok but how do i know when to cite and when not to cite a sentence? I know i shouldnt be citing every sentence cause then i is not my even my paper.",
          "author": "321ECRAB123",
          "created": 1631993384,
          "upvotes": 1,
          "replies": {
            "hdd9rv9": {
              "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hdd9rv9/",
              "text": "It depends on the citation style. Purdue Owl Writing Lab has an entire amazing website on the entire process of citing sources: why you need it, when to do it, and how.",
              "author": "HorrorDisk8",
              "created": 1631993522,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hdde3a3": {
          "link": "/r/college/comments/pqsotq/scared_of_accidental_plagerism/hdde3a3/",
          "text": "Plagiarism is not always word for word. Read this: https://app.enago.com/homepage/i/12566/fraud-research-many-types-plagiarism",
          "author": "j0hnamp0ng",
          "created": 1631995309,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634050581
}