{
  "sid": "r0m2r4",
  "link": "/r/college/comments/r0m2r4/i_cant_make_friends_is_something_wrong_with_me/",
  "title:": "I can't make friends- is something wrong with me?",
  "text": "This past semester has been really difficult for a variety of reasons, but one of the hardest things I've had to face this year is the fact that I don't have friends on campus. Don't get me wrong, I am a fairly active student. I'm involved with clubs, attempted rushing a sorority (big mistake), and I always try to talk to people in my classes. I do my absolute best to put myself \"out there\" and yet I just can't seem to get out of the \"acquaintance\" phase with anyone. \n\nI've had a few people in my classes this past semester that I thought I was clicking really well with. My issue, however, as it has been my entire life, is that nobody wants to hang out with me. I'm convinced of this. Every time I suggest \"Hey! Let's get lunch!\" or invite people over or out, every single time, without fail, it falls through. If 1 person cannot make it, then the rest of the group inevitably drops.  I'm never invited anywhere... but I so desperately want friends. Genuine friends.\n\nWhere do I find friends who actually want to spend quality time together? Why does it seem like everyone has loads of friends and yet I'm always home alone on the weekend? Why are the only people who ever reach out to me just asking for a favor? Or maybe more importantly, what's wrong with me?\n\nI will admit, I'm socially awkward; I have pretty moderate social anxiety and have always struggled to make friends. I've tried CBT therapy to cope with this for around 2 years with little progress. I've just felt so isolated recently that it's starting to make me feel like there's something wrong with me.\n\nTLDR; socially awkward college student becoming more depressed bc I can't make any friends",
  "author": "london_brigid",
  "created": 1637698365,
  "updated": 1638207394,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hlte8oa": {
      "link": "/r/college/comments/r0m2r4/i_cant_make_friends_is_something_wrong_with_me/hlte8oa/",
      "text": "We tend to see what we want. Trust me, there's a lot of people just like you. I'd caution you against attributing this to yourself though. We're all people at the end of the day, and I remember from my time in college I wasn't really interested in getting beyond the acquaintance stage with anyone, despite not really having any friends. If there were more people who were keen on just studying together, I'd probably have been down, but most just seemed interested in things I considered to be distractions. \n\nPart of the reason I didn't want to get past the acquaintance stage was I very quickly realized how many people wanted to just use me to bump their grade. So to me, the choice seemed binary: \n\nOption 1: spend a lot of time hanging out with people, going to parties, etc, and having my grades suffer as a result. \n\nOption 2: focus on school and try and get all my classes done while also pursuing a job in my field\n\nI chose option 2 and got hired out of my first year of college. I'm assuming that most people pick from these two options, and it's hard to strike a balance.",
      "author": "VerifiedMadgod",
      "created": 1637701316,
      "upvotes": 1,
      "replies": {
        "hltffy4": {
          "link": "/r/college/comments/r0m2r4/i_cant_make_friends_is_something_wrong_with_me/hltffy4/",
          "text": "First, thank you for your response- that was really insightful, and yeah, it makes sense. Not everyone comes to college looking for friends. I guess I just wish it didn't have to be those two options. Thankfully, I can say that my grades have been fantastic throughout college and I will likely graduate with the option to complete my master's degree in 1 year... But it's been a lot of work. And the truth is, I wish I had someone to go to a college party with on weekends. I'm finishing my third year and I don't feel like I've had a very emotionally fulfilling experience, making friends, doing stupid shit, and making connections that could potentially last beyond. There's so many people here and yet I can't seem to make a decent human connection with anyone, which is important to me.",
          "author": "london_brigid",
          "created": 1637701780,
          "upvotes": 2,
          "replies": {
            "hltsrhm": {
              "link": "/r/college/comments/r0m2r4/i_cant_make_friends_is_something_wrong_with_me/hltsrhm/",
              "text": "I totally get that. Unfortunately I'm probably not the best to give advice in this arena since I've always been more of a lone wolf with 2-3 long term friends. With that being said, however, I think that most things come with time and determination. If things aren't happening naturally right now, then that probably is what is just natural *right now*. \n\nI think when we want things like friendships we tend to always look at ourselves as being the problem, and while sometimes that might be true and self reflection is always important, I think it's important to stay true to ourselves. Otherwise we may end up sacrificing something of ourselves in order to maintain something we want, even though it might not exactly be compatible with ourselves. \n\nIt's sort of like applying to jobs. You just keep putting yourself out there, and eventually something will come along. With friendships however, I feel like when we don't immediately get what we want, we keep changing how we present ourselves until we do. But, if we keep putting the honest version of ourselves out there, we are more likely to develop relationships which are more compatible with ourselves. \n\nSo I guess my advice would be to just keep being yourself, being honest about what you want and are looking for with others, and never doubting yourself or believing you're doing something wrong. Of course figuring out who we are and what exactly it is we want is sometimes hard. But self-doubt is the biggest impedance for that I think.",
              "author": "VerifiedMadgod",
              "created": 1637707161,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}