{
  "sid": "r3tvuu",
  "link": "/r/college/comments/r3tvuu/i_would_like_to_get_a_masters_degree_but_dont/",
  "title:": "I would like to get a master’s degree but don’t feel qualified to even make it in. Where is the best place to start?",
  "text": "I recently graduated college last spring as a communications major and have always wanted to pursue a master’s degree in business. I realized that if I don’t do it now, I’ll never do it. It’s the best time of life to do it. I plan to start applying next fall once I have things in order. The problem is that I don’t feel qualified to take the GRE test and don’t even know if I would make it into a program. It may just be a wast of time and money. In my case, the time may be better invested elsewhere for long term career success. \n\nMy ACT score was 18 (13-15 on the math/science section, much higher in the reading and grammar portions). The only reason I got into college was because I went to a private school that didn’t really care about your academic achievements. I did fine in school, I really struggled the first year but made the Dean’s list 2 years in a row once I found stability and changed my major from English to Communications. I have very poor math/quantitative skills, probably around a 6th or 7th grade level. I don’t even know where to begin in the preparations process, it’s very overwhelming given that I don’t know much about the process. I don’t know anyone who has a master’s degree. Does anyone have advice for how to start?",
  "author": "Cthescubasea",
  "created": 1638067596,
  "updated": 1638206833,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmcsshv": {
      "link": "/r/college/comments/r3tvuu/i_would_like_to_get_a_masters_degree_but_dont/hmcsshv/",
      "text": "Depends what school. Some masters in business don’t require gre. Do you know what you want to major in? Do you want an mba or do you want to get a masters in a specific subject like marketing, supply chain, or accounting? A specific masters is going to want job experience in that field. MBA can be your local state school or places like Penn state or Arizona state. I think the online programs would be easier to get in. Either way business does require more analytical skills I would join khan academy and start self studying in math. Get up to statistics 2.",
      "author": "BlueOcean7987",
      "created": 1638068836,
      "upvotes": 2,
      "replies": {
        "hmczzqz": {
          "link": "/r/college/comments/r3tvuu/i_would_like_to_get_a_masters_degree_but_dont/hmczzqz/",
          "text": "Thank you so much, this is super helpful. I am planning to go for an MBA and hopefully could get it through my state university. Great idea to check online programs as well. :)",
          "author": "Cthescubasea",
          "created": 1638072464,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}