{
  "sid": "qhlz3h",
  "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/",
  "title:": "Is my professor being a creep?",
  "text": "I am in a class where every week when the class meets he will make a student go in the front of the class and ask them 10 questions. He says we can say skip to any of the ones we don’t want to answer. But I felt like some of the questions were sort of rude or not appropriate for class? I’ve noticed he will ask the boys normal questions like if they could go to any concert what concert would you go to? Then he will ask the girls questions along the lines of “would you rather be dumb and pretty or smart and ugly?” Or “would you rather be ugly and have all the kids you want or pretty and not have any kids?”. And every girl will always choose ugly because of course nobody’s going to tell the whole class they value their appearance more. The class is about dying so the subject matter is I guess sensitive enough already. But is this wrong ? Am I the only one that gets annoyed when the teacher asks that? All the other students seemed to go along with it just fine. But i don’t like it.",
  "author": "Kellimagine",
  "created": 1635424317,
  "updated": 1635456873,
  "over_18": false,
  "upvotes": 190,
  "upvote_ratio": 0.96,
  "comments": {
    "hidma5e": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hidma5e/",
      "text": "What class is this for, some kind of sociology or psychology class? Is this part of some kind of activity? If this is some kind of 'get to know you' exercise then its completely inappropriate.",
      "author": "hdorsettcase",
      "created": 1635427504,
      "upvotes": 127,
      "replies": {
        "hie7jub": {
          "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hie7jub/",
          "text": "Yes! My Spanish professor met with all of us when classes first started but it was actually, y’know, appropriate. She just wanted to know if we’ve taken a language class before, do we have any pets, what brought us to this school, etc. I had fun and got to learn a bit about her too :)",
          "author": "invisibilitycap",
          "created": 1635436471,
          "upvotes": 30,
          "replies": {}
        },
        "hif0i6c": {
          "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hif0i6c/",
          "text": "I would never do this in a sociology class. When it comes to gender discomfort, I keep that shit in the abstract or show videos/illustrations. I do not use my students as living experiments for that stuff. If that's what this is, they're asking for trouble. If it isn't what this is, they're being creepy as fuck.",
          "author": "purple_ombudsman",
          "created": 1635447763,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "hietbxn": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hietbxn/",
      "text": "It gives me the vibe of that interview with Ariana Grande and they ask her \" if you could only use your phone or make up for the rest of your life, what would you pick\" and she answered \"do you think this is what women have trouble choosing between?\"",
      "author": "churchisforbrunettes",
      "created": 1635444933,
      "upvotes": 56,
      "replies": {}
    },
    "hidjd0w": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hidjd0w/",
      "text": "This sounds biased to me if it is as you say.\n\nYou should skip questions you think are sex or gender biased and if you can stomach it say why.\n\nIf you cant, you can actually go to the chair of course, but you can also go to the Title IX office.\n\nI have definitely worked in some departments that were massively male dominated and you would not have gotten traction , if that is the case, then Title IX.  Otherwise the chair is the best and fastest option.\n\n\nEdit .\n\nThe best option is actually usually bringing it up to the prof.  Which is what you will be asked when you go to any of the other higher ups.\n\nSo try going to office hours or other private meet and politely mentioning that you feel there is a gender or sex bias.  A good number of times someone is just making a mistake or has a blind spot and they will fix it.  You go via other means when that doesn’t work",
      "author": "PersephoneIsNotHome",
      "created": 1635426098,
      "upvotes": 101,
      "replies": {
        "hidmubu": {
          "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hidmubu/",
          "text": "I agree, it sounds like he means well but he should be told what he's doing isn't right (wrt the gender bias, I don't see anything inherently wrong with the game)",
          "author": "Brushermans",
          "created": 1635427768,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "hidsglx": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hidsglx/",
      "text": "It doesn’t sound “creepy” to me but it is definitely weird for sure",
      "author": "AP_Feeder",
      "created": 1635430295,
      "upvotes": 29,
      "replies": {}
    },
    "hidvb78": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hidvb78/",
      "text": "The fact that he’s asking students random questions in general are add. But the questions themselves makes it seem like he’s sexist.",
      "author": "kizeltine",
      "created": 1635431503,
      "upvotes": 29,
      "replies": {}
    },
    "hidle1w": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hidle1w/",
      "text": "Uhh wtf.. Is this like an assignment or just a random thing he does.",
      "author": "pintossbm123",
      "created": 1635427087,
      "upvotes": 16,
      "replies": {}
    },
    "hif8o0h": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hif8o0h/",
      "text": "Yes your professor is being a creep or an ass or both. Why the separate questions for different sexes? Can he find no appropriate ground for students that apply to all humans? I'd be having a talk directly with him.",
      "author": "comfort_fiend",
      "created": 1635451022,
      "upvotes": 1,
      "replies": {}
    },
    "hieehpk": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hieehpk/",
      "text": "Honestly I’d start writing down the questions he asks and the gender of the person he’s asking.",
      "author": "HewTheSlew",
      "created": 1635439194,
      "upvotes": 8,
      "replies": {}
    },
    "hidg5p8": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hidg5p8/",
      "text": "No, this is weird and creepy. Document thoroughly and bring to the chair.",
      "author": "FlimsyIsopod",
      "created": 1635424451,
      "upvotes": 28,
      "replies": {}
    },
    "hieog7g": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hieog7g/",
      "text": "that is so extremely irritating. i don’t feel embarrassed about calling people out, but everyone is different, so i’ll just say what i would do in this situation.\n\n“that’s not a very thought provoking question, sir. may i have a more interesting one?”\n\nor \n\n“that question makes me uncomfortable, i don’t want to answer that.”\n\nor if you really want to go for the jugular,\n\n“why do you want to know the answer to that? you know i will be judged if i say i value my appearance more, as will any other woman who is asked this question, so what’s the point in asking if you know you’ll get the same answer every time? let’s please move on.”",
      "author": "tacticalcop",
      "created": 1635443046,
      "upvotes": 3,
      "replies": {}
    },
    "hieyk1o": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hieyk1o/",
      "text": "Wouldn’t write him off as a creep for some odd questions. Definitely weird behaviour, but not inherently creepy. If he steps out of line and you don’t feel comfortable tell someone in your class, and tell a senior member of staff.",
      "author": "hitroow",
      "created": 1635446986,
      "upvotes": 2,
      "replies": {}
    },
    "hif7khm": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hif7khm/",
      "text": "You’re not wrong. You need to mention to someone that you feel the questions are not the same for males and females and the female related questions are sexually inappropriate and sexist.",
      "author": "jillianthekitty",
      "created": 1635450582,
      "upvotes": 1,
      "replies": {}
    },
    "hifbjz3": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hifbjz3/",
      "text": "It's not creepy, but it is sexist and weird.",
      "author": "RadiantHC",
      "created": 1635452177,
      "upvotes": 1,
      "replies": {}
    },
    "hiew7mh": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hiew7mh/",
      "text": "His questions definitely demonstrate strong gender bias.  Personally, I am the kind of person who would probably call it out as it happens in class.  Or I’d ask “I’m a bit confused.  Is there a reason that questions aimed at women are focused on appearance?”  But that’s just my personality, lol.\n\nMaybe the prof has no idea that his questions are so biased.  You could bring it up to him privately.  Or you could mention it to the department chair (not in a complaining way but in a way that indicates that this prof is probably inadvertently making people uncomfortable).",
      "author": "catscience247",
      "created": 1635446065,
      "upvotes": 3,
      "replies": {}
    },
    "hif01y2": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hif01y2/",
      "text": "“What a disappointing question.”\n\n“My reproductive choices aren’t your business.”\n\n“Do you have reasonable questions for me or was your intention to waste both of our time?”\n\n“Do better.”",
      "author": "tiny_sweaters",
      "created": 1635447582,
      "upvotes": 3,
      "replies": {}
    },
    "hiemrka": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hiemrka/",
      "text": "It’s weird. You should tell him this is unacceptable. If he continues, report him.",
      "author": "jojoisland20",
      "created": 1635442402,
      "upvotes": 1,
      "replies": {}
    },
    "hiepepf": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hiepepf/",
      "text": "i think the best word to describe him is misogynistic. I wouldn’t say creepy, but still something that should be called out.",
      "author": "BucktoothedMC",
      "created": 1635443408,
      "upvotes": 1,
      "replies": {}
    },
    "hiexroe": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hiexroe/",
      "text": "Well, this sounds like an old dude trying to come up with questions boys and girls would probably answer, you know, like handing out a gendered toy in mcdonalds. Even though he doesn't have to and its pretty awkward that he does.\n\nI would try talking about it with him first. Doesn't sound malicious, just \"old guy doesn't know what young women do\" you know what I mean?",
      "author": "guy_with-thumbs",
      "created": 1635446675,
      "upvotes": 1,
      "replies": {}
    },
    "hif6lr8": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hif6lr8/",
      "text": "99.9% of the time, when something repeatedly strikes you as creepy, it is. Trust yourself.",
      "author": "calibrator_withaZ",
      "created": 1635450196,
      "upvotes": 1,
      "replies": {}
    },
    "hie0eag": {
      "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hie0eag/",
      "text": "You are over reacting.",
      "author": "orangeblackteal",
      "created": 1635433595,
      "upvotes": -24,
      "replies": {
        "hie1wbq": {
          "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hie1wbq/",
          "text": "Says the man.",
          "author": "_OhayoSayonara_",
          "created": 1635434214,
          "upvotes": 2,
          "replies": {
            "hie6m8n": {
              "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hie6m8n/",
              "text": "Sick burn. 🥴",
              "author": "orangeblackteal",
              "created": 1635436104,
              "upvotes": -7,
              "replies": {}
            }
          }
        },
        "hie5evj": {
          "link": "/r/college/comments/qhlz3h/is_my_professor_being_a_creep/hie5evj/",
          "text": "nice buzzword, please don't elaborate",
          "author": "DancingNoobBear",
          "created": 1635435627,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}