{"sid": "ptrg5s", "link": "/r/college/comments/ptrg5s/what_do_i_do_if_i_accidentally_plagiarized_but/", "title:": "What do I do if I accidentally plagiarized, but it's being let go this time?", "text": "Sooo I was doing an oral exam through Zoom with a group of 3, and towards the end, my prof private messaged me and said he'll talk to me after. I was scared but hoped it wasn't anything bad\n\nTurns out, I apparently plagiarized a paper for his class last school year, but he said that he's letting it go for now since it was just an optional/additional paper, but that I have to be careful next time (I obviously will).\n\nI was shocked to hear that though, because I thought I'd never plagiarize (even accidentally!) since I really didn't intend to, so I didn't know how to respond, so I just said I didn't realize I did, and then thanked him for telling me. He said he'd send a copy of my paper with annotations of why certain parts are considered plagiarized. And I'm honestly so thankful for that, but I still feel so horrible and ashamed. (and disappointed? at myself)\n\nMy friend said I should email him to explain that I'm \"innocent\", but should I? If he's letting it go for now anyways? I think I should, but idk how to phrase it. \n\n\"I apologize for the plagiarism as I did not realize I did that. Thank you so much for telling me and for letting me go this time with a warning. I will not do this again, even though it is accidental.\"\n\n???\n\nedit: I obviously did cite my sources. I also really don't recall copying stuff word for word, but it could've been an oversight", "author": "mangofloatt", "created": 1632389032, "retrieved": 1632946116, "over_18": false, "upvotes": 20, "upvote_ratio": 0.92, "comments": {"hdzh7xk": {"link": "/r/college/comments/ptrg5s/what_do_i_do_if_i_accidentally_plagiarized_but/hdzh7xk/", "text": "How did you \"accidentally\" use someone else work that you presented as your own?", "author": "TheRightSideOfDumb", "created": 1632416717, "upvotes": 5}, "hdz8vet": {"link": "/r/college/comments/ptrg5s/what_do_i_do_if_i_accidentally_plagiarized_but/hdz8vet/", "text": "Professor here. This happens way more often than most people think. Learning how to successfully cite and not make these mistakes takes a long time (I didn't master it until well into grad school). You're Professor is using this as an opportunity to teach you, which is fantastic, not all professor's do that. \n\n&#x200B;\n\nIf you're concerned, rather than feeling like you need to explain the incident (your Professor already knows it was an accident or they wouldn't have let it go this time), seek them out and ask how you could avoid this in the future. Ask genuinely about citation policies and how to make sure you never do this again. Your Professor sounds like they will be open to helping you. Also, use the writing resources you have on campus. Most writing centers will go through your paper and check for this before you turn  it in if you ask specifically for that service.", "author": "thehelpfulprof", "created": 1632413292, "upvotes": 10}, "hdy17el": {"link": "/r/college/comments/ptrg5s/what_do_i_do_if_i_accidentally_plagiarized_but/hdy17el/", "text": "This is really tough, since some professors wouldn’t let that slide. I think just expressing that you’re grateful for him pointing it out and allowing you to continue with your presentation is enough. I wouldn’t try to make any excuses though, being apologetic more than anything and asserting that you won’t do it again is more important. It sucks, because it was accidental, but accountability goes a lot further in higher education than fighting the rules unfortunately", "author": "xxfukai", "created": 1632389626, "upvotes": 18}, "hdy12o3": {"link": "/r/college/comments/ptrg5s/what_do_i_do_if_i_accidentally_plagiarized_but/hdy12o3/", "text": "No don’t say you’re ‘innocent’. Professor is doing you a favor. Thank him for the edits and don’t let it happen again. Cite your sources better", "author": "Concerned-23", "created": 1632389504, "upvotes": 49}}}