{"sid": "pwidq3", "link": "/r/college/comments/pwidq3/debating_dropping_a_class/", "title:": "Debating dropping a class", "text": "I was really looking forward to this semester, and then it quickly fell flat. There's several reasons, but the main one was that the prof for two of my classes dipped about three weeks in, leaving us with nothing that week and then a quick hire professor to pick up the pieces. The new prof is doing as well as she can, I don't really blame her, but one of the classes are just getting to be too much. \n\nIt's a class that was basically like a select topics class, and I swear to god they changed/added the topic to be about film just before it started. While I'm somewhat interested in film in general, I have no experience with it nor much interest for this type of film work. Because the prof is trying to get people involved — basically cameras on in the zoom class and semi regularly calling on people to speak and/or share their work — I'm a bit ashamed to admit that I've been avoiding that class entirely. \n\nSo I'm behind, have little interest in the class, and with how classes have changed with online/on campus times post start of the semester, it conflicts a bit with the rest of my schedule. Several other classes of mine are far more demanding, and I worry that if I were to try and stick it out in this class, I'll either fail it or my performance in the rest of my classes will tank. It is not a mandatory credit — I can take another class within this field to fill that credit requirement. Thinking about this class makes me cry. I don't think I can wing this class as I have some classes in the past. \n\nI just feel like a failure though if I were to drop since my grandparents are paying for it and this class was over $1k. I'm also only at 15 hours currently, so dropping will take me down to 12. What should I do? How would I explain it to my parents/grandparents?", "author": "wishfulhermit", "created": 1632753289, "retrieved": 1632945551, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"heh6hx2": {"link": "/r/college/comments/pwidq3/debating_dropping_a_class/heh6hx2/", "text": "Those are all perfectly good reasons to drop the class. You aren't getting much benefit out of it since it's an elective. Double-check your financial aid, but 12 hours should still be considered full time and not cause you to lose anything. You also want to watch the dates for dropping a class. $1K feel like a lot of money but your overall success and mental health matter a lot more.", "author": "fawkes_fiesta", "created": 1632753908, "upvotes": 1}, "heh6htk": {"link": "/r/college/comments/pwidq3/debating_dropping_a_class/heh6htk/", "text": "Oof over 12 hours is a bitch. Tall with them about it first. It doesn't hurt also talking to the teachers you never know", "author": "NotStaggy", "created": 1632753907, "upvotes": 2}, "heh5ozd": {"link": "/r/college/comments/pwidq3/debating_dropping_a_class/heh5ozd/", "text": "explain it just like how you said it in your post, if it’s interfering with your schedule already and it’s too much for you then it’s doing you no good, just focus on your other classes. it’s definitely better to drop that one class rather than sticking it out and potentially failing anyway. i’m sure they’ll understand! good luck!", "author": "anonymous25635", "created": 1632753560, "upvotes": 4}}}