{
  "sid": "qi6917",
  "link": "/r/college/comments/qi6917/is_it_possible_to_have_an_entire_semester_removed/",
  "title:": "Is it possible to have an entire semester removed from your transcripts ?",
  "text": "I finally graduated with my AA back in April, and being quite honest i didn't think I was ever going to go back to school again with the job I have, but with every passing day I start seeing the importance of having a degree, and now I've started to get serious about going back to school and get my life on track, and of course I immediately ran into my first hurtle and that's having a bad GPA. \n\n&#x200B;\n\nOverall my grades aren't too bad, but I do have a semester that I pretty much completely bombed. It was my second semester in and I was confused like im sure everyone is with what they want to do with their lives so I switched majors from business to nursing. This was back in 2017 when pretty much my entire world felt like it was falling apart. My girlfriend which was also my first love had separated during the semester and my uncle/godfather had a near heart attack experience and was hospitalized. I pretty much had abandoned school and whenever I did show up mentally I just wasn't there with everything I had going on. It was honestly what felt like on of the lowest points of my life and being new to college I didn't know anything about withdrawing so that's an L on my part. I did try to email the professor afterward about dropping me but she kept telling me it was too late so I took the L. \n\n&#x200B;\n\nI took Chemistry, the lab, and some other health class. I completely ended up bombing Chem with an F, the lab with somehow a D, and the other class with a C which was given to me because the professor knew something was up with me. Ive heard about grades being expunged and forgiven but im not really sure if I can pull off an entire semester or weather or not they will consider my reasons valid but im planning to go in tomorrow and quite frankly not really sure who to speak to or where to start",
  "author": null,
  "created": 1635487998,
  "updated": 1635779867,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hiifrau": {
      "link": "/r/college/comments/qi6917/is_it_possible_to_have_an_entire_semester_removed/hiifrau/",
      "text": "No, you cant have it removed.\n\nHowever, especially if you have a good LOR that can highlight the improvement, you can actually make a meal of this and spin it in your favor.\n\nIf you say, (in a nicer way) look, i was a jerk.  It caused me problems.  I recognized and identified these, and changed my ways, and did better after that, you would not believe how many people look on that as more of a positive.\n\nIt means that when someone throws other life and work shit your way, you arent going to cave , you arent going to blame the rest of the world for your life.",
      "author": "PersephoneIsNotHome",
      "created": 1635515129,
      "upvotes": 3,
      "replies": {}
    },
    "hij4xbk": {
      "link": "/r/college/comments/qi6917/is_it_possible_to_have_an_entire_semester_removed/hij4xbk/",
      "text": "Some universities have a policy that allows you to wipe the entire record if it's been more than a certain amount of time. Typically this is for returning students after a few years, you have to wipe everything, and it's only usable once per lifetime.\n\nIn your case this would not apply. But some colleges are more forgiving. You can ask the dean's office if there is any policy for Academic Bankruptcy you would benefit from due to hardship or switching programs.",
      "author": "darniforgotmypwd",
      "created": 1635525335,
      "upvotes": 3,
      "replies": {
        "hiprg92": {
          "link": "/r/college/comments/qi6917/is_it_possible_to_have_an_entire_semester_removed/hiprg92/",
          "text": "Thanks sounds like a good idea will definitely try this out!",
          "author": null,
          "created": 1635644462,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}