{"sid": "pr5hsk", "link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/", "title:": "How hard is it to stay up for a about 40 hours or so?", "text": "I need to do this in order to complete all the wok spread throughout the week, study for this test on Friday, still have time for this one extracurricular, and attend class tomorrow.\n\nCurrently, it's 6:33 AM where I am, so let's say until about 9:00 PM tomorrow, I want to do everything to stay awake.", "author": "WorthlessFoolish", "created": 1632047380, "retrieved": 1632801385, "over_18": false, "upvotes": 239, "upvote_ratio": 0.83, "comments": {"hdkvp8q": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdkvp8q/", "text": "I see you got some sleep, but I wanted to chime in here. Alway, ALWAYS prioritize your health/sleep. Getting a couple hours less here and there is okay, but always make sure you get your sleep (unless medically impossible- like insomnia). Your work will suffer if you don’t. Your mind just won’t work to its full capacity and this will impact your grades even if you manage to get all your work done.", "author": "OhBlaiseyOne", "created": 1632138337, "upvotes": 1}, "hdkm2nm": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdkm2nm/", "text": "Man just let this one go… I’m sorry to tell you, but if you’re at the point where you feel the need to stay up 40 hours, you’re already fucked. This 40 hour grind is probably gonna make little to no difference. Just learn from this and be organised next time", "author": "consistency16", "created": 1632130925, "upvotes": 1}, "hdk6a2v": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdk6a2v/", "text": "If you need to stay up 40 hrs straight because you are short on time… quit wasting time on Reddit. \n\nAlso, if you are gonna do this, find a good adderall source.", "author": "Virophile", "created": 1632117175, "upvotes": 1}, "hdjwiqt": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdjwiqt/", "text": "I legit stayed up for 44 hours recently as a commuter college student. For context, I did this because I’d needed to stay up really late to write a paper worth 15% of my grade and then attend an entire day of classes immediately after. My first class of the following day was at 9:30am and the final one ended at 6:20pm. I had to stay on campus, all day, with no sleep. Let me just tell you this: you can do it and stay awake with some coffee or some energy drinks and water, but you’re going to retain very little from the lectures and you’re going to have such a strong urge to sleep that you’ll feel irrationally angry at everything the professor says. Then you’ll have to make up for it with “sleep debt” and you won’t feel good the next day unless you get to sleep for 9-12 hours to make up for it. It’s a myth that staying up all night corrects your sleep schedule so, ultimately it throws your entire week off just for one all nighter.", "author": "breadinhaler", "created": 1632110733, "upvotes": 1}, "hdjt6wg": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdjt6wg/", "text": "Not hard at all if you know who to call. 😂😂", "author": "call_us_Tre", "created": 1632108844, "upvotes": 1}, "hdjs9gj": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdjs9gj/", "text": "I work around 32 hours each week, taking 15 credit courses. Sometimes I’m opening and closing back to back for work which means I don’t even get 6 hours of sleep. I can still focus during class but this isn’t healthy. Sometimes at work I just do my homework on my phone for my easier classes and catch up on some reading. Honestly I don’t recommend this because you won’t be getting enough sleep. Sometimes I sleep 3 hours and it’s not good for health in the long term.", "author": "anieee1188", "created": 1632108355, "upvotes": 1}, "hdjpkm6": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdjpkm6/", "text": "You HAVE to sleep. Trust me. I tried this exact same thing and almost ended up in a psych ward. I legitimately thought I was losing my mind and started freaking out, hallucinating. It was bad.\n\nPlease. Get some SLEEP. Even if it’s little 4-5 hour cat naps in between each assignment or at night. You have to give ur brain a break and rest.", "author": null, "created": 1632107013, "upvotes": 1}, "hdjottp": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdjottp/", "text": "Sleep more than you study, study more than you party, and party often. Although we are here to get an education, don't forget to experience life.", "author": "Nerobus", "created": 1632106636, "upvotes": 1}, "hdjkslu": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdjkslu/", "text": "Sleep is way more important. I took too many classes a few semesters ago and got the habit of using biphasic sleep back then for that semester. Wasn't fun at first at all but throughout the semester it got better and I was getting more stuff done for sleeping basically the same amount of time", "author": "azab189", "created": 1632104636, "upvotes": 1}, "hdjefn6": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdjefn6/", "text": "I did this. At the 24-hour mark, I couldn't do anything that requires cognitive skills properly. After that, I slept for 16 hours straight.", "author": "TTbulaski", "created": 1632101568, "upvotes": 1}, "hdjbhag": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdjbhag/", "text": "Please don't fucking drive on that little sleep.\n\nLook, this is a horrible plan. Don't do it. \n\n* Spend 15 minutes to email all your professors for extensions. \n* Spend 15 minutes to order healthy-ish groceries for delivery, and bottled water. You want food that is throw in oven / microwave and set alarm and somewhat healthy.\n* Spend the last 30 min washing your face and sitting down to make a plan of the bare minimum to do your work. \n* Every 30-45 min take a short break WITH AN ALARM.\n* Keep up with food and water. Check email on break, skip anything you can delay.\n* Get at least 7-8 hours sleep and a decent fucking time. \n* Next morning, immediately either shower or wash face and get back into catch up. \n* Take a break after a hour, go make your food.\n* Enlist family or roomies to help, this sounds like emergency cram so ask to skip family events or get help with food. \n\nLook, your going to pass out, learn nothing and be horrible with this little sleep. This will probably get you a zero on your exam Friday. \n\nDon't do it. Sleep is very important.", "author": "YouveBeanReported", "created": 1632100147, "upvotes": 1}, "hdj6bwc": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdj6bwc/", "text": "Even just 2 hours of sleep is waaay more refreshing than you probably think it is. Get some sleep when you can and you'll be more productive. Have an asshole friend wake you up rudely, too. It works wonders", "author": "the-immortal-seaweed", "created": 1632097684, "upvotes": 1}, "hdj2k00": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdj2k00/", "text": "Don’t do this. You’re going to fatigue your body and mind.", "author": "bitchforpankocrumbs", "created": 1632095852, "upvotes": 1}, "hdj1qdz": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdj1qdz/", "text": "You absorb/recall information better with a good night's rest. I highly reccomend watching this video about sleep and good study habits, it recently helped me put a few things in perspective: https://youtu.be/c0fp7kB2vuU\n\nI have some horrible ADHD, and have experienced many major depressive episodes in my life. My mental health can easily fall into the gutter if I allow it to. Circumstances exasperate these kinds of mental health issues, as do habitual thoughts. However, at least in my experience, probably 50% is physiological. Eat healthy foods. Get enough sleep and establish good sleep hygiene. See a mental health professional to see if medication would be a good option for you. Exercise and get some sunlight. You will be much more productive and happy.\n\nYou are shooting yourself in the foot if you stay up for two days straight. You are probably in this situation in the first place due to poor time management (been there, it happens, and sometimes you really can't help it). Your body will have to adjust, and you will lose even more time, and you will probably have to do it again pretty soon. It's not sustainable.\n\nGet some sleep, accept the loss, and just do the best you can. Email your professors about possible extensions, and explain your situation to them ahead of time. They might give you extra credit options, extra time, or even just a bit more patience and understanding.\n\nAlso I hate to be an armchair therapist, but look up ADHD symptoms and see if they apply to you at all (disorganization, forgetfulness, poor time-management, \"laziness\"). Your comments remind me of how I was before I was diagnosed as an adult---it's an extremely misunderstood disorder (not all about squirrels and bouncing off walls). Again, self-diagnosis can be dangerous, but it might be something worth looking into.", "author": "looiie", "created": 1632095463, "upvotes": 1}, "hdj06u5": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdj06u5/", "text": "You will become delirious and should not drive or go anywhere dangerous.  You shouldn’t think that you’ll remember anything well from that time.  When I was in middle school we had a game of it because it made you feel drunk and we couldn’t drink.  Be careful. It’s obviously possible but always a bad idea.", "author": "CozmicOwl16", "created": 1632094726, "upvotes": 1}, "hdixznx": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdixznx/", "text": "Hard, just don't do it", "author": "toofeduptocare", "created": 1632093699, "upvotes": 1}, "hdixui8": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdixui8/", "text": "Do NOT stay up this long. You can’t focus after a certain amount of time without sleep, not to mention you won’t be doing your best work or be awake enough to retain anything. Best thing I learned in college was if you’re tired, REST!!!! Always. Take care of your body so you can do your best when you wake up next :)", "author": "mike_wazowskis_ass", "created": 1632093640, "upvotes": 1}, "hdix1vy": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdix1vy/", "text": "Do *not* try to do this.\n\nStaying up all night studying for a test will result in a worse grade on the test than if you hadn’t studied at all.\n\nMemories and recall - I.e. test information - are stabilized in your sleep. You cannot overestimate how important sleep is.", "author": "temsik1587againtwo", "created": 1632093291, "upvotes": 1}, "hdims54": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdims54/", "text": "this will not work. sure, it’s physically possible to do this, but the quality of your work will degrade so much that the value of staying up to do your work is substantially outweighs by the poor grades you will receive. \n\non the, you know, physical health note of all this, you will genuinely start hallucinating by the time you go to bed next. my best friend regularly didn’t get enough sleep (2hrs/night) for all of high school and the first two years of college and her hair fell out in chunks, she had these episodes where she would lose memory and “wake up” on the opposite side of the city, and needed to take literal prescription strength vitamins. all because of chronic sleep deprivation, especially while her brain is still developing. sleep deprivation is used as a torture  method for a reason, go the fuck to bed.", "author": "throwaway86753090357", "created": 1632088701, "upvotes": 1}, "hdilvzt": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdilvzt/", "text": "Don’t sacrifice sleep….\n\nDon’t do it…\n\nBuuuuutttttt, if you really are in a bind, try getting in at least one sleep cycle (90 minutes/2 hours) every 24 hours. That, as opposed to going for 36 plus hours awake will do wonders.\n\nWhen I was 21, I worked a 24 hour shift at a bar during Homecoming, bookended by an all nighter before getting schoolwork done and a couple hours of winding down after. I was awake for over 48 hours. It was aided by drug use, and also by the consistent and monotonous physical work of being a barback on my feet, and it was still pretty hard to stay awake. By the end I was starting to have auditory hallucinations. It was not worth it. Fucked me up for a couple days cognitively, and wasn’t 100 percent for a few weeks. Try to get at least a little sleep here and there.", "author": "dookalion", "created": 1632088309, "upvotes": 1}, "hdilfqk": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdilfqk/", "text": "You’d be more productive if you worked 2-3 hours at a time, taking breaks and sleeping for at least 7-8 hours", "author": "dskcnsnskcnn", "created": 1632088114, "upvotes": 2}, "hdil6m3": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdil6m3/", "text": "I used to do it all the time in the Army while on \"duty\", and when I worked 24 hour shifts on an ambulance. Soon as my shift was up I'd be out and about enjoying my next day off. For me, 40 hours is totally feasible. However, it's not something you can just decide to do overnight, you have to work at it. For now try to plan a short reset sometime tomorrow, rest for 6-7 hours. It's not exactly a healthy practice staying up 40 hours straight, but you do you. I'd recommend better time management from here on out. You should always be able to plan for at least 7 hours of sleep per night, otherwise you're overloading yourself.", "author": "Nighthawk68w", "created": 1632088006, "upvotes": 1}, "hdik19u": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdik19u/", "text": "That is a truly awful idea, and if you attempt that, you will regret it.", "author": "somethinsomethinmeme", "created": 1632087499, "upvotes": 1}, "hdihjeb": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdihjeb/", "text": "Well since you are on Reddit atm I would assume you dont need to work for 40 hours straight. Instead you should work on time management and being more productive when you actually are working", "author": "chillest_dude_", "created": 1632086437, "upvotes": 1}, "hdifevk": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdifevk/", "text": "Even if it is possible, you’ll be better off, both physically and academically, sleeping and not studying than you would be studying and staying up for 40 hours.", "author": "uofc-throwaway", "created": 1632085544, "upvotes": 1}, "hdieaut": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdieaut/", "text": "Addy to the rescue", "author": "delusionalry", "created": 1632085079, "upvotes": 0}, "hdi973e": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdi973e/", "text": "You need to go to an emergency room and get help. You shouldn’t even be in college.", "author": "Aaalexisaa", "created": 1632082947, "upvotes": 3}, "hdi8f14": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdi8f14/", "text": "Prioritize the things you absolutely need to get done and either do the rest later or dont do it at all. We are human. We need sleep.", "author": "SnooSeagulls4789", "created": 1632082631, "upvotes": 1}, "hdi7oa6": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdi7oa6/", "text": "I did this on my heavily weighted final, too Adderall for 48 hours (I'm prescribed) then crashed for a full 24 hours after. Passed the class but fucked up my body and sleep schedule for two weeks. Don't do this!", "author": "nolandeluca", "created": 1632082331, "upvotes": 1}, "hdi5w3p": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdi5w3p/", "text": "Studying while sleeping deprived is so overrated. There’s studies that show you pretty much barely retain any information while studying under mental stress.", "author": "Sky_Hawk105", "created": 1632081627, "upvotes": 1}, "hdi58tq": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdi58tq/", "text": "Because I work from 7am to 11pm on Saturday and Sunday, I also have insomnia, and it hit once where I didn't sleep on Saturday night WHILE I had work that weekend. This meant when I got home Sunday night I hadn't slept for 40 hours. I was hallucinating by the end of my last shift, I had to have my fiancée pick me up, and she said when I fell asleep I was screaming and shaking... I don't think it's a good idea", "author": "Jimmy_E_16", "created": 1632081373, "upvotes": 1}, "hdi4kzu": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdi4kzu/", "text": "You need to learn how to take shortcuts and time management.", "author": "Nofapdeity", "created": 1632081118, "upvotes": 1}, "hdi34uz": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdi34uz/", "text": "All I know is that you’ll need the power of lingling", "author": "ripthetrees", "created": 1632080559, "upvotes": 1}, "hdhz0h8": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhz0h8/", "text": "I read other ppls advice , and I read your responses , and I have to tell you what you are trying to do is bad for health , they are right , some of your responses are stupid , but then again I won't judge you , and answer to your question , \n\n\nif this is a only one night thing here is what you gotta do, keep ice handy , a good ventilation, a source of caffeine but it must not have sugar, energy drinks are a no-no as they will cause a sugar crash , and your next day will be shit after these , but hey you can stay awake for 40 hours , ever feel like sleeping then just shove your face in some ice cold water for few seconds , either it will work or you will get a serious headache immediately or the next day , and keep in some racing games music like need for speeds , and stuff ,\n\n\n\nI don't recommend these , as by these all nighters I have had some quiet a few bad experiences , and had almost died once due to not sleeping enough , I strongly don't recommend an all nighter but still you wanna proceed then there is the stuff above , do at your own risk", "author": "angaddeepsingh", "created": 1632078977, "upvotes": 1}, "hdhyyyu": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhyyyu/", "text": "Not a good idea\n\nI would only pull All Nighters if you really really need to, like last resort", "author": "king_zacarias", "created": 1632078961, "upvotes": 1}, "hdhxa6o": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhxa6o/", "text": "Everybody’s telling you not to, but I get it. If you’re committed to this, constant caffeine, small sips. Large Monster/ Iced coffee. If you’re a nicotine user, also consume that constantly. Take a smoke break every hour, never stop looking at a screen. Electronics make it hard for us to fall asleep. If you need to do work, lay down, don’t sit down. Try to stand and walk around every hour as well. Good luck", "author": "Ascension456", "created": 1632078296, "upvotes": 0}, "hdhveuc": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhveuc/", "text": "Ya, not a good idea.", "author": "reallysrry", "created": 1632077554, "upvotes": 1}, "hdhuh80": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhuh80/", "text": "no please DONT do this no class is worth it", "author": "helphelp893838", "created": 1632077190, "upvotes": 1}, "hdhuez5": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhuez5/", "text": "Shouldn’t do this. Manage your time better.", "author": "GodOfThunder101", "created": 1632077166, "upvotes": 1}, "hdhshiw": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhshiw/", "text": "I'm sure you already know its bad for you, but if you REALLY have to atleast plan a couple naps or atleast 3-4 hours of sleep in between.\nI went through 36 hours between work and classes by managing my caffeine throughout the day and making sure I keep myself busy. It wasn't that bad, but I couldn't focus on anything.\nI'd prioritize the assignments and test first and skip out on the extracurricular activities.", "author": "crumblehubble", "created": 1632076390, "upvotes": 1}, "hdhru3g": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhru3g/", "text": "If you are in a situation where you need to stay awake for more than a few hours passed your bedtime, you are managing your time improperly. I pulled one all nighter in school and it was to finish a report for my capstone. I had worked on the report for two weeks prior to submitting and my team thought they could do it the day before. I ended up writing 80% of the report.\n\nAs for your question, don’t stay awake past 20 hours. You’ll get sloppy and you will not retain nearly as much information. \n\nIn the future, start your work early. If there is not enough time to do all the work, you may need to cut back on other aspects of your life or even on some of the course load.\n\nI went through 4 years of a STEM major and hardly ever felt overwhelmed once I had figured out how to manage my time effectively.", "author": "Sogbert", "created": 1632076123, "upvotes": 1}, "hdhn5xd": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhn5xd/", "text": "I find that productivity basically dies for me around the 20 hr mark. While I've stayed up for 40 hours, before, I definitely do not recommend. Best to take even a short couple hour nap at some point halfway.", "author": "DjSzymek", "created": 1632074288, "upvotes": 1}, "hdhm3vz": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhm3vz/", "text": "The problem isn't whether or not you can stay up that long. It's how gradually ineffective you will become at retaining information and/or completing your work. If you start studying for a test after having been up for 30+ hours, you aren't going to retain basically anything from your studying. Plus, it won't be safe for you to drive in that state if you commute.\n\nThe best option is to do what you can today, get a reasonable amount of sleep, and do the rest of what you can tomorrow.", "author": "para_lyzed", "created": 1632073874, "upvotes": 1}, "hdhldmq": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhldmq/", "text": "Keep a lot of RedBull on hand and take a few 1-3 hour naps here and there. It's never a good idea, but I've used that method to stay awake for the better part of 3-4 days.\n\nEdit: If you have no real need to do this, please don't do it. It fucks you up for days afterwards. It can be dangerous and cause hallucinations. When you're that tired, you're not going to be working very efficiently (or accurately). So it's going to take you a longer amount of time to complete the assignments, only to end up with worse grades on them. Studies have also shown that it's impossible to catch up on lost sleep.", "author": "4BlackHeart4", "created": 1632073597, "upvotes": 0}, "hdhkkuf": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhkkuf/", "text": "My record is about 40 hours with 30 minutes of sleep. It was during a hackathon. I slept for 12 hours after and I was supremely unproductive for the latter 10 hours. It's not worth it. Don't do it.", "author": "restinstress", "created": 1632073299, "upvotes": 1}, "hdhjdgj": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhjdgj/", "text": "I used to do this for work. I destroyed my body with insane amounts of caffeine and after it happened I would sleep for an entire day. Honestly, just get 6-8 hours and skip something if possible. Prioritize your sleep and health. Your extracurricular will understand. Nothing in life is worth killing yourself over", "author": "M3L21", "created": 1632072838, "upvotes": 1}, "hdhj28y": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhj28y/", "text": "It’s easy to stay awake for 40 hours, did several times, but you can’t work for too long. Productivity goes to zero real quick", "author": "Sharan-Reddy", "created": 1632072717, "upvotes": 0}, "hdhhzvy": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhhzvy/", "text": "While sleep is important, not sleeping for \\~2 days won't harm you. REM rebound should compensate for your lack of REM sleep during this time. I've stayed up for 3 days at a time finishing up work, and it's worked for me. Your body goes into a highly noradrenaline-fueled state after about 20 hours, so you don't really feel the effects for a while. Coffee is really useful for maintaining productivity. My only advice is to **not make this a habit**.", "author": "throwaway19482038205", "created": 1632072306, "upvotes": -2}, "hdhhwqh": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhhwqh/", "text": "Utterly imposible.\n\nSleep is important both for your health and concentration. If you want to skip sleep to do work. You are already fucked.\n\nStart work earlier next time.", "author": "D_Leshen", "created": 1632072273, "upvotes": 1}, "hdhfn58": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhfn58/", "text": "“I’m going to stay up for 40+ hours straight and be productive the entire time”\n\nusername checks out", "author": "JEBERNARD", "created": 1632071399, "upvotes": 4}, "hdhf6pp": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhf6pp/", "text": "Sleep is, actually, necessary for learning and retaining information. And, yes it is very hard to even just stay up for that amount of time. And if it isn't, I'd consult a doctor.\n\nAre you doing the work just to get it done or are you trying to learn? If you are trying to learn, then this is a bad strategy. And if you are trying to just get it done, then why? It seems like a waste of money and time at that point.", "author": "peppyunicorn", "created": 1632071217, "upvotes": 1}, "hdheek2": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdheek2/", "text": "I took IB in high school, and I would pull all nighters pretty commonly my junior and senior year to get my school work done. It was terrible on my mental health, so I made sure to never do that again in college, and I actually feel like I’m capable of doing more in a day when I don’t stay up so much. \n\nDon’t do that.", "author": "braided--asshair", "created": 1632070895, "upvotes": 1}, "hdhedmf": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhedmf/", "text": "This is a good time to practice some prioritization. If you have to, study for the test and go to class but skip out on a few of the assignments if they're just small homework stuff. If you're worried about it, email professors and explain it to them, telling them you don't expect leniency on the homework but explain that you aren't just skipping homework for no reason.", "author": "Jack_Rickle", "created": 1632070884, "upvotes": 1}, "hdhed9z": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhed9z/", "text": "[deleted]", "author": null, "created": 1632070880, "upvotes": 5}, "hdhcqyv": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhcqyv/", "text": "the only way you stay awake is if you do drugs; but once you go down that path say goodbye to your good grades and hello to rehab", "author": "4eggy", "created": 1632070209, "upvotes": 1}, "hdhcibe": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhcibe/", "text": "this is not a good idea", "author": "PsychologicalWave332", "created": 1632070112, "upvotes": 1}, "hdhc0t6": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhc0t6/", "text": "pls listen to the people in these comments. i don’t care how determined you are to finish your work- you’re going to hate yourself and it won’t be worth it.", "author": "savannahgonzalez", "created": 1632069914, "upvotes": 1}, "hdhbrwo": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhbrwo/", "text": "As someone who has stayed up 52 before, dont fucking do it. Even 4 hours of sleep per night is better than not sleeping.", "author": "DaPurpleTurtle2", "created": 1632069810, "upvotes": 2}, "hdhaznf": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdhaznf/", "text": "Hey its unlucky that youre comments are getting downvotted. When Ive read through ur comments it seems to me that youre just being very desperate right now. Hey, I know youre not in a good spot right now, with all the work and test piling up on you, but dont hurt yourself because of it okay? Sleep is very vital for the brain to be productive. Trust me by sleeping or taking some naps in between ure studying and assignments, you'll end up being MORE productive and have better quality studying/doing assignments overall. You'll get through this just fine even if u sleep a little. It's okay.", "author": "Hefnium", "created": 1632069490, "upvotes": 12}, "hdha6fn": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdha6fn/", "text": "This is stupid. If anyone sees this, take care of your health first.\n\nBut to answer your question: very difficult - even with loads of caffeine. It's already difficult enough to pull off a 24 hour let alone 40.", "author": "SauteedAppleSauce", "created": 1632069158, "upvotes": 6}, "hdh9rfu": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh9rfu/", "text": "Look, I’ve pulled all nighters before exams and it wasn’t an issue for me personally, so I won’t tell you not to do that. I know people who have done it before and they did fine. But 40 hours? That’s way too much and you’ll be a freaking zombie by that time. Even when we did “all nighters,” we tried to take at least 1-2 hour naps.", "author": "ludgatedwyer500", "created": 1632068984, "upvotes": 2}, "hdh8gic": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh8gic/", "text": "I stayed up for about 40-48 hours and I genuinely felt like I needed to go to the ER. There is no way in hell you’re getting work done after the 24 hour mark. Also, stop prioritizing extra curricular activities. It sucks, but if you’re scheduling clubs and social hours that won’t help with your school and act as a detriment to your homework, stop. If you can’t make it, you can’t make it. I had a friend who would complain about being stressed and busy because she scheduled Friday nights as a party/social night and never worked that day. Her shit was never done on time and she pissed off everyone around her because they/we had more homework and got it done. \n\nAka, it really sucks giving up things you want to do, but sometimes you have to.", "author": "Question-asked", "created": 1632068446, "upvotes": 36}, "hdh80jw": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh80jw/", "text": "Not a good idea.", "author": "TemporaryChipmunk806", "created": 1632068264, "upvotes": 1}, "hdh7er1": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh7er1/", "text": "If you can't handle college, you shouldn't be in college. No, you can't stay awake that long. Fix your schedule, half ass some work, skip clubs but figure it out or you won't be graduating.", "author": "orangesNH", "created": 1632068009, "upvotes": 5}, "hdh5cnu": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh5cnu/", "text": "Very very bad for your brain and body. There is no chance you’ll be productive with 40 hours without sleep. I once stayed up for 48 hours and hallucinated. It can also cause psychosis. Please don’t do this and for fuck’s sake if you do DO NOT DRIVE. Driving without sleep is just as bad (maybe worse) as drunk driving.", "author": "ctrldwrdns", "created": 1632067149, "upvotes": 7}, "hdh51y2": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh51y2/", "text": "Staying up 24 hours is the equivalent to having a .1 bac. Don’t do this please. You can become psychotic", "author": "VoiceofReason541", "created": 1632067026, "upvotes": 2}, "hdh4zht": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh4zht/", "text": "mate, tbh you're wasting your time here rn instead of having this huge ass discussion just go sleep for a while. and good luck hope you get everything done cause you seem rly stressed", "author": "No-Improvement-9789", "created": 1632066998, "upvotes": 23}, "hdh4i45": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh4i45/", "text": "Don’t do it.", "author": "VoiceofReason541", "created": 1632066798, "upvotes": 2}, "hdh1p8r": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh1p8r/", "text": "Honestly based on your post history, it may be better to take a step back from school so that you can focus on your mental health.", "author": "urbanplxnet", "created": 1632065620, "upvotes": 83}, "hdh0zif": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh0zif/", "text": "Not too difficult, I managed 36 hours once in high school for a last-minute project. After a certain point you kind of catch a second wind and get this energy after being tired for several hours before. I'm not sure if that's an everybody thing or just a me thing. But then towards the end you get exhausted again and start having mini blackouts, like I'd close my eyes and 5, 10, 15 minutes would pass before I opened them again. Would definitely not recommend it unless it's for a big project that you're doing last minute, which is a situation you shouldn't get into in the first place. \n\nPerhaps try changing up your study habits, go to office hours, utilize academic counseling, etc. to be more efficient with your time. \n\nI get the whole thing with appeasing your mother, I'm Asian and there's a lot of internalized pressure to do well in school and all that, but after a certain point, you have to learn to prioritize your own well being. The purpose of existing is way beyond just pleasing your parents and taking care of them when they're elderly, no matter how many times you've been told otherwise. I've been in the place where it feels like you've failed completely and have nothing to live for just because your academics are going to shit, it's a terrible place that I hopefully won't ever be in again. I can tell you, all the lost sleep and all-nighters weren't worth it.", "author": "FamishedHippopotamus", "created": 1632065314, "upvotes": 5}, "hdh039z": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdh039z/", "text": "I take 18 hours, work a job and am a student athlete. Unless you have abysmal time management(speaking from experience) you should never have to stay up doing school work past 11 except maybe once or twice a year. Sleep is powerful, and you need it if you want to do well.", "author": "Hood15", "created": 1632064930, "upvotes": 2}, "hdgzeqs": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdgzeqs/", "text": "Sure, it’s possible, but not good for you or your work. People greatly underestimate the importance of sleep.", "author": "JupiterRocket", "created": 1632064634, "upvotes": 1}, "hdgycrp": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdgycrp/", "text": "Try it then and get back to us lol", "author": "TheStickyBandit69", "created": 1632064166, "upvotes": 1}, "hdgxarv": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdgxarv/", "text": "Based on your replies, your name really checks out", "author": "Jakek5", "created": 1632063705, "upvotes": 7}, "hdgtg9b": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdgtg9b/", "text": "Please sleep. Sleeping can and will improve your productivity so it makes no sense to lose sleep to become more productive. There are tons and tons of articles why sleep is important and the health risks of not getting it. Sure, more hours to do things but you’re quite literally killing your brain. But by reading your responses to people in this thread and other posts on different subreddits, you probably won’t care.", "author": "OwnVermicelli8193", "created": 1632062092, "upvotes": 36}, "hdggp6n": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdggp6n/", "text": "You shouldn’t do this. I’m a commuter, I’m taking 16 credits, I work at school 4-5 hours week, and a work at my other job ~15 hours a week but I still get 7-8 hours asleep a night. If you don’t get enough sleep, you will not be able to focus or study. You need to manage you’re time better & spread your work out throughout the work to prevent sleep deprivation and burn out.", "author": "denver_rose", "created": 1632055682, "upvotes": 406}, "hdgctz2": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdgctz2/", "text": "Go to sleep man. prioritize sleep.", "author": "ChickunTendies", "created": 1632053356, "upvotes": 130}, "hdg7r6u": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdg7r6u/", "text": "Is there any way to skip your class and extracurricular tomorrow? It really is not worth staying up 24 hours let alone 48. If you have to, then drink plenty of water and try to take a nap if you can.", "author": "Gahhh2018", "created": 1632049947, "upvotes": 12}, "hdg4k9w": {"link": "/r/college/comments/pr5hsk/how_hard_is_it_to_stay_up_for_a_about_40_hours_or/hdg4k9w/", "text": "It is not a good idea to do this.", "author": "GrandmaMabelGrey", "created": 1632047449, "upvotes": 454}}}