{
  "sid": "p12tmb",
  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/",
  "title:": "Classes that are nothing but textbook reading are BS",
  "text": "I was in all online classes for this past summer semester, and 2 out of 5 of my classes were nothing but textbook reading, exams on the reading, and half-assed discussion boards that the professors did not participate in. To top it off, the reading in both classes was far from engaging. The professors of the classes never reached out, emailed, or made any attempt to connect with the students. I just find this method of \"teaching\" really lazy and I like to feel engaged when I'm learning something. I understand that Covid puts a monkey wrench in everything, but 3 out of 5 of my teachers made themselves available via weekly Zoom meetings - just that little amount of effort made a huge difference in how i both regarded and performed in the classes. \n\nPlease correct me if I'm wrong, but I find this method of not teaching but essentially monitoring a class not only lazy but especially not worth the thousands of dollars I'm putting in to my schooling.",
  "author": "jaarmaar",
  "created": 1628520181,
  "over_18": false,
  "upvotes": 718,
  "upvote_ratio": 0.99,
  "comments": {
    "h8qrn0l": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8qrn0l/",
      "text": "You're absolutely right. I just finished my summer calculus course. Every week we had to watch 3-4 video lectures, complete a lab and sit for an exam. The craziest part.... the lectures were all youtube links. I kid you not. Why am I paying for youtube university?! \n\nAlso, labs were just graded on completion not correctness.",
      "author": "Ill_Ad7158",
      "created": 1628826599,
      "upvotes": 2,
      "replies": {}
    },
    "h8dsmfu": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dsmfu/",
      "text": "God I hate it when they just dump you with textbook readings. Don't be afraid to share your knowledge professors.",
      "author": "Eddie_078",
      "created": 1628577853,
      "upvotes": 2,
      "replies": {}
    },
    "h8drnrv": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8drnrv/",
      "text": "100% agree with this post.",
      "author": "wawabubbzies",
      "created": 1628577071,
      "upvotes": 1,
      "replies": {}
    },
    "h8d865u": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8d865u/",
      "text": "hahahhahahhaha literally anyone can simply assign readings and give instructions",
      "author": "SevenThirtyTrain",
      "created": 1628564466,
      "upvotes": 2,
      "replies": {}
    },
    "h8d69rs": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8d69rs/",
      "text": "I agree with you. Last year in 2020 summer term, my college offered calculus which is worth 4 credits. As a student who is taking STEM for his future studies, I willingly took it. Notice here that I was very willing to learn. However, it was the first term for my college to organize an online based program, and they ridiculously only had inquiry sessions and no teaching sessions, meaning there are only Q&A meetings with the professor on zoom and they are not supposed to teach us! Our Biology and Human Geography professor noticed the terrible idea, so he taught us during the inquiry sessions anyways, like explaining the chapter and stuff which was helpful. However, we were stuck with the math professor who we only met in inquiry sessions and taught us almost nothing. He would talk about weather and COVID in his country and then sign off. We had to do our homeworks which was really tough with no explanations, experience and being taught nothing! All we had was YouTube links that he provided. We complained the school, and that made him upload more videos and find more sources only. Overall, though I do not wish to blame the professor, I feel like the effort was very poor. I dropped math and left it behind. I'll only take it when I tranfer to the US again.",
      "author": "SaintJay41202",
      "created": 1628563487,
      "upvotes": 2,
      "replies": {}
    },
    "h8cy5k5": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cy5k5/",
      "text": "Trust me, most professors also hate this style of teaching. But we have to do it because higher education is at a stage of self-destructive competition. If I'm to offer a summer class, one with face to face format will struggle to fill, and one that's online asynchronous will fill immediately. And at the university level, if my university doesn't offer online classes, then the students will simply enroll at other places. **In this sense, online classes are actually destroying higher education.**\n\nOn the other hand, it isn't really a case of professors being lazy. The half-assed discussions you mentioned? Those are the result of semester after semester of us trying to facilitate discussions to no avail. At some point, we gave up trying to make online asynchronous classes entertaining.",
      "author": "AcademicDifficulty",
      "created": 1628559474,
      "upvotes": 6,
      "replies": {}
    },
    "h8coksv": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8coksv/",
      "text": "this is literally both of the econ classes i've taken. what's worse about econ is that many of the classes use an outside program for assignments (such as McGraw-Hill connect) that we have to pay for...",
      "author": "ble22ed",
      "created": 1628554864,
      "upvotes": 4,
      "replies": {}
    },
    "h8cm999": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cm999/",
      "text": "I'm a psych major and my internship seminar this semester was asynchronous. My professor started with recorded lectures (about 45 minutes at most), which lasted the first two weeks (of an 8 week class). There was essentially no engagement after that, no feedback on discussion posts/journal entries, and what pissed me off most is absolutely no feedback on the research topic proposal and paper outline she required, she graded them after I turned in my final paper. I felt like I was in the dark the entire semester. She had two required textbooks on the syllabus, and neither were used at any point in the semester. It was extremely frustrating and I'm glad it was my final course so I don't have to do an online course through my school ever again.",
      "author": null,
      "created": 1628553750,
      "upvotes": 3,
      "replies": {
        "h8dkzxv": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dkzxv/",
          "text": "one of my teachers is the same - none of the papers or writing assignments have been graded so i turned in my final writing after getting no feedback from her. based on my grades so far i made a B - no idea if my papers from 3 weeks ago until now will earn me an A, B, or a C in class. for a professor that offered 0 engagement, she could at least offer me some feedback but neigh.",
          "author": "jaarmaar",
          "created": 1628572094,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h8cbpb7": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cbpb7/",
      "text": "The most annoying part is these professors literally copy and paste material from probably the first online semester they did and all they do is half ass grade the homework. They’re getting paid to do nothing essentially. I just finished a public speaking class and the video lectures all talked about the presidential debates as current events. Like is it that hard to make a new video for the semester?",
      "author": "disgoesintrash",
      "created": 1628548687,
      "upvotes": 8,
      "replies": {
        "h8cis0f": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cis0f/",
          "text": "this is also what i went through. the assignment documents were dated from 2019 in one class & 2014 in the other, leading me to believe they’ve been phoning it in and just input grades at their leisure",
          "author": "jaarmaar",
          "created": 1628552047,
          "upvotes": 2,
          "replies": {}
        },
        "h8j5nin": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8j5nin/",
          "text": "Many documents for courses don't change much from semester to semester. If I'm teaching the same class in the fall that I just taught in the spring, there are very few text changes in the materials I post. The material is the same (I teach math so the material doesn't change), the assignments are the same but the dates change. What does change is the students. I spent the majority of my time with the students going through material, answering questions, helping them prep for unit tests and grading assignments. This takes a large amount of time. In fact, I typically met with students 7 days a week over the summer.\n\nIf you've never taught a class or setup materials for a class or completely designed an entire college course, you really shouldn't spout off about how easy something is or how nobody is doing anything for their job. \n\nA lot of teachers don't pay as much attention to what they post as they should because we know many of our students don't read what we post. If I had a dollar for every time I received a question from a student when the answer was posted on the syllabus and was posted on the LMS and was talked about in class, I'd have retired by now.\n\nEdit: As to another point in this sub...your in person teachers did expect you to read too. We always want you to do the reading!",
          "author": "OneDadtoRuleThemAll",
          "created": 1628688559,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h8c2es3": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8c2es3/",
      "text": "All but one of my classes are still online this semester, and of the remaining four only one is synchronous. This means another semester of bullshitting discussion posts. I hate this, why am I going $30k/yr into debt for this?",
      "author": "OFS_Razgriz",
      "created": 1628544478,
      "upvotes": 3,
      "replies": {}
    },
    "h8bzjnm": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bzjnm/",
      "text": "Depends. Yes it's annoying that some professors just give out text to read, but at the same time, u get used to it. I just wish some professors made reading more engaging with the rest of the class.",
      "author": "Oro-Lavanda",
      "created": 1628543211,
      "upvotes": 1,
      "replies": {}
    },
    "h8buwzf": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8buwzf/",
      "text": "You so right. This sounds like my class that’s about to end this week. And the worst part is you really don’t know what to study until you get the study guide, a week before one of three test. It’s dumb and feels like I learned nothing.",
      "author": "ClayDolfin",
      "created": 1628541242,
      "upvotes": 2,
      "replies": {}
    },
    "h8bowpv": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bowpv/",
      "text": "This. There is 0 reason I should have to pay $90 on top of it for a tech fee in 2021. \n\nImo the costs should be a hell of a lot less and the teachers should at least be available at office hours at least once to twice a week. Imo there should also be an open question board to help everyone. Bare minimum. Ofc there are better ways to teach and learn online, but not even expecting that there are better ways such as the mentioned to do online.",
      "author": "LPKKiller",
      "created": 1628538682,
      "upvotes": 7,
      "replies": {
        "h8bsqm5": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bsqm5/",
          "text": "Great idea about an open question board - seems like this would benefit everyone and the professor as well because then they may avoid answering the same question again and again in separate emails (at least less than usual)",
          "author": "jaarmaar",
          "created": 1628540309,
          "upvotes": 1,
          "replies": {
            "h8cgrri": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cgrri/",
              "text": "I’ve set these up before and no one used them.",
              "author": "Blackberries11",
              "created": 1628551076,
              "upvotes": 5,
              "replies": {
                "h8cj40l": {
                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cj40l/",
                  "text": "i would’ve used it.",
                  "author": "jaarmaar",
                  "created": 1628552209,
                  "upvotes": 3,
                  "replies": {
                    "h8dbq93": {
                      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dbq93/",
                      "text": "I wish more students were like you then!",
                      "author": "Blackberries11",
                      "created": 1628566414,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "h8d7jc5": {
                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8d7jc5/",
                  "text": "Yep. Same experience.\n\nEvery single idea on how to make online classes more engaging have been tried. They all sound good on paper, but all ignore one important detail: **MOST students don't actually want any engagement.**",
                  "author": "AcademicDifficulty",
                  "created": 1628564136,
                  "upvotes": 3,
                  "replies": {}
                },
                "h8dgeap": {
                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dgeap/",
                  "text": "Same here. I still get the same questions over and over (most of which were answered in the syllabus for those who would take 15 minutes just to read it). There really needs to be a way to split the engaged students who want these things from the minimal effort students who couldn’t care less.",
                  "author": "PhDapper",
                  "created": 1628569122,
                  "upvotes": 1,
                  "replies": {
                    "h8ffn1u": {
                      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8ffn1u/",
                      "text": "Office hours tends to do that I think. The engaged people come and the others don’t.",
                      "author": "Blackberries11",
                      "created": 1628613827,
                      "upvotes": 1,
                      "replies": {
                        "h8fiaac": {
                          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8fiaac/",
                          "text": "I’d be in trouble, then - no one ever comes to my office hours :( I like to think I’m approachable, and I’d like to think that it’s because I’m just so fantastic at the teaching part of my job that no one ever has any questions, but I feel like it’s more senioritis than anything else (I have mostly seniors about to graduate).",
                          "author": "PhDapper",
                          "created": 1628614925,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h8bgey4": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bgey4/",
      "text": "At least with books, your not wading through hours of poorly recorded video nested in multi-gb PowerPoints, buried in lists of stuff to download. I am so tired of virus infested luddites pooping out every passing thought as a complex lecture with Easter eggs for test answers. There's always a happy medium, but a lot of professors are just as disenchanted with their life choices as we are.",
      "author": "SemanticBattle",
      "created": 1628535087,
      "upvotes": 12,
      "replies": {
        "h8bi12l": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bi12l/",
          "text": "good point!",
          "author": "jaarmaar",
          "created": 1628535765,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h8besc4": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8besc4/",
      "text": "Ex-squeeze me, you took five summer classes? You crazy bastard, gotta admire that level of dedication.",
      "author": null,
      "created": 1628534401,
      "upvotes": 30,
      "replies": {
        "h8bjq64": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bjq64/",
          "text": "Thank you! I'm just trying to finish, dammit!!",
          "author": "jaarmaar",
          "created": 1628536484,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "h8bde2y": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bde2y/",
      "text": "My favorite class this past semester was one where the professor actually recorded a lecture for each section and then had exams partially on her lectures as well. It was refreshing in an online environment and actually made me feel I was using my brain instead of just blindly playing Q&A with the textbook.",
      "author": "GoStars817",
      "created": 1628533814,
      "upvotes": 25,
      "replies": {
        "h8bjxi5": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bjxi5/",
          "text": "that's how my favorite professor did her class this semester - she had reading and lecture that went along with reading and she made it so that it wasn't just copying a powerpoint, you had to listen. I really appreciated it.",
          "author": "jaarmaar",
          "created": 1628536570,
          "upvotes": 6,
          "replies": {
            "h8celv5": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8celv5/",
              "text": "that's how I prefer classes to be taught. my favorite history professor did them that way, very lecture heavy and the lectures were actually fun and interesting.",
              "author": "darkin888",
              "created": 1628550049,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h8cq4ym": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cq4ym/",
          "text": "I had an asynch course last semester of a similar nature. It was an introductory level course in terms of the depth we went into but the exams were entirely based on our powerpoint + commentary lectures. The professor recommended a textbook if we wanted to learn more about the field but she also made it very clear that if we used any information outside of our lectures in the online writing prompts, we would be getting a zero for the points that question was worth.",
          "author": "nanotech23",
          "created": 1628555621,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h8bdbs9": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bdbs9/",
      "text": "This is college, not high school.",
      "author": "JosephMichael023",
      "created": 1628533789,
      "upvotes": -12,
      "replies": {
        "h8bjoc1": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bjoc1/",
          "text": "I'm in my 4th year of college and this was my first semester of all-online due to Covid. When I had in-person classes before the pandemic, never once did the professor expect us to read the text book and then do nothing during class time. Class time was used for discussion or lecture regarding the reading. So what bothers me is that now these classes are reduced to nothing more than reading and testing. You're entitled to your opinion, and I'm entitled to give those professors honest feedback on their course evaluations about what i didn't like about their performance, or lack there-of",
          "author": "jaarmaar",
          "created": 1628536463,
          "upvotes": 10,
          "replies": {
            "h8j7qku": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8j7qku/",
              "text": "When you had classes before the pandemic, they were in person, lecture based classes. Now they were probably asynchronous, online classes. Those are different modalities. Asynchronous classes have no meeting or discussion times and are often what online students are looking for. That gives them the most flexibility if they have variable schedules. It sounds like you were looking for a synchronous online class. Those are online classes with regular meeting times. Your school may not have offered those. There are a lot of technological issues with running those depending on the type of school you're at. \n\nI always appreciate feedback that will help improve my courses, but the feedback needs to be consistent with the type of class I was teaching, not the kind of class you wanted me to teach. That kind of feedback should go to the administrators of the school because often they are the ones that decide what the school offers. Your teacher may not even like the modality they were teaching with but was required to do it by the school. \n\nIt's good to remember that the pandemic affected teachers as well. Some are doing their best online with little preperation or support from their schools and are just as frustrated as students. Like students, teachers that had never previously been online were forced to do it online by the pandemic.",
              "author": "OneDadtoRuleThemAll",
              "created": 1628689587,
              "upvotes": 2,
              "replies": {}
            },
            "h8dms4n": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dms4n/",
              "text": "It’s still college; why are you so shocked at the level of independence expected from you, especially for an online class? And im confused, online classes are different from  in-person classes, so of course expectations will also be different. Go ahead and write your comments, im sure your professor and their dean agrees with my opinion more than yours.",
              "author": "JosephMichael023",
              "created": 1628573359,
              "upvotes": 0,
              "replies": {
                "h8ei0h8": {
                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8ei0h8/",
                  "text": "ok, guy.",
                  "author": "jaarmaar",
                  "created": 1628598375,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h8b9eat": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8b9eat/",
      "text": "If it is an Asynchronous class then there is no meeting.  When I have tried to hold a regular weekly meeting at a set time, perhaps 5 students out of 100 turn up and even then it is 1 or 2 students asking the questions.\n\nI am also willing to meet students for Office Hours at a time that suits them and me - again perhaps 2 or 3 students out of 100 are interested enough to ask to meet with me.\n\nI would be more than willing to meet with students but those who sign up for Asynchronous classes appear to have little interest in meeting with me.\n\nEdit: I do send out a weekly Announcement but based on some of the emails I receive students do not read them.",
      "author": "SlightScholar1",
      "created": 1628532123,
      "upvotes": 50,
      "replies": {
        "h8bnfd6": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bnfd6/",
          "text": "What are office hours exactly? I’ve heard people mention it but I don’t know what it is. I’m an upcoming freshman",
          "author": "joiseren",
          "created": 1628538053,
          "upvotes": 12,
          "replies": {
            "h8bp2tk": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bp2tk/",
              "text": "Basically it's a time where you meet with a prof, and ask any qs you need asking",
              "author": "fernanflow707",
              "created": 1628538757,
              "upvotes": 12,
              "replies": {}
            },
            "h8bq3of": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bq3of/",
              "text": "It's a good time to meet up with a professor for extra help with coursework. If there is a topic you're not understanding, it can be easier to ask during office hours where there is fewer people/instruction not going on.",
              "author": "SnowySheep9",
              "created": 1628539193,
              "upvotes": 9,
              "replies": {}
            },
            "h8bq7kk": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bq7kk/",
              "text": "Office hours, or sometimes called drop in hours or students hours (there is a push to change to name) is basically a time the professor has set aside to be in thier office for students to come in and ask questions, talk about the class etc. It can be for help woth things you don't understand OR to talk deeper about the material then may be appropriate during the lecture. Depending on the professor you can also just come chill, some professors aren't as cool with that though",
              "author": "potterMathWho",
              "created": 1628539240,
              "upvotes": 4,
              "replies": {}
            },
            "h8d7a4f": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8d7a4f/",
              "text": "Professors will set certain times every week to meet with students. You can simply walk into our offices to talk to us, no prior notice required.",
              "author": "AcademicDifficulty",
              "created": 1628564008,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h8bhz1d": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bhz1d/",
          "text": "For what its worth, I'm those students that would want to meet with you. Students like me really appreciate your effort!",
          "author": "jaarmaar",
          "created": 1628535742,
          "upvotes": 6,
          "replies": {
            "h8c086j": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8c086j/",
              "text": "From a professor's perspective, students like you also make it worth the effort. There is nothing more frustrating than setting aside time to help people and having nobody show up.",
              "author": "SpectrumDiva",
              "created": 1628543516,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "h8cgey7": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cgey7/",
          "text": "Hey, async student here, I work a full time job and we have an infant Ave other obligations. Just getting the work done can be difficult at times but I always email when I need to reach out.",
          "author": "whathaveyoudoneson",
          "created": 1628550906,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h8alyd2": {
      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8alyd2/",
      "text": "You’re absolutely right from my perspective. People absolutely have to read as part of education - it has so many benefits that lecture alone can’t provide - but near-total lack of contact is not helpful. When I teach asynchronous course, I always send out 2-3 announcements per week and have a few “town hall” meetings throughout the semester because that line of communication needs to be open. Hardly anyone ever reciprocates, which is a separate issue, but for those who are looking for more than the bare minimum, those touchpoints are helpful.",
      "author": "PhDapper",
      "created": 1628522149,
      "upvotes": 183,
      "replies": {
        "h8b3clp": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8b3clp/",
          "text": "Thank you for your perspective! You sound like my political science teacher this semester who was EXCELLENT and hands-on and overall i really loved her class.",
          "author": "jaarmaar",
          "created": 1628529593,
          "upvotes": 46,
          "replies": {
            "h8bdgbn": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bdgbn/",
              "text": "Professors aren’t teachers; being a professor/instructor is not the same as being a teacher. Theyre different positions. It’s like calling a LVN an RN, just cause they both work in the medical field. (Or calling the tech a nurse.)",
              "author": "JosephMichael023",
              "created": 1628533841,
              "upvotes": -52,
              "replies": {
                "h8btzum": {
                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8btzum/",
                  "text": "why are you being such a stickler for title… it literally doesn’t matter at all, like at ALL.",
                  "author": "tacticalcop",
                  "created": 1628540840,
                  "upvotes": 26,
                  "replies": {
                    "h8dlur0": {
                      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dlur0/",
                      "text": "We live in the age of people getting offended over pronouns. Why’s it hard to use the correct title? I know professors who dont like being called a teacher, as they worked to earn their title. Nothing wrong with using the correct wording if people are expected to use correct pronouns.",
                      "author": "JosephMichael023",
                      "created": 1628572698,
                      "upvotes": -6,
                      "replies": {
                        "h8dn7ab": {
                          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dn7ab/",
                          "text": "> We live in the age of people getting offended over pronouns\n\nOh shut the fuck up.",
                          "author": "JojiTX",
                          "created": 1628573662,
                          "upvotes": 7,
                          "replies": {
                            "h8edku8": {
                              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8edku8/",
                              "text": "No, not until people stop calling professors/instructors “teachers.” Dont be a hypocrite; why does one set of labels matter more than the other?\n\nIf you cant have a civil discussion, take your own advice, friend.\n\nBtw, it’s, “Oh,* shut the fuck up.” I hope you get your college degree.",
                              "author": "JosephMichael023",
                              "created": 1628595544,
                              "upvotes": -3,
                              "replies": {
                                "h8etqvq": {
                                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8etqvq/",
                                  "text": "You're one of *those* people",
                                  "author": "BenignRaccoon",
                                  "created": 1628604425,
                                  "upvotes": 2,
                                  "replies": {}
                                },
                                "h8ga2e3": {
                                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8ga2e3/",
                                  "text": "The funniest crap is that you're so obsessed with getting labels correct and yet you fail to realize that MOST \"PROFESSORS\" ARE ACTUALLY LECTURERS to begin with...\n\nGet your head out of your ass, nobody agrees with you, period.",
                                  "author": "JojiTX",
                                  "created": 1628626650,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "h8dmwa6": {
                          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dmwa6/",
                          "text": "what’s with you and pronouns? you’ve mentioned them more than once, weird. to instruct is to teach, just petty semantics. it truly does not matter, get a grip.",
                          "author": "tacticalcop",
                          "created": 1628573442,
                          "upvotes": 4,
                          "replies": {
                            "h8dnb0y": {
                              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dnb0y/",
                              "text": "Right? And most \"professors\" are actually lecturers anyway, which is very similar to teachers.",
                              "author": "JojiTX",
                              "created": 1628573736,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "h8dn6hw": {
                              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dn6hw/",
                              "text": "It’s a two way street. If people get gung ho over pronouns, then what’s wrong with getting gung ho over a title one worked to achieve? Becoming an instructor/professor requires at least 6 years of higher ed, and they higher ed is a different beast to general ed (where treachers work).\n\nI just like to be proper and use the pronoun argument as a way to make people view their own hypocrisy. Students demand that the correct pronoun be used, then i think it’s fine for professors to ask for the correct title to be used, too.",
                              "author": "JosephMichael023",
                              "created": 1628573646,
                              "upvotes": 0,
                              "replies": {
                                "h8dne7s": {
                                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dne7s/",
                                  "text": "because pronouns are a given. they are apart of your identity and personhood. professor and teacher are career titles. you can choose your career and change it however you please.\n\nif you want to debate pronouns, go somewhere else. you haven’t made a single good argument about why it’s so wrong to call a professor a teacher. has a teacher hurt you in some way? did your 8th grade math teacher fail you in class? i’m confused",
                                  "author": "tacticalcop",
                                  "created": 1628573802,
                                  "upvotes": 1,
                                  "replies": {
                                    "h8dnmkg": {
                                      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dnmkg/",
                                      "text": "I shouldn’t have to debate anything, it’s literally in the job title. No one with a label or position of “teacher” works in any college setting, at least not in America (adult ed is not higher ed; that’s different). Those who teach higher ed are instructors/professors.\n\nIt’s like me choosing to call all doctors “nurses.”",
                                      "author": "JosephMichael023",
                                      "created": 1628573975,
                                      "upvotes": 2,
                                      "replies": {
                                        "h8dnsfw": {
                                          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dnsfw/",
                                          "text": "it’s not the same. it just isn’t. if you can’t turn the rusty gears in your head enough to understand how calling a professor a teacher is not armageddon, this is the end of this riveting conversation.",
                                          "author": "tacticalcop",
                                          "created": 1628574093,
                                          "upvotes": 1,
                                          "replies": {
                                            "h8edg1j": {
                                              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8edg1j/",
                                              "text": "Im just talking about the title, friend. Professors/instructors aren’t teachers. That’s all i’m saying.",
                                              "author": "JosephMichael023",
                                              "created": 1628595452,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "h8be2l2": {
                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8be2l2/",
                  "text": "you’re saying it doesn’t fall under a professor’s job description to make contact with their students?",
                  "author": "jaarmaar",
                  "created": 1628534101,
                  "upvotes": 21,
                  "replies": {
                    "h8beyx7": {
                      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8beyx7/",
                      "text": "Im taking about their title; you called them a political science teacher, but there are no teachers in college, they’re a professor/instructor.\n\nIf one wants professor’s to be respectful of pronouns and labels, then it goes both ways, no? Im just talking about the label, too, not the duty differences.",
                      "author": "JosephMichael023",
                      "created": 1628534485,
                      "upvotes": -41,
                      "replies": {
                        "h8bhw0s": {
                          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bhw0s/",
                          "text": "... okay my bad you're right she's a professor...",
                          "author": "jaarmaar",
                          "created": 1628535706,
                          "upvotes": 20,
                          "replies": {
                            "h8bnwxc": {
                              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bnwxc/",
                              "text": "Dude don't worry lol. Teachers need to have masters and certs in my area, instructors can have an associates and experience in their field, the profs will probably not mind. Definitely address a Dr as Dr though, forgetting that can piss them off- I've only seen a few incels do that to female profs. \n\nI have only met two adjuncts who cared enough to be offended to be referred to as teacher, and both were misrepresenting their positions/creds",
                              "author": "neverfakemaplesyrup",
                              "created": 1628538257,
                              "upvotes": 9,
                              "replies": {
                                "h8dm0dk": {
                                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dm0dk/",
                                  "text": "Where do you live that teachers need an MA? In America, teachers only need their BA and a teaching credential. Someone with a MA is an instructor/professor (depending on the college) and someone with a PhD is a Dr./professor.\n\nThe info you gave the OP is incorrect if you’re talking about education in America. For general ed, an MA is only mandated for more affluent public schools and certain private schools, and even then, their title is still one of teacher, not instructor/professor, as they’re working in general ed. \n\nTo reiterate, in America, no instructor only has their BA (equivalency being an outlier, and needed when an MA/PhD is missing), and no instructor only has their AA.\n\nu/neverfakemaplesyrup may be providing misinformation.\n\nEdit:\n\nThey never got back to me; for sure u/neverfakemaplesyrup was lying, or being dishonest about their knowledge on the subject matter.",
                                  "author": "JosephMichael023",
                                  "created": 1628572807,
                                  "upvotes": 0,
                                  "replies": {}
                                },
                                "h8dfi6j": {
                                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dfi6j/",
                                  "text": " Only professors with Phds are addressed as Dr.\n\nMost are not Phds. They have masters/graduate  degrees. But in my entire college career I've had one PhD. Professor.",
                                  "author": "anickel120",
                                  "created": 1628568583,
                                  "upvotes": 1,
                                  "replies": {
                                    "h8dletv": {
                                      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dletv/",
                                      "text": "Yeah same and the one I did have didn't care about being called Dr. So-and-so.",
                                      "author": "toofeduptocare",
                                      "created": 1628572383,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "h8dl7x4": {
                                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8dl7x4/",
                                  "text": "I've never even seen a professor get mad about being called Mr./Mrs. over Dr.",
                                  "author": "toofeduptocare",
                                  "created": 1628572249,
                                  "upvotes": 1,
                                  "replies": {
                                    "h8ejtmn": {
                                      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8ejtmn/",
                                      "text": "They mostly dont say anything, cause look at the responses here. Professors/instructors never introduce themselves as Mr./Ms. They do that for a reason.",
                                      "author": "JosephMichael023",
                                      "created": 1628599413,
                                      "upvotes": 2,
                                      "replies": {
                                        "h8g85oc": {
                                          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8g85oc/",
                                          "text": "Idk...all of mine introduced themselves as Mr./Mrs. Only a handful of them could have actually gone by doctor but even then, they just simply chose not to. Maybe the difference lies within the fact that I am in CC right now rather than an actual 4-year University.",
                                          "author": "toofeduptocare",
                                          "created": 1628625838,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "h8cc1rr": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8cc1rr/",
          "text": "I personally never participated in the class meets / town halls because the whole reason I took async was due to work. The town halls were always in the middle of my work day. That said, I still go back and watch the recording when professors actually upload them and I find them very helpful. But few of my professors have actually gone through the effort to upload them.",
          "author": "disgoesintrash",
          "created": 1628548849,
          "upvotes": 6,
          "replies": {}
        },
        "h8bxkcg": {
          "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bxkcg/",
          "text": "You really don't need to read tho. I graduated and barely read more than 50 pages",
          "author": "Mused2Perform",
          "created": 1628542356,
          "upvotes": -14,
          "replies": {
            "h8bze3e": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8bze3e/",
              "text": "Can you skate by with not reading? Sure, especially if the courses aren’t built around expecting people to deeply engage with text outside of class. Will you get a lot more out of your education by reading? Hell yes.",
              "author": "PhDapper",
              "created": 1628543140,
              "upvotes": 14,
              "replies": {
                "h8ge4if": {
                  "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8ge4if/",
                  "text": "That's incredibly different than what you just said. \"People absolutely have to read as part of education\" followed with essentially \"people can skate by with not reading\". So which is it? And how are you refuting what I just said?",
                  "author": "Mused2Perform",
                  "created": 1628628381,
                  "upvotes": 0,
                  "replies": {
                    "h8gerq6": {
                      "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8gerq6/",
                      "text": "Getting a good education and skating by are different things, but people can still graduate doing either. Skating by would be putting in less effort than you really should to engage with material but being able to pass (or, in easy A courses, getting high grades). I’m not trying to refute what you said. I’m just adding to it. If your goal is to get a piece of paper, you can avoid reading and still do that. If your goal is to really grow your mind, reading is essential to that process.",
                      "author": "PhDapper",
                      "created": 1628628654,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h8ex3kh": {
              "link": "/r/college/comments/p12tmb/classes_that_are_nothing_but_textbook_reading_are/h8ex3kh/",
              "text": "What career?",
              "author": "coldblade2000",
              "created": 1628605933,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634056150
}