{"sid": "jnz0fb", "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/", "title:": "Professor deducted points for handwriting a homework assignment", "text": "I was assigned a homework assignment for one of my computing logic classes. The instructions simply said questions 1-6 on this page of the textbook. There was no rubric or anything. I did the assignment by hand (my handwriting is not messy, so I know legibility is not as issue) and submitted it on time. I spent a lot of time studying for this and I didn’t miss a single question. However, I got a B because the assignment was “unprofessional” for being hand written. This was the first project of the year so there was not an expectation set beforehand in previous assignments. Would it be unreasonable to reach out to the professor and ask if the assignment can be redone (typed out of course)?\n\nEdit: for those of you asking, there is not any mention of formatting in the syllabus or assignment. His message said that it must be done in a word document. I sent him a message stating that I was not aware of this requirement and asked if I could re-do the assignment. I am still waiting on a response.", "author": "swisscheesepanini", "created": 1604504939, "retrieved": 1632947434, "over_18": false, "upvotes": 942, "upvote_ratio": 0.99, "comments": {"gb6tutn": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6tutn/", "text": "I had a professor tell me that you should always do assignments on the computer, as it's more professional, but if the professor didn't state it as a requirement I don't think he should take off point. You did what you could by asking to redo it, but if your professor is stubborn you may have to take it above him if it really affects your grade.", "author": "agentpjr", "created": 1604545297, "upvotes": 1}, "gb6pols": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6pols/", "text": "If its not in the syllabus its unacceptable that he’s now making it a requirement.", "author": "deprimada", "created": 1604543080, "upvotes": 1}, "gb6idi3": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6idi3/", "text": "My sense is that you probably should have waited until after your instructor wrote back.  What's the point of posting a half-story?", "author": "imjustsayin314", "created": 1604539234, "upvotes": -1}, "gb6efmd": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6efmd/", "text": "Ask him change the grade to a an A. Because  no where did it say in the syllabus that homework has to be done in a word document. \n\nIf he says no, go to the dean.  If he does not get back to you on within a reasonable time frame, go to the dean.  The dean will side with you.", "author": "gunzstri", "created": 1604537140, "upvotes": -1}, "gb6daed": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6daed/", "text": "Lol, I don't have any advice to add, other than I find this HILARIOUS considering the chemistry professor I had--only a few years ago--insisted all lab reports be turned in hand written because in the \"real world\" computers are not used in the lab. Jokes on her, I now work in a lab that is paperless!", "author": "Etarine", "created": 1604536539, "upvotes": 5}, "gb6af4x": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6af4x/", "text": "For anything about computing, a typed up assignment is expected. Sometimes they make an exception, but this is a default.\n\nAs for Discrete mathematics and logic, you may see it as a borderline, but if it's not a situation where you show calculations work, but rather computed work, it should always be typed. Sometimes for concepts like truth tables, this can be annoying. \n\nSometimes it can be a pain, but realistically, no one wants to see a photo or scan of written work unless it specifically needs to be, such as for traditional math, where mandating typed up documents would be absurd if it weren't a project. Projects need to be professional and organized, and tools like Microsoft Word have math functionalities as clunky as they may feel.\n\nBecause it wasn't specified for your situation, your professor should be generous and allow you to type it up. Note they don't want extra things to grade, so they might turn you down. If this was a large portion of your grade, you should consider going higher up if the professor doesn't reason with you.", "author": "AzrielK", "created": 1604535031, "upvotes": 1}, "gb65v3u": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb65v3u/", "text": "check on the syllabus if it ever said or if he said no handwriting in the class at all.\n\nif he/she had said it for one assignment then its assumed the rest of the class will be that way.\n\nif you truly do not see or heard anything about no handwriting then you should take it up to the prof and ask for some slack", "author": "nick256", "created": 1604532657, "upvotes": 2}, "gb64v6s": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb64v6s/", "text": "It’s dumb. If it’s not in any pdf like the actual assignment or syllabus, then I can only assume that he may have mentioned in a lecture. Either way tho, points shouldn’t be deducted. But double check your emails, assignment description, and syllabus", "author": "Gaminguitarist", "created": 1604532151, "upvotes": 2}, "gb604fe": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb604fe/", "text": "@swisscheesepanini email your dean explain to them the situation and send them an attached syllabus for the course if your dean doesn’t die anything send them another email stating you will email the department head", "author": "funkobop", "created": 1604529735, "upvotes": 0}, "gb5pm01": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5pm01/", "text": "I don’t think it’d be unreasonable. Unless I’m writing an essay, I do any work I can by hand", "author": "ChriSayre01", "created": 1604524695, "upvotes": 1}, "gb5gn0l": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5gn0l/", "text": "If this professor won’t let you redo it, I think he’s got personal problems to work out", "author": "BillyRayCyrusIII", "created": 1604520480, "upvotes": 3}, "gb5gksp": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5gksp/", "text": "Professor here. You did the right thing by emailing them about it. Something like that should be indicated in the syllabus or instructions. If it's not in the syllabus or instructions then it's not your fault for not knowing. But, keep in mind that in general professors will expect you to type things up. If they don't specify, either ask them or err on the side of caution and type your assignments.", "author": "Imtheprofessordammit", "created": 1604520452, "upvotes": 18}, "gb5esps": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5esps/", "text": "It definitely should have said that in the syllabus. If not I would talk to the professor as others have said. I would read the professor though. It may be easier to take the loss. It's not something worth starting off with a bad impression.  For future reference though, I've never had a professor that allowed handwritten assignments, unless it was an in class activity. By rule you should always type it, as he/she is right that it is seen as unprofessional to handwrite anything. I'm surprised they honestly let you do that even in highschool. Mine at least taught me you have to type in college and I graduated HS in 2011....\n\nUse your intuition. Some professors will jump to work with you, and others give no leeway.", "author": "kelsybobelsy", "created": 1604519612, "upvotes": 2}, "gb5ds5p": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5ds5p/", "text": "The professor was the one being unprofessional. Instead of communicating with you, they brought your grade down.", "author": "Best_Bisexual", "created": 1604519146, "upvotes": 2}, "gb5ch5g": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5ch5g/", "text": "Personally I just think you should go to whoever is in charge of them because that's not okay", "author": "Night99Wing", "created": 1604518537, "upvotes": 0}, "gb59m07": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb59m07/", "text": "I think most university work, if not all, is expected to be submitted in a typed format like APA, MLA, or Turabian; however, your professor should have clearly stated his expectations. If I were in your shoes, I would ask for a rubric before I complete assignments. Hopefully, he will cut you some slack this time because he did not define his expectations!", "author": "magnolias4lyfe", "created": 1604517181, "upvotes": 9}, "gb594hs": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb594hs/", "text": "If there’s no rubric or anything in the syllabus that states you can’t hand write things, then I’d definitely email them. It’s not fair that they deducted points without you knowing beforehand that handwriting is something “unprofessional.”", "author": "QueenLatifahClone", "created": 1604516949, "upvotes": 3}, "gb58ot1": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb58ot1/", "text": "That’s ridiculous! If u can scan it in there shouldn’t be a problem.... I would take it to the dean.", "author": "Hawkbiitt", "created": 1604516742, "upvotes": -2}, "gb54x3j": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb54x3j/", "text": "Definitely check the syllabus first. Read it through and make sure it doesn't have submission guidelines or something like that that prohibits handwritten assignments. If you don't see anything like that, definitely reach out to your teacher. If you do reach out, make sure you are extra professional and concise in your email (since that obviously matters a lot to this professor) and ask if you can re-submit due to the confusion. Whatever you do, don't be rude, even if you are upset.", "author": "althyastar", "created": 1604514996, "upvotes": 3}, "gb51o5v": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb51o5v/", "text": "Oh I’d definitely push back. Be your own advocate.", "author": null, "created": 1604513485, "upvotes": 4}, "gb5148h": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5148h/", "text": "Op What does your syllabus say? many times professors will place requirements for assignments in the syllabus that are the status quo for the class. However, if the syllabus is silent in that regard I would reach out to the professor and ask/nicely demand your grade to be change as no written instructions exist detailing how the assignment would be done. However, triple check all the resources the class has given out before hand as you want to be sure when confronting the professor and brushing up on the school's policy for grad disputes could come in handy.", "author": "Xeracross", "created": 1604513228, "upvotes": 40}, "gb4w6vx": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4w6vx/", "text": "That seems odd to be deducted for something like that. He should have at least said next time don’t do it that way but gave you a fair grade. I would take a look at the syllabus for that class before emailing them because for one of my classes our syllabus actually says something along the lines of not handwriting our things out and uploading a picture of it. I had never seen it in a syllabus before and just thought it was odd. But I would take a look just to see if maybe your syllabus says something similar.", "author": "abrumm94", "created": 1604510947, "upvotes": 124}, "gb4m3nk": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4m3nk/", "text": "My discrete math professor wanted all our work done in word. It’s hard to do math in word. The assignments took twice as long just so he wouldn’t be inconvenienced by having to read our handwriting. It’s annoying as heck. \n\nI think he should have told you upfront. Id definitely ask", "author": null, "created": 1604506217, "upvotes": 666}, "gb4josr": {"link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4josr/", "text": "It doesn’t hurt to ask!", "author": "whompwhooooomp", "created": 1604505060, "upvotes": 47}}}