{
  "sid": "qqvo5u",
  "link": "/r/college/comments/qqvo5u/thoughts_on_posting_internship_on_linkedin/",
  "title:": "Thoughts on posting internship on LinkedIn?",
  "text": "So I'm in my third year of college and just accepted an internship offer that I'm super excited about. I've seen a lot of people update their LinkedIn with posts about accepting internships and was wondering what the thoughts were on this Sub",
  "author": "mp48",
  "created": 1636554593,
  "updated": 1636655156,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hk2r2cd": {
      "link": "/r/college/comments/qqvo5u/thoughts_on_posting_internship_on_linkedin/hk2r2cd/",
      "text": "Congrats!!\n\nMe personally, I find it's very important to keep a low profile on LinkedIn. I have never posted about any internship I've accepted, and I don't even add it to my experience section until I'm a month into it. An easy way to differentiate yourself on LinkedIn is to make your profile look humble and let your experiences speak for themselves. It's easy for people to post on their profiles with \"I JUST GOT ACCEPTED TO \\[insert company here\\] FOR AN INTERNSHIP!!!\" I don't think it's professional to brag too much, especially when you know that other companies are seeing your profile. I would hate for someone to lose an internship they just accepted over a social media post.\n\nIf you're confident that the internship will work out, and you still want to post, I recommend acknowledging anyone who helped you get that internship in your post. I understand I might have a hot take, but LinkedIn is basically Facebook for business, and not everyone on there is professional.",
      "author": "enriqueg9031",
      "created": 1636557304,
      "upvotes": 4,
      "replies": {}
    },
    "hk2z0g7": {
      "link": "/r/college/comments/qqvo5u/thoughts_on_posting_internship_on_linkedin/hk2z0g7/",
      "text": "Put it in your Linked in. Say its an internship all the experience you have under your belt matters. Anything to differentiate you from the next guy.",
      "author": "cheesynachoman",
      "created": 1636560472,
      "upvotes": 0,
      "replies": {}
    }
  }
}