{
  "sid": "qfbpkt",
  "link": "/r/college/comments/qfbpkt/how_to_email_professor_about_accusations_of/",
  "title:": "How to email professor about accusations of plagiarism?",
  "text": "So in short, I received a 0 on a big assignment because I had “some plagiarism” in it. I did not plagiarize and did everything honestly. The turn it in score is 26 percent. It’s an annotated bibliography so I cited many things. The professor asked me to email him about it. Truth is i don’t know what to say. I don’t really wanna make any excuses and say that the professor judged the assignment wrong because that never works. I also don’t want to accept the plagiarism accusation because I truly did everything honestly. How do I go about this for the best result?",
  "author": "governorlight",
  "created": 1635148365,
  "updated": 1635184189,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhyny2b": {
      "link": "/r/college/comments/qfbpkt/how_to_email_professor_about_accusations_of/hhyny2b/",
      "text": "TurnItIn explicitly says which lines are plagiarized from what source. So in your report go from highlighted part to highlighted part saying “TurnItIn flagged X, however it was quoted from source Y in the bibliography”. Also anything cited you can just remove from the essay temporarily and if you reupload with the same word count (just add blocks of “blah” where you removed cited material but keep word count the same) you can prove whatever is written is purely yours. That’s what I would do in your position at least",
      "author": "harry01772",
      "created": 1635149142,
      "upvotes": 2,
      "replies": {}
    },
    "hhyoemn": {
      "link": "/r/college/comments/qfbpkt/how_to_email_professor_about_accusations_of/hhyoemn/",
      "text": "Be honest and say you didn’t plagiarize. Ask him what parts of the assignment he is accusing you of plagiarizing.",
      "author": "kizeltine",
      "created": 1635149576,
      "upvotes": 2,
      "replies": {}
    },
    "hhzyohu": {
      "link": "/r/college/comments/qfbpkt/how_to_email_professor_about_accusations_of/hhzyohu/",
      "text": "Only state facts. Make no excuses. Explain how you produced your assignment Ex. \"I went to the library on Saturday and read these books.\" Rather than make accusations, ask for explanations. Overall keep a calm, composted tone and an attitude that you want learn from this experience to do better in class.",
      "author": "hdorsettcase",
      "created": 1635177515,
      "upvotes": 1,
      "replies": {}
    }
  }
}