{
  "sid": "qfcwsk",
  "link": "/r/college/comments/qfcwsk/hey_guys_need_a_little_help/",
  "title:": "Hey guys. Need a little help.",
  "text": "So im attending community college at the moment. First semester. I got through my first week of classes no problem but the weekend afterwards, i came down with covid so i ended up missing about two weeks. Went back to classes for another few weeks, then got my first covid vax. Two days later i started vomiting profusely. Little background on that, i have a really fucked up stomach/esophagus condition that flairs up for extended periods of time every once in a while causing and lot of pain, vomiting, nausea, etc. So shortly after getting the vax, i went into a flair up with this condition. I started running out of my classes to go throw up and eventually wasnt able to leave my house during the times of my classes because i couldnt stop throwing up or having intense pain. This has been going for a couple of weeks now and in turn i have barely been to any of my classes. my professors know whats going on but i havent heard anything new from any of them basically since i told them. They were all very supportive in the beginning, making sure i was okay and if i needed anything, and now i got nothing. My stomach is slowly starting to calm down but i have not returned to classes yet. Most of my professors have a strict policy of two absences a semester which i have clearly blown out of the water. So i just dont know what to do. I think im going to fail out of all of these classes due to all of this. Im getting financial aid for these classes too so if i fail them, my aid gets pulled and in turn my life crumbles away as a 9-5 laborer. Does anyone have any idea about what i should do because ive found myself in a really deep hole with seemingly no way to get out…",
  "author": "Complete-Television3",
  "created": 1635154136,
  "updated": 1635184174,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhyxf6m": {
      "link": "/r/college/comments/qfcwsk/hey_guys_need_a_little_help/hhyxf6m/",
      "text": "Talk to your professors and see if they are willing to make an exception if you get a doctor's note or something. Otherwise, you might just have to take a W for all of these classes. It does mean that tuition just kind of went down the drain, but it preserves your GPA. My wife had to do this for several semesters for a hard to diagnose medical condition and while it sucks that she paid for 3 or 4 semesters of college that she didn't get credit for, it was better than flunking out.",
      "author": "Thelton26",
      "created": 1635157692,
      "upvotes": 1,
      "replies": {}
    },
    "hhz8s0e": {
      "link": "/r/college/comments/qfcwsk/hey_guys_need_a_little_help/hhz8s0e/",
      "text": "Have you contacted student disability services?",
      "author": "Katherington",
      "created": 1635165554,
      "upvotes": 1,
      "replies": {}
    }
  }
}