{
  "sid": "qw8c6u",
  "link": "/r/college/comments/qw8c6u/past_due_work_and_assignments_because_of_ed_dont/",
  "title:": "Past due work and assignments because of ED, don't know how to address it with professors",
  "text": "Trigger warning: ED mentions\n\nI've been struggling with an ED ever since this summer, and it's taken a toll on my physical and mental health. I've had a couple of visits to the hospital, and all of this started happening right around the beginning of fall semester. I haven't been attentive with school because of it and the academic guilt is fucking killing me. i'm so depressed, and so sickly, but i know i have to get the work done, but i just don't get it done. i have 4 essays, 3 projects, and other assignments due by next month.. which means i have less than a month to do it. god, it seems so impossible. but, i have no choice. does anyone have any advice for me? I'm in such a rough patch right now and i care a lot about my future, but my disorder is getting in the way of everything.",
  "author": "hitinah",
  "created": 1637181305,
  "updated": 1637387878,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hl18ixz": {
      "link": "/r/college/comments/qw8c6u/past_due_work_and_assignments_because_of_ed_dont/hl18ixz/",
      "text": "First, I’m so sorry to hear about your struggles and hope things get better.\n\nYou need to reach out to your dean of students for formal documentation and advocacy. Professors are likely to sympathetic to your issue but really can’t do anything without formal documentation and/or accommodations. It may be that you need to initiate a medical withdrawal, especially if you are so far behind that you wouldn’t be able to get caught up. If that’s the case, then you would still need to go through those proper channels.",
      "author": "PhDapper",
      "created": 1637181853,
      "upvotes": 1,
      "replies": {}
    },
    "hl19vpr": {
      "link": "/r/college/comments/qw8c6u/past_due_work_and_assignments_because_of_ed_dont/hl19vpr/",
      "text": "Get an incomplete through disability services.",
      "author": "GenXtreme1976",
      "created": 1637182395,
      "upvotes": 1,
      "replies": {
        "hl1aoqk": {
          "link": "/r/college/comments/qw8c6u/past_due_work_and_assignments_because_of_ed_dont/hl1aoqk/",
          "text": "At the institutions I’ve experienced, Incompletes are only given in the last couple of weeks of the term and only when a student is performing well up until a specific catastrophe at the end of the term (vs. a long-term issue). This may differ at other institutions, though.",
          "author": "PhDapper",
          "created": 1637182723,
          "upvotes": 2,
          "replies": {
            "hl1axl2": {
              "link": "/r/college/comments/qw8c6u/past_due_work_and_assignments_because_of_ed_dont/hl1axl2/",
              "text": "It is your best shot.",
              "author": "GenXtreme1976",
              "created": 1637182851,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}