{
  "sid": "q58alj",
  "link": "/r/college/comments/q58alj/university_is_obsolete/",
  "title:": "University is obsolete",
  "text": "It appears to me that university is an obsolete institution under most aspects, its not the place of knowledge since I can get better quality and more concise information elsewhere on most aspects and my profs arent that good, instead of going to class to know what will be on exam and then studying again on a decent source, interactions with teachers are minimal but I recognize that that can be thing, the useful things are the certification it provides which i recognize is necessary in the job market, and the structure.\n\nSo instead there could be certifications that you study for, and the best ones/ones that employers want more would emerge in the market and people would study for them, for example a type of engineering certification that also focuses on more hands on study that you'll do at work so employers like it and it becomes a valued certification to have, instead of a university degree, and then courses could arise to prepare to those certifications, or full courses that give both education (not lectures, education, that can be in various forms) and exams and certificates.\nInstead of having just one type created by the government.\nI dont know if there's actually anything preventing this from happening aside from people not doing it, I live in Italy by the way for context.\n\nSo in conclusion I think I will do most of my learning by myself in self study, maybe self studying subjects dictated by my syllabus, but studying for exams and following lesson feels like high school, you just study for the exam and forget, now, I'm interested in the stuff so I'll probably remember but it is still an inferior way compared to my organic self studying, where I build one piece on top of the other in my learning journey.\n\nAlso I expected to gain precious information while as i said that's not the case, i also expected to meet people that are passionate about the subject were doing and we could talk about it while instead it's like high school where basically everyone I've met is here at random and doesn't care, they will study in function if the exam because they feel they have to, wait for the breaks during lesson to go smoke and act like \"yo bro do you have a lighter\" \"oh I'm not understanding shit of what the profs saying bro ahaha\", but those are a minority",
  "author": "-B-0-",
  "created": 1633873423,
  "updated": 1634083106,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.21,
  "comments": {
    "hg3w1un": {
      "link": "/r/college/comments/q58alj/university_is_obsolete/hg3w1un/",
      "text": "> So instead there could be certifications that you study for, and the best ones/ones that employers want more would emerge in the market and people would study for them, for example a type of engineering certification that also focuses on more hands on study that you'll do at work so employers like it and it becomes a valued certification to have, instead of a university degree, and then courses could arise to prepare to those certifications\n\nCongrats\n\nYou just invented technical school and Masters degree.\n\nThe engineering degree would have to have enough math for you to do those cert classes, enough writing for you to be able to write exams and reports, enough physics to not blow things up or have them fall down enough bio to realize that many human engineering solutions were better done by bio systems,  enough history to know ….\n\nOh wait,  That is an university education.\n\nYou school cant make you meet better people.  If there are hundreds to thousands of people in the school and you are meeting the same people all the time, at some point you have to realize the common denominator is you",
      "author": "PersephoneIsNotHome",
      "created": 1633876680,
      "upvotes": 8,
      "replies": {}
    },
    "hg3rfhj": {
      "link": "/r/college/comments/q58alj/university_is_obsolete/hg3rfhj/",
      "text": "Really what I’m hearing is “uni doesn’t work for me”, rather than “uni is obsolete”. Its true people are different and may thrive in different environments, such as self studying, but this is certainly not true of everyone. Even just looking at the covid shift to online- many people were able to succeed while some people weren’t able to keep themselves accountable under such a detached system. \n\nAlso, your alternatives to university sound an awful lot like online courses… which happen to exist and be available online. For some people these courses do wonders and for many, we’re back at the issue of discipline and setting your own timeline, and having to troubleshoot issues on your own. It might be tempting to say people should just learn to be more disciplined - but the reality is university is still a time of learning and this discipline tends to come over time by adjusting to set deadlines and fast paced learning. \n\nI do get it. If you’re driven, motivated, intelligent, and organized, it might seem like university is just constraining the direction of your learning, but I think you’ll find that the system works for many. \n\nTL;DR : University isn’t obsolete, it’s just not the only way of acquiring knowledge.",
      "author": "InsulinBlue",
      "created": 1633874463,
      "upvotes": 6,
      "replies": {}
    },
    "hg3w1wv": {
      "link": "/r/college/comments/q58alj/university_is_obsolete/hg3w1wv/",
      "text": "I can't speak for Italy, but it does not work like that in the United States. The government has little to no involvement in the structure of university programs. Universities design their programs around the skills demanded by employers (and professional certification requirements). As those requirements change, so do the university degree programs.\n\nThe skills that employers want are those that people are encouraged to study. The problem with this system is the government's involvement in providing funding to students who study degrees that are not in demand. This contributes to the extremely high cost of education in the United States.\n\nCertification programs provide more focused expertise in a very narrow area of study. If there is a positive long-term lookout for that skill, then bypassing university may be an viable option. I wouldn't recommend it because most employers do not want to hire someone who is only able to do one task extremely well. They tend to outsource that work to contractors to limit the high cost of labor.",
      "author": "WCCobra",
      "created": 1633876681,
      "upvotes": 4,
      "replies": {}
    }
  }
}