{
  "sid": "qx39nc",
  "link": "/r/college/comments/qx39nc/ticking_time_bomb/",
  "title:": "Ticking Time Bomb",
  "text": "Hi everyone.\n\nSo long story short, I'm a current 3rd year studying biomedical sciences at a Canadian university (let's call it university A) and I ended up posting some questions on Chegg last year I can't get removed but haven't been caught yet. I was under a lot of stress mental health wise with online school but what I did was still wrong and I really regret it.\n\nThe policy at my school is that if I get a transcript notation, it is erased in 4 years or 1 years after graduation.\n\nI'm also thinking of switching out to a community college to do a technician's diploma and maybe coming back to do university somewhere else (let's call it university B) at some later point (4 years?) cause I'm interested in grad school but I know the technician's diploma will help me with making money more.\n\nWhat I'm worried about now is this coming back to haunt me in 4 years when I'm ready to apply for grad school and I will have graduated from university B which will leave a black mark on my transcript for 4 years.\n\nI think it might just be the smart decision from a long term perspective to finish up now so that even if I get hit with a transcript notation, it will only last for 1 year1 after I graduate and after 1 year after dropping out of university A, will they even bother to pursue charges against me? And even if they did, wouldn't it just be automatically erased according to the policy?\n\nAny advice would be appreciated with with respect to this decision.",
  "author": "joade1",
  "created": 1637280157,
  "updated": 1637353796,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hl6u9g3": {
      "link": "/r/college/comments/qx39nc/ticking_time_bomb/hl6u9g3/",
      "text": "I doubt you’re gonna get caught just pray and relax",
      "author": "NotoriousJez",
      "created": 1637280522,
      "upvotes": 1,
      "replies": {}
    },
    "hl7yp2y": {
      "link": "/r/college/comments/qx39nc/ticking_time_bomb/hl7yp2y/",
      "text": "You might be overly paranoid. From my understanding, chegg can be for both HW help and learning help. Can say, I was trying to get a deeper understanding after so called assignment was already due and turned in before posting it. Honestly, it’s not your fault other students may use it to learn it. Although I’m unsure if they track the date/time posted. Could always do customer service to take it down maybe idk how that works",
      "author": "ThicccPanta",
      "created": 1637299975,
      "upvotes": 1,
      "replies": {}
    }
  }
}