{
  "sid": "qsowck",
  "link": "/r/college/comments/qsowck/stuck_between_fiu_and_auburn/",
  "title:": "Stuck between FIU and Auburn",
  "text": "I have been applying to universities. I got accepted by Fiu and it’s 40 mins away and has a good rep for my major. Though I have this weird feeling in my heart that I want to go out of state for college. Like Auburn I heard has a great community and it’s like a little city. Fiu doesn’t have that family feeling. But Auburn doesn’t have my main major but it does have my backup option. What should I do?",
  "author": "Jettpancake",
  "created": 1636763103,
  "updated": 1637182040,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hker556": {
      "link": "/r/college/comments/qsowck/stuck_between_fiu_and_auburn/hker556/",
      "text": "Auburn is a great school, but if it doesn't have your main major its hard to justify going. Also you should really factor in financial costs if you don't have a full ride scholarship.\n\nOne year at Auburn out of state is $31,000, compared to $6,500 in state at FIU.",
      "author": "Sermos5",
      "created": 1636769328,
      "upvotes": 2,
      "replies": {
        "hkerq74": {
          "link": "/r/college/comments/qsowck/stuck_between_fiu_and_auburn/hkerq74/",
          "text": "Yeah I’m also taking the financial look. I think I will stick to FIU but I just want to have the out of state feeling. I don’t know maybe it’s strange 😂",
          "author": "Jettpancake",
          "created": 1636769613,
          "upvotes": 1,
          "replies": {
            "hkesg3k": {
              "link": "/r/college/comments/qsowck/stuck_between_fiu_and_auburn/hkesg3k/",
              "text": "The out of state feeling is cool when you're young but its really hard to justify a cost like that. One year of Auburn is the amount of money you could spend for all four years in-state lmao. I'm not too familiar with Florida schools but it sounds like you should try to find one with a smaller town feel. Maybe check out FSU or Florida? The cities for them are a lot smaller than Miami",
              "author": "Sermos5",
              "created": 1636769970,
              "upvotes": 1,
              "replies": {
                "hkeu256": {
                  "link": "/r/college/comments/qsowck/stuck_between_fiu_and_auburn/hkeu256/",
                  "text": "Yeah you’re probably right. I did apply to FSU so they could be my next option.",
                  "author": "Jettpancake",
                  "created": 1636770760,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}