{
  "sid": "k04z6i",
  "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/",
  "title:": "Group accused of cheating in group project.",
  "text": "I worked on a group project with a group. We split up the work and did individual tasks. I did completely honest work.\n\nThe professor said that the work was plagiarized and someone has to confess or we will get a referal to a student conduct board for cheating.\n\nThis will impact my Fall graduation date if this happens. How do I go about proving my innocence ??\n\n\nI did nothing wrong and it is completely unfair that I am punished for someone else's stupidity.",
  "author": "Due-Ad7595",
  "created": 1606224528,
  "over_18": false,
  "upvotes": 855,
  "upvote_ratio": 0.99,
  "comments": {
    "gdlcd0y": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdlcd0y/",
      "text": "SAVE EVERYTHING. Screenshot messages, screen shot google doc/slide/excel etc. editing history, turn it in check and see which parts are your's and which aren't, don't talk to any of your group members. Don't admit to cheating if you did not do it, every person for themselves in this type of situation.",
      "author": "lovelynightmare1111",
      "created": 1606338595,
      "upvotes": 1,
      "replies": {}
    },
    "gdjkoyy": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdjkoyy/",
      "text": "You should work with the instructor because if part of the project is plagiarized you are in trouble, even if you didn't write that part yourself.\n\nWhile students often divide group assignments into different sections for ease, this is actually not a given: you are supposed to be collaborating on the entire project. This means that every member is responsible for ALL of the content, not only the portion they wrote. So, if part of it is plagiarized everyone can be brought up on plagiarism charges. \n\nNow, this probably won't happen to you if you cooperate, but you might expect to find a reduced grade on the project anyway because, either (1) you are guilty of plagiarism, or (2) you didn't collaborate on the project as intended. Group projects are often included in courses with a teamwork/collaboration GE, so refusing to collaborate -- i.e. dividing up the work and only paying attention to one's own section -- is cause for a reduced grade.\n\nIn any case, the plagiarism charges are much more serious so try to document what you can and present what you have to the instructor of record.",
      "author": null,
      "created": 1606301712,
      "upvotes": 1,
      "replies": {}
    },
    "gdihms4": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdihms4/",
      "text": "Oof definitely post an update.",
      "author": "Dejavou7",
      "created": 1606271786,
      "upvotes": 1,
      "replies": {}
    },
    "gdi4ogi": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdi4ogi/",
      "text": "Professor here: even if you are sent to Academic Misconduct, it doesn't necessarily mean that you'll be off track to graduate. The committee is charged with investigating the offense, including gathering documentation and giving the opportunity to respond. Most colleges also allow the professor to make recommendations for consequences and \"making amends\" as well.",
      "author": "LindseyLumama",
      "created": 1606264650,
      "upvotes": 1,
      "replies": {}
    },
    "gdhudpp": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhudpp/",
      "text": "I think it’s highly unrealistic for a board to look at a group project and ignore the fact you did your own work. \n\nHowever, I also think it’s stupid to plagiarize on a college assignment. Some kids really do think it’s still Highschool where standards don’t matter. Given this, it’s unlikely that the person will confess because being “charged” will essentially stay will you throughout college and might get them kicked out. \n\nWhat you could do is go on turn it in or any other service and figure out which part is plagiarized. Once you find the part that is not original work, isolate who posted/did it. Submit your findings to your professor or the board (if it gets to that point).\n\nThat should leave you in the clear and you’d make it out essentially unharmed. \n\nSome of the answers on here sound like they’re freaking out for you or an over-reaction. If you really did nothing wrong, I wouldn’t worry about it but, have a fallback incase it goes south. I wouldn’t openly state who the cheater is in a public setting and I would do this rather fast. People who cheat or are in the process of being caught are good at covering their tracks. Also, don’t announce you were the one who reported them. People are crazy.",
      "author": "majoroofboys",
      "created": 1606259106,
      "upvotes": 6,
      "replies": {}
    },
    "gdhov0i": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhov0i/",
      "text": "Go up to the professor and tell that you did not plagiarize",
      "author": null,
      "created": 1606256282,
      "upvotes": 1,
      "replies": {}
    },
    "gdhm3nl": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhm3nl/",
      "text": "If you all did separate work then show her the work you did. There you go problem solved. She can't punish you for something you didn't do and if you are being honest you have proof.",
      "author": "AidanTheAudiophile",
      "created": 1606254913,
      "upvotes": 1,
      "replies": {}
    },
    "gdherq2": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdherq2/",
      "text": "Ask him or her What you copied. He or she needs evidence that you also copied. If he or she does not give proof Your most likely innocent. Just like how you need evidence to show how your innocent and dont worry about your teammates. There most likely stupid if they didnt cover up their tracks or re-worded it.",
      "author": "Imademon2",
      "created": 1606251345,
      "upvotes": 1,
      "replies": {}
    },
    "gdhdt5z": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhdt5z/",
      "text": "first off you dont need to prove innocence they have to prove that you cheated",
      "author": "unforgivingregret",
      "created": 1606250883,
      "upvotes": -4,
      "replies": {
        "gdiccts": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdiccts/",
          "text": "Not true most academic integrity boards only need “a preponderance of evidence” not “beyond a reasonable doubt”",
          "author": "pokemongofanboy",
          "created": 1606268861,
          "upvotes": 5,
          "replies": {}
        },
        "gdjkfw9": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdjkfw9/",
          "text": "If the group assignment has plagiarized material they are potentially in trouble. While students often divide group assignments into different sections for ease, this is actually not a given -- they are supposed to be collaborating on the entire project. This means that every member is responsible for ALL of the content, not only the portion they wrote.",
          "author": null,
          "created": 1606301447,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gdh8n16": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdh8n16/",
      "text": "Take screen shots of the history on google slides. Please update us!",
      "author": "night2016",
      "created": 1606248436,
      "upvotes": 1,
      "replies": {}
    },
    "gdh6ju6": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdh6ju6/",
      "text": "> How do I go about proving my innocence ??\n\nBy highlighting the parts of the assignment that you contributed.\n\nIf you know who contributed which parts of the entire assignment (not just your own), you should provide that instead.  Basically tag each part of the assignment with the name of the group member responsible, and let the prof take it from there.",
      "author": "lupineblue2600",
      "created": 1606247445,
      "upvotes": 3,
      "replies": {}
    },
    "gdh2fb6": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdh2fb6/",
      "text": "Group projects are so fucking dumb. \"It's real life,\" they say. Yeah, when your livelihood depends on your job.",
      "author": "KHXIII",
      "created": 1606245510,
      "upvotes": 18,
      "replies": {
        "gdirh81": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdirh81/",
          "text": "Literally what jobs make you do Group projects 🤷🏻‍♀️",
          "author": "lch_xo",
          "created": 1606277511,
          "upvotes": 3,
          "replies": {
            "gdit4vf": {
              "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdit4vf/",
              "text": "The majority of career jobs all have group work, but everyone gives a fuck because it pays for their bills.",
              "author": "KHXIII",
              "created": 1606278554,
              "upvotes": 7,
              "replies": {}
            },
            "gdljrsr": {
              "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdljrsr/",
              "text": "All of them",
              "author": "quantum-mechanic",
              "created": 1606342404,
              "upvotes": 2,
              "replies": {}
            },
            "gdly4bn": {
              "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdly4bn/",
              "text": "Like 99% of jobs you will have to work with other people.",
              "author": "RainBoxRed",
              "created": 1606350465,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gdlxp3c": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdlxp3c/",
          "text": "I had a topic that was just one big project all semester and this was my lament. This guy just wouldn’t do anything and I said to the prof this guy would be fired long ago if this was a paying job so how does this group project reflect “real life”. \n\nThe prof couldn’t care less and their cop out was that apparently it’s a good opportunity for me to practice my team and communication skills. Sir this is an engineering degree, not management.",
          "author": "RainBoxRed",
          "created": 1606350222,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gdgzid4": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgzid4/",
      "text": "Same thing happened to me. I was partnered with this dude who ended up putting 4 word for word sentences in our paper from an academic journal (without giving credit). He luckily owned up to it and claimed full responsibility, plus having everything in google docs showed I had not written that part. Tbh I do think it was honest mistake, the guy regularly would post parts of articles on a side page to use in our paper. However the school came down on him harsh, he immediately failed the course and was suspended for a semester, even after I protested  that I thought it was an honest mistake.",
      "author": "Harambiz",
      "created": 1606244156,
      "upvotes": 17,
      "replies": {
        "gdircqn": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdircqn/",
          "text": "That sucks :( my school has seemed pretty lenient. Ive gotten a couple announcements thus semester saying that students in my classes were caught cheating but the teachers seemed to give them a warning",
          "author": "lch_xo",
          "created": 1606277435,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gdgwmcf": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgwmcf/",
      "text": "Odds are your cheating groupmates are more than willing to let you take the fall/go down with them.\n\nDocument what parts you worked on, and what parts each other member worked on. Work with your professor, let them know it wasn’t you who cheated and that you didn’t know your group mates were.",
      "author": "omgitsabean",
      "created": 1606242822,
      "upvotes": 38,
      "replies": {}
    },
    "gdgvsxk": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgvsxk/",
      "text": "If you didn't this time, in the future use a program similar to google docs that allows you to view *ALL* of the edit history. If you get accused of cheating you will be able to go into the edit history to show which section comes from who. This isnt the final step, though. As sending the file right away won't prove/disprove innocence, only who did what. So having what your sources are is good too. Some people also cheat accidentally, by copying work without sourcing it. Be sure to talk to your group/prof and see if they simply forgot to source rather than blatant cheating. You dont necessarily have to stand by your group (unless you're friends with them) as this is college, it's all or none and if someone is cheating they are risking your grades, not just their own.",
      "author": "WorseDark",
      "created": 1606242441,
      "upvotes": 12,
      "replies": {}
    },
    "gdgtx8y": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgtx8y/",
      "text": "I can't help you much but this is the time group members start turning against each other. Your instructor is pulling a chair and grabbing popcorn, ready to see the massacre...",
      "author": "ethanfinni",
      "created": 1606241572,
      "upvotes": 3,
      "replies": {
        "gdgw9sa": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgw9sa/",
          "text": "Instructor here.  In situations like this, I feel sick and devastated.  We hate the confrontations.  We feel caught in an impossible situation because we have to do something and we don’t know who is innocent and who is guilty.  We got into this profession because we were the student who loved this particular stuff.  We are confronted over and over again with evidence that people don’t care about this thing we love.\n\nWe aren’t cops.  Our job is to teach.",
          "author": "maureenmcq",
          "created": 1606242660,
          "upvotes": 21,
          "replies": {}
        }
      }
    },
    "gdgogzb": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgogzb/",
      "text": "Did he tell you why he thinks you are cheating? I would gather the evidence you need to refute that claim. If it’s the wording on the document or some specific text, show him where you got your information and how you came up with similar information. Ask your other group members to give you their sources if they haven’t yet. Also explain how the research was divided up and worked on.",
      "author": "Coreymiconius00",
      "created": 1606239102,
      "upvotes": 1,
      "replies": {}
    },
    "gdgo5e4": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgo5e4/",
      "text": "Wow that’s crazy!! I’m working in a group\nProject now. I’ll make sure to check for plagiarism.",
      "author": "maddymckay",
      "created": 1606238956,
      "upvotes": 5,
      "replies": {}
    },
    "gdgo1q6": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgo1q6/",
      "text": "If the guilty members of your group don't confess and assert your innocence, you're pretty much screwed unless you can somehow prove you didn't work on the part that was plagiarized.\n\nI was in a similar situation, my groupmate confessed, he failed the assignment and I got an A. You're basically at the mercy of your group and professor here.",
      "author": "Bozzz1",
      "created": 1606238909,
      "upvotes": 16,
      "replies": {}
    },
    "gdgn8ao": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgn8ao/",
      "text": "My brother is going through this exact situation right now.\n\nHe had to attend a plagiarism workshop, and failed the assignment. Since it was his first offense and he was in a group, he was let off pretty easily.",
      "author": "nonconformistnugget",
      "created": 1606238537,
      "upvotes": 11,
      "replies": {}
    },
    "gdgmryi": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgmryi/",
      "text": "I would read your teammates the riot act, and present every bit of evidence that your work was honest.",
      "author": "orangeblackteal",
      "created": 1606238329,
      "upvotes": 48,
      "replies": {
        "gdh53mi": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdh53mi/",
          "text": "this is the one.",
          "author": "I_am_Not_A_Robot_13",
          "created": 1606246763,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gdgmjww": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgmjww/",
      "text": "Stand your group don't let this professor try to bully you if you don't know who did it and you only did honest work it's not your fault someone else decide to chest that is not your responsibility",
      "author": "Independent_Bad_9904",
      "created": 1606238226,
      "upvotes": -4,
      "replies": {
        "gdgmzqg": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgmzqg/",
          "text": "I wouldn't call it bullying, if he has evidence that the group cheated he's acting accordingly. With that being said, if the OP did not cheat, or know his teammates were cheating he should damn well present his evidence and call his teammates out.",
          "author": "orangeblackteal",
          "created": 1606238428,
          "upvotes": 27,
          "replies": {
            "gdmwj68": {
              "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdmwj68/",
              "text": "Why are you getting downvoted for?  People here act like everyone in academia is god or some crap.",
              "author": "ChronoZ52",
              "created": 1606373362,
              "upvotes": 1,
              "replies": {}
            },
            "gdgnepd": {
              "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgnepd/",
              "text": "No he has zero evidence of who in fact cheated he just knows that obviously someone in the group cheated weather it be all of them or one, threatening to refer all of them is bullying and not right at all, that's just a scum tactic and hurts good people in the end",
              "author": "Independent_Bad_9904",
              "created": 1606238618,
              "upvotes": -4,
              "replies": {
                "gdgpd2i": {
                  "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgpd2i/",
                  "text": "I agree I had a Professor try to intimidate me that way and he threatened to get the whole group expelled for plagiarism so I checked him SO fucking quick AND emailed the head of his department too. Instead of making threats and abusing your power as a Professor (he literally humiliated us and yelled at us infront of the whole class as if we were children instead of stepping aside to privately talk to us) he should have acted more professional and understanding. I made sure he got his ass chewed out by his higher ups AND he even had to apologize. A lot of students forget that they’re not helpless at all in these situations, you just gotta know how to move!",
                  "author": "Yvng-Dagger-Dick",
                  "created": 1606239500,
                  "upvotes": 5,
                  "replies": {}
                },
                "gdirteq": {
                  "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdirteq/",
                  "text": "Well then what should he/she do?",
                  "author": "lch_xo",
                  "created": 1606277723,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gdgl7a3": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgl7a3/",
      "text": "If it’s possible get everything together that shows where you guys divided up tasks and who got what, if you used google docs it should show editing history, and show you cited your references correctly.",
      "author": "SweatieSlurpie",
      "created": 1606237602,
      "upvotes": 55,
      "replies": {}
    },
    "gdgkrcq": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgkrcq/",
      "text": "i literally JUST dealt with this situation except i thankfully caught it before we turned it in. here's my suggestion:\n\ndocument exactly what you did for the project. if it was on google docs, take screenshots of the history and save the doc to your own drive. send these screenshots to your professor and/or TA as soon as possible. if it was not done on google docs, screenshot whatever email/document/message your group mates sent their submission via.\n\nif your university uses it, check the submission on turnitin and see what parts are plagiarized. if not, you might be able to find a program online and start a free trial to check the paper. you should then be able to tell who cheated and call them out within your group.\n\nsave ALL communication with your group after you call out the cheater, try to get them to confess, and send any (relevant) messages to your professor or just save them for the honors hearing.\n\nabsolutely do not confess to cheating if you did not cheat. they might still be able to charge you even if you unknowingly turned in plagiarized work, but the repercussions for a first time accidental offense are going to be way less harsh than if you admit to it. \n\nbasically, keep everything document possible and do a bit of sleuthing so you're ready to defend yourself. and i'm sorry this happened!",
      "author": "raynsuch",
      "created": 1606237398,
      "upvotes": 504,
      "replies": {
        "gdgmnps": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgmnps/",
          "text": "I think Grammarly is able to check for plagiarism as well if your school doesn’t use turnitin",
          "author": "joshysgirl7",
          "created": 1606238275,
          "upvotes": 116,
          "replies": {
            "gdh3vxi": {
              "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdh3vxi/",
              "text": "Grammarly does do this, but not automatically. You have to run a check for it",
              "author": "notFrankIero",
              "created": 1606246189,
              "upvotes": 38,
              "replies": {
                "gdi4kyi": {
                  "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdi4kyi/",
                  "text": "And you kind of have to pay for that feature",
                  "author": "sIurrpp",
                  "created": 1606264596,
                  "upvotes": 10,
                  "replies": {
                    "gditms0": {
                      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gditms0/",
                      "text": "Some colleges offer free access to the premium version (mine does) so OPs college may offer so that’s why I suggest it",
                      "author": "joshysgirl7",
                      "created": 1606278865,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gdlgbd1": {
              "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdlgbd1/",
              "text": "For really egregious plagiarism (ripping quotes straight off websites) [this one](https://smallseotools.com/plagiarism-checker/) works by searching every sentence on Google.",
              "author": "zeeroxd",
              "created": 1606340619,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gdhidyy": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhidyy/",
          "text": "Am professor. Good advice for this. \n\nThis is why I suggest my students use Google Docs/Slides/Sheets for collaborative work.  You can see the history of the work completed by all members, dates, etc. Imagine having the record of producing, editing, and contributing to the project BEFORE the other group that is also accused of cheating. Good luck and stay in communication with the professor as well.",
          "author": "kevvers80",
          "created": 1606253098,
          "upvotes": 57,
          "replies": {}
        }
      }
    },
    "gdgimeh": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgimeh/",
      "text": "Loose lips sink ships",
      "author": "Kangaroo-Last",
      "created": 1606236413,
      "upvotes": -57,
      "replies": {
        "gdgwult": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgwult/",
          "text": "Not in this case.\n\nIf OP doesn’t protect themself the cheaters who were too lazy to put in the work will ensure OP goes down with them, or even throw OP under the bus.\n\nIf you don’t have the integrity or intellect to cite your sources, you have no place in college.",
          "author": "omgitsabean",
          "created": 1606242927,
          "upvotes": 16,
          "replies": {}
        },
        "gdh9alp": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdh9alp/",
          "text": "I mean, the plagiarism checkers are often the ones sinking the ship lol",
          "author": "xcer49",
          "created": 1606248744,
          "upvotes": 4,
          "replies": {
            "gdhaa03": {
              "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhaa03/",
              "text": "That is very true!!!",
              "author": "Kangaroo-Last",
              "created": 1606249209,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gdggu5h": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdggu5h/",
      "text": "Talk to your group members and tell them that you didn’t do anything wrong and ask who did. It would be better if they confessed to the professor and took responsibility, but as of right now, you did put your name on something without actually looking at it and you’re equally as responsible as everyone else. I don’t think the prof is saying that you’ll all be held responsible because he thinks you plagiarized; I think he’s saying that because you (and all your group members) didn’t work together and ensure the project was done adequately.",
      "author": "bebeyoda22",
      "created": 1606235585,
      "upvotes": 51,
      "replies": {
        "gdhciik": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhciik/",
          "text": "> you did put your name on something without actually looking at it and you're equally as responsible as everyone else.\n\nWhat if that part of the work had 10 papers? Is there a website or app that checks plagiarism?  I'm also doing a group project and there are some parts that have over 7 pages, I definitely do not have time to check every single page...",
          "author": "wintereveluv",
          "created": 1606250270,
          "upvotes": 9,
          "replies": {
            "gdhderh": {
              "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhderh/",
              "text": "I believe there are some websites and apps like Grammarly and Chegg that have plagiarism checkers, but I don’t know for sure how reliable they are and whether or not you have to pay for them. \n\nThat being said, it doesn’t take that much work to see when something is being plagiarized. The main issues would either be that the person is using such advanced language that it immediately jumps off the page and screams “a student didn’t write this,” or that they did not use any citations. If the issue was missing a few citations, citing inaccurately, or paraphrasing poorly once or twice, the professor wouldn’t have responded the way they did. So, don’t worry about checking over other people’s work line by line to make sure that every citation and paraphrase is flawless, but at least skim through and ensure that there are citations and that it sounds like you guys wrote it.",
              "author": "bebeyoda22",
              "created": 1606250698,
              "upvotes": 3,
              "replies": {
                "gdhdpx5": {
                  "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhdpx5/",
                  "text": "That was helpful, thanks!",
                  "author": "wintereveluv",
                  "created": 1606250841,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gdfzwdp": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdfzwdp/",
      "text": "I'd save absolutely everything you have related to the project.  Any notes, emails, group chats, zoom meetings, rough drafts, anything.  The best case is that you can demonstrate what portions of the project you contributed and that those portions are original and that furthermore you had no indication of cheating by your groupmates.\n\nIf you did, in fact, have knowledge of cheating by your groupmates, then you effectively cheated too by allowing your name to be on the final submission.",
      "author": "ecklesweb",
      "created": 1606227397,
      "upvotes": 584,
      "replies": {
        "gdgy13q": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgy13q/",
          "text": "This, and show you know what ur doing. When I was accused of cheating too. I brought a binder and compiled all my work for the semester relating to that and presented it while explaining what they are meant for",
          "author": "justtrynasurviv3",
          "created": 1606243480,
          "upvotes": 89,
          "replies": {}
        },
        "gdh42kq": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdh42kq/",
          "text": "In addition to this:\n\nGoogle docs has version history, and this is one of the many times it comes in handy.",
          "author": "awesome2dab",
          "created": 1606246274,
          "upvotes": 74,
          "replies": {}
        },
        "gdgvy8v": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdgvy8v/",
          "text": "Play dumb.",
          "author": "Thatguybrain01",
          "created": 1606242510,
          "upvotes": -40,
          "replies": {
            "gdhsfql": {
              "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhsfql/",
              "text": "nope the best thing in this case is to be completely honest and forthcoming",
              "author": "slutshaa",
              "created": 1606258100,
              "upvotes": 14,
              "replies": {}
            }
          }
        }
      }
    },
    "gdfyyqi": {
      "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdfyyqi/",
      "text": "go talk to your group",
      "author": "DeuceDeuceTV",
      "created": 1606226943,
      "upvotes": 65,
      "replies": {
        "gdhtjt2": {
          "link": "/r/college/comments/k04z6i/group_accused_of_cheating_in_group_project/gdhtjt2/",
          "text": "This isn’t good advice. I wouldn’t talk with any of the suspected cheaters. Unless op is in a one party consent state and could legally record them confessing without their knowledge to use as evidence. Otherwise this is not a good idea. Cease communication with the offending parties. \n\nTo clear your name you need to get out in front of this by sending any and all documentation on which parts you contributed to the group project and most importantly any documentation you have of what other contributions specifically were \n\nThis would make it clear who did and did not cheat.",
          "author": "Burt__Macklin__FBI2",
          "created": 1606258676,
          "upvotes": 13,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634057360
}