{"sid": "pw1e5l", "link": "/r/college/comments/pw1e5l/how_do_i_decide_on_a_major/", "title:": "How do I decide on a major?", "text": "It's something I have thought about on and off throughout high school but now that the end of high school is nearing for me I still really don't know what I would like to pursue. I have many general fields I am interested in but I have never been particularly intensely passionate about any of them. During high school, I have engaged in many different subjects and clubs but still, nothing has really latched on to the extent that I think I can do it for a career. I am still searching for a direction but I am not sure which way to go. And from my limited research so far regarding Universities, I also don't want to be locked into a particular major only to later regret my decision.  That is why I wanted to ask you guys if you have any suggestions for majors and advice from your guy's own experience. \n\n&#x200B;\n\nThank you everyone in advance.", "author": "Apollo452", "created": 1632687202, "retrieved": 1632800250, "over_18": false, "upvotes": 0, "upvote_ratio": 0.33, "comments": {"heh7iuc": {"link": "/r/college/comments/pw1e5l/how_do_i_decide_on_a_major/heh7iuc/", "text": "It's fine to choose a college major for pragmatic reasons, like choosing to study finance or mechanical engineering because you're good at math and want to have plentiful, high-paying job options after college, or choosing to study nursing because you have always earned good grades in science classes, like working with people, and prefer a job that doesn't have you sitting at a desk all day. \n\nYour college major will impact your entry-level job options right out of college, but it doesn't lock you into a specific career path for the next thirty or forty years. It's very common for people to switch careers entirely at least once, and that typically doesn't require an additional degree. For example, you might study economics and get an entry-level job as a financial analyst, and then take a different job within your company in business intelligence, and then get promoted into an IT manager role.", "author": "clearwaterrev", "created": 1632754349, "upvotes": 1}, "hee27dn": {"link": "/r/college/comments/pw1e5l/how_do_i_decide_on_a_major/hee27dn/", "text": "If you’re still in school, you could talk to a guidance counselor. They may have more resources in your school/community to explore careers and majors. \n\nYou also don’t have to go into college right away. Take a gap semester, year, whatever. \n\nYou could also go to college just to get your AA, and explore majors while you’re there. Talk to people with different majors, talk to a career counselor, join clubs. This might bite you in the ass though; you might have to take extra courses to get into whatever program you end up wanting to study. \n\nI bounced between several different majors while getting my AA but I kept getting pulled back to the same one again and again. So that’s the one I’m sticking to. \n\nEveryone struggles to find the right major, it’s part of the process and can even be fun! Good luck :)", "author": "laniebug235", "created": 1632687989, "upvotes": 2}}}