{"sid": "px6uyj", "link": "/r/college/comments/px6uyj/disruptive_class_mates/", "title:": "Disruptive class mates!?", "text": "Am I the only one noticing the newer generation of students openly mocking the professors or talking over them in class as if we are in high school???\nI’m retaking 2 classes to get a better grade and in both there are at least one group of students either talking amongst themselves the entire time(loud and not about class) and the other class there is a group that mocks the professor the entire time!? \nWhere is this disrespect coming from?\n\nTl;dr  newer generation of students openly mocking the professors or talking over them in class as if we are in high school???", "author": "LITTLEloud1124", "created": 1632837146, "retrieved": 1632945380, "over_18": false, "upvotes": 21, "upvote_ratio": 0.86, "comments": {"hen8yx5": {"link": "/r/college/comments/px6uyj/disruptive_class_mates/hen8yx5/", "text": "Yes, there are kids in my class who are constantly talking and being general idiots during class. It's a web and mobile app development class, focusing mostly on design, so the room is full of Macs. Whenever we're on photoshop, these two morons sitting next to me will draw dicks and shit. Which I wouldn't mind, in fact I might even join them if I didn't hate their guts. They have this thing where they shake the mouse so hard and then laugh like its the funniest shit they've ever seen. They talk all class, making jokes that would make a toddler roll their eyes.\n\nThen there's the whale. This fat bitch at the front of the room who always has to interject and make it about her. I guess she's had some mental issues, which I sympathize with, these last  couple years have been pretty hard on me (don't want to get into detail, but a good friend of mine killed himself). But holy shit. I want to slap her and tell her to shut the hell up. She has that annoying rich dumb white girl voice, where she holds the last syllable of the last word in whatever garbage sentence she's spewing, and at the last second she raises the pitch of her voice. Example: \"My project is for a non profiiiiiiiiit\". Took this directly from class, when the teacher was giving another student advice, she decided she needed to open her fat mouth. I don't know if you can tell, but I really don't like her.\n\nI've noticed that it's normally younger students, but that doesn't mean older ones can't be annoying either. If I had to guess, they probably just don't care. They're here for the parties, not the degree. My best advice, ignore them. Even though it's hard, try to focus on the class. If they aren't paying attention to the class, then they should fail, right? You'll probably never be forced to listen to their idiocy ever again.", "author": "Grievous90", "created": 1632864557, "upvotes": 1}, "hemelgz": {"link": "/r/college/comments/px6uyj/disruptive_class_mates/hemelgz/", "text": "Right. There was this girl in one of my classes mocking the professor’s accent. If you noticed she had a deep scent the first week of school why no try to change to a different professor instead of sitting there mocking her. They act like they’re still in high school and they’ll wake up real fast hopefully.", "author": "PassiveAggres-Thighs", "created": 1632851682, "upvotes": 2}, "hem9k2q": {"link": "/r/college/comments/px6uyj/disruptive_class_mates/hem9k2q/", "text": "Millennial here, we pulled the same exact bullshit when it was us 10 or so years ago, and 20 years ago it was Gen X. I know the last bit for a fact because my favourite professor would occasionally launch into rants about former students of his.", "author": "sashathebrit", "created": 1632849613, "upvotes": 6}, "helj1ls": {"link": "/r/college/comments/px6uyj/disruptive_class_mates/helj1ls/", "text": "This isn't a \"new generation\" thing. It might be in your country, but in the US it relies more on the specific location/background of the students moreso than generation.\n\nThat being said, while older students were rude when they were 18-19, most grew the fuck up and eventually learned to be respectful or they became \"that guy\" that everyone knows is an asshole.\n\nChances are most of today's young students will also grow up eventually, so I wouldn't worry too much. People have learned \"adulting\" at later and later ages, so some patience can go a long way. I think covid has also stunted student's development-- not ust academically, but socially. I doubt it's permanent. \n\nEither that, or our society is falling to pieces, which is also a distinct possibility, lol. Realistically, though, people just need to get back to practicing interacting in person with real human beings which will help them develop some empathy.", "author": "HumanDrinkingTea", "created": 1632838598, "upvotes": 20}, "helgm07": {"link": "/r/college/comments/px6uyj/disruptive_class_mates/helgm07/", "text": "Yes.  I'm part of the newer generation and classes are mostly silent except when people have questions.", "author": "SamuraiSombrero0", "created": 1632837499, "upvotes": 1}}}