{
  "sid": "qsm5dc",
  "link": "/r/college/comments/qsm5dc/how_much_of_your_money_goes_to_rent/",
  "title:": "How Much Of Your Money Goes To Rent?",
  "text": "The apartment I'm looking at starts at $1325. There are a few others but they're a couple hundred more. This seems like way too much but at the same time it's the cheapest housing around. Now this is in a pretty wealthy city in California so no matter what it's gonna be expensive. But just out of curiosity, how much are you spending (or willing to) on rent. Have a nice day.",
  "author": "SebastianDeJesus",
  "created": 1636754864,
  "updated": 1637182050,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkejrrm": {
      "link": "/r/college/comments/qsm5dc/how_much_of_your_money_goes_to_rent/hkejrrm/",
      "text": "I pay 550, including parking, utilities, and wifi. Im a 7 minute drive from campus with a free bus route nearby too. The house is in decent shape for the city Im in and I have 4 (nice, clean) roommates. I wouldnt spend more than that since thats the average rate in my city",
      "author": "taybay462",
      "created": 1636765688,
      "upvotes": 3,
      "replies": {}
    },
    "hkdybil": {
      "link": "/r/college/comments/qsm5dc/how_much_of_your_money_goes_to_rent/hkdybil/",
      "text": "Depends on the city, but where I am the max for me was ~$1300 without utilities. If it was a nice area and a nice place though we could do an extra $1000.",
      "author": "noelblossom",
      "created": 1636755565,
      "upvotes": 1,
      "replies": {
        "hkdzcqd": {
          "link": "/r/college/comments/qsm5dc/how_much_of_your_money_goes_to_rent/hkdzcqd/",
          "text": "Oh it's a great area, actually Oprah called it the happiest city in the world. It's just seems unreasonable the cheapest apartment in the whole city is 13 hundred dollars and that's without utilities.",
          "author": "SebastianDeJesus",
          "created": 1636756031,
          "upvotes": 1,
          "replies": {
            "hke06qs": {
              "link": "/r/college/comments/qsm5dc/how_much_of_your_money_goes_to_rent/hke06qs/",
              "text": "I would suggest to see if you can get any roommates. I have a roommate and it cuts down a lot on rent plus other stuff like groceries as we split the bill.",
              "author": "noelblossom",
              "created": 1636756405,
              "upvotes": 1,
              "replies": {}
            },
            "hkejuxy": {
              "link": "/r/college/comments/qsm5dc/how_much_of_your_money_goes_to_rent/hkejuxy/",
              "text": "Is that a studio or 1 bedroom? You can probably cut the rent way down by having roommates. Like many college students, you probably arent really at a point yet where you can confortably afford your own place",
              "author": "taybay462",
              "created": 1636765733,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hket9mf": {
      "link": "/r/college/comments/qsm5dc/how_much_of_your_money_goes_to_rent/hket9mf/",
      "text": "I pay $550 a month for a 3 bedroom apartment, that I share with one other person. We have off street parking and in unit laundry. It’s also a pet friendly place. But we live in Ohio so lower cost of living",
      "author": "Concerned-23",
      "created": 1636770373,
      "upvotes": 1,
      "replies": {}
    },
    "hkgwdnr": {
      "link": "/r/college/comments/qsm5dc/how_much_of_your_money_goes_to_rent/hkgwdnr/",
      "text": "I’m at 1000 for a townhouse which includes parking, utilities, wifi, laundry, etc. Nice neighborhood and close to public transportation, so saves me the traffic-time and gas-money trying to get downtown, not to mention it’s crazy expensive to park there.  Probably could have gone cheaper but i would have ended up paying for laundry/pet rent separately and had to deal with a faceless corporate entity rather than a landlady that I’ve actually met.",
      "author": "themathymaestro",
      "created": 1636819586,
      "upvotes": 1,
      "replies": {}
    }
  }
}