{
  "sid": "qpsoui",
  "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/",
  "title:": "I wish I would have switched majors. It's too late now.",
  "text": "I'm a geology major. I'm miserable. I knew I didn't like this major my freshman year. I'm a second semester junior right now. I remember mentioning to my parents my freshman year (they're the ones paying for my college ), that I didn't feel like I was in the right major, and they said don't worry stick with it, it will get more interesting, and encouraged me not to change my major. I listened to them, because I thought hey they both have bachelor's/masters degrees so they must be right, right ? Well, no. It's still on me that I didn't switch my major( my parents would have still let me switch, I know that), but this is a lesson in life: listen to your gut when it comes to college majors, not what someone else tells you. \n\nI'm a second semester junior and I literally hate my life right now. My major is geology, and I honestly don't give a shit about rocks, or freaking sedimentary structures, or how some landform formed. I come close to falling asleep every geology class, and I'm not interested in anything geology related, nor am I interested in any of the careers. I'm constantly disappointed at myself for not changing majors. I could have switched majors as an underclassman: the core curriculum for geology is the same as engineering at my school. I'm interested in mechanical or material science engineering. I didn't even consider engineering in high school, because I literally had zero confidence in myself and I told myself that I would never make it through the upper level engineering classes and that I was too dumb (even though I was in the top 5% of my class in HS). Come to think of it, I've always been interested in machines. Even as a young girl I remember looking up how cars, boats, rollercoasters worked, etc. I don't even know how I'm going to make it through the next 2 semesters. I have been making B's in my geology classes, but if I actually put in more effort I would be an A student. My motivation has been steadily declining though as I've lost hope at finding something interested in my major. 2 semesters ago, I made A's in both geology classes, last semester, I made mid B's, this semester I'll either scrape by with a B or get a high C. Still got 2 semesters left. I was a much better student as an underclassman because I was more motivated. I always told myself \"got to power through these boring intro classes and then ill get to my junior year where I'll find something interesting .\" That looks like it's not going to happen, and now I'm lost. \n\nI took a flight lesson at the beginning of this year, and I really liked it and I'm considering becoming an airline pilot. Of course, my parents were all weird about it and all but said it's not a job for a woman (they still believe in traditional gender roles), but you know, screw that. I'm not listening to them and I'm going to do whatever the hell I want to do with my life. \n\n\nMoral of the story: if you're an underclassman and you don't like your major at all, consider changing it if you are able. I understand that you're not going to be interested in every class that you take. In fact, there's going to be a lot of classes you don't like, even if you're in a major you're interested in. A key sign that you're in the wrong major though is if you're a geology major and you don't like rocks, or if you're an English major and you don't like to write.",
  "author": "rocksandpizza789",
  "created": 1636421833,
  "updated": 1636655211,
  "over_18": false,
  "upvotes": 161,
  "upvote_ratio": 0.98,
  "comments": {
    "hjvqt5e": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjvqt5e/",
      "text": "If possible, change your major now. I changed my major the month before my senior year started. Had to graduate a little late but was so much happier and motivated. It’s never too late.",
      "author": "alwaystrivenprosper",
      "created": 1636422240,
      "upvotes": 190,
      "replies": {
        "hjyp1am": {
          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjyp1am/",
          "text": "Ya same I’m about to transfer as a junior ✌🏼",
          "author": "confusedandbroke_",
          "created": 1636481275,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hjwc85w": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwc85w/",
      "text": "Better change your major now. I'm a bachelors degree holder but I regretted not changing major bc now I don't have a clear career and I'm thinking of going back to study.",
      "author": "rebelwildheart",
      "created": 1636432078,
      "upvotes": 92,
      "replies": {
        "hjwos5h": {
          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwos5h/",
          "text": "For a master’s or another bachelor’s?",
          "author": "DueYogurt9",
          "created": 1636439611,
          "upvotes": 5,
          "replies": {
            "hjwox7q": {
              "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwox7q/",
              "text": "Another bachelor's then probably master's eventually.",
              "author": "rebelwildheart",
              "created": 1636439711,
              "upvotes": 11,
              "replies": {
                "hjx192j": {
                  "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjx192j/",
                  "text": "it is probably faster to just keep same major and take prerequisite courses for the master's that you want to change to.",
                  "author": "wobbletelescope",
                  "created": 1636449926,
                  "upvotes": 13,
                  "replies": {}
                },
                "hjwoznt": {
                  "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwoznt/",
                  "text": "The time and mental health commitments don’t scare you? Also do you mind if I ask what your original undergraduate degree is in?",
                  "author": "DueYogurt9",
                  "created": 1636439759,
                  "upvotes": 7,
                  "replies": {
                    "hjwpohf": {
                      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwpohf/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1636440254,
                      "upvotes": 1,
                      "replies": {
                        "hjwqcly": {
                          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwqcly/",
                          "text": "Best of luck to you",
                          "author": "DueYogurt9",
                          "created": 1636440745,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjw4waz": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjw4waz/",
      "text": "Have you sat down and talked to your parents recently about everything you said here? You could mention career prospects, which I would assume would be better for engineering than for geology (?). It's not too late to change but it will take more money and you'll likely graduate later than currently expected, but if this isn't for you I think you should seriously talk to your parents about it. About the pilot thing, you can pursue that after your degree, but if possible you should go for the engineering/materials science degree now since it's the best opportunity with your parents paying tuition. Good luck in whatever you choose to do :)",
      "author": "NoDryHands",
      "created": 1636428588,
      "upvotes": 31,
      "replies": {}
    },
    "hjwbhx1": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwbhx1/",
      "text": "I got a bachelors, couldn’t find work and now I’m back in college. You can does this!",
      "author": "9ua8adala",
      "created": 1636431705,
      "upvotes": 14,
      "replies": {
        "hjwoqx3": {
          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwoqx3/",
          "text": "For a second bachelor’s? Do you mind if I ask what your first undergraduate degree is in?",
          "author": "DueYogurt9",
          "created": 1636439589,
          "upvotes": 6,
          "replies": {
            "hjwpw8f": {
              "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwpw8f/",
              "text": "Political science and political philosophy",
              "author": "9ua8adala",
              "created": 1636440409,
              "upvotes": 6,
              "replies": {
                "hjwqkka": {
                  "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwqkka/",
                  "text": "What's your major this time round?",
                  "author": "NoDryHands",
                  "created": 1636440910,
                  "upvotes": 5,
                  "replies": {
                    "hjxze9f": {
                      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxze9f/",
                      "text": "Comp sci with applied math minor!",
                      "author": "9ua8adala",
                      "created": 1636470986,
                      "upvotes": 3,
                      "replies": {
                        "hjzhe1z": {
                          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjzhe1z/",
                          "text": "Great choice, I'm also switching to (hopefully) this exact combo!",
                          "author": "NoDryHands",
                          "created": 1636492535,
                          "upvotes": 1,
                          "replies": {
                            "hjzw5xg": {
                              "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjzw5xg/",
                              "text": "Yes! I need to get my grades up. Bc I want to hopefully get a PhD in stats, OR or quant finance. And my first bachelors was low bc reasons….. lol",
                              "author": "9ua8adala",
                              "created": 1636498569,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hjwq6wh": {
                  "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwq6wh/",
                  "text": "Do the time and mental health constraints not scare you?",
                  "author": "DueYogurt9",
                  "created": 1636440626,
                  "upvotes": -4,
                  "replies": {
                    "hjxfecj": {
                      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxfecj/",
                      "text": "Having to add on 2 years to your undergrad is better than having to hate the rest of your life and/or having to go back to college later on",
                      "author": "denver_rose",
                      "created": 1636461051,
                      "upvotes": 11,
                      "replies": {
                        "hjxiugp": {
                          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxiugp/",
                          "text": "Changed my major after my 4th year and yes I 100% agree lol. It actually significantly improved my mental health",
                          "author": "AStruggling8",
                          "created": 1636463041,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hk0cxxc": {
                  "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk0cxxc/",
                  "text": "If you don’t mind me asking, how competitive is the polisci job field in your opinion? I’m a polisci student right now and while I do enjoy it, I’m also extremely anxious about the job market. Interest and passion are both important, but so is putting food on the table lol.",
                  "author": "huahuax",
                  "created": 1636506001,
                  "upvotes": 1,
                  "replies": {
                    "hk0nap9": {
                      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk0nap9/",
                      "text": "I think if you have good internships and passion for the campaigns or interning with legislative branch it could be viable. I never was big into campaigning.. my plan was always law school, political theory. I think if you really like what your doing public policy or Econ is a great combo. Or another good route could be doing something in international politics like FOreign service.",
                      "author": "9ua8adala",
                      "created": 1636510658,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjwwceb": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwwceb/",
      "text": "You are experiencing a sunk cost fallacy. Your time, money, and energy has already been put in. You can’t change that now. But you can change where you go from here. You can either finish your degree or switch majors and do a couple extra semesters of school. There are many paths you can go down even tho you have a geology degree. Don’t feel stuck because of your current investment and look into your options!",
      "author": "OGBoots",
      "created": 1636445552,
      "upvotes": 15,
      "replies": {}
    },
    "hjwl27r": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwl27r/",
      "text": "It's always good to see advice for prospective students posted, and I 100% agree! In my case, advice to past self would be \"See a better therapist and take a gap year, don't go to college unless you have a profession in mind\". Haven't seen it posted, but have you discussed with your advisor, or a councilor in your department if that's a thing?\n\nSwitching your major might take longer than finishing it then going to grad school or making a move into a different career. Most people I've spoken to don't stay in the field they studied, academics or career wise.\n\nYou have a bachelors in a natural science, and one that deals with, as you pointed out, the same core requirements as an engineering degree. You could probably get into a grad program related to materials science, or find a job and pay for aviation school. Time will drag on anyways.\n\nI got a trade degree and realized the job was awful. Went back to college. I faced:\n\n2 years of communications, minor in environmental studies, which was only possible as my trade degree was in the school of forestry. Would give me a B.S. with a minor I loved.\n\nor\n\n4.5 years of business school coursework; no minor. Degree would be \"of arts\" and in basic administration or management.\n\nboth of which have very similar, near identical, career outcomes. So, here I am, and now I have a degree that, since it is in the social sciences, opens up grad schools from environ studies/humanities, harder environ to social work and pyschology. I plan on going to work haha but it's nice to have the option.",
      "author": "neverfakemaplesyrup",
      "created": 1636437105,
      "upvotes": 7,
      "replies": {}
    },
    "hjx98m1": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjx98m1/",
      "text": "It's never too late to change.  It's only too late to finish on the time line you set for yourself.  If you're dead set on finishing, you can always go back.  I got my BA in interior design.  Not what I wanted to do, but finished it anyways.  The crash of 2008 caused me to get laid off every year.  I finally got sick of it and went back to school.  I'm now a pharmacist.  You can always change.",
      "author": "swearingino",
      "created": 1636456812,
      "upvotes": 7,
      "replies": {}
    },
    "hjwmvqg": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwmvqg/",
      "text": "I finished my graphic design degree and now wish I would have majored in something else, like a language. I really wish I would have realized sooner that graphic design maybe doesn't fit with my personal lifestyle. I'm terrible at firm deadlines and communicating with clients about their creative visions. Looking back, I think I could have made a good French major and then used my degree for something more interesting like being an interpreter/translator.\n\nI know someone who changed their major every year and finally, on the 5th major (anthropology), felt like they were on the right track and graduated. Of course, it was years after the people she started college with, but it was what made her feel confident and comfortable.",
      "author": "chocolatechipsims",
      "created": 1636438301,
      "upvotes": 5,
      "replies": {
        "hjwmycd": {
          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwmycd/",
          "text": "Also, screw gender roles in careers. I've seen some pretty cool female pilots through social media!",
          "author": "chocolatechipsims",
          "created": 1636438351,
          "upvotes": 4,
          "replies": {}
        },
        "hjxatwr": {
          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxatwr/",
          "text": "I’m a graphic design major and I’m not sure if it’s for me, or if my (currently poor) mental health is clouding my judgement.",
          "author": "polite_demon",
          "created": 1636457997,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hjwrc4y": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjwrc4y/",
      "text": "Everyone clowned on me for changing my major like three times (and still do) but I eventually got it right and ended up in something I love. Is it still possible at all for you to change majors? I’m an engineering major myself and switched into it as a junior, I could of course give you tips if you want to know how it went transferring into it",
      "author": "cody_d_baker",
      "created": 1636441487,
      "upvotes": 5,
      "replies": {
        "hjypjlw": {
          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjypjlw/",
          "text": "What majors did you change to and from?",
          "author": "confusedandbroke_",
          "created": 1636481480,
          "upvotes": 1,
          "replies": {
            "hjzs9yq": {
              "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjzs9yq/",
              "text": "Not the guy but i went from\n\nPsychology -> Neuroscience -> Digital design -> Comp sci",
              "author": "so_wut_man",
              "created": 1636496945,
              "upvotes": 2,
              "replies": {
                "hk02dn7": {
                  "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk02dn7/",
                  "text": "LOL SAME",
                  "author": "confusedandbroke_",
                  "created": 1636501277,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjxgt0m": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxgt0m/",
      "text": "It’s never too late to change your major. And if you decide to stick with your major just to graduate, remember that not all jobs are going to require a specific major (you just need to demonstrate the knowledge specific for that job). Heck - I majored in nursing and here I am getting paid to play video games/ data sciences.",
      "author": "Abatonfan",
      "created": 1636461882,
      "upvotes": 4,
      "replies": {
        "hjxn208": {
          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxn208/",
          "text": "Woah do you mind going into more detail into how that happened? Sounds interesting",
          "author": "CensoredTruthSpeaker",
          "created": 1636465291,
          "upvotes": 3,
          "replies": {
            "hk2fndr": {
              "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk2fndr/",
              "text": "Pretty much the game was a hobby of mine. I met some friends on that game, they went on to work for the company and had some insider connections about job openings. I left bedside when my floor became a covid floor, they thought I would be a good fit for a job they’re looking for, and the rest is history.\n\nNow I call all my gaming sessions networking events 😄",
              "author": "Abatonfan",
              "created": 1636552235,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hk01177": {
          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk01177/",
          "text": "Oooh tell us more please? Sounds cool",
          "author": "mimaww",
          "created": 1636500680,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjx1td7": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjx1td7/",
      "text": "Life is so unfair. The most interesting subjects such as philosophy, writing, etc are not useful in the real world when it comes to getting jobs.",
      "author": "Near_River21",
      "created": 1636450425,
      "upvotes": 6,
      "replies": {
        "hjyarr0": {
          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjyarr0/",
          "text": "I thought the same.  I spent my first 3-4 semesters as a chemistry-physics double major, then one day one of the biology faculty posted the statistics for majors' post-graduation incomes.  \n\nOf course they were trying to show that the natural sciences were all near the top, but I saw that philosophy was actually in the top 10 paying majors at my university.\n\nI changed my major to philosophy a few weeks later and I'm soo glad I did.  I'm loving school like I haven't since middle school when I was first learning what learning was.\n \n \nEDIT: That said, I'm not trying to convince anyone to follow my choices- only do what you're comfortable with.  I would just advise that you look a little further into majors at your school that really interest you rather than just accepting the baseless assumptions of our society.\n\nSo often growing I heard about how STEM degrees were the most practical, yet people often talked about how fancy degrees don't teach you anything about the world.  As a philosophy major now, I'm dealing with problems and issues that are more relevant to everyday life than anything I ever did in my 4 semesters in chem and physics.\n\nI don't know how this STEM-elitist myth grew to be so pervasive in our culture.",
          "author": "-n_h101-",
          "created": 1636475653,
          "upvotes": 2,
          "replies": {
            "hjzcy04": {
              "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjzcy04/",
              "text": "Did it show whether that was post undergrad or after more schooling. STEM elitism rose because of the high immediately out of college salaries. No one should hate in humanities if a person is deciding to attend graduate studies.",
              "author": "Low-Complex-5168",
              "created": 1636490782,
              "upvotes": 1,
              "replies": {
                "hk2vpyw": {
                  "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk2vpyw/",
                  "text": "The stats were for post-undergrad.  \n\nIt was posted in the hall more than a year ago now, I'll go by there later to check.  If the posting is still up (which I doubt, but you never know) I'll link the image.",
                  "author": "-n_h101-",
                  "created": 1636559142,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjx7er7": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjx7er7/",
      "text": "What would be the downsides if you were to change your major? What are the cons that your parents are looking at if you do so?",
      "author": "TTbulaski",
      "created": 1636455330,
      "upvotes": 3,
      "replies": {}
    },
    "hjxiq0t": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxiq0t/",
      "text": "I changed my major after the second semester of my fourth year. My major literally made me want to off myself and I spoke to mu parents and in the long run they just wanted me to be happy. I was planning to stick with my major and go to grad school for something else but I have pretty persistent depression and I was not going to make it through another year of my major. I hate my school so it was a headache to decide to spend more time here, but in the long run it’s worth it. \n\nIt sucks but seriously talk to your parents and change your major. It’s never too late. And especially if you’re interested in engineering bc you pretty much HAVE to have a bachelors in the field to go into that.",
      "author": "AStruggling8",
      "created": 1636462974,
      "upvotes": 3,
      "replies": {}
    },
    "hjxrvlz": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxrvlz/",
      "text": "You can always change your major but know that you can work at an engineering firm with a geology degree  too.",
      "author": "jojoisland20",
      "created": 1636467656,
      "upvotes": 3,
      "replies": {}
    },
    "hjyb7ph": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjyb7ph/",
      "text": "I loved geology. Made me hard as a rock.",
      "author": "BonsaiSlim",
      "created": 1636475828,
      "upvotes": 3,
      "replies": {}
    },
    "hjxh3xd": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxh3xd/",
      "text": "I’m 23F, an electrical engineering major and also almost completed my recreational pilots license. I think engineering classes would be very different than “how stuff work” but in the end you could probably work in just that. I also think I chose the wrong major however I’m 6 years in. Just switch. You’ll be only a year behind in theory. It’s not a big deal, I’m a year behind. Tell your parents you’ll pay for the last year, that you’ll make it up with internships. Take a class and see if you like it.",
      "author": "kapbear",
      "created": 1636462056,
      "upvotes": 2,
      "replies": {}
    },
    "hjxxwmu": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxxwmu/",
      "text": "Hey I completely understand how you feel, I’m also a Geology major although I graduated a couple years ago. \n\nI have a similar experience, I ended up enrolling in a Computer Science program the summer after I graduated and I’m about 2 years into my program. And I can tell you I made one of the best decisions for myself.\n\nIt’s never too late to pivot to another degree, it may take more time but at the end of the day those years will go by regardless. Do you want to be miserable? Or do you want to put in some extra effort and pursue a degree you’re passionate about.\n\nIf you do continue with Geology maybe look into Geological Engineering.\n\nGood luck and wish you the best on whichever path you choose!",
      "author": "SorceHounds",
      "created": 1636470349,
      "upvotes": 2,
      "replies": {}
    },
    "hjya8no": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjya8no/",
      "text": "Do you rather live having this miserable feeling for the rest of your life or rather change your major now and feel miserable only in the first couple years but eventually be happy with what you are done with?",
      "author": "E_Alrefa3e",
      "created": 1636475441,
      "upvotes": 2,
      "replies": {}
    },
    "hjye4ca": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjye4ca/",
      "text": "I just changed my major and I was graduating next semester, it’s never too late.",
      "author": "RenegadeHunter5",
      "created": 1636476979,
      "upvotes": 2,
      "replies": {}
    },
    "hjyg69g": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjyg69g/",
      "text": "Change it RIGHT NOW!!! Spending an extra year (or even two) now will be worth it for the rest of your life",
      "author": "moreddit2169",
      "created": 1636477788,
      "upvotes": 2,
      "replies": {}
    },
    "hjx84et": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjx84et/",
      "text": "Well dude depending on your concentration within geology maybe you can minor in something while still getting your degree also maybe talk to an adviser or the or whoever you need to Maybe you can still graduate on time with enough credits if you do summer classes you might have a double major on your hands if you've done all the core requirements you've got a year you might be able to take some summer classes and maybe graduate a little bit late but not a ton and maybe do a double major in geology and you said you were interested in machines maybe computer science or something but I would seriously talk to your adviser today or soon. Also I'm just saying depending on depending on your thoughts towards the master's degree if you get your undergrad you could do a masters in computer science business analytics or something like that which basically has you bitch basically has you programming using computers there's and that kind of thing or are you thinking more like mechanical engineering",
      "author": "pygmypuffonacid",
      "created": 1636455920,
      "upvotes": 1,
      "replies": {}
    },
    "hjxlp6z": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxlp6z/",
      "text": "Exactly how I feel about my major as a sophomore. In one of my main classes for this semester, I always feel sleepy and can’t focus on the class because it’s too boring for me. My major is uninteresting, uninspiring, and not motivating for me. But my uncle would NEVER let met change majors.",
      "author": "Caboverde-Evora",
      "created": 1636464594,
      "upvotes": 1,
      "replies": {}
    },
    "hjxs5d1": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxs5d1/",
      "text": "If you want to change your life path, go for it!\n\nAlso, if you want to become a pilot, also go for it. I know many women in college who are becoming pilots. Checkout the nonprofit Women in Aviation International.",
      "author": "Campbellgr3",
      "created": 1636467782,
      "upvotes": 1,
      "replies": {}
    },
    "hjxvgab": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjxvgab/",
      "text": "If you can switch your major now I did it after sophomore year? (Second year) and before third year (Junior). Honestly totally worth it don’t regret it for a second",
      "author": "SSM-",
      "created": 1636469273,
      "upvotes": 1,
      "replies": {}
    },
    "hjz3m38": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjz3m38/",
      "text": "It's funny you mention being an airline pilot! My dad is a retired airline pilot with a geography degree. Do you need a degree to be an airline pilot? Yeah. Does it matter what your degree is? No! Im a pilot myself and I encourage you work towards getting your private if possible. It's well worth it and can always be a career path if you have the principal for it",
      "author": "unfeelingsalmon",
      "created": 1636487068,
      "upvotes": 1,
      "replies": {}
    },
    "hjz7pzi": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjz7pzi/",
      "text": "I took a geology class for 2 days before withdrawing and taking a different class. It wasn’t very exciting",
      "author": "Away_Peak_5054",
      "created": 1636488706,
      "upvotes": 1,
      "replies": {}
    },
    "hjz7vcf": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjz7vcf/",
      "text": "My brother changed his major his junior year, it’s possible. Most classes will transfer over to your new degree, trust",
      "author": "Away_Peak_5054",
      "created": 1636488766,
      "upvotes": 1,
      "replies": {}
    },
    "hk018wd": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk018wd/",
      "text": "Just change it. People change their majors even in their senior year. Granted, you will probably have to stay in college longer because you need to take certain classes for your new major. I don’t understand why your parents would think being a pilot is a “man’s” job. That is really weird and I sympathize with you op.",
      "author": "JupiterRocket",
      "created": 1636500776,
      "upvotes": 1,
      "replies": {}
    },
    "hk03ux2": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk03ux2/",
      "text": "Girlie, it's never too late. Change your major now and find some happiness in the college life. You said your parents are paying for it and probably will be ok with it, so take advantage of it and change that major. You will graduate later, thata true, but who cares? Your happiness and mental health are more important than sticking to a crappy major.\nWords of a 27 years old undergrad who changed her major and is now in her senior year.",
      "author": "WilieFern",
      "created": 1636501925,
      "upvotes": 1,
      "replies": {}
    },
    "hk0mjpm": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk0mjpm/",
      "text": "I loved my geology GE classes so fun, it was the calculus heavy parts that made me pivot away from it. IF you're not happy with your major change it. Life is too short to be miserable all your working life, and there is a ton of working ahead of you so choose something you enjoy doing because even the most entertainig career choices are boring in teh long run when you do them for money so you wanna start in a good state of mind not already depressed about your job prospects. YOu can alwasy use your major to do different stuff so dont' feel because you're a geologist you have to work with rocks, the major itself will open other doors for you do some networking and google powers to know what else you can dowith that knowledge you have",
      "author": "metalsd",
      "created": 1636510319,
      "upvotes": 1,
      "replies": {}
    },
    "hjy03tf": {
      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjy03tf/",
      "text": "What can you even do with a geology degree?",
      "author": "Ph03n1x_5",
      "created": 1636471286,
      "upvotes": -1,
      "replies": {
        "hjztqi7": {
          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hjztqi7/",
          "text": "You're a CS major who hasn't figured out that every single metal and mineral in a computer requires a geologist to find it 🤡",
          "author": "woowuuwoowuu",
          "created": 1636497551,
          "upvotes": 0,
          "replies": {
            "hk01x55": {
              "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk01x55/",
              "text": "I thought they made that in labs nowadays. \nThis is how much Geologist make. Dunno if it's easy to get the job or not.\nhttps://www.payscale.com/research/US/Job=Geologist/Salary",
              "author": "Ph03n1x_5",
              "created": 1636501072,
              "upvotes": 1,
              "replies": {
                "hk0c67i": {
                  "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk0c67i/",
                  "text": "Oh yeah, labs where they can just conjure rare earth metals out of thin air.  I've heard of those.",
                  "author": "woowuuwoowuu",
                  "created": 1636505651,
                  "upvotes": 0,
                  "replies": {
                    "hk0cz21": {
                      "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk0cz21/",
                      "text": "https://www.google.com/amp/s/amp.iflscience.com/chemistry/new-form-of-labmade-gold-is-better-and-golder-than-natures-pathetic-version/",
                      "author": "Ph03n1x_5",
                      "created": 1636506015,
                      "upvotes": 1,
                      "replies": {
                        "hk0k7le": {
                          "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk0k7le/",
                          "text": "It's obvious you didn't read the article and only read the headline so I'll explain it in simple baby words you can understand: they put gold in a machine and made fancy gold.  If you had any critical thinking skills, of course, you'd realize that gold, along with everything in the lab, was mined somewhere, requiring a geologist.  But I'm not surprised a computer \"science\" major struggles to read even laughable pop science articles.  Guess you fell for the lern2code meme, enjoy being a cubicle monkey in a soon oversaturated field for the rest of your life.",
                          "author": "woowuuwoowuu",
                          "created": 1636509265,
                          "upvotes": 0,
                          "replies": {
                            "hk0l5ac": {
                              "link": "/r/college/comments/qpsoui/i_wish_i_would_have_switched_majors_its_too_late/hk0l5ac/",
                              "text": "I'm just saying something I heard from word of mouth, I never researched it until now. Either way, geology isn't my thing. BTW I'm just at the Associates level so no I don't really know how to code. Please stop taking everything so seriously lol. And no I don't really believe gold is made in a lab, I was trolling.",
                              "author": "Ph03n1x_5",
                              "created": 1636509690,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}