{
  "sid": "q4udgz",
  "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/",
  "title:": "My Advice: If you ever feel slow and dumb or are struggling in a class, focus on overcoming the difficulty instead of your intelligence and trust in that process",
  "text": "I mean my dad told me a story about when he was a student. He was in a spatial geometry class and he was the slowest one in the class. Everybody else seems to be much quicker then him. However, he never gave up and tried his best. He eventually overcame all difficulties and become even better at the subject then everybody else. \n\nI have a mental illness that causes me to constantly assess my intelligence and care too much about it, even if their's no evidence that I was struggling in any classes. I always think to the future about some difficult classes coming up and I'm worried I'm going to be the slowest and stupidest one in the class. I always have the tendency to put myself in the shoes of another (such as a mathematician) or to think myself in a certain situation (such as being in a programming class) and then always ending up forming the conclusion that I might be below average or stupid (even if I wasn't struggling in any classes this semester at all). I always think back to the one programming class in which I have to take as a accounting major that I struggled with more than others. I always go to my dad for advice when such thoughts pop up. \n\nMy dad's advice is usually this, and I feel it helped alot. He taught me to focus on the effort, not your innate talent or intelligence. He said for me to be positive and ignore such thoughts and focus on what you're supposed to be doing. I feel that this helped alot. I mean programming is kinda my own fault as I didn't work hard enough to overcome it and focused more on intelligence instead. \n\nMy dad taught me a story of how he's the slowest one at work (I'm not sure if he's making this up or not), he's a engineer. He said everybody is faster then he is at figuring stuff out, however he still didn't feel discouraged or give up (despite not being the sharpest knife in the drawer). Instead he used whatever cards that he's dealt to work hard to figure things out (even if it takes him longer) and asks other's for help when needed. Eventually he ends up performing equally as well or even better then the people that are supposedly smarter and quicker.\n\nThe point of me telling everybody this is that if you ever feel that you're slow and dumb and aren't the sharpest knife in the drawer, you shouldn't focus to much on the fact that you aren't naturally smart or as quick witted as some other people. Instead you should focus on trying to overcome the difficulty and believe in the fact that if you try hard enough and never give up, everything's eventually going to click. If you struggle with applying what you learned or with logical thinking, do more practice and eventually things would get easier. \n\nRemember their are people with good genes that don't make the best of their abilities simply because they're lazy and that hard work beats talent when talent doesn't work hard. \n\nIf you're naturally smart, then great. But if you aren't, just trust in the process and not give up.",
  "author": "malarkeyasian",
  "created": 1633814604,
  "updated": 1634083010,
  "over_18": false,
  "upvotes": 896,
  "upvote_ratio": 0.99,
  "comments": {
    "hg12fa0": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg12fa0/",
      "text": "Your Dad was a wise man! Very good advice and you are obviously a smart person to take his advice to heart this way.",
      "author": "rainynighthouse",
      "created": 1633815428,
      "upvotes": 81,
      "replies": {
        "hg13307": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg13307/",
          "text": "Thanks",
          "author": "malarkeyasian",
          "created": 1633815730,
          "upvotes": 15,
          "replies": {}
        },
        "hg13jl3": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg13jl3/",
          "text": "My dad's advice actually helped me with my mental issues and to become more hopeful about the future.",
          "author": "malarkeyasian",
          "created": 1633815940,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hg1rij4": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1rij4/",
      "text": "I honestly needed this. I am a bio major currently taking chem and calc and for some reason, I question if I have the ability to do research if I can't figure out these problems using critical thinking skills. I make small mistakes and I get so hard on myself.",
      "author": "Asleep_Cut505",
      "created": 1633827590,
      "upvotes": 26,
      "replies": {
        "hg1t8v6": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1t8v6/",
          "text": "Don't be hard on yourself, critical thinking skills takes practice and you'll get better at it through practice.",
          "author": "malarkeyasian",
          "created": 1633828448,
          "upvotes": 4,
          "replies": {}
        },
        "hg1u61q": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1u61q/",
          "text": "Just to know, I'm the slowest in my programming class. So don't worry, you're not the only one, and you're definitely not the slowest.",
          "author": "malarkeyasian",
          "created": 1633828912,
          "upvotes": 5,
          "replies": {}
        },
        "hg3onr5": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg3onr5/",
          "text": "If it’s any consolation, research is nothing at all like what you do in classes. The content you’re learning now is important as a foundation, but you’re not going to need the same skills in research as you need to study for a class. The best way to know if you’re cut out for research is to do actual research, so start applying to those summer programs!",
          "author": "officially_anxious",
          "created": 1633873075,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hg19vdp": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg19vdp/",
      "text": "Modern Universities are not about intelligence. It is about your work ethic and the ability to handle stress.",
      "author": "MIA_AIM1",
      "created": 1633818917,
      "upvotes": 49,
      "replies": {
        "hg1c0nq": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1c0nq/",
          "text": "Degrees in relevant fields are simply a means for employers to understand your work ethic and maybe some projects/work you’ve done in that period",
          "author": "cam0kazi",
          "created": 1633819940,
          "upvotes": 20,
          "replies": {
            "hg1dwkg": {
              "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1dwkg/",
              "text": "That's true for social science and liberal arts majors.",
              "author": "malarkeyasian",
              "created": 1633820859,
              "upvotes": 6,
              "replies": {
                "hg1rtg8": {
                  "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1rtg8/",
                  "text": "It’s also true for a computer science major (me)",
                  "author": "cam0kazi",
                  "created": 1633827740,
                  "upvotes": 7,
                  "replies": {
                    "hg1t2n6": {
                      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1t2n6/",
                      "text": "Really?",
                      "author": "malarkeyasian",
                      "created": 1633828361,
                      "upvotes": 1,
                      "replies": {
                        "hg28f4y": {
                          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg28f4y/",
                          "text": "Comp Sci is a _bitch_ to learn if you don’t have the work ethic for it. The only way you can actually get good is through constant practice, there’s no one solution for any problem, and sometimes things just don’t work no matter how hard you try. \n\nBut when it does work though… holy shit, it feels good.",
                          "author": "kakusei_zero",
                          "created": 1633836225,
                          "upvotes": 10,
                          "replies": {}
                        },
                        "hg1v7ti": {
                          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1v7ti/",
                          "text": "Mostly depends on the kind of job you do.\n\nAlso, to get a degree in computer science, you'd already prove somewhat your intelligence.",
                          "author": "AcademicDifficulty",
                          "created": 1633829430,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hg436hf": {
                  "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg436hf/",
                  "text": "I am in gradschool for chemistry. This has nothing to do with social science.",
                  "author": "MIA_AIM1",
                  "created": 1633879949,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hg1l595": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1l595/",
          "text": "This is relevant to your specific field. There are some fields (e.g., robotics, AI, etc) that require a high level of intelligence to shine.",
          "author": "AcademicDifficulty",
          "created": 1633824404,
          "upvotes": 8,
          "replies": {}
        },
        "hg1atz6": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1atz6/",
          "text": "Agreed",
          "author": "malarkeyasian",
          "created": 1633819370,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hg1mol7": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1mol7/",
      "text": "Yeah this is how I came to terms with my relatively lukewarm grades on exams. Just do your best.\n\nJust remember not to compare yourself to others. Just know that you did the best you could do and you gave it your 100%, that the grade you received is representative of what you got. Even if you put in 101% of your effort, there wouldn't even be a difference in how you did. And a 91 is really close to a 96 if you really think about it. A 78 is close to a 90 if you also really want to think about it.\n\nExam scores are a reflection of how you did with the questions you were asked, not what you know completely. I take pride with how much work I put into studying that whatever grade I got, that was an accurate measurement as to how well I did. Even if I wasn't the highest grade in the class, I was convinced that I knew more and worked harder than most people in that room. If I got the lowest grade in the class, I would be upset of course, but I know that I could not have done any better.\n\nIf my professor were to come up to me and ask \"was that the best you could do?\", I wouldn't even take offense to that question. \n\nThat's how I've come to terms with getting these \"low\" grades on exams, but ended up being really happy because it was the best I could do. Cliché advice, but you learn to be proud of what others may deem \"not good enough\". As long as you're happy with it and you know you couldn't possibly have done better, than that is a grade well earned. It's not about settling for a lower grade, it's about taking pride in the grade you got.",
      "author": "Athragio",
      "created": 1633825183,
      "upvotes": 7,
      "replies": {}
    },
    "hg2e1xy": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg2e1xy/",
      "text": "Fact: all computation reduces to addition.  If you understand this fact you already understand math better than many mathematicians and math professors.  This fact pisses off a LOT of confused people that think math has some magic quality to it, but Alan Turing settled it in 1936 (ref Turing Completeness).\n\nIf you understand addition you can learn any math (given time and practice).  \n\nThe problem is that math is a language and we don't teach it like a language.  The way to become good at a language is to use it everyday.",
      "author": "OVSQ",
      "created": 1633839140,
      "upvotes": 3,
      "replies": {}
    },
    "hg3arcp": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg3arcp/",
      "text": "ugh, I feel this. Yesterday, I was struggling to do basic arithmetic in my head that my mom didn't even have to think twice about before answering.",
      "author": "GimmeSomeBreadHomie",
      "created": 1633864175,
      "upvotes": 5,
      "replies": {}
    },
    "hg1woob": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg1woob/",
      "text": "Thanks for making this post. This is something I’ve been waiting to hear from someone else for a long time. The point you made about effort is true btw as it is something that has helped me get where I am today.",
      "author": "c_randazz",
      "created": 1633830150,
      "upvotes": 3,
      "replies": {}
    },
    "hg29iq4": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg29iq4/",
      "text": "Give your dad a hug from me. More students need to hear that it's not about natural talent, it's finding the best way for you to overcome obstacles.",
      "author": "DontFeartheTeacher",
      "created": 1633836783,
      "upvotes": 3,
      "replies": {}
    },
    "hg3oms0": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg3oms0/",
      "text": "Thank you for posting this ❤️",
      "author": "_clownsocks",
      "created": 1633873061,
      "upvotes": 3,
      "replies": {
        "hg48yic": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg48yic/",
          "text": "You Welcome",
          "author": "malarkeyasian",
          "created": 1633882485,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg23hpt": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg23hpt/",
      "text": "Cheers to those of us who have to work hard for what we get.",
      "author": "PhilosophicalElk",
      "created": 1633833611,
      "upvotes": 2,
      "replies": {}
    },
    "hg26tgv": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg26tgv/",
      "text": "Good post",
      "author": "okThisYear",
      "created": 1633835373,
      "upvotes": 2,
      "replies": {
        "hg27hdi": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg27hdi/",
          "text": "Thanks",
          "author": "malarkeyasian",
          "created": 1633835726,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg2pf8h": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg2pf8h/",
      "text": "I have a similar problem but I just accepted I'm stupid and there's nothing I can do about It and just sort of chill with all my negative emotions",
      "author": "Boring123af",
      "created": 1633846774,
      "upvotes": 2,
      "replies": {}
    },
    "hg2qlj4": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg2qlj4/",
      "text": "I like this!!!!! 🌈🌈🌈",
      "author": "mcspicyisgood",
      "created": 1633847697,
      "upvotes": 2,
      "replies": {}
    },
    "hg36pjp": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg36pjp/",
      "text": "That's what i love about my dad as well",
      "author": "wsgh23",
      "created": 1633860775,
      "upvotes": 2,
      "replies": {}
    },
    "hg3brrv": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg3brrv/",
      "text": "Dads are underrated. Miss my own Dad.",
      "author": "Chi-Cam",
      "created": 1633864978,
      "upvotes": 2,
      "replies": {
        "hg49078": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg49078/",
          "text": "Wait, he's dead or are your parents divorced?",
          "author": "malarkeyasian",
          "created": 1633882507,
          "upvotes": 1,
          "replies": {
            "hg4da4l": {
              "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg4da4l/",
              "text": "Sadly, my dad passed March of last year.",
              "author": "Chi-Cam",
              "created": 1633884383,
              "upvotes": 2,
              "replies": {
                "hg4dw63": {
                  "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg4dw63/",
                  "text": "😔😔",
                  "author": "malarkeyasian",
                  "created": 1633884650,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg3g43w": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg3g43w/",
      "text": "Think about how long it took you to fully master something fairly simple, like running a cash register at work or learning to drive.  If simple things take time to master, then it makes sense for something more complex to take more time.  That's what I tell myself when I feel dumb.",
      "author": "Traditional_Self_658",
      "created": 1633868085,
      "upvotes": 2,
      "replies": {}
    },
    "hg3plg8": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg3plg8/",
      "text": "I needed this. I’m am an engineering major and lately I’ve been feel inadequate. My friends and I study together but I keep getting lower grades than them. Last Thursday, I was real upset about it. Now that it’s the weekend I’m trying to get ahead so I can spend more time overcoming my difficulties",
      "author": "effervescenteel",
      "created": 1633873542,
      "upvotes": 2,
      "replies": {}
    },
    "hg47sv5": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg47sv5/",
      "text": "I have ADHD combo, anxiety and ptsd, so I've had to overcome my own issues to get through a lot of things in life. But, I love your father's advice. I just previewed what my final two years are going to be for my major and some professional options and I am feeling ..not so confident lol. I'm so much older than most of you, in my 40's and I find these choices scary! So I'm impressed with you all.",
      "author": "comfort_fiend",
      "created": 1633881973,
      "upvotes": 2,
      "replies": {}
    },
    "hg4a9sp": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg4a9sp/",
      "text": "thanks, made me feel more motivated <3 i feel a bit better now",
      "author": "sxmmerlin",
      "created": 1633883068,
      "upvotes": 2,
      "replies": {
        "hg4em68": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg4em68/",
          "text": "You welcome.😉\n\nBy the way, what's your major?",
          "author": "malarkeyasian",
          "created": 1633884969,
          "upvotes": 1,
          "replies": {
            "hg4jbcz": {
              "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg4jbcz/",
              "text": "Bio (pre-med). Struggling in handling my bio, chem, English, and calc classes altogether lol",
              "author": "sxmmerlin",
              "created": 1633886946,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg4jcac": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg4jcac/",
      "text": "Thanks for the post tho! Really needed this since I'm kinda having difficult times with my current semester & I'm feelin dumb asf.",
      "author": "dyinglittlestar",
      "created": 1633886957,
      "upvotes": 2,
      "replies": {}
    },
    "hgb7cc4": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hgb7cc4/",
      "text": "Needed this- thanks to you and your dad : )",
      "author": "DoubleAA777",
      "created": 1634008265,
      "upvotes": 2,
      "replies": {
        "hgb7egv": {
          "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hgb7egv/",
          "text": "You Welcome :)",
          "author": "malarkeyasian",
          "created": 1634008292,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg2g8l9": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hg2g8l9/",
      "text": "[removed]",
      "author": null,
      "created": 1633840413,
      "upvotes": 1,
      "replies": {}
    },
    "hgcuejv": {
      "link": "/r/college/comments/q4udgz/my_advice_if_you_ever_feel_slow_and_dumb_or_are/hgcuejv/",
      "text": "[removed]",
      "author": null,
      "created": 1634048161,
      "upvotes": 1,
      "replies": {}
    }
  }
}