{
  "sid": "q66zwx",
  "link": "/r/college/comments/q66zwx/need_advice_on_choosing_a_major/",
  "title:": "Need advice on choosing a major",
  "text": "So I’m currently a secondary education major with biology as my concentration. I’m doing bad in biology rn and have a 75 and soon will go lower after my recent quiz grade is added in. I decided to change my major but my problem is I suck at math and writing. I embarrassed myself and couldn’t figure out what 3 x 9 was and usually get low scores on essays. I’m also not really enjoying education so I thought of switching to something. I found history interesting but it’s kinda useless. I want to do something I can handle and something that’s useful so I can get a job at least. It’s hard to give me advice since I suck at both important things in pretty much all subjects.",
  "author": "hibius",
  "created": 1633989737,
  "updated": 1634082941,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hgb52t5": {
      "link": "/r/college/comments/q66zwx/need_advice_on_choosing_a_major/hgb52t5/",
      "text": "You suck at math *and* writing?? For most people it’s one or the other. Not making fun or anything, I’m just surprised because pretty much any industry does one or the other. I’m going to be real with you because I’d rather potentially hurt feelings than be unrealistically optimistic and put somebody in financial ruin. If you can’t solve 9 x 3, college is not for you. \n\nHere are some options you can take, but only YOU will know what is right for you:\n\n1. Food service, retail, call center, or a basic(very basic) office job. I’m guessing you don’t want to go down this path because, let’s be honest, these are some of the worst jobs out there in terms of both job satisfaction and pay.\n\n2. The trades - welding, electrician, plumbing, etc. Low job satisfaction but with good pay at least compared to the above.\n\n3. Healthcare or IT - you can get into these industries with just an associates degree and/or certifications. This is probably a good compromise for someone who hates college but doesn’t want a bad job.\n\n4. Review the basics to make you college ready - Despite me saying that college isn’t for you, I wasn’t being 100% truthful, but it will take an absurd amount of dedication and time(likely more than the average person has). YouTube, udemy, and khan academy are great resources to get caught up to speed. If you think you REALLY want to go to college for 4 years, this is your best option.\n\nWhatever you choose is up to you, but you should weigh the pros and cons, as well as the risk level, investment cost, and whatever other factors there might be. Good luck.",
      "author": "evasiveshag",
      "created": 1634007219,
      "upvotes": 2,
      "replies": {}
    },
    "hga7vfp": {
      "link": "/r/college/comments/q66zwx/need_advice_on_choosing_a_major/hga7vfp/",
      "text": "It really just depends on what you see yourself doing in the future. Can you see yourself teaching but you’re just not enjoying the classes, or did you just get into the teaching major because you couldn’t think of anything else? It’s important to really consider what you actually see yourself doing in the future because sometimes that does mean you’re going to have to suffer through some unpleasant courses.",
      "author": "havengrace1102",
      "created": 1633991538,
      "upvotes": 1,
      "replies": {}
    }
  }
}