{
  "sid": "qbayuk",
  "link": "/r/college/comments/qbayuk/college_sucks_i_feel_so_alone/",
  "title:": "College sucks. I feel so alone.",
  "text": "Both me and my bff that I’ve known for more than a decade recently started college. The thing is, it’s not the same college. I knew that it would be hard bc I had her all my life and now that she’s not around to go to parties with me and introduce me to new people, I don’t know what to do. I am not a socially awkward person but I don’t really make the first move on someone.. like ever... (INFP here) \n\nI’m feeling emotionally unstable and people around here are SO rude like tf? They’re not even friendly, even if I was able to make the first move (like go say ‘hi’) no one is willing to be someone’s friend. \n\nI’m seriously doubting my decision to go to college. I feel so lonely and my roommates are longtime BFFs. I feel so left out and I wouldn’t say that they’re friendly either. I moved to another city ONLY for this college and it feels like I’m drowning right now. Is there a way to meet NICE people? I’ve never been this alone and if I meet some nice people, I’m willing to go talk to them first.",
  "author": "Kelsey_Morris",
  "created": 1634648286,
  "updated": 1636181840,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hh8ob30": {
      "link": "/r/college/comments/qbayuk/college_sucks_i_feel_so_alone/hh8ob30/",
      "text": "I'm INFP too, while sometimes its a bit tough to talk to anyone, just know that many people are feeling the same thing as you are. Find people who are in proximity to you in classes and just ask how they are. I also  started carrying around a game of Exploding Kittens in my bag and asking people to play and talk",
      "author": "GoldRequest",
      "created": 1634656151,
      "upvotes": 7,
      "replies": {}
    },
    "hhalgrm": {
      "link": "/r/college/comments/qbayuk/college_sucks_i_feel_so_alone/hhalgrm/",
      "text": "Hi, (omg a fellow INFP). Yeah, in the start it is difficult to socialize with people. You can encounter rude people in your classes and some friendly ones, but mostly rude people. smh I hate it when it happens. What I did is I joined clubs and tried to talk to them. The best thing that happened to me is I found a group exclusive for the first-year students. It was fun. I hope your university has a similar program, especially for freshpersons.",
      "author": "frozenmonkeys",
      "created": 1634684480,
      "upvotes": 4,
      "replies": {}
    },
    "hha6x45": {
      "link": "/r/college/comments/qbayuk/college_sucks_i_feel_so_alone/hha6x45/",
      "text": "You're not alone in how you feel. I understood what you described 100%. Finally made close friends in high school and they're back home and I'm in a different state. A lot of people in college are unfriendly and if they're not, they either already have close friends or they just don't click. \n\nI would say try going to very specific interest group clubs where everybody has to be passionate to be there. They clubs are also going to be smaller and more intimate than a huge popular org on campus. That's what I'm going to give a shot at least. \n\nGood luck! You're giving something new a shot for your future. Don't forget that you're trying and remember there's support waiting back for you at home. (also, INTP here)",
      "author": "postaloney",
      "created": 1634678053,
      "upvotes": 3,
      "replies": {}
    },
    "hhc4f57": {
      "link": "/r/college/comments/qbayuk/college_sucks_i_feel_so_alone/hhc4f57/",
      "text": "Push yourself to talk to people, and then just give it time.  Talk to classmates before class.  Talk to other people in your dorm/building. Join clubs.  \n\nOnce you do that regularly, a few of them will \"stick\" and become friends. It will take time though.",
      "author": "time2trouble",
      "created": 1634715308,
      "upvotes": 1,
      "replies": {}
    }
  }
}