{"sid": "igbfy1", "link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/", "title:": "I am not a human being during the academic year", "text": "From 8am to 12am, I am working on readings and assignments, with breaks to fulfill my basic needs for food and exercise. Four years in and I still have not been able to strike a balance and feel like a person again. Life feels so fulfilling and meaningful outside of college, to the point where a 40hr/week 9-5 job feels like the most freeing and life-affirming experience in the world. Have any of you felt this way and what changes did you have to make to get there? I find myself getting depressed and wishing away what's supposed to be a really enjoyable time.", "author": "shoegraze", "created": 1598359477, "retrieved": 1632947201, "over_18": false, "upvotes": 1462, "upvote_ratio": 0.98, "comments": {"g2zu9k7": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2zu9k7/", "text": "I keep coming back to this thread because I relate to it so much. The academic year destroys me and I absolutely dread every single semester; the only thing that keeps me going is chewing caffeine pills and knowing that one day the pain will end.", "author": "the_bririonman", "created": 1598507180, "upvotes": 1}, "g2wi2ss": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2wi2ss/", "text": "do you have issues with attention and focus? like you’re sitting down and “working” for 12+ hours but you’re only actually being productive for like 1/4 of the time? this was my life & i just got diagnosed with ADHD at age 20\n\nif not & you really are focusing the entire time then no this is not a normal experience. you may need to just set boundaries with yourself (ie. “i work 9-5 on work on weekdays and 8a-12p on saturdays with sunday off, or something equivalent) and just put down the work outside of that. your grades my drop a little, but if you can’t hold a 3.6+ truly working for over 40hrs a week then i worry about what major you have and how your experience in your job field will be.\n\nedit: spelling\n\nsecond edit: i read some of your replies and saw that you mentioned you do super well in math but struggle with gen ed classes. this is an ADHD thing. being really good at stuff you’re interested in but having a hard time with “easy” classes (especially reading heavy ones) is super common for ADHDers. check out r/ADHD and see if you resonate with any of the posts over there", "author": "neuro-sigh-ence", "created": 1598443936, "upvotes": 1}, "g2wc3ms": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2wc3ms/", "text": "I definitely feel you. I'm studying medicine and almost every week was an 80 hour week for me. \"During semester\" or \"close to exams\" are not distinguishable to me, as I struggled to just keep up with the work you're constantly getting in.  Our lecture times range from 10 to 15 hours per week, on top of that we have 4-h-labs and 2-h-seminars as well as protocols and sometimes essays to write. It didn't even depend on wanting to score high or not, to just pass the exam you had to at least have seen all the material and that alone was time-shredding to say the least. Of course, this is somewhat expected of med schools and law schools, but I'm just trying to give some perspective that there are curriculums where you can be as smart and efficient as you like, they'll still demand every waking hour from you because of the large amounts. Then of course, it's your choice to chose such a degree in the first place.", "author": "Sm_kr", "created": 1598438749, "upvotes": 2}, "g2vqvam": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2vqvam/", "text": "OP, this isn’t normal, and you should most likely look for some form of help - whether it’s tutoring or some form of therapy for your depression. \n\nI don’t mean to discourage you or anything, but I’m currently a full-time 15 hour engineering student and work a full time job and still have free time to spend with my family and friends. I think your problems may lie somewhere outside of school. \n\nBest of luck to you in your studies. I sincerely hope you manage to find a balance. Never be afraid to reach out to your professors for help, I cannot tell you how many times they have given me extra time due to a work overload. They are there to help you! \n\nAgain, best wishes to you!", "author": "SendHelpVeryDrunk", "created": 1598417908, "upvotes": 1}, "g2vpy56": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2vpy56/", "text": "I did this for like a week before finals week in undergrad.", "author": "wizardcu", "created": 1598417204, "upvotes": 1}, "g2vnhmx": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2vnhmx/", "text": "Hard work pays off my! But don’t sacrifice your social life. Make sure you are constantly taking to friend :)", "author": "Benjimula", "created": 1598415427, "upvotes": 1}, "g2vekwi": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2vekwi/", "text": "I'm just surprised to see so many people saying this isn't normal. I thought that was what college is. I do the same thing and I expect it, I even enjoy it to a point until I get too burnt out for the semester. Whatever credit hours a course is I assume that means spending double that or more studying outside of class to actually feel like I know the content. I also repeat videos in the background a lot to help with that repetition. That being said I do understand that I'm one of the more I don't want to say smarter but one of the ones whose in the group with the better grades although never as good as I would like. I just figure I'll be done with school eventually and get to switch to a 9-5 job and until then this is my life.", "author": "Pacman042", "created": 1598410066, "upvotes": 1}, "g2veibh": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2veibh/", "text": "All my life I’m told “enjoy college while you can, once you’re out you’ll work for the rest of your life and you’re going to hate it”\n\nBro I’ll let you know right damn now, I graduated this May and scored a nice job that I’ve been at for about a month now and holy hell I have never been LESS STRESSED. \n\nLife is amazing right now. I work 7-3:30 M-F and any time that is not in that schedule is *ME* time. I get home from work and I am DONE working. I can relax, I can play games, I can watch a movie, I can play with my dog, I can work on house projects, I can have a glass of whiskey, and hell, I can look at Reddit for 5 hours straight without worrying about a single homework assignment or test to study for. \n\nScrew college. It was not fun. I’m having more fun now than I ever did in college. I don’t have the constantly looming threat of due dates over me any more. I don’t wake up realizing I forgot to print or submit something anymore. I don’t have to constantly update an overflowing calendar anymore. I wake up and go to work and then I am done. Work life stays at work. \n\nTo summarize, yes I have absolutely felt like a college machine that does nothing but eat, do homework, and deprive myself of sleep. Stop letting people tell you what is the best part of your life. If you work over the summers and you love working that 40 hour week, don’t let anyone tell you different. You love to do what you love to do, and nobody is taking that away from you", "author": "DreadedPopsicle", "created": 1598410027, "upvotes": 3}, "g2v7emg": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2v7emg/", "text": "I'm the same way. I've also been diagnosed with ADHD. I'm also a perfectionist that sees anything beyond perfection as failure. I'm still waiting for the class that drops me below a 4.0. Usually after spending 16+ hours a day, 7 days a week studying, and trying to keep up with no breaks and no opportunity to unwind, I find myself an anxious disaster that cries randomly for no reason at all several times a day. There is no joy in my life anymore. I don't know how to fix it but you're not alone.", "author": "eirilyn", "created": 1598406136, "upvotes": 2}, "g2v6z5y": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2v6z5y/", "text": "Are you also working full-time while studying? I think you may need to use some time management techniques to give yourself a break.", "author": "jenboas", "created": 1598405909, "upvotes": 1}, "g2v4hdc": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2v4hdc/", "text": "You’re an undergrad? This ain’t normal at all. Go to the doctor, you may have ADD or some other deficiency that affects your studying.", "author": "03755booty", "created": 1598404533, "upvotes": 1}, "g2v0ysh": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2v0ysh/", "text": "Get screened for add", "author": "saturnsbitc", "created": 1598402590, "upvotes": 1}, "g2v05uo": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2v05uo/", "text": "This is exactly my experience. I study from the beginning until the end of the day on most days. I typically eat one meal a day because I don't have time to eat any more. Life during each semester feels like being trapped in a hellish purgatory where the only thing that matters are grades. I often wish that I simply worked a normal job instead of killing myself at school constantly. At this point I'm at the end of my 3rd year with a 4.0 and it all just feels empty.", "author": "WashiBurr", "created": 1598402146, "upvotes": 7}, "g2usr6e": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2usr6e/", "text": "Maybe I should just make my own post but I only feel like a human being during the academic year.", "author": "Fritz___", "created": 1598398021, "upvotes": 2}, "g2urwv7": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2urwv7/", "text": "I feel this completely, and I’m starting my 3rd year of college. I literally just said “I’m reminding myself already that I only have 2 years left of school” and classes started yesterday. School has me so depressed, but I’m dealing with it because it helps for a better future. I’m working part time not full like you, and I’m still stressed to a ridiculous level. I major in management with hopes of getting into real estate so I could only imagine if your major is harder. You got it...we got it🤝.", "author": "Impossible-Pace", "created": 1598397569, "upvotes": 3}, "g2ur6r4": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2ur6r4/", "text": "You know, to be honest, I’m the opposite. I miss the hell out of school. I enjoyed having that drive towards a singular goal that I felt like I had to achieve at all costs. Now, I’m just doing my job and that feeling does come around now and again, but it’s not the same.", "author": null, "created": 1598397174, "upvotes": 2}, "g2uowb8": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2uowb8/", "text": "I don't mean to be rude but no matter what your major is, I find it hard to believe you're working efficiently at all if you study that much everyday. There is a point where studying too much is counter productive and when I hear stories of people studying this much I think it is much moreso people being inefficient than school being that hard or time consuming.There is no world where everyone else in your major or majors are studying this much. Being efficient with time is a more important life skill to learn than whatever it is you're studying that much for every day. I've known many stem majors, med school students, and stem PhD students who have a study/work life balance that is healthy for the most part. It is possible no matter what your field is. The only way your studying is efficient for that long is if you have like a triple major worth of courses happening at the same time.", "author": "SGKurisu", "created": 1598395933, "upvotes": 2}, "g2umuv4": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2umuv4/", "text": "Funny thing is I love school and hate working it's just about perspective ig", "author": "bald_butte", "created": 1598394818, "upvotes": 1}, "g2umffv": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2umffv/", "text": "I am the same way. PM me if you need someone to talk to", "author": "ChristhegreatI", "created": 1598394586, "upvotes": 1}, "g2um0ze": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2um0ze/", "text": "Yep, that’s close to the life of a music major.", "author": "aaathomas", "created": 1598394370, "upvotes": 3}, "g2ulbh9": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2ulbh9/", "text": "Weird flex but okeee:)", "author": "TheEpicMoe", "created": 1598393991, "upvotes": 2}, "g2ukctt": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2ukctt/", "text": "OMG YES!!!! I totally agree with you... Going to work is amazing!!! I work part time but I love gong to work instead of doing school work. Ive been in school for 6 yrs now and I feel like I have been a robot for like 6 yrs. I just want to do something FUN!!!! AHHHHHH!! Lol... This is my 7th yr of school now so I'm kind of losing it. I feel like the best thing you can do is try to enjoy the present even though there is not much free time, just enjoy the free time that you do have :)", "author": "radchicken23", "created": 1598393483, "upvotes": 2}, "g2ujq2x": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2ujq2x/", "text": "that’s how I felt when I was a music ed major and had to take 8 classes a semester to be considered a full time student", "author": "WingsofRain", "created": 1598393150, "upvotes": 2}, "g2ujoby": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2ujoby/", "text": "This is me. I’ve never been able to do well in school and have interests outside of that and be happy. I have to spend all my time just trying to pass. It’s so sad.", "author": "Strawberries53", "created": 1598393125, "upvotes": 2}, "g2ujo1z": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2ujo1z/", "text": "i think you need to take some pressure off yourself. do your assignments really require that amount of time to complete, or are you anxious about putting the maximum amount of effort in? we're living in a pandemic, nothing matters that much and i promise your professors won't mind if you're not putting 100% in. \n\nif the coursework is the problem, you need to switch majors, maybe switch to something in a similar field if it's something you're passionate about. \n\nif it's not these things, try prioritizing your breaks and make them something you can look forward to by picking up a hobby. teaching yourself a new hobby does wonders! \n\ngood luck my friend, wishing you well this school year!", "author": "longfurbymother", "created": 1598393121, "upvotes": 3}, "g2uj423": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2uj423/", "text": "This is the most relatable thing I've read in awhile, and it is the reason I have felt so at peace during quarantine. Yes, I've still had school for much of that time, but I haven't had to attend class or make the commute to school. So far, it has all been asynchronous, but that's changing in the coming semester, which I am dreading. I am so tired of feeling like a machine rather than a person.\n\nI also find it frustrating that everyone talks about prioritizing self-care as the solution. It is really nice in theory, but the problem is that, in reality, it just isn't an option that I have. There literally is no time for self-care. I'm lucky to be able to shower most days. :( And before anyone tells me there's a problem, it's mostly just with the amount of work my teachers give me. Some classes are better than others.\n\nI can't wait for college to end.", "author": "yellowdaisycoffee", "created": 1598392827, "upvotes": 3}, "g2udkk1": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2udkk1/", "text": "I’m jealous that you feel that away about a 9-5 job, I’m the opposite, if I could spend all my time doing classwork I would. Feels like it has purpose. I’m sorry you’re in such a bad place, wish I could help.", "author": "officialkodos", "created": 1598389997, "upvotes": 2}, "g2uc8iu": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2uc8iu/", "text": "it seems like you’re doing more work than any other student somehow, but on the bright side, college is temporary and work life is basically forever so if you enjoy working 9-5 that’s good", "author": "2001questions", "created": 1598389318, "upvotes": 1}, "g2uc4b1": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2uc4b1/", "text": "This is really bad to hear. I’m in high school and my high school experience has been exactly like this. School from 8am-3:30 pm. Extracurricular 4-5:15. Get home and start studying by 6pm till about 1 am with some breaks for like food and just moving around and checking my phone. Im high school I probably study(including homework) for about 40 a week outside school. I deprived myself of a teenage life because growing up I had major learning disabilities and I was really bad at school. Teachers told my parents that I wouldn’t be able to graduate. I wanted to prove them wrong and now I’ve worked my way in high school to be eligible for Top 30 colleges at least. However I hoped this would end after high school because I could hopefully have some kind of a social life in college but looks like that’s not going to happen. Looks like college will be even worse than high school.", "author": "VTDMAN7", "created": 1598389259, "upvotes": 5}, "g2uawx4": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2uawx4/", "text": "Do you get distracted a lot? Doze off? I did a lot of that and spent way more time than I had to doing menial school stuff. Turn the phone off and schedule your days/weeks and you’ll save time. \n\nIf you do all that already, I got nothing for you. Maybe swap majors if you don’t like the lifestyle", "author": "Raymx3", "created": 1598388661, "upvotes": 1}, "g2u8mwh": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u8mwh/", "text": "I’m a premed student and I feel this a lot.  I think it’s mostly just being incredibly neurotic towards each assignment so you can get the grade you want.  Organic Chemistry is the class that really causes me to spend hours upon hours of learning.  Those saying that they should spend around 3 hours per week per class are wrong.  I go to a rather large University and for each of my stem classes they suggest 8 hours a week per class.  I am also a learning assistant which is a class and I take hours to fix and write my own schedules for the class I lead, with things like research and other leadership positions required to graduate, these can eat up a lot of your time", "author": "OctoFlatulance", "created": 1598387538, "upvotes": 3}, "g2u8ija": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u8ija/", "text": "What are you majoring in?", "author": "CarrawayLights", "created": 1598387479, "upvotes": 3}, "g2u7pa9": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u7pa9/", "text": "Are you exaggerating? I could understand that kind of schedule if you were going to school full-time and also working, but you shouldn't need anywhere near that amount of time for 12-15 credit hours. I think you should focus on 'working smarter not harder'.", "author": "BigMoneyYolo", "created": 1598387085, "upvotes": 2}, "g2u7khq": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u7khq/", "text": "Nope I loved college.", "author": "transferingtoearth", "created": 1598387020, "upvotes": 1}, "g2u74pg": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u74pg/", "text": "Oh yes I totally relate. Working is a breeze compared to college", "author": "124579-okkkkkkkk", "created": 1598386806, "upvotes": 5}, "g2u6d8y": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u6d8y/", "text": "I have the same issue. The causes of it seem to be:\n\n* Not pacing work properly (i.e. a mix between always trying to finish things as soon as they are assigned + procrastination as well)\n* Not taking breaks while working or studying\n* Poor sleep --> making it take longer to complete tasks and focus\n* Putting in more effort than required even if we KNOW the difference in the result will be negligible (e.g. if I already have enough buffer in my grade to take a few hits, don't grind too hard!)\n* Not knowing when to give up on an extremely difficult, thought-intensive assignment (either come back to it later after doing other work that's less stressful, or accept the loss)\n\nI also agree that 9-5 jobs allow me to feel like a human for obvious reasons. Even when there is work to do after working hours, it's never even close to the amount and difficulty that comes from college work, and it's probably in your area of expertise.\n\nWant some actionable advice right now? Get an app like Toggl which will help you track how much time you're spending on tasks every day. It's pretty eye-opening.\n\nSee if you can correct some of the pitfalls I listed. I'm still far from feeling free, but I'm seeing gradual improvement each semester.", "author": "PacnetNetty", "created": 1598386440, "upvotes": 39}, "g2u68bc": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u68bc/", "text": "Yeah I agree with the comments and I mean this nicely, but check if you’re struggling with work. I had trouble with my first major and I used to put in 3X the work compared to my friends. I got help and then eventually switched my major. My point is that seek help from a counselor for time management and see if you need help with any academics or anything. You need to have a life man. Not saying you need to change a major or anything but you might see if you’re struggling with something and that way you can have time to relax and do things you love \n\nI switched my major my sophomore year and graduated in 3 years total. So basically i completed my undergrad major in 1.5 years...and I still had some free time...check it out, something seems off. Good luck!", "author": "boss_man14", "created": 1598386375, "upvotes": 3}, "g2u5dtl": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u5dtl/", "text": "git gud", "author": "lil-dlope", "created": 1598385965, "upvotes": -1}, "g2u5a2d": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u5a2d/", "text": "Tbh I felt similar with history grad school. While I didn't work from 8 to midnight I worked from about 9am-10pm most nights and then for about 4-8 hrs on the weekend. \n\nAlso, working a regular job was/is great as work generally ends at 5. Unfortunately I don't have too many recommendations except to seek out help at school or to talk to your advisor for advice. \n\nBut I wanted to let you know that you're not alone in how you feel.", "author": "lukeyellow", "created": 1598385915, "upvotes": 6}, "g2u4ske": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u4ske/", "text": "This is not normal. I understand I’m on the lower end of workload but I average 1-2 hrs per day of work, nothing on weekends.", "author": null, "created": 1598385680, "upvotes": 1}, "g2u2vlb": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2u2vlb/", "text": "Personally I enjoy it, sure it bearing on the mind but I rather suffer now than suffer later in life. I have noticed that the people who sacrifice the most in life are the ones who get what they want out of life. I rather feel over productive than under productive.", "author": "GodOfThunder101", "created": 1598384773, "upvotes": 2}, "g2tylmi": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tylmi/", "text": "This may sound a bit redundant, but if you’re having trouble focusing, throw in some exercise. Cardio and high intensity stuff with make you feel more energized and focused by releasing endorphins. \n\nGet your priorities in order too. Figure out what’s most important and what’s due first and get that done. Organizing yourself and filing thoughts in your brain is the first step in trying to balance your life.", "author": "allermanus", "created": 1598382733, "upvotes": 1}, "g2tx1z8": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tx1z8/", "text": "What exactly are you doing that has your life like that? The only thing that comes to mind that has a students life like that is medical school. Even engineering makes someone life like that in undergrad.\n\nOP I think you need to slow down and relax. I’ve done what you did before and I became sick, and very depressed. School is important no doubt but nothing is worth brutalizing yourself.", "author": "Chowder1054", "created": 1598381992, "upvotes": 3}, "g2twrmm": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2twrmm/", "text": "I took 24 credit hours one semester, had calc, a few chem classes and physics at the same time, plus a job. I worked from 7 a.m to 10 p.m Monday through Friday, I usually took Friday and Saturday night off and had fun and Sunday was like a half day. That was by far my most busy semester but it's still less than what you are doing. Are you a triple major at an ivy league or something? I really can't imagine how that would be a normal workload for any major all four years.", "author": "casual-captain", "created": 1598381853, "upvotes": 11}, "g2tvvcz": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tvvcz/", "text": "Nobody has posted this yet, so I'm gonna go ahead and put my two cents.\n\nHave you talked to disability services? You should. I always felt burnt out by school and like assignments that took other kids one hour took me three. Even with good or mediocre grades, if you are struggling with \n\n* concentrating\n* general mood or disliking school\n* spending a lot of time on school/taking a long time to finish or learn things\n\nyou might have undiagnosed ADHD or a learning disability. Sometimes, these are also symptoms of an underlying mental health problem (you don't have to feel very sad or anxious for there to be something chemically different about your brain!). \n\nAt the very least, I would recommend talking to your advisor and asking for study tips, then contacting whatever mental health and disability services there are. Most schools will have a psychologist on hand who can talk to you more about what you're experiencing and see if it's a symptom of something, or at least recommend you to someone who can help if they feel like it isn't.", "author": "aaalbacore", "created": 1598381422, "upvotes": 41}, "g2tvduj": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tvduj/", "text": "You need to learn how to learn better, how to navigate college classes better, how to study more effectively etc. I was in the same situation my first two years of college.", "author": "alecloxleywrites", "created": 1598381190, "upvotes": 8}, "g2tqixp": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tqixp/", "text": "Theres no way, even graduate students don't work that much.", "author": "Zerobeastly", "created": 1598378877, "upvotes": 19}, "g2tpst8": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tpst8/", "text": "No offense but you have to be procrastinating or just plain not working effectively. I'm a double major with a minor all in stem and have no problem getting work done with good grades and a social life.\n\nDetail how you work and study and we can see where we can help you tidy it up.", "author": "Kozmog", "created": 1598378533, "upvotes": 70}, "g2top7s": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2top7s/", "text": "Yes I felt like that at times. In about my 3rd year of college I started to feel like all I was doing was work for someone else and not learning much. I was working part time on top of that. \n\nI wasn’t into partying either though I was a gamer and was in the history club at college. I also commuted to and from school so on campus activities meant 30 or so minutes to and from if I wanted to go or I stayed on campus. \n\nI found that when you have a free moment meditation and just deep breathing can really help.", "author": "twin-shadows", "created": 1598378012, "upvotes": 9}, "g2tnopf": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tnopf/", "text": "you sound like youve never had an actual 9-5 40hr a week job, well i havent had exactly that but thats not even a good comparison, Id WAY rather be up my ass in schoolwork then actual work but maybe thats just me lol", "author": "_pool_noodle_2", "created": 1598377531, "upvotes": 3}, "g2tjhwb": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tjhwb/", "text": "I don’t doubt you’re busy but I’m a bit confused and concerned that there might be more to it, because that definitely does not sound normal.\n\nAnecdotally, I was a computer science major, put in a slightly mediocre amount of effort and graduated with a 3.2 GPA, and honestly could not ever relate to being that busy, averaging 15 credit hours per semester. Maybe like once per semester for like 2-3 days if I get unlucky but long term it seemed very manageable.\n\nCould you perhaps ease off on some hard classes? You sound like the high achieving type, I assume you’re striving for 4.0 Perhaps you could “negotiate a deal” with yourself: sacrifice .2 off of your GPA for some free time. How much is that really GPA worth if it ruins every waking day of your life for several years?\n\nOr maybe you need to work on studying more effectively? Unless you’re PHD student, To be studying that long every day for an undergrad degree sounds like lots of “dead brain time” where you take 3 hours to do a realistically 30 minute task. Improving sleep and only studying in the morning when I’m most alert is huge with this in my experience.", "author": "Marcellus97", "created": 1598375598, "upvotes": 140}, "g2tgfda": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tgfda/", "text": "[deleted]", "author": null, "created": 1598374191, "upvotes": 3}, "g2tf958": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tf958/", "text": "i’m sorry this has been your experience— do you by chance have a learning disability that might be presenting difficulties for you? it might be worth it to consider if this might be the case, because in that event you might be able to get accommodations.", "author": "oreofighter", "created": 1598373664, "upvotes": 13}, "g2tf6r3": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tf6r3/", "text": "Have you considered you may have some sort of attention disorder? You shouldn't have to put aside more than 3 hours per credit hour per week. So for example, 15 credit hours, 45 hours set aside a week for college. If you have attention issues it is possible not all that time is spent productively", "author": "pointlessarguments3", "created": 1598373633, "upvotes": 74}, "g2tdctg": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2tdctg/", "text": "Wtf are you doing that you spend 16 hours a day doing schoolwork?", "author": "Kingmir1", "created": 1598372799, "upvotes": 281}, "g2t0foa": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2t0foa/", "text": "This is pretty much me... it sucks. I work super hard in the week so that I can maybe afford to talk half a day off on a Saturday to go on a hike.", "author": "lovingtolive", "created": 1598367405, "upvotes": 16}, "g2t0cof": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2t0cof/", "text": "I try to keep people around all the time help prevent stuff like this. \n\nI don't mind grinding cause I find it really fun and rewarding, but I understand that it isn't for everyone. \n\nBut like if I am working on a class assignment I keep 2-3 people on the line who are working on stuff, same project or different and just shoot the breeze. \n\nI also find a strict cutoff, like everybody puts down the work at like 6-7pm and just kick it from then on out is pretty solid. If there is something lingering that needs to be done, just wrap it up quickly as a group.", "author": "Altedd", "created": 1598367371, "upvotes": 27}, "g2syoeb": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2syoeb/", "text": "This should not be necessary no matter what your major is. It absolutely isn't. If you're working all day every day, something is extremely wrong.", "author": "purplelovely", "created": 1598366654, "upvotes": 958}, "g2sy9lw": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2sy9lw/", "text": "I am certainly not at the point where I have NO free time, I always make time in my schedule for social life and friends, on top of exercise. I get almost no time in the school year for hobbies and side projects and such though.\n\nIt makes sense that this is unfulfilling and just a drag. That's a pretty normal feeling among students I think. Personally, and I don't mean to encourage any unhealthy lifestyles, but I actually enjoy this. I find it fulfilling to spend so much of my time learning and expanding my knowledge for myself. It feels like in the work world, I'm creating for someone else or some soulless business, and academics feels like it's ultimately something that is only beneficial to me, and for that reason I do enjoy the constant studying and late nights. After college is over I'll definitely miss it.", "author": "soundslimitless", "created": 1598366488, "upvotes": 1}, "g2stka8": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2stka8/", "text": "Been there. Get your priorities straight, kinda dark but imagine everyone else around you, your loved ones banish and you never see them again. Do you want to remember your life with them as this workaholic void? Do it before someone you love is gone. Trust me", "author": "harryberry33", "created": 1598364282, "upvotes": 140}, "g2srvet": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2srvet/", "text": "Im the same way... I need help", "author": "DarkHumor258", "created": 1598363335, "upvotes": 9}, "g2srmd6": {"link": "/r/college/comments/igbfy1/i_am_not_a_human_being_during_the_academic_year/g2srmd6/", "text": "How many classes are you taking that this is necessary?", "author": "shadowwolfsl", "created": 1598363191, "upvotes": 104}}}