{
  "sid": "qx7z9l",
  "link": "/r/college/comments/qx7z9l/professor_has_been_targeting_me_literally_hates_me/",
  "title:": "Professor has been targeting me, literally hates me??",
  "text": "Hi guys, so I 20f took a CNA course this semester at my community college. In my lab class, we’ve been practicing taking manual blood pressures and stuff. Well during a practice, my professor begins shouting my mistakes incredibly loud for the whole class to hear. I tell her “ I have general anxiety disorder, I’m getting very nervous” to which she proceeds by yelling louder. A couple minutes later, everyone is sitting around, using their phones, basically free time right? So i pull out a paper and start working on my clinical assignments, which sets her off. She begins SHOUTING, “ this isn’t clinical, if you want to do that you can just put your stuff away and just SIT there!.” At this point i’m having a full blown anxiety attack and run out, where i hear her yelling “ that’s a 3% deduction btw”.I ran out crying. Then this week comes along, I am two minutes late for class, and she makes me sign another paper for an extra 3% grade deduction for the 2 minute tardy. Many student have been wayyyyy later than that, and nothing has ever happened to them. While I am taking my test privately with a “patient” at the bed, the girl playing patient pulls me over right after to tell me the professor was rolling her eyes at me the whole time, and that she’d never seen this teacher be this mean to anyone. The professor calls me up to sign the papers, and asks if I want to appeal them, to which I answer yes. This grown woman responds with a loud laugh and says OKAYYYYYY. \n\nIs there anything I can do about this?? I will not pass the class with a 76%, and it really sucks to be targeted for something I can’t control \n\nFor added context, I have general anxiety disorder, major depressive disorder, and I’m completely blind from one eye, which might be noticeable. We had another student in the same class who was deaf, and always had a translator come over. The professor was awful to her as well, and she ended up dropping the class",
  "author": "monax29",
  "created": 1637295315,
  "updated": 1637394836,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.73,
  "comments": {
    "hl8g6sh": {
      "link": "/r/college/comments/qx7z9l/professor_has_been_targeting_me_literally_hates_me/hl8g6sh/",
      "text": "Buy a digital audio recorder and set it up on you or in your bag to catch her yelling at you. Check the laws in your area, I think it would be legal to record audio without her permission. Anyways, have a record of her blow ups and take it to the department head, so at least you have some evidence and it's not your word against hers. She seams unhinged and hopefully something can be done to correct her behavior. BTW I would have the recorder somewhere she can't see.",
      "author": "7mojo7jojo7",
      "created": 1637312410,
      "upvotes": 6,
      "replies": {
        "hl8iozg": {
          "link": "/r/college/comments/qx7z9l/professor_has_been_targeting_me_literally_hates_me/hl8iozg/",
          "text": "thank you, i will try that next week",
          "author": "monax29",
          "created": 1637314547,
          "upvotes": 2,
          "replies": {
            "hl9mvij": {
              "link": "/r/college/comments/qx7z9l/professor_has_been_targeting_me_literally_hates_me/hl9mvij/",
              "text": "As the other person said, check the law. Whether it’s legal to record someone without their knowledge depends on the state you’re in",
              "author": "idontcareaboutttt",
              "created": 1637337366,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hl7tz5z": {
      "link": "/r/college/comments/qx7z9l/professor_has_been_targeting_me_literally_hates_me/hl7tz5z/",
      "text": "First if all, none this behavior is at all what you should expect from normal professors. Ever. This is an extreme case of an abuse of position and there are many teachers out there who would find this appalling. \n\nI recommend talking about her behavior with her Department Chair as well as your Community College Dean. \n\nThis is hostile behavior and I'm sorry you're going through this. Reach out to your professors you trust as well as the people in charge of this professor. Department chair is a good place to start.",
      "author": "GueroSuave",
      "created": 1637297283,
      "upvotes": 4,
      "replies": {
        "hl7vnd7": {
          "link": "/r/college/comments/qx7z9l/professor_has_been_targeting_me_literally_hates_me/hl7vnd7/",
          "text": "thank you, i’m baffled as to how she’s been getting away with this, i’m honestly so sad that i’m gonna fail that class bc i was 2 minutes late",
          "author": "monax29",
          "created": 1637298209,
          "upvotes": 2,
          "replies": {
            "hl7y2mg": {
              "link": "/r/college/comments/qx7z9l/professor_has_been_targeting_me_literally_hates_me/hl7y2mg/",
              "text": "You should not fail this class. \n\nDo not take the L. Do not let her get away with this treatment. Report it.",
              "author": "GueroSuave",
              "created": 1637299611,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "hlc2kmi": {
      "link": "/r/college/comments/qx7z9l/professor_has_been_targeting_me_literally_hates_me/hlc2kmi/",
      "text": "Unfortunately, a lot of teachers are rude to students with any kind of mental health issue or even students they think have a mental health issue. You should report her.",
      "author": "_queen_bee01_",
      "created": 1637372692,
      "upvotes": 1,
      "replies": {}
    }
  }
}