{
  "sid": "qfi94n",
  "link": "/r/college/comments/qfi94n/is_it_rude_to_decline_someones_offer_to_hang_out/",
  "title:": "Is it rude to decline someone’s offer to hang out together just bc I like being alone?",
  "text": "So I kinda introverted irl and spend 95% of my time alone when I’m not in class or home. This dude at my college recently has been hitting me up and asking if we could get a pizza and hang at his dorm. I have no excuse to say no tbh, I just like being alone in my own space yk. I tell him I’m pretty awkward irl and kinda like being alone. He’s telling me I need to go out and have fun and to atleast consider hanging out w him.\n\nIdk is it rude to say no when I don’t have a legitimate excuse to decline hanging out w him? I done fucked up and told him I’m free on Fridays and weekends",
  "author": "selena_hillard",
  "created": 1635172991,
  "updated": 1635184171,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi0d7vf": {
      "link": "/r/college/comments/qfi94n/is_it_rude_to_decline_someones_offer_to_hang_out/hi0d7vf/",
      "text": "I’m introverted and like being alone as well. It’s not rude but making an in person friend or two at your college wouldn’t hurt.",
      "author": "rynpickles",
      "created": 1635183476,
      "upvotes": 1,
      "replies": {}
    },
    "hi0ekd4": {
      "link": "/r/college/comments/qfi94n/is_it_rude_to_decline_someones_offer_to_hang_out/hi0ekd4/",
      "text": "No, but the more you say no the less you'll be asked. At a certain point you'll need to weigh if attending the occasional social function you might feel awkward at and keeping a friend/fostering a potential friendship is more or less important than always having uninterrupted alone time\n\nSo, it's not rude, but at the end of the day there is a bit of social compromise to be made if you want to maintain relationships or form new ones. Just a decision you need to make for yourself",
      "author": "vampyreontitus",
      "created": 1635184026,
      "upvotes": 1,
      "replies": {}
    }
  }
}