{
  "sid": "d1tlc7",
  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/",
  "title:": "College Isn't For Me, But I Am Female.",
  "text": "I grew up an A+ student who was always told by my mother, \"You have to go to college or you'll be making minimum wage your entire life. Only guys can make a living without going to college.\" This honestly trapped me and I felt forced. I've become extremely burnt out from school and college seems like a major waste of money to me. Even if I didn't think it was a waste of money or it was free, I would not be able to mentally handle the shit that comes with college because of how insanely fucked my mentality is due to trauma. College just isn't working out and this is my second attempt at trying to do so. How can I have a reliable future without attending college as a female? I'm honestly worried to no end right now, so any help is appreciated.",
  "author": "V3N0M1Z3D",
  "created": 1568048227,
  "over_18": false,
  "upvotes": 778,
  "upvote_ratio": 0.95,
  "comments": {
    "f0vygih": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/f0vygih/",
      "text": "Hi! I'm female too. I actually am still in college but dropped out of a traditional private college and am now going to community (much better, I feel less sad now). Meanwhile however, to support myself I am working in manufacturing (a factory job assembling hospital equipment like beds and such). If nothing else you could try going to a temp agency and work through them (and eventually get hired in). I am close to getting hired in myself and get paid $13/hour weekly working 40 hours a week not counting overtime if we are asked to work weekends (time and a half on Sat and double on Sun). People who are hired in where I work make $15/hour but not sure if they are paid weekly or biweekly. Minimum wage where I live is $9/hr. It's not perfect by any means and money is still tight for me but yes you can absolutely still survive esp if you don't start out living on your own (so utilities like electric etc can be split). Good luck!",
      "author": "littlefang303",
      "created": 1568994804,
      "upvotes": 1,
      "replies": {}
    },
    "eztp41z": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/eztp41z/",
      "text": "you can join the military or join the peace corps. I recommend talking to a  military recruiter and hear him out.  A majority of jobs in the military don't go into combat nor see combat. Some people have desk/admin jobs that deal with paperwork. You get a steady paycheck and get to travel. The military will also help you get a degree so you can get a civilian job after the military. You can make a career out of it and retire at like 30-40 years old.\n\nThere is also the peace corps. You volunteer in a foreign country for two years. After your commitment with the corps they give you $10,000 to readjust to normal life. I'd look there. GOOD LUCK!!",
      "author": "Tres345789",
      "created": 1568135470,
      "upvotes": 3,
      "replies": {}
    },
    "eztfhyp": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/eztfhyp/",
      "text": "You could go and get your associates degree in a skill trade. Not really that stressful. You could go to a community college and do it and that’s very easy. Depending on which skill trade, you can make a lot. My dad went to school for 2 years and makes a six figure salary",
      "author": "art_lover82279",
      "created": 1568129099,
      "upvotes": 3,
      "replies": {}
    },
    "eztctkj": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/eztctkj/",
      "text": "Your mom don't know shit 🤣",
      "author": "moniwani24",
      "created": 1568127258,
      "upvotes": 1,
      "replies": {}
    },
    "eztcs91": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/eztcs91/",
      "text": "Lol she thinks males can make a living without college? People have trouble making living off a 4 year degree alone.",
      "author": null,
      "created": 1568127234,
      "upvotes": 1,
      "replies": {}
    },
    "ezt9fda": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezt9fda/",
      "text": "Maybe take a break for awhile and look into jobs with training, Job Corps, Americorps, staffing agencies that get you training, going in for a certificate rather than a full degree, etc. Also consider taking online classes, look into CLEPs and DSSTs (for general education). College is stressful, but there are ways to keep yourself going. Not everyone follows the same path. Heck I'm going back to college in my 30's and still feel like you do but to be honest, it's more of a trap not to have a degree or certificate.",
      "author": "Furzball",
      "created": 1568124850,
      "upvotes": 1,
      "replies": {}
    },
    "ezt8on8": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezt8on8/",
      "text": "I feel like, mostly, US students suffer a lot with mental depression, in any stage. I did not live in the US or whatsoever, I was born in Portugal and although my parents always told me to get good grades I was never forced to get straight A's in fact I'm mostly a B student, 13/14 in a 0-20 scale, I mean I would love to get 18's and more to get more scholarships and honors. But now that I am 21, I realized that it doesn't matter what you study or where you study as long as you are passionate about something. \n\n&#x200B;\n\nDon't get me wrong, its perfect that parents want their kids to get good or perfect grades, but it comes to a point that the kid achieves exhaustion without even noticing.  In the US, kids are so used to get perfect grades and always achieve their maximum or close to potential that they don't know what is like to fail. And going to college most likely kids are told by their parents what to pursue as a career, you did not have time to explore in high school several things, sure you took extra classes and enroll in some clubs but most of that work is just for appearances in the college application. \n\nKids whose parents pressure them too much to get good grades did not enjoy their teenage years enough and don't know the concept of real world, I suppose... I mean your job is mostly to study, get straight A's and everything you need your parents provide, and you probably never wondered what it took them to get that, or where it came from. \n\nWhen you go to college is a whole different level of pressure, its a lot, like way more than high school years combined, and don't go to college with the mentality you had in high school, get a good GPA, but not like straight A's.... If you manage to get straight A's and still enjoy life, congratulations, I wish I could do the same, maybe I can and I'm too lazy to try... \n\nOne thing you need to do when you get into college is to realize, specially if you live in USA, CA, AUS or UK, is that tuition costs a lot but like a lot of money to your parents... Like 40k a year, you would get your Bachelors, masters and PhD in Europe, with accommodation and food paid and some trips... Get summer jobs somewhere, start giving value to money. It doesn't matter where you work, it can be a coffee shop or restaurant or whatsoever, you are nor above nor below anyone.  When you do that you start seeing how much you cost to your parents life, they don't care, I wouldn't either as long as my kid would get somewhere. But look after your mental health and put yourself in your parents or someone with less opportunities than you...\n\n&#x200B;\n\nOne strong advice I would give you is to ask your parents permission to take a GAP year and come to somewhere in Europe and find some volunteer projects you can get involved at, they would cost you far less money than college, although you would miss a year, your thoughts would come clear. I wish I had done the same in my 18's... Once you experience the world the clear your thoughts get and the more open minded you get. Life is not only about getting A's... Thats nothing, that is absolutely 0 in this planet. Sure, you get in a good Ivy league, good job, perfect life, but monotonous and without knowing what really matters. H2H, Human to Human and Heart to Heart connections are extremely powerful. \n\n&#x200B;\n\n&#x200B;\n\nP.S. I have probably went to mars and then moon and back to earth, but I hope you get the idea.",
      "author": "brunommpreto",
      "created": 1568124302,
      "upvotes": 1,
      "replies": {}
    },
    "ezt8aca": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezt8aca/",
      "text": "School is not meant for everyone.  People learn in different ways.  There is great value \nin other fields of work.  Along with the other recommendations, you could get your real estate license.  You just need a high school diploma or GED to get started with real estate school. There are different levels but none that require more than 1 month of schooling.  Also, emergency service dispatchers are civilians that work with the police or fire department and it does not require a college education.  Your life should bring you joy.  Good luck finding your niche.",
      "author": "Nodqar21",
      "created": 1568124003,
      "upvotes": 1,
      "replies": {}
    },
    "ezt438v": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezt438v/",
      "text": "[removed]",
      "author": null,
      "created": 1568120694,
      "upvotes": -2,
      "replies": {
        "ezt53cq": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezt53cq/",
          "text": "I refuse to depend on someone else for my own well-being. That isn’t living.",
          "author": "V3N0M1Z3D",
          "created": 1568121518,
          "upvotes": 1,
          "replies": {
            "eztfu4o": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/eztfu4o/",
              "text": "[removed]",
              "author": null,
              "created": 1568129328,
              "upvotes": 1,
              "replies": {
                "eztghl6": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/eztghl6/",
                  "text": "Not gonna go into depth, but I had to depend on myself only very very strongly throughout my childhood from about 10 to now. I’ll say it again: I refuse to depend on someone’s finances or well-being to take care of my own until I physically cannot anymore.",
                  "author": "V3N0M1Z3D",
                  "created": 1568129769,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ezsyf7i": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsyf7i/",
      "text": "I’m a hs senior, so maybe I can’t speak on that, but I believe that women are allowed to do any trade men are allowed to do in the U.S. Maybe find a trade that interests you or get a commercial driver’s license; from what I know, plumbers and truckers make more than decent money. Good Luck!",
      "author": null,
      "created": 1568115317,
      "upvotes": 1,
      "replies": {}
    },
    "ezstfkt": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezstfkt/",
      "text": "If you can put in the same work as anyone else there's not much discrimination regardless of the job you choose. Even manufacturing. I always recommend trade school and a technical degree; these jobs can pay remarkably well and are very well unionized. \n\nWelding, paramedic, manufacturing, logistics/support, HR, accounting, etc..",
      "author": "Diabeetush",
      "created": 1568108715,
      "upvotes": 1,
      "replies": {}
    },
    "ezsnqp6": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsnqp6/",
      "text": "Like many others said if you can milatary has some sweet gigs if you qualify. Rn I'm doing factory work as a temp until one of the higher paying entry positions  becomes available. Mabey try community college and get a stem degree. Anyone who says you have to get a formal 4 year school degree to succeed is very stupid.",
      "author": "runedabid123",
      "created": 1568099531,
      "upvotes": 1,
      "replies": {}
    },
    "ezsgibw": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsgibw/",
      "text": "You can try doing that sweet sweet manual labor. I'm a dude who has only worked manual labor jobs my whole life. Started in the Marine Corps, worked at Discount tire for 2.5 years after that, and now I'm going to school to become an aircraft mechanic. \n\nJust because you're female doesn't mean you can't join the fun. It get's boring working with the same type of people at blue collar jobs. Join us. One of us. One of us.",
      "author": null,
      "created": 1568090839,
      "upvotes": 3,
      "replies": {}
    },
    "ezsfel7": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsfel7/",
      "text": "Pursue an education, not a degree.",
      "author": "lolipophalfdollar",
      "created": 1568089763,
      "upvotes": 0,
      "replies": {}
    },
    "ezsf48d": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsf48d/",
      "text": "I'm a Freshman in College right now, I honestly feel like High School was way harder. Taking 3-5 or even 7 APs was way more taxing than the General Eds I'm taking right now.\n\nI'm taking 15 credits this semester and it's actually really manageable. You have so much more free time, you can set your own schedule so you can allow yourself to wake up late if you wanted to, eat lunch on your own time, and you can even skip class without an repercussions. \n\nYou could try out community college for a semester and see how it goes, it's cheaper and I wish I chose community college to get my gen ed's out of the way. Other than that I feel like you most likely have trained yourself to have a pretty good work ethic in high school, and that'll transfer really well. \n\nI used to think the same as you, I got burnt out right after my senior year of high school, finished off with just under 2 years of college credits under my belt (none transferred tho lol) and I kept telling myself there's no way I'm dealing with another 4 years of this bullshit. So far it's pretty great though, and I have plenty of time to do whatever I need, I just need to cut back on playing games late at night and instead should probably be doing math homework.\n\nWhatever path you choose know it's never too late to switch, I have people in their 40s and 50s in some of my classes, and they're the most interesting people I've talked to.",
      "author": "Its_my_ghenetiks",
      "created": 1568089487,
      "upvotes": 1,
      "replies": {}
    },
    "ezsened": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsened/",
      "text": "Join the Air Force.",
      "author": "Anonymous23101",
      "created": 1568089049,
      "upvotes": 1,
      "replies": {}
    },
    "ezsc9tq": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsc9tq/",
      "text": "I'm 30 and never did well in school so my resume and qualifications suck. I just started college for the first time, a couple weeks ago. Part time with a full time job. I'm doing IT - programming. Do you need a degree for this? Absolutely not. If you have the drive go to codecademy.com (may be .net) and also freecodecamp.org These are very good sites for entry level programming. There are more. With the rise of AI and all things tech, programmers are needed and I think this field will be one of the most secure going forward as so many jobs will phase out in the next 10 - 20 years. Good luck with everything and I hope you find something you love. I know our socks but for the average person, a degree means a lot. It's difficult to get someone to look at your resume without a degree. UNLESS! You can show them good work like a very well built program/app and website. These are all thing answers that I've either experienced or found in my research. Again, good luck! I wish you the best!",
      "author": "gmanino",
      "created": 1568086929,
      "upvotes": 1,
      "replies": {}
    },
    "ezs3rel": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezs3rel/",
      "text": "Learn HTML, css, python, and whatever other computer language and you'll work from home with no degree.",
      "author": null,
      "created": 1568082401,
      "upvotes": 1,
      "replies": {}
    },
    "ezs3psa": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezs3psa/",
      "text": "Go into the military",
      "author": "hannah122",
      "created": 1568082386,
      "upvotes": 2,
      "replies": {}
    },
    "ezs3bkt": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezs3bkt/",
      "text": "Instead of a 4 year school, what about community college or trade school?  many, many options that are short, sweet to the point and get you employed.  At my CC, theres a crap ton of options to choose from that are less than 70 (average 65) credits-about 3-5 quarters long.  Bam, your out and making $15+ an hour,\n\nSo thats one option.  \n\n&#x200B;\n\nAlso....put college on hold and go deal with your trauma.  I didn't, and it cost me 20 years of my life getting back on track.  Good luck",
      "author": "soup_2_nuts",
      "created": 1568082242,
      "upvotes": 1,
      "replies": {}
    },
    "ezs19jy": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezs19jy/",
      "text": "I’m 34 and I’m in college now because I couldn’t go when I was younger (well ... I could but was a teen mom and needed to work). Anyways, I have a good job without having a degree so don’t worry about it. I’m\nonly getting my degree because it’s required for me to\nmove up (I work for public sector so there is little wiggle room in requirements due to union). The only thing is, I worked a series of crap jobs for a long time to get here.  But I’ve been making decent money for over 10 years now.\n\nI will say that it would’ve been a hell of a lot easier to do the degree 16 years ago because frankly working full time while having kids and going to school full time sucks ass and I have no life. You’re better off if you at least avoid the offspring lol because then you can live with roommates and whatnot.",
      "author": "elevation24",
      "created": 1568081481,
      "upvotes": 2,
      "replies": {}
    },
    "ezryqq1": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezryqq1/",
      "text": "This has probably been said at least once, but there is a huge call for the trades right now.  Things like Electrician, Plumber and HVAC are some good options.  They might be a little more physically demanding, but they pay well, and I fully believe that you could succeed there.",
      "author": "Grillow93",
      "created": 1568080581,
      "upvotes": 0,
      "replies": {}
    },
    "ezrxgob": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrxgob/",
      "text": "Your mother is wrong, and sexist, any job that a man can get without a degree, a female can legally get.",
      "author": "Excaliburrebel44",
      "created": 1568080104,
      "upvotes": 1,
      "replies": {}
    },
    "ezrmpfo": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrmpfo/",
      "text": "Do college now or in 20 years you will be struggling with an online course because that promotion that you really need requires a minimum 4 year degree.",
      "author": "aaraujo1973",
      "created": 1568075986,
      "upvotes": 6,
      "replies": {}
    },
    "ezrloiu": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrloiu/",
      "text": "I'm 23 and just got my associates (in America where you start off there and not your bachelors). You don't need to go to college right away. It sounds like you just need a couple years off. Travel the world, hang out with friends, get a minimum wage job. There's always community college when you're ready. Just know that life is always easier when you have an appropriate degree to fall back on. Just make sure the degree you're getting is worth it.",
      "author": "kushgarden024",
      "created": 1568075597,
      "upvotes": 0,
      "replies": {}
    },
    "ezrigrd": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrigrd/",
      "text": "I started working in an industrial field at $9/hr. (food manufacturing). I learned quickly, showed up every day, and worked hard. \n\nI have a high school diploma. \n\nI’m projecting I’ll make around $88k this year.",
      "author": "Uther-Pendragon",
      "created": 1568074365,
      "upvotes": 0,
      "replies": {}
    },
    "ezrhifj": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrhifj/",
      "text": "Apprenticeships? Best way forward tbh",
      "author": null,
      "created": 1568073978,
      "upvotes": 1,
      "replies": {}
    },
    "ezrepbh": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrepbh/",
      "text": "Use college as a way to find a husband or just find a husband. Thats what I would do if I was a husband. Trades school is a great route.",
      "author": "Chi-Cam",
      "created": 1568072767,
      "upvotes": 0,
      "replies": {}
    },
    "ezre3ne": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezre3ne/",
      "text": "Trust me, do college. Sure, you could be SUPER talented, but a degree just holds a certain stigma in society. Not having one can be detrimental even for the most simple of jobs. \n\nI’d say push through it, and then pursue whatever you want. It’s always good to have a fall back plan for recessions or when things don’t work out.\n\nBest of luck female \n\n- a male",
      "author": "HiddenBambino",
      "created": 1568072508,
      "upvotes": 4,
      "replies": {}
    },
    "ezrdglj": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrdglj/",
      "text": "Trade stocks",
      "author": "Mitchell828",
      "created": 1568072236,
      "upvotes": 0,
      "replies": {}
    },
    "ezrbtr2": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrbtr2/",
      "text": "I’m the opposite. My parents told me I didn’t need college because I’m female and I’m going to be a house wife anyway. It really dismotivates me :(",
      "author": "ash3lynn",
      "created": 1568071532,
      "upvotes": 6,
      "replies": {
        "ezrkoln": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrkoln/",
          "text": "Don't listen to that bullshit. My mom told me that too- to find a man to live off of. Let me ask you this-- what if you never find that man? What if you find him and he dies leaving you right back at square one? Go to college or trade school and be independent! Never- ever rely on another person for your security! Get them grades, girl!",
          "author": "kushgarden024",
          "created": 1568075220,
          "upvotes": 10,
          "replies": {
            "ezrq605": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrq605/",
              "text": "Thanks!! I definitely am working towards my degree and I plan on going to graduate school. I do want to stay home with my kids until they get to elementary school, but I’ll still be working for years before and after that time period!",
              "author": "ash3lynn",
              "created": 1568077263,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ezrbjo1": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrbjo1/",
      "text": "Are you sure it's not the program that burning you out? I sometimes felt that way switch to community college and a different program. I realize this program is for me, but if you know 100% then why don't you go into trade school?",
      "author": null,
      "created": 1568071418,
      "upvotes": 1,
      "replies": {
        "ezt5l6m": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezt5l6m/",
          "text": "Nah, I don’t think that’s it. This is my second attempt at college and it isn’t working.",
          "author": "V3N0M1Z3D",
          "created": 1568121913,
          "upvotes": 1,
          "replies": {
            "ezuru3n": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezuru3n/",
              "text": "Well you can do trade school the most feminine trade jobs are hair styling and horticulturist (working with plants)",
              "author": null,
              "created": 1568159616,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ezr7fst": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr7fst/",
      "text": "You can become an e-thot",
      "author": "trollman_falcon",
      "created": 1568069821,
      "upvotes": 12,
      "replies": {}
    },
    "ezr443j": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr443j/",
      "text": "Awww, don’t be worried. What do you like to do? Open a business. I am coming from a real estate background. I’m a real estate broker in California and now I’m back in college going for my BA in Political Science and then law school.  Having my own real estate business is great! I’ll always do real estate but law is a challenge that I’ve always wanted to pursue. No one really has just one job they do forever. A lot of people have multiple careers they are working. Just relax your nerves and it will come to you.",
      "author": "Septimberfirstrealty",
      "created": 1568068324,
      "upvotes": 5,
      "replies": {}
    },
    "ezr3f82": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr3f82/",
      "text": "do freelance website building with wordpress. its pretty easy to work with. everything uses blocks now so no coding required to make some really nice site designs.",
      "author": "Speedracer98",
      "created": 1568067926,
      "upvotes": 3,
      "replies": {}
    },
    "ezr2n5p": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr2n5p/",
      "text": "Trade school",
      "author": "dyvrom",
      "created": 1568067496,
      "upvotes": 2,
      "replies": {}
    },
    "ezr0mtb": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr0mtb/",
      "text": "[removed]",
      "author": null,
      "created": 1568066313,
      "upvotes": -5,
      "replies": {
        "ezrvmlb": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrvmlb/",
          "text": "[deleted]",
          "author": null,
          "created": 1568079405,
          "upvotes": 3,
          "replies": {
            "ezrwsp0": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrwsp0/",
              "text": "Go on? Why do you think it’s bogus? \nYou’re not backing anything up plus the fact that going through college for a liberal arts degree and getting yourself in over $35k of debt+compound interest isn’t? 😂\n\nPs: if you’re going for a profession like being a doctor or a lawyer, by all means, the degree is necessary.",
              "author": "Chhet",
              "created": 1568079851,
              "upvotes": -1,
              "replies": {
                "ezrygn7": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrygn7/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1568080479,
                  "upvotes": 2,
                  "replies": {
                    "ezs1o50": {
                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezs1o50/",
                      "text": "“Pop off with your scam” \nWish I could say it is but it looks like college is more of a scam for those who don’t follow your “formulaic” plan. \n\nAlso as an undergrad, $35k is about average.  Even $9k is pretty steep but hey if it pays off with that median average, more power to you stranger! \n\nI was only suggesting an idea. But hey, it appears you have not added any value to this at all but to automatically dismiss this as a scam without any intensive idea or research about this course or field. It’s fine, we can expect a lot of cynicism from people who may see the results as “easy”. I’m speaking from experience. \n\nPs: anyone else reading this I suggest you to YouTube “Seth hymes digital marketing review” and do your own research instead of just “popping off” this field. \n\nMuch love!",
                      "author": "Chhet",
                      "created": 1568081629,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ezr0eyi": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr0eyi/",
      "text": "Your mother is very misinformed like many people. A lot of people waste time and money going to college, when their hearts aren't in it. They end up doing more bad than good to their career.\n\nAs far as your gender goes, I would argue that you may possibly have an advantage in male-dominated trades. I believe these trades are looking to hire women for diversity.",
      "author": null,
      "created": 1568066173,
      "upvotes": -2,
      "replies": {}
    },
    "ezr0715": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr0715/",
      "text": "My sister does billing and coding for companies. She just had to get like a certificate for it. You could try that.",
      "author": "SinfullySinatra",
      "created": 1568066094,
      "upvotes": 1,
      "replies": {}
    },
    "ezqz8us": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqz8us/",
      "text": "If you’re interested in technology I would check out the Thiel Fellowship, and there are plenty of coding boot camps that can you do (Lambda School etc) that might be more your speed (and shorter timeline). Good luck!",
      "author": "MootRebel",
      "created": 1568065760,
      "upvotes": 0,
      "replies": {}
    },
    "ezqwfhg": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqwfhg/",
      "text": "[removed]",
      "author": null,
      "created": 1568064774,
      "upvotes": -14,
      "replies": {
        "ezqzejd": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqzejd/",
          "text": "no one is a pathetic waste of air. please get off your high horse.",
          "author": "ripprinceandrey",
          "created": 1568065813,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "ezqvupw": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqvupw/",
      "text": "It depends... if you are going into a STEM field, research/teaching or applicable humanities, then college is not a waste of money (if you are majoring in jewish studies, I am sorry)The stats say so, college grads make more money in the short and long run. Not only think about 4-year schools, there are a lot of superior institutions of education to suit your needs (think community college, for example). Yes, bill gates does not have a degree. You are not bill gates. Also, don't make claims like \"college is not for me\" you are 17. Try it before, it is a different experience than hs. I had experience with trauma and burnout myself (18M, another perspective) and now I am a 4.0 student in cc about to transfer to UT. If you want to chat some more, feel free to PM me.",
      "author": null,
      "created": 1568064577,
      "upvotes": 6,
      "replies": {}
    },
    "ezquzzo": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezquzzo/",
      "text": "unpopular opinion but TBH females without college degrees will historically end up richer than men without degrees. Why? Because they marry men WITH degrees",
      "author": "rodgerbearimg",
      "created": 1568064282,
      "upvotes": -11,
      "replies": {
        "ezqwl3j": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqwl3j/",
          "text": "Source?",
          "author": "Laurasaur28",
          "created": 1568064827,
          "upvotes": 8,
          "replies": {
            "ezqzp8o": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqzp8o/",
              "text": "I posted a source that disproves the claims made. The poster is wrong on all accounts.",
              "author": null,
              "created": 1568065919,
              "upvotes": 3,
              "replies": {
                "ezr7gyr": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr7gyr/",
                  "text": "https://www.consumerismcommentary.com/smart-women-marry-for-money-and-heres-why/",
                  "author": "rodgerbearimg",
                  "created": 1568069833,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            },
            "ezr7ag1": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr7ag1/",
              "text": "https://www.consumerismcommentary.com/smart-women-marry-for-money-and-heres-why/",
              "author": "rodgerbearimg",
              "created": 1568069767,
              "upvotes": -1,
              "replies": {}
            }
          }
        },
        "ezqx38z": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqx38z/",
          "text": "1. im not straight\nand 2. thats very stereotypical of you",
          "author": "V3N0M1Z3D",
          "created": 1568065004,
          "upvotes": 12,
          "replies": {
            "ezr80e7": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr80e7/",
              "text": "1. idgaf i was just saying an accurate statics https://www.consumerismcommentary.com/smart-women-marry-for-money-and-heres-why/\n\n2. stereotypes are based on generalized truths, obvi with some exceptions such as women being bad drivers etc. etc. Do black people run faster on average? Yes. Are asians in the united states smarter on average? Yes. Should i keep going?",
              "author": "rodgerbearimg",
              "created": 1568070035,
              "upvotes": -8,
              "replies": {}
            }
          }
        },
        "ezqzm5z": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqzm5z/",
          "text": "This comment is categorically false for two reasons. One, the payoff for college is, in fact, greater for women compared to men if you're focusing only on the benefits of spousal income. Two, on average, people are more likely to marry within their educational group than outside [source](https://imgur.com/3G4zZYn). So a high school graduate is more likely to marry another high school graduate than someone with a bachelor degree. Here is the relevant information also from my [economics of education textbook](https://imgur.com/w6DOhMT).",
          "author": null,
          "created": 1568065888,
          "upvotes": 8,
          "replies": {
            "ezr7lcy": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr7lcy/",
              "text": "and a man with out a degree has a lesser chance of marrying a rich person with a degree, than a woman",
              "author": "rodgerbearimg",
              "created": 1568069878,
              "upvotes": -3,
              "replies": {}
            },
            "ezr7hz2": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr7hz2/",
              "text": "https://www.consumerismcommentary.com/smart-women-marry-for-money-and-heres-why/",
              "author": "rodgerbearimg",
              "created": 1568069843,
              "upvotes": -4,
              "replies": {
                "ezrc2vl": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrc2vl/",
                  "text": "That article isn't academic of any kind and doesn't even touch upon education as a factor in matchmaking. Only financial security. It doesn't talk about rates, statistics, differences between men and women. It's basically a blog. That hardly supports any claim that women historically marry men with degrees. I just showed you that *on average* men and women marry within their educational group. It would be incorrect to say that women marry men with degrees, because on average, that isn't the case.",
                  "author": null,
                  "created": 1568071634,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ezqu6rs": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqu6rs/",
      "text": "Perhaps take a gap semester/ year to find your bearings? College can be difficult and draining so taking some time to orient yourself and to establish your priorities would really help. Best of luck with your decision! Sincerely, a college student attempting to figure out life.",
      "author": "snailwiz",
      "created": 1568064002,
      "upvotes": 17,
      "replies": {}
    },
    "ezqu1bi": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqu1bi/",
      "text": "We have our share of female CNC machinists. Depending on your area it’s a good path. If you have interest in medical you could do shorter schooling with the CNA route to LPN and beyond if it sticks.",
      "author": "Eredhel",
      "created": 1568063951,
      "upvotes": 5,
      "replies": {}
    },
    "ezqrnyu": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqrnyu/",
      "text": "More females are in college than males in the U.S\nMy school alone has a 52% female to 49% male population.",
      "author": "peyott100",
      "created": 1568063128,
      "upvotes": 12,
      "replies": {
        "ezqw615": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqw615/",
          "text": "*cries in engineering school*",
          "author": "Treblosity",
          "created": 1568064685,
          "upvotes": 27,
          "replies": {
            "ezskcoy": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezskcoy/",
              "text": "[deleted]",
              "author": null,
              "created": 1568095009,
              "upvotes": 4,
              "replies": {
                "ezu6f97": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezu6f97/",
                  "text": "Free choice isnt a problem its just that when you have a 3:1 ratio of guys to girls or greater in some classes, nobodys happy with it. girls arent happy because they feel like they have no role models, have few options for girl-friends, have to deal with so many guys whove become desperate and creepy upon coming to engineering school, and might feel generally outcasted by being the different. And guys dont like it because they cant find girlfriends, have to feel bad for any attempts at getting one knowing damn well theyre probably tired of all the guys tryna talk to them, and get near no female perspectives if any when talking to their friends about stuff",
                  "author": "Treblosity",
                  "created": 1568146241,
                  "upvotes": 1,
                  "replies": {
                    "f094jeu": {
                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/f094jeu/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1568493815,
                      "upvotes": 1,
                      "replies": {
                        "f098au5": {
                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/f098au5/",
                          "text": "We serve food here sir.\n\nYoure talking to a 20 year old going to engineering school i dont have the answers to this stuff i just have the problems. when a school of soft-sciences has a problem with their wifi its not their job to solve it, they find somebody from the appropriate field. There must be some solution cause half my school is sitting here with their cocks in their hands at 75% guys while MIT and caltech are chillin at damn near 50/50",
                          "author": "Treblosity",
                          "created": 1568495843,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ezr3qmr": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr3qmr/",
          "text": "Uh um ... that’s 101% - the math doesn’t add up. Well technically it does add up, but it’s wrong. Must equal 100% \n\nAlso, most colleges have at least some disparity in female/male population.",
          "author": "Life_Museum",
          "created": 1568068101,
          "upvotes": -2,
          "replies": {
            "ezrr02i": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrr02i/",
              "text": "51.5%+48.5%=100%",
              "author": "robbiek54",
              "created": 1568077588,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "ezqrh9c": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqrh9c/",
      "text": "You can do anything as a woman. I started welding this year, though it's me and two other girls, you can still do it. Anything manufacturing/(\"blue collar jobs\") is mostly male dominated but it's always worth trying. If you have an interest in it and you think you could, go for it",
      "author": "falloutkittens_",
      "created": 1568063059,
      "upvotes": 27,
      "replies": {
        "ezqrquj": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqrquj/",
          "text": "Most people who don't have a college degree find jobs and make good money, without a degree. College isn't everything \n\nI hope you find what you wanna do. They're kinda right about if you do what you love you'll never work a day",
          "author": "falloutkittens_",
          "created": 1568063158,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "ezqlh9p": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqlh9p/",
      "text": "Would a trade school be more your fancy?",
      "author": "arlomilano",
      "created": 1568060840,
      "upvotes": 16,
      "replies": {
        "ezqlp1t": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqlp1t/",
          "text": "I thought about it, but physical experience from either being an assistant, doing an internship, or having on-the-job training is WAY less likely to cause me to burn out more than I already have.",
          "author": "V3N0M1Z3D",
          "created": 1568060924,
          "upvotes": 13,
          "replies": {
            "ezt06sx": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezt06sx/",
              "text": "Something for you to consider is what /u/Not_A_Greenhouse  suggested.  \n\nThis isn't a good solution for everyone. But it is something to consider.  \n\nThe US Navy is one of our only service branches that will let you sign an enlistment contract for a specific job role.  \n\n\"I wanna be a Cryptologic Technician.\"  \n\nOk. You go to boot camp, become a Sailor then go to the Navy's school for nerd-stuff.  \n\nYou learn how to do nerd-stuff, then you are guaranteed a job doing nerd-stuff for 4 years.  \n\nFree housing. Free clothing *(well, kinda free)*. Free medical. Free gym membership.  \n\nNorfolk, VA. San Diego, CA. Pearl Harbor, HI. Guam. The Navy has major bases all over the place that need nerds.  \nThe odds of you needing to service in Iraq, Afghanistan or anyplace similar is super-low.  \nThere is some possibility you might be asked to serve on a Ship though.  \n\nBecause you are working with classified information, you will receive a DoD security clearance, and that clearance can be a hot ticket to lucrative DoD Contractor positions after your service obligation.  \n\nIf you prefer to not tie yourself to the DoD Contract industry, you now have free college available to you via the BI Bill.  \n\nI know college wasn't a good time for you now. But 4-5 years from now you'll be at a whole new level of maturity and life-focus, and it might be a different ball game.  \n\n\n\n\nhttps://www.navy.com/careers/information-systems-technician  \n\nhttps://www.navy.com/careers/cryptologic-technician  \n\nhttps://www.navy.com/bonus  \n\nCryptologic Technician Interpretive (CTI-ATF) — $25,000  \nCryptologic Technician Networks (CTN-ATF) — $10,000  \n\nhttps://www.thebalancecareers.com/navy-boot-camp-4057224  \n\n\nJust something to consider.",
              "author": "VA_Network_Nerd",
              "created": 1568117156,
              "upvotes": 4,
              "replies": {
                "ezt67w6": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezt67w6/",
                  "text": "adding onto that, even if u have to be on a ship, it's gonna a cool experience as well",
                  "author": "nateCod",
                  "created": 1568122412,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ezqfswv": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqfswv/",
      "text": "College isn't the only way to live a successful life, there is also the option of vocational school which can provide lucrative careers.",
      "author": "Athragio",
      "created": 1568058656,
      "upvotes": 14,
      "replies": {}
    },
    "ezqebmd": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqebmd/",
      "text": "Very few jobs these days are closed off to women with the exception of manual labor but that's not how people make big bank. You'd really have to be an idiot or really backwards to seriously believe that. \n\nKey word \"seriously\". There's a not insignificant chance that your mom is just saying this as a way to nudge you towards marriage/finding a man to live off of. My mom was a mix of controlling and idiot and she only let me go to college because \"the boys there will earn more\" and everything else (living alone, making choices, talking to people etc.) drove her crazy.  \n\nI have no good advice for job hunting (still struggling with that myself) but if this is remotely similar to your situation it's something to keep in mind.",
      "author": null,
      "created": 1568058138,
      "upvotes": 94,
      "replies": {
        "ezqljsh": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqljsh/",
          "text": "I did always question it but yeah, shes a mix of controlling and an idiot, but I’m doing my best to find something that I fit in, and I believe I’ve come close to doing so.",
          "author": "V3N0M1Z3D",
          "created": 1568060868,
          "upvotes": 17,
          "replies": {}
        },
        "ezqqgfr": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqqgfr/",
          "text": "> manual labor but that's not how people make big bank. \n\nOP probably isnt going to do blue collar work but if you learn a trade belong to a union you can make bank. If you are a master in a trade and work in a city you can make some good money and cities are always building, tearing down, and remodeling shit so you will always have work while working in a more suburban and rural area there might be gaps between major projects or the only work you can find is less paying service calls to peoples houses/apartments.",
          "author": "RolfIsSonOfShepnard",
          "created": 1568062685,
          "upvotes": 18,
          "replies": {
            "ezrh5g4": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrh5g4/",
              "text": "Totally, a union can make a huge difference. OP should check the laws re: unions where they’re living because some places severely limit their ability to guarantee these benefits",
              "author": null,
              "created": 1568073821,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ezrwhdw": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrwhdw/",
          "text": "[deleted]",
          "author": null,
          "created": 1568079732,
          "upvotes": 5,
          "replies": {
            "eztfrjl": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/eztfrjl/",
              "text": "Honestly it’s maybe not as physical as like construction but I do back room/stocking in a grocery store (a lot of heavy lifting) which surprises a lot of ppl bc I’m a 120-something pound female but I work just as fast as my male coworkers. There’s still a perception that a lot of people hold that women are most suited to clerical or customer service oriented work but there’s really no reason a woman can’t or shouldn’t pursue blue collar work if that interests her.",
              "author": "puffy-jacket",
              "created": 1568129281,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ezq6yin": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezq6yin/",
      "text": "I know its not popular... But I was an extremely smart high school student. I started college with almost no drive and failed a ton of stuff. I ended up joining the Air Force. I got a job I hated but I got to move to another country. I earned my GI bill and had a ton of cool experience and now I'm back in college at 28.",
      "author": "Not_A_Greenhouse",
      "created": 1568055557,
      "upvotes": 56,
      "replies": {
        "ezsyg8c": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsyg8c/",
          "text": "Thank you for your service.\n\nEdit: I was just trying to be courteous; I don’t understand why have so many downvoted. I wasn’t karmafarming in any way.",
          "author": null,
          "created": 1568115348,
          "upvotes": -1,
          "replies": {
            "ezt3ey1": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezt3ey1/",
              "text": "You’re welcome",
              "author": "koayenay",
              "created": 1568120118,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ezpuvx8": {
      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezpuvx8/",
      "text": "https://moneywise.com/a/best-jobs-without-a-degree  \n\n\nhttps://www.greatschools.org/gk/articles/great-careers-without-college-degree/  \n\n\nhttps://www.businessinsider.com/high-paying-jobs-dont-require-bachelors-degree-2015-10  \n\n\nhttps://money.usnews.com/money/careers/slideshow/25-best-jobs-that-dont-require-a-college-degree  \n\n\nhttps://www.thestreet.com/personal-finance/education/highest-paying-jobs-without-college-degree-14796152  \n\n\nhttps://www.kiplinger.com/slideshow/business/T012-S001-best-jobs-without-a-college-degree-2018/index.html",
      "author": "VA_Network_Nerd",
      "created": 1568049102,
      "upvotes": 592,
      "replies": {
        "ezpv0iu": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezpv0iu/",
          "text": "If I could give you gold, I would. Thank you so much.",
          "author": "V3N0M1Z3D",
          "created": 1568049189,
          "upvotes": 362,
          "replies": {
            "ezpvyk9": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezpvyk9/",
              "text": "I am 47 years old.  \nI have one daughter in college and two in high school.  \n\nSo, please accept this in a non-creepy way:  \n\nIf I could give you a hug and tell you everything was gonna be ok, I would.  \n\nI don't have a degree either.  \nI work in technology, and I've been earning six-figures for quite some time now.  \n\nYou will find a path of your own that works for you.  \n\nYou're gonna be ok.  \n\n[Virtual hug](https://i.pinimg.com/originals/74/f5/14/74f514796254f780c287c696979dfa25.gif)",
              "author": "VA_Network_Nerd",
              "created": 1568049813,
              "upvotes": 306,
              "replies": {
                "ezpwxve": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezpwxve/",
                  "text": "My father is an IT manager at my old high school and he does things from managing the new systems coming in and doing finances all the way to minor things such as troubleshooting for teachers and admins. I have learned a ton of information from being at his job and growing up hearing about his work. I know tons more than most people my age (17) do about computers and I am pretty decent at troubleshooting. Do you think that, with some on-the-job training, I could make a living as either someone working in IT or troubleshooting? I know it isn't your place to tell me what I should do and you don't know me well enough to say if you think I could do decent at the job. However, if one of your kids were more informed in technology and were open to having a job there, would you encourage it? I've bounced that idea back and forth, but I still wasn't sure. After dealing with this college thing for the second time and realizing it truly isn't for me, I've considered the technology part more than ever.",
                  "author": "V3N0M1Z3D",
                  "created": 1568050465,
                  "upvotes": 59,
                  "replies": {
                    "ezpxre6": {
                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezpxre6/",
                      "text": "> Do you think that, with some on-the-job training, I could make a living as either someone working in IT or troubleshooting?  \n\nI know it for a damned FACT.  \n\n> I know it isn't your place to tell me what I should do and you don't know me well enough to say if you think I could do decent at the job.  \n\nI'm not telling you what to do, or what not to do.  \nI'm just answering your questions as accurately as I know how.  \n\nBut I should further inform you that there is an entire subreddit communit dedicated to what you are asking about here.  \n\n/r/ITCareerQuestions   \n\n> However, if one of your kids were more informed in technology and were open to having a job there, would you encourage it?  \n\nEntry-level IT jobs tend to suck.  \nBut even while they suck, the pay is above average.  \nMid-career IT jobs suck less and pay even better.  \nSenior-level IT jobs hardly suck at all, and pay REALLY well.  \n\nJob security is as solid if not more solid than any other career field.  \n\nSo yeah I'd talk my girls into embracing nerd-life.  \n\n> After dealing with this college thing for the second time and realizing it truly isn't for me, I've considered the technology part more than ever.  \n\nCome on in, the water is great.  \n\nRead these, they should answer a bunch of questions for you:  \n\n | \n---|\n[/r/ITCareerQuestions Wiki](https://www.reddit.com/r/ITCareerQuestions/wiki/index) |\n[/r/CSCareerQuestions Wiki](https://www.reddit.com/r/cscareerquestions/wiki/index) |\n[/r/Sysadmin Wiki](https://www.reddit.com/r/sysadmin/wiki/index  ) | \n[/r/Networking Wiki](https://www.reddit.com/r/networking/wiki/index) | \n[/r/NetSec Wiki](https://www.reddit.com/r/netsec/wiki/index) | \n[/r/NetSecStudents Wiki](https://www.reddit.com/r/netsecstudents/wiki/index) | \n[/r/CompTIA Wiki](https://www.reddit.com/r/CompTIA/wiki/index) | \n[/r/Linux4Noobs Wiki](https://www.reddit.com/r/linux4noobs/wiki/index) |  \n | \n**Certifications** | \n[IT Certification Road Map](http://certification.comptia.org/docs/default-source/downloadablefiles/it-certification-roadmap.pdf) | \n |",
                      "author": "VA_Network_Nerd",
                      "created": 1568050957,
                      "upvotes": 54,
                      "replies": {
                        "ezpz1o4": {
                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezpz1o4/",
                          "text": "Now I really wish I had some gold to give you. I'll talk to my father more about this as well, but thank you so so much for your help and support! I seriously appreciate it from the bottom of my heart.",
                          "author": "V3N0M1Z3D",
                          "created": 1568051764,
                          "upvotes": 37,
                          "replies": {
                            "ezszrfn": {
                              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezszrfn/",
                              "text": "This has been the most helpful, wholesome, and genuine thread I've seen in here, ever.",
                              "author": "guitbzo2000",
                              "created": 1568116728,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "eztngxd": {
                              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/eztngxd/",
                              "text": "The older generation largely got away without requiring degrees for IT work. While I'm not telling you you need a degree to get into IT you are going to shut a lot of doors by not having one. Ask your dad if they hire people without degrees.",
                              "author": "Not_A_Greenhouse",
                              "created": 1568134394,
                              "upvotes": 2,
                              "replies": {
                                "ezv8nux": {
                                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezv8nux/",
                                  "text": "My dad doesn’t have a degree, and he is open to many jobs. He got into his job without experience as well.",
                                  "author": "V3N0M1Z3D",
                                  "created": 1568170153,
                                  "upvotes": 1,
                                  "replies": {
                                    "ezvaqes": {
                                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezvaqes/",
                                      "text": "Yes that was my point. Ask him if they hire the same way now.",
                                      "author": "Not_A_Greenhouse",
                                      "created": 1568171861,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "ezrnzqh": {
                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrnzqh/",
                          "text": "This dude is a beast",
                          "author": null,
                          "created": 1568076480,
                          "upvotes": 11,
                          "replies": {}
                        },
                        "ezrll5x": {
                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrll5x/",
                          "text": "Thank you for this 😭😭",
                          "author": "fofonai",
                          "created": 1568075561,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    },
                    "ezqz0f5": {
                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqz0f5/",
                      "text": "I highly recommend going to an IT boot camp or a doing course online, as they can provide some of the formal training that employers may want without having to go through college to get a degree. I know some software engineers who have been successful after doing coding boot camps, in fact many employers will hire directly from these programs if they are acclaimed.",
                      "author": "rampboatwtrgame",
                      "created": 1568065678,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "ezr0y3s": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr0y3s/",
                  "text": "I see you in /r/nova and /r/gmu giving advice all the time. I had no idea that you weren't a college grad because the advice you give is very spot on. Thanks for helping out!",
                  "author": null,
                  "created": 1568066519,
                  "upvotes": 8,
                  "replies": {
                    "ezr1qiq": {
                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr1qiq/",
                      "text": "I'm not sure if I've ever posted in /r/nova but I do comment in /r/gmu  from time to time.  \n\nWe recruit from there pretty much every cycle.  \n\n> I had no idea that you weren't a college grad because the advice you give is very spot on.  \n\nWell, I don't wanna cause a ruckus, but I'm pretty sure people can be smart even if they don't have a diploma.  \n\nI've been working in IT for 25 years now, for four different Fortune-500 employers.  \nI have a fair sum of experiences to share.  \nI try to share those experiences as best as I can, without sounding like a total douche.",
                      "author": "VA_Network_Nerd",
                      "created": 1568067012,
                      "upvotes": 5,
                      "replies": {
                        "ezr35kq": {
                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr35kq/",
                          "text": ">share those experiences as best as I can, without sounding like a total douche.\n\nI'd say you're doing a great job. 👍",
                          "author": null,
                          "created": 1568067772,
                          "upvotes": 3,
                          "replies": {
                            "ezr3dv5": {
                              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr3dv5/",
                              "text": "> I'd say you're doing a great job.  \n\nThank you kind *<insert pronoun here>*.",
                              "author": "VA_Network_Nerd",
                              "created": 1568067904,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ezqzm06": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezqzm06/",
                  "text": "So long as your children don’t major in pathetic nonSTEM subjects.",
                  "author": null,
                  "created": 1568065887,
                  "upvotes": -12,
                  "replies": {
                    "ezr1c8l": {
                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr1c8l/",
                      "text": "My oldest is an English major. Sorry.",
                      "author": "VA_Network_Nerd",
                      "created": 1568066773,
                      "upvotes": 10,
                      "replies": {
                        "ezr2pvp": {
                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr2pvp/",
                          "text": "I mean, seriously. Yikes! That’s pathetic.",
                          "author": null,
                          "created": 1568067538,
                          "upvotes": -10,
                          "replies": {
                            "ezr38s2": {
                              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr38s2/",
                              "text": "> I mean, seriously. Yikes! That’s pathetic.  \n\nAre you like intentionally *trying* to offend me or something?",
                              "author": "VA_Network_Nerd",
                              "created": 1568067823,
                              "upvotes": 11,
                              "replies": {}
                            }
                          }
                        },
                        "ezr1f54": {
                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr1f54/",
                          "text": "[removed]",
                          "author": null,
                          "created": 1568066824,
                          "upvotes": -11,
                          "replies": {
                            "ezr31kd": {
                              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr31kd/",
                              "text": "> You must be ashamed.  \n\nAshamed isn't the correct word or emotion.  \n\nI'm a bit *concerned* about her degree choice. But I'll admit she has hammered out a pretty solid career pathway to become a HS Teacher.  \n\n> I know I would be.  \n\nSounds like you're a pretty shitty parent then.",
                              "author": "VA_Network_Nerd",
                              "created": 1568067711,
                              "upvotes": 11,
                              "replies": {
                                "ezr5728": {
                                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr5728/",
                                  "text": "[removed]",
                                  "author": null,
                                  "created": 1568068899,
                                  "upvotes": -6,
                                  "replies": {
                                    "ezrabaf": {
                                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrabaf/",
                                      "text": "> You want your daughter to become a teacher?  \n\nNo. Not at all.  \n\nI want her to choose a vocation or career that provides for her needs, and her future. And I want her to be happy with her choices.  \n\nIf you weren't 19 years old you'd understand that you can't really push your kids into specific careers.  \nAll you can do is raise them as best you can, share the best life-lessons you can think of with them and try to shape & craft their decision-making process in your basic image, then hope for the best.  \n\n> She won’t earn anything.  \n\nShe has been well-informed of this, and she made some very wise personal decisions in face of that reality.  \n\nShe turned down both William and Mary and the University of Virginia in favor of Virginia Commonwealth University because of cost of attendance (VCU gave her a 50% scholarship) and the fact that VCU accepted her Full IB Diploma for 25 transfer credits. She walked into her first day of college as a Sophomore.  \n\nYou're not the only person who can do math to perform a financial planning calculation.  \n\n> It must be nice at least knowing she got one of the easier ones.  \n\nI'm not sure how to interpret this.  \n\n> I presume she isn’t going into law because that’s reserved for STEM graduates.  \n\nI'm pretty sure Business, English and History are the most common sources of Law School students, and not STEM.  \nSo if you have evidence to support your claim to the contrary I'd love to see it.  \n\nhttps://www.americanbar.org/groups/legal_education/resources/pre_law/  \n\nhttps://www.usnews.com/education/best-graduate-schools/top-law-schools/articles/2017-12-14/choose-the-right-college-major-for-law-school  \n\n\n> Let her be a lesson to your other children.  \n\nShe graduated #8 in her class of 400. She is a pretty solid example to others, including her sisters.",
                                      "author": "VA_Network_Nerd",
                                      "created": 1568070929,
                                      "upvotes": 6,
                                      "replies": {
                                        "f00c5gy": {
                                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/f00c5gy/",
                                          "text": "Wouldn't UVA be worth it based on their name alone?",
                                          "author": "LordModlyButt",
                                          "created": 1568299998,
                                          "upvotes": 2,
                                          "replies": {
                                            "f00gna5": {
                                              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/f00gna5/",
                                              "text": "> Wouldn't UVA be worth it based on their name alone?  \n\nPlease don't take any of my comments on this personally.  \nYour question is valid and reasonable, but it touches on an important issue and common fallacy believed by an awful lot of young people.  \n\nWhat the actual cinnamon toast fuck does \"worth it\" mean?  \n\nHer career goal is to become a High School Teacher.  \nIn Virginia this requires her to have an Undergraduate Degree relevant to the subject(s) she wishes to teach, AND a Masters of Education.  \n\nIn response to those requirements, many Virginia Universities offer Accelerated Masters of Education where some of the 500 level courses are interwoven into your upperclass years so you complete it in one year (5 total years of university).  \n\nBeing a HS Teacher is a State or County Public Government job.  \nThe employment requirements are very clear and have very little room for favoritism of one university degree over another.  \n\nLiterally: *\"You haz degrees? You haz interview skillz? You can haz job.\"*  \n\nUVA offers no noteworthy employment benefit over VCU for these jobs in question.  \n\nYou could make a reasonable argument for the quality of education at UVA over VCU. UVA is extremely well funded and equally well known for delivering a high quality education. But to their credit, and in their defense, VCU has a fine reputation for delivering a good to above-average education. It does not suck. It has no negative shadow looming over its diplomas.  \n\nTo say that VCU is academically not as good as UVA is fair and reasonable.  \nTo say that VCU sucks and damages your employ-ability is not fair nor reasonable.  \n\n\nBeing a HS Teacher is a state or county government job.  \nThe salary offerings for a given applicant has practically no leeway for a high-quality applicant over a mediocre applicant.  \n\nSo the additional investment in a (arguably) higher cost/higher quality education has practically zero return on that investment.  \n\nNow, 10-15 years from now when she starts to apply and compete for Principal or Administrative Faculty positions, the quality or pedigree of her education may become a discussion point.  \nBut school teachers are eligible for subsidized continuing education, so she might throw another Masters degree on her resume at some point, and if the state is paying a heqalthy portion, investing in something of a higher quality might be a worthwhile investment.",
                                              "author": "VA_Network_Nerd",
                                              "created": 1568301594,
                                              "upvotes": 2,
                                              "replies": {
                                                "f00l36s": {
                                                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/f00l36s/",
                                                  "text": "I understand your point. If your daughters goals are specific then there is no point in spending the extra money if there are less expensive ways to reach them. \n\nI'm a GMU student so I'm always curious as to why people don't take the UVA route when they can. I'm a local though so going to GMU is smart because I save on no room and board.",
                                                  "author": "LordModlyButt",
                                                  "created": 1568303170,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        },
                                        "ezraon4": {
                                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezraon4/",
                                          "text": "[removed]",
                                          "author": null,
                                          "created": 1568071072,
                                          "upvotes": -1,
                                          "replies": {
                                            "ezrdrev": {
                                              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezrdrev/",
                                              "text": "What dissatisfaction do you have with your life that leads you to behave this way?",
                                              "author": "GlorySocks",
                                              "created": 1568072367,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "ezr5z6e": {
                              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr5z6e/",
                              "text": "You must really hate yourself to have to go after other people's children to feel better.",
                              "author": "Chiiwa",
                              "created": 1568069268,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "ezr89er": {
                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezr89er/",
                      "text": "Oh fuck off, not everyone needs to be a damn engineer.",
                      "author": "GlorySocks",
                      "created": 1568070129,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "ezsjn6p": {
                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsjn6p/",
                      "text": "You already know this person is gonna be a *pain* to work with because they might have the technical skills and literally none of the social skills.\n\nNon-STEM fields are also important, and it is extremely ignorant to dismiss them.\n\nHopefully in a few years you can come back to this thread and see how immature you were.\n\nBest wishes.",
                      "author": null,
                      "created": 1568094167,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ezs7jin": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezs7jin/",
              "text": "[deleted]",
              "author": null,
              "created": 1568084202,
              "upvotes": -6,
              "replies": {
                "ezshbyv": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezshbyv/",
                  "text": "She decided to seek advice on here so  just chill out. If you don't have anything to contribute just don't say anything",
                  "author": "depression_butterfly",
                  "created": 1568091659,
                  "upvotes": 2,
                  "replies": {
                    "ezshnss": {
                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezshnss/",
                      "text": "It’s just some tough love . Someone had to say it , I legit had good intentions . Worst come to worst she would think about what she has to do .",
                      "author": "Zeref47",
                      "created": 1568091999,
                      "upvotes": -2,
                      "replies": {}
                    }
                  }
                },
                "ezseyxe": {
                  "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezseyxe/",
                  "text": "not playing the victim card, im speaking facts, but sure man. think whatever the fuck you want. if you dont have anything beneficial to say then get the fuck off my post.",
                  "author": "V3N0M1Z3D",
                  "created": 1568089353,
                  "upvotes": -1,
                  "replies": {
                    "ezsgbov": {
                      "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsgbov/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1568090656,
                      "upvotes": -5,
                      "replies": {
                        "ezsx9wz": {
                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsx9wz/",
                          "text": "You’re lacking the “constructive criticism” and just giving more of a douchebag vibe here. I’m anything but slow. Don’t act like you know my title or my game when you don’t even know the surface of who I am.",
                          "author": "V3N0M1Z3D",
                          "created": 1568114017,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "ezshgth": {
                          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezshgth/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1568091794,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ezs7638": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezs7638/",
          "text": "Wow thanks we need more heroes like you!",
          "author": "adonisgq1",
          "created": 1568083953,
          "upvotes": 2,
          "replies": {}
        },
        "ezsh8n8": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsh8n8/",
          "text": "Thank you!",
          "author": "depression_butterfly",
          "created": 1568091564,
          "upvotes": 2,
          "replies": {}
        },
        "ezthvrz": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezthvrz/",
          "text": "Article talking about a job as an airline pilot:\n\n> It's not a turbulent field",
          "author": "vasilescur",
          "created": 1568130704,
          "upvotes": 2,
          "replies": {
            "ezthz6x": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezthz6x/",
              "text": "What you did there...  \n\n*I see it.*",
              "author": "VA_Network_Nerd",
              "created": 1568130766,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ezsiatu": {
          "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsiatu/",
          "text": "[deleted]",
          "author": null,
          "created": 1568092659,
          "upvotes": -5,
          "replies": {
            "ezst8gc": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezst8gc/",
              "text": "Don't be a dick. \n\nNo shit dude. \n\nOf course going to college is going to pay more. If you go to Harvard, no shit that you're going to be paid more than $25/hr. \n\nBut not everyone in this country can go to an institution like that. University isn't for everyone.",
              "author": "InvestmentBanker19",
              "created": 1568108399,
              "upvotes": 4,
              "replies": {}
            },
            "ezsz4vh": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/ezsz4vh/",
              "text": "$50-60k/year plus benefits is one hell of a lot better place to be than where a whole lot of people are today.  \n\nNot everybody dreams of owning a BMW and a pool in the back yard.",
              "author": "VA_Network_Nerd",
              "created": 1568116085,
              "upvotes": 4,
              "replies": {}
            },
            "eztf4vw": {
              "link": "/r/college/comments/d1tlc7/college_isnt_for_me_but_i_am_female/eztf4vw/",
              "text": "This is such a shit take. Many trades put a lot of stress on the body but sitting at a desk all day has its own health risks. Frankly no 40 hr/week job is truly healthy long term considering how much longer ppl these days will have to work before retiring. And plenty of trades/careers that don’t require college still require good problem solving and interpersonal skills, it’s not all mindless grunt work. \n\nUnder $25 an hour is a totally comfortable and respectable income for many people. Not everyone is highly money motivated. Plenty of us are ok with making just enough to live comfortably.\n\nOP, it looks like you got plenty of helpful replies, just my 2 cents but before I decided that I did in fact want to finish college (since I had already put nearly 2 years in) I had thrown around the idea of being a vet technician or an esthetician/doing nails. Neither are incredibly lucrative but they seem like enjoyable jobs for the right type of person and aren’t the typical electrician/plumber type trades people typically think of. My mother is a hairdresser, she loves her job and no, we’re not rich but we are certainly not destitute in any way even after she separated from my father and I consider her to be very successful in her career... she is also self employed which many people find very empowering in a career.",
              "author": "puffy-jacket",
              "created": 1568128853,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634051199
}