{
  "sid": "qdqttg",
  "link": "/r/college/comments/qdqttg/hopefully_helpful_tips_for_registration/",
  "title:": "Hopefully helpful tips for registration",
  "text": "Just want to give some tips for class registration because it can be stressful.                            \n\n1. Check what classes you need and check what classes will be available next semester. You DegreeWorks should have the classes for your major you need to take. But always check of the class you need to take is available in case it’s once a year class( ie Fall Semester or Summer only). This way you can see if you can get an elective out the way or class pertaining to your major.                                            \n\n2. Make a mock schedule. Put the class, time, and days( ex BIOL 11XX 12:30-1:45 MWF) location if it helps. Make sure it’s at least five classes, because classes fill up, they change location, or you might change your mind.                             \n\n3.Email your academic advisor( please use student email) and set up a meeting. Bring said mock schedule. They might change a few things or they’ll approve of it. Also they have to remove the hold off your account .                                   \n \n 4. Ask around about professors. Rate my professor is both accurate and inaccurate. It’s better to ask students in the class about the professor because if the site said Dr. HistoryGuy is hard but students are saying “ He’s doesn’t do PowerPoints, but I record the lectures and got an A- last time I took his class”, then you got conflicting sources. Plus they’ll actually tell you if you need the book for a class because some professors teach at least five classes but only require the book for one.                                                                                    \n\n5. Know which day you can start registration. It’s normally a week, starting with seniors, athletes, and veterans. So on me so forth.          \n\n6. Make sure there is no prerequisite for the classes. If you’re trying to speed things up, see if there’s an alternate class to take. Your advisor should know.                                                                \n\nHopefully these help, and feel free to add your own.",
  "author": "LittleHaitian",
  "created": 1634938401,
  "updated": 1635184711,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}