{
  "sid": "qu7sck",
  "link": "/r/college/comments/qu7sck/bro_why_do_bio_majors_need_physics/",
  "title:": "bro why do bio majors need physics",
  "text": "hi everyone. bio major here and specifically planning to go into neurobio. currently taking physics because of major prereqs and I am having so much trouble in this class, I think it’s bc of all the conceptual mathematical part of it. bio and chem/ochem are equally as hard I feel, but I enjoy them so much more. will this physics stuff even be needed if i want to go into biotech or med school (apart fr it being on the mcat)?? i feel like im goin thru this pain for NOTHING can anyone relate ?? I literally like ochem more than physics which is wild. smh ty for coming to my Ted talk",
  "author": "JuggernautOk7990",
  "created": 1636949670,
  "updated": 1637181515,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.81,
  "comments": {
    "hkoul43": {
      "link": "/r/college/comments/qu7sck/bro_why_do_bio_majors_need_physics/hkoul43/",
      "text": "Biology is applied chemistry\n\nChemistry is applied physics\n\nSo to understand chem you need physics\n\nAnd to understand Bio you need chem",
      "author": "chemistrycomputerguy",
      "created": 1636956582,
      "upvotes": 18,
      "replies": {
        "hkp9s48": {
          "link": "/r/college/comments/qu7sck/bro_why_do_bio_majors_need_physics/hkp9s48/",
          "text": "and physics is applied math, so to understand physics you need math!",
          "author": "wobbletelescope",
          "created": 1636968343,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "hkpj32g": {
      "link": "/r/college/comments/qu7sck/bro_why_do_bio_majors_need_physics/hkpj32g/",
      "text": "A computer engineering major told me that they didn't understand why they need physics too. Physics 2 is electrical and magnetic studies. \n\nPhysics is amazing. Try to learn all you can. It's incredibly useful knowledge to have in your back pocket. The kinematic equations are super great to know.",
      "author": "Awkward_Mail_2786",
      "created": 1636976164,
      "upvotes": 7,
      "replies": {}
    },
    "hkq6o5u": {
      "link": "/r/college/comments/qu7sck/bro_why_do_bio_majors_need_physics/hkq6o5u/",
      "text": "How does an NMR work? Why is it bad to turn off an NMR rapidly with a person in it? (Faraday's Law and Magnetism)\n\nHow are blood pressure, speed of flow, diameter of arteries/veins/vessels related? (Bernoulli's Principle)\n\nHow does radiation and X-Rays work? What are ways to protect yourself? (Electromagnetic Waves)\n\nBiotechnology might require you to know basic electronics.\n\nHow can we model and simulate protein folding and potential drug sites with supercomputers? (Molecular Dynamics uses physics to describe the collisions and interactions between drugs and proteins)",
      "author": "protiumoxide",
      "created": 1636989146,
      "upvotes": 5,
      "replies": {}
    }
  }
}