{
  "sid": "q1hh68",
  "link": "/r/college/comments/q1hh68/transferring/",
  "title:": "Transferring",
  "text": "I’m a freshman and I decided to go to a school 8 hours away from home (for multiple reasons) and it’s a good school but I am just so lonely here and I miss my hometown and my family. Like I literally hate being here. I already want to transfer to a school closer to home for next fall but I’m just worried since I’ll be a sophomore and I’ll be new it will be harder to get involved with clubs and stuff. Does anyone have any advice or experience with this?? If it was earlier in the semester I would probably just drop out and take a gap year but I’m pretty sure it’s too late to do that atp.",
  "author": "Ok_Pollution9335",
  "created": 1633387906,
  "updated": 1634084177,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hfexmhv": {
      "link": "/r/college/comments/q1hh68/transferring/hfexmhv/",
      "text": "i transferred and it was the best decision of my life!",
      "author": "folkloremoonrose",
      "created": 1633388374,
      "upvotes": 3,
      "replies": {}
    },
    "hfezhx9": {
      "link": "/r/college/comments/q1hh68/transferring/hfezhx9/",
      "text": "I would say do what makes you happy.\n\nFor clubs, every year at least at my school they have a day where the clubs set up booths and you can sign up. So no worries about that. Im a transfer student but kind of in a unique situation, i failed out of 4 year school A then graduated from 2 year school B and am now back at school A. But everyone I knew when i was here before is graduated and gone. Really just talk to people, whoever you sit next to in class, the library, dining hall, etc. I got lucky and vibed with a girl in one of my classes and she has an already formed decent friend group that I got absorbed into. Ask people for their numbers so you can collab on hw or something or set up a study \"date\". And then do that, and then bring up something non school related. And go from there.",
      "author": "taybay462",
      "created": 1633389307,
      "upvotes": 2,
      "replies": {}
    }
  }
}