{"sid": "pv13gm", "link": "/r/college/comments/pv13gm/i_ask_my_dad_for_help_with_homework_what_does/", "title:": "I ask my dad for help with homework. What does this make me?", "text": "CS major in my senior year.\n\nMy TA and teacher are pretty useless/purposely unhelpful in helping us figure out these labs, and I know practically noone to work with as I transferred from a community college in Spring 2020, when Covid happened. This is my first semester back in person since then.\n\nIve been experiencing bad anxiety and depression this semester. To ease my anxiety, my dad will guide me through the labs, helping when I'm really stuck.\n\nI am struggling with this. I feel bad that I have a resource others don't, but I genuinely don't know what else to do. Most students I've encountered don't seem really helpful out of a fear of academic misconduct(which I'm not saying is invalid).\n\n How much of a fake/imposter does this make me?", "author": "Steven0710", "created": 1632550640, "retrieved": 1632800345, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"he8c0j3": {"link": "/r/college/comments/pv13gm/i_ask_my_dad_for_help_with_homework_what_does/he8c0j3/", "text": "My husband helps me with my homework it’s like going to tutoring. If you can’t do it and have someone to explain it to you at home it’s super helpful. You’re doing what you’re supposed to. As long as he’s helping and not doing it for you it’s no big deal.", "author": "Coffeeislife1119", "created": 1632583732, "upvotes": 1}, "he88a4a": {"link": "/r/college/comments/pv13gm/i_ask_my_dad_for_help_with_homework_what_does/he88a4a/", "text": "It’d be the same thing as receiving help from a tutor as long as your dad is collaborating with you through the process. \n\nIf he is doing the work entirely on his own or just giving you answers with no explanation, then that may be a problem.", "author": "kizeltine", "created": 1632582009, "upvotes": 2}, "he6w0k2": {"link": "/r/college/comments/pv13gm/i_ask_my_dad_for_help_with_homework_what_does/he6w0k2/", "text": "It makes you a good student. Use your resources, learn from them, and if it's your dad so be it. Does your school have tutoring even though covid is still going on? If not, then I'd bring your professor/TA to the attention of the department chair as a worst case scenario.", "author": "xwolfionx", "created": 1632550959, "upvotes": 5}}}