{
  "sid": "qattmr",
  "link": "/r/college/comments/qattmr/i_went_from_the_best_to_the_worst_in_talent_from/",
  "title:": "I went from the best to the worst in talent from high school to college",
  "text": "I just started college and it has been very rough so far. I'm basically failing all my classes and just had midterms which went rough as well. I'm looking to be a music and computer science major. I'm doing computer science for my parents because they said it pays well and I sort of like it and I wanted music because singing has been my life.\n\nI was a huge role performing in a professional boys' choir and have traveled nationally and internationally since I was 8 and part of the organization since I was 5. I know many say this, but I firmly believe their director is the best voice trainer in the world. Me and him are really good friends, however I had to go to college and I miss him so much. I was told by a few of the main organization members at their last concert that they would love to have me take over the choir when our director retires, because I know how things run and the training style. This is also my dream, but my parents are so obsessed with me being successful and making money.\n\nBefore I went off to college, I decided I would make hopefully myself, and both sides happy - double major in music and computer science.\n\nI just don't know how to feel right now. I just failed another music theory test because that's not really my thing. I feel like I have to prove my talent to pass the class. How do I do that? Is college just not for me?",
  "author": "vocalvincent",
  "created": 1634584718,
  "updated": 1634654532,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hh5nc23": {
      "link": "/r/college/comments/qattmr/i_went_from_the_best_to_the_worst_in_talent_from/hh5nc23/",
      "text": "This is a not-uncommon adjustment to have to make in college (especially? For music majors). You were a hotshot in high school, BUT *so was everyone else* at THEIR high school. The college admissions process (theoretically) skims the most talented group of HS musicians and puts them all in one place. Brings the average up, which makes everybody feel like their relative place in the scale has dropped…because it probably has. But that’s okay, that’s supposed to happen. \n\nRe music theory: it’s very much that part of music school that you kinda have to just pass (unless you’re headed for grad school, in which case you should pass it with better than a C, and, ya know, actually understand and retain all of it because it’ll show up again). If you’re doing CS as well I assume you’re fairly mathy, and suggest you treat MT like a math class - look for patterns in the music and start thinking of theory as a selection of algorithms.\n\nETA: I’m both a mathematician and a musician, so if you have questions about the STEM/music life feel free to PM me!",
      "author": "themathymaestro",
      "created": 1634592021,
      "upvotes": 5,
      "replies": {
        "hh6wb7d": {
          "link": "/r/college/comments/qattmr/i_went_from_the_best_to_the_worst_in_talent_from/hh6wb7d/",
          "text": "Thanks, your thoughts on music theory made me feel much better, however nope… I currently hate math. Life is rough for me right now. I just got 20/100 on my calc 1 exam last week too.",
          "author": "vocalvincent",
          "created": 1634613570,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh5pfum": {
      "link": "/r/college/comments/qattmr/i_went_from_the_best_to_the_worst_in_talent_from/hh5pfum/",
      "text": "I have a music degree and am a grad student in STEM, so I feel like I can probably offer a valuable perspective. \n\n1) If you're a vocalist and have no background in instrumental music, music school with be *hard*. Instrumentalists tend to have a leg up on all the theoretical aspects of music, because we've been learning it since the day we picked up our instruments. It's generally uncommon for choir directors or vocal coaches to even talk about theory at all, so many vocalists are hit with a lot of new material all at once their first semester of college, whereas for most instrumentalists, it's almost entirely review. \n\n2) If you don't have any instrumental background, get some ASAP. Piano or guitar is usually best for vocalists. This background helps all the the theoretical elements \"click\" more easily.\n\n3) I've known people who have tried to major in CS and music, but none that have succeeded. These are highly intelligent, highly motivated people who have a passion for both areas. Both majors are intense, and there is no overlap. Signing up for a double major in music and CS is equivalent to signing yourself up for two full time jobs. That being said, I've known many people who have successfully majored in one and minored in the other, and I also know many people who have majored in one and gone to grad school for the other. In other words, it's possible to keep doors open if you can't manage the double major, and and chances are you won't be able to handle the double major (unless you're willing to spend more than 4 years on a bachelor's degree). \n\n3) There are many great musicians who struggled with theory at the beginning. Experience and practice goes a long way, and again, if you currently don't play an instrument, you need to start ASAP because that will help. Visualizing everything on a piano is a good way to help theory ideas \"click.\"\n\n4) I don't think you need to choose between CS and music yet, as you're only a freshman. There will probably come a point where you'll have to choose which one you're going to devote your time to. Take a semester or two to take classes in both areas and see what feels \"right.\" It's possible you might actually like programming.\n\n5) There are some really cool applications of CS to music. You should look into these.",
      "author": "HumanDrinkingTea",
      "created": 1634592954,
      "upvotes": 1,
      "replies": {
        "hh6wui0": {
          "link": "/r/college/comments/qattmr/i_went_from_the_best_to_the_worst_in_talent_from/hh6wui0/",
          "text": "Thank you. I do play a little piano, but was once again disappointed when I came here to college. I thought I could be an early intermediate piano student, but I soon realized I wasn’t even good enough for the audition because I haven’t played many minor keys. I really hope something will come along and all my classes will go fine, but I just don’t know what to do at the moment. Music theory has gone beyond just imagining the keys, and although I draw a piano on every test, there are some things like Roman Numerals and Types of Chords that make no sense. I appreciate your wisdom",
          "author": "vocalvincent",
          "created": 1634613842,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}