{
  "sid": "qq72cj",
  "link": "/r/college/comments/qq72cj/anybody_here_work_for_a_university/",
  "title:": "Anybody here work for a university?",
  "text": "So I'm working on a research report, and part of it requires me to understand the process for changing a degree program. I've already exhausted the internet, my uni's library, emailed my advisor to no response, and I've called the provost of my school asking for an interview. They haven't called me back yet and it's cutting it kinda close. I could probably make do without this information but it would be so much better if I could get this research in. If anybody here works for a university or has some other credentials and can answer any of these questions, I would be very grateful:\n\nHow does a university plan its course offerings? i.e. when courses are offered, what time of day, how many sections, why just spring or just fall, etc.\n\nWhat is the process for changing a degree program? What needs to be considered and who all is involved?\n\nWhat tend to be the most pressing obstacles for changing degree programs?\n\nWhat are some small ways to grow a program?\n\nI don't know if this counts as seeking personal gain, and I wouldn't have come here if I hadn't already tried talking to real people from my university. I hope this doesn't get deleted but oh well if it does I guess. Tbh any discussion on these topics would be valuable <3",
  "author": "RoyalWaterfowl",
  "created": 1636474443,
  "updated": 1636655244,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjyzati": {
      "link": "/r/college/comments/qq72cj/anybody_here_work_for_a_university/hjyzati/",
      "text": "If you go to a public school, all of the answers to these questions are likely public info- just hard to find. \n\nBig changes to degrees or making new degrees usually go through some kind of curriculum review process, often overseen by faculty senate of whatever the governing body is called there.  Try searching your school website for: faculty senate, curriculum committee, curriculum review, proposed degree.   If you are part of a state university system, there is likely some central oversight and approval steps too. If the provost it too hard to connect with, department chairs, or leads for individual programs should know the process.  \n\nAt my school they have to show the market demand for the program, the budget cost vs revenue, the learning objectives for the degree, outside accrediting requirements (mostly for applied degrees- business, engineering, social work, counseling, public health), degree plan and course map. \n\nWe have a course planning guide where the term a class will be offered is scheduled up to a few years in advance.  The actual time-day offerings are done about a term in advance.  There are forms the department submits to a scheduling office. Departments try and minimize conflicts for required classes.  The registrars office has a scheduling team that makes it all fit in the available classrooms usually with the help of a course management/ room scheduling tool (like CollegeNet)",
      "author": "somerandomhelp",
      "created": 1636485352,
      "upvotes": 1,
      "replies": {}
    }
  }
}