{"sid": "djizky", "link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/", "title:": "Pulled four all nighters and ended up sleeping through my midterm.", "text": "So it’s my freshman year of college and I’ve been here for about two months by now. Specifically, I attend an art school that’s relatively rigorous in terms of workload. For the most part though I had been able to manage my work fine, but then midterms rolled in. I was pulling all nighters left and right for all of my projects and getting 0-2 hours of sleep almost every day. Today, I had a midterm in art history and I had the bright idea to once again, pull another all nighter. I thought I had the willpower to do so but I ended up passing out at around 7am and then waking up in horror at around 3pm. I had slept through all of my 37 alarms (Also apologies to my roommate I’m trying to get better at it) and missed my midterm. I frantically emailed my professor and told him my situation and if there’s a remedy to this whole disaster, but I have a good feeling he’s not going to cut me any slack. I don’t really know what to do at this point and if I should just withdraw from the class because the only grades we get are a midterm, final paper, and final exam. (the midterm is 25% of our grade haha end me) So if I get a 0 on the midterm is there really any hope for getting that up to a passing grade? Also if I fail a class does that mean I have to wait another year to graduate because I was a couple of credits short? I’m honestly just confused and miss my dog\n\nEDIT: Got an email back from him and told me that I just have to deal with my mistake. Welp", "author": "cheepfish", "created": 1571377008, "retrieved": 1632801986, "over_18": false, "upvotes": 1473, "upvote_ratio": 0.98, "comments": {"f5pl6n2": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f5pl6n2/", "text": "drop the class retake it next semester lol. if its like my school theyll just replace the incomplete grade on your transcript.", "author": "backuppasta", "created": 1572362014, "upvotes": 1}, "f505etg": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f505etg/", "text": "For this I think that the best bet would be to try your damn hardest for that class specifically, you should use all of your studying strengths in that class specifically, you’ll still have a passing grade if you get a 100% on everything else. It might seem unrealistic but just try your best and power through. And hey, if it doesn’t work out then you’ve learned from your mistake.", "author": "yusenatorx", "created": 1571922186, "upvotes": 1}, "f4jctoe": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f4jctoe/", "text": "F", "author": null, "created": 1571617199, "upvotes": 2}, "f4d1pbz": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f4d1pbz/", "text": "humans need sleep. that's just the reality of it. barely sleeping will pay off in the short run because you're able to finish assignments and projects but then it'll come around to bite you in the ass as you've seen. you don't need to sleep 10 hours a day, but 6 is like the bare minimum healthy people get.\n\n&#x200B;\n\npersonally, during the week i go to bed at 12/12:30 no matter what and wake up at 7am. you should try to work towards building a regular and consistent sleep schedule for the sake of your health. you will not make it 4 years without an adequate amount of sleep.\n\n&#x200B;\n\nthe lack of sleep could be a result of poor time management too", "author": "edmvnd", "created": 1571536867, "upvotes": 1}, "f49elcb": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f49elcb/", "text": "I actually did something like this my freshmen year... Tho not 4 nights in a row that'd crazy.. It's a good life lesson more than anything. You'll probably get like a C- in the class which isn't the worst grade ever, though it'll probably bring down your GPA.. I'd just take the hit and if you need to retake it later.", "author": "clairdecat7", "created": 1571463801, "upvotes": 1}, "f48wvxx": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f48wvxx/", "text": "You don’t need to pull an all nighter in college. It literally. will. not. help. you. I say that I’m pulling all nighters but really I’m going to bed at 2 am and waking up at 6 am to study. That is much better than staying up through the night. At a certain point you don’t even retain info anymore, so what’s the point? Although, I do think the saying “if you don’t know it by 10 pm you won’t know it at all” is stupid because most of the tests that I’ve gotten hundreds on are because of the last few hours of studying from 11-2 am. \n\nJust don’t procrastinate. Start studying early. It took me a year to learn this, but pulling an “all nighter” is self-sabotage and honestly just an “edgy” lazy kid thing to do. I’ve had a 4.0 (taking 18 hours) the last two semesters of my junior year and I never pulled one all nighter.", "author": "ash3lynn", "created": 1571451190, "upvotes": 2}, "f48pgea": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f48pgea/", "text": "This is why you don't pull all-nighters, pls take care of yourself", "author": "markyluke", "created": 1571445194, "upvotes": 3}, "f48lnj8": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f48lnj8/", "text": "That is totally on you. I have never had to pull an all nighter in college. You should work on time management. I block out my free time every day to work on assignments. Do things over multiple days, and make sure you review material daily and keep up on flashcards or notes. The trouble with college is that you have more free time, but you need to budget it for work. \n\nI don’t know how many classes you have but if you seriously have too much work you need to talk to your advisor about class load. But I am suspicious that you seriously couldn’t budget your time better to get some sleep. You’re better off sleeping and not studying than the other way around.", "author": "saveme-shinigami", "created": 1571442168, "upvotes": 3}, "f48fju9": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f48fju9/", "text": "As a college student myself understand why people pull all nighters. However, I find that I would rather take a test without studying than study and take it with no sleep. Beyond that, getting less than 8 hours of sleep consistently has been linked to alzhiemers (not spelled right?) Among other mental diseases. It is also linked to several cancers and to general physical fitness. I hope people read this and do their own research to find the value of sleep. I know this doesn't help your situation right now, but unfortunately it's gonna be your teacher’s call on what happens with the test. Just remember, YOUR GRADES ARE NEVER WORTH YOUR HEALTH!", "author": "Wynn_lynch", "created": 1571438013, "upvotes": 3}, "f4871bd": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f4871bd/", "text": "The reason I pull all nighters is because I usually prioritize sleep too much", "author": "jmora13", "created": 1571433504, "upvotes": 1}, "f481ghu": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f481ghu/", "text": "All nighters are stupid", "author": "Eteacles", "created": 1571431149, "upvotes": 2}, "f47zvwp": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f47zvwp/", "text": "Freshman year I forgot it was midterm day so I was playing league and realized the midterm was halfway through... ran there and got there with only 15 min left. Finished in 8 min, got a 61% and still passed the class with an 88. \nEdit: I should add that I got a 66 on the final", "author": "lolsup1", "created": 1571430541, "upvotes": 2}, "f47tusf": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f47tusf/", "text": "Honestly can’t imagine going to bed past 1:00 for an assignment, and probably not past 11:00 for a test lmao if it’s not done by then it’s not getting done", "author": "sparkle1789", "created": 1571427811, "upvotes": 3}, "f47mbd1": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f47mbd1/", "text": "I'm sorry you had to go through this, but let this be a learning experience for you going forward.", "author": null, "created": 1571424417, "upvotes": 1}, "f47ksja": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f47ksja/", "text": "Did your professor reply to your email?", "author": null, "created": 1571423727, "upvotes": 1}, "f47jhg3": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f47jhg3/", "text": "Non-stem majors will tell everyone pulling all nighters is bad. They don't know what having 5 classes and 5 different cs projects is like lol", "author": "andrezMolina", "created": 1571423209, "upvotes": -2}, "f47g2q3": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f47g2q3/", "text": "Talk to the prof, if there is no reasonable way to pass, try and switch it to credit/No credit. It has a longer threshold than dropping classes, and won't affect gpa. Many schools won't let you drop a class after that long without a good reason. (Thinking your going to fail isn't good enough to them, or will leave a W on your record. But a W is better than an F or D when it comes to your major.) Also if the class is just general ed, you only need a D to for it to count towards your degree c/nc needs at least a C to get credit.", "author": "Gmobile13", "created": 1571421909, "upvotes": 1}, "f47fn9b": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f47fn9b/", "text": "i’m a senior in college, graduating this may. i may have stayed up late (2-3am may have been the latest), but never pulled an all-nighter regardless of the amount of work i have. \n\nnow you know OP, all-nighters aren’t really healthy for ya. you should get at least amount of sleep a day.", "author": "welchie98", "created": 1571421746, "upvotes": 3}, "f47bajx": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f47bajx/", "text": "You can retake a test but you can’t retake a party haha am i right?! Wait this isn’t what this post is about?!", "author": "khattabovic", "created": 1571419960, "upvotes": 2}, "f47al23": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f47al23/", "text": "So many people in the comments saying shit like \"are people THAT bad at doing work during the day that they need to pull all nighters?\" \n\nSome of us are pursuing double or complex majors. Some of us pursue time consuming passions and their extra classes, like music or dance. Some of us work jobs. Some of us live in co-ops where we cook and clean for ourselves. Some of us are adjusting to college and all its new people and expectations, and must undergo time consuming emotional labor. Some of us get hit with random, unpredictable and unavailable migraines that make work impossible. \n\nSome of us are dealing with EVERY SINGLE ONE OF THESE. An occasional all nighter might be necessary. So maybe don't be so judgmental, yeah?\n\n[edited for clarity]\nEdit again: y'all I'm not condoning always procrastinating to the last minute so you're constantly pulling all nighters. Obviously OP's habits were bad and it's bad if you're missing class or commitments because you're overbooked. All I was saying is not to be SO judgy over an occasional all nighter, because you don't know what people are going though.", "author": "zeropointninerepeat", "created": 1571419668, "upvotes": -2}, "f479wr3": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f479wr3/", "text": "It be like that", "author": "Demon_Hunter739", "created": 1571419388, "upvotes": 1}, "f476byl": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f476byl/", "text": "Something like this happened with me too. Almost missed my midterm due to sleep. Rushed and went for class half and hour late. I wouldn't recommend all nighters. They make you tired and confused the next day", "author": "Radbabe13", "created": 1571417918, "upvotes": 1}, "f4727xt": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f4727xt/", "text": "if you need to pull all nighters to pass art school then you need to start working sooner and stop procrastinating", "author": "EviJ_Genius", "created": 1571416470, "upvotes": 5}, "f471dmv": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f471dmv/", "text": "lmaooo dumbass", "author": "OneUmbrellaMob", "created": 1571416184, "upvotes": 6}, "f46wz8q": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46wz8q/", "text": "Honestly my dude or dudette I am yet to pull an all nighter yet I have above a 3.5. In my experiance nearly everyone pulling all nighters before an exam are the ones who have sub 3.0 GPAs even though they are a lot smarter than that. Sleep is the most important part of school after showing up to the classes and getting assignments in on time. This is because a healthy  sleep schedule literally makes you remember and recall better. As well as this you don’t feel like shit the whole day and it is easier to fall asleep. However it is hard to get into the rhythm at first especially if you have the bad habit of staying up late like I did. My advice is to try to start now and to start your sleep schedule a month before school starts that way you are used to it.", "author": null, "created": 1571414486, "upvotes": 5}, "f46ss81": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46ss81/", "text": "r/thathappened", "author": "maddeningcrowds", "created": 1571413015, "upvotes": -1}, "f46qpax": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46qpax/", "text": "I just audibly laughed in a lecture while reading \"I had slept through all 37 of my alarms.\"  So fucking relatable", "author": null, "created": 1571412253, "upvotes": 3}, "f46pbwy": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46pbwy/", "text": "All nighters are a double edged sword in my opinion.  I get why people do it and why it’s necessary in some cases but what a lot of people forget is that we actually do learn when we sleep. Look it up it’s an actual thing! Going forward I would try to allow some time for actual sleep since yeah too little will cause a crash like you saw unfortunately. \n\nQuestion what’s your current grade in the class? And is it one for your major or just a class your getting out of the way? 25 percent will definitely knock a chunk out of your grade but it might not stop you from passing depending on what your grade was.\n\nAbout waiting to graduate that depends on how often the course is offered. If it’s a once a year then you may be out of luck which sucks. But also speaking from experience it’s not the end of the world to take more then 4 years to graduate", "author": "stargirl09", "created": 1571411746, "upvotes": 1}, "f46omyc": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46omyc/", "text": "Good news is this was a valuable lesson for you and that you’re only a freshman. Bad news is, well, you slept through all your midterms. I suggest talking to your professors during office hour and begging them if there is anything you can do. To be frank, you have to over exaggerate your story. In other words, you may have to lie. I know this sounds really bad, but many college students do it and receive another chance, while those with honestly who made a mistake won’t. You do not have to wait another year to graduate if your program has summer and winter courses (since we primarily take fall and spring courses. Hang in there buddy, you got this.", "author": "Life-of-Moe", "created": 1571411497, "upvotes": 2}, "f46lgxp": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46lgxp/", "text": "You can die if you do that crap. Get sleep.", "author": "REVIGOR", "created": 1571410358, "upvotes": 3}, "f46l3hx": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46l3hx/", "text": "F", "author": "LZ_XC", "created": 1571410211, "upvotes": 1}, "f46kao4": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46kao4/", "text": "worst case scenario you drop this class and take a spring course", "author": "carpet_candle", "created": 1571409908, "upvotes": 1}, "f46jagb": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46jagb/", "text": "It sucks that this happened, but you *need* to prioritize sleep. When I was a college student (not that long ago! I only just graduated) I would literally put in my calendar a block of time where I intended to sleep. A few times I still would end yp staying up obnoxiously late to finish something (the latest was 7am), but I never actually pulled an all-nighter and those only occurred once or twice a semester.", "author": "MocknozzieRiver", "created": 1571409529, "upvotes": 1}, "f46ir01": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46ir01/", "text": "Should not abuse yourself so much. You could dooo that", "author": null, "created": 1571409333, "upvotes": 1}, "f46hqpk": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46hqpk/", "text": "My guy , listen here. I know for one in my high-school days sleep was always up to be sacrificed. But, you have got to stop seeing it that way. College has enough stressors put on the back of every single one of us, and sleep is the only way to recover from such. Not giving your body ample rest in preparation for something intellectually intensive really just doesn't make sense success wise and most importantly health! I remember pulling an all nighter for a Diffeq and literally walking into the wrong classroom and not noticing till a minute before the exam started!", "author": "rsirimanne", "created": 1571408959, "upvotes": 1}, "f46gka6": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46gka6/", "text": "OP, while I don’t attend an Art school, I did spend my entire freshmen year attending to the wishes of my family in *the hardest engineering program my campus offers* only to sit down after failing basic chemistry midterms and tell my advisor I hate it and want to be in a creative field, now, doing a triple-play Semester in the digital art program at my campus, I understand. Each week I have \n\nPhotography project (PS, sometimes Premier)\nDigital art project (AE and Premiere)\nCreativity class project (word, but time.)\nAnd a content analysis (like you see on YouTube) project. (Playing a videogame, then formulating the analysis)\n\nI’m not comparing, BUT, I have an insane lack of motivation to do anything, all I can say is, another semester isn’t the end of the world, and if you suffer from the same, I recommend you look at this video. https://youtu.be/PMhla3ks6FI", "author": "AidanTheAudiophile", "created": 1571408516, "upvotes": 2}, "f46es9n": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46es9n/", "text": "I've spent all nighters cramming before, luckily there's a couch to sleep on in the building outside the classroom. Just keep in mind they let you know about these things way ahead of time for a reason.", "author": "mouseysmack", "created": 1571407835, "upvotes": 1}, "f46e84x": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46e84x/", "text": "Like that little old lady in Maine replied when asked who she voted for: 'Oh, I don't vote. It only encourages them...' \n\nSo I applaud your courageous stand.\n\nIf more stood with you, and stopped going to exams, maybe the profs would stop giving them...\n\n\n*I do feel for you, 'cause been there, overslept that. (Twice!) It happens. Go see - not email, make the effort! - the prof. Painful, but either way it was a learning experience....*", "author": "nabe02141", "created": 1571407615, "upvotes": 1}, "f46ced0": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46ced0/", "text": "For those who are saying they are constantly having to pull all nighters, that means your load isn’t properly balanced.  Either you are taking too many classes, aren’t taking the right combo of classes (you need to balance high intensity classes with low intensity ones), or have too many extracurricular activities going on.\n\nAn all nighter, once in a while (especially around midterms or finals), may happen.  However, those should not be a regular thing and if they are, your balance (with one of the things I mentioned above) is wrong and needs to be adjusted.\n\nTo OP, I’m sorry that happened to you, but I have to concur with the others.  If you’re already struggling that hard (and MUST get 100% now on everything else) then your problem is only going to increase throughout the rest of the term.  If the professor will work with you, maybe examine your balance to see what you can fix.  If not, then drop class (that solves two problems, the stress of having to get 100 on everything else AND some of your workload, which will make you more successful in other classes).", "author": "PawtismSpeaks", "created": 1571406955, "upvotes": 14}, "f46alks": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f46alks/", "text": "No matter how much work, getting at least 5 hours of sleep is more important. Pulling 4 all nighters probably hurt your work quality more than it helped it.", "author": "wombatnoodles", "created": 1571406301, "upvotes": 1}, "f467bvi": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f467bvi/", "text": "You need a worse roommate. I would have yelled at you by alarm #5 and you would not have missed your test :)", "author": "toiavalle", "created": 1571405087, "upvotes": 1}, "f467bfv": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f467bfv/", "text": "Some professors are understanding but you could face a deduction or just say no. If it isn't part of your major, you could set the class to pass/fail so it won't effect your GPA. \nAlso I know you don't want to hear the obvious but do not do all nighters. All nighters are no beneficial to you at all! You need your sleep, especially for a midterm.\nEdit: i also hope your professor lets you retake it!", "author": "danikitty710", "created": 1571405083, "upvotes": 1}, "f465tii": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f465tii/", "text": "Use an app called alarmy if you struggle with sleeping through your alarms. This app has saved my ass so many times", "author": "mrnarwhal1", "created": 1571404499, "upvotes": 1}, "f465c6c": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f465c6c/", "text": ">I thought I had the willpower to do so\n\nEventually biology takes over willpower. That's just what the body does to protect itself, willpower becomes less of a factor as the hours without sleep increase and it becomes more about your physiology.\n\n> I was pulling all nighters left and right for all of my projects  \n\nYou do know that this type of work is generally not productive, right? Work quality typically deteriorates with tiredness so that hour you spent working at 6pm is much more valuable than the 4am hour you did. Additionally, for tests, all nighters typically *hurt* your grade when compared to just getting sleep (ironic).", "author": null, "created": 1571404290, "upvotes": 32}, "f45yapo": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45yapo/", "text": "What the fuck were you guys doing in high school? That was the time to develop healthy studying habits, sounds like you need to take a step back and see what works for you and what doesn’t. Your putting way too much pressure on yourself and its inevitably making you more tired and stressed. You sound like a very devoted student and thats all you need to succeed, use this as a lesson and learn from your mistake. Sleep and a full belly are the 2 most important things during a test, your brain needs sleep to retain information, otherwise your just cramming stuff into it as fast as possible till the test and then poof, you forget.\n\nI had a friend who got out of high school with the governors medal (its a thing in canada for like super good students) and now he’s in college and he’s in the same situation. He’s putting way too much pressure on himself and study’s 24/7 and its not really a healthy habit.", "author": "Bigthom63", "created": 1571400274, "upvotes": 4}, "f45vswb": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45vswb/", "text": "I did the same exact thing and slept through my bio final, though my teacher let me take it with his honors section the next day.\n\nWorst case scenario you just take the class online over the summer or something my dude", "author": "TheMiniLiar", "created": 1571397581, "upvotes": 2}, "f45rz0a": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45rz0a/", "text": "I know how projects can be and I know that sometimes your brain just can't get to working until its in crisis mode. Or maybe its taking longer than you thought. Or maybe you had other stuff going on. I get it, I've done too many all-nighters for projects and essays.\n\nBut pro tip for the future:  never do an all-nighter for an exam. If you don't know it in time to get at least 6-8 hours, then staying up all night probably won't help you. You'll be tired and won't be able to think right so its better off to just take the L and get a decent sleep", "author": "Atomicmonkey1122", "created": 1571392453, "upvotes": 3}, "f45q83y": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45q83y/", "text": "I say email the professor to let him/her know that you were serious about taking the exam. You're a freshman, so if the professor has a heart than you can probably schedule another day to take the exam (perhaps during office hours). Don't give up!", "author": "wednesthurs", "created": 1571389763, "upvotes": 13}, "f45ojwm": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45ojwm/", "text": "You’re fine! One extra year, quarter, let alone one class, is not a big deal. Most people don’t finish in exactly 4 years anyway", "author": "Alexissanchize", "created": 1571387112, "upvotes": 5}, "f45ogts": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45ogts/", "text": "I know where you're coming from. I had a professor once that assigned a huge midterm paper worth 25% of our grade to be due over our Spring Break. I thought it was due the next week so I took a break from schoolwork the majority of it. To my surprise, I completely missed the due date. I frantically e-mailed my professor explaining why I didn't turn it in but he never got back to me. I somehow got away with a B in the course, so maybe he gave me some sympathy points at the end...but anyway all nighters can be super hard on your body and your mind. It can cause burnout super quick and I hope that you can find a way to avoid all nighters in the future! Give yourself a day to rest as soon as you can, you deserve it! Good luck!", "author": "IngridtheNord", "created": 1571386979, "upvotes": 6}, "f45nlka": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45nlka/", "text": "Don’t feel bad. \n\nI took 25mg if adderall to write my finals paper on the last day it was due. 8 pages written in 4 hours. Then went on to write my finals presentation for another class. \n\nMade it to class did my half ass presentation while on a heavy drug come down. Got a C- on presentation. \n\n4 days later got my paper back.\n\nD-  “You did not answer the question, I gave you a passing grade because your paper was fascinating in regards to the topic, but you did not answer the question at all.”\n\nIt isn’t as bad as pulling 4 all nighters and failing, but even taking a performance enhancing drug I manage to do worst.", "author": "Xiscis", "created": 1571385614, "upvotes": 16}, "f45mzps": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45mzps/", "text": "If your professor doesn't cut you any slack but you get A's on the final paper and exam you would have a C (assuming low 70's are C's). Find out how your school factors retakes into your GPA. At my school, if you fail a class and retake it and get say a B, then the failing grade, while still on your transcript, doesn't factor into the GPA at all and is completely replaced by the retake. If your school does something similar I would suggest staying in the class even if you don't think you can get the C. For one, who knows you might surprise yourself and pull it off, and two, if you have to retake it, it'll be really easy the second time around. Retaking it (or withdrawing and taking it later) absolutely does not mean it'll take an extra year or even semester to graduate. You could either take it in addition to the other courses you would normally have one semester (which yes, would make you even busier, but if you learned it pretty well the first time around it should be manageable), or you could take it over a summer. You could see if your school will accept transfer credits from any community colleges, and if those colleges offer it online over the summer as that makes it quite manageable both time and money-wise. Though having it transferred will probably make the GPA factoring even more complicated. If that route sounds good to you I would suggest talking to an advisor about it, withdrawing might be better if you decide you want to take it somewhere else.", "author": "charlie6282", "created": 1571384704, "upvotes": 8}, "f45mt4m": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45mt4m/", "text": "this is shitty i’m sorry you had this experience! little piece of advice going forward - sleep is the ultimate university life hack. i started planning my schedule around getting a minimum of 6 or 7 hours a night and it has done WONDERS for my grades & mental health", "author": "teriyakitortoise", "created": 1571384425, "upvotes": 99}, "f45mpcw": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45mpcw/", "text": "I overslept and missed my bio midterm today so I feel this deeply.", "author": "synnplicity", "created": 1571384268, "upvotes": 37}, "f45mcl0": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45mcl0/", "text": "well if the midterm is worth 25% of your grade that would mean that you'd have to basically get perfect scores in all your other exams, quizzes, hw assignments, ect. In order to get a 75%, which IS possible, but if I were you I'd first contact the professor and explain your circumstances. If they tell you they can't allow you to make up the exam, I'd ask about extra credit opportunities. \n\nIf that isn't possible Id considering dropping the class BUT make sure there aren't any extreme consequences BEFORE doing that. \n\nWhat I mean by that is whatever major you're trying to do **you usually have to get into the major AFTER getting accepted into the college**. So say that you are an art major but you are not in the official art program yet. You need to research the requirements to get into the major and every university's art program has different requirements.\n\nFor example, some Universities have very strict programs and may not allow you to withdraw from ANY of the prereqs or give you a limited number of withdrawals or attempted retakes. And if you break the major requirements you may be completely barred from getting an art degree from the school and have to transfer to another school if you want a degree in the field. \n\nAll I'm saying is do your research before withdrawing a class. Otherwise, it may be more beneficial to stay in it and take the C.", "author": "ucfskateboarding", "created": 1571383752, "upvotes": 2}, "f45m73k": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45m73k/", "text": "Pulling all-nighters, contrary to popular belief, is completely avoidable in college. I never pull an all-nighter (willingly anyway... damn my insomnia), and am doing very well in my courses.\n\nYou honestly should never have to pull an all-nighter. Prioritize sleep above all else. Plan your projects better in the future so you work on them well ahead of time. Pulling all nighters is simply detrimental in all respects. The work you do during an all-nighter is likely shoddy scrapped together work. You lose out on sleep which affects your mental state the next day which will cause your academics to suffer down the line. And if it comes to it, you experience what you just experienced: missing a major course event.\n\nAnyway, you might pass even having missed the midterm but it will be an uphill battle the whole way, and the *very best* you can hope for is a C, and that's only **if** you get 100%s on everything else besides the midterm (including things you already turned in).\n\nHonestly, if it were me, I'd drop the class if the professor doesn't give you any other recourse. If you fail or your drop it you will be required to retake it, and you probably can figure out a time and way to retake it that doesn't extend your graduation date.", "author": "peregrin5", "created": 1571383537, "upvotes": 815}, "f45l41w": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45l41w/", "text": "I’m so sorry:( I actually had a similar thing happen... a depression nap turned into a full blown sleep and I missed my midterm. After a lot of crying and freaking out I emailed the professor and I actually was able to make it up the next week, so there’s definitely a chance that you’ll be able to make it up. I hope everything works out okay!", "author": "smores024", "created": 1571381970, "upvotes": 74}, "f45jo5t": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45jo5t/", "text": "Firstly, sorry this happened!! i know freshman year is stressful and you’re still figuring a lot out. secondly, it really isn’t the end of the world. if your professor does cut you some slack then that may be the best route as you can still do well on the other assignments, too, but worst case scenario you end up with a C. you can also check the syllabus as there’s usually a section about missed/rescheduled exams to get a better idea of what the response may be.  just remember a passing grade is better than nothing!  if a potential C bothers you, then withdraw from the course. a W your first semester is really nothing in the long run and every academic advisor i’ve talked to has mentioned that.  also not a bad idea to talk to an advisor as they can give course/school specific advice. don’t worry too much about it man i know it sucks but it’ll work itself out :) best of luck", "author": "banana_jpg", "created": 1571379999, "upvotes": 13}, "f45info": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45info/", "text": "> I’m honestly just confused and miss my dog\n\nSincerely, \n\nevery college student", "author": "dumbguts", "created": 1571378690, "upvotes": 1777}, "f45ijx8": {"link": "/r/college/comments/djizky/pulled_four_all_nighters_and_ended_up_sleeping/f45ijx8/", "text": "I’m so sorry this happened!! I can’t believe your roommate didn’t wake you up if they heard those alarms going off for so long. Maybe you’ll hear back from your professor or maybe you’ll have to drop the class I don’t really know. Hopefully it’s a class you could just retake another semester and move some stuff around? Maybe take a summer course or winter course to make room for it? Good luck!!", "author": "the-tired-potato", "created": 1571378564, "upvotes": 147}}}