{
  "sid": "qocu68",
  "link": "/r/college/comments/qocu68/how_to_work_on_thing_while_in_a_depressive_spiral/",
  "title:": "How to work on thing while in a depressive spiral?",
  "text": "Im currently feeling so down i dont feel like working on anything and i have some things due not long from now. This is really stressing me out. How do i clear my mind so i can focus and get this done. I dont wish to fall behind in school.",
  "author": "321ECRAB123",
  "created": 1636244011,
  "updated": 1636655813,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hjoj12m": {
      "link": "/r/college/comments/qocu68/how_to_work_on_thing_while_in_a_depressive_spiral/hjoj12m/",
      "text": "3 day rule !! My fav tip from my therapist ever and saved me in school and saved me from spiraling out of control \n\nDay 1: give in to the big sad. finish anything you can and then just give in to your emotions. \n\nDay 2: do absolutely nothing! Don’t go to class. if your body needs sleep, then sleep. if you don’t wanna get out of bed all day, don’t. complete self care day. \n\nDay 3: start being productive again. Go to class, make your bed, make a list of tasks to get done and do one. Feeling good then do another. call your friends or family, talk to someone or go get out for an hour. but day 3 is when you start making a conscious effort to get back on track. \n\nThe 3 day rule has helped me keep my academics and emotions together without completely falling off the rails. Try not to skip two class lectures in a row, missing once is fine but twice can be tricky catching up. Your mental health always comes before school, breaks are necessary and good for you, burnout sucks. I promise you’re doing great even if you don’t feel like it, good luck I’m proud of you ! :)",
      "author": "cowboyzep",
      "created": 1636297872,
      "upvotes": 3,
      "replies": {}
    },
    "hjm761n": {
      "link": "/r/college/comments/qocu68/how_to_work_on_thing_while_in_a_depressive_spiral/hjm761n/",
      "text": "I can’t tell you how to clear your mind but try doing intermittent work. Set a timer for 30 minutes and just work until it goes off. If you feel like doing more, then do more. If you want to stop, then stop. \n\nI also will go to the library or a coffee shop to work if i’m feeling down. Forcing myself to get out of the house helps and since i’m already there I usually end up doing all the work I needed to get done. \n\nUltimately, just don’t be too hard on yourself and do be afraid to ask for help if you need it.",
      "author": "rynpickles",
      "created": 1636244477,
      "upvotes": 1,
      "replies": {}
    }
  }
}