{
  "sid": "qkntdr",
  "link": "/r/college/comments/qkntdr/hi_guys/",
  "title:": "Hi guys",
  "text": "I planning to go to community college to get my degree in  diagnostic sonography , is there any thing wrong with community colleges why do ppl make fun of them?",
  "author": "Nighthawk9997",
  "created": 1635800762,
  "updated": 1635890833,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hixkbp4": {
      "link": "/r/college/comments/qkntdr/hi_guys/hixkbp4/",
      "text": "There's nothing wrong with CC. They help millions of students earn college credit, complete degrees and certificates, all while saving money! Best of luck in your program!",
      "author": "templeufrank",
      "created": 1635801266,
      "upvotes": 10,
      "replies": {
        "hixuj6r": {
          "link": "/r/college/comments/qkntdr/hi_guys/hixuj6r/",
          "text": "Thank you  bro",
          "author": "Nighthawk9997",
          "created": 1635805583,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hixmni8": {
      "link": "/r/college/comments/qkntdr/hi_guys/hixmni8/",
      "text": "There's nothing wrong with community college. There is a small section of people who are snooty, don't understand how they work, and thus look down on them. I've had people laugh at me when I mentioned I wanted to transfer somewhere relatively decent (not referring to the cream of the crop) because they believed nothing would transfer from a CC. They were wrong. Whether you intend to transfer or to get a technical degree, they're especially helpful to those of us who are low income.",
      "author": "lightbluejellyfish",
      "created": 1635802235,
      "upvotes": 2,
      "replies": {
        "hixufxl": {
          "link": "/r/college/comments/qkntdr/hi_guys/hixufxl/",
          "text": "Thanks for answering, honestly It's not about the money I'm doing very well actually, but English is not my first language and I  don't wanna go to a 4 year college I want something easy and fast .",
          "author": "Nighthawk9997",
          "created": 1635805544,
          "upvotes": 1,
          "replies": {
            "hixvjdq": {
              "link": "/r/college/comments/qkntdr/hi_guys/hixvjdq/",
              "text": "Some CC's  are pretty rigorous. It really depends on which though. Besides having to do a lot more papers at uni, I can't say the classes in general are much harder. Try to ask around about the profs teaching styles, if possible.",
              "author": "lightbluejellyfish",
              "created": 1635806020,
              "upvotes": 1,
              "replies": {
                "hixwjjc": {
                  "link": "/r/college/comments/qkntdr/hi_guys/hixwjjc/",
                  "text": "Well I'm gonna study diagnostic medical sonography  to hopefully become an  Echo tech , and I well ask about  the teaching style of the school. Thanks again",
                  "author": "Nighthawk9997",
                  "created": 1635806458,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hixvw92": {
      "link": "/r/college/comments/qkntdr/hi_guys/hixvw92/",
      "text": "I was a cc student and transfered a majority of my credits to a private university. I'm on track to graduate with my B.A in political science on time. Not to mention i saved over 75% of tuition from taking cc classes and covering my general eds. I don't regret a thing and i highly reccomend any incoming freshman to consider taking cc because it is a an amazing option.",
      "author": "ReadyCarpet1",
      "created": 1635806176,
      "upvotes": 2,
      "replies": {
        "hixwtag": {
          "link": "/r/college/comments/qkntdr/hi_guys/hixwtag/",
          "text": "Will right on  bro, Thanks for answering.",
          "author": "Nighthawk9997",
          "created": 1635806577,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiy8eyg": {
      "link": "/r/college/comments/qkntdr/hi_guys/hiy8eyg/",
      "text": "Nothing wrong with them, anyone who makes fun of them are just snobbish. At the end of the day, we're all just trying to get an education and no one should be mocked for choosing a path that is different to anyone else's. Many people earn their Associates and go straight to working, some do all their general education courses and transfer to 4-year institutions. Everyone has a different journey and those who mock others' journeys are likely not very nice people to be around.",
      "author": "NoDryHands",
      "created": 1635811711,
      "upvotes": 1,
      "replies": {}
    }
  }
}