{
  "sid": "qpmspm",
  "link": "/r/college/comments/qpmspm/youve_reached_the_wall/",
  "title:": "You’ve Reached the “Wall”!",
  "text": "Suppose you are a junior currently pursuing a Bachelors degree in Computer Science - Cyber Security (track). You have a 2.98 overall GPA right now and the current semester GPA (Junior year, First semester) is looking to be between a 2.5 - 2.8. \n\nYou have an internship at a well known tech company, which relates to my major, and you have yet to fail an interview. Your resume is easily a step above others (besides gpa of course).\n\nYou can’t manage to motivate yourself enough to get out of the bad grade loop, and you don’t want to get stuck with a terrible GPA.\n\nToday is the last day to drop and you are debating what to do.\n\nWould you:\n1. Drop out, take a gap semester, and revisit the root of my passions and possibly consider changing professions. Risking falling out of the interned company loop?\n\n2. Tough it through and possibly tarnish your gpa, and maybe beg professors for mercy?\n\n3. Carry out some other genius solution?\n\nand why? 😁",
  "author": "Scyferonze",
  "created": 1636404425,
  "updated": 1636655315,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hjv434o": {
      "link": "/r/college/comments/qpmspm/youve_reached_the_wall/hjv434o/",
      "text": "1. I'm a junior, why the fuck would I drop out to take a gap year and do what? Work where? Traveling is more expensive then ever plus I want this degree asap so I can start working asap.\n\n2. You need to tough it out but you also need to see where you went wrong. What made you get low grades, where could you improve and what could you have done to get a better grade? Did you go to office hours? Go to TAs? Go to tutors? Are you procrastinating?\n\n3. See #1 and #2.",
      "author": "ShadowIG",
      "created": 1636412012,
      "upvotes": 8,
      "replies": {}
    },
    "hjum4tp": {
      "link": "/r/college/comments/qpmspm/youve_reached_the_wall/hjum4tp/",
      "text": "My husband had to bribe me with books and movies during my last couple of semesters. It worked.\n\nThe one time I took a semester off was when I was struggling to pass lower-level courses for my selected major at the time. I needed to seriously rethink my career path.",
      "author": "WindamereArtifactor",
      "created": 1636404735,
      "upvotes": 3,
      "replies": {
        "hjvjdgt": {
          "link": "/r/college/comments/qpmspm/youve_reached_the_wall/hjvjdgt/",
          "text": "the incentives really help! i always reward myself with buying an album or something i wanted if i had a few tests, big assignments, or even just a particularly exhausting week",
          "author": "bandtrash_ands",
          "created": 1636418833,
          "upvotes": 3,
          "replies": {}
        },
        "hjuubux": {
          "link": "/r/college/comments/qpmspm/youve_reached_the_wall/hjuubux/",
          "text": "Bribe you to continue? Do you feel that the result was  worth it or helped you to achieve what you wanted?",
          "author": "Scyferonze",
          "created": 1636407995,
          "upvotes": 1,
          "replies": {
            "hjuv59m": {
              "link": "/r/college/comments/qpmspm/youve_reached_the_wall/hjuv59m/",
              "text": "Yes and yes. He would buy books or movies he knew I wanted and wouldn't give them to me until my assignments were done.",
              "author": "WindamereArtifactor",
              "created": 1636408316,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}