{
  "sid": "qqxpip",
  "link": "/r/college/comments/qqxpip/forgot_to_register_for_next_semester/",
  "title:": "forgot to register for next semester :(",
  "text": "I forgot to register for next term and feel sick to my stomach because not only can I not trust myself to meet important dates but now I'll have to be in college longer because I'm technically wasting half a year on a random course when it could have been avoided. I just need words of advice right now because I 'v got no hope for myself.",
  "author": "Itbelikedat0101",
  "created": 1636560423,
  "updated": 1636655166,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk2z6tw": {
      "link": "/r/college/comments/qqxpip/forgot_to_register_for_next_semester/hk2z6tw/",
      "text": "make sure you keep your eye on the registration bc i know a lot of classes lose students closer to the term! i would also reach out to some professors who are teaching classes you need and ask if you can take their class. one time a class was full that i absolutely needed and i emailed the professor and they made an exception and let me in their class. they have the power to let you in so i would definitely ask!",
      "author": "the_obsessives",
      "created": 1636560543,
      "upvotes": 2,
      "replies": {
        "hk49gwx": {
          "link": "/r/college/comments/qqxpip/forgot_to_register_for_next_semester/hk49gwx/",
          "text": "If you do this OP, make sure that you acknowledge that the professor would be doing you a favor by letting them into their class. They are in no way required to allow overloading, and approaching the situation with an entitled attitude will simply make your case worse.",
          "author": "patrdesch",
          "created": 1636578498,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk39efe": {
      "link": "/r/college/comments/qqxpip/forgot_to_register_for_next_semester/hk39efe/",
      "text": "A lot of people get dropped at the payment due date so you might be able to get in then. Honestly just get on waitlists and keep checking back and you can probably get a full schedule of classes you need. Also get the app Coursicle and set up alerts for when seats open up.",
      "author": "ilikecacti2",
      "created": 1636564533,
      "upvotes": 2,
      "replies": {}
    },
    "hk31q6m": {
      "link": "/r/college/comments/qqxpip/forgot_to_register_for_next_semester/hk31q6m/",
      "text": "don’t feel as if you need to rush to get out of college. i’m a year behind and totally okay with it because i’m in no hurry. it’s easier for me to go at my own pace because i struggle balancing school, home, and work, and it helps me with money too. some people can take a lot of classes and be totally okay whereas others, like myself, experience burnout easily.\n\nif it’s too late for you for you to register, consider this semester as a break to help you prepare for the next one, and mark your calendar, set alarms, etc. so you remember to register the day it opens. work, study, take care of yourself, do whatever you need to do to feel positive about the upcoming semester rather than feeling hopeless and guilty, because that’s not going to help. maybe you could find some volunteer work to pass the time",
      "author": "aSweetMango",
      "created": 1636561557,
      "upvotes": 1,
      "replies": {}
    },
    "hk345s2": {
      "link": "/r/college/comments/qqxpip/forgot_to_register_for_next_semester/hk345s2/",
      "text": "Try to get on the waitlists.",
      "author": "GoldRequest",
      "created": 1636562473,
      "upvotes": 1,
      "replies": {}
    }
  }
}