{"sid": "in0gov", "link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/", "title:": "To those wondering what it is like to go to a university THAT HAS NOT SHUT DOWN", "text": "Let me start by saying  I have yet to get sick, but I have had to move locations the past month due to people around me becoming infected.\n\nFor sake of anonymity, I will not disclose my school directly. I will say I attend a college in Virginia that is currently getting hit hard with rona, and is a hot spot zone.  The most common thing I have seen people blame is that it’s people partying. Yes that is a factor but I will list all the things I have seen on campus.\n\n1) No mask enforcement, even though they market that they are mandated on campus.\n  You can walk on campus and  if people do not have masks on, they are wearing them incorrectly. I witnessed a girl with a mask below her nose ,sneeze and not cover her nose.\n\n2) Buildings do not enforce policies\n   I worked in a public area on campus and many  times students would overcrowd elevators, take off masks before they left the building, and come when they were sick. \n\n3) staff and professors did not follow procedures \nStudents are not the only one to blame. I would say that as many students that were not following procedures, staff and faculty were not either. On my first day back, a professor and student stood in-front of the library door talking less than 6 feet apart ( no masks on) and you literally had to go in between them to get into the building.\n\n4) The administration has their head in the sand\n While you notice everything wrong on campus you will continue to get  emails saying how great everything is. In a recent email , our president said that this outbreak was expected and it is coming to a head. They also said we have no evidence of community transmission on campus(blaming off campus students), even though positive COVID cases make up 3/4 of the county positive results.\n\n5) Not enough testing is being done\n Our university has a COVID dashboard and anyone with basic understanding of statistics will see how skewed the data is. They only tested kids coming from hot spots and just recently have held mass testing for willing individuals. They only update the information once a week. I was tested on a Friday and did not receive my results until that next Thursday, a day AFTER the university updated their weekly stats.(may just be a conspiracy I have).\n\n6) You can do everything right but it doesn’t matter if those around you aren’t.\nI live with a roommate who doesn’t take COVID seriously. They think because they are young and “ Never get sick”, they shouldn’t worry. I did everything right and because others don’t take it as seriously, you will be affected.\n\n7) Faculty are struggling \nProfessors are having a hard time teaching in this environment. I am very close with one of my professors and they relayed to me how stressful all this has been, especially being an older population and having vulnerable parents at home.\n\nAt this point I don’t know if we will shut down. I think it will take everyone overloading the isolation dorms or someone dying. The administration is full steam ahead...", "author": "Ghostiep00", "created": 1599309698, "retrieved": 1632802068, "over_18": false, "upvotes": 1206, "upvote_ratio": 0.97, "comments": {"g4886up": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g4886up/", "text": "I go to a small LAC in Massachusetts and they're taking things HELLA seriously. Everyone gets tested every other day with results coming back less than 24 hours. Everyone has to wear a mask everywhere except in our dorm rooms and eat or drinking. We've only had 3 cases so far amongst staff students and faculty and it was after people moved in. Our dining has been completely remodeled to a grab and go situation dispersed through our campus to reduce density. We have outside classrooms with nice tents used for classes and study time. The admin is taking reports of ppl seriously as there have been one or two people who were immediately sent home. Everyone has singles including the first years.", "author": "PugsAreForSquishies", "created": 1599398233, "upvotes": 1}, "g47mqcx": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g47mqcx/", "text": "99% of classes are online at my uni but campus amenities like libraries and dining halls are still open, albeit at a limited time. I currently live off campus about 15 minutes from my school and I honestly love it compared to staying at home where I couldn't focus on online classes and practically failed. And plus I can still take the bus to libraries and study like I did before. \n\nAs for mask, the busses here require it and make it mandatory. As do the libraries (covering nose as well) or else you can't enter. They limited the amount of chairs at each table so that there's only two to three chairs per table at a distance compared to four to six. And I've rarely seen anyone without a mask unless they were eating.", "author": "beaux-restes", "created": 1599376752, "upvotes": 2}, "g47ggx8": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g47ggx8/", "text": "im so happy i decided to take a break this year, colleges are shit show at the best of times, change my mind.", "author": "bestjakeisbest", "created": 1599370795, "upvotes": 1}, "g47f3ff": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g47f3ff/", "text": "Youre being overly dramatic for a virus thats “soooooo” bad that almost every single person who gets it doesnt even know they have it because there are no symptoms... grow a pair", "author": "yallpoopsticks", "created": 1599369593, "upvotes": -2}, "g47bxvn": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g47bxvn/", "text": "i also go to a school in virginia. i think they’ve been doing a decent job. however i have a problem with the school not notifying potential exposures to people. but for the most part i haven’t heard of any cases. some people got caught partying and ended up in a lot of trouble.", "author": "que-bella", "created": 1599366995, "upvotes": 2}, "g478fi4": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g478fi4/", "text": "My school is completely different in handling it. I live in NH, we only have 200 total cases in the whole state right now. But even so, when on campus outside or in we are required to wear masks, it's enforced by campus police. I haven't seen a single person without a mask or even one that's pulled down.\n\nEvery student and faculty member gets tested at least twice a week, classes have limited capacity, and there are no drinking fountains lol.\n\nI don't believe we've had any new cases at school since classes started, and all our buildings and campus businesses are open still.\n\nIt's crazy to hear about other states that are still really struggling. For me everything has gone back to normal pretty much except now everyone has masks on at all times.", "author": "Dirt077", "created": 1599364364, "upvotes": 1}, "g4781of": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g4781of/", "text": "I don’t see anything wrong with this. We should be moving to a controlled avalanche strategy, protecting professors and faculty and accommodating vulnerable students. Every college student who gets covid and doesn’t die is a good thing. We should be the ones who spread it to reach herd immunity so it’s not our parents and grandparents. Why universities aren’t realizing this is beyond me", "author": "McChickenFingers", "created": 1599364101, "upvotes": -2}, "g477ngm": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g477ngm/", "text": "We’ve had 11 students that lived on campus suspended because they were parting on campus. We don’t have any dashboard to track any possible cases (at least we haven’t been told). I’ve had to report food staff working with their masks on their chins because it gave me a ton of anxiety thinking about them infecting people. As for rules, we need to have our masks on (they don’t enforce them being over their noses though, stupid) and we can have one additional person per unit but only if they’re a resident on campus. I’m not expecting to be here all semester but I’m surprised we’ve been here this long...", "author": "cr1ss-b", "created": 1599363833, "upvotes": 1}, "g474ekq": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g474ekq/", "text": "I think my college had actually been doing good. We are on campus but besides from a few stories happening at one residence hall it’s been looking pretty good.", "author": "treetop96", "created": 1599361639, "upvotes": 1}, "g46zbtk": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46zbtk/", "text": "I go to one of the fairly bigger Kansas schools and we have had only 35ish cases on campus so far. All student athletes or connected to them. Masks in and outside of buildings. Only roommates in elevators. But my floor kinda bent it to floor mates. Because we’re all super close and we only hang around each other.           \nA lot of zoom classes. I barely go outside my dorm building, along with more of the students.          \nFrom what I have peeked from the Lobby Desk is that each Dorm Tower has a floor empty in case they need to isolate certain students, so they don’t have to drag them all around campus.           \nI feel like the issues might lie after Labor Day Weekend. We shall see.", "author": "TricksterSprials", "created": 1599358371, "upvotes": 1}, "g46x6g9": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46x6g9/", "text": "Ngl my hasn't shut down, although my roommates and I joke that campus is like Fallout 3.", "author": "olivegardengambler", "created": 1599357066, "upvotes": 1}, "g46wr2g": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46wr2g/", "text": "I’m in the same boat as you. I go to school in a very small town, and we’ve gone from having cases in the single digits to having over one thousand people in active quarantine, and the school so far has no intention to shut down.", "author": "I_like_Candles", "created": 1599356809, "upvotes": 1}, "g46wd3w": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46wd3w/", "text": "Really thankful my school is entirely online.", "author": "peachyypeachh", "created": 1599356570, "upvotes": 2}, "g46ux9v": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46ux9v/", "text": "As a former VCU student I wouldn't be surprised if they're a mess too...", "author": "fibropainonmybrain", "created": 1599355695, "upvotes": 2}, "g46udiz": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46udiz/", "text": "As a Virginia resident I'm sadly not surprised.", "author": "fibropainonmybrain", "created": 1599355380, "upvotes": 2}, "g46qjbu": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46qjbu/", "text": "To compare your college experience with mine:\n\nI just finished the 4th week of classes.\n\n1. I'm personally guilty of lowering my mask when no one is within 6 feet of me (especially when walking up/down stairs) because I find it hard to breathe in it and have started hyperventilating many times. But I put it back up during class or when people walk by me.\n\nOn the first day of school, I saw a lot of students not wearing masks outside, but everyone was wearing them inside.\n\nSince then, I've only seen 2 people not wear their masks. One was a student, and the other was my history professor who has always taken it off to teach. But really, other than that, everyone wears it, and wears it properly. (Just..uh, not me...\\*sweats\\*)\n\n2. I'm not even aware of elevator policies here, but I've only seen one person use the elevator so far this semester.\n\nAs for classroom policies, in some classes students are within 3 feet of each other instead of 6 feet apart.\n\n3. History professor doesn't wear mask when teaching. My other professors follow the procedures diligently.\n\n4. N/A?\n\n5. My college isn't testing anyone (as far as I know), which is stupid and sucks. I was under the impression everyone would be getting their temperature tested every time they entered any building. So much for that, lol\n\n6. Well, doing everything right does protect you much more than if you do everything wrong.\n\n7. It seems to be working out okay for my classes, honestly. I could be underestimating what my professors are going through, but I'm overall impressed/happy with how they're handling it.", "author": "SquigglyHamster", "created": 1599353252, "upvotes": 1}, "g46pikv": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46pikv/", "text": "There's a lot that unacceptable in there, but a dashboard that only updates once a week? That tells me there's a lack of leadership at many levels. A dashboard is a collaboration between your president's office, medical staff, I.T., and communications staff. As we've learned, week-old data is effectively useless; I hope daily data is at least shared with policy makers, but the point of a dashboard is to engage the whole community and encourage responsible decision making/hold yourself and others accountable.", "author": "dcgrey", "created": 1599352738, "upvotes": 1}, "g46mxb6": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46mxb6/", "text": "I go to a small university in Minnesota and most classes are in-person and are live streamed *and* recorded. It is fantastic. And people actually wear their masks and take reasonable measures. Only 10 cases so far.", "author": "Fritz___", "created": 1599351360, "upvotes": 2}, "g46lygr": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46lygr/", "text": "The schools need the money - they don’t care who goes down as long as they can Collect tuition/room and board. Colleges are a business and kids are the customers. \n\nContact your local newspaper to publicly Shame the administration for not cracking down. Take photos. Start posting to an anonymous blog. Post photos on the college’s reddit sub. \n\nDon’t just stand there - do something. \n\nYou are right to be worried - plenty of kids get sick and don’t fully recover for months. If you can’t walk 10 feet because you can’t breathe, you won’t be going to class and your tuition $$ are gone. No School will refund your $$ but they will say ...”We are so sorry .. get well soon ! Hope to see you and your tuition dollars back in January 😊” \n\nSorry this is happening at your school but northeastern university in Boston just expelled 22 students for oartying and not wearing masks. No refunds. Every newspaper and tv station is reporting the story. Hopefully it will scare every other kid on campus.. let’s hope your school does the same. \n\nGood luck-hoping you stay well !", "author": "SunnyDay27", "created": 1599350893, "upvotes": 2}, "g46in5q": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46in5q/", "text": "my college is also taking a bunch of precautions, like sanitation after every class, limited amount of students in class with the rest on zoom and staggered meet times, 10-15 reserved dorm rooms in each res-hall for infected students to quarantine if they can’t go home, masks required, a lot of classes/teachers have switched to online instruction, and many campus events accommodate distancing. I’ve been in session for a month and only 40 student cases have been reported, 5 faculty cases", "author": "tripsabby", "created": 1599349393, "upvotes": 2}, "g46hd9m": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46hd9m/", "text": "This sounds a lot like my school. Iowa state’s president said the same thing about covid but students made 3/4 of the cases in our small county", "author": "ty342", "created": 1599348770, "upvotes": 3}, "g46fo3e": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46fo3e/", "text": "I know exactly which school this is. Its another punch in the gut to know the school president’s ANNUAL salary is $775,000. They are just holding off to send people home, gotta wait for them tuition checks to clear.", "author": "Spar_K", "created": 1599347936, "upvotes": 3}, "g46ev3w": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46ev3w/", "text": "[deleted]", "author": null, "created": 1599347543, "upvotes": 6}, "g46eg9i": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46eg9i/", "text": "I go to your school!!", "author": "kaitlynbrinkley", "created": 1599347396, "upvotes": 3}, "g46ajd9": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g46ajd9/", "text": " [u/Ghostiep00](https://www.reddit.com/user/Ghostiep00/)  It sounds like you go to my purple school in VA! We had to take a daily health screening/COVID questionnaire on our phones. We were led to believe that the Confirmation we received from the questionnaire would be required to enter dining halls or academic buildings. But, there was literally ZERO enforcement on campus. Also, the school gave us 5 days to move out once the COVID cases shot up. People don't live only in VA, some of my friends are from upstate NY or VT", "author": "JEBERNARD", "created": 1599345377, "upvotes": 3}, "g469vxt": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g469vxt/", "text": "My university is the biggest hot spot in the world. And there has been little effort to change anythong.", "author": "plotdavis", "created": 1599345014, "upvotes": 4}, "g469udg": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g469udg/", "text": "I’m at a smallish (~3,000) LAC in the Midwest. We came back to campus with mandatory testing and 2-week campus wide quarantine upon arrival. We had a .08% rate in the first test round, and then they retested everybody after 2 weeks— .03% in that test round. Campus wide mask mandate, daily health checks, online courses (for quarantine period; some classes online all semester), and distancing measures seem to be helping? but there’s no enforcement. Campus police drive past large groups on the quad, and some people got expelled for attending an off-campus party prior to move-in. We can go off-campus now, and I’m counting the days until they ship us home. Combine all of that with a racist college president and emerging student protests, and it’s a time bomb waiting to go off.", "author": "ChromaticSynesthesia", "created": 1599344996, "upvotes": 3}, "g467xsh": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g467xsh/", "text": "I mean yea that’s most colleges, if the country itself couldn’t get it together then colleges definitely never will unless you do strict things like those military school which even they get some infections somehow", "author": "lil-dlope", "created": 1599344066, "upvotes": 2}, "g466ze4": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g466ze4/", "text": "I have one hybrid class where my professor is overly adamant about students attending class during the face-to-face segments. Had to attend face-to-face last week and the professor kept bitching about having to wear the mask and was like, \"do you guys mind if I take off the mask? I hate wearing these things\" and then just took it off anyways. If she saw someone walking past the classroom she would quickly grab her mask and put it on to avoid being caught. Seemed very childish and I didn't appreciate it. Just wear the fucking mask. Also had a student coughing a bunch right across from me so that's cool", "author": "unholymanserpent", "created": 1599343589, "upvotes": 2}, "g466tpk": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g466tpk/", "text": "A girl in my class died last year at the peak of covid. Our school has limited on-campus housing, so she lived only a mile away from campus in an apartment. We didn't know cause of death, and were instructed not to tell the students. There was no announcement made by the faculty.\n\nI don't think someone dying is going to change anything.", "author": "Duckduckgosling", "created": 1599343505, "upvotes": 2}, "g464bea": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g464bea/", "text": "My college is actually doing pretty well. Mandatory masks everywhere on campus besides your own room, no partying, only eating outside, testing every single student every week, you get the gist. Some classes in person, some online. We’re two weeks in with only like 3 positive cases so far, who are isolated on-campus in a special leper-colony dorm. Granted, we’re a small school (~4000 students) with a phat ass endowment, but so far I’m optimistic we make it through the semester!", "author": "sarcasticsnowleopard", "created": 1599342480, "upvotes": 2}, "g463zsf": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g463zsf/", "text": "Imma say Liberty University but that’s just a guess lul", "author": "ArchyRs", "created": 1599342328, "upvotes": 2}, "g463kl5": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g463kl5/", "text": "My college is taking it very seriously. It doesn't have dorms so luckily that's not even a worry. \n\nThe only classes allowed on campus are labs, studios, and a select few that really require hands on work. For those, you can only go in on one of your scheduled days and the other day is for the other half of the class.\n\nYou have to take a screening test before coming on campus and present a code at every door you enter which is scanned by a staff member behind a screen. Masks are required at all times. Elevators are one person only. \n\nIt only has about 7000 attendees this year and probably barely 2,000 that need to be on campus, so that accounts for how effective they've been so far. I just hope they don't get lenient as the semester goes on. Can't say as to how open they will be about cases though.", "author": null, "created": 1599342120, "upvotes": 3}, "g463hdb": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g463hdb/", "text": "vcu?", "author": null, "created": 1599342077, "upvotes": 3}, "g462t2d": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g462t2d/", "text": "Lmao I think we go to the same college", "author": "UnlooseNoose", "created": 1599341770, "upvotes": 2}, "g460lxi": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g460lxi/", "text": "This sounds a lot like my college, but I'm in NJ", "author": "wolfy321", "created": 1599340688, "upvotes": 2}, "g460jpm": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g460jpm/", "text": "I’m going to a small college and we have NOT been taking it seriously at all - yet we have nearly 0 positive cases on campus. It’s really weird, like living in a ‘rona free world. I wonder how long it’ll last, because it certainly won’t forever.", "author": null, "created": 1599340657, "upvotes": 2}, "g45zx28": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45zx28/", "text": "I’m glad that I go to a small, quiet, catholic college with a dry campus and a nonexistent party scene. In the past that stuff made it feel boring, but now it’s making stuff so much easier. \n\nI haven’t seen a single person with a mask off in a building aside from someone who is eating. We’ve had a single case of COVID so far, and they are a student residing off campus and the school did contact tracing and whatnot. The professors are really anal about sanitizing rooms and splitting their classes into multiple sections. I am pretty sure that my school will not need to close, but I feel really bad for other people because I know that things are probably much worse at a lot of other schools.", "author": "Ms_Digglesworth", "created": 1599340343, "upvotes": 2}, "g45zmco": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45zmco/", "text": "That’s rough.\nI feel like my school is taking it seriously but in the most difficult fashion possible. Buildings have Enter and Exit only doors, so you can end up walking around the entire thing before finding an “Enter” door.\nSame with stair cases.\nWhen I did have an in person class I think everyone was pretty good at masking appropriately, but I dropped that one about a week in because they were splitting the same lab time between groups.\n\n(Basically half the class would attend 1 hour of lab, then the other half would get the last hour of lab time. So it was nigh impossible to get lab work done in an hour and you’re still paying for 4 hours of lab and only getting 2 per week.)", "author": "ThrowawayCG0222", "created": 1599340205, "upvotes": 2}, "g45ysi1": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45ysi1/", "text": "This is my college experience rn exactly.", "author": null, "created": 1599339806, "upvotes": 2}, "g45xh0t": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45xh0t/", "text": "Yeah those are some huge read flags. I found that schools that have staff that enforce regulation and an administration that communicates consequences to it students, are doing better. My school has only had 13 cases since July and that's because they teamed up with a hospital to administer testing and safety precautions. Also the students and staff I see all wear masks and sanitize/wash their hands regularly.", "author": "icyhot09", "created": 1599339213, "upvotes": 2}, "g45xd96": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45xd96/", "text": "I feel ya: RIT is doing something similar. Just recently through wastewater testing one of the dorm building had to go under testing **than** they actually let the folks go while they are waiting for pending testings. Also: Our nearby school Syracuse University did the opposite and actually quarantined the dorm building while we didnt. RIT is a powder keg waiting to happen.", "author": "Dirkjerk", "created": 1599339168, "upvotes": 4}, "g45wo65": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45wo65/", "text": "I go to a college in VA and this is the same, nearly exact, scenario. I will never forgive this school for choosing money over lives. We have vulnerable staff that interact with students each day. People don't care about the rules. People are wearing masks wrong and not distancing. Lots of people are going off campus or coming  on campus (not following rules). \n\nCases are low, like your school, CAUSE PEOPLE ARE NOT BEING TESTED AND TESTING DATA IS SKEWED.\n\nI hope we survive this cause I know some students won't make it out alive (in sure others world wide have already died). Stay safe.\n\nEdit: they to that", "author": "NarrativeCurious", "created": 1599338863, "upvotes": 5}, "g45wnkf": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45wnkf/", "text": "i go to a school of 20,000 people including students and faculty. it’s our first week and we already have almost 200 people people in quarantine when we can only fit 300. People keeping going out and mostly everyone says they don’t feel safe here. we get tested twice a week but do not get our results until 5 days later which defeats the whole purpose imo. people keep saying covid doesn’t kill young people, but there are still so many kids on campus with health conditions and older staff members. and even though young people will probably survive, it’s no fun to be on a campus that is infected everywhere.", "author": "emilyy0829", "created": 1599338855, "upvotes": 2}, "g45vzkm": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45vzkm/", "text": "Aside from the community whiteboard on my floor that has \"Corona can lick my taint\" written on it in sharpie, everyone seems chill with our rules, and they take it seriously enough during classes with masks (which are 100% in-person). That said, we're all living on the same floor of 20 guys, so we're never masked up in our dorm floor and everyone in my hall is okay with it.", "author": "nolan13ify", "created": 1599338530, "upvotes": 7}, "g45vieb": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45vieb/", "text": "Why did anyone choose to go to college during this pandemic? Take a year off, work the best job you can get, and finish your degree next year", "author": "Kinkyregae", "created": 1599338299, "upvotes": -5}, "g45vgzn": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45vgzn/", "text": "[deleted]", "author": null, "created": 1599338280, "upvotes": -2}, "g45ulup": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45ulup/", "text": "Go Hokies! And if you think it’s bad here go ahead and look a county over in ole Radford, shits really fucked there.", "author": "KING_COVID", "created": 1599337854, "upvotes": 1}, "g45srnf": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45srnf/", "text": "My school is taking everything very seriously and so far the students have been good about social distancing and wearing masks. My biggest concern is that we’re in a big city with other colleges.", "author": "smalldesii", "created": 1599336938, "upvotes": 2}, "g45qrbh": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45qrbh/", "text": "I go to school in michigan and we have 261 cases, 2 of which are faculty and we've been on campus for 2 weeks! No plans to shut down.", "author": "voldemortismybitch", "created": 1599335956, "upvotes": 1}, "g45pw8c": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45pw8c/", "text": "My university has also been taking things super seriously. I never see people without a mask whether they were a student, staff, janitor, lawn worker whatever. If people get sick, they do zoom. We've had maybe 7 people total who have tested positive out of a couple thousand and we have a counter on the website anonymously saying how many. It's been great to see, especially since we're in an area full of anti maskers and people who think covid is fake.\n\nI'm pretty proud of my school!", "author": "stfuleslie221b", "created": 1599335525, "upvotes": 7}, "g45p2mt": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45p2mt/", "text": "As a coach at a school of 1200 we have had less than 30 cases. It's been taken super seriously and and everyone here wears their masks! It's awesome. Our town on the other hand doesnt take it super seriously unfortunately.", "author": "jgpdvs", "created": 1599335117, "upvotes": 4}, "g45lppw": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45lppw/", "text": "My school is not shutdown. 30,000 students.\n\nIt's mostly a commuter school, but a lot of people live on campus still. All in-person classes can be done online if you want. Classes are put in much bigger rooms than traditionally needed to facilitate social distancing. Mask rules are enforced, except when eating. \n\n0.18% positivity rate among residents. So there is a way to do this right.", "author": "MeGotShadowbanned", "created": 1599333470, "upvotes": 5}, "g45k0vi": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45k0vi/", "text": "The University of New Hampshire seems to be doing a good job on mask enforcement, luckily, but NH really isn't too big of a hot zone for the virus anyways, so there isn't too much spread.", "author": "SeantheProGamer", "created": 1599332631, "upvotes": 3}, "g45d5uy": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45d5uy/", "text": "My college is a bit different, as buildings are usually stationed with security that won’t admit people without a mask, and on hand to enforce it.\n\nHowever, like most, few people refuse to socially distance outside. Though surprisingly, it seems a vast majority of students on campus wear masks in most circumstances, including the sidewalks.\n\nI am honestly impressed.", "author": "CalmingVisionary", "created": 1599329274, "upvotes": 1}, "g45c1f5": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45c1f5/", "text": "I’ve had a completely opposite experience. I go to UT austin and ppl here are following the rules for the most part. The only issue seems to be the occasional party, but honestly it’s not that widespread.", "author": "Boomdigity102", "created": 1599328734, "upvotes": 15}, "g45bmut": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45bmut/", "text": "Lemme guess: Radford?", "author": "Isekai_Trash_uwu", "created": 1599328550, "upvotes": 6}, "g45bfhs": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g45bfhs/", "text": "My college is taking things seriously too. You can get fined for not wearing a mask. We are testing any student that is showing symptoms. And unlike some school my friends go to we update our dashboard daily", "author": "TheGraveWalker22", "created": 1599328450, "upvotes": 4}, "g459umm": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g459umm/", "text": "[deleted]", "author": null, "created": 1599327693, "upvotes": 4}, "g455diz": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g455diz/", "text": "Recently our president at my University announced it is the students responsibility to enforce the mask mandates.\n\nSo we have 454 cases on campus. The dormitory they halted from tearing down, due to mold, is where they are keeping sick students. It only holds 384.", "author": "im_not_really_batman", "created": 1599325429, "upvotes": 116}, "g454k4h": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g454k4h/", "text": "I'm guessing JMU?\n\nHowdy from GMU", "author": "simplplan540", "created": 1599324976, "upvotes": 71}, "g453zcv": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g453zcv/", "text": "This is when liberal arts schools have a huge advantage over larger universities. Mask enforcement, single person housing, and campus wide testing are much easier to implement.", "author": "T1013000", "created": 1599324655, "upvotes": 53}, "g452yfv": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g452yfv/", "text": "You happen to be at VT? Got tested Wednesday am with a fever feel better now but still no results. Might not hear until Tuesday. Meanwhile, not able to work to make the money to pay my rent... And they just don't seem to care about the insane delay. And cases are exponential rn lol", "author": "saved-by_grace", "created": 1599324080, "upvotes": 16}, "g451trq": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g451trq/", "text": "I go to a small college in MA and my school is taking things really seriously. They’ve also been super transparent with cases and protocol on campus. We’ve only had 4 cases so far, out of around 4,000 people (including faculty).", "author": "nonconformistnugget", "created": 1599323448, "upvotes": 208}, "g44y03i": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g44y03i/", "text": "So glad my school has regulations in place. I will be going to school in a couple weeks in Washington state. The classes are 90% online, but for sake of saving money I actually need to be on campus in housing. Masks are required, they will be doing their best to enforce this. They don't allow visitors from different dorms to visit other dorms. We will have a mandatory \"wellness survey\" daily. We will take a new covid test every 2-3 weeks on campus, provided by campus health. We also have to take a covid test 5-7 days before arriving to campus, and we will take one as a check-in on moving day. If someone tests positive, they have an entire dorm section dedicated as the quarantine area. I feel like a lot of school, especially in the southern area, didn't have proper regulations, and I am feeling okay with being safe on campus.", "author": "Cascades2Seattle", "created": 1599321629, "upvotes": 50}, "g44xleu": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g44xleu/", "text": "My college is taking it seriously. Only 2 building are open to enter, you can only come in if you have class or an appointment. With 80% of classes online its like a ghost town only DAT/GRA classes are in school. Elevators are 1 person per ride.  Everyone wears a mask. Classes are end 15min early to be cleaned. I feel with my college taking this seriously i am not worried that we won't have to shut down and or have 100% online classes.", "author": "B0ss0fTheW0rld", "created": 1599321453, "upvotes": 483}, "g44vy85": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g44vy85/", "text": "I go to a community college in Virginia so I have peers who most likely go to your school. In fact I already have an idea of which school you go to but Im not gonna say since you want privacy. They wear masks but they wont social distance. They stay within the same friend bubble but they continue life as if there was no pandemic. These are the trends I have been noticing from my peers on social media.", "author": "TheRapidTrailblazer", "created": 1599320662, "upvotes": 8}, "g44oook": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g44oook/", "text": "I'm currently going to another college (WPI) and I have to say my experiences are completely different!\n\n\\- Strict enforced wearing of masks at all times, unless we are eating.\n\n\\- Everyone on my floor is taking covid pretty seriously\n\n\\- Routine covid checks\n\n&#x200B;\n\nI don't know how safe I feel in this environment. Luckily with the power of modern technology I'm able to communicate with my whole family and elderly family members remotely.", "author": "Ritik_Rao", "created": 1599317585, "upvotes": 20}, "g44fnbq": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g44fnbq/", "text": "Sounds like my college", "author": "shortlava", "created": 1599313511, "upvotes": 3}, "g44f3ye": {"link": "/r/college/comments/in0gov/to_those_wondering_what_it_is_like_to_go_to_a/g44f3ye/", "text": "It's so weird to me people that are clearly educated can be so dumb and childish. \n\nBut then again the university president doesn't have to go outside much so he's isolated has much has possible. Just another case of money before lives.", "author": "thatguygxx", "created": 1599313262, "upvotes": 87}}}