{"sid": "ecsrz1", "link": "/r/college/comments/ecsrz1/grade_grubbing/", "title:": "\"Grade grubbing\"", "text": "Hey everyone\n\nSince I've joined reddit, I've noticed, students in the US seem to regularly ask for better grades than they've been awarded by their professors. That's kinda completely new to me as someone who studies in Germany. Only way anyone here ever gets a better grade is if they find points having been falsely deducted on an assignment.\n\nExtra credit is also not a thing at all\n\nSo I just wanted to ask, what students from other countries have experienced. Where is \"grade grubbing\" a thing and where is it completely unheard of?", "author": "grndbdpsthtl", "created": 1576759884, "retrieved": 1632802778, "over_18": false, "upvotes": 598, "upvote_ratio": 0.98, "comments": {"fbf5jao": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbf5jao/", "text": "As a student who has asked for a grade to get bumped up- my reasoning was that I am still a high schooler taking college classes for dual credit. I am working very hard to have near perfect grades to achieve a higher scholarship. I explained this to a teacher who’s class I had an 88 in and needed a 90 to get the gpa I needed. She thankfully was very helpful and revised a couple assignments. I know that this isn’t a situation I should expect in the future but it was very helpful.", "author": "jaydplant", "created": 1576802100, "upvotes": 1}, "fbf0zcp": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbf0zcp/", "text": "In the UK, lecturer. Our marking is moderated. If a student complains, we let them know that. They can appeal. If they do, a completely independent marker will assess. If its lower. They get lower. Very few chance it tbh.... Because their makes are actual reflections of their ability and effort.", "author": "macotom", "created": 1576798767, "upvotes": 1}, "fbevxub": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbevxub/", "text": "In the US, this is very common if you're really close to a grade. Students will often talk to there teachers or talk directly to the school if they really think they deserved a different grade. I was actually part of a committee for a short amount of time at my college that delt with these complaints. It consisted of two professors, two non professor faculty, and two students. We heard the professors side and the students side and then made a decision on if the students grade should be changed. Most of the time the professor won and the grade was kept. There was one case where a girl was 0.02 percent off of what the proffessor considered a C+, which was the grade she needed to have her work cover the cost of her class. The sylibus was not very specific on if this should be a C+ or C, as it only went to the tenth decimal place. This put her in this weird grey area. I was able to convince the faculty to give her a C+, but the vast majority of these cases are not so lucky.", "author": "archaeopteryx_attack", "created": 1576795224, "upvotes": 1}, "fbetc38": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbetc38/", "text": "I'm in the US and I've had professors say if anyone tries grade grubbing they'll actually consider lowering your grade, but I've also heard of professor in my uni giving into it.", "author": "HorsesFlyIntoBoxes", "created": 1576793454, "upvotes": 1}, "fbeqeit": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbeqeit/", "text": "You’d think they wouldn’t want someone failing outta school again 😬", "author": "FireDoggg", "created": 1576791523, "upvotes": 1}, "fbepkjv": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbepkjv/", "text": "Here in Serbia really depends faculty to faculty. Some are super strict and even if you point out the mistake, professors do nothing. At my faculty if you point it out they'll recalculate the points and see where in the range they stand. If it's an oral exam they'll ask if you're satisfied with the grade and if you're not you can aswer more questions on the spot or wait for another oportunity during the year. We dont get our exam papers back, but we can go to the professor or the assistant responsible for them and see them. I personally dont look at my exam papers unless im 100% sure i did smt right and didn't get the appropriate grade for it. Or if professor tells me to come and see, which is usuall for some subjects. Mostly where there is a lot of calculating done. Some professors are wacky and even if you aswerd correctly they wont give you points cause its not word for word how they \"thought\" it. So yeah, a lot of mismach and really depends on the faculty.", "author": "hey_its_me_12", "created": 1576790968, "upvotes": 2}, "fbenm7p": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbenm7p/", "text": "I'm from Slovenia and no, not a thing here. Here you have to go to an insight of your exam paper and then write to your profesor about your objection. It's not like they're gonna give you extra points just like that.", "author": "never_my_cabbages", "created": 1576789710, "upvotes": 2}, "fbenlja": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbenlja/", "text": "I know for my organic chemistry class, so much information is on each test and so many topics were learned independently that the class was curved at a pretty wild scale based on class performance. The top 10% of the class would receive an A, and 17 points below that cutoff would receive a B, 17 points below that would receive a C, and so on and so forth. The A’s in the class started at a 75% in the class. Even with the wild grading scale, 40% of the class failed both semesters.", "author": null, "created": 1576789698, "upvotes": 1}, "fbekhjr": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbekhjr/", "text": "I believe it’s almost entirely because of the 4.0 GPA system. Think of this situation. \n\nYou’re taking 4 equally weighted classes one semester and end up with following percentages after your final exams: 89.3, 89.5, 89.7, and 92.1.\n\nIf you don’t “grade grub” at all, and if you’re professors have some software that will just automatically assign the letter grades to students, you will end up with a 3.25/4.00 GPA. Whether or not gpa matters is its whole own topic, but the fact is there are some situations where IT DOES (grad school applications, top tier company intern programs, etc.). \n\nIf you ask your professors for a tiny bump, you could end up with a 4.00 GPA, which is a staggering difference, puts you on the schools deans list, and can give you FAR better prospects for grad school some intern programs", "author": "diegofinni", "created": 1576787704, "upvotes": 2}, "fbehcbo": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbehcbo/", "text": "As a US student, I never knew you could do that until I saw this sub. Seems a bit entitled unless you can come up with a good reason you deserve that grade bump 🤷‍♀️", "author": null, "created": 1576785703, "upvotes": 2}, "fbedzra": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbedzra/", "text": "I've never grade grubbed because it for sure feels wrong somehow... like getting something you didn't earn. However, I was failing a class once due to a really bad grade on a midterm. Looked like I just didn't understand the material. Even a 100 on the final would have still failed me. I talked to the prof and asked if there was some way I could at least pass (C-). He said if I showed him somehow that I understood the content by the end of the quarter, he might consider helping me. I needed some sort of motivation to even study for the final as it looked like I'd fail either way, so I took this and went with it. Studied my ass off and got a 97 on the final. Lo and behold, I passed the class with a C-. I was very grateful and definitely felt like I earned it.", "author": "AshingtonDC", "created": 1576783783, "upvotes": 2}, "fbedvdw": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbedvdw/", "text": "French student here, there's no way you can argue to get a better grade unless there is an error of calculation. Furthermore, where I study, sometimes teachers don't even give you your work after being graded", "author": "Damaskinox", "created": 1576783712, "upvotes": 1}, "fbebrfe": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbebrfe/", "text": "I study in the Netherlands, it's pretty much the same as in Germany here. For extra points, you can go to the exam inspections and see if points have been falsely deducted or added. But extra credit is not a thing here, as far as I know. But it is possible to go to professors' office hours and talk to them if you don't agree with your grade.", "author": "LemonMelissa", "created": 1576782540, "upvotes": 3}, "fbealp0": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbealp0/", "text": "I think it's stupid in all honesty but the only reason I'd ever ask is because I've seen lazy students get away with being lazy with \"grade grubbing\" so if I'm ever on a border grade I'd do the same to put myself on a level-playing field", "author": "tattooedships", "created": 1576781906, "upvotes": 0}, "fbe8d0q": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbe8d0q/", "text": "Australian national here! \n\nI'd agree with the German experience, at least for *local* students. International students who are studying in Aus obviously bring some habits from home with them, so they do try to \"grade-grub\" sometimes. \n\nIME, it always felt like a respect thing here. \n\nI respected my lecturers. I trusted that they:\n\n - knew the subject better than I did, \n\n - knew how to teach an undergraduate class better than I did,\n\n - knew how to assess learning in their class better than I did, and\n\n - would always do their best to be transparent and fair.\n\nIf they gave me a B then I deserved a B. Unless there was obviously some mistake in the grading, it wasn't our place to question what they gave us. \n\nBut these are the same lecturers who'd give you extensions just because you had a lot of other work to do and you asked for one, who never took attendance, and who had (and exercised) the freedom to set your grade to whatever they thought you earned, almost regardless of your marks. If everyone did uncharacteristically poorly on one exam they'd assume that they'd written a bad exam and either ignore the grade or scale us all up by whatever amount. Basically, they were all good blokes who wouldn't screw us over. \n\nI think in the US they prescribe *way* more rules at the start of term and that encourages people to find ways to \"bend\" those rules. In Aus, our syllabi are maybe 1-2 pages, with half a page just being a generic warning against plagiarism. Our \"rules\" are negotiable and changeable, and we had in-class votes quite a few times to change the weightings of sections or set the date for our exams. They won't screw us over and in return, we won't try to game the system too much.\n\n[Also helps that our final grades are properly final. You can't request a regrade of material beyond a week or so, and your grade can only change at the end with a formal regrade of your final, which is a properly formal process with independent markers and everything. The lecturer doesn't have the power to go in and change things at that point.]", "author": "NoxiousQuadrumvirate", "created": 1576780486, "upvotes": 8}, "fbe5b49": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbe5b49/", "text": "It’s funny someone said this. I felt like I was unfairly graded on a final paper this term, but after looking at it I realized it was not my best work (I literally typed it the morning of) instead of being upset at the teacher about my grade I emailed her my paper (the graduate assistant had graded it) and asked her if she could elaborate more on what I did incorrectly and so that I know for the future. \n\nI wasn’t asking for a better grade even though everyone said I should. I knew if I disputed it that I would probably get a higher grade so that the teacher wasn’t trashed, but everyone grades differently. \n\nShe emailed me back and actually agreed that it was unfairly graded and thanked me for coming at her in a professional way instead of begging for a better grade because my work my garbage (which in all honesty compared to my other papers it was). \n\nI was thankful she changed my grade, but if she hadn’t I still would have been fine with just feedback. \n\nI think a lot of US students feel entitled to certain grades because they feel like they did their best, but in college their best might not be up the professors standards, and if you don’t ask how you can improve you never will. I’ve heard a lot of students say “I pay for my teacher to be here so I’m in control” and that’s such a bad mindset because a lot of professors teach because they enjoy it, not to be treated like shit from entitled 18 year olds. Also a lot of professors have 10 year and can do whatever they want without risk of being fired. \n\nI think it’s wrong to ask a teacher to change a grade, ive asked teachers to round me up if I’m at a .5% but mostly just for passing reasons.", "author": "ClassyHotMess", "created": 1576778514, "upvotes": 1}, "fbe4yf2": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbe4yf2/", "text": "I actually was grade grubbing but professors made it clear to us that if they saw effort and we were at a 89 and needed an 90 they would give it to us or if we needed an A instead of an A- they would give it to us. Our end of semester prof evaluations come a month before finals.", "author": "Costcoboy", "created": 1576778291, "upvotes": 1}, "fbe4yec": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbe4yec/", "text": "I think part of the difference is that in Germany, I believe college is free. We end up paying a yearly salary (or more) in grants, loans and cold hard cash, all without any form of employment to pay the difference. In high school, it made sense that the grade you got was the grade you got. That's fair. Once you throw $50,000 a year into the equation, it's loses that fairness aspect. There will always be students that are unmotivated to succeed, but if you put effort into a course and can only manage a C-, a lot of that onus should be placed on the faculty, given that you're *paying them significant amounts of money* to teach the material. \n\nBasically, if you're a garbage teacher with vague guidelines and difficult material, then I'm gonna either expect a curve, or request additional points, because it isn't fair to me that you can piss away my investment because you can't teach. Rating professors does not reimburse me for lost funds. A grade boost will save my GPA though, so that's usually where we're at.", "author": "The_Southstrider", "created": 1576778291, "upvotes": 16}, "fbe4mie": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbe4mie/", "text": "I'm in the US and this pisses me the Hell off.  I just want to say to these people that no, you don't   \ndeserve extra credit or rounding if you didn't turn in half your assignments and failed 1 exam.  Maybe you should just work like the rest of us?  When I failed, I FAILED.  When I passed, I PASSED.  I was thankful when instructors would automatically round up or give out bonuses just because, but I'd never feel entitled to put on an act.  This is part of the reason why the US isn't churning out quality graduates at the rate of other countries.", "author": "xmarketladyx", "created": 1576778082, "upvotes": 3}, "fbe2xrl": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbe2xrl/", "text": "I'm from Belgium, so hi neighbour :)\n\nI'm a first-year so I can't say I'm entirely familiar with the etiquette and practices, but asking a better grade is something I've literally never heard of (outside of when it's obviously justified such as when an exam was graded wrongly). Even the practice of asking a professor to round up your grade is something I've only come across in American-dominated places like this.\n\nI don't really see why anyone would ask for a grade bump anyway - we don't have a system like GPA so a low but non-failing grade has very little impact on your studying career. And even if you fail, fairly recently they've introduced a system where you can \"tolerate\" certain subjects so they count as passed even when you have a failing grade (only if you have 9/20 or 8/20 though, any lower and you can't tolerate the course, but still).", "author": "Han_without_Genes", "created": 1576777026, "upvotes": 3}, "fbe2ekw": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbe2ekw/", "text": "The only time I have had a grade raise was if it’s like a 89.5 they will round up to a 90.", "author": "GoldenMushroom1995", "created": 1576776688, "upvotes": 1}, "fbe1oq6": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbe1oq6/", "text": "India- Totally was a thing in HS but it's not in college. We absolutely can't ask for anything. The only place where we maybe can get our marks increased is on our written test internals where they return our papers and only can be increased if we think that we were unfairly marked. Other than that no lol you gotta do with whatever you got.", "author": "mekhhhzz", "created": 1576776233, "upvotes": 2}, "fbe11og": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbe11og/", "text": "Im from the US and I have never done it, I think its unfair however it seems to be very common unfortunately. I have even heard stories of some girls crying to their professors so that they would round up their grade.", "author": null, "created": 1576775821, "upvotes": 2}, "fbe0kvg": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbe0kvg/", "text": "Doesn't really happen at all at my university afaik and I go to a pretty notable and large university in the US. Then again, maybe I just don't run in the circles that would do that. \n\nAt the same time, part of it is because of what's considered acceptable. If you have inflationary pressure, what's considered a good GPA at a school with deflation is still gonna look like shit and disadvantage you for the workplace, for scholarship considerations, etc. so schools have an incentive to grade leniently. If you go to UChicago or Pton, they might know about the deflationary pressures and be more lenient, but what if you aren't fortunate enough to go to one of those? From what I've heard about students in systems such as the French and German one (or the British one for that matter), the bounds of acceptability are also very different so while we might have \"higher scores,\" our idea of what's acceptable for scores is also more narrow and differentiation still happens. The British system in comparison for example if converted to GPA, generally converts along something like this:\n\n- First Class: 3.7-4.0 (which is an A- average to perfect A in the American system.) \n\n- Upper Second: 3.3-3.7 (which is a B+ average to an A- average)\n\n- Lower Second: 2.7-3.3 (which is a B- to B+)\n\nObviously, there are some disagreements but that's the general idea. However, under the American system, there's significant distinction between a 3.7 and a 4.0 and for certain careers such as IB, a 3.3 is considered too low and a significant disadvantage while a 3.7 is significantly higher than the minimum bar. Not only that, the British First is awarded for those who achieve a 70%+ at most schools which is just at first glance incredibly different from the American system which typically works on 93+ for an A, 90-93 for an A-, etc. Another difference is that the British system typically does not weight or determine grades in the same way as American schools, where you have a number of assignments, grades for participation and attendance, etc. \n\n\nAnd after all that? There's rampant grade inflation in British higher education. Roughly 30% of students were given a first in 2019 and as of 2015, 49% of students got a 2.1. While the US has had similar inflationary pressures, we can see that in 2013, the average GPA still hovered between a 3.1 or a 3.2 [here](http://www.gradeinflation.com/) which would be the equivalent to a 2.2 in the British system. \n\nSo maybe part of the reason you don't have the same grade grubbing is because the systems are entirely different as well would be my guess.", "author": "doneanddead", "created": 1576775520, "upvotes": 1}, "fbdys7d": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbdys7d/", "text": "Don't assume it's a \"regular\" thing across the US at all sorts of institutions. I've been teaching at a selective, private college for 20+ years and it's only happened a handful of times, usually from very bad students who are trying to avoid failing a course or raising a D to an C somehow. I've never raised a grade that wasn't earned.  (Though my syllabi all have a line that says \"The instructor reserves the right to *raise* final grades up to 1/2 grade to reflect extraordinary effort or improvement\" and I do sometimes exercise that right-- but never in response to a request.)\n\nIt's also rare with my colleagues, even untenured ones. But I also know it is widespread on other campuses, so it depends a lot on the school, major department, and who the school is enrolling.", "author": "SnowblindAlbino", "created": 1576774364, "upvotes": 17}, "fbdxntb": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbdxntb/", "text": "The only time I've asked a professor for special treatment on grading was because we had a group assignment with a very rigid rubric and 2/4 of the other people in my group never came to class or our meetings, and we were effectively a 3 person group on a project that most 5-person groups could barely finish in time.\n\nWe approached the prof after the 2 never showed to our first 2 meetings and she was insistent that we would have to work it out amongst ourselves (something something \"learn to work as a group\"). After we got a 60 on the project we went back to her and this time she caved in because one of the guys dropped out entirely and she was also unable to contact the other. Ended up with a 90 on the project by the end of the semester.\n\nBasically, I would never ask unless there was an error in grading, or the circumstances surrounding the assignment are less than fair. Some people will scrape by doing the bare minimum all semester and then beg for extra credit when they realize they might fail/barely pass... those people are cringey to me and I have no sympathy for their GPA.", "author": "ITaggie", "created": 1576773643, "upvotes": 1}, "fbdx98z": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbdx98z/", "text": "My professors will often re-examine a specific paper/assignment/test if your grade is close to the next letter grade and have good class participation. Basically my professors are willing to give some leeway if the student shows the work hard and are competent in the actual class. I think the reasoning is that if the student can answer the question in class unprompted but their essay wasn’t great maybe it was just the essay. The extra credit is often attending a event that contains content related to the class.", "author": "redwallchronicles", "created": 1576773387, "upvotes": 2}, "fbdwpzx": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbdwpzx/", "text": "Doesn't really happen much at my uni.", "author": "enclavedzn", "created": 1576773041, "upvotes": 2}, "fbdvpsc": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbdvpsc/", "text": "German university student here: \n\nI’ve actually observed it in my university too, although it always seems pretty justified. We always have the opportunity to meet with the professor after we receive the grade to an exam and although we aren’t allowed to keep the exam, we can read thorough it, add up all the points, see if that’s right, or argue about some wrongful grading. \n\nAnd sometimes students DO go to the professors at the end of the semester to bat their eyelashes and try for a better grade, or extra credit, like an extra essay of 20 pages. Sometimes the professor offers extra credit throughout the semester.\n\nThen again it might depend on the course of study.", "author": "S_pline", "created": 1576772404, "upvotes": 10}, "fbduqcb": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbduqcb/", "text": "Canadian here!\n\nThe only time I've ever heard of students \"grade grubbing\" is when they feel like they were marked unfairly or, like OP said, been falsely deducted on something. Grades can be kind of confusing here in Canada... I've gone to two different universities in different provinces and the grading scheme weren't the same. My current university is all about the CWA (Cumulative Weighted Average). Maybe that's why grade grubbing where I'm from isn't much of a thing, we're all too preoccupied with figuring out what our grades are equivalent to. XD", "author": "HPxGunshot", "created": 1576771770, "upvotes": 5}, "fbdpxz7": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbdpxz7/", "text": "The only time I've ever asked for a grade bump was this semester. We spent all semester doing individual work, I was performing A level for it all, except 1 assignment I had an 85. The final is a paper and presentation done in a group of 10. We got an 87.5 because one of the group members couldn't answer the questions she was asked, and the rest of us could but we're not allowed to. I emailed my professor asking for her reasoning on the grade so that we may improve for future classes we have with her. She instead reevaluated and gave us a 90. Here's where the grade grubbing comes in. I emailed back thanking her for reevaluating the final and asking if she would bump me up citing that I was 1 point from the A. I needed a 91 on the final to keep my A in the class. I asked on the grounds that I had been outperforming the final score on all assignments and that had it not been a group so large, or even a group at all, I would have supplied higher quality work. She gave me the A.", "author": "Quarentus", "created": 1576768635, "upvotes": 33}, "fbdl4q1": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbdl4q1/", "text": "I worked in several European countries, a couple Scandinavian ones and in Mexico.\n\nNo grade grubbing at all except in the UK and that fairly recently.\n\nAnd the outcome of this is that  (in my unscientific study), the institutions were actually more likely to allow for dispensations when they were legit and humane.\n\n\nDisclaimer - the sample is totally biased, small and could not possibly reflect any actual country as a whole.\n\nHowever,  the whole world is different there - primary and secondary schools are , on the whole , better. The illiteracy rate in say sweeden, for example is like 0. German \"high school\" students, for the most part, already speak fluently at least English and often another language as well, and are expect to be able to write well in at least 2 of them (German and English).  So the transition to college is not so hard, because you are more well prepared.", "author": "TheRightSideOfDumb", "created": 1576765219, "upvotes": 43}, "fbdktab": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbdktab/", "text": "I'm from the US and would literally never argue with a grade unless it seems there's some calculation error, like you say. I don't like the practice at all (as either a student or a professor myself)", "author": "goldenstardust", "created": 1576764979, "upvotes": 91}, "fbdgdzv": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbdgdzv/", "text": "Perspective from a US professor- in the US, grade inflation is very real and has a direct connection to labor conditions that result in more adjunct and contract faculty who are precariously employed. This means a lot of faculty are highly dependent on good teaching evaluations for their continued employment. So when students come grade grubbing, precariously employed faculty are more likely to give in out of fear that the student will trash them in their course evaluation.\n\nWith tenure track and tenured faculty, our jobs are more secure and our livelihoods are not as dependent on contract renewal, so we are less likely to inflate grades or give in to end of semester grade grubbing (though it still happens).\n\nIn the US, most students are unaware of the different types of faculty positions or any of the unethical labor practices that are rampant at US universities (such as widespread adunctification or having grad students teach for extremely low pay). People will beg for grades at the end of semester because some faculty do cave and bump grades, so from the student perspective- it seems very arbitrary and subjective. This is why people on here will say things like “can’t hurt to ask” or “it’s worth a shot”. \n\nPersonally, I only bump grades up if students are within .5% of the next letter grade and it is something I do for most students, it has nothing to do with the grade grubbing. Those requests are just annoying and reflect poorly on the student, in my opinion. Especially when it is someone who missed a lot of class, didn’t submit all assignments, didn’t take advantage of extra credit I offered, etc. A grade is something a student earns, not something I give them. \n\nSorry this is probably beyond what you were looking for, but the reasons for grade grubbing (and grade inflation) in the US are actually really complicated and students don’t usually understand how it is connected to difficult labor conditions for faculty.", "author": "ProfessorHomeBrew", "created": 1576761328, "upvotes": 471}, "fbdg86d": {"link": "/r/college/comments/ecsrz1/grade_grubbing/fbdg86d/", "text": "Just as a bit of context, I think a lot of this in the US is due to education being treated as a commercial product where students are the consumers and the school works for them.\n\nI would expect that in places with a more conventional approach to education this is far less of an issue.", "author": "bl1y", "created": 1576761180, "upvotes": 61}}}