{
  "sid": "qun9xf",
  "link": "/r/college/comments/qun9xf/should_i_be_worried/",
  "title:": "Should I be worried?",
  "text": "\n\nHey. So I had this assignment for a class. I thought it was due on a certain date and went to start doing it. It was actually due a week prior. So after freaking out for an hour I decided to get go work and I managed to finish it by the next day. I emailed my professor and let her know about the mixup and she said it was all good. So I uploaded it and all was good.\n\nThis class has an assignment every few weeks and they are the same just about a different topic. So when I was doing the second one I came to the realization that I did not cite sources on the first one that should have likely been cited. I cited the journal articles I used but I had also referred to job banks and company websites. At the time I didn’t even think to cite these since I typically just needed to refer to journal articles to complete assignments in the past. I guess the fact that I was really stressed didn’t help either. So I freaked out a bit more and then calmed myself down and decided to email my TA. So I did that and she said no worries and that I could just email them to her and then I did that.\n\nNow the thing is after this first assignment I have submitted 2 assignments after it. I received the marks back for both of these a few days after submitting and the marks were good. What worries me is it’s now been 3 weeks since I emailed my citations and the first assignment hasn’t been marked. I was thinking this was just since I was so late and that the TA would just make it when they have a chance. But I ended up submitting my 3rd assignment like a week late as well lol. I didn’t email the professor or TA and just submitted and was willing to take the late marks since I shouldn’t have been late. This assignment was marked a few days later. My first assignment hasn’t been marked yet. Now I thought I could just email my TA but the 4th assignment is also overdue which I haven’t submitted yet. I know I need to stop being late 😅. My mental health has honestly been really bad thus semester but I’m trying to get back on track. But anyways I obviously don’t want to email and ask when the first assignment will be marked when I’ve been taking so long to submit them.\n\nI’m just concerned that it hasn’t been marked yet. I’m not so much worried about the grade for it but because of me forgetting those citations and if they would accuse me of academic misconduct? I want to go to professional school so something like this could really ruin my career goals. I am usually very cautious about this stuff would of course not intentionally plagiarize. I do get very anxious about this kind of stuff and overthink it a lot. Do you guys think I am just overthinking this?",
  "author": "anxiousstudent999",
  "created": 1637001809,
  "updated": 1637181478,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {}
}