{"sid": "pw0x97", "link": "/r/college/comments/pw0x97/should_i_report_my_professor/", "title:": "Should I report my professor?", "text": "So in one of my classes the other day our teacher randomly brought up something that had nothing to do with literally anything. It had nothing to do with the class, it had nothing to do with our books, it didn't even have to do with the conversation we were having at the time. Randomly the professor says \"I need to tell you guys about my sister by the way, she is crazy\". She then continues to explain that her sister who did a lot of drugs in her early years randomly started to act crazy a month prior to when we were in class.\n\nShe then randomly brings the conversation over to Donald Trump. Saying that her sister voted for her and she then asks \"Did anyone here in this class vote for Trump?\" \"I just wanted to know\". Then a student says \"Yeah I want to know too, so we can all see ahead of time\". As I look around the classroom I can see a lot of people get uncomfortable. Black, whites, asians, hispanics, etc, literally everyone is uncomfortable. I did not vote for Trump, matter of fact I did not vote for anyone.\n\nBut this comment made me extremely uncomfortable because it was an attempt to divide the classroom, even if that wasn't her \"intent\". It made me uncomfortable also due to the fact that if anyone did raise their hand, they most definitely would have been shunned as the professor was steering the conversation towards that. Which obviously showed because another student brought up the same thing in a aggressive manner. IDK if I should report her or not but I feel like I should because it is unacceptable in a college classroom. I posted this some where else on Reddit but felt like I should post it here, so other college kids can give me a perspective.", "author": "pouringafour", "created": 1632685691, "retrieved": 1632945515, "over_18": false, "upvotes": 501, "upvote_ratio": 0.75, "comments": {"hehtdn8": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hehtdn8/", "text": "Getting political isn’t good.", "author": "BrosephMyth", "created": 1632763981, "upvotes": 1}, "hehs809": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hehs809/", "text": "Had a prof that ranted on about everything under the sun and called my sociology. It was a hell of a semester with him.", "author": "rebel_child12", "created": 1632763471, "upvotes": 1}, "hehniib": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hehniib/", "text": "Being a college professor, I would think that your professor wanted to start a conversation about these perspectives, not specifically shun the students. That being said, none of what your professor did was unethical. If it makes you uncomfortable in this way, I suppose you might discuss it with them, but college is not designed to make you comfortable. It's designed to make you think.", "author": "GrendelNightmares", "created": 1632761253, "upvotes": 1}, "hehh92k": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hehh92k/", "text": "Send the prof an email to address the situation. Send it from a throwaway if you’re not comfortable. No reason to escalate it to that point without hearing anything the professor has to say in reply.", "author": "AfterAmbition", "created": 1632758450, "upvotes": 1}, "hehh4i3": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hehh4i3/", "text": "Why don't you talk to your professor first? That should be step one. \n\nNote: It's okay for professor to talk about themselves and their opinions. They do have free speech, but forcing their students to believe the same and using discriminatory practices is where the line is, normally,  drawn. Personally, I think asking if anyone voted for Trump is unprofessional. But, you need to try to resolve this matter with your professor first before going up the chain of command. In fact, the school will, probably, tell you to go back and try talking this issue first.", "author": "peppyunicorn", "created": 1632758396, "upvotes": 1}, "hehg85a": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hehg85a/", "text": "Seems to me that they didn't do anything radically out of line, they're probably a weird person at the absolute worst. They might also have a point to this, depending on the class.", "author": "hhbrother01", "created": 1632758018, "upvotes": 2}, "hehfj0c": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hehfj0c/", "text": "Chances are, you report him and they do nothing about it. They’ll give him a warning. What will happen is he’ll know which class reported him and he may make the tests harder. \n\nMy view about professors is the same way people view customer service. The professor is always right (unless he does something wildly inappropriate that could cause him getting more than a slap on the wrist). I say don’t do anything about it and the next time he brings it again, then report it.", "author": "MsPrincessConsuela", "created": 1632757729, "upvotes": 2}, "hehbigc": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hehbigc/", "text": "Pretty often our professors go off the track.... But that usually breaks of the ice & kinda builds a rapport...... In your case if this happens pretty much often mist of the time... Better first confront your teacher in s small group directly & settle the road..", "author": "living_7hing", "created": 1632756044, "upvotes": 1}, "hehbdov": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hehbdov/", "text": "They used their privilege as a teacher and having the full attention of a class and did this. They should know better. My government teacher in high school said that they're not supposed to discuss or reveal their own political beliefs because it may affect the students because they're more easily influenced. It is not okay for a college professor to be doing this, absolutely unprofessional. Do report.", "author": "Nairinn", "created": 1632755989, "upvotes": 0}, "hehb3ur": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hehb3ur/", "text": "I once had a physics professor spend an entire 2 hour lecture talking about plane trails in the sky and that the CIA was putting drugs in the air to keep us under their control. I would’ve killed for the convo you had hahahahaha", "author": "LastingChamp", "created": 1632755875, "upvotes": 1}, "heh7g08": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heh7g08/", "text": "Yea instructors are not supposed to share their personal views in that way. So I’d say report", "author": "June_Sky", "created": 1632754316, "upvotes": 1}, "heh24cb": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heh24cb/", "text": "If you're uncomfortable you could let the Dean know, not necessarily report.", "author": "madelaine00x", "created": 1632751981, "upvotes": 1}, "hegz2m0": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hegz2m0/", "text": "I am liberal, but I absolutely cannot stand how overwhelmingly liberal college campuses are. Its expected for you to be liberal or you get the eye from people. My history teacher in one of the first classes was so incredibly opinionated and biased about the confederate statue removals it got me so annoyed. I want a teacher who plays devils advocate or is simply unbiased, not one that tries to groom (not sure if im misusing this word) me into a liberal! (Even if I already am one lol)", "author": "azzeeter", "created": 1632750584, "upvotes": 2}, "hegy8hu": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hegy8hu/", "text": "Yeah you should.", "author": "ClayDolfin", "created": 1632750190, "upvotes": 1}, "hegi1ne": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hegi1ne/", "text": "Oh no you were uncomfortable!? How terrible for you. \n\nBetter go run and tell a manager.", "author": "Kinkyregae", "created": 1632740820, "upvotes": 2}, "hegcn7h": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hegcn7h/", "text": "More importantly, why didn’t you vote?", "author": "diamondsam2", "created": 1632736310, "upvotes": 1}, "hegb4xw": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hegb4xw/", "text": "reporting someone for you being uncomfortable is not a way to go through life. have a conversation with your professor and voice your concerns. you'll have a much better chance at coming to an understanding rather than immediately trying to get her in trouble", "author": "nichard_rixon69", "created": 1632734809, "upvotes": 1}, "hegaxzv": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hegaxzv/", "text": "I would take it to the student directory. Only if you have a recording of it or proof. There could be retaliation if you don't have proof. \n\nI dont mind when teachers speak of their personal lives a bit. \n\nBut, when the teacher started asking for who everyone voted for showing disdain towards one specific party. Especially if the class was recorded or with cameras on everyone's face then that could lead to the teacher penitalizing students or failing them due to their political choice (which could be taken as a form of discrimination). \n\nThe teacher was trying to single people out and that behavior should be reported. Only and ONLY IF you have recorded proof. \n\nOtherwise, keep this in mind and record every zoom call or class with this teacher, save every email and make sure any type of conversation has a paper trail. \n\nTrying to call out a Teacher in college is usually treated like when you are in high school. You will be viewed as the child and they will take the teacher's word first.", "author": "burnerxburnerxdepres", "created": 1632734614, "upvotes": 1}, "heg87uo": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heg87uo/", "text": "i’d advice against it.. regardless of what anyone here on reddit thinks about the situation reporting it won’t go anywhere.\n\npersonal stories r common among all professors and she didn’t mention much about politics she didn’t even mention her alignment. if u do report her it won’t go anywhere and she will most likely be aware of the report and it could be uncomfortable for u", "author": "trackxdreams", "created": 1632731663, "upvotes": 1}, "heg7o3r": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heg7o3r/", "text": "Next time just ask her what relevance this has to the class so you know what to put in your notes. It's respectfully calling her out.", "author": "Savekennedy", "created": 1632730998, "upvotes": 1}, "heg7dx2": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heg7dx2/", "text": "I mean, isn’t that just how college is? There trying to bring up controversy to spark up an interesting conversation. (Also if the professor has reached tenure theres pretty much buttfuck nothing that can be done to them)", "author": "lochkal", "created": 1632730666, "upvotes": 2}, "heg78tp": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heg78tp/", "text": "I’ve had a lot of professors at my university bring up their hate for trump for no fucking reason like this is a computer science class, why the fuck are you bringing politics into this. Obviously it’s a highly liberal diverse campus not to mention in LA county but Jesus man nobody wants to hear it, just makes things awkward.", "author": "DynamicHunter", "created": 1632730497, "upvotes": 1}, "heg725n": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heg725n/", "text": "This is absolutely valid and I don't understand why the people of reddit are giving you hate lol. But then again, I can't be surprised. Half of these people aren't even in college haha they just join loads of subs to argue with people online. Only you know how you felt in that situation, so I'd say do what you think is best", "author": "Magenta-Bunny", "created": 1632730284, "upvotes": -2}, "heg70t1": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heg70t1/", "text": "Ur an idiot shut up", "author": "ajava8548", "created": 1632730240, "upvotes": 2}, "heg6zu4": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heg6zu4/", "text": "Chill and just bring popcorn next time.", "author": "GiuResta", "created": 1632730210, "upvotes": 3}, "heg4xas": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heg4xas/", "text": "Now you know that if you write your papers from a very liberal viewpoint, you will get an A.", "author": "ObjectiveAnalysis643", "created": 1632728089, "upvotes": 3}, "heg12ca": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heg12ca/", "text": "Judging from how you've posted this twice, I feel like you already know what you WANT to do, so regardless if its normal for a prof to have casual conversations with the class (it is), I'm going to give you a piece of advice that could help: you need to pick your battles. \n\nUnless you were seriously offended in a way that made you feel personally invalidated or threatened, or if what the professor did was directly against your school's guidelines, little would come of it, and it could significantly change the dynamic of the class. I'm not saying the professor would personally retaliate against you, but it seems as though the professor was simply trying to get to know the class better, and the kinds of professors that do this are usually the good ones (at least in my experience). It's better to save those reports for when a prof does something truly shitty and you're willing to fight for yourself.", "author": "IanthePraxis", "created": 1632724828, "upvotes": 1}, "heg0oo9": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heg0oo9/", "text": "If someone needs to be cautious of, it's the student that suddenly spit that shit out of nowhere and make people uncomfortable imo.", "author": "sakibaraki", "created": 1632724543, "upvotes": 1}, "hefzu4y": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefzu4y/", "text": "Stop being a party pooper? We all start ranting about shit.", "author": "ImportantGreen", "created": 1632723913, "upvotes": 1}, "hefzngp": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefzngp/", "text": "Book recommendation. Coddling of the American Mind", "author": "Tommy27", "created": 1632723765, "upvotes": 1}, "hefykyv": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefykyv/", "text": "I’ll be honest, you don’t really have a reportable offense, especially considering this is a singular incident. Did she harass trump supporters? No. I get where you are coming from, conversation was teetering towards something, but it didn’t become that. I’ll also add the first part about her sister is not a big deal at all, it’s not weird for profs to tell you about their life", "author": "Visible_Negotiation4", "created": 1632722986, "upvotes": 1}, "hefxpsn": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefxpsn/", "text": "Should probably tell your mom first", "author": "nejcr26", "created": 1632722370, "upvotes": 2}, "hefvv4o": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefvv4o/", "text": "This isnt high school anymore", "author": "VIPinCollege", "created": 1632721017, "upvotes": 23}, "hefuwag": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefuwag/", "text": "When Trump won in 2016, I had a professor cancel class plans the next day and we all just discussed our grievances/feelings about the election. She and a couple of people started to really get choked up during up. In college, instructors are sometimes more open about their lives/opinions. I find it helpful to connect with them.", "author": "emblebembles", "created": 1632720330, "upvotes": 18}, "heftx6u": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heftx6u/", "text": "This is college. Not high school. You need to grow up. If you were uncomfortable because the teacher asked if you supported a racist, sexist president then that’s your own fault. Not only is there nothing here to report legitimately on, but doing so will probably give the department a good laugh at your expense. \n\n“Tell me you’re a freshmen without telling me you’re a freshmen.”\n\nLastly, please think of all the people who have valid reasons to be uncomfortable on a campus.  Women, Hijabis, transgender people, among others. There’s no reason a question being asked to the class that you simply don’t need to participate in should cause such a “conflict” that you need council from a Reddit sub in whether or not the professor should be reported.", "author": "creamy-comrade", "created": 1632719632, "upvotes": 15}, "heftqwi": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heftqwi/", "text": "Tell me you’re a freshman without actually telling me you’re a freshman", "author": "arath2802", "created": 1632719508, "upvotes": 41}, "hefsi5j": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefsi5j/", "text": "Nothing wrong with what is being said. Sure she should’ve stayed off the topic of who voted for who but honestly I’ve heard crazier stuff from professors. It’s college and you have to deal with it", "author": "stardusttree", "created": 1632718644, "upvotes": 3}, "hefrlz2": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefrlz2/", "text": "First of all, y’all in the comment section need to stop being a-holes. We’re not here to pass judgement, we’re here to give advice. OP seems legitimately concerned, and as misguided as it may sound to some of you, you guys need to cool it down and stop forming assumptions based on the few words OP said to us. They’re young. They’re learning.\n\nOP, professors are usually recommended to steer clear of voicing their political opinions in classes (unless the class revolves around it, or they’re trying to steer a class discussion into something productive), but there are no official rules against it so you likely have no ground to stand on for reporting your professor. With the way you’ve explained it, I don’t think your professor had any malicious intent. It seriously just sounded like they were telling a story. Before you jump to conclusions, maybe have a private, respectful discussion with your professor. You can explain why it made you uncomfortable. They’re not likely to do anything about it because just like you, your professor is allowed to express their opinions. But remember, you don’t by any means need to disclose your political leaning in a classroom setting.\n\nAnd before the rest of you guys turn on me, I’m progressive as fuck and vote liberal in every single election.", "author": "WingsofRain", "created": 1632718030, "upvotes": 3}, "hefpb6k": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefpb6k/", "text": "this is one of the fakest stories i've read on reddit so far lol", "author": "jazzybulls234", "created": 1632716513, "upvotes": 10}, "hefpb0z": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefpb0z/", "text": "It happens, and those professors are EASY A's cause all you have to do is agree to whatever their beliefs are and boom, you pass. yeah, that was unprofessional, and there are moral and ethical lines I cross, but fuck it, take advantage of the fact. Sheep are easy to lead.", "author": "guy_with-thumbs", "created": 1632716510, "upvotes": -1}, "hefouas": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefouas/", "text": "Part of attending college-level classes involves feeling uncomfortable. Usually this happens as a result of the material and/or the discussions led by students, but you gave up your right to feel comfortable all the time when you started attending. See below.  \n\n\n>A university is a special place \\[...\\] not like the public square \\[...\\] not like your home. A university is a place that is created, so that people will explore ideas, and the magic of it is that, since we all suffer from confirmation bias, we all seek out evidence to confirm our pre-existing beliefs. A university is one of the few places where you can count on other people challenging you, looking for the evidence that you can't find. \\[...\\] we can’t work unless we know that if we say something people will challenge us” (Jonathan Haidt, 2019).", "author": "tspier", "created": 1632716217, "upvotes": 2}, "hefo1dm": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefo1dm/", "text": "This feels like such a weird and sus post. Anyone else get this vibe?\n\nAlso you have no leg to stand on for your questionable political views as someone who doesn’t vote.", "author": "deprimada", "created": 1632715712, "upvotes": 30}, "hefngyw": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefngyw/", "text": "If it was just about his crazy sister, it would be fairly normal. Even some light conversation about politics and their political opinions isn’t necessarily out of the norm. Basically calling out people regardless of your own political opinions does seem to cross some sort of line. It depends on you if you want to bring it up to someone, but depending on the university there may be no repercussions. Definitely think about the possible repercussions (and that the professor should have known about them when they said what they said) before you say anything.", "author": "desba3347", "created": 1632715360, "upvotes": 0}, "heflwxg": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heflwxg/", "text": "cry about it", "author": "Sea-Trip-124", "created": 1632714403, "upvotes": 5}, "hefluyv": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefluyv/", "text": "lmao the comments on this post are WILD it’s like watching people dig a grave for themselves and pretending it’s for someone else jesus christ.", "author": "snekhoe", "created": 1632714369, "upvotes": 1}, "hefl14x": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefl14x/", "text": "Lmao, Karen", "author": "anxiouscamper", "created": 1632713862, "upvotes": 3}, "hefiolx": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefiolx/", "text": "This is pretty normal for a university setting, professors try to challenge your thinking and expand your mind to how the world around you works. All my classes have a politically charged element of how we can make the world better. There’s nothing to report her for", "author": "Tiredwannabeartist_", "created": 1632712650, "upvotes": 13}, "hefi6m4": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefi6m4/", "text": "I would not. It’s good to be exposed to different perspectives especially in college. People will not always think like you and you must get used to it even if it makes you feel uncomfortable. That’s just the way the world is. You may even learn something even if you don’t agree with their point of view.", "author": "ShyCoconut0_0", "created": 1632712385, "upvotes": 26}, "hefhlzf": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefhlzf/", "text": "Tell me your a senstive little shit without telling me your  a sensitive little shit.", "author": "God_of_Cows", "created": 1632712114, "upvotes": 16}, "hefgjg5": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefgjg5/", "text": "Aww is the special snowflake upset?", "author": "jojoisland20", "created": 1632711590, "upvotes": 4}, "hefekdh": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefekdh/", "text": "I don’t think your teacher meant to divide you but rather wanted to start a conversation about diverse perspectives. But a good conversation is one where all ideas can be expressed. And a good mark of judgement is to be able to understand both extremes and make your decision after. I think reporting your teacher would be halting the expression of ideas *against your peers*. \n\n If you aren’t interested in discussing your political opinions, you don’t have to partake in the conversation or you can speak up and say you’d rather not talk about it. The conversation seems like it didn’t go anywhere and hardly anyone responded anyways so reporting would be unfounded and it will only become a reflection of you rather than your teacher.", "author": "shoelaceys7373", "created": 1632710599, "upvotes": 13}, "hefeemr": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefeemr/", "text": "Lmfao grow up", "author": "TiNyUzi", "created": 1632710512, "upvotes": 8}, "hefdhms": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefdhms/", "text": "I had a prof that once went on a 15 min rant about planes", "author": "FCHusky", "created": 1632709968, "upvotes": 272}, "hefcksy": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefcksy/", "text": "At the end of the day, you're paying for your classes so if you feel like your time is being wasted in a significant way, there's nobody to stop you from walking out and reporting what you feel like is a waste of your money. Your concerns could fall on deaf ears, but they will certainly not be heard if you don't voice them.", "author": "Soruth", "created": 1632709433, "upvotes": 5}, "hefc4uu": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefc4uu/", "text": "I think it’s whatever you feel comfortable with. You think you should because that’s makes you uncomfortable then yes do it. But if it’s something that you can just let it slide and forget about it then no. But like i said it’s up to you. I do agree that was a bad thing for her to do on her part extremely unprofessional. Idk if the teacher has don’t those sudden random out lashes but if not then maybe she just needed to let things get off her chest and maybe she was curious if she doesn’t if all the time then we have another problem.", "author": "Mythical_Bird05", "created": 1632709185, "upvotes": 1}, "hefc1up": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hefc1up/", "text": "I was going to say no but... you can report that you are concerned about her mental\nHealth. Without going into diagnostics which no one can do from your post... but if she brings in way off topics like that then yes that is a concern. Like if she said \"I had French fries today, did you have French fries today? Castro and trump want to steal my French fries!\" Then yes please report. If could be a number of things even minor strokes.  You can report it as a \"health\" concern.", "author": "jetclimb", "created": 1632709141, "upvotes": -5}, "hef8mdg": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hef8mdg/", "text": "*to the naysayers: if the Professor had gone on a rant about their nutty liberal relative and made it clear that they disparaged such people, and THEN asked “say, are any of you liberals??” You’d be livid. You’d call it what it is: thought suppression by someone in authority. \nTrump supporters will no longer feel free to discuss in that class without fear of ramifications from that Professor, such as tougher grading or an overall less positive environment. \nAnd I don’t say this simply out of some rosy-eyed ideal. No, it’s strategy. If people “clam up” with their ideas, it becomes ever more challenging to extricate those ideas and help the student examine them and find fallacies. In other words: you’ll never be able to help those students because they’ll never open up to you. Which means they’re more likely to hold onto their beliefs and remain unexamined. They’re more likely to feel victimized, which is a recipe for extremism (seriously, google it). Plus, it’s basic psych: the more practice someone has saying “yes” or “no” to something, the more likely they are to say “yes” or “no” in the future. So if they continuously say no to their ideas/beliefs being examined because they’re practiced in saying no and are practiced in having a sense of “victimization,” and if there’s external evidence supporting their sense of victimization 🤷‍♂️🤦‍♂️ stg this is college, at least act like you know how to use the information you supposedly learned. Though, based on the Professor side of Reddit and their complaints, it’s pretty clear a huge number of y’all are just getting rubber stamped through school. \n\n100% report that Professor, WITH the other students in the class. If you tell this story to people who’ve had this Professor and they report a similar encounter, ask them to sign a letter or something (groups of students are much more difficult to deal with than 1 or 2 pesky little buggers lol). \n\nNo one’s  freedom of thought and conscience should be pressured like that by those in authority/with power over them. That Professor is in a position of authority and is clearly engaging in a breach of ethics. Unacceptable. \n\nHowever, you won’t get much more than a class-level apology, if that. And that’s if the Professor wishes to be polite. UNLESS you’re in Trump land/the admin are trump friendly, in which case things are different.", "author": "axidentalaeronautic", "created": 1632707475, "upvotes": -9}, "hef7qu0": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hef7qu0/", "text": "This sounds like one of my professors… we literally don’t do anything in that class sometimes and she’s had at explaining stuff. I really get mad thinking I paid for this class and I’m not really learning anything.", "author": "PassiveAggres-Thighs", "created": 1632707068, "upvotes": 0}, "hef5iay": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hef5iay/", "text": "I understand how this would make u uncomfortable. I hate teachers who bring politics into the classroom. I had a racist professor that used to use his class and free time to talk down on African-American’s and Hispanics and Obama and BLM (Charles Negy, UCF. Google him.) & we all collectively finally got him fired last year. But that took YEARS to do. Hundreds of complaints and reports were ignored for YEARS. So. Trust me. Reporting her won’t do anything. They have rules and a system and she’s not breaking any rules by talking about Trump, sadly.\n\nNext time. Just let her know she’s steering off topic and what she’s talking about has no correlation to what she’s supposed to be teaching. That’s all.", "author": null, "created": 1632706044, "upvotes": -2}, "hef3bsw": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hef3bsw/", "text": "How do you all get this triggered by one Reddit post.", "author": "Unexpectedarthur", "created": 1632705043, "upvotes": 6}, "hef25uo": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hef25uo/", "text": "Professors are not actually supposed to go off on political rants in completely unrelated classes - political science courses, sure", "author": "heartfortakeawayyy", "created": 1632704507, "upvotes": 2}, "hef1x2l": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hef1x2l/", "text": "Did your class proceed to have a discussion or exercise relevant to politics?\n\nI find it hard to believe that a professor would randomly open that can of worm. Most of us try pretty hard to avoid that topic if our classes don't involve politics.", "author": "AcademicDifficulty", "created": 1632704394, "upvotes": 12}, "hef1gdp": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hef1gdp/", "text": "Yes she’s trying to single out students.", "author": "ORCA_OF_WALLST", "created": 1632704178, "upvotes": -10}, "hef0p1u": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hef0p1u/", "text": "Am I the only one who enjoys when professor start talking about their personal lives a little bit? Obviously I see why the political thing is wrong, but most of my professors are very I'm here to teach and that's it, especially being a stem student. I always feel the most comfortable in classes that has open professors who aren't afraid to let their guards down a little.", "author": "rollllllllll_", "created": 1632703829, "upvotes": 494}, "hef0e8c": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hef0e8c/", "text": "Please take online classes instead since minor situations like this bother you so much.", "author": "KeepHonkingImDeaf", "created": 1632703690, "upvotes": 31}, "hef03s0": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hef03s0/", "text": "Sounds like a drag", "author": "Nevertrumper2019", "created": 1632703549, "upvotes": -3}, "heeztpl": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heeztpl/", "text": "You can report this. It won't go anywhere, but if it'll make you feel better, you can.\n\nThe fact of the matter is, who someone voted for is not a protected status. This is the kind of stuff why people outside of university campuses keep referring to it as \"snowflake safe space,\" which I think is totally wrong and full of shit, but reactions like this are way out of proportion. \n\nTalk to her directly. Express your concerns. That will do a lot more good than reporting her.\n\n>I did not vote for Trump, matter of fact I did not vote for anyone.\n\nYou live in a democracy. Exercise your privilege of being able to vote, even if you spoil your ballet as a protest against the two-dimensional power operating to keep the United States a right-wing shithole.", "author": "purple_ombudsman", "created": 1632703417, "upvotes": 24}, "heexz5e": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heexz5e/", "text": "I love how if someone had been called the wrong pronoun everyone in the comments would’ve been upset but if people who are politically on the right are being attacked you’re being a “little bitch.” smh", "author": "Low_Paper483", "created": 1632702515, "upvotes": -12}, "heexpk5": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heexpk5/", "text": "I don't think you should report it. They're allowed to bring up politics. They're allowed to state their political opinions. There's nothing you can do. The school will shrug you off.", "author": "titlit_vv", "created": 1632702383, "upvotes": 41}, "heexbgl": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heexbgl/", "text": "[deleted]", "author": null, "created": 1632702190, "upvotes": -11}, "heewp4g": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heewp4g/", "text": "Report her for what? She didn’t do anything unethical or illegal. Uncomfortable or strange yes but nothing is reportable.", "author": "musickismagick", "created": 1632701893, "upvotes": 188}, "heew1u8": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heew1u8/", "text": "Welcome to college dude. You're not in high school anymore. You're an adult, And the topics covered in college are designed to challenge and expand people's horizons so you think about every viewpoint.\n\nGrow up dude", "author": "pygmypuffonacid", "created": 1632701580, "upvotes": 68}, "heew180": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heew180/", "text": "The only reason to report her would be because she wasted class time with unrelated topics, which are few. Idk maybe math could be? But other than that its just part of class conversation. I'd proudly would day that I did not vote for trump and would enjoy hearing other perspectives", "author": "NotaCowboy76", "created": 1632701571, "upvotes": 5}, "heevy0e": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heevy0e/", "text": "INB4\n\n\"HOW DARE U NOT VOTE FOR ANYONE, THIS IS YOUR FUTURE ON THE LINE I HOPE YOU FEEL ASHAMED OF YOIURSELF\"\n\njoke aside, it sounds like she was on a rant. It doesnt sound like an attempt to divide although you contradicted yourself that it was not intentional. (attempt implies intent)\n\nFeel free to report it, its doubtful that anything will come of it but do it. Prof needs to learn to stay on topic", "author": "nick256", "created": 1632701529, "upvotes": 2}, "heevn63": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heevn63/", "text": "I mean depending on the class this could be easily justified. Also even if it was a math class there is really nothing that would happen if you reported her. \n\nIf you feel that strongly about it, it would be best to send an email voicing your concerns to her. She factually did nothing wrong.", "author": "LPKKiller", "created": 1632701382, "upvotes": 35}, "heev4l6": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heev4l6/", "text": "Bruh 🤦🏼‍♂️ idk even know what to say, just grow up buddy.", "author": "humansaremeh", "created": 1632701130, "upvotes": 74}, "heeusru": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heeusru/", "text": "ITT: Redditors acting like the stereotypical assholes they're perceived to be. Sure, OP may be foolish but holy shit they're a god damn human being. The fuck is wrong with y'all?", "author": "ConsistentEstimator", "created": 1632700973, "upvotes": -6}, "heeur7w": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heeur7w/", "text": "[deleted]", "author": null, "created": 1632700952, "upvotes": 49}, "heeu9vk": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heeu9vk/", "text": "If the professor had asked if someone voted for Biden, y’all would already have your pitchforks out 😂", "author": "ThatOneBearPlan", "created": 1632700715, "upvotes": 7}, "heeu4vy": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heeu4vy/", "text": "Grow up the world will not cater to you lol", "author": "Puzzleheaded_Can_750", "created": 1632700646, "upvotes": 49}, "heeu3wt": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heeu3wt/", "text": "[removed]", "author": null, "created": 1632700634, "upvotes": 73}, "heetx0e": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heetx0e/", "text": "[removed]", "author": null, "created": 1632700538, "upvotes": 140}, "heetv40": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heetv40/", "text": "*oh no!* An adult challenged your preconceptions! You weren't coddled and now you want to tell a grown-up!!???!?!???", "author": "SamSeebourne", "created": 1632700512, "upvotes": 65}, "heetrlc": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heetrlc/", "text": "[removed]", "author": null, "created": 1632700464, "upvotes": 117}, "heetiji": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heetiji/", "text": "Knuckle up dude. Ain’t Hs. You sound a bit entitled", "author": "AidanTheAudiophile", "created": 1632700340, "upvotes": 39}, "heetb8j": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heetb8j/", "text": "get used to it buddy that's college . learn from the book and YouTube. class is a place where professors talk about themselves , boast , decompress , socialize , rant , vent etc. at least that's been my experience", "author": "aguafreska", "created": 1632700243, "upvotes": 10}, "heerl1j": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heerl1j/", "text": "Freshman moment", "author": "Apolace1999", "created": 1632699400, "upvotes": 148}, "heer15j": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heer15j/", "text": "Sounds fucking weird but I’m surprised that didn’t end badly.", "author": "Nofapdeity", "created": 1632699129, "upvotes": 8}, "heeqw2p": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heeqw2p/", "text": "My English teacher went off on a tangent about how crack & cocaine are racist devices the government uses to unfairly target minorities. I reported her to the dean and she's still employed, presumably still batshit crazy af.", "author": "Nighthawk68w", "created": 1632699059, "upvotes": -42}, "heeq7i5": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heeq7i5/", "text": "I just want to point out that speaking for others a lot in this thread lol. It’s fine if you were uncomfortable but you can’t assume the entire class was. Like this wouldn’t bother me personally, so it seems far fetched for you to say everyone was put off by her comment", "author": "LawfulnessFancy5450", "created": 1632698720, "upvotes": 222}, "heep3mw": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heep3mw/", "text": "Freshman lol", "author": "dopeboy-inacadillac", "created": 1632698188, "upvotes": 342}, "heek1i9": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heek1i9/", "text": "Yeah not very professional, but if it's a one-off thing I'd just let it slide. As long as it's not affecting your grades you don't really have much to gain by reporting it.", "author": "sleepy_scav", "created": 1632695795, "upvotes": 11}, "heegbpv": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heegbpv/", "text": "Why is your first reaction to report someone because you got uncomfortable?", "author": "UTaltacc", "created": 1632694091, "upvotes": 192}, "heef0yn": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heef0yn/", "text": "Its important to remember that you are in college now, not public high school.\n\nThe professor may be challenging the class to think by bringing up unpopular or controversial concepts.  That is perfectly acceptable and desirable in college.  Conversely, the professor might be some kind of crackpot who will go on endlessly about items unrelated to the class.  If this only happens on occasion, there is no problem.  If its a regular event, there is.\n\nIf this becomes so common that class material is not being taught, you have several options.  The first is to try to get the professor back on track.  You can raise your hand, apologize for changing the subject, but then tell her you need an explanation of something from the textbook.  If that fails, you can then go to the academic dean or department head.", "author": "taxref", "created": 1632693498, "upvotes": 450}, "heedmc8": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/heedmc8/", "text": "I am just curious: Why is your first instinct to report the professor to someone, rather than voice your concerns directly to her? I’m also curious what kind of class it was.", "author": "sighing_sage", "created": 1632692873, "upvotes": 273}, "hedxa0b": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hedxa0b/", "text": "perhaps email the department chair, emphasizing your concerns about it seeming like she was trying to divide the class. that’s not a healthy dynamic for any kind of classroom.", "author": "mickie_stardust", "created": 1632686015, "upvotes": -28}, "hedwueo": {"link": "/r/college/comments/pw0x97/should_i_report_my_professor/hedwueo/", "text": "There’s really nothing about what you’ve described that would be a violation of anything (although politics are a dangerous ground). Reporting this most likely wouldn’t go anywhere.", "author": "PhDapper", "created": 1632685843, "upvotes": 689}}}