{"sid": "pwmb41", "link": "/r/college/comments/pwmb41/this_school_offered_me_money_wait_what_is/", "title:": "“this school offered me money” wait what is happening ??", "text": "okay i’ve been hearing people say that this school offered them more money than this school, etc.  im genuinely confused by this??  is this through FAFSA or scholarships or grants? i genuinely don’t know! are schools offering people different amounts? and does the amount you get from FAFSA change based on the school?\n\ni would test appreciate some clarification with how this process works! ty 🙏🏼", "author": "witchplzzz", "created": 1632764578, "retrieved": 1632800185, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"hei99ee": {"link": "/r/college/comments/pwmb41/this_school_offered_me_money_wait_what_is/hei99ee/", "text": "Completing the FAFSA gives you access to federal student aid, which includes federal student loans as well as grants for low income students. \n\nThe information you provide via the FAFSA also tells colleges about your family's finances, such that the colleges that admit you may offer need-based financial aid in the form of scholarships or grants. Many colleges also offer merit scholarships to high achieving applicants, as a way to entice them into enrolling. \n\nColleges can offer applicants whatever mix of scholarships and grants they like, although they don't control what federal financial aid you qualify for.", "author": "clearwaterrev", "created": 1632771209, "upvotes": 3}, "hehy6yx": {"link": "/r/college/comments/pwmb41/this_school_offered_me_money_wait_what_is/hehy6yx/", "text": "They’re getting different merit scholarship offers from each school. They’re usually based on academics and each school has a different way of deciding who gets how much.", "author": "usuallyConflicted", "created": 1632766174, "upvotes": 2}, "hehxhan": {"link": "/r/college/comments/pwmb41/this_school_offered_me_money_wait_what_is/hehxhan/", "text": "So the FAFSA is set regardless of where you go (within certain parameters). However different schools offer additional money, some based on need, some based on merit. Eg: I didn't get much from FAFSA but I don't pay much for school because I got merit based scholarships. They usually automatically consider you for these things but it depends on the school, most want your fafsa sent to them, and some even have additionally forms to fill out.", "author": "Maleficent_Unit_7928", "created": 1632765843, "upvotes": 4}}}