{"sid": "pxtp1q", "link": "/r/college/comments/pxtp1q/is_switching_college_majors_a_good_idea/", "title:": "Is switching college majors a good idea", "text": "disclaimer: I posted this on r/Advice too, and i also remembered that this subreddit comunity would help to, so ye...\n\nI am overthinking this so much, and I have nowhere to turn, but this subreddit. I will try to keep it as short, but detailed as much as I possibly can. I am not an native english speaker so excuse me if I happen to have grammar or spelling errors.\n\nSo for little bit of backstory, last year, I enroled in Uni to hopefully one day major in psychology. My uni took so many students over addmision quota, and that resulted in \"purging\", aka.making conditions extra demanding and hard to the point where most will have no other choice but quit. (The uni is poorly funded by the country, so they take advantege of freshmans each year) From 120 people that rolled in (6o was maximum addmision quota) only 10 made it past the obsticles without having to transfer or repeat a year.\n\nI was one of those that was \"purged\". I am fully aware that the most of it is my own fault, and that I really did not gave my best to make it past second semester. I transfered to a second major at the end of first semester to study social work but I am finding myself hating it every day more and more.\n\nI still have passion for psychology and I wanted to transfer at a different uni, starting as freshamn again, at the end of the first year, but growing up with somewhat emotionally abusive and strict parents, I was afraid of their reaction and I never said anything which is my own fault. My parents are financing my education so you can understand the pressure of it all. I recently told them my possible plan, and even though they were not happy, they are somewhat willing to let me to transfer if I complete the second year as soon as possible with good grades. (it will prove to them that I am capable on transfering and that I am resposible and capable enough to finish college in general)\n\nOne of the reasons that I am afraid to transfer are the opinions of others around me and my own personal feelings of inadequacy for this major. I am so used to beign critisized and that made me fear opinions of people that are close to me. I am also very critical of myself on top of that, and I feel so immature and stupid for everything that happened. Also, my boyfriend and major portion of my friends are at this Uni, and I am kinda afraid to leave it all behind to prusue something that I don't even know if I am capable of succseding in.\n\nIs it a wise plan to transfer at the end of the second year (keep in mind, one more year would be required to get my Bachelors diploma if i stayed in this feild), or should I follow my gut and transfer to something that I loved and continue to love? Is it immoral to my parents who are financing this?\n\n&#x200B;\n\nEDIT: I made a mistake in the title, It supposed to say \"Is switching majors and UNI a good idea\"", "author": "ffstella", "created": 1632916115, "retrieved": 1632945362, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"her2qnx": {"link": "/r/college/comments/pxtp1q/is_switching_college_majors_a_good_idea/her2qnx/", "text": "I'm a parent. You don't owe abusive parents anything. Ask at the place you want to transfer to what financial supports are available if your parents refuse to continue supporting you. Also, your high school friends aren't necessarily your lifelong friends.", "author": "ResidentNo11", "created": 1632939221, "upvotes": 1}, "heptxby": {"link": "/r/college/comments/pxtp1q/is_switching_college_majors_a_good_idea/heptxby/", "text": "Do it if you aren't happy but definitely be aware of the cost", "author": "TragicalKingdom", "created": 1632920315, "upvotes": 2}}}