{
  "sid": "q6zwem",
  "link": "/r/college/comments/q6zwem/i_got_a_jury_duty_summons/",
  "title:": "I got a jury duty summons.",
  "text": "Anyone experience jury duty as a student? It is scheduled for a day in the week of Thanksgiving break, so it wouldn't interfere with school. I would love to be picked. However, I have a 1 year old daughter and a husband that works shifts opposite my school schedule, and we don't have childcare if I do get picked.\n\nHow was your experience with jury selection and/or jury duty as a student? I'm in Pennsylvania if it makes a difference.",
  "author": "Chrissy369",
  "created": 1634086389,
  "updated": 1634089589,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hgfg05x": {
      "link": "/r/college/comments/q6zwem/i_got_a_jury_duty_summons/hgfg05x/",
      "text": "Tell them you are a student and bring your student ID and your schedule especially if you have exams and assignments due.  The day(s) of jury selection are not the whole trial.  They will almost always let you reschedule for the summer.\n\nAlso make it clear that you dont have anyone to watch your daughter.",
      "author": "PersephoneIsNotHome",
      "created": 1634087918,
      "upvotes": 1,
      "replies": {}
    },
    "hgfhr9l": {
      "link": "/r/college/comments/q6zwem/i_got_a_jury_duty_summons/hgfhr9l/",
      "text": "You wait for hours then you fill out a paper, which they read to see if your a good fit for the trial. This is where you either say I’m a student and rather be study….just write things that show your uninterested or write that your excited and you might get selected",
      "author": "Anexcelworksheet",
      "created": 1634088727,
      "upvotes": 1,
      "replies": {}
    },
    "hgfi9mg": {
      "link": "/r/college/comments/q6zwem/i_got_a_jury_duty_summons/hgfi9mg/",
      "text": "I’m technically a resident of WV, but I live in PA over the summer. I had gotten summoned for the summer term, but told them I wasn’t currently in WV as I was living with my parents for a time. However, I said I was close enough to commute if I was needed. I also put that I would be in school for the end of the term. They had me email my schedule to them and I never heard anything back after that. I was shocked I didn’t get anything else, but also relieved I wouldn’t have to make the commute or worry about catching up in my classes. The lady I communicated over email with seemed pretty understanding and I got the feeling they were a little more lenient with college students. I could be wrong though. However, I was also a little excited to be picked.",
      "author": "WickedPuffin",
      "created": 1634088959,
      "upvotes": 1,
      "replies": {}
    }
  }
}