{"sid": "px5sho", "link": "/r/college/comments/px5sho/how_can_i_improve_my_study_habits/", "title:": "How can I improve my study habits?", "text": "Hi, I really love school but I am horrible at studying. I procrastinate, I’m lazy, I’m tired after I get off work and don’t have much energy, but I still want to do well in school. \n\nLike most of us, I work full time (from home) and have problems of my own, but I set designated times for me to study/do assignments. During study I don’t have electronics/entertainment nearby or on so I can focus, but often times I find myself eventually getting bored or uninterested.. or if I’ve been reviewing notes/going over things for an upcoming test, it feels like I’m burning myself out very quickly because I’m taking in too much information or I’m stressing myself out about doing well or whatever. I tell myself that this needs to happen because it’s important to me, but I don’t act like it.\n\nI want to break this habit because it’s holding me back from doing better than I know I actually can in school. Any tips would be greatly appreciated.", "author": "downvotesNkarma", "created": 1632833748, "retrieved": 1632945431, "over_18": false, "upvotes": 7, "upvote_ratio": 0.9, "comments": {"hele135": {"link": "/r/college/comments/px5sho/how_can_i_improve_my_study_habits/hele135/", "text": "Doesnt your school have a learning center or tutoring center?\n\nThe general tips are breaking stuff down into blocks with clear goals (so not : study chem for 3 hours ) but Y chapter and X vocab for 60 min, and 15 walking break.  Rewrite notes and make concept maps of that chapter 30 min)\n\nDo active learning\n\nTake a lighter load.  If you are working full time it is super hard to do this.  You are just plain tired all the time.\n\nYou really wont get done any faster if you fail or do poorly and the stress and issues will be with you a lot longer than the class", "author": "TheRightSideOfDumb", "created": 1632836323, "upvotes": 2}}}