{"sid": "c3ms61", "link": "/r/college/comments/c3ms61/optional_homelessness_for_college/", "title:": "Optional Homelessness for College?", "text": "I understand this idea may seem a bit dumb, but with college housing costs going as high as 10k-15k, I have been seriously considering living in my car through college. I figure if I've got a nice van with livable space to sleep and rest, I could use the hygienic facilities offered on campus for cleaning up and the libraries and classrooms to study and work.\n\n&#x200B;\n\nI apologize if this post seems rude to those who have struggled through homelessness in college. This is by no means a romanticization of the situation, only an option being considered due to financial constraints. \n\n&#x200B;\n\nHas anyone had experience with living in their car during college in the past, and would you consider the money saved worth the difficulty? Would colleges even allow students to live in their cars? And for context, I hope to be attending CalPoly SLO, transferring in from my local junior college. Thank you!", "author": "bruhnard", "created": 1561188451, "retrieved": 1632802906, "over_18": false, "upvotes": 565, "upvote_ratio": 0.98, "comments": {"ervfup3": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ervfup3/", "text": "Hey OP, I wouldn’t advise living in a car in SLO county, especially SLO. I lived here my whole life and the police are pretty devoted to stopping people from sleeping in their cars. There are a few places that people go to not get harassed but even those are risky.\n\nEven then, it’s difficult getting through college without a place to stay. School can be stressful enough trying to do well, and knowing you don’t really have a place to sleep at night is rough.", "author": "Evinreud", "created": 1561314705, "upvotes": 1}, "eru66tc": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/eru66tc/", "text": "SLO isn’t the best place to car camp unless you have a spot to stay. Maybe you could pay someone to park your van in their driveway or something, I’ve thought about doing that before. I go to Cal Poly and the parking in SLO is already pretty crowded especially on campus. The best thing would definitely be to set up a place to park and pay them like $100 a month for the privilege. Maybe you’ll even become friends and they will let you use the house during the day and just leave the van parked there all the time. Lmk if you have any questions about the area and I’ll see if I can help. \n\nEdit: Being an RA in PCV (apartment style housing on campus) is supposed to be very little work per week, and they comp your housing plus you get ~$1500 a quarter in on campus dining “plus dollars.”\n\nEdit 2: Also, you could get a double room in a house  off campus for around $400-500 a month if you searched pretty hard. Get on the facebook communities and start looking!", "author": "embler12", "created": 1561264512, "upvotes": 1}, "eru5588": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/eru5588/", "text": "I've see van life videos on youtube are they are very very interesting and the people look happy. Youtd have to do some research so that you can actually survive, especially if you have winter where you are. If you can find a way to make it work then I'm all for the idea.", "author": null, "created": 1561263416, "upvotes": 1}, "ertzju2": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertzju2/", "text": "r/vandwellers", "author": "TheTrueMuffinMan", "created": 1561258137, "upvotes": 1}, "ertvjxs": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertvjxs/", "text": "It becomes more off-putting when law enforcement harrasses you. Also after a long day, climbing back into your car isn't a very refreshing feeling and can eat at your mental health.", "author": "AmbientEngineer", "created": 1561254574, "upvotes": 1}, "erttguw": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/erttguw/", "text": "I've considered it, the biggest issue is most campuses won't sell resident parking passes to non residential students so you wouldn't be able to park overnight. As for comfort depending on the car they can be very comfortable.", "author": "myalwaysthrowaway", "created": 1561252774, "upvotes": 1}, "ertruqx": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertruqx/", "text": "Hey man, I've been homeless too.  (Twice) from living in a tent on an island, to later post-accident had to crash with friends.  As counter-intuitive as it sounds being homeless is MORE expensive than having a place for most people.  Think about it, free time in a shelter is well, free.  Free-time in a car costs money.  When you get sick you'll stay sick longer.  Heaven forbid you're female (chances of rape go up so much).  Need internet at 1 am for a project?  Tough.  Your grades will suffer.  You can't get a job without a physical address (dead serious).  You have to drive way out every night so people don't catch you then come way back into town.  Having a dirty car (or a car that dirty) quickly becomes suspicious, that's gas going up to 4X and car washes going up to 8X.  The car needs a little heater $, car needs a little a/c fan, $.  More batteries, more oil.  You need your car to be at 100% every day all day.  You can't do anything without that car.  This also means if your caught and your car is impounded you'll be on the streets.  Without the ability to do school work.  If you just get tickets twice a month for car camping then you've basically paid enough to live on campus.  This isn't even counting food!  Making a salad when you have a counter top and a fridge is a fraction of the cost of pre-paid salads.  That goes into the \"cost of living\" they give you isn't for just a place, it's also food.", "author": "squeaktoy_la", "created": 1561251336, "upvotes": 1}, "ertrn78": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertrn78/", "text": "Yes this is a doable option. I have been living this way for a little over a year. \n\nHere's the basic shape of it for me:\n\nAfter minimizing my possessions they went into a rented storage unit. Got a PO box and made arrangements with a home-owning \nfriend so it doesn't look like I have a gap in my housing history.\n\nThen I bought a camper shell with tinted windows for my pickup, insulated it and made a somewhat comfortable bed. The only time I'm back there is when I'm sleeping. The rest of the time I'm living my life pretty much as usual.\n\nI work two part time jobs, go to school full time, and volunteer with several organizations so my schedule is fairly structured which helps  me feel more houseless than homeless. \n\nTuition gets me access to all kinds of perks like a rec center membership for maintaining hygiene and physical health; private restrooms so I have a place to cut my hair and toenails; a box of fresh food once a week; WiFi; and a full calendar of open activities.   \n\nIt was difficult calibrating to the lifestyle at first but the freedom from rent and landlords alone makes it worth it for me to continue doing this for at least another year or two. You'll have more money to spend on experiences when you aren't paying someone else's mortgage or trying to accumulate more possessions. \n\nThere are drawbacks, of course\n\n* You'll always need a bathroom plan\n* It gets hot\n* It gets cold\n* People in your life may not understand\n* Always rotating between spots to stay stealth\n* Changes your dating pool\n* Psychological stress from limited sanctuary\n\nTL;DR Vehicle dwelling is a viable option for surviving college/late stage capitalism.", "author": "jawkneecache", "created": 1561251154, "upvotes": 1}, "ertqyy9": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertqyy9/", "text": "NowThis did a report on kids living in their cars at Humboldt University. \n\n[report on homeless students at Humboldt ](https://youtu.be/ck-89phIXsM)", "author": "2lhasas", "created": 1561250565, "upvotes": 1}, "ertqxar": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertqxar/", "text": "Tough call, could be a pretty rough go. Find safe parking is a big issue. If you spend a modest amount of money pimping out your van with space to comfortably eat, sleep, and use the computer, then it might save you a lot of money! Be prepared for some harsh realities though. Best of luck, and please update us on your decision and if you decide to live in your van. Some people convert their vans into really nice campers.", "author": "jburkek", "created": 1561250523, "upvotes": 1}, "ertmtj3": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertmtj3/", "text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/aboringdystopia] [Optional Homelessness for College?](https://www.reddit.com/r/ABoringDystopia/comments/c3xj5c/optional_homelessness_for_college/)\n\n- [/r/lostgeneration] [It's heartbreaking this idea even has to be discussed](https://www.reddit.com/r/lostgeneration/comments/c3wdu3/its_heartbreaking_this_idea_even_has_to_be/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "author": "TotesMessenger", "created": 1561246994, "upvotes": 1}, "ertlw6x": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertlw6x/", "text": "That’s a terrible idea and will impact you negatively in so many ways.\n\nLook into renting a place off campus with some roommates. I’m not sure what the rent is like in your area, but it’s most likely cheaper than the dorms. \n\nLook into different loan and scholarship opportunities. Talk to someone at your school’s financial aid office, they can help. Also, look into getting a job to off set the cost of college.", "author": "maevexo", "created": 1561246210, "upvotes": 1}, "erthczf": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/erthczf/", "text": "Its been done, it isnt fun. Id say if your school has rentable storage space thatll go a long way to making this ok.", "author": "GettingPhysicl", "created": 1561242422, "upvotes": 1}, "ertgv3o": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertgv3o/", "text": "You will not have a healthy or safe living situation and this will definitely affect your performance in school.\n\nI've been homeless and lived in my car. If you're not up all night from fear of your car being broken into because you had to park it somewhere secluded or a police officer knocking on your window telling you to move it along, you'll be kept up from the discomfort of sleeping in your car and the heat or cold.\n\nDon't do it.", "author": "peregrin5", "created": 1561242014, "upvotes": 1}, "ertc8m7": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertc8m7/", "text": "/r/vandwellers", "author": null, "created": 1561238334, "upvotes": 4}, "ertbw3y": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertbw3y/", "text": "This is seemingly depressing as achieving the American dream is no longer reachable.", "author": "SilentJon69", "created": 1561238053, "upvotes": 2}, "ertbo0a": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ertbo0a/", "text": "Sometimes college student associations offer subsidies for low income students for groceries or rent. Does your school have that option?", "author": "squatterbee", "created": 1561237878, "upvotes": 1}, "ert9x9m": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ert9x9m/", "text": "You'd just need a little solar panel for a lamp and charging your smartphone. Colleges provide decent bandwidth, so WiFi is covered. It's really not that bad of an idea.", "author": "Smelly_Nigger_", "created": 1561236500, "upvotes": 1}, "ert9ody": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ert9ody/", "text": "A lot of people do this actually. Head over to r/vanlife to see people living like that.", "author": "TheCicc", "created": 1561236306, "upvotes": 1}, "ert3840": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ert3840/", "text": "I remember seeing a post about it before, and it can be done. Basically, the guy spent most of his time in the library for studying and wifi. He used the campus gym for showering and the got his laundry done at the dorms. I wouldn't say it's ideal, but I guess if you are/want to be the type of person that can nap in a random corner to get your sleep hours, this could be an option. If you can find things to pad out your day like exercising and campus activities, I wouldn't see any reason why not.", "author": "Mesahusa", "created": 1561231221, "upvotes": 1}, "erszssn": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/erszssn/", "text": "If you want more information on how to safely live in a van check r/vandwellers", "author": "maddiejane7", "created": 1561228554, "upvotes": 1}, "ersz1wu": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersz1wu/", "text": "If homelessness is just an option, and not something you are being forced into, don't do it. There are much greater costs to homelessness that don't have to do with financial reasons. I'm sure you're smart enough to look up all the negative affects of homelessness on individuals. If it's really an option, then just take the loans, work a job, try and mitigate the cost of housing, but don't forego it.", "author": null, "created": 1561227978, "upvotes": 1}, "ersy66c": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersy66c/", "text": "Slo is pretty strict about parking around the college you have to get permits to prove that you live there to park on the streets. Maybe you could find someone on the housing fb page who is renting a house who could let you park in front of their house for a small fee so you’d have a home base to go back to. The rec center has nice facilities so showering there is definitely doable.", "author": "not_mrbrightside", "created": 1561227306, "upvotes": 2}, "ersxfab": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersxfab/", "text": "I guess Im lucky my one bedroom apt with washer and dryer in the unit is 650 per month.", "author": null, "created": 1561226736, "upvotes": 1}, "ersx6y3": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersx6y3/", "text": "Jesus christ. The fact that people even have to consider this as an option shows that there is a huge problem here. If you must do it, I don't see a problem. It won't be fun, but do what you have to do. Good luck.", "author": "TheNinjaTurkey", "created": 1561226561, "upvotes": 3}, "ersvwtm": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersvwtm/", "text": "I haven't lived in my car during college but I've lived in a car while attending high school a decade ago.\n\nI do not recommend it. Laws have gotten stricter and people are more wary of transients (which they will consider you). You will have zero peace of mind. This isn't anywhere near the same as living with a room mate. You will have people fucking with your vehicle (especially if you aren't very stealth) and you'll have the cops called on you. Even if you are stealth, people will notice a pattern and call the cops.\n\nCars have shit insulation, so you're looking at modifying your vehicle so that it isn't freezing in the winter and scorching in the summer. Unless you've got a luxury car, you don't have much sound dampening. Every twig that falls on the car, every rain drop, every dog bark, and raccoon crawling on the car is going to sound like it's coming from inside the car.\n\nWhat are your plans for meals? If you're going to have a fridge you'll need to set up some way to power it without killing your car battery. So, you're looking at solar (expensive, will get fucked with, not stealth if there are ANY multi-story buildings) or you're running a generator (noisy, expensive, not stealth). If you're not going to have a fridge are you doing runs to fast food / cafeteria / grocery store daily? That gas adds up, especially in a van that likely gets 15mpg with gas at $4/gallon.\n\nLooking at Craigslist, there's rooms for rent starting at $550/mo including utilities if you want to share a room, $650/mo including utilities if you want a private room. Are you really going to save THAT much money living in a van?", "author": "sunsmoon", "created": 1561225593, "upvotes": 1}, "ersvg0r": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersvg0r/", "text": "https://www.cracked.com/personal-experiences-1246-7-things-no-one-tells-you-about-being-homeless.html", "author": "turboshot49cents", "created": 1561225246, "upvotes": 3}, "ersuho5": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersuho5/", "text": "Hello! I actually just graduated from Cal Poly SLO and ive had a couple of friends who were homeless. Unfortunately in SLO it is illegal to sleep in your car overnight. But I do know people who would sleep in the 24 hr room of the library (if it's not under construction next year) and shower in the gym. But please don't do this unless you absolutely have to. There's a program called Cal Poly Cares that you can apply to and they can either give you extra funding for housing or set you up in an extra dorm space on campus. Also if you live with roommates it's totally possible to spend less than 10k on housing. I spent around 7k a year! It's also very easy to find a job on campus to help cover living costs. Please feel free to reach out if you want more information about on campus resources.", "author": "W0nderlandz", "created": 1561224534, "upvotes": 20}, "ersu70m": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersu70m/", "text": "Not ideal, but it can work. I lived in my truck for a few months during high school. (Folks kicked me out at 16 for being an atheist) Just find a campground to park in.\n\nI've worked with people who've done this on a more long term basis. Guy bought a camper trailer for $3000 and paid 30/month to park it at a nearby campground with water/electrical connection.\n\nCollege has no say in where you live. \n\nIf you are just using it as a place to sleep, it's fine. Spend the rest of your time at campus facilities (library, gym, etc).  \n\nAs far as money goes, the college dorms are always going to be a rip-off. Far cheaper to find 1-3 other students and rent out a house. Plus you get more space and can decide who you live with.", "author": "Inactive_Account", "created": 1561224311, "upvotes": 1}, "erstwqq": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/erstwqq/", "text": "You should look at housing options outside of campus. Waaayyy more cheaper. Look for affordable apartments nearby. Or even consider looking for houses and families that are renting out a room. There are always ads posted throughout my city LA of families renting an unoccupied room in their house for $400-$500 per month with all bills included. I never recommend college dorming to anyone. Ridiculously overpriced.", "author": "gonebonkerz", "created": 1561224096, "upvotes": 1}, "ersttg5": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersttg5/", "text": "you should look into vanlife. converting a sprinter van or something along those lines, into a tiny 60 sq. ft. home on wheels. theres a vanlife subreddit. vanlife is actually something i wanna do my junior year.", "author": "headyslabs", "created": 1561224028, "upvotes": 1}, "erstgud": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/erstgud/", "text": "Go on the cal poly slo housing Facebook page. You can find an apartment to share with someone (a double room most likely) and it might be less than $800 a month. The further the apartment/house the cheaper. You would just need to get a parking pass and drive to campus. The rules in San Luis against this are strict and you will definitely not want to do this.", "author": "macncheese323", "created": 1561223763, "upvotes": 1}, "erst4x8": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/erst4x8/", "text": "Unrelated, I just wanted to say fuck SLO, for totally unrelated reasons to anything in this thread", "author": "TrekkiMonstr", "created": 1561223498, "upvotes": -1}, "erspx10": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/erspx10/", "text": "/r/vandwellers", "author": "TexVikbs", "created": 1561221051, "upvotes": 1}, "ersphli": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersphli/", "text": "Is there off campus housing? I know housing at my college is crazy expensive, so most students live off campus at close rentals/apartments", "author": "Realistic_Pass", "created": 1561220717, "upvotes": 1}, "ersox45": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersox45/", "text": "I mean, unless there are any rules for the school or your area preventing you from doing that I guess it's an option. Personally I would not want the added stress of being homeless on top of school if it could be avoided though.\n\nHave you looked into maybe renting a home or apartment in the area? In my experience, if you don't have financial aid covering a decent amount of your housing, then the most affordable option is to find a cheap house our apartment and find roommates to split the cost between a few people.", "author": "LordMudkip", "created": 1561220266, "upvotes": 1}, "ersolz1": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersolz1/", "text": "/r/aboringdystopia", "author": "blaizedm", "created": 1561220021, "upvotes": 5}, "erslojb": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/erslojb/", "text": "Parking is gonna be pretty expensive (2018-2019 is 630$ per year).\n\nI know that is a drop in the ocean in comparison to housing costs (I'm gonna be shelling out over 9k per year- I'm attending SLO in the fall) but I think you will find that local/state laws prevent you from doing this. Additionally, while Walmart seems like a good option, none of the Walmarts near SLO allow it.\n\nIf it's possible, I would advise trying to live on campus in the Cerro Vista apartments/ other transfer housing. I know it's going to cost a hell of a lot more, but you'll have the social environment, the campus police if anything goes wrong and the Cerro Vista apartments are really nice. It'll be better than constantly getting slapped with overnight parking tickets. \n\nLastly: there is a city ordinance in SLO that bans you from parking in the same place for more than 72 hours. After that you need to move 500 feet.", "author": "elliepeachie", "created": 1561217689, "upvotes": 1}, "ersliln": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersliln/", "text": "Definitely talk to financial aid, but also keep an eye on  AB-302 in California's legislator. It is a bill that would allow Community College Students to sleep in their cars in school parking lots. Cuesta is right down the street from Cal Poly.", "author": "never_be_boring", "created": 1561217557, "upvotes": 3}, "ersjrrj": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersjrrj/", "text": "I’m in the same boat as well. My only issue is that I go to school in Vegas, where homelessness murder and crime rate is very high. I’m not looking to get shot or ambushed while sleeping in my car. But money is tight. Idk.", "author": "curiousoap", "created": 1561216121, "upvotes": 3}, "ersjfve": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersjfve/", "text": "Noooooooooooooooo please don't do this. I did this for ONE night during a day trip that I wanted to save money on. Worst idea ever. Cars get hot at night and I never felt safe. Could write all day about how terrible it was but no, don't.", "author": null, "created": 1561215848, "upvotes": 21}, "ershqn5": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ershqn5/", "text": "God, this is country is a shitshow. No one should ever have to seriously consider something like this.", "author": "skincaretrash", "created": 1561214408, "upvotes": 30}, "ersh3ak": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersh3ak/", "text": "Most colleges have such shitty parking situation anyway, near a campus would be one of the worst places to try to live in your car.\n\nThere was a blog several years, maybe even a decade ago, by a guy who was a student at Duke University and living in his van. I think he did so for about a year and once the University heard about it and figured out who he was they banned people from living in vehicles after that.", "author": "-firead-", "created": 1561213852, "upvotes": 5}, "ersg5a0": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersg5a0/", "text": "This is how you miss out on 90% of the college experience and come back to us in a year posting about how depressed college makes you and we say it’s because you don’t have a comfortable sleeping space or studying space and can’t make decent meals. \nBuy a parking pass and you’re good to park on campus but what about how much you’ll have to keep it running for AC and heat? The gas will get to you, sure, but wear and tear on a car running so long without actually moving can cost you thousands. \nNot living in a dorm means you won’t technically have access to one to get into the showers or sinks. Yeah you can wait outside for someone to leave and let you in but it’ll be weird when those people notice a developing pattern from you and tip off University Police. Also a good way to be late to class when it takes you a few extra minutes to get in. \n\ntl;dr Don’t. The bulk of your money is being spent to learn. Maximize your education then. Do that through comfort and happiness. Ask any grad, they’ll tell you how that’s just as important as study habits.", "author": "flakman129", "created": 1561213025, "upvotes": 59}, "ersewm3": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersewm3/", "text": "If you can find an RV park type place where you can actually have an address and connect with electricity, etc- go for it. You could also maybe pay someone a little bit of rent to park outside their house and use their utilities.", "author": "GrandmaMabelGrey", "created": 1561211927, "upvotes": 8}, "erses83": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/erses83/", "text": "You're not going to get good sleep or have a healthy social life doing this. Apart from the obvious legal problems you're also gonna have a hard time making it to class on time. Don't do this. Talk to your financial aid office if it's really this bad.", "author": "Yellowdog727", "created": 1561211815, "upvotes": 144}, "ersepdl": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersepdl/", "text": "Friend of mine literally lived in a van down by the river while putting himself through college. He worked for a few years and put everything into modifying one of those sprinter type vans then went to school. Worked out great for him.", "author": "Eisernes", "created": 1561211743, "upvotes": 5}, "ersb2wx": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ersb2wx/", "text": "If your college is in a city or residential area there might be caretaker jobs in exchange for a free room.  Keep an eye out for an elderly person / things like that. \n\nGet creative in your search for housing. Don't limit yourself to forums or ad boards just for students.", "author": "nooutlaw4me", "created": 1561208145, "upvotes": 49}, "ers9jdm": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ers9jdm/", "text": "Being homeless is more expensive than you think.\n\nWhat if you get a fine?  What if you get arrested?  Not having an address will prevent you from many things - cell phone contracts, getting important mail (yes, snail mail is still important, especially if you have any legal issues)  You will have no electricity or wifi - with most of your assignments and course access requiring internet access, you won't be able to do those, keep your phone charged.\n\nWhere will you defecate and urinate - what if you get sick - even a little bit-.\n\nThis is a terrible idea.", "author": "PersephoneIsNotHome", "created": 1561206440, "upvotes": 74}, "ers9gyt": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ers9gyt/", "text": "Could you find a permanent parking spot to purchase, and then 'park' there for the night? It should be cheap compared to renting/dorms, and then also legal.", "author": "kittykata27", "created": 1561206364, "upvotes": 6}, "ers6f0u": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ers6f0u/", "text": "I bet you could plan to live in your van, but early in the semester I bet you’d find a group of friends or a frat that understands and would totally take you in. I know at least that’s what my friend group would do if we saw someone in a thought situation like that.", "author": "OhItsNotJoe", "created": 1561202396, "upvotes": 6}, "ers5xw1": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ers5xw1/", "text": "Having lived in the area, there is no suitable place near campus where you would be able to pull this off. There isn’t a Walmart parking lot until you get to Arroyo Grande, about 20-25 minutes away. I wouldn’t recommend doing it, even with the extreme cost of living in SLO county.", "author": "balto254", "created": 1561201693, "upvotes": 73}, "ers2tzm": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ers2tzm/", "text": "I haven't personally done it, but my brother tried it and was constantly stopped by the police for trespassing. Unless you could find a secluded area to park then I wouldn't try it. It absolutely pathetic that students are resorting to this though, these colleges should be ashamed of themselves.", "author": "NoChannel1", "created": 1561196744, "upvotes": 90}, "ers1arx": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/ers1arx/", "text": "The most obvious advice is to talk to your financial aid office. They might be able to help, or at least nudge you to someone who can.\n\nMost of California has a strict \"no car camping\" policy, regardless of if it's on a store parking lot, city street, private property, or public facility (even campgrounds that you pay for). After a quick google search, San Luis Obispo is no different, if not, more strict than other cities.\n\nEDIT: 'hijacking' my own post to highlight u/W0nderlandz's more specialized advice, take that offer and ask for help.", "author": "Stephen10023", "created": 1561194197, "upvotes": 310}, "errz5e1": {"link": "/r/college/comments/c3ms61/optional_homelessness_for_college/errz5e1/", "text": "Have you considered the legality and logistics of this, like where will you legally park your car so consistently, how much will parking cost, could you get into an (expensive) legal fiasco if you were caught\n\nAlso, what about safety, what if your car breaks down or gets stolen/broken into? If your campus has 24 hour access buildings I’d crash there in emergencies.", "author": null, "created": 1561190676, "upvotes": 282}}}