{
  "sid": "q0xosp",
  "link": "/r/college/comments/q0xosp/worrying_that_im_going_to_fail_cant_decide_if_my/",
  "title:": "Worrying that I'm going to fail. Can't decide if my major is good for me. Just a complete less. Don't know what to do.",
  "text": "So I am a sophomore, although I did all of last year online from home, so that kinda killed the experience for me. Regardless, I am on campus now and am really struggling with things.\n\nI will start by mentioning that I am autistic and have ADHD, but the school I am attending has a really weird requirement that to get accommodations, my diagnosis has to be no more than like 3 years old, or else I have to be reevaluated which I don't really know how to do that process exactly. My diagnosis is 14 years old, so definitely too old.\n\nSo I have been struggling with a lot of my classes due to not being able to click with a lot of what is being taught in class. I am really struggling to understand all my classes. Calculus often makes no sense and has too many complex steps. Geology has been quite a challenge of so many different words and things all crammed into one test. My geology lab class has actually been worse because I can't tell a proper difference between many rocks just by looking at it. Then my computer science coding class has also been bad, just not understanding how to program many of the commands into python and stuff. I even tried tutoring for this class last week and barely learned everything over the course of an hour. It has all been quite brutal and has made me worry to death that I am not good enough to be here and things.\n\nI am a CS major currently. I was wanting to learn how to code because of my lifelong interest in computers, albeit I have always struggled with coding. I'm not sure if I need to change majors or what. The problem is I don't know what a good strategy would be since I don't know what other things I like to do that would make me decent money and are worth getting a degree for. It's quite a mess.\n\nThe main reasons I want to be here besides education are 2 things. I want to help myself along in my transgender transition journey being away from my not perfectly accepting family. I do not want to go back to that at all. The other reason is I really want to meet new people. I have always struggled socially my whole life and am trying to expand myself socially by being here. It has all been a struggle, but better than back home. This is why I don't want to leave.\n\nEither way, as you can probably tell by reading this, my college life is kinda a complete mess. Does anyone have any ideas perhaps that may help?",
  "author": "Weatheronthe8s",
  "created": 1633319302,
  "updated": 1634089608,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hfbcdbo": {
      "link": "/r/college/comments/q0xosp/worrying_that_im_going_to_fail_cant_decide_if_my/hfbcdbo/",
      "text": "To get reevaluated try to go to a  doctor to get updated paperwork for your disabilities.\n\nMy colleges disability office requirements were to up to date paper wok for your disabilities or in pasted 3 years. So I think that's pretty standard. I was lucky during my senior year of high school I got all of my disabilities paper work updated.",
      "author": "tcbobb16",
      "created": 1633321276,
      "upvotes": 2,
      "replies": {
        "hfbclu4": {
          "link": "/r/college/comments/q0xosp/worrying_that_im_going_to_fail_cant_decide_if_my/hfbclu4/",
          "text": "Yeah. I don't get why it's standard, but I assume just so people can make more money is my best guess since you don't magically turn NT at the snap of a finger or anything. Sadly I don't have updated papers since I don't have any sort of regular doctor or anything. So you know of what kind of doctor would be best for getting updated papers?",
          "author": "Weatheronthe8s",
          "created": 1633321427,
          "upvotes": 1,
          "replies": {
            "hfbduv3": {
              "link": "/r/college/comments/q0xosp/worrying_that_im_going_to_fail_cant_decide_if_my/hfbduv3/",
              "text": "I do not know what type of doctor would updated paperwork on your disabilities Sadly. I would guess ask your general doctor how to update your diet paperwork.\n\nI think was colleges disability office wants updated paperwork to weed out people who claim to have a disability because they think colleges are easy on Disabled people Sadly.",
              "author": "tcbobb16",
              "created": 1633322234,
              "upvotes": 2,
              "replies": {
                "hfcgvcd": {
                  "link": "/r/college/comments/q0xosp/worrying_that_im_going_to_fail_cant_decide_if_my/hfcgvcd/",
                  "text": "Yeah. I don’t have a regular doctor, so it’s kinda confusing. It is unfortunate it’s so hard to do all this.",
                  "author": "Weatheronthe8s",
                  "created": 1633352596,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfb95c7": {
      "link": "/r/college/comments/q0xosp/worrying_that_im_going_to_fail_cant_decide_if_my/hfb95c7/",
      "text": "I meant \"mess\" in the title, not \"less.\"",
      "author": "Weatheronthe8s",
      "created": 1633319348,
      "upvotes": 1,
      "replies": {}
    }
  }
}