{
  "sid": "d9a3ja",
  "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/",
  "title:": "I'm being falsely accused of academic misconduct but I have no proof that I'm innocent",
  "text": "My roommate and I are in the same year and major so naturally we have a few classes together. Last week we had a computer science assignment due that we both forgot about until he looked at the course page and realized it was due at 11:59 which was in half in hour. We both busted our laptops out and wrote the code as fast as possible and finished around the same time... 12:01. frantic and not wanted to get stuck with a zero we both sent separate emails to our professor with the files attached. The fact that we did this assignment so quickly is an important detail to me because it means there is no way we could have worked together and still get done so fast. \n\nFast forward to today, about a week later. This morning she replied to the email finally and asked us to come her at her office hours. my roommate had a class so I went alone. My professor accused me of plagiarism citing that our code was too similar, we made the same mistakes, and we both tried to turn them in late, around the same time. I tried fighting for my case but of course she was very dismissive and at one point laughed at me. She tried getting me to sign off on a paper that would be sent to the office of student conduct but I refused and wanted to consider my options before admitting to something I didn't do, so I have to go to her office hours again on Monday. and that brings us to right now. I don't know how to prove that I didn't cheat and I'm worried about suffering consequences that I don't deserve. Any advice would be much appreciated right now.\n\nEDIT: thanks for the advice everyone. I’m currently writing an email to the dean where I present the story, refute her points, and highlight the fact that she was disrespectful towards me.",
  "author": "recnepsj",
  "created": 1569448048,
  "over_18": false,
  "upvotes": 1184,
  "upvote_ratio": 0.99,
  "comments": {
    "f1jf9dc": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1jf9dc/",
      "text": "Well just because you and your roommate did similar things doesn’t mean you plagiarized. You could refute her accusation by saying that correlation does not equal causation.  IDK it might work, either way because you have no proof it’s a he said she said situation, however you could use that to your advantage in some ways. I would learn all you can about plagiarism and look at past cases where people were in the same situation to see what they did, and maybe you can figure out what to do with that. Good luck!!!!",
      "author": "VWinterfell1918",
      "created": 1569522495,
      "upvotes": 1,
      "replies": {}
    },
    "f1j7ewl": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1j7ewl/",
      "text": "Do as others have said and take this up the chain. Make sure nothing else you turn into this class can be misconstrued as plagiarism and be aware that you'll have extra attention and scrutiny from the professor from here on.",
      "author": "ssfctid",
      "created": 1569519694,
      "upvotes": 1,
      "replies": {}
    },
    "f1j5rh0": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1j5rh0/",
      "text": "Did you tell anyone else you forgot to do the assignment",
      "author": "Anti-Antivax_Club",
      "created": 1569519095,
      "upvotes": 1,
      "replies": {}
    },
    "f1j23n0": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1j23n0/",
      "text": "Honestly I don't see why this shit is a problem. You're there to work together with people. Not to sit in solitude and teach yourself, cause god knows professors don't teach anymore.",
      "author": "mouseysmack",
      "created": 1569517730,
      "upvotes": 1,
      "replies": {}
    },
    "f1j13u6": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1j13u6/",
      "text": "Free my mans u/recnepsj",
      "author": "BootyGangWarriorsCEO",
      "created": 1569517356,
      "upvotes": 1,
      "replies": {}
    },
    "f1ivtw5": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1ivtw5/",
      "text": "Well, if it walks like a duck... While you may not have cheated, you did put your professor in a weird spot. Most schools have 0 tolerance for academic dishonesty and pursuant to that policy, they have to investigate every instance. I honestly think they're just doing their jobs.\n\nYou're right for defending yourself and I believe you are telling the truth but there is a certain track this type of incident must follow or else the policy would be useless. Just ride out the storm and keep to your story. There's nothing that proves you plagiarized but theres also no proof you didn't. Know what I mean?\n\nI've had this happen to me when I was in the Navy at nuclear power school. The guy next to me actually cheated on my test but it looked like I was the one who cheated. They ended up grilling us (military style which wasn't pleasant or respectful) both and put us in separate rooms to watch us work out a random problem on a whiteboard in front of a few instructors. What happened? We ended up doing the exact same work because the kid next to me had memorized the answer in question (because he obviously cheated). They let both of us go since it was inconclusive. Sometimes you just have to ride out the storm with these kinds of things but most importantly you should stick to your own knowledge in case something like what I went through happens to you. Lack of proof isn't enough to take disciplinary action, IMO.\n\nEdit: Spelling",
      "author": null,
      "created": 1569515528,
      "upvotes": 1,
      "replies": {
        "f1jg7bm": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1jg7bm/",
          "text": "First part of your post is terrible logic and making excuses for someone who obviously  just wants to drop the hammer. They didn't do a proper investigation at all. They called a student into their office and tried to brow beat them into admitting something they didn't do without actually having evidence that they cheated.\n\nThe teacher isn't giving him a fair shot to prove his case at all and is obviously  a narcissist if she goes as far as laughing in his face when he points out differences in the code.",
          "author": "7TH1",
          "created": 1569522834,
          "upvotes": 1,
          "replies": {
            "f1kp6e8": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1kp6e8/",
              "text": "What are they supposed to do? Take the kid out for fucking lunch and ask them politely if they cheated? If someone were to be in suspicion of infringing on a pretty important and ethical issue that could lead to the expulsion from college, don’t you think they’d be a little hasty with their approach? Face reality. Not everything has to be dealt with such sensitivity.",
              "author": null,
              "created": 1569538440,
              "upvotes": 1,
              "replies": {
                "f1ksk6r": {
                  "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1ksk6r/",
                  "text": "> Face reality. Not everything has to be dealt with such sensitivity.\n\nLmao you're a moron. When did I ask for sensitivity?\n\n>  If someone were to be in suspicion of infringing on a pretty important and ethical issue that could lead to the expulsion from college, don’t you think they’d be a little hasty with their approach?\n\nThe fact it can lead to expulsion is exactly why it SHOULDN'T be handled hastily. This professor walked him into a trap and tried to take advantage of the perceived power of her position to get him to sign a document admitting guilt. No matter how you look at it that's a terrible thing and shouldn't be defended.\n\nThe Professor should have approached him and his friend separately and had conversations with them one adult to another and gave them an opportunity to defend themselves where in she actually respectfully listened to them. Laughing in his face when he points out evidence countering her claim of cheating and shoving a document in his face isn't respect nor is it professional conduct.\n\nYou and that Professor are everything wrong with the academic system these days. It's honestly hilarious that shes so certain of cheating on what sounds like a basic entry level assignment. Which was assigned to dozens of students who are all being taught to think and code the same way. There are only so many ways to crack an egg, and only so many ways to screw it up. In this context I'd absolutely expect similar code layout and errors.",
                  "author": "7TH1",
                  "created": 1569539802,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f1io2fo": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1io2fo/",
      "text": "Had this happen to me in a database class.  You can't let your professor intimidate you into confessing something you're not guilty of.  Send the dean an e-mail and try to stay professional and firm.  Set up a meeting with your advisor to see what you can do to prove your innocence.\n\nI feel your pain, man.  Best of luck to you.",
      "author": "BiggusIggus",
      "created": 1569512887,
      "upvotes": 2,
      "replies": {}
    },
    "f1iag72": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1iag72/",
      "text": "I’m not too far into college, but I’m pretty sure your innocent until proven guilty. And unless she can prove you both worked together I don’t know why this story wouldn’t hold up to any type of hearing on the matter.",
      "author": "LPKKiller",
      "created": 1569508075,
      "upvotes": 1,
      "replies": {}
    },
    "f1gzuxc": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gzuxc/",
      "text": "I'm crying, guys. You are all so good. I hope OP can prove its innocence.",
      "author": null,
      "created": 1569482151,
      "upvotes": 1,
      "replies": {
        "f1lgwsg": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1lgwsg/",
          "text": "Why are you crying?",
          "author": null,
          "created": 1569554485,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f1gxaw0": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gxaw0/",
      "text": "Before it's too late to, download a screen recording app and turn it on. Open your IDE, and press Ctrl-Z so that you have a recording of as much of your work being done as possible. Good luck, I'm really rooting for you.",
      "author": "violetnotviolent",
      "created": 1569480403,
      "upvotes": 5,
      "replies": {}
    },
    "f1gqdzw": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gqdzw/",
      "text": "Is this for busa with mySQL? Our professor did the same thing to me and another guy I know but we live 5 hours apart and wrote our codes completely separately. Since our class is online, I didnt know he was even in the class with me until we were accused. I took that straight up to the dean and although we both admitted to googling for help, there was no instructions to not use outside sources to figure out our code. So essentially everything was dropped and we were given an apology. \n\nCant prove anything without proof on her end either. Even if you did work on it together ask her to show you where it says you couldnt work with another student.",
      "author": "MEGATRONNN27",
      "created": 1569474029,
      "upvotes": 2,
      "replies": {}
    },
    "f1gn5ip": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gn5ip/",
      "text": "What was the assignment (lots of lines, functions, etc.)? If you are in an intro course, there are a lot of assignments where multiple people can have very similar code and run into the same errors with it. It's very different than a lot of other fields and there is an almost universally accepted rule that general coding snippets like basic sort functions, class constructors, etc. are okay to copy because they are so generic. If it was a smaller assignment (by lines of code), you have a better chance at refuting her claim based on the actual work itself.\n\nE.g: There's only so many ways to write a loop that sums up numbers. If you gave everyone a while loop assignment to increment a number to 10, you'd probably have 90% of the class turn in something exactly like:\n\n>`while x < 10:`  \n>  \n>`x++`\n\nor:\n\n>`while x < 10:`  \n>  \n>`x += 1`\n\n&#x200B;\n\nYou can sometimes use the metadata in your IDE to view the history/undo stuff. If you can find data like this, it would show that you wrote it piece by piece and didn't copy/paste it. Take the laptop to her and hit CTRL+Z to show her all the progress and times you ran it, that's pretty good proof. People copying don't take 30 minutes to type a problem and keep running it for errors.",
      "author": null,
      "created": 1569471389,
      "upvotes": 2,
      "replies": {}
    },
    "f1giq06": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1giq06/",
      "text": "That's circumstantial evidence she doesn't have any concrete evidence which shows you plagiarised the work just that it's possible/probable given how it looks.",
      "author": "alik2004",
      "created": 1569468160,
      "upvotes": 1,
      "replies": {}
    },
    "f1ghh4c": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1ghh4c/",
      "text": "I teach (not at college level) and I would have simply called you in, pointed out that it looked uncomfortably similar, and to please be careful.  That it might be a fluke, or a function of you both studying together and thinking alike,  but to be ironclad sure in future to avoid any coincidences so you don’t get yourselves in to trouble. I would have them kept an eye on things, but let it go unless the issue happened again.  She’s over reacting and could have made it a much better teaching point by not being an ass and still creating enough concern to make her message come across.  (Not doubting you, but it’s always good to be on guard just to be safe) As a student of Spanish I alway assumed I inadvertently copied crap because if what I wrote sounded good “I must have stolen it”. It made  me just paranoid enough to stay squeaky clean with a cushion",
      "author": "SunflowerJYB",
      "created": 1569467375,
      "upvotes": 0,
      "replies": {}
    },
    "f1ggst8": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1ggst8/",
      "text": "What did the paper say? Generally the student conduct meeting is your “trial” and you’re not responsible for anything until they deem it so. \n\nI would suggest reaching out to the dean of your college or department and letting them know your dilemma.",
      "author": "coadnamedalex",
      "created": 1569466965,
      "upvotes": 1,
      "replies": {}
    },
    "f1ger4r": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1ger4r/",
      "text": "Go higher up the chain. No one in the wrong will go that far to prove themselves on their own, i think. And ones they say something is clear, thats it.",
      "author": "easythrowawayname71",
      "created": 1569465746,
      "upvotes": 3,
      "replies": {}
    },
    "f1gek8x": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gek8x/",
      "text": "Your code is similar huh? Compile both of them and check the assembly generated by the compiler. If even one line is off then the code is not the same.",
      "author": "Bluecoregamming",
      "created": 1569465630,
      "upvotes": 2,
      "replies": {
        "f1lh2mj": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1lh2mj/",
          "text": "Actually, there are more chances that the assembly will be similar than the source code. Due to compiling optimization, two different statmentds can be compiled into the same bytecode. For a 30 minute project, I'm willing to bet that the bytecode is more similar than the source code.",
          "author": null,
          "created": 1569554610,
          "upvotes": 1,
          "replies": {
            "f1llt8y": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1llt8y/",
              "text": "Exactly. You'll want to turn all optimizations off, but if the assembly is different that is proof without doubt that there was no code copy.",
              "author": "Bluecoregamming",
              "created": 1569558617,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f1gcmni": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gcmni/",
      "text": "Check the software that you used to see if it tracks you from creation to completion.",
      "author": null,
      "created": 1569464505,
      "upvotes": 19,
      "replies": {}
    },
    "f1gauq5": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gauq5/",
      "text": "Whatever you do, make sure you keep it respectful because if you go off or get upset at her, she will win.\nDefinitely talk to your advisor and take a copy of your assignment and your friends. Also find out if there’s a student union on your campus.\n\nI can relate the feeling. Last year I turned in an assignment on Turnitin and apparently it accused me of plagiarism. The professor contacted me and I told her the reason was because I was quoting off the book (of course I cited). Luckily, she understood and passed me. Either way, horrible feeling!",
      "author": "buttercup_18842",
      "created": 1569463476,
      "upvotes": 36,
      "replies": {}
    },
    "f1g7a0i": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g7a0i/",
      "text": "[deleted]",
      "author": null,
      "created": 1569461406,
      "upvotes": 61,
      "replies": {
        "f1gphjo": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gphjo/",
          "text": "God it’s so annoying. Yeah everyone’s code is similar, there’s pseudocode in the book you told us to look at\n\nSome of my syllabi say you can’t even talk about code with other people in the class. It’s absolutely ridiculous and not how writing code in any other setting actually happens",
          "author": "bp0017",
          "created": 1569473294,
          "upvotes": 24,
          "replies": {
            "f1gxifd": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gxifd/",
              "text": "wow my teachers said that if all we were doing was talking about the code and not doing each other's homework it was fine.",
              "author": "bestjakeisbest",
              "created": 1569480551,
              "upvotes": 2,
              "replies": {}
            },
            "f1j5u92": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1j5u92/",
              "text": "You should be encouraged to collaborate...",
              "author": null,
              "created": 1569519124,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "f1g6ohq": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g6ohq/",
      "text": "She laughed? She tried to have you sign on something basically admitting to cheating when you absolutely didn't?\n\nYeah, you should speak with an advisor, the dean, whoever you need to, and go over the situation. When you do, include your professor's conduct, because I don't think any of that is acceptable.",
      "author": null,
      "created": 1569461061,
      "upvotes": 11,
      "replies": {}
    },
    "f1g5zih": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g5zih/",
      "text": "First, I do this professionally but am not familiar with your case or professor or school. \n\nYou mention that your code had the same errors. That's gonna be a really hard thing to overcome. I've had hearings hinge on just that 1 piece of evidence, because while 2+2=4 is right, 2 people getting 2+2=5 is incredibly unlikely if they didn't work together.\n\nGiven what you said your friend was with you, that may be unpermitted collaboration. And it's entirely possible that your friend copied your code without you knowing. If it's unpermitted  collaboration, then there's not much you can do except ask for understanding since you broke the rule by ignorance, not intentionally. If it's your friend copying off you, they would need to own up to it, and you may still be given a minor punishment since you didn't properly protect your work (depends on how anal the professor is).\n\nAll of that said, she will probably find you responsible and give you a punishment. Since you don't agree with that, look through all the paperwork and figure out who to appeal to and when by. Send that appeal up before the deadline and explain everything clearly and with details.\n\nDon't go off and email the dean and everyone else yet. They will just tell you to appeal and they'll keep an eye out for it. Your academic advisor is good to email though, they can help you navigate the process.",
      "author": "simmelianben",
      "created": 1569460661,
      "upvotes": 25,
      "replies": {
        "f1gs22d": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gs22d/",
          "text": "Yup. One error that could be because of a typo, like 4 being next to 5, isn't proof of much. Multiple errors that are all the same? Someone cheated.",
          "author": null,
          "created": 1569475488,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "f1g5nr0": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g5nr0/",
      "text": "Try your academic ombud office. They're here to help with situations like this.",
      "author": "albus247",
      "created": 1569460472,
      "upvotes": 6,
      "replies": {}
    },
    "f1g589x": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g589x/",
      "text": "Log every interaction you have with her, stick to your story, and log everything that happens regarding this. Don't sign a thing! Go to your student affairs office and bring it to their attention. In cases like this, whomever sticks to the most solid story with no changes wins.",
      "author": "NoChannel1",
      "created": 1569460207,
      "upvotes": 5,
      "replies": {}
    },
    "f1g4x6n": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g4x6n/",
      "text": "There is likely an office on your campus called the \"Academic Ombudsman.\" This is usually an impartial third party that arbitrates issues like yours. Being proactive in seeking this resource may speak more strongly to your integrity and concern for your reputation.\n\nAlso, try not to blame your professor too much for these assumptions. As an instructor myself, I could hardly believe the level of dishonesty and plagiarism I would encounter at first. It's enough to make anyone cynical.",
      "author": "HackyZac",
      "created": 1569460012,
      "upvotes": 73,
      "replies": {
        "f1gplyu": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gplyu/",
          "text": "Ombudsman? I had no idea this Norwegian word was used on universities. I thought this was a word rarely used in the English language. Cool to see as a Norwegian myself!",
          "author": "misterp_1000",
          "created": 1569473391,
          "upvotes": 15,
          "replies": {
            "f1h4spd": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1h4spd/",
              "text": "It was borrowed from Swedish actually",
              "author": "Ondrikus",
              "created": 1569485548,
              "upvotes": 6,
              "replies": {
                "f1h4wq5": {
                  "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1h4wq5/",
                  "text": "Vi snakker ikke om det",
                  "author": "misterp_1000",
                  "created": 1569485628,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "f1gvf6t": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gvf6t/",
              "text": "Used a lot in government/legal services in Australia too. Never knew it was Norwegian!",
              "author": "fibee22",
              "created": 1569478755,
              "upvotes": 4,
              "replies": {
                "f1gvkkz": {
                  "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gvkkz/",
                  "text": "Oh yea. Ombud means representative and man is just man. So it means representative man",
                  "author": "misterp_1000",
                  "created": 1569478910,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "f1ik00m": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1ik00m/",
          "text": "Unfortunately, some universities don’t have an “unbiased” group like this. In my school, the head of the academic honesty panel who often had the final decision on these things was one of the very professors who gave out unfair grades and accused this sort of behavior.",
          "author": "soulofmind",
          "created": 1569511417,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1g4ejg": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g4ejg/",
      "text": "CompSci major here.\n\nI assume you didn't use git for anything, but if you did those have cleared peoples names before in our program. \n\nOther than that where I started to make my case was pointing out everything I did that was standard, or standard for the class. Variable names for example. You mentioned that you pointed out differences. If there are stylistic differences, take the time to find them and point them out. If you have a  copy of your roommates assignment, make notes on what is different, problem solving wise. \n\nNext email your prof. Confirm that she wants to speak to you Monday. Keep a paper trail of this. Some universities need proof that you talked to your prof and tried to work it out, before they'll let you escalate the issue. If she doesn't reply its fine, still go. You're just creating proof that you tried to solve this. \n\nNow you go to an advisor or your dean if they'll talk to you. Explain the situation. Tell them that you're not sure how many different ways there are to solve the problem. Restate your post. Tell them you can't prove that you didn't do it but then mention that you followed standards (either class or general), and that you looked over your roommates assignment after being confronted, and found several glaring differences. \n\nIf you can't meet with the dean or an advisor before Monday, go into her office, hear what she has to say, but don't sign anything. Tell her politely that you're not willing to sign anything, or that you're not happy with the conclusion reached at this meeting, and it will need to be discussed further. Don't threaten to escalate the issue to the dean, even if you intend to. \n\nFinally, brush up on your colleges academic dishonesty policy, as well as the policy for challenging a grade. It helps to have a slight understanding of where you stand and what your rights are going in.",
      "author": "SensitiveWeb8",
      "created": 1569459677,
      "upvotes": 540,
      "replies": {
        "f1g8ziv": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g8ziv/",
          "text": "I’d also maybe volunteer to recreate the code in a controlled setting. The majority of my comp classes state that if code is extremely similar they’ll ask you to recreate it to prove it’s based on your own knowledge.",
          "author": "sweetczylove",
          "created": 1569462402,
          "upvotes": 344,
          "replies": {
            "f1gbfjh": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gbfjh/",
              "text": "This is really good advice.",
              "author": "SensitiveWeb8",
              "created": 1569463805,
              "upvotes": 89,
              "replies": {}
            },
            "f1hubyo": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1hubyo/",
              "text": "Also if you have copies of past programs, you can show similarities. So tend to jump between certain variables even when it gets confusing for example",
              "author": "Lector213",
              "created": 1569501030,
              "upvotes": 22,
              "replies": {}
            },
            "f1hyy1o": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1hyy1o/",
              "text": "Yup, I think this and u/SensitiveWeb8’s advice is the best here!",
              "author": "dukwrth",
              "created": 1569503266,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "f1gkzhy": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gkzhy/",
          "text": "Demand access to the code submitted by other people in the class to see how many of them made the same mistakes, etc. Just the fact that you're asking with that purpose suggests your innocence.\n\nEdit: I'm teaching my son C# and last evening we spent an hour writing a method to identify primes. Today I found an example on the web *that was almost identical*, a couple  nested for-loops indexed by i and j, both using a Boolean  named *isPrime* and doing \"isPrime = false; break\" identically. **Coders have conventions so *of course* code will look similar, especially for something simple that can be knocked out in an hour**.",
          "author": "TrumpLyftAlles",
          "created": 1569469686,
          "upvotes": 34,
          "replies": {}
        }
      }
    },
    "f1g4dld": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g4dld/",
      "text": "Contact the dean, I had to take an academic integrity course this semester for a class. You as the student have so many rights that she is trying to take away by saying sign this paper now. Look up for schools policy and talk to the dean. Good luck to you",
      "author": "Azh_950",
      "created": 1569459660,
      "upvotes": 1,
      "replies": {}
    },
    "f1g4d8a": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g4d8a/",
      "text": "Contact the dean, I had to take an academic integrity course this semester for a class. You as the student have so many rights that she is trying to take away by saying sign this paper now. Look up for schools policy and talk to the dean. Good luck to you",
      "author": "Azh_950",
      "created": 1569459654,
      "upvotes": 8,
      "replies": {}
    },
    "f1g49gq": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g49gq/",
      "text": "Definitely get other staff involved and ask for them to review both your work for objective evidence that they are in fact different.",
      "author": "Eredhel",
      "created": 1569459589,
      "upvotes": 5,
      "replies": {}
    },
    "f1g45s3": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g45s3/",
      "text": "Reach out to your leadership in student affairs. Go in a meet with these people. If you did not cheat; you don’t deserve this. And report her behavior.",
      "author": "pilotjones244",
      "created": 1569459526,
      "upvotes": 5,
      "replies": {}
    },
    "f1fyhtw": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1fyhtw/",
      "text": "what a butthole professor",
      "author": "Peanut_ButterPenguin",
      "created": 1569455867,
      "upvotes": 27,
      "replies": {}
    },
    "f1ftghe": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1ftghe/",
      "text": "Tell her if you were trying to cheat you would've made it less obvious",
      "author": null,
      "created": 1569452619,
      "upvotes": 33,
      "replies": {
        "f1g4gvj": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g4gvj/",
          "text": "That is actually a crap advice dont follow",
          "author": "MatrixDweller_16",
          "created": 1569459720,
          "upvotes": 70,
          "replies": {
            "f1gjdv0": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gjdv0/",
              "text": "Yeah it's probably better to play it safe unless the professor is really chill",
              "author": null,
              "created": 1569468583,
              "upvotes": 4,
              "replies": {}
            },
            "f1g60m8": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g60m8/",
              "text": "Worked for me",
              "author": "ttigerccat9601",
              "created": 1569460678,
              "upvotes": -1,
              "replies": {}
            }
          }
        },
        "f1fw3yy": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1fw3yy/",
          "text": "That’s a good point, I would have at least changed the names of things haha",
          "author": "recnepsj",
          "created": 1569454333,
          "upvotes": 19,
          "replies": {
            "f1g8aem": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g8aem/",
              "text": "I like how she's saying that not only are the similarities are proof of plagiarism but so are the differences.",
              "author": "Shannerwren",
              "created": 1569461997,
              "upvotes": 10,
              "replies": {
                "f1gjbn1": {
                  "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gjbn1/",
                  "text": "because she convinced herself of his misdoings and won’t shake the belief in her opinion",
                  "author": "omgitsabean",
                  "created": 1569468544,
                  "upvotes": 7,
                  "replies": {
                    "f1glp1m": {
                      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1glp1m/",
                      "text": "sounds like she just doesn't like OP",
                      "author": "ISpeakWhaleDoYou",
                      "created": 1569470228,
                      "upvotes": 3,
                      "replies": {
                        "f1gntcl": {
                          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gntcl/",
                          "text": "This is the first time I’ve really interacted with her",
                          "author": "recnepsj",
                          "created": 1569471930,
                          "upvotes": 4,
                          "replies": {
                            "f1kmpfu": {
                              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1kmpfu/",
                              "text": "it might be because of any number of small things. but it sounds like she's got it out for you",
                              "author": "ISpeakWhaleDoYou",
                              "created": 1569537569,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f1ft53w": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1ft53w/",
      "text": "Contact the dean, your academic advisor, or student affairs office. Professors cannot be the only people involved in a student conduct issue. Also, her laughing not acceptable behavior what so ever. Mention this when you talk to other people.",
      "author": "veanell",
      "created": 1569452409,
      "upvotes": 779,
      "replies": {
        "f1g5ej3": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g5ej3/",
          "text": "Make sure that if you do have to attend any sort of meeting or appeal, you have a representative from the student union there with you. They know the academic regulations inside out and can potentially get you off on a technicality at the very least. As your representative, they can also say what you're thinking but can't actually say (e.g. calling the university out on their bullshit).\n\nThink of them like your lawyer. You'd never represent yourself at a criminal case in court. Don't do it here.",
          "author": "Firerain",
          "created": 1569460319,
          "upvotes": 197,
          "replies": {
            "f1ge4wx": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1ge4wx/",
              "text": "OP needs a lawyer, you also may want to try and hit the school on federal charges of entrapment or extortion.",
              "author": "QuietLeaf3000",
              "created": 1569465381,
              "upvotes": -37,
              "replies": {
                "f1gf29l": {
                  "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gf29l/",
                  "text": "That seems like a lot, how do you see what the school's doing as either of those crimes?",
                  "author": "SkiMonkey98",
                  "created": 1569465935,
                  "upvotes": 35,
                  "replies": {
                    "f1gg5cz": {
                      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gg5cz/",
                      "text": "You sign not a thing and do not be alone with that professor, any action the school does to negatively impact your grade not in the course syllabus is used as evidence.",
                      "author": "QuietLeaf3000",
                      "created": 1569466576,
                      "upvotes": 0,
                      "replies": {
                        "f1gqx54": {
                          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gqx54/",
                          "text": "Not bad advice but it doesn't explain how you think the school is guilty of entrapment or extortion",
                          "author": "SkiMonkey98",
                          "created": 1569474484,
                          "upvotes": 12,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "f1gliqg": {
                  "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gliqg/",
                  "text": "This is neither of those things.",
                  "author": "usskawaii",
                  "created": 1569470092,
                  "upvotes": 8,
                  "replies": {
                    "f1glohn": {
                      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1glohn/",
                      "text": "Not yet, but what was the purpose of attempting to obtain an admission of wrongdoing?",
                      "author": "QuietLeaf3000",
                      "created": 1569470217,
                      "upvotes": -7,
                      "replies": {
                        "f1glz9y": {
                          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1glz9y/",
                          "text": "Cheating isn’t a crime, so academic misconduct isn’t a legal matter. The school forcing OP to admit to cheating (which has not happened) isn’t anywhere near the same level as extortion or entrapment.",
                          "author": "usskawaii",
                          "created": 1569470445,
                          "upvotes": 12,
                          "replies": {
                            "f1go6un": {
                              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1go6un/",
                              "text": "But effectively the investment in a lawyer is arguably just as important. You really do want advice from someone who understands policy, contracts, education law, etc. if you face plagiarism charges. I would not recommend it at this point but I would if there was a hearing.\n\nSome schools are very tough on plagiarism. $1000 for a person to help prepare and defend you against plagiarism charges is better than getting suspended for a semester. Classes are expensive too, economically getting kicked out of a class at some universities might cost more than hiring a lawyer to help defend the accusation and keep you in it.",
                              "author": null,
                              "created": 1569472235,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "f1gmv2m": {
                              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gmv2m/",
                              "text": "If I do or say anything to make a reasonable man feel like he is being unjustly deprived of a thing of value to which he is entitled unless he signs a statement against his interest this becomes a form of entrapment, if this statement is used to unjustly enrich the college, now we have fraud. (Does the college intend to refund the accused cheat?)",
                              "author": "QuietLeaf3000",
                              "created": 1569471151,
                              "upvotes": -1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "f1gojix": {
                  "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gojix/",
                  "text": "You have got to be kidding. 😂",
                  "author": "snoboy8999",
                  "created": 1569472529,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "f1gcrss": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gcrss/",
          "text": "Also make sure to be as professional as you can whenever you talk to your professor, document everything that you can in writing between you and your professor because you don't want anything used against you. Don't panic, because that'll make it seem like you're guilty even if you're not. Also-offer to start the project over from scratch if you can if they do still think you're guilty of misconduct.\n\nI had this happen to me with a paper in my first year of college. The professor thought I plagiarized because I quoted a couple different sections of an article online. I explicitly cited the sources which given the parameters of this assignment was 100% acceptable.\n\nWhat I did in my case was send the professor the links to these two articles and came in-person to talk with him, in which he admitted he was wrong. He saw the % on the turn it in on red, and that's what brought him to send me the email where he thought I plagiarized.",
          "author": "deeznuts80081",
          "created": 1569464592,
          "upvotes": 36,
          "replies": {}
        },
        "f1ggqmp": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1ggqmp/",
          "text": "I agree. You lawyer up. And bring in the provost, the chair of your department, and the chair of her department.   Professors love to bully. Bully right back at them. But be transparent about it all. At my institution, its darned hard for professors to win at a plagiarism hearing when the student actively defends against the charges. The one thing you do need to consider is that you are now on the radar of that professor and their friends who are professors. And they all grade your stuff. \n\nOh and another thing... talk with your parents. Get them involved and have them call the dean, the provost, the chairs, etc. If they are alumni, congrats, get them to call the alumni association. \n\nOh and another thing to the another thing... take screenshots of when the files were saved. Save your command logs. Document... it... all.",
          "author": "DrVan",
          "created": 1569466929,
          "upvotes": 13,
          "replies": {
            "f1glhdi": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1glhdi/",
              "text": "@ u/recnepsj \\^ you need to read this.\n\nAlso as a CS major, i have no doubt this is true. Of course you and your roommate would have the same misunderstandings and issues. \n\nIf your state allows one-party recording, you can recording your teacher secretly. Check your university policies though, and this is NOT legal advice and not any kind of advice.",
              "author": "ISpeakWhaleDoYou",
              "created": 1569470063,
              "upvotes": 2,
              "replies": {}
            },
            "f1hm30k": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1hm30k/",
              "text": "Professors love to bully? No, no we do not. Suspecting cheating and calling it out is our job. We do, however, have to admit when we are wrong. That's not bullying.",
              "author": "whats_it_to_you77",
              "created": 1569496274,
              "upvotes": -8,
              "replies": {}
            }
          }
        }
      }
    },
    "f1fnyj0": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1fnyj0/",
      "text": "[deleted]",
      "author": null,
      "created": 1569448741,
      "upvotes": 12,
      "replies": {
        "f1fpyzr": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1fpyzr/",
          "text": "There were maybe two ways to do it that I can think of. I didn’t think to ask to see another students code to compare. \n\nAs for the mistakes, one of them was there because neither of us knew how to do what she was asking. The others were just honest over sights due to rushing. I don’t really get this argument either because to be honest his had far more mistakes than mine and his wouldn’t even compile.",
          "author": "recnepsj",
          "created": 1569450164,
          "upvotes": 10,
          "replies": {
            "f1glml5": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1glml5/",
              "text": "ok that's bullshit. is your roommate in trouble too? if not, she's just out to get you. Don't let her get off easy.",
              "author": "ISpeakWhaleDoYou",
              "created": 1569470175,
              "upvotes": 3,
              "replies": {
                "f1glu12": {
                  "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1glu12/",
                  "text": "He hasn’t spoken to her yet, but it’s assumed that we are in the same boat",
                  "author": "recnepsj",
                  "created": 1569470334,
                  "upvotes": 1,
                  "replies": {
                    "f1glwuj": {
                      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1glwuj/",
                      "text": "ok only one of you gets to be the plagiarizer.\nAlso, tell your parents. I'm fairly positive she's just out to get you",
                      "author": "ISpeakWhaleDoYou",
                      "created": 1569470393,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f1glqxz": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1glqxz/",
              "text": "drive the point home that your roommate's wouldn't even compile and yours did. That alone speaks volumes to your innocence.",
              "author": "ISpeakWhaleDoYou",
              "created": 1569470267,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "f1fxtig": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1fxtig/",
          "text": ">I bet in a Calc class, all the mistakes students make are more likely to be similar to other mistakes.\n\nCommon mistakes will be similar, but cheating is usually more than just \"you made the same mistakes in a few places\". It's really easy for me to tell which students have worked together or cheated from the same source because they use the exact same (odd) wording, they have the exact same progression of method, and they make the exact same (odd) mistakes. \n\nLike, they will both use a method that hasn't been taught in class and then they'll make the exact same algebraic errors in the same number of steps and with the same layout, producing exactly the same answer with the same incorrect units. The chances of two people making the exact same series of strange mistakes is very low, and every incidence I've seen has ended up with both students admitting to cheating.",
          "author": "NoxiousQuadrumvirate",
          "created": 1569455430,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "f1fn7tl": {
      "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1fn7tl/",
      "text": "Maybe point out the differences between the codes? And try to get other people on your side to vouch for you, especially faculty (maybe someone like your advisor or other professors you’ve had in the past that like you)",
      "author": "xoctoberx",
      "created": 1569448238,
      "upvotes": 149,
      "replies": {
        "f1fpkcq": {
          "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1fpkcq/",
          "text": "Yea there were a few differences that I pointed out (that’s when she laughed at me). She said that it was clear I tried to change it slightly so she wouldn’t notice. I like the faculty idea, I see my advisor pretty regularly so maybe he will vouch for me",
          "author": "recnepsj",
          "created": 1569449876,
          "upvotes": 159,
          "replies": {
            "f1g961q": {
              "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1g961q/",
              "text": "Man if it’s some code you can write in 30 mins, obviously it isn’t something huge with lots of room for variation. You should point that out too",
              "author": "_TheHalfTruth_",
              "created": 1569462503,
              "upvotes": 106,
              "replies": {
                "f1gdk6x": {
                  "link": "/r/college/comments/d9a3ja/im_being_falsely_accused_of_academic_misconduct/f1gdk6x/",
                  "text": "Exactly what I was thinking. Especially considering it’s the beginning(ish) of the term, so its highly likely this wasn’t a complex assignment.",
                  "author": "ParallelePiper",
                  "created": 1569465043,
                  "upvotes": 48,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634051628
}