{"sid": "pt3ed1", "link": "/r/college/comments/pt3ed1/i_fucking_hate_being_poor_and_i_wish_i_entered/", "title:": "I fucking hate being poor and i wish i entered with a better major... why tf did i enter as an environmental scientist major", "text": "I'm an incoming freshman at a pretty big public school, and my school charges like $300 for Freshman Orientation. I nor my parents don't have much money to spare so obviously, I didn't go and decided to work over the summer. The downside is that I'm given the bottom of the barrel classes. which basically means all the shitty GEs and zero classes that count towards any major. What's even worse is that I was planning to switch into an engineering major but i probably won't even be able to graduate on time if i switch, since i'm behind everyone else in curriculum. Switching into engineering is a pain in the ass at my school and graduating on time is an even bigger pain in the ass. I wish college wouldn't kick us poor students even further into the ground, this whole freshman orientation situation is basically fucking extortion. Also, I have no clue wtf I was smoking when I applied as an environmental science major... I want to be able to find a job with a good salary after I graduate, not continue being poor with shitty jobs. i might as well drop out already and go to community college for a useful major.\n\n&#x200B;\n\n&#x200B;\n\nif you're an environmental science major, don't take my words to seriously. I'm just venting my frustrations towards my school. School hasn't even started and it's already kicking my ass.", "author": "YeastedSoybeans", "created": 1632300852, "retrieved": 1632800896, "over_18": false, "upvotes": 2, "upvote_ratio": 0.67, "comments": {"hdwcm29": {"link": "/r/college/comments/pt3ed1/i_fucking_hate_being_poor_and_i_wish_i_entered/hdwcm29/", "text": "I'm not trying to sound like I'm throwing away all of your advice, but spending extra time in college to finish a degree is a luxury that I don't currently have. If I could afford it, I wouldn't mind spending an extra year to finish the engineering degree I want, but that's not financially possible right now. \n\n I talked to some upperclassmen and I'm on the fence between switching to a cogsci major + specialize in programming and try my luck at software development, or just dropping out in a few weeks to enroll in a community college.", "author": "YeastedSoybeans", "created": 1632352191, "upvotes": 2}, "hdvw4xd": {"link": "/r/college/comments/pt3ed1/i_fucking_hate_being_poor_and_i_wish_i_entered/hdvw4xd/", "text": "Graduating on time is not that big a deal. If you spend an extra semester or two in college to earn an in-demand college degree, that's totally fine.", "author": "clearwaterrev", "created": 1632341016, "upvotes": 0}, "hduzdqq": {"link": "/r/college/comments/pt3ed1/i_fucking_hate_being_poor_and_i_wish_i_entered/hduzdqq/", "text": "You should throw your current notion of \"on time\" out the window. Time is on your side now more than it will ever be. Just do what you want to do and don't worry how long it takes.\n\nSome people graduate \"on time\". Some people take a while to graduate. Some people drop out of school and return later before getting a degree. It really doesn't matter how long it takes.", "author": "sarcago", "created": 1632327544, "upvotes": 0}, "hdujft6": {"link": "/r/college/comments/pt3ed1/i_fucking_hate_being_poor_and_i_wish_i_entered/hdujft6/", "text": "One of my good friends majored in environmental science and makes about 120k a year, he’s only 27.", "author": "Spicybooiii", "created": 1632320989, "upvotes": 3}, "hdtqn98": {"link": "/r/college/comments/pt3ed1/i_fucking_hate_being_poor_and_i_wish_i_entered/hdtqn98/", "text": "- Go to community college.\n- Stop obsessing on graduating on time, you'll finish when you finish.\n\nI'm in my 4th year of CS and I still have two more years to go if all goes well.", "author": "ShadowIG", "created": 1632303826, "upvotes": 10}}}