{
  "sid": "qbvawp",
  "link": "/r/college/comments/qbvawp/how_do_i_connect_with_someone_i_wont_probably_see/",
  "title:": "How do I connect with someone I won’t probably see again?",
  "text": "I’ve been directed to this sub reddit so not sure if it’s right place or not.\n\nHey guys! \n\nI’m currently in university and about to complete my first year. Since going to university I’ve had to move two hours away and don’t know anyone that goes to my uni so I’ve just gone to classes and come home and studied. I would say I’m happy and my grades are really good however I’ve always felt like I need a good connection with someone. Over the year I haven’t really met anyone that I’ve connected with well however half way through this semester I found two people who I joined in with on lab classes. Great group and found I really fit in well with them. However these classes were only once a week and it obviously there wasn’t too much time to just chit chat. Now, the last couple of years hasn’t been too good for me regarding relationships especially romantic relationships, kinda got fucked over and wasted 2 years. I’ve always been the guy that knows a lot of people but I’ve never really been in a tight friend group so I kind of struggle with everything in that regard. I felt accepted straight away with these two people. The last week or so I keep thinking about this one girl and I haven’t felt that feeling in years. Things she does just keeps getting better. For example our last class was today and the lecturers wanted us to give feedback of the course on this online survey and she goes up to the head tutor and says thank you and explains that she has done a wonderful job of the course. I was amazed by this kind gesture, as the girls I’ve dealt with would never have done anything like that. I’ve befriended the other guy on Facebook and we’ve been debating about the whole covid situation (in a very friendly matter) over the past week. I was wanting to ask the girl for her number, Snapchat etc. but once again I never know how to bring it up and we left. Now my question is, is it weird if I ask the other guy if he has her Facebook, number, Snapchat etc? \n\nI should also add that I think she was flirting with me a little. What I’m trying to say is that I think she’s could also be into me aswell. \n\nP.s I’m really bad with names and I don’t know her name sooooo (it’s like that seinfeld episode lol)",
  "author": "Phelpsy2519",
  "created": 1634714659,
  "updated": 1634750253,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhc4kym": {
      "link": "/r/college/comments/qbvawp/how_do_i_connect_with_someone_i_wont_probably_see/hhc4kym/",
      "text": "No, I don't think it's weird.  Just ask.",
      "author": "time2trouble",
      "created": 1634715447,
      "upvotes": 3,
      "replies": {
        "hhc4qdd": {
          "link": "/r/college/comments/qbvawp/how_do_i_connect_with_someone_i_wont_probably_see/hhc4qdd/",
          "text": "How though I don’t know her name 😐",
          "author": "Phelpsy2519",
          "created": 1634715577,
          "upvotes": 1,
          "replies": {
            "hhc4v3t": {
              "link": "/r/college/comments/qbvawp/how_do_i_connect_with_someone_i_wont_probably_see/hhc4v3t/",
              "text": "Can you describe her well enough for him to figure out who you're talking about?",
              "author": "time2trouble",
              "created": 1634715689,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}