{
  "sid": "r3gnme",
  "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/",
  "title:": "My professor assaulted me and I feel so frightened",
  "text": "Hello I am a college student in my last years and everything has been going downhill recently. In my psychology class, there is a professor who made me feel uncomfortable in the class. Each time, she looks at me in a strange seductive way that really gets on my nerves. It just feels uncomfortable dealing with a woman in her mid-thirties who keeps stalking me throughout the class and watches me at times. She seems to be very focused on me most of the time in the classroom and it feels awkward. None of the kids in class notice this as that she does it when nobody looks, between class breaks and even during test times. I come to class , try to do my work and pay attention but again, she keeps trying to flirt with me so much. I don't know how to deal with this anymore because it is hard when there's absolutely no help. Nobody believes me and there isn't proof to explain it to others. The worst day happened recently when I went to meet my professor in the office hours for an assignment. I was discussing with her about it and I felt a bit confused about the assignment that she gave. The weirdest thing happened when she got close to me sexually. I felt her breasts close up on my face as she was near me and I got up to walk away as it started getting awkward. She instead grabbed my arm and told me to sit down. I didn't feel comfortable dealing with this and I tried to leave but she grabbed me and forced me against the wall. This professor started threatening to fail me for the entire course if I was going to tell anyone what was happening between me and her. I felt honestly very scared and just afraid as that she does have some higher connection within the college itself that I am in. She forcefully held me against the wall and started to grab my crotch and kiss my neck everywhere. The worst part is when she started grinding her buttocks on my genitals and felt aroused. I felt aroused and I didn't want this to happen. It felt so gross and she still did this forcefully over and over again. I kept feeling so aroused that it was out of my control. I ended up ejaculating on myself after this and she kept repeating the same thing all over again until my penis and body started to hurt badly. I felt so disgusted and violated like a piece of shit and it felt horrible.  She threatened me to fail and expose my penis if I told someone this. I ran out of there feeling worthless. I never felt like this in my entire life and it hurt badly. I don't even know what to do as that she's very close with the dean and faculty in the school. So many thoughts are racing through my head and it feels so real. Sorry but it's just so many emotions that I am experiencing and I don't know what the hell to do...",
  "author": "hopefulhammock0383",
  "created": 1638029466,
  "updated": 1638206761,
  "over_18": false,
  "upvotes": 1187,
  "upvote_ratio": 0.92,
  "comments": {
    "hmadvl0": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmadvl0/",
      "text": "Report it to the Dean and campus police. The longer you wait the more difficult it will be.",
      "author": "1976Raven",
      "created": 1638030437,
      "upvotes": 1072,
      "replies": {
        "hmal7ju": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmal7ju/",
          "text": "He says the teacher is very close to the dean. He might also want to look for some bigger or governmental entity. He should seek out sex abuse hotlines that might have better info too",
          "author": "coldblade2000",
          "created": 1638033635,
          "upvotes": 395,
          "replies": {
            "hmam66f": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmam66f/",
              "text": "That shouldn't matter.  He can also go above the Dean to the President, VP, or provost of the school or to the State Board of Education but he needs to follow the proper path and escalate as needed or they will ask why it wasn't reported first to the dept below them.",
              "author": "1976Raven",
              "created": 1638034041,
              "upvotes": 209,
              "replies": {
                "hmdir2j": {
                  "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmdir2j/",
                  "text": "THIS u/hopefulhammock0383 do not be afraid because of her connections with the dean. Someone has to know about this.",
                  "author": "Paesana",
                  "created": 1638083828,
                  "upvotes": 20,
                  "replies": {}
                }
              }
            },
            "hmekyqu": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmekyqu/",
              "text": "The dean isn’t going to risk his or her career for a professor. Tell multiple people — multiple authority and law enforcement figures. Document everything",
              "author": "molossus99",
              "created": 1638110789,
              "upvotes": 8,
              "replies": {}
            },
            "hmb7w7k": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb7w7k/",
              "text": "True. Try the school ombudsman.",
              "author": "ACaffeinatedWandress",
              "created": 1638043114,
              "upvotes": 36,
              "replies": {}
            }
          }
        },
        "hmb69j6": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb69j6/",
          "text": "Campus police ain’t exactly the move. They exist to protect the school legally, not actually help",
          "author": "carebarry",
          "created": 1638042434,
          "upvotes": 97,
          "replies": {
            "hmb7zyb": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb7zyb/",
              "text": "Most campus anything are like that, unfortunately. It is best to not fall into the university bubble world.",
              "author": "ACaffeinatedWandress",
              "created": 1638043157,
              "upvotes": 33,
              "replies": {
                "hmbmh7f": {
                  "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbmh7f/",
                  "text": "All police are like that. Not just campus police.",
                  "author": "CoalOrchid",
                  "created": 1638049274,
                  "upvotes": 15,
                  "replies": {
                    "hmbp141": {
                      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbp141/",
                      "text": "Okay but in this situation the campus police have more to lose so to speak, its their employer that would suffer consequences if this gets out. The regular police have nothing to lose or gain here and are way more likely to act appropriately.",
                      "author": "taybay462",
                      "created": 1638050401,
                      "upvotes": 13,
                      "replies": {
                        "hmbpar7": {
                          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbpar7/",
                          "text": "No it’s literally the exact same situation as it always is with cops. \nActually being helpful does nothing for them but put them at risk/ make them do paperwork. There is no incentive to help anyone. Which is why they often don’t or actually just make things worse.",
                          "author": "CoalOrchid",
                          "created": 1638050516,
                          "upvotes": -6,
                          "replies": {
                            "hmc6yyo": {
                              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc6yyo/",
                              "text": "No its not literally the exact same situation lol. This is a known thing, that in the case of sexual assault there is a much higher chance of something being done if its reported to regular police first rather than university police. Im not the biggest fan of police in general and I know they have no duty to actually help people, but sometimes they do. Obviously.",
                              "author": "taybay462",
                              "created": 1638058438,
                              "upvotes": 1,
                              "replies": {
                                "hmc9fzu": {
                                  "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc9fzu/",
                                  "text": "\"Regular\" police have no jurisdiction, the campus police do.  When I was younger I worked on campus and had similar happen to me with a coworker and it had to be reported to campus police.",
                                  "author": "1976Raven",
                                  "created": 1638059577,
                                  "upvotes": 0,
                                  "replies": {
                                    "hmcaqec": {
                                      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcaqec/",
                                      "text": "Thats just not true. Regular police can and do respond to sexual assaults that happen on campus. What you said is just a lie perpetuated to prevent that exact thing from happening, regular police being involved and pressing charges.",
                                      "author": "taybay462",
                                      "created": 1638060167,
                                      "upvotes": 5,
                                      "replies": {
                                        "hmcc3z4": {
                                          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcc3z4/",
                                          "text": "Not based on my personal experience. Campus police have primary jurisdiction on campus.",
                                          "author": "1976Raven",
                                          "created": 1638060807,
                                          "upvotes": -1,
                                          "replies": {
                                            "hmce077": {
                                              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmce077/",
                                              "text": "Sure. But that doesnt mean regular police *cant* respond. There is a nationwide issue of campuses covering up/not prosecuting sexual assault. If you report it to campus police its likely it wont lead to any conviction or justice. Thats more likely to happen with regular police because as I said, its not their employer that will look bad.",
                                              "author": "taybay462",
                                              "created": 1638061709,
                                              "upvotes": 2,
                                              "replies": {
                                                "hmciggj": {
                                                  "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmciggj/",
                                                  "text": "This debate is also super specific to what school you’re at. I went to a college that did not have campus police. We had unarmed security and you could report rapes to them and they would report to title IX and suggest you call the police or you could call the police and they would investigate even tho campus security technically had “jurisdiction”.",
                                                  "author": "LowElectrical9168",
                                                  "created": 1638063814,
                                                  "upvotes": 2,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hmc95yb": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc95yb/",
              "text": "Campus police have jurisdiction over any crimes that occur on the property, they are the same as going to the local police for a crime that occurs elsewhere.",
              "author": "1976Raven",
              "created": 1638059447,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "hmbe8k6": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbe8k6/",
          "text": "There should be another higher up that deals in these situations that’s completely separate from those in academic departments. I forgot the name of the position but I know they work in the title IX office",
          "author": "Mystic_Pebbles",
          "created": 1638045707,
          "upvotes": 9,
          "replies": {
            "hmcjq1o": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcjq1o/",
              "text": "[deleted]",
              "author": null,
              "created": 1638064416,
              "upvotes": 0,
              "replies": {
                "hmcp8ux": {
                  "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcp8ux/",
                  "text": "Not at all. I have an ix coordinator at my school too",
                  "author": "Mystic_Pebbles",
                  "created": 1638067091,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmai60c": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmai60c/",
      "text": "Im really sorry this happened to you. Report it to your title ix office. Also I don’t know if your university has this, but some professors are trained to help students with sexual assault. If you have one that you have taken a lot and trust, you can also confide in them?",
      "author": "shesthenat",
      "created": 1638032321,
      "upvotes": 389,
      "replies": {
        "hmawqk4": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmawqk4/",
          "text": "I second this. Tell a trusted professor, Hall Director, even an RA. Those people are mandatory reports, so they will tell the police/title ix for you. If your school has a sexual assault prevention office (mine does) there are people there who AREN’T mandatory reports there so you can share your story and ask for help without them sharing if you don’t want them too.\n\nI’d recommend telling the police or title ix or reporting her somewhere though, sooner rather than later. I know it’s traumatizing and hard to talk about, especially when you’re a man. Sexual assault isn’t talked about enough when it comes to men, so it can be hard for men to come forward. I strongly encourage you to do so. Especially because she might do this to someone else too. If you report her, you could save someone in the future.",
          "author": "KaleidoscopeEyes12",
          "created": 1638038462,
          "upvotes": 110,
          "replies": {
            "hmbrtrs": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbrtrs/",
              "text": "> even an RA\n\nAs an RA, yes to this. At least at my university, we were trained to know trustworthy title ix people in the school to contact and how to talk people through experiences like this. If there is an RA that you trust, I would highly recommend confiding in them.",
              "author": "lazyeff0rt",
              "created": 1638051639,
              "upvotes": 28,
              "replies": {}
            }
          }
        }
      }
    },
    "hmakffx": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmakffx/",
      "text": "I haven't been on campus in so long, so I will let the others give you advice on what to do when reporting this vile woman but\n\n>I felt aroused and I didn't want this to happen.\n\n\n I know you feeling aroused during this horrible ordeal was distressing, but our bodies are designed to respond to touch. Just because you felt arousal does not mean you wanted this to happen. Please don't beat yourself up over this. \n\nIs there someone you trust you can speak to? Can you call your mom or dad?",
      "author": "SystemOfADowneyJr",
      "created": 1638033298,
      "upvotes": 357,
      "replies": {
        "hmao94l": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmao94l/",
          "text": "came here to say this. i can't imagine how difficult this is for you, but please truly try to not beat yourself up about it. human bodies and genitals specifically are meant to respond to anything sex-related, especially touch. just because your body responded does not mean you asked for it, wanted it to happen, or were okay with it. wishing you the best, OP.",
          "author": "-positive-camera-",
          "created": 1638034905,
          "upvotes": 105,
          "replies": {}
        },
        "hmazmsi": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmazmsi/",
          "text": "This. There are plenty of SA stories in which the victim feels guilty about being aroused/getting off because they feel like that somehow means they wanted it. If you didn’t consent, that’s SA, no matter how your body responded. Our bodies aren’t always entirely in our control or in sync with our minds.",
          "author": "KaleidoscopeEyes12",
          "created": 1638039689,
          "upvotes": 87,
          "replies": {}
        }
      }
    },
    "hmaecf1": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaecf1/",
      "text": "expose you for what? sounds like she knows what she did and is guilty. I think your title ix office would believe you and you should report it to them asap",
      "author": "LowElectrical9168",
      "created": 1638030648,
      "upvotes": 635,
      "replies": {
        "hmbzt52": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbzt52/",
          "text": "If this story is real, sure, but all OP has posted in their 15 day history has been a vague question about math majors and then this same copypasta on several subs including this one. They already have 650 karma, seems like there's a strong case for this post simply being a karma-farming attempt, unfortunately\n\nEdit: after further investigation, OP may be an alt of u/KaleidoscopeEyes12, who has replied multiple times in this thread and gotten over 100 karma, and has a female avatar but seems to defend men's rights, which is odd, and only done by certain groups of people (either men disguised as females or pick-me girls)",
          "author": "Kool_Kollege_Kid",
          "created": 1638055230,
          "upvotes": 94,
          "replies": {
            "hmcq80s": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcq80s/",
              "text": "When I can look back at your comment history and see many downvoted posts, maybe it's a sign that you shouldn't be accusing other Reddit users of wrongdoing. Besides, in a case like this where one is need of immediate assistance, someone might post to multiple subreddits in the hope that one post won't get ignored and they can get the advice they need.",
              "author": "starlitsuns",
              "created": 1638067571,
              "upvotes": 36,
              "replies": {
                "hmdv9su": {
                  "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmdv9su/",
                  "text": "“Immediate assistance”-lmao the first thing OP does is post it on Reddit. Their story just seems either fabricated or just doesn’t make sense in general",
                  "author": "Dark-Blade",
                  "created": 1638093499,
                  "upvotes": 1,
                  "replies": {
                    "hme1ut5": {
                      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hme1ut5/",
                      "text": "Wouldn't say the same thing if this was a girl, would you?",
                      "author": "Bhriguvanshi_07",
                      "created": 1638098742,
                      "upvotes": 8,
                      "replies": {
                        "hme7150": {
                          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hme7150/",
                          "text": ".",
                          "author": "usagi_in_wonderland",
                          "created": 1638102760,
                          "upvotes": 0,
                          "replies": {}
                        },
                        "hmeibp9": {
                          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmeibp9/",
                          "text": "I would lmao. Doesn’t matter either way, the story seems off in some parts",
                          "author": "Dark-Blade",
                          "created": 1638109401,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hmc188y": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc188y/",
              "text": "??? This is definitely not me who originally posted this, although should I be flattered that you think I’m OP? Not sure. And I’m not a man, though I’m not sure how to prove it to you. Also not a pick me girl, I have no need to be? I wasn’t “defending men’s rights” in my previous comments. I was saying that SA is awful and as little as it gets talked about for women, it’s talked about for men even less.\n\nAlso, I commented multiple times because I’m a college student home for thanksgiving break with literally nothing better to do than get overly invested talking to people on reddit\n\nEdit: I can’t type lmao",
              "author": "KaleidoscopeEyes12",
              "created": 1638055860,
              "upvotes": 67,
              "replies": {
                "hmc3c8o": {
                  "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc3c8o/",
                  "text": ">though I’m not sure how to prove it to you\n\nWell, there are many ways, none of which are necessary though so don't bother",
                  "author": "TrekkiMonstr",
                  "created": 1638056807,
                  "upvotes": 33,
                  "replies": {
                    "hmcbsao": {
                      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcbsao/",
                      "text": "Hey thanks man. You got a point",
                      "author": "KaleidoscopeEyes12",
                      "created": 1638060655,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hmc82f5": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc82f5/",
              "text": "Really weird you think that people can’t defend men’s rights or men who have been sexually assaulted unless they’re pick me girls or pretending to be women. Disgusting assumption, especially on a thread of men being sexually assaulted given that it’s so much harder for men to speak out, especially against an authority figure.",
              "author": "DynamicHunter",
              "created": 1638058939,
              "upvotes": 46,
              "replies": {
                "hmcw86m": {
                  "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcw86m/",
                  "text": "I think he saw red flags in the post, like I did, and went down the thread of comments to see if anybody pointed one of them out before pointing out his research. I also was a bit confused by how a teacher who had sexually assaulted him against his will could “expose his penis”. How would she have any pictures of his penis to expose? None of that makes any sense unless there are many details being left out. Also, why would a student who feels uncomfortable with the flirtatious nature of their teacher towards them in class feel comfortable enough to go to one on one office hours with that same instructor? A lot of this doesn’t make sense to me.",
                  "author": "chrisrayn",
                  "created": 1638070556,
                  "upvotes": 25,
                  "replies": {}
                }
              }
            },
            "hmc6ivv": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc6ivv/",
              "text": "Would you say that men who are feminists are pick-me’s??",
              "author": "Tricky_Divide_7523",
              "created": 1638058238,
              "upvotes": 15,
              "replies": {}
            },
            "hmc8c5g": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc8c5g/",
              "text": "Congratulations detective, you’ve wasted your time",
              "author": "czarcasticjew",
              "created": 1638059059,
              "upvotes": 8,
              "replies": {}
            },
            "hmd27rv": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmd27rv/",
              "text": "honestly its really messed up how you dont believe victims.",
              "author": "crazyacting",
              "created": 1638073663,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hmaoa6c": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaoa6c/",
      "text": "as others recommended, contact police THEN school. as sad as it is, i’ve seen colleges cover up cases similarly and try to settle matters in private so their public reputation is not damaged. either in person or by email when contacting the school mention “i have already contact local authorities”, not only will they see that cannot settle your case in private, they will know how extremely serious you are about the entire ordeal. \n\ni’m really sorry you had to go through this. i can hardly imagine.",
      "author": "mustydusterman",
      "created": 1638034918,
      "upvotes": 81,
      "replies": {}
    },
    "hmaicdb": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaicdb/",
      "text": "please find out who to report her to, and report her immediately",
      "author": "blossom_2416",
      "created": 1638032400,
      "upvotes": 53,
      "replies": {}
    },
    "hmam5nt": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmam5nt/",
      "text": "This is a tough situation. I would recommend that you go to your county police and NOT the school first. If you were to consult anyone at the school, don’t go the dean of your department or something. Request a meeting with as high up as you can go. I’m talking the President. Go in person and ask their secretary or whomever you need to get through to see them. Schools are businesses and can be corrupt by nature, so start bigger rather than people who are more likely be close to them. However, before any of that, please talk to someone. This is much more traumatic than you think right now. You were sexually assaulted, OP. By someone in a position of power at a place that is supposed to be safe. I’m sorry this happened to you. Remember, though. If you talked to someone at school, by law (Title IX) they will have to report it. I hope you’re okay and remember it is never your fault.",
      "author": "UncookedLemonade",
      "created": 1638034035,
      "upvotes": 115,
      "replies": {}
    },
    "hmb1stx": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb1stx/",
      "text": "You were sexually assaulted.\n\nReport this as soon as you can, both to the police and the university. This person will leverage their authority to do this again unless challenged. You did **nothing** wrong. Feeling aroused is a natural response, even though this was clearly not okay.\n\nBeyond reporting this, I advise you to reach out to any mental health services available to you. Presumably your university has some sort of support network for students.\n\nI'm so very sorry this has happened to you. Well done for speaking up, even if it is \"just\" here.",
      "author": "Elastichedgehog",
      "created": 1638040607,
      "upvotes": 35,
      "replies": {}
    },
    "hmak2fn": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmak2fn/",
      "text": "Report ASAP. The longer you wait the longer the process will be",
      "author": "Johnkapler1890",
      "created": 1638033143,
      "upvotes": 29,
      "replies": {}
    },
    "hmaifm0": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaifm0/",
      "text": "Police and School right now",
      "author": "abetternamethanthat",
      "created": 1638032438,
      "upvotes": 73,
      "replies": {}
    },
    "hmainez": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmainez/",
      "text": "Report her to the dean or any other higher authority. If she is not reported now, god forbid, she may do it to someone else.\n\nAnd in the meantime, stay strong and know that your voice will be heard.",
      "author": "CaptainLab",
      "created": 1638032530,
      "upvotes": 21,
      "replies": {}
    },
    "hmassxy": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmassxy/",
      "text": "File a police report first and foremost. Then report it to your dean (or VP, president, whoever you can) as soon as you can. She is trying to scare you into keeping quiet, but her threats are empty— she can’t fail you if she’s fired. And your safety is more important than a class, anyway, no matter how vital that grade is. Situations like this are difficult because it’s really hard to get proof (as you mentioned), but it’s so important that you still try to report it anyway for your safety.\n\nAs a student who has studied this topic, please know that your arousal was not your fault. Most human brains are wired for sexual stimulation, which means we can get aroused by things even when we don’t consciously want to. You getting sexually stimulated by her forcing herself on you means nothing other than the fact that your natural brain/bodily responses function properly. You did not want it.\n\nI’m so sorry this happened to you. Situations like this can be deeply traumatizing. Please take care of yourself by getting any help that you need— whether that be professional emotional support, or just surrounding yourself with friends and family. Avoid her class. It’s not worth it. And remember that this is not by any means your fault. You did not encourage her or beckon her onto you. \n\nIt is not your fault.",
      "author": "lazyeff0rt",
      "created": 1638036798,
      "upvotes": 20,
      "replies": {}
    },
    "hmblama": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmblama/",
      "text": "Faculty here.  You need to report this to *the police*, and only afterward to your school's Title IX office.  A school's Title IX office is *not* a law enforcement agency and has comparatively little real authority.  If what you have written is true, your professor needs to be investigated, arrested, and prosecuted by actual law enforcement and the actual judicial system, not your university's Title IX bureaucrats.  Reporting this to the police and then to your university is the quickest way to get the woman out of the classroom and away from other people.  If you only report it to the school, it could take months for some kind of \"investigation\" to occur.\n\nI'm sorry you had this experience.  I know it's not something you expected to have to deal with, but please get the actual police involved.  You'll be helping to ensure that this woman doesn't do this to anyone in the future.\n\nBest of luck.",
      "author": "ChemMJW",
      "created": 1638048757,
      "upvotes": 18,
      "replies": {
        "hmdelp6": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmdelp6/",
          "text": "I agree, pursue the case with law enforcement first. Can't stress everything said here enough. And police would not be campus police, that's a private force, report to the actual police force of your town/county/city/state.\nThen you can report it to your school just so it's reported once with them but the actual investigation is a lot more significant and consequential than a school's \"internal investigation.\"",
          "author": "dame_de_chien",
          "created": 1638081043,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hmahdij": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmahdij/",
      "text": "report to your school and the popo",
      "author": "OlympicAnalEater",
      "created": 1638031977,
      "upvotes": 45,
      "replies": {}
    },
    "hmacqx4": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmacqx4/",
      "text": "Your school probably has a hotline for this. Also I'd get the law involved as well. Itll probably be more difficult since the suspect is a woman and not a man but its doable",
      "author": "elkfn2",
      "created": 1638029929,
      "upvotes": 65,
      "replies": {
        "hmambfp": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmambfp/",
          "text": "Yes, I’d say go to the town/state police if you’re worried about her connections to the university",
          "author": "mkay_ultra",
          "created": 1638034103,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hmarny3": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmarny3/",
      "text": "Do the opposite of what your instincts are telling you to do.  You are probably inclined to keep it as a secret.  Report it to anyone and everyone.  File a police report.  Maybe there are other students who have experienced the same thing and are scared to speak up.  You are likely not the only one.",
      "author": "Traditional_Self_658",
      "created": 1638036323,
      "upvotes": 12,
      "replies": {}
    },
    "hmacqtv": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmacqtv/",
      "text": "Go to your dean of students/head of student life and report this immediately.",
      "author": "joebeau5403",
      "created": 1638029927,
      "upvotes": 35,
      "replies": {}
    },
    "hmanemh": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmanemh/",
      "text": "I'm so sorry this happened to you that is a horrible experience to have anywhere. Reporting her to the police and title XI office will hopefully prevent it from happening to anyone again.",
      "author": "ky_loren16",
      "created": 1638034550,
      "upvotes": 10,
      "replies": {}
    },
    "hmamrfh": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmamrfh/",
      "text": "In this case, it is likely you are not the first or the last person this has or will happen to. Most colleges and universities will have ways that you can report this. Additionally, campus/local police can help you start the legal process",
      "author": "Aureilius",
      "created": 1638034288,
      "upvotes": 10,
      "replies": {}
    },
    "hmaoh47": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaoh47/",
      "text": "There is a good chance your school has a support service for sexual assault survivors. They are people you can talk to, and who can help you out with all of your questions and tell you your options.",
      "author": "Coloradical27",
      "created": 1638034999,
      "upvotes": 6,
      "replies": {}
    },
    "hmb3quv": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb3quv/",
      "text": "You need to report this ASAP. Reach out to the Dean. What a disgusting professor",
      "author": "awesomecytoplasm",
      "created": 1638041401,
      "upvotes": 7,
      "replies": {}
    },
    "hmb2jft": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb2jft/",
      "text": "My school did a great thing a few years ago where above nearly every urinal and in every stall, they stickered a flowchart on what to do to get help with harassment. Everyone has it memorized. One thing it emphasizes is you can report this to different channels simultaneously. It's not like you talk to your Title IX coordinator, wait for a meeting, then report it to the police, then wait to sign a statement, then report it to the Provost (or your school's equivalent of \"boss of all faculty\")...you can do all these things simultaneously.\n\nBecause stories in the news necessarily focus on school failures, there's a perception of crookedness that, in fact, is pretty rare. Title IX officers are required by federal law to be independent. Religious advisors take their 1st amendment rights as seriously as their, well, rites. But deans, department heads, and HR have no formal singular obligation to you and sometimes make well-intentioned terrible decisions because their obligations often work at cross-purposes. That's another reason to learn about your different reporting options and how they vary in terms of confidentiality, processes they may trigger, etc. \n\nDM me, OP, if you'd like a copy of that flowchart I mentioned. And know that none of this is your fault and any reporting steps you decide to take are about protecting both yourself and the potential next person. Your professor by their actions has forfeited any gentleness on your part.",
      "author": "dcgrey",
      "created": 1638040913,
      "upvotes": 5,
      "replies": {}
    },
    "hmbtmz3": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbtmz3/",
      "text": "Ok two things\n\n1. This reads like a fake fantasy\n\n2. If it is real, this is way above Reddit’s pay grade and should really be dealt with elsewhere",
      "author": "shawnglade",
      "created": 1638052462,
      "upvotes": 38,
      "replies": {
        "hmca9ah": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmca9ah/",
          "text": "The fact people are believing the bullshit... It reads less like a personal account of what happened and more like a story told in the 1st person. Way too many details usually = lying, most people don't remember many details from truly traumatic events.",
          "author": "Aringhet",
          "created": 1638059949,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "hmarqk7": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmarqk7/",
      "text": "Report to title IX immediately",
      "author": "Inf3rnalis",
      "created": 1638036351,
      "upvotes": 4,
      "replies": {}
    },
    "hmas8nv": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmas8nv/",
      "text": "Look up your schools title nine office. It’s a federal program and if your school wants to keep a hold of their federal funding they will investigate. Usually if not always it’s a 3rd party brought in that has no affiliation with the school in order to be a non-bias as possible. \n\nTitle nine doesn’t fuck around, and I’m so sorry this happened to you. It’s completely unacceptable and predatory. Please report this and seek counciling",
      "author": "DoorBuster2",
      "created": 1638036560,
      "upvotes": 4,
      "replies": {}
    },
    "hmbfncv": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbfncv/",
      "text": "jeez man that was hard to read. i'm so sorry, she's a monster for doing that, please report her to the title ix office",
      "author": "AV8ORboi",
      "created": 1638046304,
      "upvotes": 4,
      "replies": {}
    },
    "hmdjrh8": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmdjrh8/",
      "text": ">I felt her breasts close up on my face as she was near me and I got up   \nto walk away as it started getting awkward. She instead grabbed my arm   \nand told me to sit down. I didn't feel comfortable dealing with this and  \n I tried to leave but she grabbed me and forced me against the wall.   \nThis professor started threatening to fail me for the entire course if I  \n was going to tell anyone what was happening between me and her. \n\nIf this indeed happened, then definitely file an incident report ASAP. An investigation will take place, and at the minimum, you'll be protected from potential retribution from said professor.\n\nBut your description sounds very over the top. I've seen cases before of students with mental disorders fantasizing on this sort of things to the point of believing it happened. If that's the case, then your institution can recommend professional help.\n\n>She forcefully held me against the wall and started to grab my crotch and kiss my neck everywhere. I ended up ejaculating on myself after this and she kept repeating the same thing all over again until my penis and body started to hurt badly.\n\nAnd like you said, there is a lack of eye witnesses, which by itself is very strange.\n\n>None of the kids in class notice this as that she does it when nobody looks, between class breaks and even during test times.  Nobody believes me and there isn't proof to explain it to others.",
      "author": "AcademicDifficulty",
      "created": 1638084522,
      "upvotes": 5,
      "replies": {}
    },
    "hmdptg0": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmdptg0/",
      "text": "Smash her",
      "author": "Impressive_Stuff_908",
      "created": 1638089162,
      "upvotes": 4,
      "replies": {}
    },
    "hmbjzj8": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbjzj8/",
      "text": "I’ll take “things that didn’t happen” for 200 points.",
      "author": "Aquill98",
      "created": 1638048180,
      "upvotes": 38,
      "replies": {
        "hmbzjcd": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbzjcd/",
          "text": "It reads like some deviant art users wet dream.",
          "author": "Aringhet",
          "created": 1638055108,
          "upvotes": 23,
          "replies": {
            "hmcc4xv": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcc4xv/",
              "text": "a mEn'S rIgHtS loser planting this as \"evidence\" of rampant female on male sexual assault.",
              "author": "KarenPuncher",
              "created": 1638060820,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "hmczet9": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmczet9/",
          "text": "Agreed. The story about cumming on himself was the giveaway. Still a funny story nonetheless",
          "author": "lildudefromXdastreet",
          "created": 1638072162,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hmcbxny": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcbxny/",
      "text": "bullshit.",
      "author": "KarenPuncher",
      "created": 1638060725,
      "upvotes": 11,
      "replies": {}
    },
    "hmal2m0": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmal2m0/",
      "text": "You could talk to her about it through something like email. If she doesn't deny something or accidentally gives credibility to another of your claims, you can then protect yourself from her turning the rape accusation on you",
      "author": "coldblade2000",
      "created": 1638033575,
      "upvotes": 6,
      "replies": {}
    },
    "hmaw6p6": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaw6p6/",
      "text": "Your school has a Title IX office.  Go there.  They will help. Also, go to the police.  This was illegal, this was sexual assault (regardless of gender!), and I'm very sorry this happened to you.",
      "author": "mindiloohoo",
      "created": 1638038229,
      "upvotes": 3,
      "replies": {}
    },
    "hmb2c7y": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb2c7y/",
      "text": "I’m so sorry this happened to you. That is absolutely disgusting what she did. I really hope things get better for you.",
      "author": "robertbchatham",
      "created": 1638040831,
      "upvotes": 3,
      "replies": {}
    },
    "hmbtlep": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbtlep/",
      "text": "It's not your fault. The sooner you file a police report, the more likely evidence and testimony will be intact.\n\nTell some family or friends you trust, reach out to the school and police after you tell someone and write down and document what you can remember so you can keep your story consistent.\n\nYou will get through this, and if there isn't any justice like when I was asaaulted, know that you will heal",
      "author": "EvilPandaGMan",
      "created": 1638052443,
      "upvotes": 3,
      "replies": {}
    },
    "hmcbobs": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcbobs/",
      "text": "Do you have ANY proof that you can use to back up your story?  This is 100% wrong on so many levels but it’s going to come down to he said/she said and sexual assault is (unfortunately) rarely taken as seriously as it should be. This woman needs to be arrested and fired so this does t happen to anyone else (or you) ever again. My suggestion would be to start documenting EVERYTHING. Only contact her through traceable methods (email). Record meetings. Send her an email saying you feel wrong about what she did to you (detail explicitly what happened and make sure it’s clear that you did not want or enjoy anything that happened) and keep her replies documented. It’s going to SUCK but you need to take control and not let her take advantage of you. I’m sorry. Being sexually assaulted is awful and I hope you take her all the way down.",
      "author": "taconight81",
      "created": 1638060604,
      "upvotes": 3,
      "replies": {}
    },
    "hmajh6n": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmajh6n/",
      "text": "Thought I was on the after dark sub for a second",
      "author": "Zenist289",
      "created": 1638032891,
      "upvotes": 12,
      "replies": {}
    },
    "hmbj4jp": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbj4jp/",
      "text": "OP, I am so sorry this happened to you. Assuming you’re in the US, your school should have a title IX office that you can contact. They can help provide resources and will support you if you choose to press charges. They will also ensure that she can’t fail you for reporting. If you need help finding them, PM me. \n\nA lot of people here will push you to report - that is **your choice.** You don’t have to report if you don’t want to, but I do think you should ask to speak anonymously with your title IX office and someone you trust before deciding not to. \n\nThere are plenty of online resources that could help you too.\n[RAINN](https://www.rainn.org/) can help you understand the laws in your state and has a free help hotline. They can also help you navigate the title IX office at your school. \n\nAnd OP - arousal during sexual assault is unfortunately [very common](https://livingwell.org.au/managing-difficulties/sexual-assault-and-arousal/). It doesn’t mean that you somehow wanted what was happening. It doesn’t mean that she misunderstood. I encourage you to reach out to counseling or someone that you trust.",
      "author": "Kikirox98",
      "created": 1638047797,
      "upvotes": 4,
      "replies": {}
    },
    "hmb05za": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb05za/",
      "text": "I'm sorry that this happened to you and that you have to deal with this added stress. Ultimately this is your decision to make based on what you think is best. If you want to report it (I strongly recommend that you do) you should reach out to your school's Title IX office. They will take a report and begin an investigation. You could also file a reort with your RA, RD, or any other mandated reporter on your campus (although if I was in your shoes I'd go right to the Title IX office). In addition to the Title IX office you could make a report to campus police for a criminal investigation. If you make a report the professor won't be able to fail you. \n\nThe other option is to not make any report of this. If you don't report it there is no way that the professor will be held accountable. This behavior is deplorable and I would strongly recommend that you report it. If you don't you should still find someone to talk to about this (a psychologist, counselor, etc).",
      "author": "Nosleep_9764",
      "created": 1638039915,
      "upvotes": 2,
      "replies": {}
    },
    "hmb4rbz": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb4rbz/",
      "text": "i know you may not want that situation to happen again but you might need to get recorded evidence if any kinds even just a voice note might work of how she’s speaking to you. maybe you can really tell someone you trust and won’t make you feel “less of a person” or victim blame your for the incident happening. also ejaculating when being assaulted/ groped might happen even if you don’t want it to happen. it feels as if your body is betraying you and also makes the abuser seems as if they’re actually giving you pleasure which is also not good. \ni hope that you can confide in someone because  i couldn’t imagine my friends dealing with something like this alone.\n\nhopefully she doesn’t have tenure",
      "author": "shitshow-",
      "created": 1638041818,
      "upvotes": 2,
      "replies": {
        "hmb53jj": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb53jj/",
          "text": "She actually does have tenure. She has been teaching for years",
          "author": "hopefulhammock0383",
          "created": 1638041955,
          "upvotes": 3,
          "replies": {
            "hmbav7h": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbav7h/",
              "text": "that really sucks cause now she has experience, colleagues backing her, and all the classes she’s taught and “nothing” out of the ordinary popping up. \n\nif the actual police don’t help which i’m certain they won’t be much help then it’s best to catch her again with your phone and make sure she doesn’t know until you have copies. this sounds like something so difficult to maneuver around cause she can easily fail you and you’d have to take the class again and no one would think anything of it. i’m so sorry this is happening to you. \n\neven if you get evidence showing you’re being victimized and there is a clear power dominance at play it’s likely that without physical evidence ( bruises /marks )  the police could send you away",
              "author": "shitshow-",
              "created": 1638044332,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hmb4xim": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb4xim/",
      "text": "If you tell the appropriate dean or other campus authority and they do nothing, I'm sure the student paper would be very happy to publish an anonymous article on your behalf.",
      "author": "Quantum_Aurora",
      "created": 1638041888,
      "upvotes": 2,
      "replies": {}
    },
    "hmba9yl": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmba9yl/",
      "text": "If you choose to report, go to local law enforcement. Not campus police, they work for and report to the school. You can report to your schools title ix entity as well, they decide whether they will complete an in internal investigation or not. \n\nReporting or not can be a difficult decision even without threats of what would happen if you do.",
      "author": "BamSlamThankYouSir",
      "created": 1638044087,
      "upvotes": 2,
      "replies": {}
    },
    "hmbdyav": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbdyav/",
      "text": "Report her to the dean and your advisor and simultaneously call the actual police and file charges and request a restraining order. Campus police work for the university and therefore any higher ups who are friendly with this professor, the real police do not. It's not going to be a pleasant experience, but filing a police report and getting a restraining order shows it's serious and also takes power out of the hands of the university. It also sets up a legal paper trail so that if you're retaliated against you have proof and can file suit. \n\nRefuse to speak to anyone in person without witnesses you can trust, try to only communicate through email so you create a paper trail. If you live on campus try to back everything up off campus or in the cloud. Document everything.\n\n Sit down now with a calendar and document every incident to the best of your recollection, all the details such as times, witnesses if any, her words, her actions. Everything. A detailed written record like carries a lot of weight in court. \n\nAbsolutely do not wait or let your fear of her retaliating stop you. She's already escalating and she's 100% counting on you being to afraid to report her. She may not have as much influence as she's suggesting, especially if you control the narrative and report to outside authorities that the university can't protect her from. Honestly if it gets too thorny for them, the university is more likely to throw her to the wolves than protect her. She's a young professor with no tenure so she's expendable. \n\nAnd absolutely remember none of this is your fault. You don't deserved to be assaulted and harassed.",
      "author": "Silaquix",
      "created": 1638045590,
      "upvotes": 2,
      "replies": {}
    },
    "hmbgg5w": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbgg5w/",
      "text": "Report to the Title IX officer",
      "author": "SlightScholar1",
      "created": 1638046645,
      "upvotes": 2,
      "replies": {}
    },
    "hmc0e3v": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc0e3v/",
      "text": "You can file a Title IX report and the university will investigate.\n\nI'll be pragmatic here and answer this very frankly. Yes this person should be fired and in jail or rehab. The university and police have a very formal process though and it's important to understand what is required so you can make it happen. Evidence wise, the school is going to use the preponderance standard which means whichever is more likely. They will need to show there is a >50% chance she did this. There is definitely the possibility they will fire her with the evidence they can get as of this moment, it isn't a safe bet though. If you can get more evidence the chance of this happening will shoot up dramatically. Criminal charges would also be possible.\n\nPersonally I would handle it a bit differently. Sexual assault cases are notoriously hard to prove and you don't think there is any evidence. On the contrary there might be some evidence that is just not yet discovered: you two might have been seen by a stray hallway camera or a witness may have heard the conversation for example. But you should not assume Title IX will just get lucky and find enough of it. My suggestion, if you think she will do something again, is to start turning on audio recordings when you are around her. That would help the university have enough evidence to terminate her which is the result you should be trying to get. You would file the Title IX after she attempts to do something again and you get the audio. The advantage of waiting a little bit is that you can be prepared and catch her in the act -- the Title IX complaint will probably spook her and make her very cautious. If you cannot handle being around her, just file the Title IX now and they will move you to a different class. Title IX in general will protect you regardless of if you report this tomorrow, in two weeks, or two months. It's the same thing with how the police report you will file is treated minus statute of limitations (typically you can report something years old though).\n\nAny evidence you can collect or go back and find would be useful. These sort of people are awful and it's important you provide everything you can to the university so there is a high chance she will be fired and not be able to continue doing this. You are helping yourself here but also other students that she could target in the future so it's important to start building a good case. I would also write down the factual details now like locations, times, events, etc. At the end of the day you and everyone on this subreddit wants her fired and arrested. Catching her in the act on tape is the easiest way to get a slam dunk case.\n\nNext time she attempts to touch you, you need to physically defend yourself and run away. Catching her trying to do this again is a lot to ask and very intense mentally speaking after what you went through. Being able to stand your ground and control the situation is necessary. Also I would never ever recommend this approach if you could not do that or were too mentally traumatized to be exposed to those advances again.",
      "author": "darniforgotmypwd",
      "created": 1638055481,
      "upvotes": 2,
      "replies": {}
    },
    "hmbp46t": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbp46t/",
      "text": "Ok set up the bait. You have to do it again but record it. Turn on the voice memos to record on your iPhone and go to her office. Record the conversation. That will take her down. If you try to file now it might be your word versus hers, and the dean might believe her. You have to start compiling evidence before you take the actions. She would have to confess to the dean but she might deny, deny, deny. Take her down",
      "author": "Away_Peak_5054",
      "created": 1638050437,
      "upvotes": 5,
      "replies": {}
    },
    "hmc55we": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc55we/",
      "text": "Drop the school and ill make a bot to spam all their faculties emails about it until something is done.   \n\n\nThis is never okay",
      "author": "Sweaty-Station4086",
      "created": 1638057624,
      "upvotes": 4,
      "replies": {}
    },
    "hmbdemc": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbdemc/",
      "text": "You should just smash and get the A",
      "author": "TheFoodWhisperer",
      "created": 1638045367,
      "upvotes": 6,
      "replies": {
        "hmbquoy": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbquoy/",
          "text": "Honestly I would",
          "author": "mexicandemon2",
          "created": 1638051199,
          "upvotes": 21,
          "replies": {
            "hmdzdmi": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmdzdmi/",
              "text": "I think 95% of males would",
              "author": "NoreDavis",
              "created": 1638096852,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hmczc2a": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmczc2a/",
          "text": "Honestly, he already busted a nut, might as well smash at this point.",
          "author": "lildudefromXdastreet",
          "created": 1638072122,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hmblv6w": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmblv6w/",
      "text": "How do I get this problem",
      "author": "MoneyManMase",
      "created": 1638049005,
      "upvotes": 5,
      "replies": {}
    },
    "hmc7t03": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc7t03/",
      "text": "Wish this would happen to me",
      "author": "JewishFingerBukkake",
      "created": 1638058822,
      "upvotes": 3,
      "replies": {}
    },
    "hmaptgc": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaptgc/",
      "text": "I'm so sorry that this happened to you. That's absolutely disgusting that she did this. I understand how you feel- I've had my own experiences with sexual abuse as well. I know it's terrifying, but just know none of this is your fault. Absolutely none of it. I'd say you should report it to the police and find a lawyer if you can. \n\nAs for the many trolls I've seen in this comment section that have just made me ill, don't waste your time on them. I've also had people try to invalidate what's happened to me. There are unfortunately people out there who are like that, and they don't deserve even a second of your time. \n\nJust remember that this wasn't your fault. I think it'd also be a good idea to search for a therapist too so that you can have help with healing. Good luck to you. I hope you can get the justice you deserve and, over time, heal.",
      "author": "AhsokaStark",
      "created": 1638035554,
      "upvotes": 2,
      "replies": {}
    },
    "hmbgvrv": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbgvrv/",
      "text": "Dude just smash her jeez",
      "author": "icedcoffeeblonde",
      "created": 1638046830,
      "upvotes": -4,
      "replies": {
        "hmdzcfp": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmdzcfp/",
          "text": "Clown world bro...clown world",
          "author": "NoreDavis",
          "created": 1638096823,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hmcbr4l": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcbr4l/",
      "text": "Humm, dam it! Where those back in my day! I always wanted to smash some of my teachers. Anyway, if you don't feel comfortable with her advancement, you should file a complain. I know most of dudes would just smash the teacher, but we are talking about you, and you should not let anyone use its position of power to take advantage of you.",
      "author": "droneswithai",
      "created": 1638060640,
      "upvotes": -1,
      "replies": {}
    },
    "hmdntqp": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmdntqp/",
      "text": "I really feel sorry this happened to you I hope you won't blame yourself it's definitely not your fault I probably won't be able to give a good advice because I don't live in Ur country and I have no idea how the law there is.. but I wish you won't stay silent because you deserve justice and a proper apology",
      "author": "mimoogreat",
      "created": 1638087545,
      "upvotes": 1,
      "replies": {}
    },
    "hmduqhw": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmduqhw/",
      "text": "Report her not only to the department chair, and the title ix office, or to the RA, but to the authorities, because a crime was committed. Please keep us updated, and so sorry for what you had to go through.",
      "author": "RubenMuro007",
      "created": 1638093068,
      "upvotes": 1,
      "replies": {}
    },
    "hmdwkhw": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmdwkhw/",
      "text": "Report it to the police/dean or VP.\n\nAlso, how the hell did you even manage to get hard, let alone cum, in such a stressful situation?",
      "author": "MrStealYourFrog",
      "created": 1638094521,
      "upvotes": 1,
      "replies": {
        "hmf5fl3": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmf5fl3/",
          "text": "Lol 😂",
          "author": "Impressive_Stuff_908",
          "created": 1638119897,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hme229w": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hme229w/",
      "text": "Call the actual police. Campus police will just protect the uni",
      "author": "Zyrobe",
      "created": 1638098898,
      "upvotes": 1,
      "replies": {}
    },
    "hme2e3f": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hme2e3f/",
      "text": "Get an audio recorder on your phone and leave it in your pocket when another one of these situations arises, you'll need proof if she has connections.",
      "author": "VegetativeOsmosis",
      "created": 1638099164,
      "upvotes": 1,
      "replies": {}
    },
    "hme8xo4": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hme8xo4/",
      "text": "Call the Local Police not the University Police or the Dean. This is far beyond their reach at this point",
      "author": "XConejoMaloX",
      "created": 1638104027,
      "upvotes": 1,
      "replies": {}
    },
    "hmegwqf": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmegwqf/",
      "text": "Im really sorry this happened to u. U were sexually assaulted and its not ur fault, she did it and knew it was wrong so she should face the consequences. Report it and if ur afraid no one will believe u, try to record ur conversation next time u talk to her or whenever u see her approaching u. It’ll be evidence just in case no one believes (while they have no reason not to). \n\nAlso feeling aroused isnt something u have any control over and doesnt mean that ur attracted to her or her disgusting shit.",
      "author": "_hunnybunnyx",
      "created": 1638108656,
      "upvotes": 1,
      "replies": {}
    },
    "hmem030": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmem030/",
      "text": "Record audios.",
      "author": "Oriolys",
      "created": 1638111301,
      "upvotes": 1,
      "replies": {}
    },
    "hmemxn2": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmemxn2/",
      "text": "Her behaviour is 🤬🤬 APPALLING! This is fully dependent on the state you live in but if she flirts with you in the future try to have a way to record her or the conversation. The reason I say it's dependant on the state is that some states have a two party consent law which means both parties must consent to have a conversation recorded. New York, for example is a ONE party consent state. If there's a friend you trust (believe me, I know it's hard to discuss situations like this) perhaps they could hang around when class let's up? It would help having a witness in order to keep you safe. Perhaps there are other students who have experienced her behaviour in the past?\n\nAbusers always try to use their power/social status to isolate someone but that's the thing, there will always be power in numbers.\n\nThis is not your fault at ALL. She should seriously be ashamed of herself 😡",
      "author": "OperationAdulting",
      "created": 1638111759,
      "upvotes": 1,
      "replies": {}
    },
    "hmeodpb": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmeodpb/",
      "text": "I don’t know if every uni works this way but please go to your dean. Hope everything turns out ok man.",
      "author": "DumplingsandDynamics",
      "created": 1638112463,
      "upvotes": 1,
      "replies": {}
    },
    "hmeotsq": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmeotsq/",
      "text": "Record as much as possible and get police involved. Find as much as you can and even make sure you can record any meetings. Even if you have to hide your phone on you then do it that way. I’m sorry for what happened to you but you have to go out and talk to as many people as possible to get help. Don’t let anyone tell you to keep it on the low bc that’ll never work. Tell the dean and campus police and local police, get a lawyer and everything. It might be hard and you’ll feel embarrassed but trust me that you’ll have people to protect you that way. We’re here for you man.",
      "author": "BigLizardBrain",
      "created": 1638112679,
      "upvotes": 1,
      "replies": {}
    },
    "hmf6sde": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmf6sde/",
      "text": "U got this bro! We got ur back if shit goes down!",
      "author": "MissAriiArnold",
      "created": 1638120451,
      "upvotes": 1,
      "replies": {}
    },
    "hmbncrn": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbncrn/",
      "text": "This might not be what most people recommend, but go to whatever LGBTQ Resource Center there is at your school and report the professor to them. It may seem like a weird thing to do, but those working there will fight tooth and nail for the students, they kind of have to bc most of the people who need them already face discrimination from the school and maybe even their family. So go to the LGBTQ Resource Center. They will not let it go. They will escalate it and make a damn scene to the administration if they're not listened to.",
      "author": "Britty_LS",
      "created": 1638049663,
      "upvotes": -2,
      "replies": {}
    },
    "hmcragi": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcragi/",
      "text": "I'm sorry to hear about this man. But if shes hot, I'd personally go for it. You can go to the campus police and/or dean. But dude, this is the perfect opportunity to pull an A+ with literally no effort",
      "author": "menglish025",
      "created": 1638068094,
      "upvotes": -4,
      "replies": {}
    },
    "hmaveew": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaveew/",
      "text": "[removed]",
      "author": null,
      "created": 1638037899,
      "upvotes": -2,
      "replies": {
        "hmavja2": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmavja2/",
          "text": "I went  for my assignment",
          "author": "hopefulhammock0383",
          "created": 1638037956,
          "upvotes": 0,
          "replies": {}
        },
        "hmb6a13": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb6a13/",
          "text": "What a fucking horrible person you are",
          "author": "fruitninja777",
          "created": 1638042440,
          "upvotes": -3,
          "replies": {}
        }
      }
    },
    "hmbmehq": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbmehq/",
      "text": "File a police report",
      "author": "lazairiaw",
      "created": 1638049240,
      "upvotes": 0,
      "replies": {}
    },
    "hmcgdwm": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcgdwm/",
      "text": "Call the police. That’s sexual assault. Do that before contacting school officials. Get into contact with a counselor if possible as well",
      "author": "CampadLovesSpace",
      "created": 1638062841,
      "upvotes": 0,
      "replies": {}
    },
    "hmcqfql": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcqfql/",
      "text": "This is staright up rape , just call the police already",
      "author": "Embarrassed_Ear_1146",
      "created": 1638067677,
      "upvotes": 0,
      "replies": {}
    },
    "hmalpj7": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmalpj7/",
      "text": "[removed]",
      "author": null,
      "created": 1638033846,
      "upvotes": -10,
      "replies": {
        "hmansqm": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmansqm/",
          "text": "Your comment is just insulting",
          "author": "AhsokaStark",
          "created": 1638034716,
          "upvotes": 6,
          "replies": {}
        },
        "hmaoiha": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaoiha/",
          "text": "you are a terrible person",
          "author": "alarmedGoose",
          "created": 1638035014,
          "upvotes": 6,
          "replies": {}
        },
        "hmaluqy": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaluqy/",
          "text": "This actually happened to me. My English isn't really good",
          "author": "hopefulhammock0383",
          "created": 1638033907,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmhy8t2": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmhy8t2/",
      "text": "Stop being a bitch.",
      "author": "Hot_Platypus_3337",
      "created": 1638163483,
      "upvotes": 1,
      "replies": {}
    },
    "hmaql0u": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmaql0u/",
      "text": "Beat and delete and maybe just maybe she will give you the best grades",
      "author": "ElLiS-_-",
      "created": 1638035876,
      "upvotes": -23,
      "replies": {}
    },
    "hmavp7v": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmavp7v/",
      "text": "https://www.itsonus.org",
      "author": "Triggyrd",
      "created": 1638038027,
      "upvotes": -6,
      "replies": {}
    },
    "hmamr5n": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmamr5n/",
      "text": "[removed]",
      "author": null,
      "created": 1638034285,
      "upvotes": -9,
      "replies": {}
    },
    "hmbnn1m": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbnn1m/",
      "text": "Oh honey, this is sexual assault. You did nothing wrong at all, darling. I'm so sorry this happened and is happening to you. Please tell someone. I'm here if you need to talk, seriously.",
      "author": "LizzipuBethiepie",
      "created": 1638049787,
      "upvotes": -5,
      "replies": {}
    },
    "hmcs4hz": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcs4hz/",
      "text": "counter offer she passes u and you dont report it to the police",
      "author": "ciggywet",
      "created": 1638068504,
      "upvotes": -4,
      "replies": {}
    },
    "hman21j": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hman21j/",
      "text": "[removed]",
      "author": null,
      "created": 1638034410,
      "upvotes": -5,
      "replies": {}
    },
    "hmap2hn": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmap2hn/",
      "text": "If you feel safe enough to, report her.",
      "author": "_theatre_junkie",
      "created": 1638035241,
      "upvotes": -2,
      "replies": {}
    },
    "hmb54hy": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb54hy/",
      "text": "That just sounds messed up.",
      "author": "Imaginary_Ad4795",
      "created": 1638041966,
      "upvotes": -2,
      "replies": {}
    },
    "hmbb50w": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbb50w/",
      "text": "I am so sorry that this is happening to you. Please report it, and don’t feel threatened by the power they hold.",
      "author": "stef_unnie",
      "created": 1638044442,
      "upvotes": -2,
      "replies": {}
    },
    "hmbc0tf": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbc0tf/",
      "text": "I’m sorry that you went through this. I think police would be the best option, if she is close with the dream and stuff.",
      "author": "katsuboom",
      "created": 1638044801,
      "upvotes": -2,
      "replies": {}
    },
    "hmbqbuu": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbqbuu/",
      "text": "I'm sorry. You did not deserve this, and this is not your fault. There are resources if you need someone to talk to. Crisis Chat and things like that can be a great starting point. This should not have happened to you,  and you did nothing to deserve this",
      "author": "wolfy321",
      "created": 1638050967,
      "upvotes": -2,
      "replies": {}
    },
    "hmbtmxe": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbtmxe/",
      "text": "please report ASAP to the school and the police. im so sorry this happened to you",
      "author": "Storage-Informal",
      "created": 1638052461,
      "upvotes": -2,
      "replies": {}
    },
    "hmc3kle": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc3kle/",
      "text": "This is absolutely horrible and not your fault. Get the police and the dean involved immediately",
      "author": "arath2802",
      "created": 1638056913,
      "upvotes": -2,
      "replies": {}
    },
    "hmc63v2": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc63v2/",
      "text": "Go to the police then to your title ix office, don't meet up with her by yourself if possible or if you have to, have some way to record it, also contact a lawyer or something, you have legal rights and the school will most likely try to shut you down.",
      "author": "Jimmjam_the_Flimflam",
      "created": 1638058052,
      "upvotes": -2,
      "replies": {}
    },
    "hmcj4l3": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcj4l3/",
      "text": "I would simply skip over anyone on campus and go to the local police department and file charges.  Then the Dean can't cover it up.",
      "author": "hal4253",
      "created": 1638064135,
      "upvotes": -1,
      "replies": {}
    },
    "hmckofd": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmckofd/",
      "text": "I’m so sorry this happened to you OP. Go to the police first and then report it to the college. None of this is your fault and this situation should be dealt with before it happens again. If you are worried about your grade then don’t. It’s just a scare tactic that most predators use to manipulate their victims from reporting them. Similar to a predator telling someone they will kill their family if they tell anyone that they assaulted them. Chances are your not the only student she had done this to. Legally the college has to file a report if you make a sexual assault complaint to them that happened on campus. Also do not go to any of her future classes and don’t speak to her. Talk to a counselor and the college and see if you can transfer to a different class.",
      "author": "SchlapaBtch",
      "created": 1638064867,
      "upvotes": -2,
      "replies": {}
    },
    "hmc92gh": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmc92gh/",
      "text": "Report her! If the school tries to push back that’s retaliation which is never okay. You are entitled to learn in a nurturing environment, not one that takes advantage of its students. I would honestly suggest any future situations to not be alone with her (if you can), and to try and get recordings of the conversations between the two of you (if you are in the US check your state laws on whether you need her consent to record or not). Please PLEASE report this behavior. I believe your Title IX office should have some resources for you too.",
      "author": "QueenLatifahClone",
      "created": 1638059400,
      "upvotes": -1,
      "replies": {}
    },
    "hmcfw7y": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmcfw7y/",
      "text": "Please report this asap",
      "author": "Turbulent-Rip-5370",
      "created": 1638062608,
      "upvotes": -1,
      "replies": {}
    },
    "hmb5678": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb5678/",
      "text": "also for the people saying report it to the police. campus police do not give a fuck about this shit, especially if it’s not a woman. they’ll most likely tell this person to either so you therapy or do nothing which is the worst part. she probably has done this so many times before if she’s so comfortable doing it so openly and quick to fail",
      "author": "shitshow-",
      "created": 1638041985,
      "upvotes": 0,
      "replies": {
        "hmb7ux7": {
          "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmb7ux7/",
          "text": "we mean the real police, not campus",
          "author": "blossom_2416",
          "created": 1638043099,
          "upvotes": 1,
          "replies": {
            "hmba088": {
              "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmba088/",
              "text": "i thought anything college related had to go through campus police first?  campus police do a great job at silencing a lot of situations like this could happen on campus. sorry about that mixup though",
              "author": "shitshow-",
              "created": 1638043974,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmbr059": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmbr059/",
      "text": "Talk to someone first like a close friend or RA so when you report it officially to police or the dean you have others to back you up. It makes it harder to report things officially if you have never talked about it outside of the report. Also, bodies react to touch, many people have even had orgasms when they are assaulted. Im sorry you had to go through something so wrong, it is not your fault any of this happened. Your professor is wrong and deserves to rot.",
      "author": "RatatouilleFiend",
      "created": 1638051267,
      "upvotes": 0,
      "replies": {}
    },
    "hmd66iv": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmd66iv/",
      "text": "Go to the Title IX office that your university has (if you’re located in the US)",
      "author": "One_Lawfulness9101",
      "created": 1638075830,
      "upvotes": 0,
      "replies": {}
    },
    "hmd6adb": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmd6adb/",
      "text": "I’d say call the police as an anonymous witness. Or call to your parents, drop the class, and leave. Or the third option is sue the school. \n\nYou don’t have to put up with it. It wasn’t your fault so don’t fight yourself over it. This teacher is violating her trust and abusing her authority over you. This is sexual harassment and molestation, she should be fined and arrested. That is not how professional behaves. I’m sorry you have to go through that. Hope you find solace and get away from that toxic individual as far as you can. Hope this can help.",
      "author": "Limepoison",
      "created": 1638075891,
      "upvotes": 0,
      "replies": {}
    },
    "hmdk6uj": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmdk6uj/",
      "text": "911",
      "author": "Brushermans",
      "created": 1638084823,
      "upvotes": 0,
      "replies": {}
    },
    "hmduq77": {
      "link": "/r/college/comments/r3gnme/my_professor_assaulted_me_and_i_feel_so_frightened/hmduq77/",
      "text": "Hilarious post, i r8 8/8 m8/",
      "author": "tacoplayer",
      "created": 1638093062,
      "upvotes": 0,
      "replies": {}
    }
  }
}