{"sid": "n37oe3", "link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/", "title:": "The semester is ending. Please formally review your professor.", "text": "I saw a post asking folks to use Rate My Professor at the end of the semester. If you’re like me, you weren’t given a choice what professor you got for a certain class so this isn’t really a helpful tool. \n\nMost schools have formal review surveys called “Professor Evaluations” that they ask folks to do at the mid term and the end of the semester. These are extremely helpful for the professor, administrators and future students. They are anonymous and the professors don’t see the results until after they submit a grade. Administration looks at these reviews when deciding to rehire adjunct professors and during tenure review for full time professors. If you’re experiencing a truly awful teacher this can also add to a paper trail when you report them. \n\nThroughout my schooling, My professors have had to beg students to fill them out and they get low responses. This sucks because it’s really a great way to commend great professors and chastise shitty ones. \n\nIf you’re unsure if your school has this review system in place, it’s most likely in your student portal. You can also email the academic department or registrar. \n\nPlease review your professors in a way that counts.", "author": "iamsavsavage", "created": 1619966384, "retrieved": 1632947226, "over_18": false, "upvotes": 1373, "upvote_ratio": 0.98, "comments": {"gwsmk83": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwsmk83/", "text": "the last week of classes and the site pops up the survey every time I log in. It only goes away if you do the survey. I always turn in all my work before I take the survey. I wish you could take the survey the week after classes end so that you know it doesn't affect your grade.", "author": "alcohall183", "created": 1620056796, "upvotes": 1}, "gws7ruh": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gws7ruh/", "text": "Also, don't forget to do this for the good ones too!", "author": "erice3r", "created": 1620050257, "upvotes": 1}, "gwrweu5": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwrweu5/", "text": "I teach at a university, and I encourage all of my students to use the feedback methods provided.\n\nOne thing I will add is that whether your experience was positive or negative, include specific, actionable statements.  \"Dr. FreakyBlueEyes was the best professor EVAR!!!!\" is sure nice to hear and makes me feel good, but it doesn't actually help me improve.  The same goes for \"Dr. FreakyBlueEyes is actual a demon in human skin.  I'm pretty sure I saw him eating a live baby on the way to class.\"  Not fun, but also not helpful (and usually makes me feel like you're angry about your grade, which may or may not be my fault.)\n\nHowever, if I get comments like \"The material on the tests was nothing like the homework,\" or \"The way XYZ was explained made no sense to me,\" or on the other side \"When we did ABC activity, that helped me to connect with the material,\" I now have things to work with.  I can go back and review what I did and maybe focus more on something good and/or adjust something bad.  Of course, it's a balance and one comment out of 75 might not get much change.  In particular, if I have about an equal number of students saying that quizzes were too hard and too easy, then there's a solid chance things are about right (and factors outside of student feedback matter, too.)\n\nTL;DR: Absolutely do use your voice, just do so in a way that gives detail and examples.", "author": "FreakyBlueEyes", "created": 1620044642, "upvotes": 3}, "gwrmyxc": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwrmyxc/", "text": "I'm pretty sure many other students complain about the same professor. Do they do anything about it and hire another one? No. There is no other one. Same o'l same every damn semester. Not wasting my time of there is no change, year after year. There is a shortage of good profs. A crappy prof knows they r crappy. They don't care to change that.", "author": "Letmetellyouabtlyfe", "created": 1620038653, "upvotes": 1}, "gwqrwwj": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwqrwwj/", "text": "Most of my professors gave us a ten minute block during class of free time and asked us to fill them out during that time if we could! Others offered incentives like 2 extra points to everyone on the final if 100% of the class filled them out (classes cap at 35 at my university so it’s not impossible) and yet there are still people who don’t fill them out. I’d be interested to see how many people actually fill out course evals.", "author": "onebigoof", "created": 1620013086, "upvotes": 2}, "gwqr6st": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwqr6st/", "text": "Every school I’ve been to has course evaluations. One of my professors made it an extra credit opportunity. We got 1 point for sending her the completion page", "author": null, "created": 1620012632, "upvotes": 1}, "gwqc42k": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwqc42k/", "text": "No", "author": "Iredditztoo", "created": 1620004061, "upvotes": -3}, "gwq9szf": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwq9szf/", "text": "I got 20 extra credit points for reviewing my English professor.", "author": "galsandgamers42", "created": 1620002795, "upvotes": 3}, "gwq9r6i": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwq9r6i/", "text": "It's the best when they offer extra credit for evaluating the prof / course.", "author": "sgRNACas9", "created": 1620002767, "upvotes": 2}, "gwq4ar5": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwq4ar5/", "text": "At my school at the end of every semester the school sends out assessments for students to do on their professors and the course. I cannot wait to do it for my math professor. She is the worst teacher I have ever had in my life and I already did ratemyprofessor for her a few weeks ago.", "author": "Sola_Fide_", "created": 1619999790, "upvotes": 2}, "gwpxkhf": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwpxkhf/", "text": "Important to do the formal review of course but rate my professor could still be useful for those later on, especially if another professor gets added. Or at the very least they know what to expect even if there's no choice.", "author": "Gj_FL85", "created": 1619996154, "upvotes": 3}, "gwpoqi3": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwpoqi3/", "text": "My school told us that administration cannot see the comments, but can see the scores. Comments can only be viewed by professors. Just a note, in case anyone else’s school has this (stupid) model!", "author": "Dogmama1230", "created": 1619991646, "upvotes": 2}, "gwpk9te": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwpk9te/", "text": "In my 4 years I have never done these because they close them out before finals.", "author": "KillingMyselfTonigh1", "created": 1619989438, "upvotes": 2}, "gwpeo6b": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwpeo6b/", "text": "I had just reviewed my professor and two days later she sent me an email asking me to do it and to not forget because it \"goes on her permanent record.\" And how much she really needed it. Honestly felt like she was guilt tripping me to do it because she was one of the worst professors ever and she knew we didn't like her. So, anyway, just wanted to come on and say if that happens to you, please write your review based on your opinion and experiences and don't get guilt tripped.", "author": "eveybryce", "created": 1619986661, "upvotes": 4}, "gwpcdwr": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwpcdwr/", "text": "It is important to base your evaluation on things that are in the professor's control. At large universities with a high rate of adjunct usage (part time professors hired on a very short term basis for low pay with no job security), the administration only looks at the numbers at the end of the term. It is beyond unfair for someone to loose their livelihood because no one likes virtual learning and rated them low, despite the instructor having no control of the university's decision not to hold in person classes, and very little control over the fact that virtual class are almost always less personal and engaging.", "author": "PoetryOfLogicalIdeas", "created": 1619985531, "upvotes": 17}, "gwpc2w8": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwpc2w8/", "text": "I don’t really like doing the evaluations.  Sometimes I find the questions irrelevant to the course.  One question asked us how the course helped in our critical analysis skills.  Unless the course is a logic course or is a course that challenges me by forcing me to write papers critiquing things I like or supporting things I dislike, then I’m giving you a low score.  \n\nI never know what to write in the comment box... usually I end up apologizing for being an asshole by challenging my professor so much by asking hard questions all the way up to outright defiance.  In the moment it’s enjoyable until I reflect and realize that I  probably hurt their feelings or made their job harder.", "author": "Counseling_grad", "created": 1619985384, "upvotes": -6}, "gwp4sgh": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwp4sgh/", "text": "fortunately, i got lucky and had pretty good professors. so i guess i'll be giving them good reviews", "author": "rthesoccerproj2", "created": 1619981859, "upvotes": 1}, "gwp3gci": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwp3gci/", "text": "I don’t think these do help the students in most cases. I’m POSITIVE the evil, despicable calc professor at my school has received countless bad SRT’s and he’s still an ass and still a main professor.", "author": "slatheryslab", "created": 1619981342, "upvotes": 5}, "gwp1lji": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwp1lji/", "text": "I'll probably get flack for this, but by the time the semester was over, about the last thing I wanted to do was spend any more time behind a goddamn screen filling out more goddamn bubbles. If profs were to give time during class to do it, I'd be more than happy to, but by the end of this semester in particular, I couldn't be bothered to", "author": "Suicidal-Lysosome", "created": 1619980614, "upvotes": 2}, "gwp18zi": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwp18zi/", "text": "I'm in a master's program with like 5 students per class. I'd rather not leave scathing reviews at the risk of being identified.", "author": "SisypheanDreamer", "created": 1619980487, "upvotes": 5}, "gwozbng": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwozbng/", "text": "🙄", "author": "Icy_Impress6331", "created": 1619979765, "upvotes": 1}, "gwovozz": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwovozz/", "text": "Professor here. I enjoy the feedback. I like to know what works, what I can improve on, where there was a disconnect. Please fill them out!! I know I read them!", "author": "Lexjude", "created": 1619978417, "upvotes": 4}, "gwoqezi": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwoqezi/", "text": "I just wish we could do them **after** the semester ends. Like all my professors pile drive me with assignments and then go \"hey, by the way, evaluate me!\"\n\nEvery semester, I honestly mean to do it. But if it's between studying for an exam, doing homework, or taking a quiz I'm going to prioritize doing one of *those* things.", "author": "EgyptianDevil78", "created": 1619976598, "upvotes": 209}, "gwol1a0": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwol1a0/", "text": "Ive been waiting since week 3 to review my Macro-Economics lecturer. Let me just say he is terrible. Every other economics lecturer is 9/10 or 10/10. I have no idea where they found this guy", "author": "astonaidan", "created": 1619974717, "upvotes": 3}, "gwogl3c": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwogl3c/", "text": "Are they really anonymous? From what I have heard, they can see who wrote them", "author": "-VFL-", "created": 1619972970, "upvotes": 0}, "gwodhxy": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwodhxy/", "text": "But also don't make it obvious who you are when you write your answers if you are going to say bad things unless you are graduating as there could be a chance of them figuring it out and having to see you again.", "author": "chocolatechipsims", "created": 1619971774, "upvotes": 4}, "gwodc72": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwodc72/", "text": "[deleted]", "author": null, "created": 1619971709, "upvotes": 8}, "gwoc1it": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwoc1it/", "text": "Yes please fill out your evaluations with SPECIFIC things you liked and didn’t like and specific suggestions.", "author": "Blackberries11", "created": 1619971186, "upvotes": 9}, "gwobdti": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwobdti/", "text": "Absolutely this! And make sure you are brutally honest about the instructors performance. You would be amazed at the number of amazing instructors who are either not given a promotion or are kept on because of a lack of evaluations, and on the flip side the number of awful instructors who are kept on for far too long or are promoted because of a lack of honest evaluations. More so than anything else, these are a great way to better your university.", "author": "squirrel8296", "created": 1619970927, "upvotes": 2}, "gwoapm3": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwoapm3/", "text": "I'm of two minds on formal student reviews, coming from the instructor side. All professors should be held accountable to how good of a job they do, and a good way of doing that is student ratings. In principle, it's a good system. \n\nThe issue is how it translates into practice. All these things serve to do at present is act as another form inequality between folks like me, who jump around from contract to contract (and the lack of security is why I'm leaving teaching forever after this term), and the tenured professors who do an absolute shit job, give zero fucks about students, and laugh at horrible reviews when they come in.\n\nObviously those aren't mutually exclusive. But anyone who is a contract instructor right now is very likely doing it out of passion, because let me tell you, they aren't doing it for literally anything else. When your employment is inherently precarious, and you care about students, you pour a lot of soul into it. Very rarely do you see a tenured professor give a flying fuck about improving pedagogy. They download all of that shit, like everything else, onto the poorly paid and temporarily employed instructors trying to cobble together a living.\n\nSomeone else made a comment about biased questions. I wouldn't be surprised if that was the faculty union imposing a temporary alteration to how the questions are asked because a lot of students this year will complain or argue their instructor didn't do enough when this year has been so fucked. It's been as difficult for us as it has for all of you. Asking questions about teaching methods might actually be more reflective of effort rather than just, \"did this sort of satisfy your desire to take an in-person class?\"\n\nJust two cents from the other side. Please review your professors, but just be aware that depending on who your professor is, it may or may not matter. Tenure is not a structure that benefits students in any meaningful way, and I think it needs to be radically rethought.", "author": "purple_ombudsman", "created": 1619970671, "upvotes": 30}, "gwoaaza": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwoaaza/", "text": "If possible, also be specific about them. This applies mostly if there is a place for you to write something. \n\nIf you just write \"this class sucks\" it'll accomplish nothing.\n\nIf you write things like \"I found assignments being posted on Monday and due Friday very challenging and would have very much appreciated them being posted at least the Friday before so that I could get started on them over the weekend\" you've given specific, actionable feedback.\n\nEdit: Also if there were things you particularly LIKED or found helpful, mention that as well. It will encourage them to keep doing the things.", "author": "jessamina", "created": 1619970513, "upvotes": 80}, "gwo8mvn": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwo8mvn/", "text": "[deleted]", "author": null, "created": 1619969855, "upvotes": 32}, "gwo58bu": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwo58bu/", "text": "If you're studying under a graduate student, comments are also incredibly helpful. When they apply for jobs, they have to provide their semester averages plus they can need to choose thoughtful, supportive comments for the hiring committee. The job market for professors is really horrible so every little edge helps.", "author": "drseachange", "created": 1619968557, "upvotes": 138}, "gwo388b": {"link": "/r/college/comments/n37oe3/the_semester_is_ending_please_formally_review/gwo388b/", "text": "I have always done this, as they made it a standard at both schools I have been. Either done on paper when in person, or online from an email link. And I have never used rate my professor to either choose professors or rate ones I took.", "author": "ld2009_39", "created": 1619967724, "upvotes": 228}}}