{"sid": "odn1a8", "link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/", "title:": "Accused of academic misconduct that I never did and I feel like I am losing the case here", "text": "I am a postgraduate student here. Apparently, I got accused of academic misconduct for coding (Collusion). The project is an individual assignment. The accusation is that I copied/shared my code with one of the undergraduate students which are from another course which I never did.\n\nThe lecturer told me to provide evidence to defend myself. So the first point I gave him is that he encourages us to use external resources on the internet and use his lecture to help with the coding and of course I have provided all the references that are not my own work when I submitted my work and gave it to him. Secondly, I have explained all my working steps for the code and how I reach my conclusion. The third point is that I have never posted my code anywhere on the internet or GitHub to be viewed or used or exchanged my work with anyone. The fourth point is that I have never discussed my work with my postgraduate friend let alone that I have never discuss it with undergraduate students. I know no one from the undergraduate course (even postgraduate course) and never have the opportunity to be in contact with them since I am working on my project alone from another country (Thailand and the Uni is in the UK). Therefore my main evidence or my defend is that I never worked or even talked to the person or anyone else about the project nad I know no one FROM undergraduate course.\n\nAfter I sent my defend to my lecturer, he said that he think there is not enough evidence and still think there are academic misconduct and have forward it to AM panel. URGHHH!! In the email, he said to find direct references for the similarity code and provide more evidence BUT I GAVE ALL MY EVIDENCE AND CANT GIVE MORE. and I was thinking if I provide the references that I never used in my code then I am committing poor academic misconduct that I never commit (poor academic misconduct = no references).\n\nSo at is point I don't know what to do.. should I provide the reference for the AM panel or not? should I stick to it since I am being honest with everything and I don't know what to do next and very stress about it since I have never copied or shared my work with anyone.\n\n&#x200B;\n\n EDIT1: just did my academic panel meeting today. From my perspective - I feel like I didn't do that well and didn't explain that good about my working out because one of the panels was looking confused and having a wtf face when I tried to explain my working/method of doing the work and giving the online resources. \n\nFrom the SU perspective - she said that I look confident when speaking about my method of doing the work and showing evidence, she said got nothing to worried about, everything is looking good. \n\nTomorrow the panel will email the result. hoping for the best. ", "author": "w4ng12", "created": 1625413586, "retrieved": 1632947851, "over_18": false, "upvotes": 749, "upvote_ratio": 1.0, "comments": {"h44l3ug": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h44l3ug/", "text": "Ask to see the full turnitin report. If your accounting of events is accurate, then the instructor is misinterpreting the report. Reading these reports correctly is a skill and some otherwise competent people just don't get it. For example, if you and the undergrad used similar sources for your work, that would produce a \"match\" of some percentage on the report; however, a percent match (even a 100%) does not prove anything at all. The context and details matter.", "author": "IndieAcademic", "created": 1625492024, "upvotes": 3}, "h44g5jh": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h44g5jh/", "text": "That is what the panel is for, you are not loosing the case. It's their decision on whether or not it is misconduct, not your professors. You will be okay", "author": "Noxious_1000", "created": 1625488714, "upvotes": 1}, "h443jr4": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h443jr4/", "text": "\"The heck? Your lecturer accused you. He has the burden of proof. He needs to have proof for his claim. If your lecturer were a prosecutor, the judge would throw this case out.\" (This is what I would say if the world was logical and reasonable)  \nOn a serious note, I feel you bro. Good Luck.", "author": "71NK-J", "created": 1625477487, "upvotes": 6}, "h42ygph": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h42ygph/", "text": "go to the dean, if not go to the guy above him, and if not there the head of the university. Ask to see exactly which parts are copied, and then do your best along with the sources you used to refute each case. Do not get heated, but do not back down. always remain in a posture of confidence, basically have the mindset that you are right, they made a mistake and you want them to fix their mistake.", "author": "bestjakeisbest", "created": 1625446581, "upvotes": 2}, "h42xaqx": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h42xaqx/", "text": "Dear Professor,\n\n  I understand I am being accused of collusion. As evidence that I have not interacted with other students, you are welcome to retrieve all of the logs from Zoom as well as our LMS and campus email. You will see that i have not interacted with any other students. Let me know what other sort of information you need to show that I have not colluded. I'm more than happy to coordinate with you and the IT department. \n\nLet's start a new email and copy the IT department to get the ball rolling on gathering information so you can get whatever is required to show I have not colluded on this assignment.", "author": "gelftheelf", "created": 1625445857, "upvotes": 20}, "h42x94f": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h42x94f/", "text": "You'll be fine as long as you have your story in order and have evidence to back up what you are saying. I feel that your lecturer is reaching for something to pop you on, but I'm sure they are going with a assumption because they saw a \"pattern\". Fight this BS and keep us posted.", "author": "Orkney_", "created": 1625445829, "upvotes": 3}, "h42jk6t": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h42jk6t/", "text": "tldr?", "author": "doubt__first", "created": 1625437787, "upvotes": -5}, "h42e0dk": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h42e0dk/", "text": "I have been on both sides of  this situation as both a student and teacher. I have been falsely accused, made incorrect accusations, and had students correctly charged with academic misconduct. This is my advice assuming you committed no misconduct.\n\n1. Present a positive attitude through the whole thing. Do not get defensive or accusational, it will upset people. You need faculty to see you in a positive light for them yo act in your favor. Faculty are not \"wrong\" and you are not \"right.\" Faculty \"may be mistaken\" and you \"did your best to follow the provided instructions.\" See? If your professor wants to escalate things do not fight him, just say you're sorry he sees things that way and you'll have to prepare your information for review.\n\n2. Get all your documentation together. All notes you made, all communication with faculty, syllabus and assignment rubric, etc. Have it all available to present your case. Only offer documentation when it is requested, dont drop 60 pages of material they don't want to read. If it is relevant it will be requested.\n\n3. Be completely honest and do not lie, people will be able to tell. Even if it is something that will get you in trouble, the lie is worse. Present things as they happened, do not exaggerate. Do not talk about things you heard from other people, only your experiences.\n\n4. Dont act like this professor and this panel are the final say in things, they are not.  If things do not turn out in your favor, do not throw a fit. Say you're sorry they came to that decision and start looking into the academic misconduct appeals process, your institution must make this public. You can either escalate the situation or do what I did and accept the 1 year of probation and after completing it charge the department with misconduct.", "author": "hdorsettcase", "created": 1625434790, "upvotes": 124}, "h42bwsw": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h42bwsw/", "text": "Defend in front of the panel, you'll win if you're in the right. I've seen it happen. Prof being dumb. Timestp your shit make your case stronger", "author": "ihaveanewusername", "created": 1625433697, "upvotes": 16}, "h42agbb": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h42agbb/", "text": "Hi, law student here. It’s their job to provide evidence saying you’re guilty, not yours to provide evidence you are innocent. They must prove it for you to be in trouble. If he tries to push it, ask for some sort of trial with your school. Don’t take the fall if you didn’t do anything wrong.", "author": "smm523", "created": 1625432959, "upvotes": 14}, "h42950k": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h42950k/", "text": "You should ask exactly what the concern is. They need to provide evidence you cheated and then you respond with your evidence, not the other way around.", "author": "GoldRequest", "created": 1625432274, "upvotes": 84}, "h428gz1": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h428gz1/", "text": "I would encourage you to keep your details as straightforward as possible. Dont add anything you didn't use and don't remove anything you did. The more consistent, the better. \n\nAlso, do you keep logs of when you worked? That my be useful.\n\nYour going to be ok bud, one issue to come up won't be the end of the world. You've worked really hard to get here.\n\nWe are routing for you!", "author": "sepiida_ink", "created": 1625431931, "upvotes": 215}, "h425x58": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h425x58/", "text": "Maybe if you use Git, you can provide every commit as an evidence the the code is yours.  \nBut the accusation that you shared the code still present.", "author": "EW_IO", "created": 1625430649, "upvotes": 39}, "h41zy0g": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h41zy0g/", "text": "\"Provide evidence to defend yourself\" ? Not how it works. They're grasping at straws. You'll be fine.", "author": "freshguy2002", "created": 1625427612, "upvotes": 135}, "h41uu9v": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h41uu9v/", "text": "Remember that you are innocent until proven guilty, go to the review board and present your evidence and then ask to see their evidence. If they refuse go to your Dean.", "author": "Remegar", "created": 1625425042, "upvotes": 45}, "h41r6f7": {"link": "/r/college/comments/odn1a8/accused_of_academic_misconduct_that_i_never_did/h41r6f7/", "text": "What evidence do they have?", "author": "drawdyzee", "created": 1625423224, "upvotes": 245}}}