{
  "sid": "q0pchi",
  "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/",
  "title:": "Help with emailing a professor.",
  "text": "This will be a long one, folks, hold tight, or just don't read.\n\nIn my class, we have these discussion posts every week through Blackboard because of online school. The first week we had to watch a 9/11 documentary (it had no dialogue it was just a compilation of videos of the towers throughout the day) and I got a point taken off for not citing timestamps in the video. The second week there were multiple questions, one stating “Chapter 1 discusses a few theorists on crime victims, which one do you subscribe to the most and why?” I then looked at the textbook, chose a THEORIST (which is presumed to be a person), and then explained why I was most compelled by the theory they were associated with, along with adding components of the theory that brought me to my decision. I got a point taken off because he was “looking for me to define a theory you chose” (his exact words from his comment) and I got another point taken off for my responses not being 5 sentences “as stated in the syllabus” (also quoting his exact words in the comment to me). I emailed him about the first point he took off because he never asked to define the theory, just to pick a theorist we chose and why. I told him essentially what I just typed above and added that he was not very clear in what he expected of us from that question and I know other students wrote it the way I did as well. His response to me was,\n\n“In your reply to the question you need to argue in detail. Your argument would include components of the theory you chose as to why it is superior - in detail. Your reply needed more.”\n\nOK. Whatever. I dropped it and moved on. Have it your way then. However, I was looking at the syllabus this past week to see when our first exam was and I figured I would look at where he wrote in the syllabus that he wanted our responses to be a specific length and there was nothing. I’ve read it over multiple times now and had my boyfriend read it over as well and there is nothing stated in there saying that he wants our responses to be a certain length, the only thing that would indicate a certain “length” is that he stated that the discussion posts are essay questions, and nothing else.\n\nSo now I am pretty frustrated and I want to email him again about it because I could have an A in his class right now but he has been taking points off that I think are unnecessary and unfair at this point. This was 3 weeks ago now, though, so I do not know if it is worth bringing up because I have made the corrections he wanted and have been getting full credit, but I know there are still students who are getting points taken off for this when they shouldn’t be. I think it is extremely unprofessional to just be making up rules as you go along grading. In my email, I would say:\n\n“Hi Professor,\n\nI was looking at the syllabus to see the date of our first exam and was looking over other sections of the syllabus as well, and noticed that there is no part of the syllabus that states that you want our discussion posts to be five sentences in length, just that they are essay questions. I know the points that were deducted off of my score were a few weeks ago now and I have since then adjusted my discussion posts, but there is no part of the syllabus that would have indicated to me that I was doing anything wrong regarding the length of my responses.\"\n\nI really do not know how to continue this email because I would like to bring up that it is concerning to me that these deductions are now coming without a source backing it up to justify it and that I am not as concerned about my grade anymore (because I have the time and points to bring it back up to an A) as I am for other students and future assignments regarding deductions that are seemingly unfair. Any help would be appreciated.",
  "author": "wingnut4000",
  "created": 1633290799,
  "updated": 1634089632,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hf9xuvo": {
      "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hf9xuvo/",
      "text": "Do not do any of this. A single point is rarely of consequence. It is less an issue of consistency and more the professor encouraging you to respond a certain way. The single point deduction is simply an incentive to take their critique.",
      "author": "hdorsettcase",
      "created": 1633296590,
      "upvotes": 6,
      "replies": {}
    },
    "hf9rhvm": {
      "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hf9rhvm/",
      "text": "I really can't comment on the timestamp issue, although I'm not sure how else you would be able to meaningfully respond to a sequence of images.\n\nAs for the other stuff, you are focusing on specifics (FIVE SENTENCES!!!) rather than the substance of his critique:  your responses are not detailed enough.  If you named a theorist but didn't elaborate what they claimed, you have not completed the assignment to his satisfaction.  Likewise, I'm not sure four or fewer sentences constitutes an \"essay,\" as it is very difficult to say anything of substance in a response of that length.\n\nIt is perfectly reasonable to want to have a conversation about expectations, but this is an office hours conversation, not an email one.\n\nFinally, you don't start with an \"A\" and have points \"taken away.\"  Your professor's feedback seems consistent in that your work doesn't reach the standard of an \"A\" in his class, so I would encourage you to approach this conversation as advice for ways to bring your work to an \"A,\" not to contest the \"points he took from you.\"\n\nAlso, ignore all of the inevitable student responses telling you email the Dean about this violation of your human rights, because they are wrong and dumb.",
      "author": "Judythe8",
      "created": 1633293935,
      "upvotes": 5,
      "replies": {
        "hf9vron": {
          "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hf9vron/",
          "text": "I never said that I started with an “A,” I said that I would have an “A” if he didn’t take points off for something that he stated is in the syllabus but is not. As in, if he reconsidered the deduction for making a mistake in his critique, it would be the difference between an “A” and a “B” for me. \nSecondly, the “substance of his critique” was not given until after I emailed him for not clarifying— I did elaborate on what the question asked me which is why I emailed him. The question asked about “theorists,” a person, not to “define a theory,” which is what he apparently wanted after the fact. \nI get having another professors back, but if all you are on here to do is shit on students who have actual issues (like your comments seem to show), maybe this isn’t the career for you. Not every student is grasping at loose ends or trying to manipulate professors into getting the grade they want. This is concerning to me as a student regarding his ethical behavior and the use of his authority.",
          "author": "wingnut4000",
          "created": 1633295703,
          "upvotes": -1,
          "replies": {
            "hf9xlax": {
              "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hf9xlax/",
              "text": ">So now I am pretty frustrated and I want to email him again about it because I could have an A in his class right now but he has been taking points off that I think are unnecessary and unfair at this point\n\nThere's nothing \"unethical\" about his behavior, and you are, indeed, grasping at straws now.  I encouraged you to speak to this professor directly, and gave you advice on how to go about it.  If your strategy here is some kind of a \"gotcha\" to have him restore points to you that you think were unfairly taken away from the \"A\" you feel entitled to, I think you are going to be unsuccessful.  \n\nI've given you good advice, in a very neutral tone, and your response is a tantrum.  \"You should find another career!!!!\" is this sub's go-to when students don't like responses from professors.  Is it possible you're not ready for college, if you can't wrap your mind around the idea that an essay is more than several sentences, and that you have to clarify what you're referring to in an essay response?",
              "author": "Judythe8",
              "created": 1633296474,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hf9wcxb": {
          "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hf9wcxb/",
          "text": "As a student I completely disagree with your argument here. It’s entirely a semantic issue if the professor is taking points away when he is citing his own syllabus for the deduction and that information cannot be found there. \n\nOP provided info on what was needed for the theorist question. If it does not say to elaborate on their theories then OP shouldn’t have points deducted. As for sentences OP said there wasn’t anything in the syllabus stating it as a requirement, so why deduct points? Also you can make perfectly fine and sophisticated responses with 3-4 sentences.\n\nProfessors are, supposedly, highly qualified for their role. They are responsible for holding professional and consistent standards for students. They need to and should state everything they expect and require. If not then yes, they should be reported for an unorganized and unprofessional environment for their students. \n\nAs I can see from your post and comment history, you target students and are very negative towards them in general. You’re putting yourself in a position where you cannot see issues from the scope of the people you teach. You should be ashamed of the way you speak in this profession. \n\nI suppose some students can certainly be wrong and dumb, but professors can be too! \n\nAlso, checkout your rate my professor and tell me how that’s doing. 😉",
          "author": "FANG_999",
          "created": 1633295956,
          "upvotes": -1,
          "replies": {
            "hfa0e5k": {
              "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfa0e5k/",
              "text": "Of course you disagree, but there is nothing \"targeting\" or \"negative\" in my response to OP.   You're not engaging with the content of my post, though.\n\n>OP provided info on what was needed for the theorist question. If it does not say to elaborate on their theories then OP shouldn’t have points deducted. As for sentences OP said there wasn’t anything in the syllabus stating it as a requirement, so why deduct points? Also you can make perfectly fine and sophisticated responses with 3-4 sentences\n\nWe don't have the syllabus, but according to the professor's feedback, the OP did not provide enough detail to earn an \"A.\" I honestly do not understand how one could argue in favor of one theory (or theorist, whatever) without explaining that theory.  Again, you're also stuck on the misbelief that professors \"take points away\" rather than assigning grades on the basis of what the student submits.\n\nI'm not addressing the rest of your post because it's childish and not relevant to this conversation.",
              "author": "Judythe8",
              "created": 1633297680,
              "upvotes": 1,
              "replies": {
                "hfaufpn": {
                  "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfaufpn/",
                  "text": "I really think you are too hung up on this “point” phrase. My professor literally stated in his comments, “I took a point off because…”",
                  "author": "wingnut4000",
                  "created": 1633311856,
                  "upvotes": 1,
                  "replies": {}
                },
                "hfa1nn8": {
                  "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfa1nn8/",
                  "text": "What’s childish is saying your student is only good for being a trophy wife and peaked 6 months ago. \n\nLike how old are you and you have a PhD?",
                  "author": "FANG_999",
                  "created": 1633298225,
                  "upvotes": -1,
                  "replies": {
                    "hfa2682": {
                      "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfa2682/",
                      "text": "Is it even possible for you to respond to the content of my posts?  Or are you going to mine my comment history for stuff you don't like instead?",
                      "author": "Judythe8",
                      "created": 1633298451,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "hfa8pcc": {
                      "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfa8pcc/",
                      "text": "Wow, it is astonishing that with access to a person's post history, you instead think its better to call them out.",
                      "author": "hdorsettcase",
                      "created": 1633301316,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "hfahw4q": {
                      "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfahw4q/",
                      "text": "While we're on the topic of that student, whom I was discussing jokingly in an anonymous sub designed for professors to support and commiserate with each other: whatever my personal feelings about her conduct in the classroom, she recently turned in an absolutely brilliant paper and received one of two \"A\"s in her seminar class of 11.  \n\nSeveral of her classmates turned in work that fulfilled the specified minimal requirements of the assignment (length, number of citations, no major copy editing errors, etc.)  but lacked the substance and sophistication of her work.  They did not receive \"A\"s. \n\nBy your and OP's definitions, I have \"taken away points\" from these students, so my behavior is \"unethical.\"   I want to be ethical, so in your opinion, should she receive the same grade as her classmates?If I receive an email like the one OP proposes to send, haggling over the points I \"took\" from them, how should I reply?  According to you, professors are   \n\n\n> responsible for holding professional and consistent standards for students.",
                      "author": "Judythe8",
                      "created": 1633305712,
                      "upvotes": 2,
                      "replies": {
                        "hfarpug": {
                          "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfarpug/",
                          "text": "Lady if the rubric has your requirements for what you want in an assignment then you need to grade based off that. \n\nIn your response about how you graded said students paper you were comparing the top two papers to the rest. They all met requirements right? So why didn’t they all get A’s? You can’t just give out the requirements lazily and then grade based off of substance and sophistication in the end. You need to tell your students what you want. If you want minimal coursework as a requirement, then that’s what you will get. By having your rubric be this way and to have that type of thinking, you are letting students assume what will get them a good grade. \n\nDid your rubric only state minimal requirements or did it go into detail of what you expected from the top papers? My last English course I took my Professor always had super detailed outlines of what she expected and how to achieve the best grade. By doing this, most students did get A’s in a very difficult and sophisticated English course. \n\nI understand the anonymity of the sub and the support for it. But you know that’s not how you’ve used it entirely. And commiserate is quite a stretch too. \n\nOP also clearly only has a problem that the points weren’t given back because as OP said, those requirements were NEVER stated anywhere. Can you try not to defend a professor you don’t even know and maybe sympathize that this guy doesn’t have the ability to accept he made a mistake. Any honest professor wouldn’t hold that against their students.",
                          "author": "FANG_999",
                          "created": 1633310540,
                          "upvotes": -1,
                          "replies": {
                            "hfatw9c": {
                              "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfatw9c/",
                              "text": ">In your response about how you graded said students paper you were comparing the top two papers to the rest. They all met requirements right? So why didn’t they all get A’s? You can’t just give out the requirements lazily and then grade based off of substance and sophistication in the end. You need to tell your students what you want. If you want minimal coursework as a requirement, then that’s what you will get. By having your rubric be this way and to have that type of thinking, you are letting students assume what will get them a good grade.\n\n&#x200B;\n\nLOL",
                              "author": "Judythe8",
                              "created": 1633311594,
                              "upvotes": 2,
                              "replies": {
                                "hfau8pe": {
                                  "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfau8pe/",
                                  "text": ">Lady \n\nLOL",
                                  "author": "Judythe8",
                                  "created": 1633311762,
                                  "upvotes": 1,
                                  "replies": {}
                                },
                                "hfaujvm": {
                                  "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfaujvm/",
                                  "text": "Once again an unfunny joke. You really gotta work on how cool you think you are.",
                                  "author": "FANG_999",
                                  "created": 1633311914,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            },
                            "hfaunhm": {
                              "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfaunhm/",
                              "text": ">Did your rubric only state minimal requirements or did it go into detail of what you expected from the top papers? My last English course I took my Professor always had super detailed outlines of what she expected and how to achieve the best grade. By doing this, most students did get A’s in a very difficult and sophisticated English course.\n\nOof, this explains a lot.\n\nLet me explain (AGAIN).  This professor has done you a disservice by treating grades like something she passes out like snacks to reward you for coloring between the lines.  My rubric is totally transparent, but it's not a matter of ticking off boxes; there are qualitative differences between \"A\" papers and \"C\" papers.\n\nAnyway, \"Lady\" was where you really showed who you were and why you were unable to respond to me in any meaningful way, so I'm finished here.  Have a great night, and may all your professors have the lowest of expectations. If not, I hope for their sake they're not \"ladies\" like me.  :)",
                              "author": "Judythe8",
                              "created": 1633311962,
                              "upvotes": 1,
                              "replies": {
                                "hfawsqw": {
                                  "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfawsqw/",
                                  "text": "You don’t deserve respect, lady.",
                                  "author": "FANG_999",
                                  "created": 1633313026,
                                  "upvotes": -1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hfa1xvm": {
                  "link": "/r/college/comments/q0pchi/help_with_emailing_a_professor/hfa1xvm/",
                  "text": "One followup:  do you agree that some student work is better than others?  Is it your opinion that professors are \"unethical\" if they reflect those differences in the grades they issue?  In other words, is every student submission an \"A\" unless it falls short o the minimal requirement?  Because that seems to be what you and OP are arguing.    \n\n\nI (obviously) don't subscribe to that philosophy, because it's unfair to students who do \"excellent\" work, which is what an \"A\" is meant to indicate.",
                  "author": "Judythe8",
                  "created": 1633298349,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}