{"sid": "9n3fj4", "link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/", "title:": "Low pass rates are not something to brag about", "text": "I have known a couple of professors (and heard of many more) that will talk about having a low pass rate either for exams or the class as a bragging point. I understand that a class should be engaging and challenging and am of the opinion a degree needs to be earned. However, at a certain point a line needs to drawn. It reflects poorly on you as a teacher. Either your tests are unfair or something else you are doing is obstructing the class. I would love to hear other opinions on this.", "author": "probably_confused_rn", "created": 1539204915, "retrieved": 1632801547, "over_18": false, "upvotes": 4071, "upvote_ratio": 0.95, "comments": {"eajtlnw": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/eajtlnw/", "text": "I’ve had profs that claim their class is hard and how many people fail their class and have to retake it. I looked up the same class taught by the same professor in the grade distribution and saw that most kids either get and A, or a B, very few people got grades below this ", "author": "knipdaddy", "created": 1543291959, "upvotes": 1}, "e8o5tw5": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e8o5tw5/", "text": "Dude, that’s just a great post and a great realisation!", "author": "InsertFurmanism", "created": 1540830930, "upvotes": 1}, "e84cll4": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e84cll4/", "text": "I bet he takes sex as bribes", "author": "OffSuprVro", "created": 1540046049, "upvotes": 1}, "e7ld1tn": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ld1tn/", "text": "I understand where you are coming from....but on the flip side.   \n\nThere are a lot more people earning college degrees today than in the pass.  Sometimes I am disappointed by the lack of rigor required to get some degrees.  The actual value of a college degree is less significant than it used to be.   (How many people have a college degree and end up working at Starbucks)  If you haven't done the work and you are not learning the material on your own responsibility - why do you deserve to pass a class or even deserve the college degree.  \n\nThe worst professors I have had were the easiest ones, they demanded little and I learned little. By far the best professor I had, had set the bar high.   You were not going to pass his class by just simply showing up.  He challenged you to learn the material and to do it well.  He did his part and he expected you to do yours.", "author": null, "created": 1539286646, "upvotes": 1}, "e7l9czp": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7l9czp/", "text": "I had a professor who seemed to use my class as a guinea pig for whatever product she was a consultant on. Regardless, most of the class felt focused on learning to use that than the material. And she would consistently enter grades wrong.", "author": "olivegardengambler", "created": 1539283606, "upvotes": 1}, "e7kyl84": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kyl84/", "text": " Went to a prestigious Uni - first year on my campus had a Calculus class  with a roughly 50% fail rate. They wanted you to fail that class if you  were going to fail a class, and drop out from failing it if you were  going to drop out. Honestly, failing that course turned my life around, I  realized what working hard actually meant and buckled down and got a B  when I took it again. I hate that professor, because it wasn't difficult  to pass on account of the course material being very difficult, it was  that he was such a terrible prof. He wouldn't even talk during lectures,  just step by step draw solutions on the blackboard. Hate him, hate the  class, happy I failed.", "author": "PM_Me_Your_WorkFiles", "created": 1539274831, "upvotes": 1}, "e7kyelo": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kyelo/", "text": "This was the filtering mechanism for my undergraduate Computer Science program back in the 80's.  At the start of the first class we were sitting in a large auditorium.  The professor said something along the lines of \"Look to your left,  now look to your right\", of you three people only one will be here at the end of the semester.\"  He was not joking; we moved to progressively smaller classrooms after each midterm (I think only about 1/4th of us made it to the end).  The classes after that were more normal.  ", "author": "Mainsil", "created": 1539274683, "upvotes": 1}, "e7ky6go": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ky6go/", "text": "Had a physics professor get 10% of class to drop/change sections on first day. The prof didn't care that it was phys102, with prerequisites calculus I and correquisites calculus II. Physics is calculus based, and I will expect mathematical understanding to master the material. Proceded to teach first lecture as a 300 level, physics-major restricted class, repeatedly reminding that there are no grade curves. \n\nNext day, 10% smaller class size, went back to the course's described content, physics 102.", "author": "jaspex11", "created": 1539274498, "upvotes": 1}, "e7ky6bk": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ky6bk/", "text": "Rate my professor.com saved my life in college.. I dodged so many bad professors because of this site..  I found this site after I had a professor who taught an intro to biology course where 80% of the class failed every exam.. ", "author": "Dreadofnight", "created": 1539274494, "upvotes": 1}, "e7kxv2w": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kxv2w/", "text": "I was in 2 classes like this with the same instructor one semester. I would get high 90s to 100% on assignments and would help other students with the assignments. I was engaged in the class and stayed after class at the school for hours studying. Then on exams I would get c's and d's. The way the class was weighted I barely scooted by with a c and c- where with other courses I had mostly a's & a+'s with a b or two and was on he Dean's list previous semesters. This was the only semester I didn't get on the dean's list and it effectively killed my academic drive. At an end-of-semester party I spoke with a couple classmates and they had similar experiences. This wasn't even like a high level course either. It was high school level chemistry and physics, upgrading courses for those who needed these courses for university level. ", "author": null, "created": 1539274233, "upvotes": 1}, "e7kx9k0": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kx9k0/", "text": "It really depends on the course and school in my opinion. For courses like Finance or Accounting, where there is a fixed knowledge set, pretty universal teaching methods and a clear standard for performance in the industry, there should be very little wiggle room in terms of what is acceptable and what is not. I've attended a well regarded \"party school\" and inevitably a lot of the students just weren't going to work hard enough to meet those standards in certain courses. And I'm fine with it in those instances. Believe it or not, it does make a difference in on campus recruiting when a bank can reliably count on your grade in certain courses as an indicator of your skills and the quality of the college. If a professor wants to brag about it, whatever; usually it's meant as a warning to students to actually study, and professors have a right to stand up against lazy students that waste their time. The fact that there will always be a significant percentage of students that fail doesn't necessarily mean the course or professor is flawed; it's usually just a reflection of the fact you have 19 year old kids in your class, and that 19 year olds can be immature (or, quite simply, out of their depth).\n\nThat said, there are obvious situations where grade deflation is an issue. I attended a top post grad program where practically every student worked their ass off to be there, was demonstrably intelligent, tuition was 50k a year and there was a very small chance more than a few of them weren't doing the amount of work required to achieve proficiency in the subject. Not to mention that the grading and material choice for the degree was a lot more subjective. In those instances, where I would see more than 5% with C grades or below, it was obviously on the professor in my opinion. While they were few and far between, those guys can rot in hell.\n\n&#x200B;\n\n&#x200B;", "author": "NYPuppers", "created": 1539273733, "upvotes": 1}, "e7kw89d": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kw89d/", "text": "My school is this same way. The whole class will be failing the whole semester but at the end every one gets an A cause the professor doesn't want a bad review. I have a 3.7 but i technically failed almost every class. ", "author": "Elispereeeeeeeee", "created": 1539272881, "upvotes": 1}, "e7kvhrh": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kvhrh/", "text": "I have 2 courses that are exactly like this. The one course, pass rates are so low and Mark's are so bad because the lecturers dont bother to teach properly. They basically read our lecture notes to us with out explaining or giving a fuck if we know what's going on. And might I add that this is a highly mathematical course. So without explanations and examples notes on deriving formulas mean shit. \n\nThe other course also a maths course has low scores simply because not only is the course extremely hard but also because many od the students dont bother to listen to the lecturer and come to lectures or make use of the additional resources and lectures provided. ", "author": "_kagasutchi_", "created": 1539272272, "upvotes": 1}, "e7kvcab": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kvcab/", "text": "My chemistry professor did this several times. But it wasn't a high level chemistry class, this was basic entry level chemistry. Oh and the kicker, the professor is the head of the chemistry department at my school. It's ridiculous.", "author": "Muffinlesswonder", "created": 1539272144, "upvotes": 1}, "e7ku5ks": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ku5ks/", "text": "I've always heard that and translated it to, \"I dont know how to teach.\" ", "author": "OneCrazECatLady", "created": 1539271166, "upvotes": 0}, "e7ktv6y": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ktv6y/", "text": "And that's when you know you should switch professors if possible.\n\nMy engineering roommates have this professor who not only brags about this but also brags that he's on tenure so good luck getting him fired despite his 1.5 RMP rating. It's because he is the only guy that teaches one class every engineer needs to graduate.", "author": "tanoren", "created": 1539270930, "upvotes": 1}, "e7kttnz": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kttnz/", "text": "The physics department at my university had an attrition rate of around 80%. They were well aware of this. I confronted the head of the department on it. He was younger than me, so I doubt it came off as some whiny entitled kid who didn't want to work hard. Besides, I was in the honors track, and getting good grades. \n\nHe did seem concerned, but he also gave me a sort of mealy-mouthed qualifier to his response. He said that yes, the attrition was high, but they didn't know what makors students were switching to (assuming they didn't just drop out). *Right...*\n\nLet me ask you this. If a car company had a catastrophic failure in four out of every five vehicles they produced, how long do you think they should stay in business? What if these failures were also causing harm to the drivers? \n\nHigher education in the United States is deeply, fundamentally fucked up. Corrupt. Innefective. Overpriced. Shamefully unscientific in its approach to learning outcomes. Abusively neglectful of their obligations to the students who blindly trust them as they mortgage their futures away for an education. I could maybe make my peace with that if they actually delivered the product we paid them for.", "author": "eighthourlunch", "created": 1539270895, "upvotes": 0}, "e7krkw0": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7krkw0/", "text": "I have a professor like that is semester and it's just to show how big his dick was in the engineering field.", "author": "blinkrenking", "created": 1539269005, "upvotes": 1}, "e7kr0ia": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kr0ia/", "text": "There are more really dumb and bad professors than there are good, smart professors sadly :/", "author": "StopEbola2017", "created": 1539268515, "upvotes": 1}, "e7kqljz": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kqljz/", "text": "I'm taking a Physics class right now and my professor seems to think that there is nothing wrong with the fact that the entire class got 0% on an open note, open textbook, quiz. The entire class was even able to collaborate and talk to each other. Plus, the class average on a recent exam was 45%. Obviously he is going to curve the hell out of it, but this should be a pretty good indicator that he is not doing his job, right?", "author": "tristancz", "created": 1539268143, "upvotes": 1}, "e7kqjhh": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kqjhh/", "text": "I remember my first day in BIO my freshman year. This was the required bio for premed, and the professor was a smuuug mother fucker. He goes to the front and before introducing himself or any of that goes “Ooookay, how many of you are in frats/sororities? How many of you are in athletics? You all may as well just get up, go, and drop my course. You won’t pass. The rest of you? Only about half will pass.” \n\nI wasn’t any of the above but I dropped anyway, cause fuck that guy. ", "author": "aquamanforpresident", "created": 1539268094, "upvotes": 1}, "e7kpqqe": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kpqqe/", "text": "I had a professor who said \"exams are there so I can know what you know, not what you don't\"", "author": "egamerif", "created": 1539267377, "upvotes": 2}, "e7kpg4w": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kpg4w/", "text": "TA getting my PhD here. I can say from experience that I don’t think many professors want their students to fail or not to pass. But it may also be true that they have standards that they aren’t willing to lower just to get an ideal distribution of grades.\n\nFor example, I taught a very small lab of 9 students. And the grade distribution for a particular report went as 3 As, 3 Ds, and 3 Fs. And sure, I would talk about it frequently with the grad students, and to be honest it was kind of funny seeing such a wild distribution. But I can also say, that those who failed completely deserved it because they did things like left off sections worth 30% of the report, didn’t use complete sentences, and just made statements that were undeniably false about the science.\n\nI did everything I could, but it’s a “you can bring a horse to water, but you can’t make him drink” scenario. Students in no way deserve to pass just by being in a certain percentage of the class. They only deserve to pass if they meet the requirements of the professor, because they are trying to help the student grow. I’d just as soon fail an entire class that doesn’t deserve to pass as give an entire class As who deserve it. And if I do have to fail an entire class, I will make it well known. Partially to ask my colleges their opinions, but also because I want people to know my expectations of them.\n\nEdit: I do want to clarify though, that if you do good work and listen to expectations set, then you do deserve an A. I’m mostly talking about students that expect a good grade only because they did the assignments or their buddies got a certain grade.", "author": "dnlvickers", "created": 1539267112, "upvotes": 4}, "e7ko8ms": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ko8ms/", "text": "As a chem major taking classes that difficult is just a reality. Not everyone can pass o chem, p chem, Inorganic, or calc III the first time.\n\nA lot of people in this thread seem to think mentioning a low pass rate on the first day of class automatically makes a bad professor bragging and not a good professor preparing their students for a difficult course. ", "author": "KINGram14", "created": 1539265998, "upvotes": 6}, "e7kmm5n": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kmm5n/", "text": "I have two degrees from two very different countries and teaching experiences in three different institutions. \n\nYou absolutely get better results from good students with low pass rates. For good students, the pressure turns them into great students and they learn work habits and discipline they will keep for life. \n\nThis is an ethical issue because in my field of design, the world does NOT need bad designers. \n\nThe bad or lazy students can’t keep up and drop out unless they improve. There should be at least one very hard course in every degree to act as such a filter. \n\nUnfortunately I now teach in a education environment with a federal government funding model and a neoliberal ideology framing students as ‘customers’ that makes it difficult to fail students for a number of reasons. If I could fail more students I would. \n\nIn the other country I mentioned, students can be kicked out of academies easily for poor performance and as a result the standards are way higher. Class sizes drop off considerably in later semesters so these good and great students get more F2F teaching time. ", "author": "wrydied", "created": 1539264382, "upvotes": 1}, "e7kmhlg": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kmhlg/", "text": "The math department is especially bad at my school. Taking Calc III and Linear Algebra and some of the other higher level math courses there are likely to pit you in a class eventually where test scores in the teens will catch a B letter grade, like a 13% score on the exam is a B, because everybody does that fucking bad. That's no way to run a class at any difficulty level. If your students can only figure out 15% of what you're asking them, then you aren't preparing them for the questions you want them to know, or you're asking absurd questions. Either way, it causes unnecessarily high levels of stress and anxiety and turns the class into this ridiculous mystery challenge to prepare. Subject material should be challenging, but you're either a bad teacher or just a dick if you intentionally or apathetically design the class that way. ", "author": "Holgrin", "created": 1539264255, "upvotes": 2}, "e7kmeks": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kmeks/", "text": "I had a couple of professors do this, but a lot of them told us why they failed (\"went to parties all time, never went to class, etc.\") Because they failed they had to retake it. \n\nI think if a teacher is going to \"brag\" atleast tells us why you failed, but also back it up that you learned from your stupidity and passed. To me it shows that you actuallt care about this subject you are teaching.", "author": "bbfjones", "created": 1539264170, "upvotes": 1}, "e7kmd8r": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kmd8r/", "text": "I totally agree. In the wider context, the college shouldn't be pushing people to sign up for classes they are likely to fail (i.e. aren't ready for). It's a waste of time and money. On the individual course level: if about as many fail as get A's, it's a sign of an appropriately challenging course. If more than that fail, it's a sign that the course is poorly taught.\n\n\nIn my institution (a UK university) there are annual staff-student committees at which class representatives and lecturers meet on an equal footing and discuss the individual courses. Then - crucially - the students' input is taken seriously in the annual updating of each course. ", "author": "johnmuirsghost", "created": 1539264134, "upvotes": 1}, "e7kmd2e": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kmd2e/", "text": "You want me to drop you class? Because that is how you get me to immediately drop your class.\n\nAssholes like this were the reason I would pick up 8 classes and then use websites like [ratemyprofessor.com](https://ratemyprofessor.com) to drop the three hardest or the ones where the teacher was an asshole. I wasn't about to fuck with a professor that was going to ruin my future because he got his rocks off failing students. 3.5 GPA average, I'm in. 2.5 average GPA, eat a bag of dicks.", "author": "BonerJams1703", "created": 1539264128, "upvotes": 1}, "e7kmc7t": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kmc7t/", "text": "Agreed. I’ve taken two or three classes where the low pass rate was a result of academic rigor.\n\nIt’s usually because of a garbage narcissist professor who can’t teach.", "author": null, "created": 1539264105, "upvotes": 1}, "e7klxw7": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7klxw7/", "text": "I had multiple professors in college who did this and they would give tests early enough but wouldn’t grade and give them back until after the drop/withdraw date so you wouldn’t really know how you’re doing until it’s too late. I think the college actually encouraged this behavior in the professors to weed out the students so they would only have the best. I ended up leaving that school and changing my major though and I have to say I’m much happier now :)", "author": "DaleDooper", "created": 1539263696, "upvotes": 1}, "e7klr0c": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7klr0c/", "text": "It s tactic. They war scare you so you will start learning.", "author": "Naetian", "created": 1539263499, "upvotes": 1}, "e7klqfs": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7klqfs/", "text": "\"Only 1/20 students pass with me\" Yeah so you are 19/20 of a worthless teacher congrats", "author": "tacrylus", "created": 1539263482, "upvotes": 0}, "e7kkv0k": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kkv0k/", "text": "I faced a teacher like this in my undergrad. It was the first discipline specific engineering class we had to take our second year first semester. The teacher made the class almost impossible and they prided themselves on being a \"weed out class\". The material was not actually that hard what made the class impossible was poor teaching, excessive busy work, unclear grading, ridiculously long tests for the time and no resources for support. It was an environment that rewarded cheating and the teacher was incredibly sexist. Many students would spend 20-30 hours a weeks on this one class, know the material inside and out and still fail the test.\n\nSo many kids switched out of the major or to a different disciple just out of frustration or from the setback failing the class would cause on graduation time ( had to pass to take next successive class). So many smart, talented students  left the discipline because their first taste of it was such bullshit. The worst part is when I would see those people who switched out they all said virtually the same thing: they wish they had stuck it out, found a way to make it work, or done something about this crappy teacher. It made me wonder how many great talented engineers this field missed out on because ONE teacher ruined it for them so early on. The rest of my classes after that had much harder material but the teachers made the class fair and taught it well. You had to work hard and study but you could do it if you put in the time. Made me despise how my first teacher ruined a great major with other stellar teachers with one class. ", "author": "StealYoSyrup", "created": 1539262568, "upvotes": 2}, "e7kjnu0": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kjnu0/", "text": "I don’t go to an elite school, my complaint is regarding my Spanish 201 professor. Yesterday we got our first exam back, I got a 39% which is funny because it looks like my gpa 3.9. I ask him about it after class, he assures me not to worry and that I did much better than most of the class... \n \nAlso he refused the idea to curve the test.\nI live in NYC, a decent percentage of the class speak Spanish at home.\nThis class is to fulfill a language requirement. \n", "author": "Evie212", "created": 1539261191, "upvotes": 1}, "e7kjnoo": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kjnoo/", "text": "I had difficult college classes, but the teachers were sympathetic. My database design courses were probably some of my best example of difficult, but engaging. The professor gave the warning that students needed to take the course seriously as there was a lot of high level concepts that built on each other. The prereqs for the class were foundational so if you didn’t have a good grasp of those courses now, you’d have to struggle to get concepts presented in class.  \n\nIt wasn’t a brag, but a warning that advanced classes are hard, but if you like the topic you can make a high paying career out of it. He did his best to reinforce the core concepts as we were building and also acknowledge when the last day to drop was. We went from 30 in the first course on day 1 to 5 that finished the last. Only two of us got an A. Excellent professor for a dry topic. ", "author": "GoodRighter", "created": 1539261187, "upvotes": 1}, "e7kjmci": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kjmci/", "text": "“See how few students are able to learn the material in my class! Doesn’t that make me a great teacher!” ", "author": "Caduceus12", "created": 1539261141, "upvotes": 0}, "e7kjkte": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kjkte/", "text": "If their curriculum was really unfair they would have been fired. The reason they haven't is because it is fair, they just refuse to give BS work to boost passing numbers. My uni had an econ professor for Econ 101 and he bragged about it, and by fuckin gawd you had to earn that damn grade. Soo many people after every class would come to him after class to ask for extra work and he'd deny them. He'd say the class work was perfectly laid out at the beginning of the semester, and if they wanted a better grade they should have worked for it then.\n\nIf it is all in your syllabus, and you still fail, it's not the teachers fault, it's the students, and I prefer this style. Too many people looking for hand outs in university.  ", "author": null, "created": 1539261091, "upvotes": 2}, "e7kjijc": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kjijc/", "text": "Let me give some insight on the other view point. I graduated from De La Salle University, a top college in the Philippines , though it is a 3rd world country so take that as you want. The course I took was Industrial Engineering.\n\nWe had 2 major subjects that had around a 50% passing rate, Statistics 1 and Operations Research 1. Once you pass these two, it's very likely that you will be able to pass all other subjects no problem, and you will graduate on time. If you fail one, you will be delayed. Thing is, once you are delayed, the same subjects, under the same professors will be far easier and the passing rate is a lot higher. The college is able to control this as we have just around 80-100 students per year level and there is little reason to take the subjects apart from the order given.\n\nEssentially, those who graduated on time will be known to be some of the best students and are targeted by larger companies. There are some who are good students but delay their graduation for other reasons though. I'm not saying that this reason is justified, even though I benefit from it. Just giving that perspective. ", "author": "BaLance_95", "created": 1539261016, "upvotes": 1}, "e7kj820": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kj820/", "text": "This is gonna be a long one, so my bad but I had a professor last year teaching an organic chem II class (pretty rigourous class for people in science) who took over midway througg the semester for a diff professor. Not only did he entirely switch our syllabus and its scale, but he also began giving us ridiculously unfair exams that had the lowest overall averages I've seen for a class. Our AI's told us after an exam (that had a 37% average) that a good chunk of the questions on the exam were from their 2nd year exams they took in their PhD programs. When students questioned his wonky scale, he went off on them. A friend of mine had him the summer before and didnt understand a mechanism (he routinely wrote mechanisms that were the big exceptions to normal ochem rules) and he replied by telling her that she should probably switch out of a premed program if she was having struggles with his ochem, and that he wouldn't help her because he is her teacher and not her tutor. After we took the final, to make sure that he didnt have too many A grades, he pulled the rug out from under us by RAISING the requirements to get an A or B, so a nice number of students were boxed out of an A or B after having scored in those ranges throughout the semester. This particular professor also has tenure at our university, so when a massive amount of students inevitably complained to the department about what was going on, he told the director of undergrad studies (who doesnt have tenure) that he'd look into it. He never changed a thing and so a large amount of students failed or scored low in the course. Basically every A and B in that class was a product of the first exam, as the first professor copied and pasted an old exam of his from a year prior that a student organization on campus had, so anyone who had it scored significantly better on that exam, causing inflated A and B scored (the average was around a 68%).\n\nThe only positive is that the Chem department decided he was too unfair as an undergrad teacher and pulled him from teaching Orgo II from now on, but never did anything about our class..", "author": "Lunatic7618", "created": 1539260668, "upvotes": 2}, "e7ki9h6": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ki9h6/", "text": "\"I have the highest mortality rate in the ER\" -Dr. No at all", "author": "YouHadTimeToWaste", "created": 1539259454, "upvotes": 1}, "e7ki6lo": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ki6lo/", "text": "I just took an exam in which the grades turned out to be so low, the whole class and another teacher's(he made the exam) class now have to go to mandatory tutoring. It was a completely unfair exam. I thought it was going to be fine when my teacher said that we can bring in a cheat sheet. Fine I first outlined and learned the info. And then I wrote anything I didn't understand and didn't have time to learn. Got to the exam, and didn't need the cheat sheet at all as nothing on the slides were on the exam. Tf. 😭", "author": "Hexagonali", "created": 1539259345, "upvotes": 1}, "e7khwj6": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7khwj6/", "text": "Then they wonder why people cheat...", "author": "troublesome_sheep", "created": 1539258970, "upvotes": 1}, "e7khl8w": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7khl8w/", "text": "Sounds like a comp sci professor. ", "author": "Astyanax1", "created": 1539258533, "upvotes": 1}, "e7kh15g": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kh15g/", "text": "Yeah, I had a language teacher with 24 out of 25 fail the course. 16 took it again and 13 failed.  We requested a different teacher and then 10 out of 12 passed.", "author": "hardpencils", "created": 1539257762, "upvotes": 1}, "e7kgqtz": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kgqtz/", "text": "\"weird flex but ok\"", "author": null, "created": 1539257351, "upvotes": 1}, "e7kgla5": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kgla5/", "text": "Calculus I in a nutshell.", "author": "Gativrek", "created": 1539257125, "upvotes": 1}, "e7kgec2": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kgec2/", "text": "Reminds me of my electromagnetics course. Required for my degree and taught by a rotating pool of teachers. Yet the course consistently had pass rates in the 30's - 50's. Curving that hard to disguise blunders in lack of teaching ability, either in conveyance of material or selection of test material, is abysmal. \n\nIt was a tough subject for sure, but I think the test highs provide a good indication, usually. If the high was 95+, it usually means there was a plausible way you could have found and retained/surmised the same info. When it's in the 70's it usually means the professor sorely failed to address topics to prepare their students.\n\nBut at the end if the day, the curves are transparent, they modify the scale prior to the reports to the school see nothing wrong with the system. \n\nI didn't pass that course until they allowed the TA to develop a lab set for the course, and let her teach the study sections. Having real examples was nice but the difference was she could actually execute the math behind the problems. The professors would just throw half baked examples at the board and either not explain any of the math, or get half way through, get lost and give up when things didn't line up. Then they'd concoct problems for the test with unlimited time and resources or steal them from their peers. \n\nDisclaimer: I know I'm ripping on professors a lot here, but this only happened in 4-5 courses. I had plenty of professors that we're completely opposite to that.", "author": "Shepherd_Moses", "created": 1539256826, "upvotes": 1}, "e7kfr2x": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kfr2x/", "text": "You are so right. I was a TA in my major dept throughout college and frequently wrote exams. My primary objective was to assess how my students had internalized the material, not to trap or confuse them. An effective test should be  thought-provoking and challenging for a well-prepared student, but never impossible. I frequently ran analytics on my exam questions and threw out any that had pass numbers significantly lower than what I would expect from random guessing. Because if 95% of my students fail question #7, then the problem is likely with question #7, not the students.\nBottom line: professors that brag about low pass rates are not great professors, they're just terrible test writers.", "author": "linedryonly", "created": 1539255804, "upvotes": 1}, "e7kfkiv": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kfkiv/", "text": "If a single student fails your class it is probably their fault, they might not have worked hard enough or engaged with the course. You might have some responsibility for their failure but most likely no one could blame you for it.\n\nIf 70% of your student's fail your class it is unequivocally your fault. You have failed to sufficiently educate your students, you have failed to prepare them for your exams, you have failed at your job.", "author": "Hamster-Food", "created": 1539255517, "upvotes": 0}, "e7kfh73": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kfh73/", "text": "Profs are sometimes gatekeepers, esp. for technical subjects.  You do not pass my anatomy class without understanding certain things, because I don't want to look up in the hospital and see your unqualified ass staring at me, or drive across your bridge after getting passed along in algebra, etc.  ", "author": "bleearch", "created": 1539255367, "upvotes": 2}, "e7kfdl3": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kfdl3/", "text": "In my experience a shitty prof=a low pass rate. \n\nI’m starting a masters program. \n\nMy first assignment, the prof bragged and bragged about how poorly his students always do in the first assignment. \n\nI wasn’t at all worried because the assignment was a short essay, and those types of assignments have always been my strength. \n\nHe posted the assignment one week before it was due. It read something like:\n\n>pick a pressing issue relating to _____ and explain how it relates to how and why the world works \n\nI got a 7/10, probably my worst grade on a paper since high school. ", "author": null, "created": 1539255200, "upvotes": 1}, "e7kf0vh": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kf0vh/", "text": "\"I fail to educate half the people who pay for this class.\"", "author": "Nate_Summers", "created": 1539254633, "upvotes": 2}, "e7kf0n5": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kf0n5/", "text": "I’m studying civil engineering and at my uni around 10-20 % of the students pass the math courses every year which in turn leads to a lot of people retaking it. Some courses have 400 students writing one exam. It’s not that the math is super hard, it’s that the people who corrects them are some real math nazis. ", "author": "Stonecoldwatcher", "created": 1539254622, "upvotes": 1}, "e7keyzx": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7keyzx/", "text": "High acceptance rates are not good for programs /universities. Some classes serve as a filter, but I agree professors should not brag about students failing. ", "author": "MisterBehave", "created": 1539254539, "upvotes": 2}, "e7ke6db": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ke6db/", "text": "My cousin is working on his engineering BA, apparently one of the classes he's taking he was warned about ahead of time because of this kind of thing.\n\nFortunately, because of the warning, he knew to lighten his schedule and he was told that this course is a bit of a \"gateway\" class. Apparently he can expect his next two semesters leading up to him completing his degree to be a fair bit easier.\n\nI guess the course deals with some pretty serious fundamentals so the professor takes it very serious and it's very possible that this course is reason the students that do take the next courses are successful and find the content easier.\n\nAll that said, my cousin is enjoying the course and said the professor is amazing. It's very challenging but I guess the professor has a great attitude and interacts with the class rather well. Cousin said he even has an obnoxiously high approval rating online.", "author": "Taredom", "created": 1539253007, "upvotes": 1}, "e7ke39x": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ke39x/", "text": "I had a professor who curved downward so that the median grade on a test was a 70 (C cutoff on our 10 point system). That means that by definition 50% of the students fail.", "author": "therinlahhan", "created": 1539252838, "upvotes": 2}, "e7kdy5x": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kdy5x/", "text": "I'm pretty sure they say it so you take the work extra seriously, not as a brag.", "author": "okocha8", "created": 1539252545, "upvotes": 2}, "e7kdl5r": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kdl5r/", "text": "Business Statistics was like this at my school. The rumor was that it was hard to weed people out of the business school. Turns out, as I experienced first hand, the failure rate was high because it was taught by two professors and only one of them made the exams. Of course my professor was not the one making the exams and we were tested on material not taught to us. A few of us went straight to the dean over it and the response was ‘well, if it’s not business stats it’ll be something else.’      I passed...barely. ", "author": "MyOtherAccountIsBlue", "created": 1539251805, "upvotes": 2}, "e7kdach": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kdach/", "text": "I want to send this to my professor. Ill send this to my professor. Time to make a new email ID ;) ", "author": null, "created": 1539251206, "upvotes": 1}, "e7kd32w": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kd32w/", "text": "The grades from any exam on a graph should form a Gaussian curve - some bad, most average, some good. Otherwise it's probable that there are some issues.", "author": "Weaver_of_memes", "created": 1539250765, "upvotes": 1}, "e7kd1p4": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kd1p4/", "text": "We have an overall 80% passing rate here. But some classes have like 99% since the only criteria is that you attend. So in order to keep balance other classes have below 50%... makes sense", "author": "Flipsii", "created": 1539250680, "upvotes": 1}, "e7kc0jf": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kc0jf/", "text": "I was taking physics 2 and diff eq one quarter. Physics professor bragged how he made his class super hard so that students prioritized his class over other classes like it was an achievement. Like 6 hours of busy work homework every night type deal. A lot of classmates were taking diff eq w/ me that quarter and most of us ended up having to sacrifice our diff eq grade because it was winter quarter and diff eq was offered both winter and spring, but physics 2 was winter only and a pre req to physics 3. I heard my diff eq professor investigated why his winter class had such a high failure rate this quarter, and when he found out why he went to the dean and got my physics 2 professor reprimanded. I heard the class is way more chill now but I wish I got refunded or diff eq offered free over summer because it is so messed up. ", "author": null, "created": 1539248420, "upvotes": 1}, "e7kbypo": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kbypo/", "text": "I had one lecturer mention the exams were designed to ensure a certain amount failed. The last lecturer had been let go because too many students passed. I think in some cases the class is intended to \"weed out\" students, not necessarily to be a worthwhile class", "author": "base_figures", "created": 1539248311, "upvotes": 1}, "e7kbtxl": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kbtxl/", "text": "Not everyone gets promoted at work. Get used to it. ", "author": "RBC_SUCKS_BALLS", "created": 1539248036, "upvotes": -4}, "e7kbrba": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kbrba/", "text": "i had a professor who bragged about this-she complained that her class average and pass rate was too “high” the semester before i had her (as if that’s a bad thing??) , so she made the class crazy difficult and got rid of any curve whatsoever for her exams and refused to take any late homework (when i was out sick with a throat infection!!)...needless to say i failed her class along with others so i’m pretty salty", "author": "ayylmaos17", "created": 1539247888, "upvotes": 1}, "e7kbezx": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kbezx/", "text": "My math professor last year was not only terrible at teaching, he did exactly this, he bragged about how about half of the class would fail. On the first test, which was incredibly difficult even though I had studied hard and knew the concepts etc., there was a 40% pass rate. 60% of the class failed the exam. He then proceeded to tell us that the next exam would be MORE difficult because if 40% had passed then it was obviously too easy. I have no fucking idea what happened to that guy but I ended up failing the course and dropping out later that year due to a multitude of reasons (one of which being that horrible fucking class) ", "author": "Bluerrew", "created": 1539247136, "upvotes": 1}, "e7kbbed": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kbbed/", "text": "I'm way too late on this thread, but I want to share my experience with this. \n\nIn my first semester I had a grammar class. The class itself was doable, exercises, discussion, the usual. Then the test comes up and literally over 90% of us fail. It's the first and only test at uni I ever failed, and I had felt pretty well prepared for it. The reason almost none of us made it was that the test had close to nothing to do with the class. The professor used terminology we had never used in class, we had never worked on exercises like the ones in the test and at least half of us didn't even know how to go about solving them. The class had not prepared us for the test at all. \n\nMost of us passed the second attempt since we then knew what to expect and could prepare accordingly, but seriously, how fucked up is that? ", "author": "melina_gamgee", "created": 1539246925, "upvotes": 1}, "e7kb2mb": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kb2mb/", "text": "Currently working out a few minor issues with my cheating to pass algebra 2, my current professor said there were more than half of the students retaking his class. Shit took my 2 tries at algebra 1, nah son ain't retaking algebra 2", "author": "chickenfoot4less", "created": 1539246391, "upvotes": 1}, "e7kb1gk": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kb1gk/", "text": "I'll take the other side of this. While I'll agree that professors probably shouldn't be bragging about a low pass rate, I am grateful there are professors that won't just hand out a passing grade for attendance. \n\nDuring my time in school, there were so many kids that just didn't belong there. Couldn't spell, couldn't form a cohesive thought, thought school was just for partying. Many times, I'd get saddled with these deadbeats for group projects. More than once I had to attend office hours to make sure my teammates' disinterest wasn't going to torpedo my grade.\n\nI earned my degree. I think it's only fair that everyone else has to as well.", "author": "lionbatcher", "created": 1539246320, "upvotes": 8}, "e7kaxbx": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kaxbx/", "text": "I agree with the teacher. In my opinion these days everyone wants to study (at least in Germany). The standard is lowering every couple of years. I studied law and every test at least 50% failed but I thought it was ok and fair because the test were tough but not unfair and whoever did not pass this test at least with a C- should not become a lawyer imo.\n\nSo I think the professors act like this because they are sick of a ridiculous low level in their subjects and want to keep only those who really study because they understand and like it and not because they want to be ‚succesful‘ even though they don’t get the matter.", "author": "123Logdatei", "created": 1539246067, "upvotes": 2}, "e7kawvt": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kawvt/", "text": "We had two Profs batteling about who has the lowest possible passing rate. Both had the lecture technical mechanic and my Prof won with a 4% rate. The final exam was a real joke. Pretty pitifull.", "author": "Flippingbeat", "created": 1539246039, "upvotes": 1}, "e7kar6g": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kar6g/", "text": "I had a professor my junior year in college. Old guy. English class. Focus was on short stories. Anyways, on our first paper, I did worse than expected. I tend to make a point to give the first major assignments extra effort to gauge the difficulty of the class. I took my paper to him after class and asked what I could do to improve my grade. He gave me some advice.\n\nTwo weeks later, I get my second assignment back, barely passing. This time I visit the professor during office hours and ask about how in the world I could’ve put 12 hours into a minor assignment, made the necessary changes, and had the paper proof-read by another English professor from another English class at the same level as his. He said something along the lines of “You get an A for a perfect paper. It’s really hard to get an A in my class. Most students will struggle for a B.”\n\nDropped the class, took another, got my degree no problem. Should’ve looked at his reviews on Rate My Professor before signing up for the class, as they were astoundingly bad. He wasn’t a bad professor, he just had exceptionally high standards. ", "author": "Shmurdoo", "created": 1539245700, "upvotes": 1}, "e7kadoq": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7kadoq/", "text": "In highschool I had a teacher with a 75 percent faliure rate every year because 60 of the mark for each chapter took place in the first week of the class when no one understood shit and he used to brag that he was such a good teacher and how terrible his students were to fail his incredibly easy class", "author": "ahhhtheflood", "created": 1539244878, "upvotes": 1}, "e7ka8so": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ka8so/", "text": "My uncle is a professer in cognitive science. He's is one of those guys to talk highly of how strict he is. From his point of view I don't blame him. 60% of the students don't really give a fuck and take his course because they have to. Another 30% don't give a fuck because they aren't really on the right track in life. Essentially the low pass rates are used as a way to discourage the kids who aren't really serious about there academic studies. For example a couple years back one his students left mid graduate studies to go on to the local big brother.  To have higher pass rates/easier classes he'd need to lower the educational standard and put in a lot of extra hours for students who aren't really grateful for the opportunity the have.", "author": null, "created": 1539244587, "upvotes": 2}, "e7ka5v0": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ka5v0/", "text": "I had a class last semester that started as a full class and ended with 4 people.  I was one of the last 5. She blamed the students despite refusing to help when asked", "author": "wickedspork", "created": 1539244413, "upvotes": 1}, "e7ka2xa": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ka2xa/", "text": "I just had this situation in my server side class, prof was very proud of the fact that only 40% of people will pass. She was stressing how important that class is and that you need to show up, than proceeded to disappear for 2 weeks. ", "author": "krychaz", "created": 1539244243, "upvotes": 1}, "e7ka02e": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ka02e/", "text": "Eh depends on the unit. Business law is fucking difficult either way you look at it. Has a hard failure rate at my uni even though you can take your textbook into your exam.", "author": "thehunter699", "created": 1539244081, "upvotes": 1}, "e7k9oac": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k9oac/", "text": "What can i do to show that i agree with this beyond the fullest extent?", "author": "Darude_Dank", "created": 1539243407, "upvotes": 1}, "e7k9a5y": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k9a5y/", "text": "I had a professor my freshman year scolding somebody and telling him that she hasn't had anybody that exited the class with an A in 23 years. \n\nI don't believe it considering numerous majors require it and we have tons of students that graduate with 4.0's, but I think it was a shitty thing to attempt to be braggadocios about. \n\nI mean, I guess students could have taken one of the other two professors they have running that class but still. ", "author": null, "created": 1539242620, "upvotes": 1}, "e7k95cp": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k95cp/", "text": "One of our teachers (UK) started her very first class like this:\n\nTeacher: I have high hopes for all of you, but you still have to work hard. I want you all to guess how many classes I've taught in 10 years have passed.\n\nUs: (murmuring) all of them?\n\nT: (proudly) only one!\n\n... She was just a fucking terrible teacher. We kicked her out after 2 classes. ", "author": "mister_pleco", "created": 1539242351, "upvotes": 1}, "e7k8uh8": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k8uh8/", "text": "This is really the truth. I've had two classes where professors bragged about the low passing rates of the class and the structure of both of those classes were so terrible. \nThe structure of the classes/the professors were so terrible it was like they were purposely setting people up to fail. ", "author": null, "created": 1539241787, "upvotes": 1}, "e7k8ni8": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k8ni8/", "text": "Axiom: For a degree program to be prestigious, it needs to be difficult enough that most college attendees couldn't/aren't willing to reach that level of proficiency.\n\nThis \"filtering\" can happen at many stages: It can happen getting into the University, it can happen getting into the classes, and it can happen in getting through the classes.\n\nAxiom 2: Department heads have an idea of which type of filtering works best for their department.Axiom 3: Department heads are competent at their job.\n\nIf we assume all this, then it can be something of a badge of honor to teach a class that is known to be difficult but inline with department expectations, setting up the students who pass for future success. However, when done outside of department strategy, your statement is difficult to disagree with.\n\nPersonally, I think the idea of a program that lets anyone test their mettle to be a good opportunity for students who may have not put themselves into a great position until that point.", "author": "237throw", "created": 1539241434, "upvotes": 2}, "e7k8hny": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k8hny/", "text": "if some of you haven't made it to college. let me tell you, there is a significant portion of teachers like OP is describing. 40%-60% of college professors are like this if you study sciences \n\nthe difference in teachers can send you from a failing grade to an A. some teachers will not only make you do a lot of work. but a lot of that work is pointless. some teachers will make you do no work. but you have no idea whats on the exams", "author": "SaviorLordThanos", "created": 1539241143, "upvotes": 2}, "e7k8f0f": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k8f0f/", "text": "I had this one class where once 52 students took the exam\n4 passed", "author": "OriginalHairyGuy", "created": 1539241009, "upvotes": 1}, "e7k88i9": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k88i9/", "text": "Well if teaching is your job and the ones you teach are not learning well enough to pass, I'd say you are failing your job.", "author": "pyroplasm06", "created": 1539240684, "upvotes": 0}, "e7k850p": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k850p/", "text": "A warning is not something to misinterpret as a brag.", "author": "fj333", "created": 1539240518, "upvotes": 5}, "e7k7r9l": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k7r9l/", "text": "Their job is \n\n1) teach people a subject  \n2) demonstrate that these people have been taught the subject\n\nIf you're failing everyone, you're doing neither.", "author": "xantxant", "created": 1539239860, "upvotes": 0}, "e7k7hg8": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k7hg8/", "text": "Class is for learning. Low pass rate should reflect poorly on professors because they were unsuccessful at making people learn. \nIts like I was supposed to build 50 good parts but I was able to make only 10 good ones. I would be fired if I did that at any manufacturing company. But at a college, professors can brag about it? ", "author": "punitn", "created": 1539239386, "upvotes": 0}, "e7k76k9": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k76k9/", "text": "Someone I know had a class where the professor actually said only 40% of people passed his final exam. He was also one of those teachers that required you to buy the book and then never taught from it after the first 3 lessons. ", "author": "gamageeknerd", "created": 1539238902, "upvotes": 2}, "e7k71so": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k71so/", "text": "One thing I haven’t seen on here that has happened to me, and hopefully this example helps some potential students not get into this situation.\n\nThe school did not require students to have anything other than a basic high school degree before taking a mid level course. This resulted in ~50% fail rate (D included as fail) for this course because so many students came into the class without the proper background knowledge. I don’t believe I taught poorly, since grades were in a bimodal distribution with multiple 100% passing grades and I had overall good reviews. This was also the norm pass rate for years before I even arrived. It really bothered me and I presume it was an unethical way to get more tuition. The other reason I believe this is that they allowed students to drop courses up until the last day, so you can get an incomplete but they keep your money. I did not teach there very long.\n\nThe moral is, beware of schools that try to push you into classes you feel you are not prepared for. And note that these schools will provide legitimate degrees and appear wholesome, but can still be unethical in this way.", "author": "empathetichuman", "created": 1539238688, "upvotes": 2}, "e7k6qyw": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k6qyw/", "text": "Forever ago, freshman waiting for classes to start.  See this guy riding his bike all over campus. Get to first day of history, it's bike guy.  He says something like he is fresh out of Yale, first time teaching, and half of us are gonna fail.  \n\nSeeya.  Changed class and got an A.  Great prof and the first time I ever enjoyed history. He made it like a soap opera. ", "author": "whoisanyoneanyway", "created": 1539238194, "upvotes": 1}, "e7k6gie": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k6gie/", "text": "Ba.S. Chemical Engineering here.  Family includes research degrees (plural) and professorships (plural).  I have almost 30 years of experience with this exact argument topic.  \n\nFirst, people in this thread seem to be under the impression that professors are all, by definition, educators.  This isn't always true.  \nAt smaller community colleges and non-A.B.E.T. accredited schools professors are basically teachers so in these cases OP has a point.  But at a higher-level University many professors are first and foremost RESEARCHERS. Their job is: TO PUBLISH; but also answer questions from these idiot kids while you're here.  Publishing influential research is how schools get recognized for producing capable graduates and more is better.\n\nFurthermore, students with a degree from your university that don't know what they're doing reflect poorly on said university.  A university is only as good as its reputation, so graduates that know what they're doing are a top priority for anywhere that cares.  This leads to a harsh bottom line (the line OP talks about drawing): if the kids don't know anything, didn't learn anything, and can't do anything then they don't pass the class.\n\nHere in the US at least, the number of kids coming out of high school COMPLETELY unprepared to learn-for-real is the largest factor to blame here.  Learning is FAR more sensitive to technique than talent. Moreover, you are your own best teacher.  This is true for literally everyone, but US schools seem only to value basic memorization and nothing else.  The kids with high school diplomas don't have the tools they need to figure out complicated stuff on their own.  And I mean \"tools\" not \"intelligence\" because what you need in order to figure out complicated things for yourself is: the right set of tools.\n\nThese kids go to college and know only the zero-freedom, memorization-only, education-by-dictation nonsense that fills K-12 so they have trouble independently pursuing research topics effectively.  Perhaps more importantly, we/they lack the experience and tools necessary to identify and understand the how's and why's of a topic.  Regurgitating the definitions of keywords, or the names and dates of people and events is just not as important as understanding how the event happened and why it happened that way instead of some other way. This is absolutely essential for higher education and reaching the college level without significant experience in this area makes a professor's job all but impossible until they stop to teach this first.\n\nThe professors most successful at teaching me and my classmates rarely answered our questions directly.  They pointed us to places or techniques that allowed us to learn independently.  This independence is the ultimate goal of any good University program. \nThis next bit sounds kinda assh*le-y, but I'm including it because it's true and relevant: if you still need someone else to teach you, you haven't earned your degree yet.\n\nOn the flip side, a huge influx of largely unprepared and unqualified students has created a tough ultimatum for respected Universities that want to cash in with big student bodies and high tuition costs(seemingly every US A.B.E.T. university):  high failure rates or unqualified graduates.  Some schools have found that high failure rates resulted in bad press, toxic reviews by word-of-mouth, and a subsequent decline in applications and alumni funding.  When \"cashing in\" was the whole point, these revenue losses hurt especially bad.  In response, these Universities push their professors to pass unqualified students en masse.  Most professors don't like to hear \"lower your standards\" or \"tone down the material\" from arsehole suits with a communications degree because who are they to say what's needed in the professor's field?  Also, most professors teach the curriculum they do BECAUSE they feel it is necessary to understand the topic of the class--to then be told by someone with no experience in the field \"nah they don't need to know any of that sh*t\" is understandably frustrating.\nIn these instances (which I have found to be common in a wide variety of large US Universities) a professor with the FREEDOM to fail students who don't know the material is a moral victory worth relishing, or even maybe bragging about.  These people are happy they ARE ALLOWED to do their job well.  \nThat last line seems pretty widely relate-able to me.  Lots of people work somewhere with some dumb rule or policy from the higher-ups-that-don't-get-it that directly prevents them from doing their job better.  Defeating those FEELS GOOD.\n\nThere are also assh*les who just like watching people fail in general.  Those people are scattered about everywhere; some of them are professors.  I'd remark about one if I'd met one too.\n\n\n\nTL;DR  Not all professors are teachers first. Bad high schools can give professors/universities a difficult choice: high fail rates or incompetent graduates.  After internal disagreement ensues, whichever side prevails is liable to brag.\n\n\nEdits: Typos/syntax", "author": "Hillwilliam1677", "created": 1539237720, "upvotes": 2}, "e7k66yt": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k66yt/", "text": "It’s not a bragging point, they are just trying to set the expectation that you will have to do work, since you can totally bs though most of the college classes these days. When I was in college students straight up demanded the grades be curved because they weren’t doing shit. ", "author": "Lesh2018", "created": 1539237299, "upvotes": 5}, "e7k65ur": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k65ur/", "text": "Teachers bragging about low pass rates is such an oxymoron. They’re basically bragging about how many students they didn’t educate well enough to pass their class. Sure, there’s always going to be a number of fuck offs, however if most of your students aren’t passing, you’re a shit teacher.\n\nI’m I went back to college after raising three kids and ratemyprofessor.com is the most useful tool to pass classes.", "author": "Ztruth_hurts", "created": 1539237249, "upvotes": 0}, "e7k5js4": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k5js4/", "text": "I had a professor who was deemed the \"hardest\" professor in the department. I took his calculus 3 course and as the semester went on, it seemed fine. \n1st exam came by, I studied my ass off, got a 60%, the class average was a 50%\n2nd exam came by, I changed my study habits to reflect off the 1st exam, got a 43%, the class average was a 32%... a 32%.\n3rd exam/the final came, the professor told us straight up that approximately 25/32 students had no chance of passing unless they got a 95%+ . The average for that exam was a 52%\n\nThe professor didn't give any extra work in order for there to be other grades to at least help. Hw was optional. So the course relied entirely on the exams. No curve or any leeway/extra credit available. \n\nI switched out of the math program as this was a common occurrence in the department. \n\n", "author": "thejuanandonly123", "created": 1539236301, "upvotes": 1}, "e7k5jaq": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k5jaq/", "text": "Academics need educational training. There are loads of brilliant profs that lack the ability to effectively impart knowledge, much less assess with any level of validity or reliability. Being the smartest person in the room doesn’t do anything in an educational context if you aren’t capable of transmitting your knowledge.", "author": "UggolyBird", "created": 1539236281, "upvotes": 2}, "e7k5d87": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k5d87/", "text": "I took a class in a master program. It was required. There were actually three in a row, it was like... “modern concerns in teaching science/English/math”. The teacher of the course  was pretty new - lecturer/adjunct professor, would never get tenure as she was a younger woman willing to accept adjunct pay for teaching hard stuff.\nSix hours of reading a week. Complicated shit. That we had to discuss for our grade, In a book that was $200 and not in the bookstore or on the Internet. When we were all student teaching nearly full time and taking like two other courses.\nAin’t no one got time for that. Elizabeth? You know you done us wrong. That for the C minus I had to beg for. Crying.", "author": "cobaltandchrome", "created": 1539236035, "upvotes": 0}, "e7k4w7x": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k4w7x/", "text": "Freshman year of college I took biology 2, the insructor had told us, \"everyone struggles with my class and most of them usually fail the lab exams so good luck.\" 3 of around 25 people passed the class and only about 5 of us finished the class.", "author": "Razor0H", "created": 1539235350, "upvotes": 2}, "e7k4p6c": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k4p6c/", "text": "24 year old asshole me going back to college. Professor tells me this about his class. My response:\n\n“So you’re telling me you suck at your job. Good to know, I’m withdrawing. Thanks for wasting my fucking time.”\n\nAll he could do was gasp. I guess 18 year olds don’t treat him like that. ", "author": null, "created": 1539235069, "upvotes": 2}, "e7k4ft1": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k4ft1/", "text": "Chef at high end restaurant: \"Yeah I don't mean to brag, but roughly 40% of my customers go home with food poisoning\"", "author": "Fluffigt", "created": 1539234697, "upvotes": 4}, "e7k46h9": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k46h9/", "text": "There is a Freshman seminar class at my college that even seniors have admitted was harder than their classes at 300/400 levels. There have been many complaints filed but because students (honors program students, might I add) barely pass because of the curve, it’s been allowed to stay a class section, while the other sections are on much easier topics and don’t have nearly the same amount of work/tests/etc. it’s ridiculous and the professor and faculty all say that it’s good that it’s hard, but a single section of a class specifically targeted at freshman shouldn’t be harder than a 300/400 level class. ", "author": "conflictedcolumns", "created": 1539234336, "upvotes": 1}, "e7k3z9k": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k3z9k/", "text": "I feel like a professor with a moderate pass rate but a really high drop rate is a good prof. It usually shows me that they can teach the material really well and make it challenging to keep up if you don’t come to class consistently.", "author": "bigtimerocker12", "created": 1539234062, "upvotes": 2}, "e7k3yrn": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k3yrn/", "text": "Fuck them, I never had test anxiety before statics. The instructor tells us about the 50% pass rate and proceeds to tell us to consider our degree choice. By the time you take statics, there is no way to turn back with the student loans that have been accumulated. ", "author": null, "created": 1539234044, "upvotes": 1}, "e7k3du8": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k3du8/", "text": "My Industry is very, very small. The professors thought they were doing that career field a service by narrowing the competition to only the brightest and best new blood. \n\nI graduated just fine, but when there's twenty other colleges in the country that have ten times the graduates in the same degree, the competition is still there. They accomplished nothing but diminishing the reputation of the college.", "author": "RAV0004", "created": 1539233255, "upvotes": 2}, "e7k3cqx": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k3cqx/", "text": "Had a professor assign a paper and the first thing he said was \"the highest grade you can get is a B, i don't give As on this paper.\" Fantastic motivation /s.", "author": "Whouldaw", "created": 1539233213, "upvotes": 3}, "e7k2vdx": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k2vdx/", "text": "the most important job a professor has is failing those students that don't understand the material. that's what makes a degree valuable. if every idiot can get one, it's worthless. further, some types of material, like upper level engineering, math, physics and biology, are exceptionally difficult and counterintuitive. so for classes like that, a high failure rate is expected, and not a reflection of poor teaching. no reason to brag about it, though, that's just a douchebag move. ", "author": "cheeseitmeatbags", "created": 1539232592, "upvotes": 9}, "e7k20of": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k20of/", "text": "Disclosure: I am currently a mathematics professor.\n\nIn general, and I can only speak for the colleagues I know well, we hate our low pass rates. While unreasonable, we enter into every semester with the optimistic delusion that this semester ‘everyone will get it’. Everyone will put in the work. Everyone will approach the class as if they were there on purpose. Yet, as the weeks pass and the attrition begins, we are left to face a sad reality where we lose half or more of the bright faces and eager minds we began with.\n\nWhat I have observed in my career can perhaps be explained by a difference of goals. As a professor, I want each and every student to learn all (and I do mean all) of the material for the course. I consider it a personal failure when a student doesn’t. But I would consider it an ethical violation if a student were to pass without learning the material. This is, I feel, where the disconnect lies. If you give the typical student a choice between learning the material and passing the course, they will choose passing the course every time. Students now attend college not to learn, but to get a degree, as if they are purchasing a license to enter the workforce (as a side note, I believe personally that we are requiring college degrees for far too many entry level positions today).\n\nThis difference of view creates a contentious relationship where professors are seen as barriers to getting a job instead of useful resources to improve ones mental abilities. I don’t have a solution to this, sadly. \n\nBut I can leave all students reading this with some advice: Go talk to your professors. Go to class. Do all of your assignments. At least pretend to take an interest in your classes. Because at the end of the day, our greatest joy is seeing a spark of joy from a small student success become an insatiable hunger for knowledge.\n\nI apologize for the long post, thank you for reading.", "author": "_orange_monkey_", "created": 1539231512, "upvotes": 58}, "e7k1zxc": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k1zxc/", "text": "It's likely a giant circlejerk with the students who passed. ", "author": null, "created": 1539231485, "upvotes": 1}, "e7k1x89": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k1x89/", "text": "The nursing school I’m attending use to brag about having the highest passing rates in the state but they had one of the worst pass percentages for the boards. They have to revamp everything and now they don’t have as high of a pass rate but a fantastic board passing percentage ", "author": null, "created": 1539231394, "upvotes": 6}, "e7k1n4h": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k1n4h/", "text": "My mother is a calculus professor and she said that she doesn’t want the smartest kids in the class to feel unchallenged but still wants the others to learn the material and not freak out during tests.", "author": "gottahavemycaffeine", "created": 1539231044, "upvotes": 2}, "e7k15gj": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k15gj/", "text": "I'm currently dating a college professor and I am in college myself. I can say we both agree with this. It shouldn't be easy, but \"C average\" should be the middle of your class, not the top! ", "author": "Microphilia", "created": 1539230447, "upvotes": 1}, "e7k0uxa": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k0uxa/", "text": "As an instructor, I can say thise types of teachers are shit educators and make themselves feel better by making their classes impossible. ", "author": "clamber333", "created": 1539230100, "upvotes": 0}, "e7k0iq6": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7k0iq6/", "text": "I had a computer science teacher tell us on day 1 that he would fail half the class.  It didn’t matter if everyone scored above 90%.  Based on the curve he would fail anyone from 90-95%.  Half the class dropped that first week.  Half of those who remained he legitimately failed.  The end result was a 25% pass rate compared to enrolled students on Day 1.", "author": "forlorn_hope28", "created": 1539229702, "upvotes": 2}, "e7jzvc3": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jzvc3/", "text": "So - I teach an intro level science class to students who aren't great at science. I always tell them that students generally find my exams to be difficult, but that as long as they do thier work for the rest of the class it should even out. I'm not bragging about my exams, I don't think they're that hard, and I routinely have students make A's on the exams. I also spend a whole class period before the exam reviewing, make a big point in class about concepts that they have to regurgitate on the exam, and put homework problems (that I review in class) on the exam. Typically, students do poorly on exams but end up with a C or higher in my class as most of the other grades are 90 or above. ", "author": "compthonasis", "created": 1539228956, "upvotes": 8}, "e7jzv0u": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jzv0u/", "text": "It also looks like they are probably just a shitty teacher.", "author": "sgntpepper03", "created": 1539228945, "upvotes": 1}, "e7jzlfa": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jzlfa/", "text": "I had an anatomy professor who had very hard tests and mostly only had less than 25% of what we did in class on the test and his classes were terrible he would ridicule people for giving the wrong answer to questions.  My highest test score was a 56 but with the curve which obviously had to be there became an 86. ", "author": "colebreeze23", "created": 1539228642, "upvotes": 1}, "e7jzk6b": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jzk6b/", "text": "My calc class avrg was a C-. Do you think every student just didn’t get it? Or you just didn’t test/teach correctly?", "author": null, "created": 1539228602, "upvotes": 1}, "e7jzg6w": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jzg6w/", "text": "This reminds me of my favorite college professor, who is now a very close friend years later. He has usually had one of the highest pass-rates of any English professor at the universities where he has taught, and ironically it's been a serious hindrance to his career. His classes aren't easy by any means; his pass-rates are high because he works damn hard to make sure every student can understand and relate to the subject matter and so is prepared for the exams.\n\nWatching someone so dedicated, so talented, go through hell just because he is actually a good teacher is the reason I decided not to go into academia.", "author": "perdistheword42", "created": 1539228475, "upvotes": 139}, "e7jyp8c": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jyp8c/", "text": "I had to deal with a lot of that in programming. Teachers had 50% failure rate in their courses. The head of the computer science department tells the dean 'well computer science is hard' and the guy agrees and so they change nothing. The teachers are so bad. But they are so proud that 'not everyone will make it.' No you doofus, making a couple for loops and arrays isn't hard, you just suck at teaching.\n\n&#x200B;\n\nedit also how I know what the head dude told the dean - because my teacher who was in on the meeting told me about it.", "author": null, "created": 1539227651, "upvotes": 1}, "e7jyh03": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jyh03/", "text": "Life isn't a participation prize. No matter how smart you think you are, you will fail eventually (unless you were born rich/riding your parents' coattails).\n\nYou're free to blame other people for your own failures. That doesn't make them any less \"your failures\".", "author": "GamesAcct", "created": 1539227398, "upvotes": -4}, "e7jy2se": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jy2se/", "text": "Not sure how your profs do it, but for my classes the grades are relative, so the low pass rate doesn't really make sense because if the mean is a 30 then depending on the SD kids who get 10 could still \"pass\" the exam with the curve. ", "author": "CornHellUniversity", "created": 1539226978, "upvotes": 1}, "e7jxy0m": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jxy0m/", "text": "I had a finance teacher who had a policy for tests where if over 50% of the class got a question wrong, everyone gets to count it as correct. Her logic was that if more of the class didn't get it than got it, she didn't teach it very well. ", "author": "I_might_be_weasel", "created": 1539226838, "upvotes": 3}, "e7jxxae": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jxxae/", "text": "Considering how many people are in college that shouldn't be, saying a class is \"difficult\" doesn't tell me much. People get Cs in business school for fucks sake.", "author": "Sparky01GT", "created": 1539226818, "upvotes": 1}, "e7jxrd4": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jxrd4/", "text": "I'm about to graduate (somehow) with having failed almost every test I took at my college. The fact that these profs are proud that their class average is a 75 even blows my mind. That means that 50% of your class is getting below that. Depending on standard deviation, 15% of the class wi be getting failing grades. To me, that's absurd. ", "author": "asamin", "created": 1539226650, "upvotes": 0}, "e7jxlvz": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jxlvz/", "text": "Yes! If they have such high fail rates then they are failing as an educator because they are not successfully educating their students!! I'm lucky in that both my professors this semester bragged about their high pass rates and wanting to work with students through their unique challenges. ", "author": "piercedlovely", "created": 1539226494, "upvotes": 1}, "e7jxiel": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jxiel/", "text": "I haven't seen that *exact* situation, but I've dealt with similar and the exact opposite:  \n\n\nMy first college was an engineering school, and even if you majored in one of the humanities you'd still be taking high-level math and science classes.  The professors *wanted* students to pass and understood that many would find the material challenging. Lots of study sessions, office hours, etc (and some of the study sessions were literally the professor going over example problems that *turned out to be the actual test*...maybe morally questionable, but I kept my mouth shut).  Basically they *wanted* you to pass and would give you every tool possible.  The guys that failed out were the ones who played PS2 all night, didn't go to study sessions, didn't understand the material, and were *still* flabbergasted that they'd do so poorly.  \n\n\nMy second school (transferred) was way more liberal-arts oriented.  Most of the professors were pretty awesome, but the head of my department was a mean old tenured devil that bragged about her ability to keep people from graduating.  She liked marking people down for no reason besides their audacity to wear makeup to an 8 am class. She hated me (as she hated all other males in our major), and tried sweating me in her office about a passing grade in my final class with her.  I called bullshit (I'd done fantastic work my entire time there, so I dunno what would have happened if she decided to actually fuck with me and I had to go to somebody above her in the food chain), she demurred and gave me a B (which was kinda bitchy, I felt my work was on-par or exceeded that of some \"A\" students, and I'd had two years of working with most of them to compare/contrast with).    \n   \nBut overall I think the \"my class is SO hard\" mentality is pretty dumb.  It's not SEAL training, it's college.  ", "author": "m053486", "created": 1539226392, "upvotes": 1}, "e7jwilm": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jwilm/", "text": "My moms a college professor and she told me the exact same thing. \n\nHaving students fail your class is not an accomplishment, it truly shows how inadequate your teaching abilities are and unfortunately that state of mind hasn’t died off yet. ", "author": "igaveuponausername", "created": 1539225370, "upvotes": 3}, "e7jw869": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jw869/", "text": "For some strange reason this reminds me of people who brag about not adding salt when they cook. Ok so your food tastes like shit and you’re proud of it, interesting. ", "author": "currentlyvacationing", "created": 1539225078, "upvotes": 0}, "e7jw848": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jw848/", "text": "The average for Calc 3 exams are 30-40%", "author": "KingSawyer18", "created": 1539225077, "upvotes": 2}, "e7jw4em": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jw4em/", "text": "One of my new favorite tweets something along the lines of:\n\nprofessor: rarely anyone gets As in this course\n\nme: weird flex but ok", "author": "NadoSecretAsianMan", "created": 1539224974, "upvotes": 66}, "e7jup5q": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jup5q/", "text": "Yeah grades are more reflective of the course than the students. If I work my ass off and only get a D- then part of the fault lies in not being able to teach the material.", "author": "Needyouradvice93", "created": 1539223546, "upvotes": 3}, "e7jucxf": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jucxf/", "text": "The counterpoint is something like an engineering or medical course where the subject matter is inherently difficult, and if students pass without internalizing the course then people might die. Yeah the prof should be trying real hard to get every student to learn the material, but sometimes the subject matter is hard, and scaring people with the pass rate in the first lecture might get them to take the course a bit more seriously.", "author": "PersonalPronoun", "created": 1539223196, "upvotes": 61}, "e7ju6hy": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ju6hy/", "text": "My current prof brags about him having the lowest registration. Just for scale this is a lecture hall type class and there are 30 students... 15 after the 1st exam... ", "author": "DwightSchruteBurner", "created": 1539223009, "upvotes": 4}, "e7ju08b": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7ju08b/", "text": "Filtering out students is archaic, its 50s education where we needed to separate white collar from blue collar.  It persists, though we no longer should filter students, because its an easier way to get your education check; give a multiple choice test, grade it on a curve, and youre done.  Teach for a piece of paper and your students will also chase paper.  There is a movement to teach for learning but its fighting years of tradition. ", "author": "treeclimbingfish", "created": 1539222831, "upvotes": 40}, "e7jtz96": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jtz96/", "text": "Two semesters ago I was in a class of 25. The first day the professor asked which of us were taking the class because we'd failed his class the first time around. 18 people raised their hand. \n\nIt was the most intense semester of my life.", "author": "GrayCoffee", "created": 1539222803, "upvotes": 792}, "e7jtdnp": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jtdnp/", "text": "I understand that a class shouldn't be an easy A. A class should also not be one where it's easy to fail even if you put in all the effort you could.", "author": "abnormallyme", "created": 1539222187, "upvotes": 3}, "e7jtblf": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jtblf/", "text": "I completely agree. School shouldn't be labyrinthine. It shouldn't be a walk in the park either. I like to think of it as a long, arduous, yet clearly marked hike. ", "author": null, "created": 1539222129, "upvotes": 5}, "e7jsnb5": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jsnb5/", "text": "It’s a brag only because they’re trying to say that they’re too smart for most people to understand. Though, if you cannot properly communicate your ideas to others, they are worthless. \n\nFurthermore, if these concepts that the profs are teaching are so complex that they think people in their class won’t understand it, they shouldn’t be teaching. The sign of a good teacher is someone who can explain complex concepts and theories to anyone. ", "author": "duncsterable", "created": 1539221439, "upvotes": 3}, "e7jsmx5": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jsmx5/", "text": "low pass rates is not something to brag about, but I did have this one professor constantly stressing about the low pass rate, but to me they were doing it to motivate the students because the material was easy, but you had to pass the final exam to pass the course, department policy not professors so in a sense it can be a motivator and a heed of warning to buckle up and study hard.", "author": "Muinonan", "created": 1539221428, "upvotes": 5}, "e7jsc6u": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jsc6u/", "text": "Making a class rigorous (\"difficult\") is something to celebrate *if* it means students are meeting the learning goals. Making a class difficult solely so you can fail people is assinine. Making a class so difficult that large percentages of people fail and then *keeping* it that way over time is simply irresponsible. As a department chair I monitor the overall GPAs assigned by my colleagues...if I had one who was routinely failing large numbers of students we'd be having a serious conversation about her/his course design, pedagogy, and suitability for teaching in our department.  If you intentionally design and deliver a class your students cannot succeed in you have no business being a teacher. Yes, they must earn the credit and yes, there should be a significant distribution of grades...but bragging about failing students is, in my experience, more a sign of a failed professor.\n\nIn my department we try to calibrate our courses so that on average we're awarding 10% A grades (because officially A=\"excellent\"). We also seek to fail no student who does the minimum that we ask, i.e. if they pass all the assignments and attend the class they will likely earn a D. Intentionally designing a class that large numbers of students cannot pass is the academic equivalent of malpractice.", "author": "SnowblindAlbino", "created": 1539221127, "upvotes": 192}, "e7jqcu5": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jqcu5/", "text": "I’m in general chemistry this semester and the class average on the first exam was a 54%. And my professor refuses to curve. I knew it would be bad so I signed up for tutoring right away and I managed to scrape an 81% on it, but still. If your class average is failing, either you’re not teaching or your exams are too much. \n\nEdit for spelling", "author": "judolphphph", "created": 1539219116, "upvotes": 7}, "e7jmo8g": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jmo8g/", "text": "I would also point out that hard classes are not necessarily the most valuable in terms of learning. My AutoCAD class was the easiest of my engineering curriculum, but I learned a vast amount of highly useful information. ", "author": "Roughneck16", "created": 1539215428, "upvotes": 7}, "e7jl1m5": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jl1m5/", "text": "At my first school College Algebra had a very low pass rate. And I remember thinking that was dumb and I failed it. \n\nI barely made it into that class and I thought it was weird how I was somehow starting in a level I considered low. But a lot of kids go into college thinking they have better math skills than they actually do. And I think the school knew that. \n\nI actually had to go back to a lower level and relearn basic algebra concepts I somehow never learned in high school. \n\nI also work as an English and writing tutor in my school and you’d be surprised how horrible some students writing abilities are, well into their junior and senior year. \n\nI think some professors realize they are getting students who aren’t ready for certain classes and are deciding to teach classes for what it is, even if it means less students pass. \n\nI’m not saying some teachers aren’t getting off at the thought that they are teaching the toughest classes and like knowing not many students get As, but sometimes it’s good to instill that fear into a student so they take it serious. \n\n\n\n", "author": null, "created": 1539213784, "upvotes": 22}, "e7jjisi": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jjisi/", "text": "[deleted]", "author": null, "created": 1539212290, "upvotes": 19}, "e7jj6ye": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jj6ye/", "text": "If an instructor brags about this I drop their class.\n\nEdit: who knew choosing to go to an instructor that isn't hostile would be so triggering?! ", "author": "broomzooms", "created": 1539211977, "upvotes": 474}, "e7jefkn": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jefkn/", "text": "why the hell would that be a bragging point.. that makes them look bad", "author": null, "created": 1539207616, "upvotes": 268}, "e7jd9yq": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jd9yq/", "text": "While I don't agree with bragging about a class being difficult- I think in recent years there has been a push to increase students grades. No longer is a 3.0 gpa really considered that impressive because in lots of majors- course averages are a B+ or A-. \n\n\nGrade inflation is a real problem and students tend to complain about their grades when they don't get an A on every single assignment. It's only getting worse as the years go on. Maybe you interpreted it as bragging, but I've had professors in the past who made it clear that they don't just hand out A's and that it's okay to get lower marks on assignment because of the difficult nature of the material. \n\nProfessor might be a dick for bragging about how they grade lower- but I don't think the tests are unfair or he's doing something wrong just because they are stricter on grading. If anything- the teachers that basically hand out A's are the ones in the wrong, in my opinion. ", "author": "chevybow", "created": 1539206614, "upvotes": 174}, "e7jcn7r": {"link": "/r/college/comments/9n3fj4/low_pass_rates_are_not_something_to_brag_about/e7jcn7r/", "text": "it’s like people who brag about how much work they do and how little sleep and free time they get. ", "author": "fuckthisfuckingsite6", "created": 1539206074, "upvotes": 2266}}}