{
  "sid": "qsiq3e",
  "link": "/r/college/comments/qsiq3e/how_do_you_find_a_job_after_graduating/",
  "title:": "How do you find a job after graduating???",
  "text": "I graduated in spring, had an internship in Chicago that I had to travel 4 hours (round trip for), and now I CANNOT find a job!!!\n\nI graduated summa cum laude, I graduated 2 years early, and I'm better in my field than most of the alumni I graduated with. \n\nI know that I can exceed at any job in my field, but they all require 3-5 years of experience. HOW AM I SUPPOSED TO GET THAT??? I've used up all of my savings. Am I supposed to just keep taking 3 month internships until I've got 3 years of experience? It makes me so sad to think I have to work for free when I know I'm highly skilled in my field. There also aren't any internships close to me, and if I did another one, I'd still have to take the train to Chicago every day!\n\nPlease, give me hope ! I'm applying for graduate programs next year, but if my job search is a glimpse at how my applications are looked at, I'm kind of ready to give up before I start. I was planning on building up my savings before grad school, but I guess if I even get in, I'll be even worse than I am now.",
  "author": "languid-libra",
  "created": 1636745070,
  "updated": 1637390354,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkdaoiw": {
      "link": "/r/college/comments/qsiq3e/how_do_you_find_a_job_after_graduating/hkdaoiw/",
      "text": "That’s exactly my experience! Every single job I’ve looked at has been emphasising on wanting candidates with 3-5 years of experience even for so called “entry-level positions” and graduate level jobs, which makes no sense as most graduates would only have 1 year max of internship experience. otherwise - they’ll pay you peanuts or openly subject you to corporate exploitation. \n\nIt’s very much down to luck - I know people think luck doesn’t exist, but you need luck on top of an intelligent and resourceful CV. \n\nFor me I kinda gave up, so I’m running my own business and doing side investments instead. I know that’s not possible for everyone but I gave up trying to be an employee.",
      "author": "illestheartbreaker",
      "created": 1636745333,
      "upvotes": 1,
      "replies": {}
    },
    "hkdd3gt": {
      "link": "/r/college/comments/qsiq3e/how_do_you_find_a_job_after_graduating/hkdd3gt/",
      "text": "Apply anyway. In many job listings the qualifications are listed for an ideal candidate. My job was originally for someone with more experience than me but pivoted due to COVID and because of my experience -- but they were interested in interviewing before the COVID chanfes happened.",
      "author": "dragonair907",
      "created": 1636746371,
      "upvotes": 2,
      "replies": {}
    },
    "hkdyxxj": {
      "link": "/r/college/comments/qsiq3e/how_do_you_find_a_job_after_graduating/hkdyxxj/",
      "text": "Your resume could suck. Pay an editor to check it out. People do it all the time, especially for those first jobs.",
      "author": "zifmer",
      "created": 1636755845,
      "upvotes": 1,
      "replies": {}
    }
  }
}