{
  "sid": "q86q1s",
  "link": "/r/college/comments/q86q1s/does_anyone_else_feel_like_all_they_do_is_go_to/",
  "title:": "does anyone else feel like all they do is go to campus for class and to study and that’s it?? feeling like there should be more than i’m doing?",
  "text": "hi everyone apologies for the weird post and formatting i’m on mobile and this also just sort of popped into my head. i’m a sophomore in college and i’ve realized that ever since school started all i’ve been doing during the week is going to campus for class and to study in between classes. occasionally i’ll meet with a friend for lunch, but i haven’t really met that many people in my classes either. i usually just head back to my dorm after classes... and feel strangely unfulfilled?? i am trying to get involved through clubs but most of the ones i am in only meet once or twice a month. i just feel like i should be doing more? does anyone else feel this way?",
  "author": "rosiesi",
  "created": 1634239213,
  "updated": 1634591175,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hgnegmh": {
      "link": "/r/college/comments/q86q1s/does_anyone_else_feel_like_all_they_do_is_go_to/hgnegmh/",
      "text": "I do the same thing. Clubs aren't anything for me. I'm the only one in my class that does this and it feels strange and lonely",
      "author": "jelkoe",
      "created": 1634240457,
      "upvotes": 4,
      "replies": {
        "hgp0fiq": {
          "link": "/r/college/comments/q86q1s/does_anyone_else_feel_like_all_they_do_is_go_to/hgp0fiq/",
          "text": "My school has clubs but because of Covid they’re either downsized or they’re mostly online. It doesn’t feel the same. They are slowly but surely reopening stuff though.",
          "author": "CapriciousSalmon",
          "created": 1634267307,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hgnn9g2": {
      "link": "/r/college/comments/q86q1s/does_anyone_else_feel_like_all_they_do_is_go_to/hgnn9g2/",
      "text": "Have the same feeling",
      "author": "ukbep",
      "created": 1634244083,
      "upvotes": 1,
      "replies": {}
    },
    "hgofy50": {
      "link": "/r/college/comments/q86q1s/does_anyone_else_feel_like_all_they_do_is_go_to/hgofy50/",
      "text": "I’ll offer some free advice. College is nothing like what it seems like in the movies. Sure some people party like they do in the movies, but reality is that a majority of your campus isn’t going to. You don’t HAVE to do anything. If you want to branch out, by all means, have at it. But you don’t have to go out and do things to have a good college experience. I think the only thing I actually did on campus was go for ice cream one time. If you’re feeling lonely, try to make some friends. And the single easiest way to do that, and it will almost always work (it’s never failed me), is to compliment someone. Say you like their shoes, ask where they got them. Tell them you liked what they said in class. Tell them their haircut looks good. Just say something nice and go from there.  Once you have a semi-solid friend group, it won’t feel so empty anymore.",
      "author": "4thGenS",
      "created": 1634257941,
      "upvotes": 10,
      "replies": {}
    },
    "hgor04p": {
      "link": "/r/college/comments/q86q1s/does_anyone_else_feel_like_all_they_do_is_go_to/hgor04p/",
      "text": "Try joining an organization! It’s a little different from a club, at least in my university. Like there’s a difference between the Anime Club versus the LQBTQ+ Resource Center, for example. Or even Greek Life like fraternities and sororities (there are even co-ed ones). Try to find an organization that opens up different sections of opportunities with different departments that will help create networks versus a club that focuses on a single activity. \n\nJoining an org was one of the best decisions I’ve made in college and it has opened up so much.",
      "author": "issaajoy",
      "created": 1634262941,
      "upvotes": 3,
      "replies": {}
    },
    "hgr55vw": {
      "link": "/r/college/comments/q86q1s/does_anyone_else_feel_like_all_they_do_is_go_to/hgr55vw/",
      "text": "OMG yes. All I do is come to campus for class, do my work/study, and go back home. Firdays are reserved for time with my bf but otherwise I dont feel like I have made many (if any) meaningful connections as I had hoped. Im really shy and awkward. Next week though Im going to go to anime club so maybe I can make a friend or something\n\nIdk man",
      "author": "Mushy-froug",
      "created": 1634314208,
      "upvotes": 1,
      "replies": {
        "hgr59vu": {
          "link": "/r/college/comments/q86q1s/does_anyone_else_feel_like_all_they_do_is_go_to/hgr59vu/",
          "text": "Im in my 2nd year of community btw, for reference",
          "author": "Mushy-froug",
          "created": 1634314253,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh30hbj": {
      "link": "/r/college/comments/q86q1s/does_anyone_else_feel_like_all_they_do_is_go_to/hh30hbj/",
      "text": "Join a club that only has a few members. The fewer the members, the more you will get to know each other. \n\nJoin a club in which you can take an active role instead of a club in which meetings are held every now and then.",
      "author": "Mean-Parking-2307",
      "created": 1634541877,
      "upvotes": 1,
      "replies": {}
    },
    "hgqc808": {
      "link": "/r/college/comments/q86q1s/does_anyone_else_feel_like_all_they_do_is_go_to/hgqc808/",
      "text": "I'll explain to you what it's like outside of college, without a degree. I worked woodworking for close to a decade before coming back to finish my degree. \n\nI would wake up at 6 AM to leave my house at 7 AM to get at work by 7:30. Wood working is almost all on a 10 hour shift, so I'd be at work until 6 PM. I'd drive home and get home at 6:30. \n\nFrom 6:30 to around 7:30, I would dilly around to finish up dinner. By 8 I'd eaten and cleaned up the kitchen from cooking. From there I'd take a shower and it's 8:30. \n\nAt 9:30 I would go to bed because I was beat from standing on concrete for 10 hours straight. \n\nCollege, in my experience, has been a fucking cakewalk. We all have different experiences though.",
      "author": "Awkward_Mail_2786",
      "created": 1634301250,
      "upvotes": -1,
      "replies": {}
    }
  }
}