{
  "sid": "qchohu",
  "link": "/r/college/comments/qchohu/college_advisors/",
  "title:": "College Advisors",
  "text": "I am a sophomore in college with freshman credits because I transferred. So I know how having an advisor works or should work at least. \n\nI had my first meeting this year with my new advisor, she’s my biology professor (I’m a bio major, pre-dental), she’s only been working for two years and she’s 28 so I’m her first ever batch. The only class I’m doing bad in is in hers lol but I’m actually trying. She asked me what I was going to do about my grade and I said “I contacted a tutor and plan on meeting with him weekly until my next exam. I know he takes your genetics class and he was going to introduce me to the study methods he’s using.” I really thought that she would be happy that I’m actually trying to pass her class by reaching out to a tutor but instead she snaps at me saying that genetics is nothing like biology and that biology should be easy. She said the study methods he’s using for genetics will not help me for biology. I was honestly speechless so I didn’t saying anything and just nodded. \n\nAren’t advisors supposed to be more supportive than this? Should I change my advisor? I’m doing better in Chemistry, should I just change my major?",
  "author": "jbxblair",
  "created": 1634784370,
  "updated": 1634849270,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.66,
  "comments": {
    "hhg3myo": {
      "link": "/r/college/comments/qchohu/college_advisors/hhg3myo/",
      "text": "💔 I’m so sorry.  If changing advisors is an option, it might be worth it. \n\nIME (12 years as undergrad advising coordinator), the quality and supportiveness *really* varies.  Faculty are overworked, and that’s not an excuse, but it’s a huge reason I really prefer a professional advising model with faculty career mentoring, instead of bogging faculty down with academic advising.  But that’s neither here nor there.  \n\nYour experience is, sadly, not abnormal.  But you might have better luck with another person\n\n\nDo *not* change your major because of her.  Only change your major if Chemistry is a better fit for you & your career goals",
      "author": "NoFilterNoLimits",
      "created": 1634785002,
      "upvotes": 1,
      "replies": {}
    }
  }
}