{
  "sid": "qhug8q",
  "link": "/r/college/comments/qhug8q/advice_on_whether_or_not_i_should_switch_to_a/",
  "title:": "Advice on whether or not I should switch to a program instead of major",
  "text": "This is my first semester in college and so far it’s ok. I’m majoring in Psychology but recently I found out about this program my college does in which I attend for 18 weeks and if I pass the exam I get certified. However, if I do the program I lose two of my three scholarships because technically it’s not part of my college; but, if I do the program and fail I plan on going back to college (but then I’ll only have the FAFSA to help me pay for schooling). Either that or I guess I can transfer to a community college and hope they give me scholarships for attending. I just don’t want to take out any loans because I know I’ll be in crippling debt if I do. This is making stress out financially because I really did not want to go to college, but the salary of a job that requires no degree sucks. Any advice on what I should do or what you would do in my situation? Thanks!",
  "author": "xbbrandiix",
  "created": 1635448918,
  "updated": 1636184809,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hif6n7k": {
      "link": "/r/college/comments/qhug8q/advice_on_whether_or_not_i_should_switch_to_a/hif6n7k/",
      "text": "Depends on the specific benefits that the certification of this program would offer you, which you don't elaborate on. It seems that one benefit, at least, is that you're interested in it, so that's one point in favor of it. How are career prospects with the certification? What are your chances of failing?",
      "author": "HumanDrinkingTea",
      "created": 1635450212,
      "upvotes": 1,
      "replies": {
        "hif9c40": {
          "link": "/r/college/comments/qhug8q/advice_on_whether_or_not_i_should_switch_to_a/hif9c40/",
          "text": "So the program is medical billings and coding, which has twice the salary of the careers I looked into with having a four year degree in psychology. Typically about 80% of people pass the CPC certification exam. With certification I could work from home, freelance, or have an office in hospitals or blood assurance places. It seems like a good trade to switch to the program but it’s never a guarantee that I’ll make it.",
          "author": "xbbrandiix",
          "created": 1635451291,
          "upvotes": 1,
          "replies": {
            "hifnps7": {
              "link": "/r/college/comments/qhug8q/advice_on_whether_or_not_i_should_switch_to_a/hifnps7/",
              "text": "I say go for it then. 80% is a high pass rate and if you're a good student in general you probably have a higher than average chance of passing. \n\nAlso, if you fail the first time, do you never get a chance to take the exam again?",
              "author": "HumanDrinkingTea",
              "created": 1635457138,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hif6zr2": {
      "link": "/r/college/comments/qhug8q/advice_on_whether_or_not_i_should_switch_to_a/hif6zr2/",
      "text": "Certified in what exactly? \n\nUnfortunately, even if you get certified you may end up in the same position of finding lower paying jobs. Even an Associate’s these days is not enough. I suggest looking at the positions the salaries offered for which you can get with the certification, and make your determination accordingly.",
      "author": "kizeltine",
      "created": 1635450351,
      "upvotes": 1,
      "replies": {
        "hif9uyk": {
          "link": "/r/college/comments/qhug8q/advice_on_whether_or_not_i_should_switch_to_a/hif9uyk/",
          "text": "I would be certified in Medical Billings and Coding. The salary seems great (my dad knows a couple of people who are in this career field and make good money) and it’s more than it would be if I did something with a four year psychology degree. I’m just worried that if I don’t pass the exam it would mess with my plans to complete my psychology degree financially.",
          "author": "xbbrandiix",
          "created": 1635451501,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}