{
  "sid": "r0o8js",
  "link": "/r/college/comments/r0o8js/anybody_else_sad_that_their_family_doesnt_visit/",
  "title:": "anybody else sad that their family doesn’t visit?",
  "text": "i mean about family who are relatively close, i go to college about an hour and a half away from home and throughout my two years here my parents have only visited me once and my siblings haven’t come here at all. is this normal? is it weird to feel upset by this? anybody else relate?",
  "author": "Funny-Put9487",
  "created": 1637704179,
  "updated": 1638207395,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hltpenj": {
      "link": "/r/college/comments/r0o8js/anybody_else_sad_that_their_family_doesnt_visit/hltpenj/",
      "text": "From what I've witnessed from other acqhaintances, their family vsitis at least twice per session, afger midterms the other one after finals, that seems to be the norm for even grad students. Less than that its those who are in bad terms with their parents and more than that is usually people who are either very close or have more free time than usual.\n\nSo i dont consider it particularly common in your case as they arent even that far.\n\nI recommend you communicate it to them and schedule something as ,maybe this is their way to avoid inconvenience you",
      "author": "ThatOneSadhuman",
      "created": 1637705753,
      "upvotes": 3,
      "replies": {}
    },
    "hltzuuq": {
      "link": "/r/college/comments/r0o8js/anybody_else_sad_that_their_family_doesnt_visit/hltzuuq/",
      "text": "That does seem a little low, but if you follow up questions. Are your siblings younger than you, and or still living at home? Do you have a car? Are you living in a dorm? That doesn't necessarily excuse them, but if you live in a small dorm with a bunch of roommates they may feel like there's no place to just go hang out. If you don't have a kitchen in your apartment, then they'll have to eat out which is an expense. And if your siblings are younger, they may still be busy with all sorts of high school and middle school activities for them.\n\nOn the other hand, they might just think they're being respectful of your Independence. If you've never told them that you want them to visit more, maybe they don't know. For me, when I was at College about an hour away from home, they came and picked me up every single first Sunday of the month. It was scheduled so I could plan, and so good day. Plus if you're an hour and a half away, and don't have a car, and they don't want to spend time in your college dorm/town, it's a 3-hour round trip each way for them to pick you up and bring you home. Again, not an excuse, but something to think about.",
      "author": "Thelton26",
      "created": 1637710259,
      "upvotes": 2,
      "replies": {
        "hlu06wi": {
          "link": "/r/college/comments/r0o8js/anybody_else_sad_that_their_family_doesnt_visit/hlu06wi/",
          "text": "yeah i get that. my siblings are a few years older, i live in a house with roommates and ask them to visit often but it’s always “no not today”. we all have cars.",
          "author": "Funny-Put9487",
          "created": 1637710407,
          "upvotes": 1,
          "replies": {
            "hlu0n7o": {
              "link": "/r/college/comments/r0o8js/anybody_else_sad_that_their_family_doesnt_visit/hlu0n7o/",
              "text": "In that case, I would definitely say that you should expect them to be doing more. Maybe it might take a show of good faith, for you to go meet up with them somewhere closer to them first, but I think reciprocation is warranted. Best of luck!",
              "author": "Thelton26",
              "created": 1637710611,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hluptv9": {
      "link": "/r/college/comments/r0o8js/anybody_else_sad_that_their_family_doesnt_visit/hluptv9/",
      "text": "My parents have never visited me during my entire college career so you're not the only one.",
      "author": "sushimonster13",
      "created": 1637722390,
      "upvotes": 1,
      "replies": {}
    },
    "hlvyr9m": {
      "link": "/r/college/comments/r0o8js/anybody_else_sad_that_their_family_doesnt_visit/hlvyr9m/",
      "text": "My mom never came up - she just couldnt do the drive and the travel with the other kids and her job.  My dad came up once.\n\nIf they support you in other ways and are on your side let it slide.\n\nOr talk to them about it in a non aggressive way so that you understand.  Or they do",
      "author": "PersephoneIsNotHome",
      "created": 1637751642,
      "upvotes": 1,
      "replies": {}
    }
  }
}