{
  "sid": "qvlc0g",
  "link": "/r/college/comments/qvlc0g/a_professor_responded_to_my_email_asking_for/",
  "title:": "A professor responded to my email asking for research, but I don’t have a CV or resume?",
  "text": "A professor responded to my email asking for research, but I don’t have a resume?\n\nI’m a sophomore biology student, and I’ve been sending out emails to professors asking for research. One responded today asking to see my CV and transcripts. Because I’m trying to get my foot in the door, I haven’t had any positions in a lab before - but I do have a resume involving all of the community service and leadership groups I did in high school or back home like my job, that I wrote up for a professional biology frat rush a few weeks back.\n\nObviously, I feel like this is a bit juvenile... but I literally do not have any other professional positions, especially with COVID and nothing being in person last year.\n\nWhat should I do? \n\nAnd what exact transcripts should I be sending? My GPA is 3.38, they’ll see like gen chem and that I’m taking orgo and cell bio etc, right?",
  "author": "ATeamPlayer1",
  "created": 1637105590,
  "updated": 1637389161,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkx7dz1": {
      "link": "/r/college/comments/qvlc0g/a_professor_responded_to_my_email_asking_for/hkx7dz1/",
      "text": "Did he ask for an official transcript? If he is the professor at your university, most likely he just want to see a most up to date unofficial transcript, unless you are applying for some program.\n\nFor the resume, just go to the career center, ask your friends, or look online for the template, always tailor your resume to the position you apply to, think about what they want to see and put them on there.\n\nYou are just a sophomore, I don’t think they would expect you to have any decent work experience so don’t worry about it.",
      "author": "hellohello_2010",
      "created": 1637107328,
      "upvotes": 3,
      "replies": {}
    },
    "hl76ps1": {
      "link": "/r/college/comments/qvlc0g/a_professor_responded_to_my_email_asking_for/hl76ps1/",
      "text": "Hire a professional resume writer to stand out from the crowd of applicants. [This guy](https://cameronbrunt.com/resume) had my resume done in a couple of days as well as my cover letter and LinkedIn profile.\n\nThe key wording he used in my resume I went from 0 calls to 2-5 a week.\n\nWorth every penny and right now he even lowered his prices by 10% for a pandemic discount.",
      "author": "OliverR31",
      "created": 1637286271,
      "upvotes": 0,
      "replies": {}
    }
  }
}