{"sid": "irm4i2", "link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/", "title:": "Does anyone else feel like you can't enjoy a Saturday anymore due to online classes?", "text": "I usually take Sundays off from schoolwork. But now we have to spend Saturdays catching up on stuff you missed during the week or getting ahead so there isn't a traffic jam during the week.", "author": "_34_", "created": 1599949419, "retrieved": 1632801723, "over_18": false, "upvotes": 1829, "upvote_ratio": 0.99, "comments": {"g57qupc": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g57qupc/", "text": "I don’t even have weekends anymore. I’m going to burn out VERY soon. Everyday it’s wake up, eat/use the bathroom, study, eat, study then go to bed. Last semester online was better, and it had a better learning technique than now.", "author": "ElBarro69", "created": 1600074610, "upvotes": 3}, "g55x9sp": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55x9sp/", "text": "Do you homework in the week. You’re scheduled is the issues get all your homework done by Friday problem solved.", "author": "Northenwoodswolf", "created": 1600032199, "upvotes": -2}, "g55slce": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55slce/", "text": "Some people in here are like \"just do it by Friday\" and its like uh thanks Karen but not all of has have easy classes that you can just \"do it all by Friday\".", "author": "JayAggRev", "created": 1600030031, "upvotes": 4}, "g55ro9d": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55ro9d/", "text": "I literally had to drop a class so Id be able to have some time off. Im currently being very self destructive and basically not doing anything despite the fact I have a midterm due at midnight today because how burned out and unmotivated I am. After this semester Im only taking like 3 classes per term, including the summer to make up for this “small work load”. I know teachers think making tests on the weekend gives us more time to prepare, but what it really means is that we don’t get a single day off. I really need to get a job but just can’t because I wont be able to handle more work.", "author": "deprimada", "created": 1600029624, "upvotes": 3}, "g55o2ht": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55o2ht/", "text": "I just finished an assignment for this week today, and we get our new assignments on Mondays. For some classes I'm able to make a long weekend for myself by getting everything taken care of by Thursday, but lately it's just felt like I'm never taking a break", "author": "UsernamesAre4Nerds", "created": 1600028130, "upvotes": 2}, "g55mdwm": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55mdwm/", "text": "no i dropped out :)", "author": "dxiiv", "created": 1600027513, "upvotes": 2}, "g55koou": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55koou/", "text": "I can't speak for any other profs, but I actually made things due Saturday to be more flexible! I used to have all assignments due on class days, but now that only half the class comes at a time, that seems kind of pointless. I thought about having students turn in some work they days they don't come in (if you come on Wednesdays, your work is due on Fridays and vice versa) but that felt like I was imposing a structure for no reason given they wouldn't actually come to class. So I just made everything due at the end of the week on Saturday to give students the most flexibility, given I usually wouldn't look at it all until the following week anyway.\n\nI guess no good deed goes unpunished.", "author": "BewareTheSphere", "created": 1600026853, "upvotes": 1}, "g55kk7d": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55kk7d/", "text": "what do you think I’m spending my Saturday and today doing :(", "author": "lil-dlope", "created": 1600026805, "upvotes": 1}, "g55kcbl": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55kcbl/", "text": "Yep! A lot of stuff is due on Saturday, Sunday, or Monday for me. My weekends have been taken away and now we don’t even have a fall break even though our term is normal just because the last week of “classes” when we would be reviewing for finals is entirely online. We’re doing more work, but we don’t have ANY time off.", "author": "solaria-pheonix", "created": 1600026722, "upvotes": 1}, "g55h0xm": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55h0xm/", "text": "I do my homework after work on the weekdays when I am free. All my classes are online except my stats class which is once a week. I try to do everything a couple of days early so I can have those stress free days.", "author": "TheEvolutionOfCorn", "created": 1600025587, "upvotes": 2}, "g55e65c": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55e65c/", "text": "I always worked some on Saturday anyway, but now it's sunday's", "author": "JazzlikeSpinach3", "created": 1600024660, "upvotes": 1}, "g55cbpp": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55cbpp/", "text": "I feel this. I am in a grad program. 15 class hours Monday/Tuesday/Wednesday and a 16 hour internship Thursday and Friday. It's really rough and tiring. I don't really get times to take breaks. I try to but then I feel really guilty for trying to relax, like I don't have time. When I do try to relax, I keep thinking about school so it's not really relaxing lol. My due dates are Sundays so by the time I finish and turn everything in, it's already time to start the grind again on Monday.", "author": "lavender_scented", "created": 1600024090, "upvotes": 1}, "g55bnu9": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g55bnu9/", "text": "Yes. Right now I'm panicking that it's 3 pm on a Sunday and I haven't done any work today even thought I did work yesterday, all last week, and will be doing more all this upcoming week...maybe I should take a break? I just can't I have an exam coming up so relaxing makes me anxious ugh.\n\nBUT I do have to say reading everyone's responses makes me feel a hell of a lot better and way less alone through this all. It's so easy to forget that you're not the only one experiencing this when you're cooped up in your childhood bedroom all the time.", "author": null, "created": 1600023876, "upvotes": 1}, "g552rzb": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g552rzb/", "text": "for me everything is due wednesday and thursday, so it’s constantly working in due dates. and also one class of mine is due on bb disscussion but we have to reply 2 times but spread out so that’s even more hectic in a way if you forgot it. and also one prof asking to do saturday and sunday class since most of my online classes fall on monday and there’s a lot of holidays this september so i can’t even rest in the weekends smh", "author": "kwonbh", "created": 1600020981, "upvotes": 2}, "g54z84q": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54z84q/", "text": "I work full time and take online classes. I'm lucky if I get one night a week to rest. Usually I  study 3-6 hours a night and 12 hours each day on the weekends.", "author": "SublimeUniverse", "created": 1600019588, "upvotes": 1}, "g54xntm": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54xntm/", "text": "17 credits, eboard member, and one of my classes is considered the hardest for my major. It's not as bad as others have it so I've been able to sort of stay on top of things.\n\n\nI do work every day but I also relax every day. I'm not a fan of cramming work into 5 days and weekends off, I'd much rather prefer spreading work over the week and having a few hours of video games or leisure to myself every day.\n\n\nNot much I can do anyways. Most of my friends are also abstaining from going out because of COVID (or their parents won't let them) or they live far away or at college, so it's mostly just gaming with friends that are available that really constitute my leisure time.", "author": "StoicallyGay", "created": 1600019027, "upvotes": 1}, "g54wnr6": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54wnr6/", "text": "\"This is not a self paced course\" headass", "author": "MsCarriage_69", "created": 1600018637, "upvotes": 4}, "g54w742": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54w742/", "text": "My school is on week 6 now.. but I’m still in week 3 for some classes. My Saturdays aren’t mine anymore :(", "author": "lazairiaw", "created": 1600018472, "upvotes": 3}, "g54vbo6": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54vbo6/", "text": "Working 15 hours a week, taking 18 credits (6 credits at a graduate level) and studying for the GRE. I’m tired. I’m so tired. \n\nAnyone else have profs that are only opening discussion boards for 2-3 days. One of my classes has the discussion boards open on Fridays, and we need to make our first post by 8pm Friday night. Except I work 8 hours on Fridays and I can’t pre-write the discussion posts because I don’t know the topic ahead of time.", "author": "HighlyPolitical16", "created": 1600018142, "upvotes": 3}, "g54tw37": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54tw37/", "text": "Honestly, after high school the weekends don't mean the same anymore. Since my week is completely open and I can schedule it however I want, the weekdays are more of a weekend to me having both school and work (not a 9-5).", "author": "UpbeatFaithlessness6", "created": 1600017617, "upvotes": 5}, "g54shtq": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54shtq/", "text": "If I have something due on Friday I always try to turn it in Thursday so that way Friday all I have to do is go to classes and then I purposely don’t do homework or think about classes the rest of the day so I can have a break and can refresh my mind before the weekend. Because I do like to focus either on a Saturday or Sunday and just get all the homework done so, just taking Friday night off really really helps.", "author": "cottageoceanstoner", "created": 1600017097, "upvotes": 1}, "g54s849": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54s849/", "text": "This is my 3rd year at university. Normally I take 17 units a semester in person. I was signed up to take 17 units this semester but dropped a 2 unit class the 2nd week when I realized how challenging distance learning was going to be. I’m only taking 15 units and have absolutely no school-life balance. I know 15 units is “full-time”, but putting 9+ hours in Sunday through Saturday is not how 15 undergrad units is supposed to be. Distance learning is exhausting. Every week i’m learning a little more how to manage distance learning, and I adjust. I know I am adapting & one day i’ll achieve a balance. So far I haven’t missed an assignment and my grade average is an A. But again, no life just school. First round of exams are next week. Not sure how i’ll fit extra “study” time into my schedule without losing sleep, but I will figure it out. All in all, distance learning blows.", "author": "any1thinkofthis", "created": 1600017002, "upvotes": 5}, "g54ry1s": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54ry1s/", "text": "I feel you. I haven't had a free day since the semester started. I used to always take atleast Sunday off when classes were in person. Now that I am doing an nternship and taking classes online things have been much different. I feel like they have raised the coursework this semester. This weekend I decided I am going to take a day off anyway because I feel so burntout, I advise you should too :)", "author": "humansaremeh", "created": 1600016900, "upvotes": 1}, "g54kzy7": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54kzy7/", "text": "Online classes have gotten to a point for me where I have to work a significant portion of each day to finish everything and I’m getting sick of it", "author": "LobstrPrty", "created": 1600014001, "upvotes": 2}, "g54jose": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54jose/", "text": "attending class via zoom from my bedroom is really screwing me up rn there is no school life/home life balance anymore", "author": null, "created": 1600013455, "upvotes": 3}, "g54jg9z": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54jg9z/", "text": "Yep. Even though I love my weekends to study, it now feels like an obligation", "author": "iloveyou1220", "created": 1600013340, "upvotes": 1}, "g54fqkw": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54fqkw/", "text": "I have weekly tests for 2 of my 3 courses for the quarter. I have no weekends, it always feels like im playing catch up with the schedule", "author": "RonKosova", "created": 1600011717, "upvotes": 1}, "g54d2n6": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54d2n6/", "text": "Fuck yes. I took last Saturday off and boy did I pay the price on Tuesday. Spent 7 hours trying to finish my homework. To top it all, I start working this week. Don't know how am gonna do it.", "author": "huey764", "created": 1600010349, "upvotes": 3}, "g54bwsj": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54bwsj/", "text": "My day off from online class is Thursday, maybe Friday as well. Just how it came. Luckily, class sends in 3 weeks.", "author": "tillD2t", "created": 1600009801, "upvotes": 1}, "g54ar5c": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g54ar5c/", "text": "I felt like that even when we had in person classes", "author": "JessicaMurawski", "created": 1600009292, "upvotes": 3}, "g547kwb": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g547kwb/", "text": "I remember working on school work through weekends pre-covid/online classes. The only day I really got off from school work was Friday because I made sure to deliberately take that day off for myself no matter what. So unless I took really difficult or more time consuming than regular classes (I don’t think that’s the case lol), doing school work on Saturday + Sunday is fairly normal in college.", "author": "wierdfool5", "created": 1600008154, "upvotes": 1}, "g546tg4": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g546tg4/", "text": "i have assignments due almost every day, and i always feel guilty taking a day off, so i just... don't. i do try to keep evenings free to chill tf out but that doesn't always work out either", "author": "decafsucks", "created": 1600007864, "upvotes": 2}, "g5464l6": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5464l6/", "text": "Man, I haven't enjoyed a Saturday since I was twelve years old and began working full-time on weekends, lol. I also recently took a break from religion so my Saturdays went from Shabbat traditions to reading Geography journals and writing argumentative essays with the information therein.", "author": "AnothaCuppa", "created": 1600007611, "upvotes": 3}, "g544hui": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g544hui/", "text": "Our saturday holidays have been cancelled this semester, so theres only sunday to rest, enjoy and catch up on pending tasks/revision. 7 hour screen time daily is too exhausting!", "author": "just_abhi99", "created": 1600006984, "upvotes": 3}, "g5445l3": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5445l3/", "text": "Yeah, like why does it feel like if I stop for one day, I completely feel left behind and have to play catch-up? It's frustrating.", "author": "KaiserWilhelmDaThird", "created": 1600006855, "upvotes": 2}, "g542yvt": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g542yvt/", "text": "I had family come in town that I hadn’t seen in years, including my 89 year old great aunt. I did all my work by Friday so we could spend the weekend with them. Saturday one of my professors decided to post an assignment at 11 am that was due by 11pm the same day. We had gone out to the cabin they rented, so no internet. The ONE day I wanted to take Saturday off, it dropped my grade by almost a whole letter (our homework in this class is weighted very heavy to make up for online lecture). I’m pissed.", "author": "_Conservative_Hippy_", "created": 1600006395, "upvotes": 2}, "g53yeny": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53yeny/", "text": "Oh yeah weekends have always been my catch up days 😩", "author": "crystalliite", "created": 1600004727, "upvotes": 2}, "g53wzrj": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53wzrj/", "text": "I have zoom calls for my classes scheduled on Saturday. The professor says we have Sunday off but he schedules a quiz for Monday on the material we learned on Saturday so...", "author": "37scrub", "created": 1600004309, "upvotes": 5}, "g53vz64": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53vz64/", "text": "Since my school is doing all online my profs have decided that since everything is online, they can ask us for assignments on the weekend. So I have classes and everything that goes with it during the week and then even more projects due on Saturday and Sunday, and on labour day last week. It fucking sucks dude I have no free time anymore.", "author": "ThatUsernameTho333", "created": 1600004058, "upvotes": 1}, "g53se25": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53se25/", "text": "Just had my first Saturday class yesterday and it’s dreadful. I’ll be having the same 3 classes in just 4 days when Monday starts. It’s hard to relax as now I have to prepare for Monday and I’m getting overwhelmed.", "author": "munderhill22", "created": 1600002757, "upvotes": 2}, "g53qrzd": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53qrzd/", "text": "All my stuff is due on Tuesday, Friday, or Sunday. I sleep or whatever on Monday and maybe Saturday, then spend the rest of the week trying to rush through whatever bullshit my professors have me doing. I’ve been sitting here staring at my computer for hours trying to figure out this program for computer science because we literally get no real direction. Some unrelated examples using specific parts of the program to do something else maybe but I can’t connect it. I want to be in the classroom again with lectures and notes instead of a stack of textbooks and a list of assignments.", "author": null, "created": 1600002174, "upvotes": 4}, "g53nc7q": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53nc7q/", "text": "It's not just an online class thing, it's a college thing. Don't get me wrong, there's a lot I don't like about online/remote learning, but at the same time, I feel like people are using it as a scapegoat a lot.\n\nBefore, you knew if you didn't show up to a lecture, that was it. You either had to email the professor to see if they could catch you up, text your friends to ask what you missed, or just try to read the textbook and figure it out on your own.\n\nNow, with classes all being recorded, people feel like they have the freedom of missing classes, because \"oh it's just one lecture, I can watch it some other time\". Then come the weekend, they realize they have 16 hours of lectures to go through because of their mismanagement, and then go and blame it on online learning ruining their weekends.\n\nBefore you felt like if you missed a deadline for a homework assignment, that was it, your grade was down the toilet. Now, because of COVID, professors are (understandably) more open to deadline extensions, but that also gives a lot of us that false sense of security of \"oh well I can wait to do this cuz I can just ask for an extension.\" \n\nThose are just 2 examples of how it's less of an \"online classes bad\" narrative and more of a \"I'm mismanaging my time\" problem. Once again, not saying that there's nothing wrong w/ online learning (some professors feel the need to assign way more work purely because everything's online, for example), but having to do work on the weekends is 100% not an online classes thing, it's a college thing, and I'm sorry if I'm breaking any hearts here, but it's a life thing as well.", "author": "ZachTheYek", "created": 1600001080, "upvotes": 4}, "g53cz8w": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g53cz8w/", "text": "Not really. I start classes on monday and then marathon all my work that day since my teachers usually give me all the work I need to do on monday. If I don't finish it monday, then I have tuesday and Wednesday to do it. This is all with working 4 hour days at my job on each weekday, then 12 hour workday on friday. Then i usually have Saturday and Sunday off. It's all about marathoning and suffering the fewest days you can to have fun the rest of the days.", "author": "Linkster9", "created": 1599997473, "upvotes": 1}, "g52xu1o": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52xu1o/", "text": "Every prof thinks since we're \"just sitting at home\" we can do all the assignments plus some more. Any objection and they say \"What else you gotta do now?\"", "author": "Penis_popper", "created": 1599991101, "upvotes": 63}, "g52s7d5": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52s7d5/", "text": "my weekends now have no meaning :( they just feel like a regular weekday", "author": "jja_02", "created": 1599988780, "upvotes": 18}, "g52iu86": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52iu86/", "text": "didnt know other people were feeling like this too! \n\ni just started doing all my hw for the next class/week during lectures and primarily mon-tue-wed so that thur/fri is more chill and weekends are free. its honestly hell but I think it’s worth it (otherwise I would literally die.,, not even joking)... but I still feel like I risk missing assignment due dates 🤯", "author": "pechecerise", "created": 1599985036, "upvotes": 15}, "g52iq3x": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52iq3x/", "text": "definitely, i have assignments for 3 of my classes due on sundays and sometimes i have saturday classes so i’m literally always working, plus all our vacations have been cancelled so we don’t get any days off outside of weekends ://", "author": "buggie321", "created": 1599984981, "upvotes": 8}, "g52fxdj": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52fxdj/", "text": "Yup, and Sunday", "author": "trippyequid", "created": 1599983835, "upvotes": 2}, "g52fn8q": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g52fn8q/", "text": "Professor here.... yeah, I feel you. I’ve worked 7 days a week since March (with a few days I forced myself to stay away from the computer).", "author": "Nerobus", "created": 1599983707, "upvotes": 4}, "g529wra": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g529wra/", "text": "day off is basically non-existent here in my time at uni. online classes or otherwise. but i do have a couple of hours to dick around like here I am at reddit again lol", "author": "Hold0", "created": 1599981528, "upvotes": 10}, "g5282py": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5282py/", "text": "I feel happy to get a few hours a week to chill. But there’s definitely not a day I can do nothing anymore :(", "author": "psychcrime", "created": 1599980895, "upvotes": 4}, "g5241ad": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5241ad/", "text": "i just never stop. I smartly decided to take 5 classes for 18 credits. there are no days off. im dying already.", "author": "hardboiledegg69", "created": 1599979066, "upvotes": 101}, "g5209wq": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g5209wq/", "text": "I always have assignments due on Sunday. And I'm not taking online I'm taking remote...", "author": "aguafreska", "created": 1599977565, "upvotes": 5}, "g51rk1a": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g51rk1a/", "text": "yes! I have one class where our Zoom classes are scheduled on Saturday mornings and another that has everything due on Sundays. i’ve done online classes pre-covid and they just seem to be structured in a way where weekends are not a consideration in the same way that they are for in person classes. it’s honestly so draining.", "author": null, "created": 1599974153, "upvotes": 33}, "g51aa1t": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g51aa1t/", "text": "I do school 4 days in a row, work three days in a row and do school after work. My breaks are eating, showering and when my brain is so fuzzy even watching TV is too intricate for it to process.", "author": "Bodidiva", "created": 1599968745, "upvotes": 76}, "g517si0": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g517si0/", "text": "My schedule for this entire semester is work work work 7 days a week. Everyday there’s something I have to do that it school related and it’s usually something that requires lots of effort to even get done. No break days at all this semester.", "author": "moonsunbaenim", "created": 1599967606, "upvotes": 203}, "g517ajv": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g517ajv/", "text": "Uhh... I don't even get Sunday off from schoolwork :(", "author": "SanjivanM", "created": 1599967285, "upvotes": 54}, "g514q3n": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g514q3n/", "text": "In case any of ya'll are thinking of becoming a teacher (college or otherwise), I don't think there's been a week in the last 6 years where I haven't had to grade/lesson plan on a weekend or use at least one weeknight for the same.\n\nI lesson planned/put shit on the LMS for 8 hours today. I'll do another 3 tomorrow, then go to a 4-hour required meeting for the writing center where I work.\n\nI wouldn't recommend it!\n\nP.S. Is UIC in your tag UIC in Chicago? I taught there for a term.", "author": "brownidegurl", "created": 1599966249, "upvotes": 22}, "g50kwsm": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g50kwsm/", "text": "Had 3 classes today... so yeah :(", "author": "SACRED_SNAIL", "created": 1599960110, "upvotes": 18}, "g4ztrp6": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g4ztrp6/", "text": "for me almost everything is due on monday or friday so now my weekend is tuesday-wednesday.", "author": null, "created": 1599951112, "upvotes": 441}, "g4ztddh": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g4ztddh/", "text": "I never had a Saturday off from anything the whole time I was in school pre-corona because of work.  I took a mix of online and on-campus classes.  If you don't want to overload yourself on certain days, Saturdays are just another day.", "author": "xmarketladyx", "created": 1599951049, "upvotes": 44}, "g4zr0ko": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g4zr0ko/", "text": "Posting this to procrastinate on an essay I'm in the middle of writing, due tomorrow for an online class :( lol", "author": "jiyaski", "created": 1599950301, "upvotes": 73}, "g4zorfq": {"link": "/r/college/comments/irm4i2/does_anyone_else_feel_like_you_cant_enjoy_a/g4zorfq/", "text": "Yeah.... I haven't had a day off since school started about 4 weeks ago.", "author": "vhunter1991", "created": 1599949519, "upvotes": 454}}}