{
  "sid": "qpg85t",
  "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/",
  "title:": "Should I skip class for mental health reasons?",
  "text": "This is probably a really dumb question. So I have class today and I really don’t feel well mentally. My anxiety is genuinely through the roof and I feel like I just need a mental health night. However, I’m left with this guilt/feeling of missing out. Idk what to do. Should I just skip this one night?",
  "author": "chloexcloe",
  "created": 1636386099,
  "updated": 1636655223,
  "over_18": false,
  "upvotes": 571,
  "upvote_ratio": 0.96,
  "comments": {
    "hjtm3uo": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtm3uo/",
      "text": "Taking time for yourself isn’t a crime. If you were a “bad student” then you wouldn’t feel bad about missing class and miss class all the time. You not going to class today is similar to taking a night off of class because you have a cold and don’t feel good. Mental illness is still illness. If you have any friends in class you can ask them or check the syllabus or maybe catch your professor at the end of your next class and ask what you missed last class. At times it is good to push through it but as someone with anxiety problems as well, sometimes I just need a day to breathe. Being overwhelmed and just sitting in class and not absorbing anything isn’t going to help anyone",
      "author": "Crazy_Berry_4908",
      "created": 1636390273,
      "upvotes": 421,
      "replies": {
        "hjvew7f": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvew7f/",
          "text": "That's what I used to remind myself about missing class. Whether it was a mental illness or me having a fever, I would always feel so guilty about missing class and feel like such a bad student. I would remind myself that the fact I'm even feeling guilty about missing class is what separates me from people who just don't give a shit if they go to class or not. Hope OP keeps that in mind because they shouldn't have more anxiety when missing class due to their already built up anxiety. Just gotta focus on themselves and actually use the time off for them.",
          "author": "funkmydunkyouslunk",
          "created": 1636416778,
          "upvotes": 21,
          "replies": {}
        },
        "hjw0dpw": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjw0dpw/",
          "text": "I 100% agree with this except with the comment about asking your professor what you missed last class. It drives me bonkers when students do this. Talk to your classmates, gets notes, review the syllabi for what topics were covered, do the readings.. and then come talk to me during office hours if you still have questions about the material. I'm so much happier to help if the student puts in the work ahead of time.",
          "author": "neckbeardface",
          "created": 1636426518,
          "upvotes": 12,
          "replies": {}
        },
        "hjvy5h2": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvy5h2/",
          "text": "This. Just last week I made the decision to skip an orchestra sectional for reasons of needing time for myself (I’ve had a bit of a rough time lately with life in general, nothing in particular happened that made me upset it was just stress and bottled up stuff) and I love orchestra and felt really guilty for skipping this sectional. But also, sometimes you just gotta do what you gotta do.",
          "author": "DanielaThePialinist",
          "created": 1636425513,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjtec5n": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtec5n/",
      "text": "Hey everyone need a mental health day every once in a while.",
      "author": "ry_geb",
      "created": 1636387164,
      "upvotes": 113,
      "replies": {}
    },
    "hjtr769": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtr769/",
      "text": "People are being kinda rude in the replies lol but one day being missed is not the end of the world. Check your class syllabus and see the attendance policy and make sure you don’t make missing a habit (coming from a freshman who has skipped a couple classes already this semester lmao)",
      "author": "roachincalzone",
      "created": 1636392285,
      "upvotes": 204,
      "replies": {
        "hjtsunn": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtsunn/",
          "text": "Right? Like shit I asked for advice not a full personality analysis",
          "author": "chloexcloe",
          "created": 1636392939,
          "upvotes": 96,
          "replies": {
            "hju54qf": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju54qf/",
              "text": "As a sometimes professor - unless you already have a bunch of absences that will affect you- PLEASE take the day off and don’t worry about it. We have to take days off sometimes too. You’re forgiven.",
              "author": "clubtropicana",
              "created": 1636397901,
              "upvotes": 49,
              "replies": {}
            },
            "hju8fun": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju8fun/",
              "text": "Unless your taking a final on the day, it doesn’t matter if you skip as long as you know you’ll catch up. I frequently skip classes and just watch youtube lectures.",
              "author": "M33RHARIS",
              "created": 1636399235,
              "upvotes": 5,
              "replies": {
                "hjudsj8": {
                  "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjudsj8/",
                  "text": "A LOT of universities have a policy where you’ll automatically fail if you miss a certain number of classes",
                  "author": "Mountain_Rub_1055",
                  "created": 1636401377,
                  "upvotes": -4,
                  "replies": {
                    "hjue9qq": {
                      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjue9qq/",
                      "text": "Stop talking out of your ass. No, A LOT of universities don’t have that policy. Most of the times it’s a class policy.",
                      "author": "M33RHARIS",
                      "created": 1636401567,
                      "upvotes": 7,
                      "replies": {
                        "hjuggvx": {
                          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjuggvx/",
                          "text": "🤣🤣 I’m not talking out of my ass, it’s known. Unless *you’re* talking out of your arse w the idea that it’s not normal",
                          "author": "Mountain_Rub_1055",
                          "created": 1636402465,
                          "upvotes": -9,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjtsutv": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtsutv/",
      "text": "One night is probably not a big deal unless it turnes to a missing habit",
      "author": "Forusser",
      "created": 1636392940,
      "upvotes": 24,
      "replies": {}
    },
    "hju2yko": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju2yko/",
      "text": "Skipping class will not cause you to fail. You may miss out on today's lecture but I assume your teacher will post the readings etc. online. You don't have to, but I find it helps to be transparent with your teacher in these moments. Send your teacher a quick email explaining that you need a mental health day. If they are are a decent teacher/human being, they will be understanding. Try not to stress over it. I hope you feel better soon <3",
      "author": "lilsassprincess",
      "created": 1636397031,
      "upvotes": 20,
      "replies": {}
    },
    "hjtund3": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtund3/",
      "text": "Are you online or in-person? If online, do they record the sessions? If you are online you don't really even need to attend classes. I watch them all before the test at twice the speed. I know it sounds selfish towards the professors, but it's much less stressing and practical. Doesn't apply in-person though, so if you're in person, yeah, skip some, but make sure to catch up.",
      "author": "Fuba301",
      "created": 1636393652,
      "upvotes": 7,
      "replies": {}
    },
    "hjtc6bt": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtc6bt/",
      "text": "Seems like you already know the answer.",
      "author": "Aaalexisaa",
      "created": 1636386269,
      "upvotes": 26,
      "replies": {
        "hjtc9y5": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtc9y5/",
          "text": "I know but I’m like scared of missing important information and then not being able to learn it",
          "author": "chloexcloe",
          "created": 1636386310,
          "upvotes": 18,
          "replies": {
            "hjtf9o4": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtf9o4/",
              "text": "Reach out to your professor and explain your situation. If that's too intimidating, then talk to a classmate and ask them to help you catch up. If all else fails, check your syllabus to find what the lesson was about and watch a youtube video about it (from a credible channel, of course).",
              "author": "Temporary-Complex751",
              "created": 1636387542,
              "upvotes": 25,
              "replies": {
                "hjtijgp": {
                  "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtijgp/",
                  "text": "As a prof, please do #2 and #3 here before reaching out to the prof. What that often turns into is someone wanting the class personally summarized for them, which as you can imagine when teaching 80-100 students a semester (or more in lecture classes) becomes impossible to keep up with. \n\nOr if you really do need to contact the professor please do not ask if you missed anything “important”. (As if we’re intentionally teaching unimportant lessons). I’d let them know you’ve read the readings (if any) and checked the syllabus and just want to make sure you didn’t miss any important announcements. Then try to get the lecture notes from a classmate.",
                  "author": "begrudgingly_zen",
                  "created": 1636388868,
                  "upvotes": 44,
                  "replies": {
                    "hjtjer1": {
                      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtjer1/",
                      "text": "Thanks for this comment, u/begrudgingly_zen. These are great points. Definitely make sure you (OP) take care of business on your end before seeking out the professor.",
                      "author": "Temporary-Complex751",
                      "created": 1636389212,
                      "upvotes": 7,
                      "replies": {}
                    },
                    "hjv8k4t": {
                      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjv8k4t/",
                      "text": "Fuck, I don't know how many times this term I've gotten (and ignored) e-mails that go to the tune of \"I had to miss class today, did I miss anything important?\" like I have all the time in the world to write them a personal summary.\n\nWe're still online, so I record all my lectures and upload them. Anyone can access them at any time, and I still get e-mails like that constantly. When we're back F2F I'm going to need to explicitly say \"Please do not contact me if you miss class - find a classmate and get the notes that way.\"",
                      "author": "purple_ombudsman",
                      "created": 1636413948,
                      "upvotes": 4,
                      "replies": {
                        "hjw0xq6": {
                          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjw0xq6/",
                          "text": "Totally. I literally copy/paste the same response. Yes, you missed important material that will be on the exam. Make sure you review the PowerPoint, read the assigned readings, and get notes from the classmate. If you still have questions about the class material after completing these steps, come talk with me during office hours. They literally never do 🤷‍♀️",
                          "author": "neckbeardface",
                          "created": 1636426773,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "hjtlgkg": {
                      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtlgkg/",
                      "text": "Agree completely.  Also a prof and while I don’t want you to suffer I am literally not able to deliver you a personal, custom class in place of you just coming when everyone else does.",
                      "author": "kryppla",
                      "created": 1636390020,
                      "upvotes": 4,
                      "replies": {
                        "hjulj0n": {
                          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjulj0n/",
                          "text": "Thanks for sharing, u/kryppala. I would imagine that topic fatigue and a busy schedule (with dozens of students' and multiple classes' worth of work to worry about) would make it impossible to cater to every student individually.",
                          "author": "Temporary-Complex751",
                          "created": 1636404497,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hjtlbe2": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtlbe2/",
              "text": "Then go to class.  You don’t have to participate just be there",
              "author": "kryppla",
              "created": 1636389963,
              "upvotes": -8,
              "replies": {}
            }
          }
        }
      }
    },
    "hjtsmfy": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtsmfy/",
      "text": "With anxiety, it is fine if you are sure staying at home will not further make it worse. Sometimes the more you sulk, the worse it becomes.\n\nBut still, reddit is not the best plase to get therapy. If it bothers you to the point of like this, then you should seek out psychotherapy.",
      "author": "AcademicDifficulty",
      "created": 1636392848,
      "upvotes": 14,
      "replies": {}
    },
    "hjterkq": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjterkq/",
      "text": "Yeah sure you can",
      "author": "Priyanshi_Rawat",
      "created": 1636387338,
      "upvotes": 5,
      "replies": {}
    },
    "hjtu5qr": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtu5qr/",
      "text": "Im curious how you are coping with your anxiety? Are you on any medication or treatment?\n\nI have terrible social anxiety and one of my classes fucking drives me nuts with anxiety. I know if I wasn’t on medication i would never go to that class.",
      "author": null,
      "created": 1636393457,
      "upvotes": 4,
      "replies": {
        "hjtuqe7": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtuqe7/",
          "text": "Yeah I’m on medication but I’m also doing cognitive behavioural therapy at the moment! I find it to be effective if you put the work that’s involved into getting better",
          "author": "chloexcloe",
          "created": 1636393686,
          "upvotes": 7,
          "replies": {
            "hjty91z": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjty91z/",
              "text": "Im trying to get into CBT. \n\nMy previous therapist (whod only been in practice for about a year) did CBT but it sucked. So im looking for someone else.\n\nYoure gonna get through this",
              "author": null,
              "created": 1636395132,
              "upvotes": 2,
              "replies": {
                "hjtygl9": {
                  "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtygl9/",
                  "text": "Yeah definitely try get a good experienced therapist! Thank you sm",
                  "author": "chloexcloe",
                  "created": 1636395220,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hju7hsh": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju7hsh/",
      "text": "As someone who frequently skipped for the same reasons, trust me when I say that skipping class won't make the anxiety go away and will probably just make it worse. Also it's gonna become a habit and that WILL affect your performance. Don't make the same mistakes I did, seek psychiatric help instead of trying to escape reality",
      "author": "Gestice",
      "created": 1636398851,
      "upvotes": 12,
      "replies": {
        "hjue9u1": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjue9u1/",
          "text": "Did u email your professors every time you were absent?",
          "author": "Mountain_Rub_1055",
          "created": 1636401568,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjthapg": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjthapg/",
      "text": "Nope, you will feel great after the class. Go outside your comfort zone. Skipping class may seem like a good idea in the short term, but it isn’t a good strategy for combatting your anxiety in the long term.",
      "author": "hkolberg01",
      "created": 1636388371,
      "upvotes": 102,
      "replies": {
        "hjtl9p0": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtl9p0/",
          "text": "Agree I had this problem as an undergrad and after skipping the class I felt even worse.  Go to class and sit alone and hide out whatever but you’ll still be there hearing any news or important information and you won’t have that lost feeling like if you didn’t go.",
          "author": "kryppla",
          "created": 1636389945,
          "upvotes": 38,
          "replies": {}
        },
        "hjtkw21": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtkw21/",
          "text": "I agree. I’m not a fan of this sentiment being encouraged these days of “self care! Eat some chocolate, call out of work, watch movies all day!” These decisions have consequences. I skipped class today and guess what? I don’t feel better at all! Now I just have more work to catch up on next time. I don’t think it’s good advice to just do whatever serves you in the moment and fuck the future",
          "author": "LawfulnessFancy5450",
          "created": 1636389798,
          "upvotes": 22,
          "replies": {
            "hjtz4ga": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtz4ga/",
              "text": "No one is saying to just fuck the future and skip whenever you feel like it. But taking a break before you grind so much that you reach a breaking point is far smarter in the long run. I deal with severe anxiety and I know that talking a day off once in every blue moon when I’m in the brink of a mental breakdown benefits my future far more than me pushing through endlessly until I finally lose it and am on the brink of suicide (which has happened multiple times before) and can barely function or pay attention in class.\n\nThere is a difference between saying “I’m an not mentally well right now and I need to take one day off” and saying that you should just skip class and watch movies all day whenever you’re not in the mood for school.",
              "author": null,
              "created": 1636395494,
              "upvotes": 34,
              "replies": {}
            },
            "hjuusnq": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjuusnq/",
              "text": "Wow what a massive misrepresentation",
              "author": "imperialpidgeon",
              "created": 1636408178,
              "upvotes": 6,
              "replies": {
                "hjv8685": {
                  "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjv8685/",
                  "text": "Seriously. Like, way to boomer the shit out of it.",
                  "author": "purple_ombudsman",
                  "created": 1636413778,
                  "upvotes": 3,
                  "replies": {
                    "hjve8md": {
                      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjve8md/",
                      "text": "Lol did this strike a chord for some of you guys or? I’m 24, not a boomer, just self aware enough to realize that not doing things I need to do isn’t going to solve any of my problems. If you wanna skip school and lay in bed feeling shitty all day, be my guest. OP seems to have some hint in mind that even though they don’t feel the best, they should still go to the classes they’re paying for and help out their future self. Die mad about it",
                      "author": "LawfulnessFancy5450",
                      "created": 1636416479,
                      "upvotes": -7,
                      "replies": {
                        "hjvlpo4": {
                          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvlpo4/",
                          "text": "Boomer is a mindset. In this case it's about hasty generalizations from \"this person misses a class for mental health purposes\" to \"staying in bed all day and eating ice cream because self-care!!\" \n\nThere's a reasonable end and an unreasonable one to that spectrum, and disregarding that is just obtuse. Boomer is as Boomer does.",
                          "author": "purple_ombudsman",
                          "created": 1636419912,
                          "upvotes": 8,
                          "replies": {
                            "hjvpaek": {
                              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvpaek/",
                              "text": "Boomer isn’t a mindset lol you can’t just attach whatever meaning you want to words and terms. Baby boomers are a generation of people. You might learn this next time you decide to go to class",
                              "author": "LawfulnessFancy5450",
                              "created": 1636421552,
                              "upvotes": -7,
                              "replies": {
                                "hjvq6gy": {
                                  "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvq6gy/",
                                  "text": "Lmao. I teach the class. And one of the things you'd learn is that language and vocabulary is dynamic and socially constructed, and people do use that term in other contexts. So, you'd probably do quite poorly given the inability to grasp conceptual flexibility.",
                                  "author": "purple_ombudsman",
                                  "created": 1636421957,
                                  "upvotes": 6,
                                  "replies": {
                                    "hjvs1ox": {
                                      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvs1ox/",
                                      "text": "Ah cool, so YOU’RE the boomer! Lol peace my guy, it’s been fun",
                                      "author": "LawfulnessFancy5450",
                                      "created": 1636422796,
                                      "upvotes": -1,
                                      "replies": {
                                        "hjy4pj7": {
                                          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjy4pj7/",
                                          "text": "Lol i love how you just keep talking yourself into a hole",
                                          "author": "imperialpidgeon",
                                          "created": 1636473199,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hjy8oa2": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjy8oa2/",
          "text": "It also creates problems of wanting to skip more classes too. I skipped some of my classes now I just don't want to show, so I end up forcing myself to go to class.",
          "author": "HowlSpice",
          "created": 1636474816,
          "upvotes": 2,
          "replies": {}
        },
        "hjtxxnk": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtxxnk/",
          "text": "Agree.\n\nBeing able to compartmentalize your personal issues and address them when appropriate at a later time is a pretty important life skill.",
          "author": "Imaginary_Safety4653",
          "created": 1636394993,
          "upvotes": 6,
          "replies": {
            "hjvi6tu": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvi6tu/",
              "text": "knowing your limits and ability to prioritize what’s important is also a life skill",
              "author": "Lightfail",
              "created": 1636418286,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "hjtuyk4": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtuyk4/",
          "text": "This, also, if we get used to avoiding classes, work etc because we have a little anxiety, it later becomes an excuse to ourselves to be lazy. Keep in mind too, when it comes to work or classes, try to check your issues at the door. I promise you there is a person sitting in that class having a way worse day than you are.",
          "author": "Dry-Rub",
          "created": 1636393776,
          "upvotes": -7,
          "replies": {
            "hjtzer2": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtzer2/",
              "text": "There is a difference between “having a little anxiety” and feeling like you are reaching a breaking point. Yeah, I don’t skip class just because I’m a little anxious but if I feel like I’m in the brink of a panic attack or mental breakdown I definitely will miss a class. It doesn’t matter that someone may be having a worse day. People have different limits. Saying that you don’t want to push yourself to a breaking point is not making excuses to become lazy.",
              "author": null,
              "created": 1636395610,
              "upvotes": 20,
              "replies": {}
            },
            "hjudz17": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjudz17/",
              "text": ">\tI promise you there is a person sitting in that class having a way worse day than you are.\n\nThat doesn’t help at all. And it might not even be true tbh depending on OPs situation",
              "author": "Mountain_Rub_1055",
              "created": 1636401450,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "hju4xfe": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju4xfe/",
      "text": "Will not going to class lower your anxiety?",
      "author": "ROIIs360",
      "created": 1636397819,
      "upvotes": 4,
      "replies": {}
    },
    "hju75eq": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju75eq/",
      "text": "One day wont hurt you. Just make sure to email your teacher, keep up with the work, and not make it a habit! Hope you feel better!!",
      "author": "Kishiloh",
      "created": 1636398711,
      "upvotes": 5,
      "replies": {}
    },
    "hjtul8n": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtul8n/",
      "text": "People have skipped class for a lot dumber things. I’d say go ahead and do it if you know there’s nothing important going on.",
      "author": "115machine",
      "created": 1636393629,
      "upvotes": 10,
      "replies": {}
    },
    "hjtbxfe": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtbxfe/",
      "text": "skip it",
      "author": "cannotbehavee",
      "created": 1636386166,
      "upvotes": 8,
      "replies": {}
    },
    "hju7wwt": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju7wwt/",
      "text": "Skip. It’s not worth putting yourself through hell. And if you email your prof I’m sure they’ll be more than understanding. This past year they’ve gone through the ringer as well and will more than likely be considerate of your situation. Last week I emailed a prof saying my mental health was really bad and I hadn’t even started the midterm paper and he gave me the extension without any issue. Best wishes (:",
      "author": "Maleficent_Stress_68",
      "created": 1636399021,
      "upvotes": 3,
      "replies": {}
    },
    "hjttxpe": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjttxpe/",
      "text": "Hey OP, are you talking to a therapist or counselor at all? Skipping class isn’t a cure for anxiety and it might be a deeper rooted issue that you may need help with. Good luck and hope things get better!",
      "author": "mudpuppyy",
      "created": 1636393369,
      "upvotes": 7,
      "replies": {
        "hjtu4ss": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtu4ss/",
          "text": "Yeah I’m in CBT and have made a lot of progress. I haven’t skipped before, was just having a really crappy day and felt like I couldn’t face class but I ended up going in the end and I’m here now",
          "author": "chloexcloe",
          "created": 1636393446,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hjtvbvm": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtvbvm/",
      "text": "For me, 90% of the learning and work is done at home anyway. Skipping one day is not a big deal, especially if the course has distributed lecture notes and lecture recordings. I've skipped a few lectures now to catch up on sleep, and overall, it's been a good decision since sleep is so important to my mental health. I'm not going to risk losing touch with reality due to lack of sleep just so I can sit through one extra borderline useless lecture.",
      "author": "nuke35",
      "created": 1636393922,
      "upvotes": 2,
      "replies": {}
    },
    "hjusrq1": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjusrq1/",
      "text": "I personally think of it like this; if your mental or physical state is going to hinder your ability to work/learn/study, then don’t engage in working/learning/studying because you won’t be as proficient as you would be as you would be without your issues. You don’t go to school or work if you have the flu because A: your condition is contagious, and B: your performance is extremely hindered because your brain is focused on surviving, not working or learning. It’s the exact same thing with depression and anxiety. Don’t go if you don’t feel well enough to go.",
      "author": "DecafSaxGuy",
      "created": 1636407372,
      "upvotes": 2,
      "replies": {}
    },
    "hjvdt7p": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvdt7p/",
      "text": "go for it. people miss class if they’re feeling unwell physically, so why should mentally be any different?",
      "author": "m48_apocalypse",
      "created": 1636416286,
      "upvotes": 2,
      "replies": {}
    },
    "hjxfktk": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjxfktk/",
      "text": "Taking time off when you need is essential to being productive. Just don’t ask the professor to catch you up on what you missed.",
      "author": "Felixir-the-Cat",
      "created": 1636461160,
      "upvotes": 2,
      "replies": {}
    },
    "hju7pde": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju7pde/",
      "text": "I used too. I just was always cozied up with the professor early in the semester and shoot them an email when I didn’t feel amazing. Yea it’ll vary with professor and you might have to stretch the truth like you are sick or an emergency but overall as long as you are on top of your stuff and aren’t getting behind skip as much as you want.",
      "author": "scorpion252",
      "created": 1636398935,
      "upvotes": 2,
      "replies": {}
    },
    "hju1h9m": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju1h9m/",
      "text": "So, yes, BUT, keep in mind that often our anxiety is a product of us not doing things we feel we ought to be doing. So, if you skip class, DO something that actually contributes to you achieving your goals. Don’t go into paralysis on your phone, do some homework, write some flash cards (that always calms me down). If there’s a topic in class I’m really struggling with, or interested in, I’ll Google and find a lecture/some video I can passively listen to while drinking tea or something. \n\nBut don’t use “mental health days” as tools to do nothing. 9/10, that just makes anxiety worse and may contribute to a coping mechanism of avoidance. \n\nThink of it more as a basketball “sweeeerve,” break someone’s ankles, but continue moving toward your goals.",
      "author": "axidentalaeronautic",
      "created": 1636396442,
      "upvotes": 2,
      "replies": {}
    },
    "hju0zsb": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju0zsb/",
      "text": "I wouldn’t skip class, it can be dangerous to skip class it could lead to more mental health issues ultimately. Would skip some other less important stuff you have going on or call a sick day at work",
      "author": "Jopeyes",
      "created": 1636396248,
      "upvotes": 2,
      "replies": {}
    },
    "hju31rq": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju31rq/",
      "text": "Hey, I have multiple very serious mental illnesses. I have to take days off for anxiety reasons all the time. I have accommodations which help. You shouldn’t feel bad about this at all. You’ll end up doing better in the long run if you take care of yourself. And, one class isn’t the end of the world. I hope you feel better soon.",
      "author": "arv2373",
      "created": 1636397066,
      "upvotes": 2,
      "replies": {}
    },
    "hjtqgvs": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtqgvs/",
      "text": "I would definitely skip, denying yourself mental health time will speed up burnout. You don’t seem like the type to make a habit of it at all, so maybe just reach out to the professor or a classmate and ask about the content of today’s class so you can review it a bit. \nMake time for yourself, life will never stop to let you.",
      "author": "maccreally",
      "created": 1636392000,
      "upvotes": 1,
      "replies": {}
    },
    "hjtrnx1": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtrnx1/",
      "text": "Take the day off, make sure you catch up on the work. If you don't then you are using this solely as an excuse, if you do then good for you.",
      "author": "vxcq",
      "created": 1636392471,
      "upvotes": 1,
      "replies": {}
    },
    "hjte1ba": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjte1ba/",
      "text": "No. Put on your big boy pants and deal with reality like everyone else.",
      "author": "noogiey",
      "created": 1636387039,
      "upvotes": -38,
      "replies": {
        "hjtj6u1": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtj6u1/",
          "text": "I'm sorry that life has hurt you enough to give you this sort of attitude. Hoping for more kindness to be sent your way man",
          "author": "Wumbo_12",
          "created": 1636389125,
          "upvotes": 24,
          "replies": {
            "hjtlv0y": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtlv0y/",
              "text": "don't lump me in with your incompetent perspective.",
              "author": "noogiey",
              "created": 1636390177,
              "upvotes": -35,
              "replies": {
                "hju1nil": {
                  "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju1nil/",
                  "text": "Chill",
                  "author": "sanath112",
                  "created": 1636396511,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjttbhv": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjttbhv/",
      "text": "I do sometimes. I have mental illnesses but I don't feel comfortable saying that's why I missed class. I say I'm sick that day, which isn't totally untrue. I'm also typically a pretty decent student, so I think that helps.",
      "author": "Animasylvania",
      "created": 1636393123,
      "upvotes": 1,
      "replies": {}
    },
    "hjtve1t": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtve1t/",
      "text": "I called in sick to work last Friday because of my mental health, take care of yourself.",
      "author": "Stealthninja3",
      "created": 1636393946,
      "upvotes": 1,
      "replies": {}
    },
    "hjtvmbo": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtvmbo/",
      "text": "I had to take a mental health day last week after my girlfriend of a year broke up with me. I emailed my professors in advance to apologize for not being able to come and they were all understanding and forwarded me the readings/Lecture notes. Obviously I didn't get into the specifics in the emails.",
      "author": "miker3107",
      "created": 1636394037,
      "upvotes": 1,
      "replies": {}
    },
    "hjtvmqg": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtvmqg/",
      "text": "It somewhat depends on if you’re currently receiving treatment from a counselor or with medication to combat your anxiety. I had to drop out due to PTSD to take care of my mental health because the care I needed wasn’t available on campus. However, if you are receiving care, then you may want to shoot a text to your counselor or ask your doctor about getting medication for anxiety. It all depends on your situation, but don’t let this one skip lead to multiple more. If that happens, you may fall into depression and further anxiety.",
      "author": "4ndrewTOne",
      "created": 1636394041,
      "upvotes": 1,
      "replies": {}
    },
    "hjtz4ab": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtz4ab/",
      "text": "Hi OP, it sounds like you’ve been working to get your mental health under control based on some of the other comments. You’re taking wonderful steps and it’s great you’re trying to tune into your needs. I saw you made the decision to go. I think this makes sense as not going might cause you to be unable to actually relax in the moment and get the rest you need. Which means you would miss class and not feel nourished. \n\nBy going to class, you nourished yourself academically so hopefully you have more comfort from that. What plans do you have to care for yourself this evening? I also think mental health days can be productive but it helps to have a solid idea of what you will do when you take them. : )",
      "author": "strawberrysweetpea",
      "created": 1636395493,
      "upvotes": 1,
      "replies": {}
    },
    "hju2ceq": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju2ceq/",
      "text": "If it's just a class then it's fine. Try to arrange a way to get those class notes though.",
      "author": "Disastrous_Fig_3762",
      "created": 1636396786,
      "upvotes": 1,
      "replies": {}
    },
    "hju3em8": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju3em8/",
      "text": "Yes",
      "author": "ChrolloBaby",
      "created": 1636397209,
      "upvotes": 1,
      "replies": {}
    },
    "hju6v4v": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju6v4v/",
      "text": "I haven’t skipped that many classes, but the ones I did skip I really needed to do so. Sometimes you just need to relax and break your normal schedule a bit to help with your mental health. It’s okay to do it, just don’t get in the habit of doing it all the time. But I’m sure you won’t.\n\nPlan something for the time you’re supposed to be in class later. Watch a movie, go for a walk, something that’ll pass the time and help you not feel guilty about not being there.\n\nHave a good night OP. Wishing you the best.",
      "author": "SkidOrange",
      "created": 1636398595,
      "upvotes": 1,
      "replies": {}
    },
    "hju8p9n": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju8p9n/",
      "text": "Imo, when it comes to mental health and school, you should always take time for yourself! I myself have skipped class a few times due to not feeling mentally well, just be sure to be honest with yourself as to why you’re skipping, and try to monitor it so it doesn’t become a habit. (E.g. if you’re skipping all the time because school in general is anxiety-provoking, maybe reconsider why you’re in school, but if you’re missing a class or two- we’re all human, just reach out to your prof or a fellow classmate for help catching up)!",
      "author": "Justalil_forkedup",
      "created": 1636399339,
      "upvotes": 1,
      "replies": {}
    },
    "hju9s8t": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju9s8t/",
      "text": "I have had to do this too. Self care is important. Do so if you need to. Something to watch out for is not letting it become a habit. I had a hard time prying myself out of the skipping mindset for the next class.",
      "author": "melodybounty",
      "created": 1636399772,
      "upvotes": 1,
      "replies": {}
    },
    "hju9ulr": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju9ulr/",
      "text": "I’d email the teacher and tell them they’ll excuse you.",
      "author": "Cobi6947",
      "created": 1636399799,
      "upvotes": 1,
      "replies": {}
    },
    "hjualwh": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjualwh/",
      "text": "Nothing wrong with that! Be sure that skipping won’t lead to additional stress before you do it",
      "author": "ticonderoga85",
      "created": 1636400102,
      "upvotes": 1,
      "replies": {}
    },
    "hjubklt": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjubklt/",
      "text": "Every class you skip is going to make it harder to go back. This is why skipping class for anxious people is often a downward spiral.\n\n You feel bad about skipping and become anxious so you don't want to confront the instructor, which leads you to skip again, so the anxiety becomes worse and you skip again...",
      "author": "TheProfessorsCat",
      "created": 1636400489,
      "upvotes": 1,
      "replies": {}
    },
    "hjubpmd": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjubpmd/",
      "text": "A lot of teachers in my college have been kinda loosey goosy with attendance because of COVID stuff. They might want you to email them or attend the virtual lecture. It's something I've taken advantage of this semester because my energy levels are not there.",
      "author": "Shohdef",
      "created": 1636400544,
      "upvotes": 1,
      "replies": {}
    },
    "hjucibr": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjucibr/",
      "text": "I'd say it depends a lot on your situation.\n\nWhen I wake up anxious, I think carefully about why. It can be good to go to class; it can distract you, give you a purpose, and clear your head.\n\nLikewise, the opposite is true. Forcing yourself to go to class can make things worse.",
      "author": "tabtal",
      "created": 1636400865,
      "upvotes": 1,
      "replies": {}
    },
    "hjudzxk": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjudzxk/",
      "text": "Go for it, I’ve had to skip class cause of work like once a year to prep for Black Friday at work",
      "author": "elchompo18",
      "created": 1636401459,
      "upvotes": 1,
      "replies": {}
    },
    "hjufdat": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjufdat/",
      "text": "We can say whatever we want but it’s what you already know in your mind. If you genuinely feel like your mental health would interfere with the stuff you would do or learn in the class, then you know that and you know how you feel about it. I think you might be thinking about how *other* people might feel about you skipping class, not how you actually feel about it. As long as you’re not harboring dishonest thoughts, ie just using this as an excuse to ditch class, then you do whatever you feel is healthy for you.",
      "author": "imbrownbutwhite",
      "created": 1636402016,
      "upvotes": 1,
      "replies": {}
    },
    "hjul84z": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjul84z/",
      "text": "Take the day off. As long as you’re not missing more than the occasional day or two, go for it. Your mental health is important. \n\nJust make sure your attendance won’t penalize you somehow and ask a buddy to send you any information you missed. One absence shouldn’t sink you.",
      "author": "SleepyxDormouse",
      "created": 1636404378,
      "upvotes": 1,
      "replies": {}
    },
    "hjum20j": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjum20j/",
      "text": "Is it a one-class-a-week kind of thing? If so, you might miss a ton of content. If you guys meet regularly it may be easy to get caught up. Just weigh you pros and cons on a piece of paper to help you decide. Personally, I don’t miss class for anything but also I have a scholarship and grants riding on my GPA so I really can’t, it’s like my job. If you have more leeway and it’s not so life or death, I think you’ll be okay missing one class. Good luck!",
      "author": "GingaSnaps0_0",
      "created": 1636404704,
      "upvotes": 1,
      "replies": {}
    },
    "hjupxo0": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjupxo0/",
      "text": "Yeah everyone needs to.\n\nYou can't make it a habit, tho. Only when necessary. And if somethings going on talk to your professors",
      "author": "MilwaukeeMan420",
      "created": 1636406254,
      "upvotes": 1,
      "replies": {}
    },
    "hjur7lv": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjur7lv/",
      "text": "Yes",
      "author": "alternativealtacc",
      "created": 1636406754,
      "upvotes": 1,
      "replies": {}
    },
    "hjut1qc": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjut1qc/",
      "text": "As someone thats plagued with mental illness; i get ya man and that shit is so tough. Take your day off but don’t let it happen often. Im sure you’ve heard its a slippery slope and it really is, im facing the consequences of many absences right now. Sometimes going actually makes me feel better but its really hard to get in that mindset. Good-luck man and hope everything is alright <3",
      "author": "A1089",
      "created": 1636407482,
      "upvotes": 1,
      "replies": {}
    },
    "hjuui1m": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjuui1m/",
      "text": "Make a pros and cons list. I skipped class last week for a mental health day and it was very well worth it. I decided that I knew the content well enough and would rather rest than have extreme anxiety in class and not pay attention.\n\nBe gentle and kind to yoursef. Mental health always tales priority. Just make sure you know what you’re missing :)",
      "author": "Ok_Grapefruit1481",
      "created": 1636408064,
      "upvotes": 1,
      "replies": {}
    },
    "hjuuzxp": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjuuzxp/",
      "text": "Don’t have anything to say that others haven’t, but i think it’s a sad reflection on our society where we question whether or not we should prioritize our mental health \n\n(Not anything against you OP)",
      "author": "imperialpidgeon",
      "created": 1636408256,
      "upvotes": 1,
      "replies": {}
    },
    "hjuvxjh": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjuvxjh/",
      "text": "Currently in this situation and I think it depends on what’s causing your anxiety. For me it’s the need to be on campus now. \nEven before the pandemic, a majority of my college education was virtual, and I loved it. It gave me so much flexibility and I managed to take on work while being a full time student. Fast forward to now when my university has mandatory in-person classes and I’m no longer able to properly manage the same amount of work because of the added stress of commute times and it sucks. \nSo to kinda give myself a pause I didn’t attend class after communicating with my professors and had a set plan to stay on track with the class for those couple of days. I get the same amount of homework, just do a bit more reading and self paced teaching to make sure I get the material. \n\nThe biggest thing is communicating with your professor to make sure you’re both on the same page.",
      "author": "stingray14",
      "created": 1636408633,
      "upvotes": 1,
      "replies": {}
    },
    "hjuwa4a": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjuwa4a/",
      "text": "I think you are better off going, you will probably have more anxiety worrying about missing class than going, Your mind is playing tricks on you",
      "author": "Open-Cap-9919",
      "created": 1636408773,
      "upvotes": 1,
      "replies": {}
    },
    "hjuwr9v": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjuwr9v/",
      "text": "Are you an engineer?",
      "author": "mrdankerton",
      "created": 1636408968,
      "upvotes": 1,
      "replies": {
        "hjuwy42": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjuwy42/",
          "text": "Nope I’m doing medicine",
          "author": "chloexcloe",
          "created": 1636409044,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjuwy8d": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjuwy8d/",
      "text": "Take care of yourself now so you can handle future classes and other things",
      "author": "trillvice",
      "created": 1636409045,
      "upvotes": 1,
      "replies": {}
    },
    "hjv0bva": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjv0bva/",
      "text": "Yes, always. U won’t regret it",
      "author": "madixxmarie",
      "created": 1636410435,
      "upvotes": 1,
      "replies": {}
    },
    "hjv2v83": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjv2v83/",
      "text": "If you think it would help, then absolutely.  I could really use a mental health day too, but I feel that taking a day off would just let the stress pile up even more, and ultimately be counterproductive.  That’s what sucks about college.  Even just one day completely off, no strings attached, would do wonders for my well-being.",
      "author": "vruv",
      "created": 1636411499,
      "upvotes": 1,
      "replies": {}
    },
    "hjv395u": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjv395u/",
      "text": "I’m generally a good student, but there have been some days I’m just like, yeah I’m not doing this assignment for the sake of my mental health.",
      "author": "MissionCattle",
      "created": 1636411663,
      "upvotes": 1,
      "replies": {}
    },
    "hjv3pd6": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjv3pd6/",
      "text": "It is absolutely not the end of the world to miss a few classes. But its really a choice you gotta make for yourself. If you feel okay skipping then by all means you can, its not usually hard to get caught back up from one missed lecture. However, it can be easy to slip into a mindset of 'its okay to miss just one more'. I struggled with his recently, kept skipping classes because I knew I could just look at the notes online. I'm still doing okay, but I gotta be careful and have some self control of it'll become a bad habit.",
      "author": "FirstForBurgers",
      "created": 1636411850,
      "upvotes": 1,
      "replies": {}
    },
    "hjv6u8d": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjv6u8d/",
      "text": "Go for it",
      "author": "Nkklllll",
      "created": 1636413203,
      "upvotes": 1,
      "replies": {}
    },
    "hjvauak": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvauak/",
      "text": "Open pc and record it for later",
      "author": "thatandthis1",
      "created": 1636414955,
      "upvotes": 1,
      "replies": {}
    },
    "hjvh8kf": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvh8kf/",
      "text": "Yes. It's just one night.",
      "author": "Desperate_Cattle3233",
      "created": 1636417853,
      "upvotes": 1,
      "replies": {}
    },
    "hjvi5z5": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvi5z5/",
      "text": "As long as you don't wind up making a habit of it, missing one day won't kill you. Just understand that you're probably gonna have to play a bit of catch-up later.",
      "author": "ralo229",
      "created": 1636418275,
      "upvotes": 1,
      "replies": {}
    },
    "hjvjl4c": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvjl4c/",
      "text": "Hi friend. You can get accommodations for attendance flexibility if you struggle with anxiety a lot and have documentation. Contact your accessibility center and see what you can do.",
      "author": "therocknamedwonder",
      "created": 1636418931,
      "upvotes": 1,
      "replies": {}
    },
    "hjvojuj": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvojuj/",
      "text": "I don’t go to English anymore because it made me feel terrible",
      "author": "aardvarkman3",
      "created": 1636421216,
      "upvotes": 1,
      "replies": {}
    },
    "hjvpla9": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvpla9/",
      "text": "no you don't, because it will be your routinities, if you try once then next it's more easier to do. but if you're really feel wanna alone, then go",
      "author": "Top_Breakfast_8516",
      "created": 1636421689,
      "upvotes": 1,
      "replies": {}
    },
    "hjvtb6m": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvtb6m/",
      "text": "I had a day or two like that when I was in school, just don't make a habit of it. Maybe send the professor an email asking if there is anything that they are going over in class that you may need to know. Or talk to a friend in class and see what they say.",
      "author": "Gun_Nut_42",
      "created": 1636423365,
      "upvotes": 1,
      "replies": {}
    },
    "hjvttx5": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjvttx5/",
      "text": "This thread is full of negative peer pressure. OP I would really consider the attendance policy. and what is going on in class. We usually cover a chapter of material in a class period.",
      "author": "Katiehart2019",
      "created": 1636423590,
      "upvotes": 1,
      "replies": {}
    },
    "hjw0p2l": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjw0p2l/",
      "text": "Mental health is just as important as physical health",
      "author": "fruitninja777",
      "created": 1636426662,
      "upvotes": 1,
      "replies": {}
    },
    "hjw3rtv": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjw3rtv/",
      "text": "100%. Just yesterday I skipped the entire week of work besides a few things because I was mentally tired.",
      "author": "KingBlackthorn1",
      "created": 1636428069,
      "upvotes": 1,
      "replies": {}
    },
    "hjw6qii": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjw6qii/",
      "text": "You will feel even worse when your grades drop and you have to make up work. Go to class.",
      "author": "Absolute_Crab_Man",
      "created": 1636429440,
      "upvotes": 1,
      "replies": {}
    },
    "hjw8z0p": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjw8z0p/",
      "text": "Go",
      "author": "Away_Peak_5054",
      "created": 1636430502,
      "upvotes": 1,
      "replies": {}
    },
    "hjw96wb": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjw96wb/",
      "text": "I know that I reply very late on this thread but I just want you to know that a lot of people are struggling during this time and giving yourself a break is not a crime, in fact it might be the best thing for you. Pushing yourself to the limits will cause you more harm than good. Always take care yourself!!!",
      "author": "Awkward_Affect_7793",
      "created": 1636430610,
      "upvotes": 1,
      "replies": {}
    },
    "hjwe23l": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjwe23l/",
      "text": "I’ve experienced this a lot. My advice is \n1.) there is no shame in missing class. Your well-being should always come first\n2.) At the same time, I definitely understand feeling guilty and stressed that you missed class. \nSometimes going to class is actually better for my mental health & anxiety. It can also help me to go to class but allow myself to sit in the back and zone out or work on hw for another class, just the act of being there can help calm me down. But at the end of the day, school/grades/professors perceptions of you are not worth risking your health and well-being. So do whatever will help you most",
      "author": "Playful_manatee",
      "created": 1636432992,
      "upvotes": 1,
      "replies": {
        "hjwegz5": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjwegz5/",
          "text": "Adding that professors can actually be really understanding too. I’ve always been terrified to ask a prof for help catching up or anything that even implied I’d missed a class. But I confided in one prof who I trusted a lot, and she actually was the one who gave me the courage to seek out medical help for my anxiety & I’m doing so much better now.",
          "author": "Playful_manatee",
          "created": 1636433213,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjwhbrl": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjwhbrl/",
      "text": "the pros of skipping one class here outweigh the cons easily. \nhaving a small break like this would likely help you to recover and perform better in the following days",
      "author": "saint_darkrai",
      "created": 1636434805,
      "upvotes": 1,
      "replies": {}
    },
    "hjwlc0f": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjwlc0f/",
      "text": "I know the day has already passed but I, for one, am in full support of students taking mental health days. Unless it is absolutely going to wreck your grade if you're not there (like an exam or project presentation), you shouldn't feel guilty for missing a day of class. I've skipped evening classes because of asthma attacks that happened in the morning just because I was mentally exhausted. I probably wouldn't have gotten through senior year without taking a mental health day here and there.\n\nOur brains aren't supposed to work that long without rest and college is the exact opposite of giving your brain the break it needs. As long as you don't make it a habit of skipping every other class, a mental health day can be the perfect medicine.",
      "author": "chocolatechipsims",
      "created": 1636437284,
      "upvotes": 1,
      "replies": {}
    },
    "hjws857": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjws857/",
      "text": "Mental health over grades. Always.\n\nI had to take a week break from school due to a really bad suicidal episode for me. If I forced myself to go back to class and work on grades and force myself to interact socially, I honestly would've just broke.\n\nAlso let your professors know why you're skipping. It's not wrong to skip because of something that could possibly hinder you in class, cold, anxiety or otherwise. Your health is #1 priority.",
      "author": "Reletr",
      "created": 1636442184,
      "upvotes": 1,
      "replies": {}
    },
    "hjwtjar": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjwtjar/",
      "text": "Depends on the situation. If school or that class specifically is a cause of the anxiety I think it’s good to face the fear and go to class. You can pick a seat that you can sneak out if you need to go splash some water on your face or walk around. Whenever I have class anxiety I always feel much better after going opposed to skipping. If it’s other stuff and you don’t have a test take a day off, but have a goal for that day. Don’t let a habit form from it.",
      "author": "OGBoots",
      "created": 1636443232,
      "upvotes": 1,
      "replies": {}
    },
    "hjx21va": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjx21va/",
      "text": "I don't see any issue in this the only thing is to not make a habit of it. I try to attend as much as possible because I know I will need 1 day to myself.",
      "author": "BraveUnion",
      "created": 1636450635,
      "upvotes": 1,
      "replies": {}
    },
    "hjx3vtt": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjx3vtt/",
      "text": "Missing one class isn't going to tank your GPA. I'd go ahead and take that break if you need it, and try to catch up later. You can always ask a friend for notes or read the materials later (ask the prof for what you covered and explain that you were absent for health reason - cuz mental health is still health).\n\nI wish I took breaks 1st and 2nd year, but I didn't and it actually let to physiological health problems. Don't be like me lol",
      "author": "SeeSea8",
      "created": 1636452276,
      "upvotes": 1,
      "replies": {}
    },
    "hjx5w8q": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjx5w8q/",
      "text": "Nope.",
      "author": "superlibster",
      "created": 1636454051,
      "upvotes": 1,
      "replies": {}
    },
    "hjxoozi": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjxoozi/",
      "text": "You probably already did. \n\nBut it's a toss up. For depression I push to try to avoid skipping. For _school related_ anxiety I would try to avoid skipping. For everything anxiety where your full of alarm bells and tense and unable to focus, I'd skip.\n\nThe reason being you can't focus with anxiety, not at that point. A shower and petting a cat and just recooperating will do FAR more for you then stress panicking in class. You will have to make up the hours, sure. But you can't do it rn. \n\nFor school anxiety, especially early term, the only way out is thorough. Get whatever soothing stuff you have, like big warm sweaters or candle and blanket if online, and show up with the only requirement being exist. \n\nSchool anxiety and depression can kinda loop back into each other when you skip, so if your ~~me~~ prone to that and will continue to want to skip because you didn't show up last time and the time before that-- then yeah, avoid skipping 100% and set a max amount of time off per semester. \n\nIn your case it sounds like skipping was a good call, but whatever you decided I'm glad you figured it out and did what you felt was best.",
      "author": "adhdeedee",
      "created": 1636466110,
      "upvotes": 1,
      "replies": {}
    },
    "hjxrmhw": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjxrmhw/",
      "text": "May I also suggest gym times. Endorphins really help. Just make sure skipping class doesn't give you more anxiety by falling behind.",
      "author": "jetclimb",
      "created": 1636467538,
      "upvotes": 1,
      "replies": {}
    },
    "hjxsse7": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjxsse7/",
      "text": "Hey bud, I've been in your situation before. If you need help seek out your school's health and counseling. Make an appointment and more importantly inform your profs about your mental health. In my experience they are very accommodating and kind. Spending time for yourself is NEVER a waste.",
      "author": "Admiral_Ej",
      "created": 1636468077,
      "upvotes": 1,
      "replies": {}
    },
    "hjxx0wt": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjxx0wt/",
      "text": "Everyone deserves a mental health day here or there. You won't fail the class if you miss one day! On the contrary, it might help you have more power to go on and succeed better results!",
      "author": "PinkPomegranate93",
      "created": 1636469967,
      "upvotes": 1,
      "replies": {}
    },
    "hjy61va": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjy61va/",
      "text": "[removed]",
      "author": null,
      "created": 1636473746,
      "upvotes": 1,
      "replies": {}
    },
    "hju1yo1": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hju1yo1/",
      "text": "You want to take the day off but you want reassurance and validation that it's okay, which is a terrible, imo.\n\nDo what's best for you and then catch up on what you missed. It's that simple.",
      "author": "The_Start_Line",
      "created": 1636396633,
      "upvotes": -10,
      "replies": {}
    },
    "hjtje6a": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtje6a/",
      "text": "Sure, I mean there might be penalty in your course but I skipped a whole semester of classes in one course because the teaching was shitty.",
      "author": "Mattos_12",
      "created": 1636389206,
      "upvotes": -13,
      "replies": {
        "hjtlj6v": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtlj6v/",
          "text": "So not relevant to OP’s issue at all",
          "author": "kryppla",
          "created": 1636390049,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "hjtnesl": {
      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtnesl/",
      "text": "[removed]",
      "author": null,
      "created": 1636390786,
      "upvotes": -23,
      "replies": {
        "hjtq7zg": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtq7zg/",
          "text": "It’s this kind of garbage unsympathetic opinion that makes people find it difficult to talk about mental health.",
          "author": "HuevoTheFarmer",
          "created": 1636391902,
          "upvotes": 15,
          "replies": {
            "hjtqv41": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtqv41/",
              "text": "[removed]",
              "author": null,
              "created": 1636392154,
              "upvotes": -13,
              "replies": {
                "hjtr2hm": {
                  "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtr2hm/",
                  "text": "if someone became severely mentally impaired BC of consistent negative thoughts you’ll just say “lol incompetent losers”?",
                  "author": "HuevoTheFarmer",
                  "created": 1636392234,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "hjtofdd": {
          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtofdd/",
          "text": "Ah yes, studying to become a doctor, I must be a lazy fucker",
          "author": "chloexcloe",
          "created": 1636391187,
          "upvotes": 9,
          "replies": {
            "hjtpko9": {
              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtpko9/",
              "text": "[removed]",
              "author": null,
              "created": 1636391645,
              "upvotes": -11,
              "replies": {
                "hjtslpq": {
                  "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtslpq/",
                  "text": "Yeah and just because one has 1 single bad day, doesn’t mean they’re lazy. Get some logic and use your thinking a lil more",
                  "author": "chloexcloe",
                  "created": 1636392840,
                  "upvotes": 14,
                  "replies": {
                    "hjtu709": {
                      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtu709/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1636393471,
                      "upvotes": -2,
                      "replies": {
                        "hjtufpp": {
                          "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtufpp/",
                          "text": "What’s your problem lol? I’ve struggled many days before and still went in, I was just feeling overwhelmed today and thought maybe a break would be beneficial. My god people like you are the reason people feel like this. Stop being such a shit person and have some understanding and maybe try being a bit more open minded",
                          "author": "chloexcloe",
                          "created": 1636393568,
                          "upvotes": 8,
                          "replies": {
                            "hjtvv13": {
                              "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtvv13/",
                              "text": "[removed]",
                              "author": null,
                              "created": 1636394132,
                              "upvotes": -1,
                              "replies": {
                                "hjtxh2u": {
                                  "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtxh2u/",
                                  "text": "You’re definitely not open minded if you equate someone needing some time to being lazy",
                                  "author": "chloexcloe",
                                  "created": 1636394777,
                                  "upvotes": 4,
                                  "replies": {
                                    "hjtymn2": {
                                      "link": "/r/college/comments/qpg85t/should_i_skip_class_for_mental_health_reasons/hjtymn2/",
                                      "text": "That person is a dumbass. Ignore them. You are not lazy for needing *one* day off. Everybody needs a break every now and then. I have severe anxiety and there have been days where I chose to skip class bc I’d rather miss a single day and have to catch up a bit than have a mental breakdown in class. Do whatever will benefit more in the long term.",
                                      "author": null,
                                      "created": 1636395290,
                                      "upvotes": 4,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}