{"sid": "pmrypg", "link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/", "title:": "I tested positive for COVID but my prof won’t let me skip out on this exam", "text": "I tested positive for COVID on Friday, I have an exam on Monday. In my lecture, we have 4 lecture exams and a final. He states in the syllabus there’s no excuse for a missed exam and if you take it even a day after, the highest you can make is a C. Ofc I emailed him telling him I have COVID and he still used the bullshit “There’s no excuse” line. Not sure what to do bc I don’t want to settle w a C in my Anatomy and Physiology exam", "author": "Layzay374", "created": 1631450399, "retrieved": 1632947336, "over_18": false, "upvotes": 1074, "upvote_ratio": 0.99, "comments": {"hcttiy4": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcttiy4/", "text": "Hey do you have an update?", "author": "LBLBL123", "created": 1631632044, "upvotes": 1}, "hcp3qge": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcp3qge/", "text": "During the 2020 Spring semester in IRSC, COVID-19 pandemic caused testing centers to close. I did my midterms and finals via Honorlock, where you take exams at home (I need my IRSC Student ID to scan the screen and my laptop has a built-in webcam). Your college doesn't have Honorlock?", "author": "GodWarrior88", "created": 1631544809, "upvotes": 1}, "hcoucus": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcoucus/", "text": "I guess if I were in this situation, I would write an email to the professor stating we are still in a pandemic, I have a diagnosis of covid-19 and I have a problem with the class policy of \"no excuse for missing an exam and if it's late the highest I can make is a C\".  I didn't ask to get the virus. I'm dealing with it. I should not be penalized for needing time to recover. Tell her you are concerned with her health and your classmates health and it is in everyone's best interest if you do not come to class. Additionally, I'd write I am in a diminished state, fighting this virus. I am in no condition to attend class nor take an exam. I would add, our nation has been dealing with the pandemic for almost 2 years and that you are surprised and upset that there is no contingency for it with her class. I would also say, it stressful worrying about missing the class and assignments and you don't need additional stress while you are dealing with the virus.  State you need an extension for the class. (Find out the steps you have to take). It is NOT unreasonable.  Then, I'd copy in the department head, the dean, and the clinic director.  If she wants to be an arse, let her be exposed for it. I'm sure you will get positive results from an email that lays it all out and has fresh eyes on it.\n\nGood luck! Hope you feel better soon!", "author": "bluejazzblue", "created": 1631540685, "upvotes": 1}, "hcohyyp": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcohyyp/", "text": "Check your university’s Covid protocol.  Make sure you report your positive test, and ask what the protocol is for missed tests.  He could be violating university Covid rules.", "author": "SalisburyWitch", "created": 1631533968, "upvotes": 2}, "hcnz6vb": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcnz6vb/", "text": "I would honestly report him to whoever is his department head. He is choosing to endanger other students by refusing to make accommodations for you to take the test later.", "author": "not_mrbrightside", "created": 1631518150, "upvotes": 1}, "hcnxyt8": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcnxyt8/", "text": "Damn Prof would rather endanger dozens of students rather than having one take an exam online", "author": "Zyrobe", "created": 1631517071, "upvotes": 1}, "hcnucyl": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcnucyl/", "text": "Contact your department dean", "author": "tjyoo213", "created": 1631514098, "upvotes": 1}, "hcnoa97": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcnoa97/", "text": "Depending on what school you go to, you should see what your school’s COVID policy is. There may be legal (not US law but just your schools legal proceedings) processes in place that will allow you to retake an exam due to the fact you have COVID, as well as making sure this professor doesn’t act like an asshat again.", "author": "jz20rok", "created": 1631509683, "upvotes": 1}, "hcnl9eu": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcnl9eu/", "text": "Send him another email w something like,\n\n\"Professor, \n\nI will not be able to attend class tomorrow to take the test, because as previously stated, I tested positive for COVID on … (date) \\*insert screenshot or attachment with proof that you tested positive for COVID.\\* I will be self-quarantining for 14 days, but I plan to return to in-person studies after that. Please let me know when I can make up the exams or any in-person work that needs to be completed. \n\nThank you, (your name)\"\n\nThen look up the Science Department chair and tell them your situation, also send them the email correspondence between you and your professor along with the positive covid test.\n\nYou should be fine but don’t accept the markdown because that’s unreasonable on the Professor’s part.", "author": "nikkiemt", "created": 1631507714, "upvotes": 1}, "hcnftoz": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcnftoz/", "text": "Fuck the department head. Go straight to the dean and contact the local health department. If your college has a campus safety or health office, get them involved as well.\n\nFuck chain of command. Time to take this shit straight to the top without even skipping a beat. \n\nYou could easily make the argument that this also equates to education discrimination as you are not being given a reasonable accommodation for a health issue. \n\nI would even say get the college’s legal department involved. I bet their general counsel would LOVE to deal with this.", "author": "z3stycapybara", "created": 1631504537, "upvotes": 5}, "hcnc1yo": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcnc1yo/", "text": "Go cough on them", "author": "fyrefreezer01", "created": 1631502479, "upvotes": 1}, "hcna60f": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcna60f/", "text": "This is BS that the Professor is trying to expose your fellow students but here's a couple ideas. Certain students usually with learning difficulties or some other alteration to their \"criteria\" can take an exam in a separate room. I suggest asking your admin about doing that with a webcam proctor while you're reporting your professor for his idiocy. Hazmat Suit it up if you have to go. etc.", "author": "Furzball", "created": 1631501518, "upvotes": 1}, "hcn7v80": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcn7v80/", "text": "Profs aren’t gods, as much as they may insinuate otherwise. Take it over his head and watch it burn", "author": "Yum-z", "created": 1631500361, "upvotes": 1}, "hcn4sz9": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcn4sz9/", "text": "This sounds all sorts of sketchy. Obviously, you should bring it up with someone higher up, though it doesn't seem like this prof is one who will look kindly on someone who pisses him off and challenges his authority. \n\nAt the bear minimum, you could offer to take the exam in a private room. Since he doesn't seem to think Covid is a serious concern, maybe his office would suffice.", "author": "PoetryOfLogicalIdeas", "created": 1631498852, "upvotes": 1}, "hcn2vyb": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcn2vyb/", "text": "That professor probably doesn't have a choice depending on the college/state. Speak to/email his/her department head about the issue, and if they don't do anything about it then keep moving up the ladder until something is taken care of. You should not have to endanger your classmates because your professor refuses to accommodate.", "author": "xela293", "created": 1631497930, "upvotes": 1}, "hcms9ui": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcms9ui/", "text": "Call the dean. As a staff member on a college I would be furious if a positive covid case infected anyone else in the class. There is not reason for him to be such a hardass. I mean there is a pandemic…", "author": "Sevenlego", "created": 1631492948, "upvotes": 6}, "hcmn1kl": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcmn1kl/", "text": "If you had the common cold I could understand it. But in the world right now, idK if I'd even do that. But the fact that you have COVID is a whole new level.\n\nDefinitely email the dean or whoever you need. Because that is definitely stupid and unreasonable because you don't want to risk others safety. As others said, he'll change his tone when the dean speaks to him.\n\nAnd don't worry about what your prof will think. Just do it. Because he's either A) messing with your grade for something thag I'd really unreasonable or B) jeopardizing the lives of others", "author": "Ghost_Killer_", "created": 1631490392, "upvotes": 0}, "hcmficz": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcmficz/", "text": "complain to the department", "author": "jennyfrmthablocc", "created": 1631487013, "upvotes": 0}, "hcmc35u": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcmc35u/", "text": "A physiology teacher doesn't know that covid is super contagious?", "author": "bfangPF1234", "created": 1631485549, "upvotes": 0}, "hcm4lm2": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcm4lm2/", "text": "Your prof is likely going against your school and states covid regulations. Contact your dean and schools health department that handles covid reporting. Tell them how your professor is not making accomodations fot you to take the exam safely and is in essence forcing you to expose your entire class to covid which is absolutely illegal. In that event, the school would be held liable and open itself up to lawsuits.\n\nIf he wants to play stupid games, you need to play to win.", "author": "Cerenya", "created": 1631482353, "upvotes": 2}, "hcm385r": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcm385r/", "text": "shoot the President of the university an email", "author": "ArsonArse", "created": 1631481781, "upvotes": -1}, "hcm1x7p": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcm1x7p/", "text": "Email the school with his response. The head of the Dept for the class. If not then the dept/college chair", "author": "WorkingConnection", "created": 1631481238, "upvotes": 0}, "hclz7kn": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hclz7kn/", "text": "Reach out to Disability Services, the Dean of Students, and the Dean of the department - this is unacceptable", "author": "SpicyMargarita143", "created": 1631480114, "upvotes": 2}, "hclt5vb": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hclt5vb/", "text": "Is he someone who believes Covid is a hoax???\nSome tips... Mail yr Covid Positive test results...and if still no solution,\nMail screenshots of convo to departmental head and also put on yr case boldly with FACTS.", "author": "GroundbreakingPay903", "created": 1631477711, "upvotes": 2}, "hclsfcr": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hclsfcr/", "text": "Also, provide the teacher and department head with a copy of your positive test.", "author": "calmbythewater", "created": 1631477412, "upvotes": 2}, "hcljiwv": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcljiwv/", "text": "Email the department chair, and cc the dean.\n\nYour professor is 100% in the wrong here, your professor might think that you are just trying to get out of the exam, when in fact, you really do have covid.\n\nWith that being said, take this higher up, also tell classmates what is going on.\n\nIf I were your classmate, I'd go to higher ups myself on your behalf. \n\nSeriously, I feel like this could be lawsuit territory if you actually had to take the exam and ended up spreading covid.", "author": "SkeezySkeeter", "created": 1631473939, "upvotes": 2}, "hcljess": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcljess/", "text": "Absolutely contact the dean or head of department. That is absolute bullshit.", "author": "ThousandFootOcarina", "created": 1631473895, "upvotes": 2}, "hcldxzu": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcldxzu/", "text": "God it would be so funny if you could give your professor covid without putting anyone else at risk but alas", "author": "Inside-Recognition98", "created": 1631471754, "upvotes": 7}, "hclbes4": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hclbes4/", "text": "Hey, I'm not in college yet, but I'm pretty sure this is highkey illegal. Bring this up with the Dean as soon as possible and bring reciepts (screenshots, emails, etc.) because sometimes people in power try to sweep things under the rug.", "author": "pastaballpit", "created": 1631470796, "upvotes": 0}, "hcl7jja": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcl7jja/", "text": "Email the Dean", "author": "fgcDFWlurk", "created": 1631469323, "upvotes": 2}, "hcl7i9g": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcl7i9g/", "text": "Whenever I have issues like this I like to tag my advisor, my department head, and if it’s in another department, their department head. That way when they see all the top brass being tagged in the email they respond to it quickly and if they  are doing anything wrong they straighten up quickly. If it doesn’t change anything you at least get a clear knowledge on how to handle similar situations on the future.", "author": "reallysrry", "created": 1631469310, "upvotes": 1}, "hcl4c59": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcl4c59/", "text": "Email or call the dean. Tell them your teacher is basically forcing you to come to class with COVID if you don’t want to miss your exam. This is completely beyond your control... I’m pissed on your behalf.", "author": "concerninglydumb", "created": 1631468111, "upvotes": 2}, "hcl4385": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcl4385/", "text": "I would show up and announce to the class that you have Covid and then point out that the professor won’t let you miss the class and see what happens", "author": "NoSpaceAlien", "created": 1631468015, "upvotes": 9}, "hcl2i9a": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcl2i9a/", "text": "This is extremely immature of him especially in the middle of a pandemic", "author": "your_mom_has_hiv", "created": 1631467400, "upvotes": 1}, "hcl0maf": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcl0maf/", "text": "You're probably going to have to go over your professor's head.  Try looking up any official policy on absences at your school and if you can't find it, try talking to your academic advisor or another professor you know.  In our case, that goes through the Assistant Dean's office of the respective college, but every school is going to be different.  If all else fails, at least try the chair and your advisor.  Someone should be able to point you in the right direction because this is total BS.", "author": "LadyWolfshadow", "created": 1631466651, "upvotes": 5}, "hckztvd": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckztvd/", "text": "You must have got a third party yes right. Cuz at my school you get the test at the school then teachers will get notified, by t he school. Just send him a picture of your test results and then complain to someone like your advisor if he gives you a F.", "author": "ORCA_OF_WALLST", "created": 1631466327, "upvotes": -3}, "hckw9pl": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckw9pl/", "text": "I’m so scared of this happening because they all preach that if you’re sick not to come in but as soon as there’s a test they forget about that", "author": "BubblyOrangutan", "created": 1631464856, "upvotes": 7}, "hckvvnw": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckvvnw/", "text": "Did you get the vaccine?", "author": "GoodDog2620", "created": 1631464691, "upvotes": -5}, "hcktubc": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcktubc/", "text": "Just go in person and take the exam. As long as you try to avoid touching things and wear a mask you’ll be fine, if he’s gonna be inconsiderate then you have to be too, if you wanna get a good grade", "author": "BillerBillions", "created": 1631463823, "upvotes": -24}, "hcktsbf": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcktsbf/", "text": "Reach out to your Dean, achedemic advisors and department heads. Your professor needs to comply with Covid policies, and these people should be able to make him comply.", "author": "CandyBoBandDandy", "created": 1631463799, "upvotes": 10}, "hcktitt": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcktitt/", "text": "I’m sure your college has n official policy. You should look that up.", "author": "Donald_J_Putin", "created": 1631463689, "upvotes": 48}, "hckt9ex": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckt9ex/", "text": "I am assuming you are in the US but of course it will be different if you are not. \n\nThis really depends on your university policies. If you are at one of the many schools in the US that not requiring masks or vaccines, you are probably stuck with whatever your prof decides. If you are at a school with strict covid policies then there will be guidelines professors have to follow. At my university, profs are encouraged to work with students dealing with the public health crisis- the language is vague but basically means we have to be somewhat accommodating for students who are quarantining or ill.\n\nSearch your school’s website for Covid info. If there is anything then there is probably a section “for faculty and staff” or something like this that would lay out those guidelines if they exist.", "author": "ProfessorHomeBrew", "created": 1631463581, "upvotes": 6}, "hckrroi": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckrroi/", "text": "So what's the other option? You come in person and infect everyone...? Make sure you have an up to date covid check to prove you have it. He might think you're lying to get out of taking the exam.", "author": "rollllllllll_", "created": 1631462939, "upvotes": 78}, "hckqcr6": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckqcr6/", "text": "That's a lawsuit waiting to happen. Take it up as high as you need till someone does something about it.", "author": "thecommuteguy", "created": 1631462328, "upvotes": 14}, "hckpg9n": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckpg9n/", "text": "Email the department head immediately tell him you’re tested positive for COVID-19 and you have to quarantine your professor has told you explicitly you are not able to reset an examination even though you are currently contagious with COVID-19 make it very clear that you have a positive test result include a photograph of it and if you can contact your doctor and have them write you a note or something literally contact the department head that’s the next step up from your professor", "author": "pygmypuffonacid", "created": 1631461939, "upvotes": 359}, "hckoklz": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckoklz/", "text": "save everything. you have enough information for a lawsuit if you aren't allowed to take the exam. take it up to higher ups though and document their responses too. if he is doing this for one person, he has likely done it to others", "author": "Honest_Ad2183", "created": 1631461552, "upvotes": 7}, "hcknzj3": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcknzj3/", "text": "You need to talk to the higher ups. Regardless I always find that sort of stuff a shitty move (yes I know prof’s have their reasons, but if it’s beyond your control they should be flexible), but ESPECIALLY for this. Save the emails and show them to a dean or someone with the authority.\n\nEdit to add important info: my mother who works in university admin said GO TO RISK MANAGEMENT. They will be PISSED and your prof will definitely get a stern talking to", "author": "lesbyeen", "created": 1631461292, "upvotes": 60}, "hckn9h6": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckn9h6/", "text": "A&P teacher here. Your teacher is trying to keep cheating from happening, of course, but he's just being lazy about it. There should be a fair option for making up work due to a clearly excusable absence. \n\nI mean, you could ask him if it's okay to meet him in his office and take it that same day so that you'll only give it to him instead of all the other students around you, but I think going over his head is probably the only way to get a good outcome.", "author": "vesperIV", "created": 1631460972, "upvotes": 30}, "hcklfo5": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hcklfo5/", "text": "As someone with preexisting conditions… for the love of god don’t go. Email higher ups. Make a fuss. Start a social media riot. Just don’t endanger other students.", "author": "-Amber-Aura", "created": 1631460160, "upvotes": 97}, "hckk2ar": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckk2ar/", "text": "This also happened with me. I also emailed my professor and she said well then you can just take it online so i had to.  But the thing was that i wasnt feeling well enough to study and i also couldn’t sit that long in front of a computer. So i still went to the online test and i guess i wasnt feeling well enough that day so i failed", "author": "Interesting-Bee-8151", "created": 1631459558, "upvotes": 33}, "hckcouw": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hckcouw/", "text": "You saved the emails if this was by emails and you take it to the dean. The professor is potentially jeopardizing other student and staff because he won’t make a stupid change to this", "author": "rebel_child12", "created": 1631456224, "upvotes": 80}, "hck5zl8": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hck5zl8/", "text": "Can you take the exam online or is be forcing you to come into class and expose other?", "author": "Concerned-23", "created": 1631453038, "upvotes": 618}, "hck3xq1": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hck3xq1/", "text": "Are you symptomatic? If not and you can take the exam without jeopardizing the health of others, you should focus on hunkering down and taking the exam.\n\nIf you are symptomatic you should fight this with all you got.\n\n[EDIT] I'm wrong, wrong, wrong. I meant to take the test remotely but wildly miscommunicated it. Sorry for that.", "author": "Knute5", "created": 1631451939, "upvotes": -62}, "hck1q2p": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hck1q2p/", "text": "Take it up with the dean and department chair your professor is unreasonable. He's going to change his mind real quick when they speak to him. Email them now with the emails you exchanged with him and your positive results. Good luck and get well soon.", "author": "Orkney_", "created": 1631450693, "upvotes": 703}, "hck1etm": {"link": "/r/college/comments/pmrypg/i_tested_positive_for_covid_but_my_prof_wont_let/hck1etm/", "text": "Imma be real too, if the highest you can make is a C, I’m probably not even gonna make a C", "author": "Layzay374", "created": 1631450516, "upvotes": 193}}}