{
  "sid": "qotbcx",
  "link": "/r/college/comments/qotbcx/can_i_major_in_accountingbusiness_if_i_am_bad_at/",
  "title:": "can i major in accounting/business if i am bad at math?",
  "text": "i’m a senior in hs. I’m gonna take college algebra over the summer and i’m thinking of just biting the bullet and majoring in something like accounting or maybe even economics because those are more employable majors compared to what i was considering, which was polisci for the longest time but after lots of research i’ve realized it’s not exactly an in-demand major and i care more about getting a decent paying job after college. \nAny advice would he greatly appreciated. I am like super bad at math but i will be willing to really apply myself and maybe even get a tutor throughout college.",
  "author": "No-Understanding4281",
  "created": 1636306164,
  "updated": 1636655760,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjp5zj4": {
      "link": "/r/college/comments/qotbcx/can_i_major_in_accountingbusiness_if_i_am_bad_at/hjp5zj4/",
      "text": "Both those majors don't require all that much math. You'll need a little bit-- probably up to Calc 1, but it's a different \"watered-down\" Calc 1 than STEM majors take (schools usually call it \"Business Calc\" or the like). I find it highly unlikely that you'd actually need to even *use* that level of math in your career, though, so I wouldn't worry too much about it. \n\nAlso, the prerequisite for business calc is often just \"college algebra\" so you shouldn't have a million math classes to have to push through.\n\nAs to whether or not you can get through it, I'd say you probably can. I can't promise you it will be fun if you're the sort of person who doesn't like math, but if you take it slow (as in, make sure the rest of your schedule is as free as possible so that you have a lot of time to study) and you get tutoring and help as needed, you can probably make it through. Try your best to get a good professor, because that can make a world of difference too.",
      "author": "HumanDrinkingTea",
      "created": 1636307039,
      "upvotes": 3,
      "replies": {
        "hjpco5d": {
          "link": "/r/college/comments/qotbcx/can_i_major_in_accountingbusiness_if_i_am_bad_at/hjpco5d/",
          "text": "Thank you for your response, could the same be said about finance? or is that harder?",
          "author": "No-Understanding4281",
          "created": 1636309681,
          "upvotes": 1,
          "replies": {
            "hjpege9": {
              "link": "/r/college/comments/qotbcx/can_i_major_in_accountingbusiness_if_i_am_bad_at/hjpege9/",
              "text": "To be honest, I don't know much about finance, but it is likely to involve a bit more math. There will be statistics, but I don't know how advanced the statistics classes for finance majors get. Again, it won't be a ton-- nothing like a STEM major-- but you will need *some* math chops.",
              "author": "HumanDrinkingTea",
              "created": 1636310366,
              "upvotes": 3,
              "replies": {}
            },
            "hjr76ms": {
              "link": "/r/college/comments/qotbcx/can_i_major_in_accountingbusiness_if_i_am_bad_at/hjr76ms/",
              "text": "I'm currently taking a finance course as part of my Accounting degree. My accounting courses has more \"math,\" where finance is more simple math like calculating ratios and interest rates. It's not intense math, so even if you aren't good at math, you can always use a calculator or excel formulas to do a lot of the calculations. I am only taking Principles of Finance right now and it's more theory, so I don't know what other finance classes are like.",
              "author": "metalheadplanner",
              "created": 1636337744,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjp4gzx": {
      "link": "/r/college/comments/qotbcx/can_i_major_in_accountingbusiness_if_i_am_bad_at/hjp4gzx/",
      "text": "I was a business major for the first 2 years of college but i switched because i was incredibly terrible at math and my breaking point was calculus. I studied every day and would get tutored but I could not for the life of me get good at it even though I would understand the concepts while getting taught it. But you might retain information way different than I do, but yeah terrible at math so I switched majors.",
      "author": "choc0latchaud",
      "created": 1636306436,
      "upvotes": 1,
      "replies": {
        "hjp4rwk": {
          "link": "/r/college/comments/qotbcx/can_i_major_in_accountingbusiness_if_i_am_bad_at/hjp4rwk/",
          "text": "what major did you switch to?",
          "author": "No-Understanding4281",
          "created": 1636306556,
          "upvotes": 1,
          "replies": {
            "hjp8bs2": {
              "link": "/r/college/comments/qotbcx/can_i_major_in_accountingbusiness_if_i_am_bad_at/hjp8bs2/",
              "text": "i actually thought of switching to polisci but i switched to sociology which is also not an in-demand major but it’s broad and i like it",
              "author": "choc0latchaud",
              "created": 1636307995,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hjpmzjo": {
      "link": "/r/college/comments/qotbcx/can_i_major_in_accountingbusiness_if_i_am_bad_at/hjpmzjo/",
      "text": "Our business courses were surprisingly math intensive. Nothing hardcore but you will love to learn statistics",
      "author": "Katiehart2019",
      "created": 1636313663,
      "upvotes": 1,
      "replies": {}
    }
  }
}