{"sid": "pt98xq", "link": "/r/college/comments/pt98xq/how_to_cut_my_self_some_slack_when_it_comes_to/", "title:": "How to cut my self some slack when it comes to test grades?", "text": "Hi all, \n\nSo I just took my first exam of the fall (anatomy) and got a 92%/A.\n(Not trying to brag)\n\nI'm relieved that I got a passing grade but I'm kind of disappointed in myself that it wasn't higher. (Even though I got a frigging A!) \n\nDoes anyone else have this issue? Like even when you do really well, you still think you could have done a lot better? I feel like I need to nip this in the bud or else I'm going to be crazy burned out. \n\nHope everyone's week is going well!", "author": "designingwoman", "created": 1632322532, "retrieved": 1632946562, "over_18": false, "upvotes": 1, "upvote_ratio": 0.53, "comments": {"hdvztlk": {"link": "/r/college/comments/pt98xq/how_to_cut_my_self_some_slack_when_it_comes_to/hdvztlk/", "text": "Yes, I’ve had this issue all my college life. Your attitude will make you keep doing well☺️, but I hope you don’t get burned out by pushing yourself too hard.\n\nI kept pushing myself until I figured out that I might have hit the limit when doing my master’s at harvard. At that point, I started to focus more on my progress, not whether I got 90, 95, 100 on the exams. I couldn’t get near perfect grades any more, but I could enjoy learning new stuffs more and more", "author": "echoi33", "created": 1632344096, "upvotes": 2}, "hdv0djf": {"link": "/r/college/comments/pt98xq/how_to_cut_my_self_some_slack_when_it_comes_to/hdv0djf/", "text": "You’ll get over this pretty quickly once you start attending the harder classes were a 92% is only achieved via a curve.", "author": "JupiterRocket", "created": 1632327946, "upvotes": 2}, "hdusmn3": {"link": "/r/college/comments/pt98xq/how_to_cut_my_self_some_slack_when_it_comes_to/hdusmn3/", "text": "I look at it as anything above 90 is excellent and above 80 is still good and a passing grade but that's just me", "author": "Foxyboi_", "created": 1632324801, "upvotes": 3}, "hduoevk": {"link": "/r/college/comments/pt98xq/how_to_cut_my_self_some_slack_when_it_comes_to/hduoevk/", "text": "You're experiencing a very real psychological phenomenon related to being \"so close\". \n\nI did an assignment on this in my social psych class but basically it boils down to levels of achievement. \n\nFor example: A third place winner in a race will feel more achievement than a 2nd place winner. The 3rd place winner realizes that had they been a bit slower, they wouldn't have placed at all, so they are proud.\n\nBut the 2nd place runner feels as though if they tried just a *little bit* harder, they would've gotten first place. \n\nI will try to find the literature & send it to you. But I feel like if you got an 85%, you wouldn't have the same level of doubt as *almost* getting a perfect grade.", "author": "BarIntelligent9156", "created": 1632323058, "upvotes": 14}}}