{"sid": "pdcyae", "link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/", "title:": "Anyone else literally have no friends on campus and sat in the diner alone today?", "text": "I don’t know how to make friends and this sucks. Everyone has friend groups and I’m just sitting by myself alone bruh. There was BIG ASS social event I went to and I literally had to go by myself and I couldn’t meet anyone :(", "author": "BlacBoyUno", "created": 1630168104, "retrieved": 1632947380, "over_18": false, "upvotes": 977, "upvote_ratio": 0.99, "comments": {"hcwpncn": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hcwpncn/", "text": "joina club team. Youll make friends there, trust me", "author": "Ancient-Routine9454", "created": 1631676702, "upvotes": 1}, "hbiecij": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hbiecij/", "text": "I've done it every meal since last Saturday morning.", "author": "TheNoClipTerminator", "created": 1630713887, "upvotes": 1}, "hbhr2bh": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hbhr2bh/", "text": "Eating alone is actually very normal and I personally like eating alone sometimes. But, like the other comments said to make friends you just have to go out of your way to be friendly with people in your dorm or anywhere else on campus.", "author": "aanuma", "created": 1630702687, "upvotes": 1}, "haue3o6": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haue3o6/", "text": "If you really wanna meet people, maybe look around at lunch for someone that looks like it is in the same position as you (freshman, nervous, alone etc) and invite them to eat together:D", "author": "HedaLexa4Ever", "created": 1630267795, "upvotes": 1}, "hatpa2e": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hatpa2e/", "text": "bruh it's not weird at all, i eat at odd times between my classes and just work on my laptop or talk to people around me. i only actually plan dinners together with my friends since that time works for all of us", "author": "Technical-Guava1956", "created": 1630257271, "upvotes": 1}, "hat9uof": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hat9uof/", "text": "I had had the same same friend group all throughout middle and high school. I hadn’t made friends in 8+ years because I didn’t need to. When I got to college I was afraid that my social skills were too stunted to be able to make friends. My mom gave me THE BEST advice I’ve ever heard. \n\nCOMPLIMENT. PEOPLE.\n\nI noticed a girl who was in 3 of my classes. I told her I liked her boots after class one day. She’s now my best friend. Just compliment people. It starts conversation and gives you something to work with when making friends.", "author": "4thGenS", "created": 1630250935, "upvotes": 1}, "hat71bl": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hat71bl/", "text": "The easiest way to make friends for me was to sit next to somebody in class and ask them a question or two because I “didn’t hear what doc said” but don’t overload them and get on their nerves. After class is over, say thanks for helping me out, this class is so hard, I’m gonna go to the library to study if you want to meet me there when you get freed up.", "author": "LastingChamp", "created": 1630249713, "upvotes": 1}, "hat6dbo": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hat6dbo/", "text": "If you want a friend group, one easy way is through music classes.\n\nIf you sign up for band, orchestra, or choir, those are almost always close-knit friend group classes who'll accept anyone and make everyone a part of their friend group. I don't know what it is, but it's been like that everywhere I go.\n\nIf you're interested in music, of course. If you're not, then it won't be a great idea.", "author": "Captain_Pumpkinhead", "created": 1630249430, "upvotes": 1}, "hat3lvp": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hat3lvp/", "text": "Talk to the person next to you in class (only if they're responsive obviously, don't bug them if they don't want to talk), join some clubs, talk to your neighbors, follow up with people and before you know it you'll have friends", "author": "UnlooseNoose", "created": 1630248231, "upvotes": 1}, "haszuby": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haszuby/", "text": "Yeah, just to go to social events isn’t enough, you have to act social while there. Say hello, introduce yourself, ask what they’re studying or what they do with their free time or what music they enjoy. Engage while there. Smile. \n\nYou’ll find some people. Good luck!", "author": "AutomaticYak", "created": 1630246546, "upvotes": 1}, "hasxra0": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hasxra0/", "text": "[removed]", "author": null, "created": 1630245568, "upvotes": 1}, "hasvu64": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hasvu64/", "text": "I felt the same way but what helps me is to try to remember to be grateful that I’m even here. The first week is probably going to be the hardest before classes and clubs get going but it will get better for sure. Just know that there are thousands of kids on campus in your shoes too.", "author": "FinisherReZ", "created": 1630244650, "upvotes": 2}, "hassz8q": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hassz8q/", "text": "I’m eating alone right now, so are like ten other people. Revel in the chance to read Reddit and chill out. Take the time to say hi during classes or compliment people on their shirts if they have a thing you’re interested in", "author": "CampadLovesSpace", "created": 1630243201, "upvotes": 2}, "hasmdtm": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hasmdtm/", "text": "On my first day, I walked up to a girl and awkwardly asked if I could hang out with her. Since then, she introduced me to quite a lot of people. I have a group of friends because of her (although I eat alone often just because I like to eat and study). Put yourself out there just once, join a club, or just say hello to your neighbors. It’s might be miserable (I have horrible social anxiety so I understand), but it  could be worth it. Also, I’ve noticed the best conversation starter is a compliment, which also just makes a good first impression as well. Good luck!", "author": "GamerGrandmaGirl", "created": 1630239361, "upvotes": 2}, "hasebha": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hasebha/", "text": "you’ll find your group soon! it’s also normal to be eating alone when you officially enter the working life too", "author": "sparkleshun", "created": 1630233221, "upvotes": 2}, "hasb4ll": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hasb4ll/", "text": "basically there’s someone just like you on campus you just have to find them. if you don’t try then you don’t succeed. friends usually don’t fall out of the sky into your life. the large groups of people are gonna be everywhere in life so just get used to it. i probably would do the same the first few days as you but then commiserate about a hw assignment with a fellow student and hang out with them. it’s a process.", "author": "ReaperofMen42069", "created": 1630230381, "upvotes": 2}, "has6c1z": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/has6c1z/", "text": "I ate by myself almost every day last year. Only the first couple of days my roommate wanted to go out with me to eat then stopped because she found some friends.\n\nOtherwise I'd be alone. It's not that bad tbh.", "author": "hanahakilove", "created": 1630226083, "upvotes": 2}, "harz7g0": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/harz7g0/", "text": "Damn,  one thing that’s helping me, is board games, like social ones, like happy salmon, uno, cards against humanity, games are a great icebreaker, and then just putting your self out there. I know it can be tough and scary, but like maybe try messaging ppl in ur group me groups to come play (insert board game here) in a common area? \n\nAlso, I’m trying to go to as many campus  events as possible, even if they seem silly. It really comes down to putting yourself out there, because there are so many people that are lonely and are looking to make friends, especially right now.\n\nWish you the best of luck", "author": "barakamonismywaifu", "created": 1630220129, "upvotes": 1}, "harsrlp": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/harsrlp/", "text": "It’s hard the first week, but it gets better!", "author": "Robot_Biologist", "created": 1630215228, "upvotes": 2}, "harpnjx": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/harpnjx/", "text": "I used to be afraid of sitting alone and eating by myself, but honestly it’s quite relaxing. I enjoy human interaction but I don’t mind being alone. I can eat while I watch youtube or netflix.", "author": "ducks4jokera", "created": 1630213078, "upvotes": 2}, "haroc0n": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haroc0n/", "text": "You got this!!! Be confident and the right people will come", "author": "MarcelineOrBubblegum", "created": 1630212211, "upvotes": 1}, "harn2kz": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/harn2kz/", "text": "I just finished up my second day and have had the same problem when eating every meal so far.\n\nI’d say (just from that I’ve done/seen so far) don’t limit your social interaction to just the dining hall. Try to become friends with your roommate, hang out in public spaces in your dorm so you can try to meet your neighbors, and go to programming and events that the school and organizations put on to meet new people while having fun.\n\nEven though I still haven’t really made friends with anyone beyond my roommate, it’s those early impressions that count and taking the initiative to try elsewhere will go a long way.", "author": "skiboy625", "created": 1630211415, "upvotes": 1}, "harlker": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/harlker/", "text": "Honestly I've just been forcing myself through the discomfort of showing up to events / eating alone - worst case I feel awkward af for an hour, best case I meet some cool people by chance\n\nI get this tho lol I have no clue how people make friend groups", "author": "citieskylines", "created": 1630210484, "upvotes": 1}, "harkn07": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/harkn07/", "text": "I ate dinner today by myself and I’m a freshman with no group of homies yet but today I hanged out with a girl for 2 hours and I just texted her 45  mins ago so let’s see how things go 😂", "author": "alexarce210", "created": 1630209934, "upvotes": 1}, "harh7c0": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/harh7c0/", "text": "As a club president, I might be a bit biased, but I really do encourage you to try going to some clubs and committing yourself to something on campus. The best way to make new friends at any point is just getting involved with something. My sophomore year, half the few friends I made as a freshman were studying abroad, and the others otherwise busy. I joined a club and within a month I had a whole new friend group of people to spend time with and eat with. Most colleges have a rather extensive set of clubs to cover a lot of various interests.", "author": "The1LessTraveledBy", "created": 1630207919, "upvotes": 1}, "harh3nz": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/harh3nz/", "text": "I dead ass spent 4 hours in the common area at my school waiting for someone to talk to", "author": "MaterialDazzling6017", "created": 1630207860, "upvotes": 1}, "harbn6o": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/harbn6o/", "text": "I’m gathering you’re an American college student? As to the dynamics of college social life where you’re from I wouldn’t be so sure, but one thing I know for sure - is that friends aren’t going to fall on your lap. I’m in my 3rd year of a 4 year Bachelors (not sure what that is in America) and I would say that I’m very happy with where I am when it comes to friends in college, but on day one, I sat alone, I was petrified of introducing myself to anyone. On our first break I was sitting alone in our canteen watching other students mingling when I seen 3 guys round a 4 seater table, I was so scared, but I repeated it over in my head that I wanted to sit down with them, and counted down from 10, I introduced myself and met 3 of my best friends in the entire world, guys that I would do anything for. Sometimes, all it takes is one awkward hey and the rest becomes history.\n\nBest of luck in your search!!", "author": "tyvy", "created": 1630204801, "upvotes": 1}, "harbghe": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/harbghe/", "text": "This is very normal. I ate alone for a lot of my dinners until I found my core friend group.", "author": "mohandasan", "created": 1630204699, "upvotes": 1}, "har4kk7": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/har4kk7/", "text": "I don’t have any friends at school either. Kinda bummed out especially since my birthday is soon", "author": "sameerson", "created": 1630201062, "upvotes": 2}, "har3eom": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/har3eom/", "text": ">today?\n\nbruh, I did this for most of my meals freshman year", "author": "incognitoshadow", "created": 1630200468, "upvotes": 2}, "haqzkvm": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqzkvm/", "text": "I commute but often need to eat on campus because I have classes from morning to night and there's no use to drive back home during my breaks. Anyways, during my first semester I had a lounge I was able to eat in and made tons of friends. I could make my food and had access to a fridge and microwave, it was great! However, my college took away these resources due to the pandemic. Can't eat indoors anywhere unless you buy the cafeteria food. I now eat alone in my car every day, and I hate it. I hate eating in a car all crammed up without a table. I hate eating without friends and not having conversations. Most of my friends from the lounge have since graduated and all I know is that it feels impossible to make new friends. I'm also fairly active and involved. I just don't know how to maintain friendships outside of my activities. I can only imagine this is even worse for the younger students who feel lonely.", "author": "cabbage-soup", "created": 1630198493, "upvotes": 2}, "haqw5t4": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqw5t4/", "text": "I’m in the same boat as you - joining clubs is a good way to meet people and also just go to the social events and I’m sure others will also be alone! Look for the people hanging on the outskirts and go help and say hello - I’m sure they will be as thankful to see you as you are to see them. Tons of people also eat alone - myself included so no shame in that either! Finding friends does take time - it took me a whole semester to find a few and then another semester to find some more but slowly you’ll be able to find some I’m sure of it! A roommate is also a great person to hang out with and get meals with!", "author": "Stardazed678", "created": 1630196745, "upvotes": 2}, "haqvedy": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqvedy/", "text": "[removed]", "author": null, "created": 1630196355, "upvotes": 1}, "haquerx": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haquerx/", "text": "My first year of college I made it through a weekend long orientation, summer community service program, and then the first few weeks of school without making a solid friend. I met a few people but definitely wouldnt want to share a meal or hang out after class tbh. My roommate was kind enough to keep inviting me places but you’d most likely find me studying in the classroom within my dorm. One day I was up studying late in said classroom and was approached by 2 girls, 1 guy. Not even sure exactly what was said but we kicked it off from there.\n\nFast forward, I transferred back in-state during the pandemic and am commuting so I’m very much of in the no friends category again lol It doesnt help that Im a super senior and anyone I know that attended my now current school just graduated this past May. Now my plan is to study in the quad twice a week and attend any back to school events on those days. Hopefully this works haha Not sure if you’re commuting or living on campus but my advice is give people the chance to approach you. Keep attending events even if they’re not necessarily meant for “meeting people”. You’ll also eventually meet people you don’t mesh with and thats fine. Don’t force it, don’t rush it, and it’ll work itself out.", "author": "Responsible_Poet5136", "created": 1630195849, "upvotes": 4}, "haqtckd": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqtckd/", "text": "I remember before miss Rona I had no friends in college I literally would go to one of the back stair cases and eat there by myself because the cafe was always filled with friend groups and the little table areas meant for one person where always filled and it wasn’t until one day I saw a boy I went to Highschool with noticed me buying food to go eat in the stair case and he came there to eat with me and he introduced me to his friends he had made and this was like my second semester and I still had no friends yet", "author": "hollow_ling12", "created": 1630195312, "upvotes": 3}, "haqsdwa": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqsdwa/", "text": "Would it be weird to sit next to other people who are alone and try to talk to them? I've been thinking of doing this as a way to connect with people similar to me, but the past week I've shied away from going to the dining halls.", "author": "MrChungusKhan", "created": 1630194834, "upvotes": 2}, "haqsd9n": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqsd9n/", "text": "I sympathize. I had no real friends for my first four semesters at college.  And even when I wasn't sitting alone, I was hanging out with my roommate and his friends, none of whom were people I really liked.  It was rough for those first few years, but eventually I did make some actual friends and the college life got a lot more tolerable.", "author": "DonktorDonkenstein", "created": 1630194826, "upvotes": 2}, "haqpq9w": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqpq9w/", "text": "I am international student, sometimes I get embarrassed of my English pronunciation, so I tried to avoid talking English,  but I know that isn’t helpful to practice my English. I feel that native English speakers will laugh at me. Sorry to be that insecure 🥺 that is reason why I am struggling to make friends. It sucks because I am in computer science major where there are a lot of group meetings. It’s awkward when everyone is quiet. 😂", "author": "Background-Season-24", "created": 1630193515, "upvotes": 2}, "haqohah": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqohah/", "text": "OP must be freshman, In college it’s very normal to eat alone.", "author": "JonathanL73", "created": 1630192896, "upvotes": 3}, "haqnlmn": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqnlmn/", "text": "I think as we grow through life this is something very common and not just in college. Its obviously different in high school but after that you wouldn't always be with someone all the time. Its difficult to grasp this but it is how it is. And that is not always because you are lonely or dont have any friends. It can be because you want alone time, schedules don't line up anymore and you just have other stuff to do. I go to places to eat all the time. Well not like fancy restaurants but places like Chipotle and what not. Its a useful skill to be enough by yourself and enjoy your own company. And like some other people said no one gives a shit if someone is eating alone or not. And the people who do they are not worth caring about", "author": "honeybadger_1996", "created": 1630192456, "upvotes": 4}, "haqmrj2": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqmrj2/", "text": "This happened to me freshman year , I totally understand . I ended up just going to dining halls that allowed take out and ate in my room all the time . And I had a mini fridge and microwave so I’d save food for later and when I ran out just made sandwiches,  cereal, and microwaveable stuff .", "author": "sharee_", "created": 1630192036, "upvotes": 3}, "haqlxnw": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqlxnw/", "text": "At least you eat in peace. I'm a girl and not to gloat but I've been blessed in the looks department (not popular girl looks but the innocent girl with freckles look). Everytime I went to eat (alone weather I wanted to or not) a group of 2 to 4 guys would show up and get all in my business. It was awful. Offering friendship YES, what's my  relationship status and astrological sign NO!", "author": "QuirkyGirl96", "created": 1630191631, "upvotes": 2}, "haqko62": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqko62/", "text": "Eating with other people is overrated as fuck. Make friends in classes and online but use your meal times to get some peace and quiet.", "author": "rarosko", "created": 1630191022, "upvotes": 6}, "haqk0fn": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqk0fn/", "text": "There are a lot of people eating alone at my school if it makes u feel any better", "author": "CaprioPeter", "created": 1630190698, "upvotes": 4}, "haqi6ya": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqi6ya/", "text": "Well, why are you bothered by being alone at a meal? I don’t mean this to be snarky, I genuinely want you to consider it for a bit. Are you afraid of being without friends? Are you accustomed to family meals and uncomfortable eating in silence? Are you just feeling like you -shouldn’t- be alone at meals based off some preconception of what life should be? \n\nMull it over for a bit. Maybe the problem is not about making friends quickly, but about adjusting your expectations.", "author": "HaloGuy381", "created": 1630189814, "upvotes": 9}, "haqgwy2": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqgwy2/", "text": "Did that since grade school", "author": "Qwerty172xx", "created": 1630189203, "upvotes": 2}, "haqelnl": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqelnl/", "text": "Usually I first look for anyone I know (people from my floor mutual acquaintances etc). I've asked tons of people if they would mind if I joined them. No one has ever said no. If I don't know anyone there I take out my headphones and watch Netflix.", "author": null, "created": 1630188086, "upvotes": 3}, "haqc5cz": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqc5cz/", "text": "Be more comfortable with your own company. Like another user said, schedules don’t always line up. You gotta make things work on your own. \n\nI’ve found in college that the more alone time I get the better. I can focus on my work.", "author": "someraddude", "created": 1630186928, "upvotes": 5}, "haqajs5": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haqajs5/", "text": "It sounds bad, but as an introvert, I found being able to sit and have lunch by myself was a blessing. Do you ever have a roommate who doesn’t leave the room? If you get mad about that in the real world, you’re an asshole. at college, the line gets a bit blurred. Why? You’re constantly around people. \n\nI found that when I was able to have lunch by myself, it was a blessing", "author": "CapriciousSalmon", "created": 1630186175, "upvotes": 7}, "haq8rxw": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haq8rxw/", "text": " Just talk to people, start by asking them a simple question then introduce yourself and ask them what their name is,  a simple nice to meet you then be quiet, If they ask u a question then they wanna talk more and just dive into it, make sure to come up with what topics ur gonna talk if a conversation starts up , also I'm glad I got a senior friend who is in the college, as a freshman, he introduced me to alot of his friends but naturally Ile make my own, Good luck fellow gladiator", "author": "AzureSky77", "created": 1630185353, "upvotes": 5}, "haq8922": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haq8922/", "text": "College is mostly a bunch of people pretending to have their shit together. I can assure you even of the people sitting in those groups a good portion of them feel like they aren't friends with those people and feel out of place. \n\nYou're not alone in your loneliness and there are a bunch of people who feel like they can't meet anyone either. It's just about figuring out who that is- or just finding someone who you can vaguely relate to. \n\nFind someone you have a class with and be friendly to them- they will probably reciprocate. If they don't you can move on because you wouldn't want to be friends with them regardless. \n\nAsk someone from a class if they want to grab lunch to talk about the class work- there's nothing like bonding over stuff you find out while trying to do homework/study. If they don't want to study together ask someone else in your class. \n\nIf you see one of your classmates outside of the class you should start a conversation about class- then move on from there if they seem cool. \n\nPretty much everyone wants more friends and a lot of people have no idea how to make friends when they don't have the exact same schedule as someone else for thirty-five hours a week. You are not alone and you can figure it out- just remember most people are having a lot  more problems than they want you to think- you're doing great dude. \n\nThe first bit of college was super scary for me (I was younger than everyone and super awkward) but I realized pretty much everyone feels that way and if you can project enough confidence it will be fine. Just start talking to people, it can be about literally anything you can identify as a common factor. Class is usually the easiest thing to start with but if you can find a second thing you're golden. You're going to figure stuff out but until then remember no one else really knows what they're doing either.", "author": "no_username_4_u", "created": 1630185110, "upvotes": 11}, "haq7mdk": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haq7mdk/", "text": "It’s normal to sit alone. People have different schedules and shit to do.", "author": "WalmartDarthVader", "created": 1630184818, "upvotes": 9}, "haq5lkx": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haq5lkx/", "text": "I teach college and see it all the time. Here's what I suggest. Go buy an iron on transfer package for about $10 online. Find a picture online of something you're passionate about or just really interested in and transfer it on a T-shirt. Do the same using another picture for the back. Walk around a party you went to by yourself and someone will absolutely come to you and ask you about it. It is really easy to strike up a conversation when you find someone who has the same interests.", "author": "clickx3", "created": 1630183901, "upvotes": 18}, "haq4mcz": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haq4mcz/", "text": "Go sit with someone! At this point in the semester, people will typically (though not always) be amenable to someone asking to join them.", "author": "secondpriceauctions", "created": 1630183461, "upvotes": 2}, "haq3jng": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haq3jng/", "text": "Go to a table with a group of people you wanna be friends with or who are in your class or whatever, and just ask \"mind if I join you?\"", "author": "BeautyAndGlamour", "created": 1630182977, "upvotes": 2}, "haq23bg": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haq23bg/", "text": "Ask to sit at a table please help yourself man", "author": "Nofapdeity", "created": 1630182319, "upvotes": 2}, "haq0wrs": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haq0wrs/", "text": "there's a 2nd year ice cream social thing this tuesday and im still trying to hype myself up to go, im scared because i have no one to go with... but the point of going is to meet people lol. basically, you're not alone in being alone, don't worry!", "author": "barakitkat", "created": 1630181788, "upvotes": 13}, "hapyocs": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapyocs/", "text": "Literally give yourself time. College in the media is also fucked just like how high school is portrayed. No one cares what you do or if you sit alone or what you wear. No one does. You'll eventually make friends and you'll have people to sit with. Just be patient", "author": "Successful-Painter87", "created": 1630180778, "upvotes": 74}, "hapxf2d": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapxf2d/", "text": "Just try talking to someone. Most people want to talk too but are scared to make the first move. Your awesome, be brave!", "author": "Murky-Possibility961", "created": 1630180205, "upvotes": 8}, "hapust4": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapust4/", "text": "Same.", "author": "Brian2017wshs", "created": 1630179022, "upvotes": 2}, "hapu7bi": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapu7bi/", "text": "Oh man. The amount of times I say in my dorm eating breakfast and dinner alone. It happens.", "author": "KingBlackthorn1", "created": 1630178753, "upvotes": 33}, "hapu6ce": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapu6ce/", "text": "Don’t worry about that I hang out with people very often but I don’t eat lunch with them because of schedule and classes", "author": "Inner_Cress_6478", "created": 1630178741, "upvotes": 13}, "happ564": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/happ564/", "text": "I literally sit alone and other people sit alone too 😭😭and there’s people who are loners too. I am but I literally don’t care 😭😭 just stop comparing yourself to people with friends if you actively avoiding not doing that said thing.", "author": "eha4045", "created": 1630176502, "upvotes": 8}, "happ23x": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/happ23x/", "text": "This is my the past two years, my social skills are so awkward :(", "author": "shrimpynut", "created": 1630176465, "upvotes": 20}, "hapnwbq": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapnwbq/", "text": "I went to a bunch of campus activities yesterday. Here is how it went.\n\nFound actives online, signed up for contact tracing, committed to going.\n\nWent to event and chatted with people in line. This is like, commentary or complimentary or observation. \"Omg, im so glad I didn't wear jeans\" \"oh I wish I'd thought of that\" \"I love your x\"  I (as a woman) complimented about 15 swimsuits yesterday. I didn't lie. I only said what I meant lol. I also eavesdropping a little, the jeans comment was in reply to someone saying same to someone else to their friend. \n\nEvery time I chatted someone, I introduced whomever friend I had just made, and made sure to show interest also in whoever they were with. I asked names over and over. Because if I see them later, I want to yell \"hey julie!\" Even if Julie and I have 0 shared interest because Julie might be hanging out w/Sam someday when I yell, \"hey Julie\" and Sam will be like \"oh I met her at x but we don't really talk because she y major\" but Sam says hi to me in class someday after she switches to y major... its never quite so smooth but you get it. Just be interested. Be nice. Have open body language.\n\nSo I went and changed :) and then went a slip and slide and no one was there, ezxpt 3 girls and I was hesitant to go alone. They said openly they'd wait for me. Then I met EVERYONE in their dorm including a mass communication major I had nothing on common with. We just chilled because of proximity and that guy runs DND. \n\nSo. You have to kind of, turn it on.\n\nI also recommend clubs, outdoor activities, student engagement and or intramural sports. But what gets you friends is that you keep going consistently.\n\nAlso. I AM AN INTROVERT. this is not meant to be advice from someone with no problems making friends.", "author": "bitetheboxer", "created": 1630175959, "upvotes": 67}, "hapnc4w": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapnc4w/", "text": "I've been in college for around a week and the only person I've sat with has been my roommate", "author": "Jumpy-Ad6630", "created": 1630175722, "upvotes": 162}, "hapkb47": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapkb47/", "text": "I’ve been sitting with friend groups but it’s soooo awkward", "author": "kyramaro", "created": 1630174433, "upvotes": 27}, "hapj5ip": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapj5ip/", "text": "I sit with random people and talk to them", "author": "NoOutlandishness9892", "created": 1630173939, "upvotes": 18}, "hapi1vx": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapi1vx/", "text": "Eh I'm in my 3rd semester and the only person I know is in a completely different program so I'm used to it. But in all honesty if you want to talk just pm me anytime. I'm a bit socially awkward but it would be nice to chat, if you want of course.", "author": "naaooonnnngh", "created": 1630173471, "upvotes": 3}, "haphslv": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haphslv/", "text": "I literally talk to no one at my university, unless I'm forced to because of a group lab or something. Not that I don't want to but I have shit social skills.", "author": "Disonance", "created": 1630173361, "upvotes": 40}, "haphhhz": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haphhhz/", "text": "Yes.", "author": "MohammadRezaPahlavi", "created": 1630173232, "upvotes": 5}, "hapgrk3": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapgrk3/", "text": "Welcome to life after high school.", "author": "NoSpaceAlien", "created": 1630172932, "upvotes": 30}, "hapgddn": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapgddn/", "text": "Hi senior here and if you really wanna make friends in college just go talk to someone. I know thats cliché but it’s really that easy. 95% of people I’ve talked to over my years of college were really nice and pretty easy to talk to. Everyone wants to make friends in college there’s just a lot of people who have trouble making the first move I was like that before I met my friend group freshman year and I’m still like that now just a bit better at it. You can either make the effort now and have good friends for years or wait for an extrovert to find you and talk to you which can take who knows how long.", "author": "burgerzkingz", "created": 1630172771, "upvotes": 104}, "haperjg": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/haperjg/", "text": "Find someone else sitting alone and sit together.", "author": "6F9I", "created": 1630172111, "upvotes": 53}, "hapdqii": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapdqii/", "text": "that was me this week", "author": "SanjivanM", "created": 1630171701, "upvotes": 23}, "hapahez": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hapahez/", "text": "Have you tried clubs ? It’s a natural way to make friends since you frequently meet the same people.", "author": "peachybooxoxo", "created": 1630170351, "upvotes": 227}, "hap7qm0": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hap7qm0/", "text": "People eat alone all the time in college. Even if you have a lot of friends, schedules don't always line up. It's normal to have to sit by yourself sometimes, I promise you no one cares or even gives it a second thought!", "author": null, "created": 1630169160, "upvotes": 871}, "hap7qct": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hap7qct/", "text": "Me too. To be honest I might just leave at the end of the semester I really don’t like it here", "author": "aardvarkman3", "created": 1630169157, "upvotes": 56}, "hap6i9e": {"link": "/r/college/comments/pdcyae/anyone_else_literally_have_no_friends_on_campus/hap6i9e/", "text": "Fake choking so someone has to save you. They’ll be your best friend for life!", "author": "thedarkwillcomeagain", "created": 1630168630, "upvotes": 132}}}