{
  "sid": "ql7bix",
  "link": "/r/college/comments/ql7bix/scored_low_on_aleks_placement_test_not_sure_what/",
  "title:": "Scored low on aleks placement test not sure what to do now…",
  "text": "Background: dropped out of HS 5 years ago due to anxiety and mental health issues , and trying to change my life around. Got my GED a few months ago and registered to start at my local CC Spring 22 then off to my State Uni. Classes are available to pick this Wednesday 11/3, I just took the aleks and scored a 31… not surprised given I’ve been out of classroom setting for 5+ years now, but idk what to do. My major requires me to take Finite Math and Bus calc. The way I’m currently placed Id have to take 1 remedial math, then basic college algebra, then start the finite and bus calc track. Option 1: spend the money take the remedial classes and work my way up. Option 2: Don’t take any math this semester and hope I do better on aleks if I try again. Option 3: Just wait and take aleks at the uni I’m transferring to and hope I place into the tracks.",
  "author": "Diligent_Carrot_652",
  "created": 1635868613,
  "updated": 1635890723,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hj0zbse": {
      "link": "/r/college/comments/ql7bix/scored_low_on_aleks_placement_test_not_sure_what/hj0zbse/",
      "text": "Option 4: Work through the ALEKS learning modules now (or other practice) and re-take the test in a few weeks, or over Christmas break.  Take College Algebra in the spring.\n\nJust because classes are available to pick tomorrow doesn't mean you have to 100% finalize your schedule tomorrow. Make a schedule that leaves room for the math class one up from what you've currently placed into. (Yes, there's a possibility that classes fill up, but there will almost certainly be some people who register for College Algebra and then change their minds later and/or fail the prerequisite course.)\n\nYour options 2 and 3 don't really make sense if you aren't planning to learn the material independently in the meantime. Your ALEKS score won't magically increase with time. And if you are willing to put in the time to learn the material independently, you might as well start that now and retest for the spring semester.",
      "author": "Dunyazad",
      "created": 1635869761,
      "upvotes": 2,
      "replies": {}
    }
  }
}