{"sid": "pwm1ju", "link": "/r/college/comments/pwm1ju/college_made_me_realize_how_easy_it_was_to_make/", "title:": "College made me realize how easy it was to make friends", "text": "My god I wished someone told me earlier! I spent my entire middle school/high school life sulking because I thought it was so hard to make friends. I could get along with people just well, but never managed to make it past the \"acquaintance\" phase. I felt so depressed seeing people who had entered my school a few weeks ago already hang out with people I've been trying to be friends with for years (!!).  \n\n\nAnyways while I was all alone in lockdown, I saw some posts about how most people in college were also new and looking to make friends, and that you should just go to them and ask them out. \n\nAnd I did... And it worked... so easily!\n\nI'm not your social butterfly, I can be very awkward but even for me it was really simple! I walked out to groups of people, asked \"can I join you guys?\" and they were always very nice etc. Then when the convo is about to end, I'd just ask for their phone number and we'd part ways to go to class. Mind. Blown.  \n\n\nI wished I'd known years ago but it's never too late, so if you're reading this do it too! You may be shy to talk to people but once again, some of these people literally changed cities/countries/continents and know absolutely no one, and would love to meet new people too! They won't look down on you at all so go for it!", "author": "usagi_in_wonderland", "created": 1632763815, "retrieved": 1632945504, "over_18": false, "upvotes": 11, "upvote_ratio": 0.92, "comments": {"heiiuku": {"link": "/r/college/comments/pwm1ju/college_made_me_realize_how_easy_it_was_to_make/heiiuku/", "text": "Wanna be friends on Reddit? Currently in college and am looking for new friends anywhere and everywhere", "author": "TAMUVIBEZ", "created": 1632775526, "upvotes": 1}, "heib3wv": {"link": "/r/college/comments/pwm1ju/college_made_me_realize_how_easy_it_was_to_make/heib3wv/", "text": "Good advice! I’m kind of shy but I’ve had a few people like you in my classes and it’s always a relief that they’re doing the work of making friends with me. One random guy turned to me during class one day and was like “Wanna go study after this?” So easy!!", "author": "LawfulnessFancy5450", "created": 1632772047, "upvotes": 3}}}