{
  "sid": "qmv93c",
  "link": "/r/college/comments/qmv93c/does_life_get_better_after_college/",
  "title:": "Does life get better after college?",
  "text": "I work Friday, Saturday and Sunday. 8 hours each day. I go to school Monday -Thursday. I don’t have a single day off and 100% of my paycheck goes to rent and car payment. \nMy family tells me that college is the easy part. Does it really get worse than this after graduation?",
  "author": "eating_at_ihop",
  "created": 1636061633,
  "updated": 1636184826,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hjcasu5": {
      "link": "/r/college/comments/qmv93c/does_life_get_better_after_college/hjcasu5/",
      "text": "College is only the easy part of you aren’t working at all and taking only a moderately difficult degree and have no major (bad) life events happening during those years. \n\nLife will have ups and downs. Some of my twenties were easy, some difficult. My thirties were pretty damn terrible and hard overall (juggling career issues plus a family/kid, a house flood, medical issues, etc.) I’ll be honest though, my forties have been great so far! Everything is settling down and I finally have money for things I want to do. But the rest of it was more rollercoastery.\n\nBut no it won’t be all bad or all worse than right now.",
      "author": "begrudgingly_zen",
      "created": 1636064522,
      "upvotes": 6,
      "replies": {}
    },
    "hjdvgsz": {
      "link": "/r/college/comments/qmv93c/does_life_get_better_after_college/hjdvgsz/",
      "text": "Yes it absolutely does. So much freedom.",
      "author": "Altruistic-Factor995",
      "created": 1636092986,
      "upvotes": 2,
      "replies": {}
    },
    "hjerh30": {
      "link": "/r/college/comments/qmv93c/does_life_get_better_after_college/hjerh30/",
      "text": "No",
      "author": "yetiman3511",
      "created": 1636117284,
      "upvotes": 1,
      "replies": {}
    },
    "hjdnt2g": {
      "link": "/r/college/comments/qmv93c/does_life_get_better_after_college/hjdnt2g/",
      "text": "Choosing to have a kid in this economy sounds like a toy problem tehee. If op graduates and manages to get married to someone with a similar salary their life will be great. DO NOT HAVE KIDS IN THIS ECONOMY. They are resource vampires…and you gotta love em and stuff🤮",
      "author": "Conjurepapi",
      "created": 1636087487,
      "upvotes": -4,
      "replies": {}
    },
    "hjhzlg8": {
      "link": "/r/college/comments/qmv93c/does_life_get_better_after_college/hjhzlg8/",
      "text": "If you do work + school or do only school in a hard major, the real world will be way easier, give more free time, and pay well. If you are a full time communications major… well real life will kick your ass",
      "author": "evasiveshag",
      "created": 1636164247,
      "upvotes": 1,
      "replies": {}
    }
  }
}