{"sid": "o8y8q3", "link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/", "title:": "Anyone else entering their final year feeling like they didn’t do enough during college?", "text": "I don’t want to live with regrets, I know after college, I won’t ever have the same experience. I want to live life to the fullest while I’m here. I want to do or have as much fun or adventures but I feel like I’ve been saying no too much and end up alone doing almost nothing. Any tips?", "author": "Fiamettea", "created": 1624804501, "retrieved": 1632947775, "over_18": false, "upvotes": 833, "upvote_ratio": 0.99, "comments": {"h45uatg": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h45uatg/", "text": "Most important thing imo would be to secure your college friend group & family friend group. You’ll need them for later.\n\nOnce you get out, you’ll see that work friends while friendly aren’t necessarily the best people to have around all the time. Not because of them as people, but just because when you chill, you can’t help but think about work. And/or your usually at work when you even see them. It’s good to have a backup network of friends that you can just chill with that aren’t solely work related. And shocker, unfortunately, this group will dissolve over time slowly as everyone’s life will become more complicated. So, if in college you could walk away with a solid group of people that you could later chill with, that’ll probably buy you 10 years or so, outside of college socially, so that you could socially coast through your later 20’s and early 30’s before the chapter of marriage, family, children, and career start to complicate things. \n\nI’m saying this as someone who took a different route. Went to college after high school, dropped out. Over my stretch of experiences, I bounced around from friend group to friend group, job to job, before coming back; by the time I did, I didn’t really have a solid group. It wasn’t really a bad thing at least for me, I was used to it; but if I had the choice, it would’ve been great to still have one. Meanwhile, the old friends of mine have been out of college for like 7 years, they’re approaching 30, still hang out with their college buds. While I don’t necessarily regret dropping out, I do regret not taking advantage of the fact that at that time, the playing field was pretty much level in terms of maturity and low risk. Everyone was like late teens/early twenties, the age gaps were negligible, and life was simple. Plus, at a university, depending on the location, the students are all pretty much stuck there lol. So, there has to be at some point, probably frequently, indirect mass gatherings of early twenty-somethings all mingling around, in the same general situation, sharing points of interest common with one another lol; some even so much as in the same major!!!\n\nIt’s the perfect storm for making friends. \n\nSo, with that. I’d just get involved with your university. Use all the resources they give the students to be social to your advantage. This could be clubs, fraternities/sororities, parties, events, sports, research, activism, meet up groups, inter murals, academics, etc. anything where you can get around some kind of group of people and interact. And then just make the most bad ass friend group you can. And then onward after university, continue in this pursuit to make an even larger badass friend group. And then use that group for that pre-33 “college 2.0 experience”", "author": "pekkalacd", "created": 1625515477, "upvotes": 2}, "h3d94zi": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h3d94zi/", "text": "literally just was anxious about this today", "author": "nakedmolerat12", "created": 1624915566, "upvotes": 1}, "h3d6spw": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h3d6spw/", "text": "i started college 2019 and my first year was derailed by covid by the end. my second was online and now due to trying to get ahead while in HS, I’m entering my final year. it’s hard to deal with how much I know I’m going to miss", "author": "Floor_Subject", "created": 1624914527, "upvotes": 2}, "h3atn4z": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h3atn4z/", "text": "I'm starting my 3rd year and already feel it", "author": "eamarwan", "created": 1624868381, "upvotes": 1}, "h3at4ev": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h3at4ev/", "text": "Do some shit. Break out of that anxiety and go do some shit, within your comfort of course. The end of college won't be the end of hangouts or parties either, so try not to worry about that. Just do what makes you happy.", "author": "MrEpicVisionz", "created": 1624867874, "upvotes": 1}, "h3ai31i": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h3ai31i/", "text": "I’m in the exact same boat as you. I’ll be starting my final year of college in august and I know I did didn’t do enough. My dumbass chose to go to a college in my city and live with my strict, devout parents for the first three hears. Because of that, I never went to any parties, never joined any clubs and never really made too many close friends that I hung out with outside of classes. I’m doin a lot to change that for my final year, however, things might stay the same (I hope they don’t)", "author": "adamb863", "created": 1624858191, "upvotes": 1}, "h3aee5p": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h3aee5p/", "text": "You will have plenty of opportunities to live life to the fullest AFTER college. Life does not begin and end during college.", "author": "HoeForCookieDough", "created": 1624855440, "upvotes": 1}, "h3abw8z": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h3abw8z/", "text": "I’ve felt this so much. Whether it’s resume related, traveling related, or simple activities that I’ve just never done. Friends are great, but advice I’ve seen from many people: be okay do things alone sometimes. I’m still learning to take this advice as well.", "author": "normaltea1", "created": 1624853709, "upvotes": 1}, "h3a3ezf": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h3a3ezf/", "text": "Like... what exactly do you feel like missing out? I haven't been to college yet and I am 26 - by no means I will have traditional college experience because I am a working person and funding everything myself, but I had so many good experiences in life and wonderful friends and adventures. Life is what you make it and nothing come itself. You always need to work on relationships to be able to participate in adventures or social settings.", "author": "Professional_Mine2", "created": 1624848423, "upvotes": 1}, "h3a1yt7": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h3a1yt7/", "text": "I just graduated this past semester and I felt exactly the same way. College really helped me to get out there socially. I had so few friends up throughout grade school but I made so many great friends in college. I had a lot of FOMO throughout college and I did a lot of things because I wanted to make up for \"lost time.\" I felt extremely anxious as I reached the end of my college career and really grieved over how different my life would be and how far away from my friends that I would be afterward. I felt myself not enjoying the wonderful things that were happening my last year because I was so sad that it was going to end. Don't focus on it ending, focus on the good things now. Just go and do some fun, adventurous (and safe) things with your friends. Doing that helped me to get over some of that anxiety and move on after graduating. \n\nGo out and do things! Make the most of your last year! Don't feel bad about missing some things here and there. You're probably going to feel like you don't want to leave but it gets better. There's are plenty of wonderful things to do outside of college. Despite my initial fears, I now have a great job and am enjoying my life outside of college as much as I did while in college.", "author": "noahelli8890", "created": 1624847603, "upvotes": 1}, "h39rda6": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h39rda6/", "text": "The trick is not to ask what could have been too often. COVID screwed a lot of plans and people's lives up so I would say to try and be optimistic for the last year anyway.", "author": "Abell379", "created": 1624841583, "upvotes": 5}, "h39qwaq": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h39qwaq/", "text": "YES omfg i feel like i shouldve done so much more \n\nbut also covid lowkey f'd that up so", "author": "chocopromise", "created": 1624841324, "upvotes": 1}, "h39odq3": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h39odq3/", "text": "Yup, me. I spent all my time my first three years chasing that white coat dream. I ate drank breathed slept premed. I studied hours constantly, checked all the boxes, and was just constantly go go go.\n\nI realized this summer that I never got to live in college and be that student.\n\nI took easy classes this semester and told myself I was gonna live like a human being. That means going on dates, hanging out with friends, taking care of myself, going out to eat, spending time playing video games, doing things that make me happy.\n\nLet’s make a pact to enjoy our last year!!", "author": "rain6304", "created": 1624839904, "upvotes": 5}, "h39lf3r": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h39lf3r/", "text": "Yes... the traditional answer to that is to go to grad school.", "author": "paulfromatlanta", "created": 1624838220, "upvotes": 1}, "h39jetx": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h39jetx/", "text": "I just finished my second year in college and yes i have this similar feeling as you do! Even learning wise I always ask myself if I’m doing enough reading and researching to expand my knowledge while I’m young and have energy and time. I have access to so many good resources now in college, what if I’m taking them for granted and will feel guilty after i graduate. Sometimes i get overwhelmed with these thoughts but i try to stay grounded and do my best in each given situation", "author": "Sozkamala", "created": 1624837085, "upvotes": 1}, "h39ixtv": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h39ixtv/", "text": "Honestly, don’t compare your experience to the glamorized life that the media portrayed of “college experience”. It’s a capitalist trap to make you spend more money and probably take out student loans.\nTo live your college life to the fullest is to do whatever you feel great. I am certainly qualified to be called boring, but I learned to appreciate my character development throughout each general education class. Especially after my humanity class. And I feel good enough seeing my account get bigger instead of getting plastered every weekend.", "author": "missingbunny11", "created": 1624836820, "upvotes": 5}, "h39htsv": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h39htsv/", "text": "I think the only thing worth regretting is not having spent enough time with the good friends. But then again, time around friends is rarely enough ever in any stage of life.", "author": "foobarnull", "created": 1624836182, "upvotes": 3}, "h39dk3h": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h39dk3h/", "text": "Yeah, but with covid and lockdowns it'd be kinda hard not to", "author": "SaintLucien", "created": 1624833808, "upvotes": 2}, "h39908p": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h39908p/", "text": "I’ve had to work 35 hours a week through my 3 years of college so far. It leaves me not having much time to do anything else but work and school so I do get depressed a lot. I can’t really say I regret not doing more bc I can’t control the situation I was born into but I do wish sometimes that I could be one of the normal college kids I see on campus who can do clubs and attend football games. I go to one of the top football schools in the country and don’t get to enjoy any of it. One of the things I looked forward to when leaving for college was finally being able to make friends only to have reality hit once I got to college. It is what it is at this point though I only have a year and never got to experience any of the college experience ppl talk about but it’s the hand some of us are dealt I guess. Long story short, I can relate", "author": "BallinLikeimKD", "created": 1624831392, "upvotes": 2}, "h397alu": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h397alu/", "text": "Me, but i only feel that way because i have nothing to put on my law school apps :’)", "author": "VanGoghsSeveredEar", "created": 1624830506, "upvotes": 1}, "h395xvp": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h395xvp/", "text": "I graduated a few months ago and definitely felt this in my last year (especially because of quarantine, but the years before, I never did much at all). My friends also express regret for not doing more.\n\nBut I'm realizing that college isn't really \"the only time I can do ______!\". Maybe joining clubs could be harder (but some still let in alumni), but you can still go to events, bars, parties, make friends/socialize, go on adventures, and date after you graduate! In a way, it could be more freeing since you won't have finals/midterms weighing on your shoulders.\n\nThe only thing really holding you back is you/your own judgement of yourself.", "author": "vipyun", "created": 1624829813, "upvotes": 9}, "h391tab": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h391tab/", "text": "I spent two  and a half years of it with a girl who ended up cheating on me. I wish I could get a redo", "author": "XxBlack2MasquexX", "created": 1624827747, "upvotes": 3}, "h38zhwl": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h38zhwl/", "text": "no. I just had sex.", "author": "doubt__first", "created": 1624826607, "upvotes": -1}, "h38xagx": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h38xagx/", "text": "I spent 4 years trying to get into my dream school, spent one glorious semester there and then covid happened and now im too old and too poor to go back. It sucks", "author": "umassjacob", "created": 1624825536, "upvotes": 4}, "h38ugh9": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h38ugh9/", "text": "I made the horrible mistake of working during school. When I finally quit, I plunged myself into everything my senior year, it was well worth it", "author": "dalej42", "created": 1624824132, "upvotes": 10}, "h38qx3a": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h38qx3a/", "text": "Start saying yes. You have your whole life, but if you feel like you're missing out now, make the changes you need to so you can enjoy your time. Remember you've likely spent a large portion of your college experience in a fucking pandemic, so you've got an excuse. Regardless, I want to echo everyone else, college is just the start and there's plenty of time to have fun.  \n\nIf you don't have the time/money to do what you want now, plan something for after graduation. And 100% take some time between undergrad and grad school (if you're doing that) to do something other than school. \n\nA lot of schools you can also participate in a study abroad after graduating, especially summer session. Look into that if you can't think of anything else.", "author": "coastalpillar", "created": 1624822403, "upvotes": 18}, "h38p55l": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h38p55l/", "text": "Yes", "author": "pilot_boy_syjal", "created": 1624821507, "upvotes": 1}, "h38lsui": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h38lsui/", "text": "100%. And I know it’s because I’m going to a community college and living at home to save money", "author": "ikedla", "created": 1624819831, "upvotes": 1}, "h38l9bz": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h38l9bz/", "text": "College is just a part of your life ahead", "author": "mononlabe", "created": 1624819562, "upvotes": 21}, "h38ilht": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h38ilht/", "text": "I'm entering year 6/6, the only regret I have is that I didn't take it seriously enough my first couple of years. However, I see what my choices allowed me to do and achieve and I wouldn't be where I am had I been the student I am now, back then.", "author": "Quarentus", "created": 1624818244, "upvotes": 13}, "h38cy7j": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h38cy7j/", "text": "No. I think there’s always room for what-ifs. The idea that college is the best years of your life is very scary to me and only true if you let it be. Don’t let anyone tell you things that limit your enjoyment of life (even though they don’t mean to). Do you feel like you didn’t do enough on a personal level or do you feel like you didn’t do enough based on society’s idea of what college is supposed to look like? \n\nRegardless, I don’t think you HAVE to have regrets. You can make opportunities even out of missed opportunities, yk? But since you still have one more year, it wouldn’t hurt to do more if you can and genuinely want to. It’s just unhealthy to feel like you’ll live a dull life of regret if you don’t. I’m going into my last year and I feel like what I’ve done so far is what I was able to handle.", "author": "strawberrysweetpea", "created": 1624815505, "upvotes": 24}, "h38c0ud": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h38c0ud/", "text": "Then say \"yes\" to more. But in reality, there is so much more to life than college. For example, after I graduate in December, I plan to take my KLR 650 down to Argentina from Alaska in a 1.5-year trip. Sure, the adventures in college are fun, and you need to continue doing things to keep your mind and body in a healthy state, but once you're free of this burden, you'll have much more time for a much more meaningful and fulfilling life. I took a couple of years off college to start my own business in 2017. It made some money, not enough; I shut the business down in 2018. After that, I backpacked in Asia for a few months and then came back to finish school. Those few life experiences just made me realize how boring college is, compared to what's out there, and what you're capable of without the massive weight of college on your shoulders. So don't regret it, live life, and do what you want to do. And constantly be pushing yourself to do new, uncomfortable things! Life is great. Enjoy the little time you have on this planet.", "author": "enclavedzn", "created": 1624815063, "upvotes": 82}, "h3852d0": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h3852d0/", "text": "I just graduated in May, but I definitely felt that way at the beginning of the year. I wasted too much time and energy on a relationship that made me miserable and left me without the motivation to hangout with friends while I was in it. The pandemic made me reevaluate a lot of how I spent my time and neglected friendships that I wanted to hold onto. It also eliminated a lot of the opportunities I had wanted to take advantage of. I spent senior year putting a lot more into those friendships and it paid off, and senior year was as fun as I could have hoped for.", "author": "obtrusivecheesewheel", "created": 1624811661, "upvotes": 25}, "h383k8t": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h383k8t/", "text": "honestly, i have been out of college for 15 years.  life does not end once you graduate college, it only begins.  all this \"college experience, you will never have this every again you life\" is bs.  \n\ndid i ever regret that i didn't  do something in college? yes, the only thing i regret is i stayed too long, i should have gone through college as soon as possible. \n\nlooking back, if i could change thing, i wish i could have graduated in 3 years and never look back.", "author": "ghostmode342", "created": 1624810905, "upvotes": 221}, "h380gsr": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h380gsr/", "text": "I've said yes too much and I've ended up alone doing everything. It's a difficult balance.", "author": "cabbage-soup", "created": 1624809331, "upvotes": 268}, "h37y8q0": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h37y8q0/", "text": "[removed]", "author": null, "created": 1624808191, "upvotes": 1}, "h37rqe2": {"link": "/r/college/comments/o8y8q3/anyone_else_entering_their_final_year_feeling/h37rqe2/", "text": "Get your friends together and start exploring, if that may be the town you're in or nearby towns/states. One time a friend said \"man I want chipotle, the nearest one is 1 hour away in a whole other state\" sure enough that afternoon we took a mini road trip there and we fell in love with that town and go back often to shop and explore", "author": "cinnyball", "created": 1624804775, "upvotes": 176}}}