{
  "sid": "qoicb0",
  "link": "/r/college/comments/qoicb0/is_it_normal_to_feel_this_way/",
  "title:": "Is it normal to feel this way?",
  "text": " I am at this point in the semester where my sanity is nearly broken. I am very burnt out, but also I am starting to feel like maybe the major that I have picked may not be for me. I do not feel good enough. Every week it just now seems that I am just existing under a roof trying to do work (I was extremely focused and disciplined at first) but my excitement to do things that are OUTSIDE of school makes me lose focus, and the lack of motivation just makes it even more difficult to even keep up. I am currently passing with As and B's but I just do not feel good enough. Every week seems like a blur. At this point, anything other than having to do classes, worry about exams, quizzes and labs makes me really happy.",
  "author": "kurazawa-",
  "created": 1636264381,
  "updated": 1636655786,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "hjn9cic": {
      "link": "/r/college/comments/qoicb0/is_it_normal_to_feel_this_way/hjn9cic/",
      "text": "It happens alot depending on your major.\n\nSome majors even have running jokes that if someone is not in class they are probably dead.\n\nIt's sad to be honest",
      "author": "Impressive-Name5129",
      "created": 1636265369,
      "upvotes": 1,
      "replies": {}
    },
    "hjnedlt": {
      "link": "/r/college/comments/qoicb0/is_it_normal_to_feel_this_way/hjnedlt/",
      "text": "Very normal unfortunately",
      "author": "Zyrobe",
      "created": 1636269804,
      "upvotes": 1,
      "replies": {}
    },
    "hjnjbqd": {
      "link": "/r/college/comments/qoicb0/is_it_normal_to_feel_this_way/hjnjbqd/",
      "text": "Sounds like a case of 'Fall Semester Blues' :)\n\nDepending on where you attend (and assuming you're American)  you may not get a break from school until Thanksgiving (that's how it is for me). Maybe don't make any big decisions about your major at the moment, I mean unless you're *really* sure, just wait until winter break. \n\nIt's easy to not feel good enough in college. Shit, sometimes it seems like academia is designed to make us feel bad about ourselves. \n\nIf it makes you feel any better, I've been to class like two times in the last three weeks. Still learning, still passing, still stressing, but man, I just cannot get out of bed before 11am!",
      "author": "stupid-for-eternity",
      "created": 1636274646,
      "upvotes": 1,
      "replies": {}
    }
  }
}