{"sid": "ph9k52", "link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/", "title:": "College professors don't have nearly as much ego as high school teachers", "text": "Just an observation I had. I dont know if other people also feel this but college professors actually talk and sound like normal human beings. Some of my high school teachers and even middle school teachers were the most stuck up, obnoxious, egoistic people you would ever meet always pushing this weird superiority complex over students. Like its not even just plain \"strict\" its this kinda unpleasant demeanor that just repelled everyone away from them.\n\nCollege professors talk normal. If you ask them a question, the genuinely respond with interest and care. I guess this varies but I've learned from 7 professors/lecturers now", "author": "ProfessionalEngine50", "created": 1630689367, "retrieved": 1632802718, "over_18": false, "upvotes": 648, "upvote_ratio": 0.98, "comments": {"hbmfhvo": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbmfhvo/", "text": "Yep, high school teachers were worse than my college professors. In high school, a girl in my class had a brother who had a medical emergency one night. She was the only one home that day so she had to drive her brother to the hospital. Plus, as the only one in her family who spoke English, she had to be on standby at the hospital to translate for the doctors. She got home around early morning and just had time to sleep a few hours before heading to school. Obviously, she didn’t have time to do any of the homework. \n\nWhen she went to class, she told the teacher in private that she hadn’t been able to complete her assignment from the night before but could turn it in after lunch. The teacher looked at her and asked why she couldn’t take the assignment with her to the hospital. She gave her a zero on the assignment and told her that her brother had nothing to do with her class.", "author": "SleepyxDormouse", "created": 1630795721, "upvotes": 1}, "hbkl00i": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbkl00i/", "text": "You just have to take more classes.  You’ll find the professors who are obnoxious.   Out of probably 30 people who were teaching in college 5 stand out as huge assholes. In high school it was about the same amount/percent.   (I went to highly rated public high school and college.  So that’s a factor)", "author": "CozmicOwl16", "created": 1630765424, "upvotes": 1}, "hbkg8k8": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbkg8k8/", "text": "This comes from the hiring process and it happens in every industry. People tend to hire people who are like them, the people elect the school board who hires the superintendent who hires the principal who hires the teachers. So if you have a city or town who is more traditional then you will have teachers like this whereas in other places teachers will be more chill. Same with colleges, I'll bet there are some colleges where the professors are much more strict, but usually colleges have a much bigger pool of candidates to hire from who come from a variety of backgrounds.", "author": "whathaveyoudoneson", "created": 1630763097, "upvotes": 1}, "hbkd6o7": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbkd6o7/", "text": "Until you accidentally call them Professor instead of Dr.", "author": "Aura1661", "created": 1630761493, "upvotes": 2}, "hbjqqm2": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbjqqm2/", "text": "I've had the exact opposite be true for me. I've had plenty college professors brag about the research, projects, and work they've done in their field and be condescending to students that ask for help to. College professors are typically going to have achieved more in the academic realm and they develop an ego because of it, at least with the ones I've had.", "author": "TheMias24", "created": 1630744320, "upvotes": 1}, "hbjkwjk": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbjkwjk/", "text": "Very true. Some exceptions in business school though. The profs who taught on Wall Street think they're God's gift to mankind. They are blissfully unaware of their privilege.", "author": "Nomadic_author", "created": 1630739284, "upvotes": 2}, "hbji8l4": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbji8l4/", "text": "I think it's a difference in the students rather than the teachers/lecturers. At school, the students HAVE TO be in class. Some will be good students, but the majority don't care for the class and don't care for learning in general. That attitude shifts at uni where everyone is there because they WANT to be there. \n\nLecturers know that when they're speaking with students, they're speaking with people genuinely interested in the subject. \n\nAlso, uni tries to promote an egalitarian culture that isn't rigidly bound up in informal hierarchy (don't get me wrong, there's a LOT of formal hierarchy, but informally it's egalitarian).", "author": "Sea_Programmer3258", "created": 1630737116, "upvotes": 3}, "hbjaqjl": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbjaqjl/", "text": "Surprisingly I've had some college professors talk condescendingly simply because the class subject was advanced or hard.", "author": "National_Pen", "created": 1630731669, "upvotes": 2}, "hbj6wfg": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbj6wfg/", "text": "i think it is because high school teachers have more power over their students seeing how they are forced to go to school up until  a certain age. Meanwhile University professors do not force student to do anything. The University has already collected their tuition from students so if they waste their time and do nothing it doesn't matter. Professors will not hound you to do your assignments and pressure you to do better. They are an asset and resource for your education and if you chose to not take advantage , they have not bat an eye lash.", "author": "StevieBlancs", "created": 1630729221, "upvotes": 3}, "hbj1sth": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbj1sth/", "text": "I agree. The teachers at my high school were stuck-up and full of shit. They were always unwilling to help out unlike professors. I had teacher say “I dont expect anyone in this class to get an A on this essay.”", "author": "18dwhyte", "created": 1630726196, "upvotes": 3}, "hbj0f4u": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbj0f4u/", "text": "Depends on the professor. Some are wise cracking answers and they are like, check section 5.7, I’m like 🤔 I don’t get it, and they are just condescending after that.\n\nSome professors are know it all people.", "author": "jameskishtok", "created": 1630725415, "upvotes": 1}, "hbj0c0e": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbj0c0e/", "text": "No, youre just a young adult now, bro. In High School and Middle School, you had \"13 going on 30\" syndrome. You thought you were grow up, and your teaches knew that you weren't, they knew you were just stuck up, obnoxious, and egoistic like all teenagers. So they treated you like children, and it fucks with your head. But now, youre seen as an adult, and your professors treat you like one.\n\nIf Middle school and High school teachers behaved like College professors, most kids wouldn't make it past 9th grade. There is a different structure because there are different expectations.", "author": "Lost_vob", "created": 1630725366, "upvotes": 1}, "hbiznap": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbiznap/", "text": "Community college professors are always a 50/50 of either petty full of themselves or the laid back respectful", "author": "addipix", "created": 1630724980, "upvotes": 3}, "hbixd5u": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbixd5u/", "text": "Yeah, I agree. Most of my teachers have had a superiority complex. So far this year I only have one teacher who treats the students as human beings. She doesn’t act different, isn’t fake, and that’s great.", "author": "Kingz-Ghostt", "created": 1630723738, "upvotes": 1}, "hbivv7g": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbivv7g/", "text": "eh, i've had the opposite experience", "author": "grownrespect", "created": 1630722934, "upvotes": 1}, "hbivlrz": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbivlrz/", "text": "Maybe some definitely, but I would definitely say in my case a majority of the teachers care more about the title then high school teachers who I would just chill with after class and felt like a cool aunt/uncle", "author": "Puzzleheaded-Gap-604", "created": 1630722794, "upvotes": 2}, "hbiu7h6": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbiu7h6/", "text": "Nah, complete opposite for me. Every professor at my college expects to be treated like a deity. High school was way more relaxed.", "author": "somethingfromnoth1ng", "created": 1630722051, "upvotes": 3}, "hbipznr": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbipznr/", "text": "My only answer to that is that we clearly didn't go to the same high schools and colleges", "author": "ericgol7", "created": 1630719862, "upvotes": 8}, "hbio26n": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbio26n/", "text": "it's because high school/middle school/elementary school teachers not only have to deal with snobby kids but their parents as well. They're also super under payed and don't have nearly as many resources as college professors. Also college students already know what they're getting into, they signed up for it.", "author": "rollllllllll_", "created": 1630718852, "upvotes": 11}, "hbijuqi": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbijuqi/", "text": "All teachers are hot garbage", "author": "Karam2468", "created": 1630716694, "upvotes": -5}, "hbihi3t": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbihi3t/", "text": "I'd love to have an experience where college professors are like you described them. I think it really depends on the country and the educational system. In my experience, the college professors are so full of their ego and they act like they never made a freaking mistake in their lives. They are always unavailable, don't respond to emails, late for class and they don't even apologize. They are not treating us as humans, but expect from us to have the highest opinion and respect for them. I started college highly motivated and unfortunately I am finishing it highly demotivated and disappointed because of them.", "author": "worried-vanilla", "created": 1630715509, "upvotes": 6}, "hbihewt": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbihewt/", "text": "I mean I’ve had my fair share of egotistical profs. I took intro microeconomics with a guy that wrote his own textbook, so he thought he was hot shit. In reality, his textbook couldn’t explain the most basic concepts of the course and our class ended up using Khan academy and other resources to pass.", "author": "Cannapsilo", "created": 1630715465, "upvotes": 31}, "hbigsgv": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbigsgv/", "text": "I feel like professors are more so \"we're basically peers, but I'm still your teacher\". A lot of the ones I've had wanted to be called by their first names, were super honest with us, and overall relaxed. Of course, it's still college, you still have to do your stuff, but it feels easier to ask for help when they don't act like they're better than you. Freshman year, I did an essay on the Lana del Rey twitter community (the assignment is difficult to explain) and when I went to see my professor during office hours, he read my rough draft and related to what I was talking about in my essay while also helping me. He was so easy to go to for comments because he was more human and relaxed than any teacher I had in high school.", "author": "gwumpyyguts", "created": 1630715144, "upvotes": 12}, "hbiccl4": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbiccl4/", "text": "[deleted]", "author": null, "created": 1630712869, "upvotes": 4}, "hbhz2ss": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbhz2ss/", "text": "I thought it was because of the lack of freedom public school teachers had. They had a more strict curriculum and instruction method to adhere to, couldn’t swear, had to set strict boundaries to set the hierarchy, etc. it’s not their fault. You go back and meet your high school teachers years later after you’ve graduated and they’ll seem so cool, they’ve suppressed a side to them in order to teach you properly. Chill teachers were cool, but more likely than not students felt like they could goof off with them.", "author": "fullofregrets2009", "created": 1630706391, "upvotes": 122}, "hbgzb0u": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbgzb0u/", "text": "Probably because k-12 teachers are overworked + they have to deal with children who think they are different or smarter because they have google", "author": "youareaweirdo___", "created": 1630690524, "upvotes": 57}, "hbgxies": {"link": "/r/college/comments/ph9k52/college_professors_dont_have_nearly_as_much_ego/hbgxies/", "text": "yea bc highschool you’re a kid; college you’re not", "author": "jdamaniac", "created": 1630689772, "upvotes": 278}}}