{
  "sid": "qkigrk",
  "link": "/r/college/comments/qkigrk/i_want_to_quit/",
  "title:": "I want to quit",
  "text": "I started school in 2016 but quit in 2018 due to my abusive spouse thinking I had too much freedom (now divorced so yay). I did well in college and got good grades.\n\nI decided to return to school (different from the one I attended originally) last September and changed my degree course from a simple AA to Medical Assisting.\n\nI’m bombing a lot. And will probably fail this quarter as well and I’m already reinstated because I’ve done so poor. Everything is online due to covid and I think that is a major part of the issue I am having. I do not learn well this way, the canvas set up is very confusing. For Law and Ethics I have a difficult time not only finding the assignments but also figuring out how to deal with a dying laptop. While the school offers rental computers, I don’t have access because I do not have a car, and live rural nowhere near a bus system. \n\nGetting textbooks was a pain in the butt and I spent $200 just for one book because the one I originally ordered wasn’t  going to be here fast enough. Now I have two of the same copy ugh.\n\nI do not learn well in a remote environment but there are not options for campus classes right now and I’m disheartened and know they will prevent me from enrolling in winter due to grades. It’s not that I don’t undertsand the material, I understand just fine, I’m just struggling having to do it entirely online. It’s not my learning style. \n\nI just feel like I’m drowning and about to tell my consueler that I will quit until campus reopens. I’m just not getting the support I need that I would in a in person environment. Maybe just quit forever but what kind of example am I setting for the kids then?",
  "author": "lovmi2byz",
  "created": 1635786185,
  "updated": 1635890849,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {}
}