{
  "sid": "qa6s49",
  "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/",
  "title:": "Why do I do this to myself please help me I don’t know who to talk to about this.",
  "text": "I am failing all of my classes by not turning in a shit ton of assignments and projects, why do I hate myself?\n\nI seriously can’t figure out why I willingly am hurting myself it’s like my mind secretly hates me and wants me to fail it’s not that I’d own understand the material I just simply haven’t turned Jack squat in. I have no good excuse, no job, no relationship, no taking care of family, no sport, like literally no excuse I just waste time all day. I don’t even know who to talk to about it I want to just come out sobbing to my parents or advisors or professors  about the hole I dug myself in but because I have no excuse I feel everyone will call me an idiot (which I am). This is just kind of a rant because I deserve to be humiliated and don’t deserve the privilege of college that’s all fucking hate myself.",
  "author": "FMFProductions",
  "created": 1634501868,
  "updated": 1636193231,
  "over_18": false,
  "upvotes": 82,
  "upvote_ratio": 0.97,
  "comments": {
    "hh19cpb": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh19cpb/",
      "text": "Reach out to your school's psychology department. They helped me out a lot pre-COVID.",
      "author": "FezAndWand",
      "created": 1634506717,
      "upvotes": 32,
      "replies": {}
    },
    "hh1fdpn": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh1fdpn/",
      "text": "Sounds like you're not motivated",
      "author": "unholymanserpent",
      "created": 1634509414,
      "upvotes": 19,
      "replies": {
        "hh1fu5t": {
          "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh1fu5t/",
          "text": "That’s correct but I have no other ideas on what to do with life and I don’t want to work a shitty job because I was to lazy to stick it through college so idk I just hate this part of life honestly",
          "author": "FMFProductions",
          "created": 1634509627,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "hh1egvn": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh1egvn/",
      "text": "Could it be that you have lost all interest in your major?",
      "author": "Ericklovesfuitgummy",
      "created": 1634508999,
      "upvotes": 13,
      "replies": {
        "hh1fmcw": {
          "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh1fmcw/",
          "text": "I don’t have an interest I’m in a community college program where I get my associate degree for free as my old high school paid for them. I honestly I have no interest in any job title which sucks",
          "author": "FMFProductions",
          "created": 1634509526,
          "upvotes": 13,
          "replies": {
            "hh284q5": {
              "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh284q5/",
              "text": "Are you me? My high school did the same damn thing. I do have a part time job but god damn our \"situations\" are eerily alike. This is disgustingly privileged of me but sometimes I wish I had to pay for CC so I would be motivated to do the assignments.",
              "author": "takoyakicult",
              "created": 1634523512,
              "upvotes": 7,
              "replies": {
                "hh2cnhr": {
                  "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh2cnhr/",
                  "text": "Me too",
                  "author": "FMFProductions",
                  "created": 1634525861,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh2gjcu": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh2gjcu/",
      "text": "Omg this is me! I have no motivation to do anything. It’s not that I can’t or that I don’t want to get the work done it’s just that I don’t do it. I have no idea why and there is no reason behind it, I just don’t do the work. I totally feel you. Dm if you want to chat\n\nAlso my advice to you would be to not feel obligated to go to college. I understand your thinking behind college. It is true that college could help to get a better job, but there are also so many other ways to get there. \n\nI would recommend you find some hobbies do some research see what you like and what jobs correlate to that. There are so many jobs out there where all you need is like a one year training program and you can have a starting salary that a four year or two year college grad would have.",
      "author": "layne26",
      "created": 1634527968,
      "upvotes": 10,
      "replies": {}
    },
    "hh1jk6d": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh1jk6d/",
      "text": "commenting because I am in the SAME boat right now. DM if you wanna talk. would love to talk to someone who can relate",
      "author": "Minute_Future_3458",
      "created": 1634511367,
      "upvotes": 9,
      "replies": {}
    },
    "hh3pkuf": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh3pkuf/",
      "text": "It sounds like maybe you don’t really want to be in college. Maybe it is because you don’t know what you want to do maybe it is because as you indicated in the comments your old high school is paying for your community college associate degree. No matter what the reason until you decide for yourself that you want to be there, things won’t change. Maybe look at Union trades, they pay you while your in training you get paid a living wage that increases steadily until you journey out and then you get raises based on the collective bargaining of your union representatives during contract renegotiation. There are lots of options depending on what you think you might like, Carpenter, Piledriver, Millwright, Plumber, Electrician, if you want to drive big equipment join the Operators, don’t know what to do join the laborers union and get exposed to a little of everything. \n\nCollege is not the only option for good pay and in the trades there is lots of room to make really good money especially if you join one of the unions. Maybe you really like it and stay there for the rest of your life maybe it is the break you need to figure out what you really want to do all while making enough money to fully support yourself. It is at least something to consider. I hope things get better for you.",
      "author": "rainbow-switch",
      "created": 1634561509,
      "upvotes": 4,
      "replies": {}
    },
    "hh4a70y": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh4a70y/",
      "text": "This was me in middle school. This was me in high school. This was me in college. It turned out that I have ADHD. If you've had these symptoms since you were a child (forgetfulness, laziness, messy) it's time to do some research and see a doctor. Medication and treatment saved my life. This post resonated with me so much.\n\nNot trying to be an armchair therapist, and obligatory self-diagnosis can be dangerous, but sometimes it's NOT a \"lack of motivation\" or \"you're just not trying hard enough\" or \"just use some folders dude\". It's an extremely misunderstood disorder (it's not little kids bouncing off walls and squirrels) and I really think you should look into it.",
      "author": "looiie",
      "created": 1634571157,
      "upvotes": 4,
      "replies": {}
    },
    "hh2mf8i": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh2mf8i/",
      "text": "Nobody wants to do any of that, but if you want the end goal you have to. Do you really want what’s at the end of your college career? Talk to a counselor at your school to get help with getting things started and to find what motivates you.",
      "author": "green_mojo",
      "created": 1634531305,
      "upvotes": 3,
      "replies": {}
    },
    "hh3yxvt": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh3yxvt/",
      "text": "Sounds like depression to me. I would honestly suggest letting your professors know you’re having a tough time, and visiting your University Counselling/Wellness Center. I struggle with the same thing. Having a diagnosis for my depression/anxiety/ADHD helps cause then I can go to the Disability office and get accommodations like flexible attendance and due dates. Until you figure all that out, please be kind to yourself. It’s not easy. But you’re not alone and help is around the corner :)",
      "author": "NextTradition6216",
      "created": 1634566224,
      "upvotes": 3,
      "replies": {}
    },
    "hh54icf": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh54icf/",
      "text": "Similar thing happened to me, didn’t even have a major picked out and couldn’t pass specific classes even though I WAS trying I felt like I wasn’t trying hard enough. Because of the stress of it I avoided some of the work bc the stress made me so anxious I’d start to cry and get upset for no reason. And because of that same anxiety I never reached out to anyone besides my close family",
      "author": "Honenie",
      "created": 1634583661,
      "upvotes": 3,
      "replies": {}
    },
    "hh3k9y6": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh3k9y6/",
      "text": "It happens. Email your professors, if it’s too late they will tell you. You will probably just be put on acedemic probation for next year, if you’ve used up a couple of these then go to a therapist and try to figure out what’s wrong and register your diagnosis.",
      "author": "alwaysrising3",
      "created": 1634558365,
      "upvotes": 2,
      "replies": {}
    },
    "hh79lkn": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh79lkn/",
      "text": "I am also quickly losing motivation for this paid high school DLC",
      "author": "Erosion139",
      "created": 1634622015,
      "upvotes": 2,
      "replies": {}
    },
    "hh4088r": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh4088r/",
      "text": "You probably aren’t ready to be in college. Withdraw from your classes and maybe take a few years off to work and find yourself. When you are ready for college you will actually be excited to turn in projects and assignments. This is coming from a 33 year old college student that had to drop out originally in my early twenties",
      "author": "AssignmentGloomy8922",
      "created": 1634566821,
      "upvotes": 1,
      "replies": {}
    },
    "hh4hl9n": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh4hl9n/",
      "text": "jesus i thought i was the only one been feeling like this for a WHILE now it does suck :(",
      "author": "No-Cause8939",
      "created": 1634574255,
      "upvotes": 1,
      "replies": {}
    },
    "hh4xeif": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh4xeif/",
      "text": "See a doctor and ask to get your blood checked for anything that could be leading to depression. Than request to be seen by a therapist or psychiatrist.",
      "author": "Quarterlifecrisis267",
      "created": 1634580741,
      "upvotes": 1,
      "replies": {}
    },
    "hh97q4c": {
      "link": "/r/CollegeRant/comments/qa6s49/why_do_i_do_this_to_myself_please_help_me_i_dont/hh97q4c/",
      "text": "Hey, I used to be in a similar position back in my first year of college. \nIt might be worth taking it easy if you’re able to. After a poor first semester, I moved to taking 2 classes a semester, and it was much more manageable that way.",
      "author": "DancingDinos",
      "created": 1634664136,
      "upvotes": 1,
      "replies": {}
    }
  }
}