{
  "sid": "mgtetw",
  "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/",
  "title:": "I got a 98.89% in a class and the instructor gave me a 3.8 decimal grade",
  "text": "I am very upset. Has anyone ever needed to appeal a grade?",
  "author": "jendominates",
  "created": 1617148711,
  "over_18": false,
  "upvotes": 86,
  "upvote_ratio": 0.95,
  "comments": {
    "gte1gp8": {
      "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gte1gp8/",
      "text": "Which class is this",
      "author": null,
      "created": 1617573492,
      "upvotes": 2,
      "replies": {
        "gtekybb": {
          "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gtekybb/",
          "text": "Electronics",
          "author": "jendominates",
          "created": 1617584340,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gsvm0eu": {
      "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsvm0eu/",
      "text": "Also is the canvas gradebook correct? Sometimes teachers do t program it correctly and your grade could be higher or lower than what it is. \nIf that's not it then hopefully it was just a mistake and the professor can fix it.",
      "author": "elocinkrob",
      "created": 1617161530,
      "upvotes": 4,
      "replies": {}
    },
    "gsv4ka7": {
      "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsv4ka7/",
      "text": "Yea. What I did was check the extra credit assignments first. Most of the times profs accidentally make the extra credit x/10. If it says x/10 or another number, that means the extra credit is being registered in the system as if it was a mandatory assignment to your grade. Talk to your prof to remove the /10 or out of whatever number and only add the number of points that are extra. When I contacted my prof about this, she changed it for me and my grade increased. I hope I am making sense.",
      "author": "Oro-Lavanda",
      "created": 1617151690,
      "upvotes": 35,
      "replies": {
        "gsv74au": {
          "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsv74au/",
          "text": "That is nice you were able to get that resolved! My problem is actually that Canvas does reflect that my grade is 98.89%, but my instructor submitted my grade as 3.8 for my transcript. \nAt my school a 90% is a 3.5, a 92% is a 3.7, 94% is a 3.9, etc. To get a 4.0 you need to have gotten at least a 95% in the class, which I did. :(",
          "author": "jendominates",
          "created": 1617153093,
          "upvotes": 29,
          "replies": {
            "gsv8zpu": {
              "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsv8zpu/",
              "text": "It sounds like your professor may have made a mistake. You should reach out to them and ask.",
              "author": "Drell-Yan",
              "created": 1617154103,
              "upvotes": 20,
              "replies": {
                "gsvkw7x": {
                  "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsvkw7x/",
                  "text": "Yes, I have reached out to my instructor and am waiting on a response. I have jumped to the conclusion that they think I deserve a 3.8 and I do not deserve a 4.0, and me asking them about it is going to be interpreted as causing trouble. (I have a lot of anxiety in general. I hope they are understanding and work with me to resolve this.)",
                  "author": "jendominates",
                  "created": 1617160838,
                  "upvotes": 13,
                  "replies": {
                    "gsvsnp8": {
                      "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsvsnp8/",
                      "text": "You're not causing trouble. You paid for the class and earned the grade. Don't be afraid to call your professor out for a mistake that they made. Stop hoping and get the problem fixed. Be an adult about it. You're in college, no use being scared. Hope they change it.",
                      "author": "georgecostanzaduh",
                      "created": 1617165963,
                      "upvotes": -1,
                      "replies": {
                        "gsvv1yr": {
                          "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsvv1yr/",
                          "text": "The first thing I did today was email my instructor. If he doesn’t respond or help, I do plan to make an appointment with the dean next week. I am an adult. I have an anxiety disorder. My previous comment was me sharing that I worry he doesn’t like me or want me to get a good grade... but I know that may not be true. But another part of me worries it is true and I will burn bridges (I want to work for the company he works for) and that maybe it would then be a better idea to just take the 3.8. But I want to stand up for myself and what Is fair.",
                          "author": "jendominates",
                          "created": 1617167789,
                          "upvotes": 7,
                          "replies": {
                            "gsvwusi": {
                              "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsvwusi/",
                              "text": "Sounds to me like you’ve got everything under  control! There’s nothing wrong with seeking information from people who have dealt with the same thing before. People on Reddit love to tell other people to grow up lol",
                              "author": "KrombopulousMary",
                              "created": 1617169267,
                              "upvotes": 9,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gsvasy3": {
              "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsvasy3/",
              "text": "Talk to your professor and if not reach out to a department chair. That is obviously a mistake",
              "author": "Oro-Lavanda",
              "created": 1617155086,
              "upvotes": 7,
              "replies": {}
            },
            "gsvigxx": {
              "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsvigxx/",
              "text": "At my current school in south Florida our system is like that. Which I think is soooo dumb. I was just used to an A, being a 90+. At UNCC, it was like that. So when I transferred to south Florida, I was all happy I had at least gotten 90s in my classes thinking I had my 4.0, to then be hurt when the final grades had posted",
              "author": "ikoapile",
              "created": 1617159397,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gsx8d1a": {
          "link": "/r/CollegeRant/comments/mgtetw/i_got_a_9889_in_a_class_and_the_instructor_gave/gsx8d1a/",
          "text": "In most systems we have to assign a point value to create an assignment, even if it is extra credit. What they have to do is set it so that it is not a category that is a component of the grade average. They also can click the box that says not to include it in the grade calculation.",
          "author": "CurioserandCurioser0",
          "created": 1617203845,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634062059
}