{
  "sid": "lnzf0r",
  "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/",
  "title:": "a proctored exam rant",
  "text": "i took a proctored exam on thursday for a class required for my major. when reading the syllabus prior to class starting, i noticed how extreme(?) the rules were for the exams. here they are stated in the syllabus (brief):\n- webcam/mic required\n- show photo id\n- thorough environment check, 360° view, must show workspace\n- must always have both hands on face during entirety of exam, exception would be moving one hand to select an answer or scroll\n\ni received an email today saying i made a 0 on the exam because i didn’t follow the rules above. the only thing i can think of that i didn’t follow directly was that i didn’t always have both hands on my face during the exam. i kept my right hand on my mouse for most of it because i wasn’t thinking of putting it to my face in the middle of scrolling. i have to meet with the professor on zoom to discuss why they gave me a 0. it feels invasive to me that they actually watch the videos of us taking the exam. i wasn’t flagged; they watch ALL of the videos of the students taking the exam. this has been bothering me, and i’m thinking of dropping the course after the meeting and taking it with a different professor next semester where it will most likely be in-person by then. i’m upset that i was given a 0 instead of just having points taken off, and it makes me nervous about the rest of the semester.\n\nTLDR; failed a proctored exam because i didn’t “follow the directions” after professor watched my recorded video",
  "author": null,
  "created": 1613796189,
  "over_18": false,
  "upvotes": 134,
  "upvote_ratio": 0.98,
  "comments": {
    "gob5j2n": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/gob5j2n/",
      "text": "both hands on the face?? never heard of a more retarded rule. your prof is an ass, sorry that happened man :/",
      "author": "Puzzleheaded_Can_750",
      "created": 1613970564,
      "upvotes": 2,
      "replies": {}
    },
    "go7bn01": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go7bn01/",
      "text": "Hi! Get your advisor involved ASAP and ask them to be present when you meet with the professor. Your advisors job is to not only set up course plans but to also be the voice and protector of the students in these types of situations!!",
      "author": "HoBoJo_0",
      "created": 1613889126,
      "upvotes": 4,
      "replies": {}
    },
    "go5cokr": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go5cokr/",
      "text": "Drop the class. It's still relatively early in the semester, so this bullshit is definitely just the tip of the iceberg.",
      "author": "wholesomecommie",
      "created": 1613849148,
      "upvotes": 2,
      "replies": {}
    },
    "go4gk65": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go4gk65/",
      "text": "That is bullshit!!",
      "author": "JetmanNY",
      "created": 1613832788,
      "upvotes": 2,
      "replies": {}
    },
    "go4er0o": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go4er0o/",
      "text": "I don't understand the hands on face rule. It sounds super stupid. I'd fight it.\n\nI'm about to take a proctored exam that's not this strict and it's both open note and open book. Just have to record it, mic and webcam on, and use notes/book. Probably the most reasonable proctored exam I'll ever take.",
      "author": "SweetTeaBags",
      "created": 1613831727,
      "upvotes": 2,
      "replies": {}
    },
    "go3zrxh": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3zrxh/",
      "text": "I think proctored test is most of the time inability of an instructor to make a good exam.",
      "author": "PraneelPranjal",
      "created": 1613820203,
      "upvotes": 8,
      "replies": {}
    },
    "go3u5as": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3u5as/",
      "text": "Your score on the exam should be your score.",
      "author": "inadarkwoodwandering",
      "created": 1613814535,
      "upvotes": 5,
      "replies": {}
    },
    "go3me0q": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3me0q/",
      "text": "Both hands on your face the whole time?? My acne prone ass would’ve stormed straight to the deans office. Seriously, wtf??",
      "author": "yuxngdogmom",
      "created": 1613807166,
      "upvotes": 49,
      "replies": {
        "go3moth": {
          "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3moth/",
          "text": "i actually have a pimple forming on my left cheek now. don’t know if there’s a correlation, but it’s too much of a coincidence lmao",
          "author": null,
          "created": 1613807438,
          "upvotes": 20,
          "replies": {}
        }
      }
    },
    "go3kec2": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3kec2/",
      "text": "[deleted]",
      "author": null,
      "created": 1613805444,
      "upvotes": 28,
      "replies": {
        "go3l6uq": {
          "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3l6uq/",
          "text": "that’s definitely the extreme part. it didn’t cross my mind to put both hands on my face in between scrolling and selecting answers, and like you said, it’s easy to not remember doing that. it’s upsetting my grade changed to a 0 because of that. i did a desk scan, and since they watch all the proctored videos, they would know i had a clear workspace and no way to cheat, nor did i ever look away from the screen.",
          "author": null,
          "created": 1613806115,
          "upvotes": 13,
          "replies": {
            "go3vki8": {
              "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3vki8/",
              "text": "I've never heard of that hands rule either. That's literally just your professor being WAY too paranoid. Plus in the middle of a pandemic and even flu season in general where you're really not supposed to be touching your face since it can allow germs to get into your system, it's literally dangerous. If you're gonna get a 0 for accidentally NOT touching your face even when they can see that the room and desk space is clear, then fuck that. Drop now while you can still get a decent refund for the class. Then use that money to pay to take the class in the summer with a well rated teacher instead",
              "author": "vness1213",
              "created": 1613815933,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "go3gc6d": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3gc6d/",
      "text": "yeah, i get the whole proctored shit but thats just outrageous. I would drop if I were you.",
      "author": "matsudasociety",
      "created": 1613802166,
      "upvotes": 35,
      "replies": {}
    },
    "go3g0pf": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3g0pf/",
      "text": "Both hands on your face is ridiculous, that’s way too extra. I’ve see other instances where everything else would be okay but it’s not like your pupils are moving away or your arm is moving constantly. That’s some BS I’d take it to the Dean or something",
      "author": "litfur",
      "created": 1613801923,
      "upvotes": 90,
      "replies": {
        "go3gg8v": {
          "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3gg8v/",
          "text": "the both hands on face is really the only rule i have an issue with besides the fact that they watch the videos. even with a thorough room and desk scan, they would’ve seen that i had no materials to even cheat with",
          "author": null,
          "created": 1613802254,
          "upvotes": 32,
          "replies": {}
        }
      }
    },
    "go3bm1x": {
      "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3bm1x/",
      "text": "Drop the class. Having to provide a photo I’d just to take a test is f*cked up",
      "author": "Cmtr2113",
      "created": 1613798810,
      "upvotes": 25,
      "replies": {
        "go3dgwm": {
          "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3dgwm/",
          "text": "Not really. They see your name on the roster and check (by looking at ID photo and name) that the person taking the exam is who they say they are. The other rules are whack but that one makes sense",
          "author": "SnapdragonPBlack",
          "created": 1613800064,
          "upvotes": 22,
          "replies": {
            "go3vrw1": {
              "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3vrw1/",
              "text": "Yeah, I had to provide a photo ID for some exams in person. Normally large lecture classes",
              "author": "Emotional-Shirt7901",
              "created": 1613816141,
              "upvotes": 7,
              "replies": {}
            },
            "go3di38": {
              "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3di38/",
              "text": "Oh ok",
              "author": "Cmtr2113",
              "created": 1613800087,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "go3efzj": {
          "link": "/r/CollegeRant/comments/lnzf0r/a_proctored_exam_rant/go3efzj/",
          "text": "yeah, photo id is for verifying that i’m the person taking the exam.",
          "author": null,
          "created": 1613800758,
          "upvotes": 8,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634062053
}