{
  "sid": "nzbpqp",
  "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/",
  "title:": "I wish professors wouldn’t cram a million assignments at the end of a semester",
  "text": "I’m doing a summer course and I accidentally signed up for 2 6-week summer courses, both science based with labs. I can only blame myself for that and while I’m in my last week, my grades are actually pretty good. However, my professors decided that during the last week we should have: three exams, all over 4+ chapters, 3 labs, two lab reports and a homework assignment that’s over 20 questions. \n\nI’m very unsure as to why they think this is a good idea and then have the nerve to email students saying that we’re behind? Uh, yeah! It’s a six week course! I spend anywhere between 4-8 hours on my computer a day (including weekends) to stay caught up on top of my job and they somehow think this makes sense???\n\nEdit: correction. We have 4 LABS due this week and 3 LAB REPORTS",
  "author": "WhyY_196",
  "created": 1623635391,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.91,
  "comments": {
    "h1tkwtm": {
      "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/h1tkwtm/",
      "text": "Are the assignments available from the beginning of the course?",
      "author": "PhDapper",
      "created": 1623738179,
      "upvotes": 1,
      "replies": {
        "h1tys2s": {
          "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/h1tys2s/",
          "text": "No. They’re times release",
          "author": "WhyY_196",
          "created": 1623751248,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h1swqxw": {
      "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/h1swqxw/",
      "text": "Is this in the US?",
      "author": null,
      "created": 1623722684,
      "upvotes": 1,
      "replies": {
        "h1swwv0": {
          "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/h1swwv0/",
          "text": "Yeah",
          "author": "WhyY_196",
          "created": 1623722767,
          "upvotes": 1,
          "replies": {
            "h1sx7ac": {
              "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/h1sx7ac/",
              "text": "I’m starting to wonder if this happens at colleges in other countries or if this is specific to the American education system. They just seem to want to overload us. It’s like they’re trying to get us to fail or something…",
              "author": null,
              "created": 1623722916,
              "upvotes": 1,
              "replies": {
                "h1sxb08": {
                  "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/h1sxb08/",
                  "text": "Like I get it since this was a 6 week course. You gotta get it in somehow.  But maybe plan it so that a bunch isn’t dumped right at the end?",
                  "author": "WhyY_196",
                  "created": 1623722971,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h1p190j": {
      "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/h1p190j/",
      "text": ">  I spend anywhere between 4-8 hours on my computer a day (including weekends) to stay caught up on top of my job and they somehow think this makes sense???\n\nI'm not sure what you expect to happen when you're taking two condensed summer courses and working. Yes, it'll be a lot of work, because you need to pack it into a shortened time frame. And yes, it'll be compacted more near the end, because that's the way assessments work; you can't have cumulative assessments before you teach the material. \n\n4-8 hours of homework a day is perfectly reasonable for 2 summer courses. In a typical undergraduate course, you're expected to spend 2 - 3 hours of time studying and working on assignments for each hour of class; a usual semester that's spread out a lot more, but that'd be in the ballpark of 125 - 175 hours per course. \n\nSummer courses aren't any less rigorous than courses in the usual semester, they're just condensed. You're going to be spending the same amount of total time, it'll just not be spread out as much. \n\nMoral of the story: don't take two 6 week courses at the same time as working.",
      "author": "BarackTrudeau",
      "created": 1623642664,
      "upvotes": 22,
      "replies": {
        "h1p29c6": {
          "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/h1p29c6/",
          "text": "I really feel like the only reason you commented was to be condescending and if so, find something else to do.",
          "author": "WhyY_196",
          "created": 1623643353,
          "upvotes": -8,
          "replies": {
            "h1p3v5c": {
              "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/h1p3v5c/",
              "text": "I really feel like the only reason you posted was to whinge about things that are direct and easily foreseeable consequences of choices that you made, and if so, find something else to do.",
              "author": "BarackTrudeau",
              "created": 1623644482,
              "upvotes": 16,
              "replies": {
                "h1p3yf1": {
                  "link": "/r/CollegeRant/comments/nzbpqp/i_wish_professors_wouldnt_cram_a_million/h1p3yf1/",
                  "text": "It’s almost like the subreddit is called r/collegerant or something. You want to talk down to people like toddlers and then get mad when they call you out on it. If you want to come pay my bills and do my coursework be my guest but don’t be a rude twat about something I can’t exactly stop doing (working) and having a weirdly planned out course.",
                  "author": "WhyY_196",
                  "created": 1623644546,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634063287
}