{
  "sid": "p8mimk",
  "link": "/r/CollegeRant/comments/p8mimk/help/",
  "title:": "help?",
  "text": "well i’m in my third year of studying pharmacy (they are six) and i think i don’t like it anymore . i don’t know if the career actually doesn’t appeal to me anymore or is it due of the pandemic i don’t like it anymore right i have lost the motivation (since march 2020 i’ve been having virtual lessons). has something like this happened to you?",
  "author": "paulettelr",
  "created": 1629527322,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "h9wv50t": {
      "link": "/r/CollegeRant/comments/p8mimk/help/h9wv50t/",
      "text": "So this can be pretty common with majors and when students do accelerated PharmD or BS/MD programs this is always my biggest fear. Have you observed pharmacists working, do you enjoy the aspect of observing and the day to day job of a pharmacist? You need to figure out if you are burnt out from school in general, online classes are making you lose motivation, or you no longer have a love for pharmacy. I’d recommend talking to people in the field and taking some time for your mental health to relax and minimize burnout. Are classes online this year?",
      "author": "Concerned-23",
      "created": 1629642523,
      "upvotes": 1,
      "replies": {}
    },
    "h9rgko8": {
      "link": "/r/CollegeRant/comments/p8mimk/help/h9rgko8/",
      "text": "I’m personally going through that a bit myself. I’ve yet to actually take classes in person relating to my major, so I’m giving it a shot. With how much school costs though, I’m definitely on the side of pursuing your other interests if it doesn’t seem to click as well when you’re in person experiencing it everyday again. If it’s getting bad in school, it’s likely not going to be all that long into your career that you’re feeling the same and then you’re stuck. There’s lots of people who change majors and there’s nothing wrong with it at all. You want to make sure you’re doing what you want in life. That’s why I’m a bit caught up myself, but I’m giving it a legit shot again with things going back to normal before making any switch.",
      "author": "XxNHLxX",
      "created": 1629528347,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634062122
}