{
  "sid": "n6af3h",
  "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/",
  "title:": "Professor assigning an unreasonable amount of work. Is there anything I can do?",
  "text": " Before you say \"stop complaining\", let me give some context. The professor I am talking about is very very old. The reason I say this is because every test we take is riddled with typos, to the point where on some questions you can't tell what is the right or wrong answer. It is hell week, and she has assigned 3 essays, 4,000 words each, due the 1st day of finals week, which is Monday. I am in 4 other classes, work full time, and my wife is about to have our first baby any day now. I am a very hard working student, straight A's in all of my classes except this one. I am going to put in my best effort to complete them all, but I just can't see how I can do it. Sure maybe I am just complaining, but to me with the 4 others classes, full time work, and a baby it is difficult. I realize I brought this upon myself so maybe this is more of a rant than anything else. I'm worried that if I talk to the professor it will just piss her off and she will grade me even harder. Any advice? \n\n&#x200B;\n\nEDIT/UPDATE: Well it was not easy nor fun but I did it. Honestly pretty fucking proud of myself for it. Might not be A quality but I did it!!\n\nTL:DR: Professor assigning large work load while she makes mistakes on assignments and quizes",
  "author": "hardcorechim",
  "created": 1620316270,
  "over_18": false,
  "upvotes": 54,
  "upvote_ratio": 0.95,
  "comments": {
    "gxcgysu": {
      "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gxcgysu/",
      "text": "Maybe check out policies at your school; mine has a policy that profs are not allowed to have major assignments/exams the week before finals.  Could be worth a shot.\n\nCongrats on the baybeh!",
      "author": "ThereIsNo14thStreet",
      "created": 1620440496,
      "upvotes": 2,
      "replies": {}
    },
    "gx91fwr": {
      "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx91fwr/",
      "text": "What the actual hell. Why is no one saying congrats? This man is having a baby. Congrats on the baby. I hope everything goes well. \n\nAs for the professor, try explaining your situation. Might be more lenient given that you’re literally expecting a baby. In almost every case, that’s a valid excuse unless the professor is heartless. \n\nIf the professor doesn’t care, you have options. Even though you brought this on yourself, if you can’t physically accomplish the work in the timeframe because you literally lack the time to do it, you can prioritize better. I.e Going from full time to part time. This way, you can dedicate more time to school. If you have monetary issues where this would be a problem, this probably won’t work. \n\nI will say though 4000 line essays due multiple times a week on top of finals is not cool. I get that the class has rigorous work but, it’s flirting on a tight rope of being a literal ass for no reason.",
      "author": "majoroofboys",
      "created": 1620374822,
      "upvotes": 2,
      "replies": {
        "gx9eoba": {
          "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx9eoba/",
          "text": "Thank you so much! It’s a fine line between doing this too myself and too much work. I’ve been able to balance full time work and school for the past 2-3 years with no issues until just now which is frustrating. Sometimes I think I have too much pride because I’ve never had to ask a teacher for an extension, especially on a final.",
          "author": "hardcorechim",
          "created": 1620386486,
          "upvotes": 1,
          "replies": {}
        },
        "gx9qqh1": {
          "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx9qqh1/",
          "text": "He could also decide not to do full-time classes and do part-time classes to reduce his workload. He still will be required to take 6 credits, but that will give him more time to complete what courses he does have. But I do agree assigning a couple of 4000-word essays the week before finals is not good for the professor. He should be letting you study for the final, not burdening you with more work.",
          "author": "crstlgls",
          "created": 1620393631,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gx8scm8": {
      "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx8scm8/",
      "text": "I’ve talked about this before so I feel your pain. I believe that there should be some type of “cap” that limits the amount of work teachers are able to assign (within reason of course). Similar to the way there is a minimum that they are required to teach. Some professors out there (and ONLY SOME) seem to do things out of spite and not as a teaching tool",
      "author": "lch_xo",
      "created": 1620367026,
      "upvotes": 2,
      "replies": {
        "gx9eduv": {
          "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx9eduv/",
          "text": "It wouldn’t be that bad if it was due at the end of the week like but the first day of finals week…?",
          "author": "hardcorechim",
          "created": 1620386283,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gx8nuoq": {
      "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx8nuoq/",
      "text": "Not talking to the professor about your predicament will only make it worse. Most professors are lenient if you talk to them about circumstances setting you back. \n\n&#x200B;\n\nIf you don't feel like talking to the professor, you can do two things: hire a professional writing service to write the essays on your behalf to decrease the workload; or calculate the lowest grade you need on each paper and aim for that score rather than perfection.",
      "author": "YagyuKyube1",
      "created": 1620363637,
      "upvotes": 1,
      "replies": {
        "gx9eb0g": {
          "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx9eb0g/",
          "text": "Where can I find a service like that? Feel free to DM me if necessary!",
          "author": "hardcorechim",
          "created": 1620386226,
          "upvotes": 0,
          "replies": {
            "gx9uybi": {
              "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx9uybi/",
              "text": "I have yet to use a professional writing service but I know they exist. A quick online search can show a bunch of results. I suggest comparing a couple of websites to find the one best for you. Make sure they write original papers, are plagiarism-free, proper format, etc.\n\nHere are a couple links to help start out the search.\n\nCriteria for Writing Service: [criteria-selecting-reliable-custom-essay-writing-service/](https://essaymin.com/blog/criteria-selecting-reliable-custom-essay-writing-service/)\n\nReview of different writing services: [https://www.bestessaytips.com/review\\_essay.php](https://www.bestessaytips.com/review_essay.php)\n\nCouple of Writing Services that look legitimate (verify them yourself):\n\n\\-[https://smartwritingservice.com](https://smartwritingservice.com)\n\n\\-[https://www.customwritings.com](https://www.customwritings.com)\n\n\\-[https://www.advancedwriters.com](https://www.advancedwriters.com)\n\n&#x200B;\n\nHope this helps. Best of luck.\n\n&#x200B;\n\nEdit: I almost forgot to mention this. After you get your paper, make sure to include some of your own writing (or rewrite the writing to make it sound like your writing) if your professor is familiar with your writing characteristics.",
              "author": "YagyuKyube1",
              "created": 1620395677,
              "upvotes": 0,
              "replies": {
                "gxa7fp6": {
                  "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gxa7fp6/",
                  "text": "Thanks so much!",
                  "author": "hardcorechim",
                  "created": 1620401164,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gxfgeja": {
              "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gxfgeja/",
              "text": "Do you want to get expelled for an academic integrity violation? Because this is how you get expelled for an academic integrity violation.",
              "author": "BarackTrudeau",
              "created": 1620509115,
              "upvotes": 0,
              "replies": {
                "gxflze0": {
                  "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gxflze0/",
                  "text": "Don’t worry it was too expensive",
                  "author": "hardcorechim",
                  "created": 1620512008,
                  "upvotes": 1,
                  "replies": {
                    "gxjcoch": {
                      "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gxjcoch/",
                      "text": "Even if it's not expensive, don't ever go for an essay writing service. Passing off someone else's work as your own is not only unethical, but also a huge risk for getting yourself in academic trouble.\n\nYou've got this, man. Four thousand words assigned just last week sounds absolutely rediculous, but you've got this!",
                      "author": "TheKimbler1",
                      "created": 1620594069,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gx7s90m": {
      "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx7s90m/",
      "text": "Turn in mediocre assignments that allow you to pass the class. I mean, you don't want to have to take class again",
      "author": "unholymanserpent",
      "created": 1620346054,
      "upvotes": 6,
      "replies": {
        "gx7xgkj": {
          "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx7xgkj/",
          "text": "Exactly what I’m thinking. I’ll do my best but that might look like settling for some C’s which I’m fine with at this point",
          "author": "hardcorechim",
          "created": 1620348724,
          "upvotes": 3,
          "replies": {
            "gx7yv0f": {
              "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx7yv0f/",
              "text": "You gotta do what you gotta do!",
              "author": "unholymanserpent",
              "created": 1620349444,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gx7mkmt": {
      "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx7mkmt/",
      "text": "[deleted]",
      "author": null,
      "created": 1620343176,
      "upvotes": 3,
      "replies": {
        "gx7n8n3": {
          "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx7n8n3/",
          "text": "There’s some kid out there who doesn’t work full time that could easily do this lol",
          "author": "hardcorechim",
          "created": 1620343505,
          "upvotes": 3,
          "replies": {
            "gx7nyz6": {
              "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx7nyz6/",
              "text": "[deleted]",
              "author": null,
              "created": 1620343870,
              "upvotes": 5,
              "replies": {
                "gx7xczh": {
                  "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx7xczh/",
                  "text": "No I agree I brought it upon myself. I was able to balance everything perfectly before this course. I’ve been taking 5 classes a semester for the past few years and could manage. But this one class is ruining it for me lol",
                  "author": "hardcorechim",
                  "created": 1620348674,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gx5whd7": {
      "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx5whd7/",
      "text": "I understand the typos and stuff, that would be annoying as hell & maybe you should talk to someone like a department chair or something. It’s unprofessional in my honest opinion for a prof to have so many typos that tests are hard to distinguish. On the terms of 4,000 word papers, when were these assigned? If they were just assigned like last week, then yeah I completely understand you’re annoyance with it. If she assigned it earlier in the semester, then that’s on you to not have it done. I understand you on how this semester is incredibly difficult, and congrats on your soon to be kiddo!\n\nedit: accidentally said 4K pages instead of words 🤦🏻‍♀️",
      "author": "shippythehippy",
      "created": 1620316800,
      "upvotes": 19,
      "replies": {
        "gx5y0yr": {
          "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx5y0yr/",
          "text": "Thank you! yup they were assigned last week, and the way she sets her due dates are completely backwards from any other class I have taken. In the other classes every thing is due on the sunday before the new week starts, but her assignments are due end of day on the monday that the week starts. Assigning the final due on the monday the finals week starts is unfair in my opinion\n\nedit: typo...like my professor!",
          "author": "hardcorechim",
          "created": 1620317452,
          "upvotes": 16,
          "replies": {
            "gx61f4q": {
              "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx61f4q/",
              "text": "Oh damn, then yeah fuck that. I was about to say, like I’m a history major & master procrastinator, so I have written probably 20k words this week so far & probably have another 15k or so to write and if it was over the semester I’d understand that but only like a week before??? What class is this for? That’s nuts",
              "author": "shippythehippy",
              "created": 1620318884,
              "upvotes": 13,
              "replies": {
                "gx627kr": {
                  "link": "/r/CollegeRant/comments/n6af3h/professor_assigning_an_unreasonable_amount_of/gx627kr/",
                  "text": "I'm also a history major with a religion minor and it is a religion class. I don't think I would do this but just in case I have done the math and I would still pass without doing any of it. Thats not my attitude or character because I work hard for my grades but it is completely nuts. Im at the \"fuck it\" point as well, but I know I need to at least try.",
                  "author": "hardcorechim",
                  "created": 1620319218,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634062754
}