{
  "sid": "quk1n4",
  "link": "/r/CollegeRant/comments/quk1n4/first_tike_skipping_i_feel_horrible_a_vent/",
  "title:": "First Tike Skipping & I Feel Horrible (A Vent)",
  "text": "Literally 19 minutes ago was my first time ever in my entire college career that I have skipped a class for any reason. Sickness, family emergencies, my own depression and among many other things have never been a justifiable enough reason for me to skip my class personally (though, I don’t hold anyone else to these standards). \n\nThis is my junior year and the first day where I skipped because my burnout is the worst it’s ever been. Between 3 jobs, 19 credits, honors research preparation and graduate school preparation, I am stretched thin. Beyond thin! I woke up late for my Research Methods lecture today and his attendance policy is quite frankly, and pardon my language, fucking stupid. The professor deducts 5% for arriving late even by a single minute. However, attendance is not mandatory. It’s better to skip than to receive a deduction to my grade for being late this one time. I don’t know about anyone else but going from an A to an A- because I came in a few minutes late isn’t appealing to me at all?? \n\nEven so, even with this rational, I can’t help but feel like a piece of shit for skipping. I still haven’t found the energy to roll out of bed. My stomachache pain is probably the worst it has been in a very long time and I’m fighting the urge to cry and have a panic attack. I already asked an acquaintance of mine in the class to send me their notes afterwards and it’s easy to just read the textbook but god do I feel like the worst student in existence.\n\nTLDR: Skipped class for the first time and now I feel like a piece of shit. Anyone have any advice so I don’t spiral further into my depression?",
  "author": "chaosions",
  "created": 1636993137,
  "updated": 1637182196,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hkqj6ft": {
      "link": "/r/CollegeRant/comments/quk1n4/first_tike_skipping_i_feel_horrible_a_vent/hkqj6ft/",
      "text": "I give you a ton of credit! I skipped way too often throughout college and felt pretty bad about myself for it most times. That said, I think the best way to not wallow is to decide that you’re going to use the class time doing *some* sort of homework or chore or errand, no matter how easy that task is.",
      "author": "tfhaenodreirst",
      "created": 1636994361,
      "upvotes": 7,
      "replies": {}
    },
    "hkqxfw0": {
      "link": "/r/CollegeRant/comments/quk1n4/first_tike_skipping_i_feel_horrible_a_vent/hkqxfw0/",
      "text": "I call it a “tactical skip” when I skip for a valid reason. 8 AM class, that I’m confident in, the day I have an exam in the afternoon? I tactically skip it (really I’m just sleeping in but ya know…)",
      "author": "ZeldLan",
      "created": 1637000009,
      "upvotes": 5,
      "replies": {}
    },
    "hkr60jc": {
      "link": "/r/CollegeRant/comments/quk1n4/first_tike_skipping_i_feel_horrible_a_vent/hkr60jc/",
      "text": "It's okay to skip one class but it can almost get addicting. I used to have a good attendance record for showing up to classes everyday my first year, but like you I got burned out one day and I decided to skip cuz I knew my class was just a lecture talking about what was in the textbook. Then I started skipping a few more times cuz I knew that I could whenever I was just feeling a little bit stressed. Yes take a break but you gotta get back and stay engaged.",
      "author": "FMG_99",
      "created": 1637003391,
      "upvotes": 3,
      "replies": {
        "hkremw6": {
          "link": "/r/CollegeRant/comments/quk1n4/first_tike_skipping_i_feel_horrible_a_vent/hkremw6/",
          "text": "I’ll be back in that class on Wednesday but it really was the attendance policy that put the final nail in the coffin of me not attending.",
          "author": "chaosions",
          "created": 1637006794,
          "upvotes": 2,
          "replies": {}
        },
        "hksxlfh": {
          "link": "/r/CollegeRant/comments/quk1n4/first_tike_skipping_i_feel_horrible_a_vent/hksxlfh/",
          "text": "I haven't skipped but got in the bad habit of not actually listening to the lectures and doing other things during class.",
          "author": "emmmaleighme",
          "created": 1637029928,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}