{
  "sid": "qvbqft",
  "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/",
  "title:": "Did the transition from remote to back to in-person hit anyone else like a truck or is it just me?",
  "text": "Like we all know the jump from in-person to remote was horrendous, especially if you were unlucky enough to be in college during the brunt of it in Spring 2020\n\nBut idk, somehow going back to in-person seems worse.\n\nI was a freshman in Fall 2020 and I finished my first two semesters with a 3.9\n\nI'm now a sophomore in Fall 2021 after already having to drop one class, I'm fighting to just barely pass my remaining three classes\n\nThere are other factors of course, but somehow online classes seemed a bit nicer if that's a good word? Better taught, more materials provided to review, better modules for going for coursework and reviewing, etc.",
  "author": "sunnirays",
  "created": 1637080345,
  "updated": 1637182169,
  "over_18": false,
  "upvotes": 141,
  "upvote_ratio": 0.99,
  "comments": {
    "hkvyq3z": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkvyq3z/",
      "text": "The first exams absolutely murdered my grades and I've been trying to catch up ever since.",
      "author": "delebojr",
      "created": 1637089206,
      "upvotes": 36,
      "replies": {}
    },
    "hkw2kih": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkw2kih/",
      "text": "I'm doing a lot better in-person versus online. The courses I'm taking are not optimal for learning through a screen",
      "author": "Puzzleheaded_Can_750",
      "created": 1637090731,
      "upvotes": 16,
      "replies": {
        "hky3tc6": {
          "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hky3tc6/",
          "text": "I'm also doing better in person because it forces me to actually concentrate (I get distracted easily at home). Though I did like saving money in gas.",
          "author": "LostButterflyUtau",
          "created": 1637121875,
          "upvotes": 6,
          "replies": {
            "hkzeito": {
              "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkzeito/",
              "text": "idk why i seem to get distracted even in in-person classes :/ ig the problem is in me lol",
              "author": "Ok_Ad_9716",
              "created": 1637154406,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hkx4yi2": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkx4yi2/",
      "text": "I agree this has been my toughest semester. Similar to your situation had a 3.9 GPA for freshman yr but now with this semester has been really hard. I also dropped a class but my profs sucked & im still struggling. You aren’t alone.",
      "author": "arinspeaks",
      "created": 1637106267,
      "upvotes": 11,
      "replies": {}
    },
    "hkxv1zm": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkxv1zm/",
      "text": "It made me realize how pointless going to class is, and how useful having recorded lectures are.",
      "author": "Jay_Babs",
      "created": 1637117751,
      "upvotes": 11,
      "replies": {
        "hkysb46": {
          "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkysb46/",
          "text": "I agree. It is way better to have recorded lectures. If you miss something in class you have to ask your peers or the professor again. Having the recorded lectures you can replay it many times till you understand it. \n\nAlso, students maybe have their homes far away from college. It is such a waste of time and energy to wake up early take the train or bus to college. Once you arrive there you'll probably feel tired to listen to your professor.",
          "author": "Katrexa",
          "created": 1637137789,
          "upvotes": 5,
          "replies": {
            "hkzjpz3": {
              "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkzjpz3/",
              "text": "You’re supposed to make connections with your profs tho! When you ask questions they learn your name and you can then rely on them for letters of rec and what not in the future",
              "author": "No-Economy-666",
              "created": 1637157156,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkxdewv": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkxdewv/",
      "text": "I've said it before: It's almost as if the pandemic exposed the rapacious oligarchy in which we're all living and it has crushed everyone's spirits 🤷‍♂️",
      "author": "big__cheddar",
      "created": 1637109975,
      "upvotes": 15,
      "replies": {}
    },
    "hkxorhn": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkxorhn/",
      "text": "I go in person for the first time in a long time next semester (and at a new college!!) and I'm gonna puke I'm so nervous. Not ready at all.",
      "author": "LenoraNoble",
      "created": 1637114975,
      "upvotes": 5,
      "replies": {}
    },
    "hkw88xd": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkw88xd/",
      "text": "For me it made me super bored because we still have a ton of restrictions: everything closes early we can’t have guests and we don’t have lounges, so I’m almost always stuck in my room watching TV by myself. That might change next semester but OMG the boredom is killing me! \n\nI thought the transition going back was gonna be hard so I took 12 credits instead of 15: and all my professors this semester happen to be the “I’m gonna talk at you for 80 minutes” type.",
      "author": "CapriciousSalmon",
      "created": 1637092981,
      "upvotes": 6,
      "replies": {
        "hkysi8m": {
          "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkysi8m/",
          "text": "Where do you live?",
          "author": "Katrexa",
          "created": 1637137955,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hkyndam": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkyndam/",
      "text": "yessss i totally agree!!!!! i thought i was the only one!!!",
      "author": "Manufacturer-Scared",
      "created": 1637133869,
      "upvotes": 3,
      "replies": {}
    },
    "hl01gkt": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hl01gkt/",
      "text": "Senior here, after being in person for almost two years the switch to zoom sucked. And I eventually switched to asynchronous classes where I could work at my own pace and save more money.\n\nAt the start of this year I was super excited to be back in person for my final year. Only to find that I wasn't quite ready for it... actually having to get up and walk to class instead of rolling over in bed to grab my laptop was brutal. And then came the exams. I got so used to using my notes when I couldn't figure an answer out. I basically forgot how to study when it came time for exams.\n\nAnd then there is the lack of motivation, coupled with depression, I just didn't want to do anything. No school work, skip classes, sleep. There's been plenty of times this semester where I just want to say fuck it and leave school. But I am so close to graduating and to just throw it all away with only a few months remaining? No thanks, I'd rather keep my head down, be miserable, and push through these last few months. No matter how difficult it can be.",
      "author": "thatkilliankid",
      "created": 1637164887,
      "upvotes": 3,
      "replies": {}
    },
    "hkyorao": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkyorao/",
      "text": "Yes! For some reason the transition back into in-person learning has been really jarring. I think for me a lot of it has to do with learning to be around people again after so long isolating (my family is all high risk for covid), and doing that plus classes has just been a lot for me",
      "author": "smores024",
      "created": 1637134949,
      "upvotes": 2,
      "replies": {}
    },
    "hkz5tcv": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkz5tcv/",
      "text": "Luckily for me 4/5 of my classes are still completely online so I’m quite happy with it. I’m now realizing I prefer online so I can work and do an internship at the same time and not feel like I’m imploding on myself. I wish universities had more online class options in general",
      "author": "morfoodie",
      "created": 1637148941,
      "upvotes": 1,
      "replies": {}
    },
    "hkzjgbq": {
      "link": "/r/CollegeRant/comments/qvbqft/did_the_transition_from_remote_to_back_to/hkzjgbq/",
      "text": "Stop the cap. In person is wayyyyy better",
      "author": "No-Economy-666",
      "created": 1637157025,
      "upvotes": 1,
      "replies": {}
    }
  }
}