{
  "sid": "rf3w0f",
  "link": "/r/CollegeRant/comments/rf3w0f/writing_for_classes_you_dont_care_much_about_is/",
  "title:": "writing for classes you dont care much about is so painful omg",
  "text": "so my \"final\" for one of my elective classes was turned into an essay instead of an exam. while the class is kind of interesting i never had the motivation to write long, super detailed & analytical pieces for assignments and just barely met word requirements for discussion posts & writing assignments. this essay is due tuesday and i can barely get out more than 2 sentences at a time 😭 the rubric says we have a maximum of 3000 words, no minimum, and i'm tempted to just turn in whatever i can churn out even if it ends up being less than 1000 words but at the same time i'm kind of scared of doing that cause i don't want to end up with a bad grade that's going to tank my average. i have a 95 in this class rn and i need it to not drop cause I need as many A's as possible. I also have to give more attention to studying for an exam that's also on tuesday in a class where I have a B thats extremely close to turning into a C. i just want this essay to write itself 😔",
  "author": "RainbowChocolate_",
  "created": 1639359706,
  "updated": 1639517865,
  "over_18": false,
  "upvotes": 48,
  "upvote_ratio": 0.98,
  "comments": {
    "hobvs9u": {
      "link": "/r/CollegeRant/comments/rf3w0f/writing_for_classes_you_dont_care_much_about_is/hobvs9u/",
      "text": "Felt that so much that I wrote mine kinda last minute (it was due last Thurs) and ended up missing the 11:59pm deadline bc my computer started acting up and I couldn’t find my doc😭 \n\nWent thru all 5 stages of grief, now I’m awaiting my A to drop to a C 😁",
      "author": "matrixg04",
      "created": 1639362799,
      "upvotes": 9,
      "replies": {}
    },
    "hobzh4t": {
      "link": "/r/CollegeRant/comments/rf3w0f/writing_for_classes_you_dont_care_much_about_is/hobzh4t/",
      "text": "I almost hate writing when I care about it more - trying to fit it to the rubric, meeting a word count, getting it graded, etc - tends to wring the soul and joy out of the thing, which is more painful",
      "author": "spacewalk__",
      "created": 1639364474,
      "upvotes": 5,
      "replies": {}
    },
    "hoe9skz": {
      "link": "/r/CollegeRant/comments/rf3w0f/writing_for_classes_you_dont_care_much_about_is/hoe9skz/",
      "text": "This is how I feel any time I have to do a paper about myself in any capacity 😭 I can write all day about basically any academic topic, but when it’s a personal experience or what I’m “passionate about” I can’t churn out any more than a paragraph an hour.",
      "author": "ucantstopdonkelly",
      "created": 1639413510,
      "upvotes": 1,
      "replies": {}
    },
    "hoesgo5": {
      "link": "/r/CollegeRant/comments/rf3w0f/writing_for_classes_you_dont_care_much_about_is/hoesgo5/",
      "text": "I feel you, but the best thing to do if you actually care about your grade is set a timer for 90 minutes, write as much as you can in that 90 minutes. Even if it's garbage, just words on the page that relate even tangentially to the prompt. Then, the next day, edit what you wrote for 90 minutes. At the end, you will have a good enough essay to turn in and it'll only be 3 hours total of your life. The drip method of 2 or 3 sentences here and there takes longer and has worse results",
      "author": "cmichael39",
      "created": 1639420886,
      "upvotes": 1,
      "replies": {}
    }
  }
}