{
  "sid": "qyicuk",
  "link": "/r/CollegeRant/comments/qyicuk/advice_on_what_i_can_do_if_anything_to_get_group/",
  "title:": "Advice on what I can do (if anything) to get group to urgently catch up on project?",
  "text": "Hi, I'm a senior in college and I have a semester long group project worth 50% of our class grade. For context, this is a business class and the project deals with kickstarter business concepts. \n\nFor the first half of the semester everything seemed fine relatively. We did piece by piece through mid-October when we turned in part of our final project early (think of it as a rough draft). We were informed that we had failed to include about 1/2 of what we were supposed to have. \n\nSo we actually were quite behind on our project and we've struggled to catch up because everyone has really busy lives including myself -- which I understand that. I've set up a calendar with recommended due dates to get stuff done, along with the firm due dates for the final submission at the end of the semester. But we're falling behind even on that. \n\nWe're about to go on Thanksgiving break so nothing is going to get done between Wednesday and Sunday, realistically cause everyone will have plans. We then have a week to get everything done before we present our business plan, and a few days after that to submit the final plan document. \n\nI'm getting stressed about it. Again I know that everyone has social lives, jobs, other projects, etc. So do I. But I feel like there should be a more urgent feeling of needing to get stuff done so we're not cramming it all at the final moments. I want to be understanding and considerate but admittedly I'm frustrated and wish we were fully caught up. It's not like I can do everything myself. \n\nI doubt there's anything I can do to prevent the last minute cramming of rushed work, but for something worth 50% of our grade, due so soon, I feel like we should try to avoid that! Like sometimes we have to make sacrifices in other areas of our life for a bit to get the urgent stuff dealt with, right? \n\nIdk.",
  "author": "dJhammond",
  "created": 1637453165,
  "updated": 1637689670,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlgodi5": {
      "link": "/r/CollegeRant/comments/qyicuk/advice_on_what_i_can_do_if_anything_to_get_group/hlgodi5/",
      "text": "Thanksgiving break is not an excuse. If you guys are way behind you have to use the break to work on everything and get the work done. Have to do whatever it takes to make sure you pass",
      "author": "Harajuku_Aj",
      "created": 1637462568,
      "upvotes": 5,
      "replies": {}
    },
    "hlglwc7": {
      "link": "/r/CollegeRant/comments/qyicuk/advice_on_what_i_can_do_if_anything_to_get_group/hlglwc7/",
      "text": "Have you said any of this to your group members? Sometimes, people just need to know that someone on the team isn’t taking their crap. Start spamming them if you have to.",
      "author": "PhDapper",
      "created": 1637461307,
      "upvotes": 1,
      "replies": {}
    }
  }
}