{
  "sid": "r62g88",
  "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/",
  "title:": "I'm starting to realize how much I hate my major",
  "text": "I'm CompSci and a sophomore finishing out my third semester in college. It was easily my worst performed and most miserable and along with a lot of other contributing factors, the first semester where I was truly out of gen eds and in full swing in the main course work\n\nAnd college is obviously no joke no matter which specific school you end up in, but engineering is especially torturous. Lots of complex subjects taught by professors who make things even more complicated and if you're lucky, you get a section taught by a Prof who doesn't mind curving everything into oblivion so even if you learn absolutely nothing, you'll still not fail\n\nI've spent more time googling how to scrape by things on my own then actually learning in the classroom and most lectures have mandatory attendance so you'll fail if you miss more than a few things without something from the short list of valid explanations (with proof!)\n\nI mostly chose this field because of all the promises of job security and high wages straight from graduating with a bachelor's, but honestly, I'm not sure if it's worth it in exchange for this constant strain I've had my mental health\n\nThese classes haven't failed to make me feel the stupidest I've felt in a long time and the thought of continuing down this path for 2-3 more years than the rest of my life feels me with so much dread on top the anxiety and clinical depression I already deal with. It genuinely feels like if I stay here, it will almost guarantee my chances of ending up in psych ward. Maybe not this semester or even next semester, but definitely at some point.\n\nI'm thinking about changing it to something else in a different field but it just stuff just won't pay decently without having to spend more time in college then grad school which definitely wouldn't be cheap\n\nI'm going to talk to someone at career services before the end of this week so I'll have time to adjust my schedule if I do manage to narrow down what I want, but I'm honestly just feeling so lost because of all this. I know it's still fairly early on and it's better to realize in Fall as a sophomore than a junior, or God forbid, spring as a senior but it still really sucks",
  "author": "sunnirays",
  "created": 1638320552,
  "updated": 1638480987,
  "over_18": false,
  "upvotes": 117,
  "upvote_ratio": 0.98,
  "comments": {
    "hmqthdd": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmqthdd/",
      "text": "at my job i dont use what I learnt at my computer science degree tbh",
      "author": "allgone6996",
      "created": 1638325242,
      "upvotes": 36,
      "replies": {
        "hmr9qk9": {
          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmr9qk9/",
          "text": "Wat did u graduate with",
          "author": "NoAd5564",
          "created": 1638332835,
          "upvotes": -1,
          "replies": {
            "hmr9t56": {
              "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmr9t56/",
              "text": "Computer Science",
              "author": "allgone6996",
              "created": 1638332872,
              "upvotes": 22,
              "replies": {}
            }
          }
        },
        "hmr9uwo": {
          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmr9uwo/",
          "text": "I meant wat was ur gpa",
          "author": "NoAd5564",
          "created": 1638332897,
          "upvotes": -4,
          "replies": {
            "hmr9x3c": {
              "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmr9x3c/",
              "text": "3.54",
              "author": "allgone6996",
              "created": 1638332928,
              "upvotes": 5,
              "replies": {
                "hmrbnl2": {
                  "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmrbnl2/",
                  "text": "Damn ur good",
                  "author": "NoAd5564",
                  "created": 1638333818,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmrlzjd": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmrlzjd/",
      "text": "CompSci teachers don't actually teach they introduce a concept then tell you they want to teach you to \"think for yourself\". For compsci realistically you're gonna be doing a lot of googling and mostly self learning.",
      "author": "DizzyMajor5",
      "created": 1638339739,
      "upvotes": 29,
      "replies": {}
    },
    "hmqzk5m": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmqzk5m/",
      "text": "Change majors! Most people don’t go into work that directly relates to their field honestly! The classes you’ve taken now will still help you down the road. I’m about to finish college and I really wish I went down a different path, so I may be biased but I think you should do something that feels a bit better than your major right now",
      "author": "guacamolecamel",
      "created": 1638327957,
      "upvotes": 20,
      "replies": {
        "hmr5bma": {
          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmr5bma/",
          "text": "You would change your major if you could? If you were a freshman again, what would you have chosen instead?",
          "author": "Cu4urthoughts",
          "created": 1638330660,
          "upvotes": 1,
          "replies": {
            "hmr8k4q": {
              "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmr8k4q/",
              "text": "I’m a politics major right now but I only did that bc I thought film school wasn’t practical. If could do it again id apply for my schools screenwriting program, or at least do that as a minor. Maybe I wouldn’t do my legal studies minor bc it’s basically the same as politics. If I did a second minor id pick something different",
              "author": "guacamolecamel",
              "created": 1638332246,
              "upvotes": 4,
              "replies": {
                "hmsg399": {
                  "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmsg399/",
                  "text": "Wow those are two very different fields! Film school sounds cool.",
                  "author": "Cu4urthoughts",
                  "created": 1638362843,
                  "upvotes": 2,
                  "replies": {
                    "hmsgzq2": {
                      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmsgzq2/",
                      "text": "I think it does! People say there are reasons not to go to film school but honestly it just sounds fun. Most of my friends at school are in the film programs. I’ll have to at least take a screenwriting class I think",
                      "author": "guacamolecamel",
                      "created": 1638363366,
                      "upvotes": 2,
                      "replies": {
                        "hmtira5": {
                          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmtira5/",
                          "text": "People in the film industry aren’t going anywhere. Movies and tv shows especially are here to stay 😆",
                          "author": "Cu4urthoughts",
                          "created": 1638380050,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmu4tyw": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmu4tyw/",
      "text": "Trust me, I get it. It’s not fun to fail classes you are trying really hard in. The material is overwhelming. As someone who switched their major from electrical engineering to something easier, I regret it. Once you graduate and try to find a job and quickly realize that there are few jobs out there that pay well, and if there are, you’re probably not going to get them due to lack of experience or not having the technical degree. \n\nBefore switching majors, do this if you can: slow down. I’ve met below average students who graduated with an engineering degree or comp sci and it took them all well over 5 years to graduate. So instead of thinking about switching majors, think about if you’d rather get an easier degree in a short time with little job prospects or a worthwhile degree that pays well but might take you an extra year (or two)? As someone who is in a crappy job right now, take the latter.\n\nSlow down if you can. Depending on tuition, living situation, scholarships, etc. take a smaller course load. Go half time and try and work part time at a tech start up or business, or do an internship. Also make friends in your classes. Consider them your buddies in war. You’re going to go through the trenches together. It helps to vent, rant, and learn with others who are in the same situation as you. If you need any other advice, send me a DM.",
      "author": "doublemembrane",
      "created": 1638388564,
      "upvotes": 6,
      "replies": {
        "hmu9fsx": {
          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmu9fsx/",
          "text": "This is great advice. I had come here to say change majors but this is MUCH better!",
          "author": "Karenena",
          "created": 1638390318,
          "upvotes": 2,
          "replies": {}
        },
        "hmutvzm": {
          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmutvzm/",
          "text": "this 100%!!!",
          "author": "unetassedethe",
          "created": 1638398106,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmr54rm": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmr54rm/",
      "text": "Is there like something in the water or what. Ahhhh same boat. I feel the EXACT SAME ( biomedical engineering) everything you said I am here experiencing it too 🙋‍♀️",
      "author": "Cu4urthoughts",
      "created": 1638330569,
      "upvotes": 4,
      "replies": {
        "hmudwyk": {
          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmudwyk/",
          "text": "Hey I posted some advice about this on the bottom of the thread. Have a look and see if it helps.",
          "author": "doublemembrane",
          "created": 1638391974,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmr9kmz": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmr9kmz/",
      "text": "I was bout to switch from nursing to computer science 💀 how did u do in calculus one ?",
      "author": "NoAd5564",
      "created": 1638332751,
      "upvotes": 3,
      "replies": {
        "hmrgvfm": {
          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmrgvfm/",
          "text": "I actually did that! Calculus 1 is quite easy especially if you took AP/IB math in high school. Calculus 2 on the other hand is a devil.",
          "author": "18dwhyte",
          "created": 1638336610,
          "upvotes": 7,
          "replies": {}
        },
        "hmrb1jc": {
          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmrb1jc/",
          "text": "Calc1 is an interesting case for me because I took a special version over the summer that was accelerated but also had a nice professor, plus it was remote. I got somewhere in the mid to high Cs but it was also pass/fail because the main thing was making sure you caught up in math if you didn't test in Calc1 right away\n\nBut if you've done okay with algebra and trigonometry, it shouldn't be too horrible. The main thing is differentiation rules and limits and that also includes a lot of stuff with trig identities and the unit circle\n\nCalc2 on the other hand is mostly intergals and...a lot of other stuff. And God help you if you go to a school where they put CompSci in the same program as engineering because you're going to get stuck doing Physics (first class I ever had to drop) or even Chemistry (no you'll never need it unless you're doing some really niche CompSci/Bio hybrid)",
          "author": "sunnirays",
          "created": 1638333506,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hmrhart": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmrhart/",
      "text": "Dropping out of CS too! Changing to a biology major with a human genetics focus and honestly I think it will be one of the best things I’ve ever done.",
      "author": "vividvibrantladybug",
      "created": 1638336856,
      "upvotes": 3,
      "replies": {}
    },
    "hmsxztl": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmsxztl/",
      "text": "What’s most important is do you enjoy programming or would like to work in the computer science field after graduation? There are always sucky professors no matter which major you switch to",
      "author": "woodypei0821",
      "created": 1638371684,
      "upvotes": 3,
      "replies": {}
    },
    "hmtb3hv": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmtb3hv/",
      "text": "IMO the best thing for you to do is to switch out of computer science to another major. Its not worth it to major in something you hate just to make a lot of money. I used to be a computer science major because I wanted to make lots of money, but I switched out when I couldn't pass intro to programming.",
      "author": "aanuma",
      "created": 1638377032,
      "upvotes": 3,
      "replies": {}
    },
    "hmu8gmd": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmu8gmd/",
      "text": "College can be kinda bullshit for STEM. I’ve been to two, one highly competitive and one comparatively easy. Computer engineering degree from the easy one which I would have never survived at the hard one. Sure, the quality of education isn’t as good but I just wanted a job, not a stepping stone to graduate school. Honestly the internships are what really teach you what you need to know. However it’s a moot point if you don’t actually enjoy the material.",
      "author": "AnyProcess4064",
      "created": 1638389954,
      "upvotes": 2,
      "replies": {}
    },
    "hmuel42": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmuel42/",
      "text": "Why don’t you change your major to something you enjoy doing? As a CS senior graduating next semester, it  only gets worse. You wouldn’t want to be miserable working in that field the rest of your life would you? In my experience it is not a great idea to choose a major based solely on the salary. However, a computer science degree can lead you to different careers that don’t involve much coding, like a software engineer",
      "author": "gristburger",
      "created": 1638392219,
      "upvotes": 2,
      "replies": {}
    },
    "hmswakp": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmswakp/",
      "text": "Switch to a Business Admin major or a finance major!!! There are so many people in the field that have no grasp on tech/comp sci concepts. Business is the right choice. In fact having this mix of a STEM background and business education is an amazing overlap and you can end up in a great role. Do business. I promise you. It is essential to understanding our world too.",
      "author": "cbdinfusedcocaine",
      "created": 1638370952,
      "upvotes": 2,
      "replies": {
        "hmsyugg": {
          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmsyugg/",
          "text": "My school does an engineering MBA combo as a 5-year program and it seems like that's a fast track to a good-paying job after graduation",
          "author": "BecomingCass",
          "created": 1638372045,
          "upvotes": 3,
          "replies": {
            "hmszujl": {
              "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmszujl/",
              "text": "Oh hell yeah do that! plus is it so satisfying to go back to the roots of engineering as a process and go from gritty CS specifics back to the big picture of creating something that improves people's lives or business's operations especially with the understanding of what is marketable and what helps optimize operations and profit",
              "author": "cbdinfusedcocaine",
              "created": 1638372471,
              "upvotes": 2,
              "replies": {
                "hmt0qo0": {
                  "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmt0qo0/",
                  "text": "I personally am not going to be doing that, but I know a lot of people who are, and I'm glad it's an option for the people who want to. I'm actually going back for either an education degree or switching careers entirely to music ed after I get this degree\n\nI'm in CS to make cool stuff, not to help businesses get richer, so the business aspect isn't really appealing to me.",
                  "author": "BecomingCass",
                  "created": 1638372847,
                  "upvotes": 1,
                  "replies": {
                    "hmtenk2": {
                      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmtenk2/",
                      "text": "I feel that gl",
                      "author": "cbdinfusedcocaine",
                      "created": 1638378433,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmrhck5": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmrhck5/",
      "text": "don’t pick a major bc of the money unless you absolutely like it. all the work won’t be worth it unless the reason why you pick it is cause you like it. there’s so many careers out there that young students don’t know about because they don’t get talked about as much. glad you’ll be going to the career center! as you’re considering majors, think more about what career(s) do you see yourself realistically pursuing and find a major that best aligns with it. you don’t HAVE to do this cause your major doesn’t always equal career but it can be helpful. also getting work experience while in college will help you A LOT in finding a job after you graduate. a lot of employers want experience, having a high gpa isn’t as impressive if you don’t have work experience (obvi this may not be applicable for certain fields).",
      "author": "Kitycat18",
      "created": 1638336885,
      "upvotes": 2,
      "replies": {}
    },
    "hmsku94": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmsku94/",
      "text": "you are making a very commmon mistake, as soon as things get difficult, you give up.  thats why stem graduates are so popular among companies, those are the people who didnt give up.  they will complete the task no matter what.",
      "author": "ghostmode342",
      "created": 1638365507,
      "upvotes": -4,
      "replies": {
        "hmsszkg": {
          "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmsszkg/",
          "text": "STEM isn't for everyone. People learn differently. This comment basically says that are other non-STEM career paths are useless.",
          "author": "Tall_Specialist",
          "created": 1638369488,
          "upvotes": 2,
          "replies": {
            "hmsvhgh": {
              "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmsvhgh/",
              "text": "i agree, but the op started off with comp sci, so he was somewhat interested in it.  i was just saying he was giving up too early.  seen so many times. he potentially giving up 100k-150k job with tech company.  if he wants to get music teacher degree and get paid 40k year, more power to him, we need music treachers and librarians, 100% agree with you",
              "author": "ghostmode342",
              "created": 1638370594,
              "upvotes": -1,
              "replies": {
                "hmtnve6": {
                  "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmtnve6/",
                  "text": "Compsci is not that different motivation wise from library sciences or education IMO. It's really hard to stay in the full degree program if you're just there for a paycheck in any of those cases, which is what OP is doing it seems. STEM, like education is a lot of work, with a potentially very delayed monetary payoff, and if the money is the only reason you're there, you likely won't get through it all",
                  "author": "BecomingCass",
                  "created": 1638382023,
                  "upvotes": 2,
                  "replies": {}
                },
                "hmt3l1x": {
                  "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmt3l1x/",
                  "text": "Did OP say that they want to be a music teacher or librarian? Not as far as I can tell. They were mainly interested in CompSci because of the money, seemingly not the concepts and actual work itself. People don't have to go through this stress to get by when it isn't working out for them. For instance, if someone is really bad at math ever since they started elementary school, why would they be majoring in math when it's clearly not working out for them just because businesses will hire them? People don't have to pull teeth at something that they don't want to.",
                  "author": "Tall_Specialist",
                  "created": 1638374021,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmsyoxb": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmsyoxb/",
      "text": "Change your major if you don't like it! I know of people working in tech with no degrees, theater degrees, English degrees, whatever really.\n\nAnd personally I'm just getting the degree because it's too late to change for me at this point and then I'll go back for music education when I have a bit of money saved up",
      "author": "BecomingCass",
      "created": 1638371981,
      "upvotes": 1,
      "replies": {}
    },
    "hmt8vav": {
      "link": "/r/CollegeRant/comments/r62g88/im_starting_to_realize_how_much_i_hate_my_major/hmt8vav/",
      "text": "I feel you, dude. I thought I would enjoy programming but I really don't.",
      "author": "unholymanserpent",
      "created": 1638376148,
      "upvotes": 1,
      "replies": {}
    }
  }
}