{
  "sid": "lid1m6",
  "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/",
  "title:": "nasty nice professors",
  "text": "just received a nasty nice email roasting me for not knowing where my grades are... then a follow up apology because the professor actually never sent me my grades and realized AFTER she talked to me like I was the idiot. Girl. Fuck u. \n\nThis is week 5. \nProfessors literally think we’re all dumb. \nAnd they talk to us any kind of way because they CAN. \nAnd half of the time it’s mistakes on their end. Of course you lost track of your emails because who the fuck uses only email to grade and review assignments for multiple classes. We have blackboard for a reason: organization...and she uses it for everything else BUT grades. \n\nI hate it here.",
  "author": "SuccotashImaginary99",
  "created": 1613142973,
  "over_18": false,
  "upvotes": 273,
  "upvote_ratio": 0.98,
  "comments": {
    "gn553g0": {
      "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn553g0/",
      "text": "\"Girl. Fuck u\" I felt that lmfao",
      "author": "ButteryBakedSalmon",
      "created": 1613192597,
      "upvotes": 2,
      "replies": {
        "gn9dfz5": {
          "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn9dfz5/",
          "text": "I just didn’t respond because if I did, that was what I was going to say",
          "author": "SuccotashImaginary99",
          "created": 1613240911,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gn4qr67": {
      "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn4qr67/",
      "text": "I have no idea why professors like sending nasty emails so much. I recently asked for a clarification about the requirements on an assignment and the professor answered my question but told me to basically read the syllabus better. And of course I had already read through the syllabus a couple times, hence why I asked.\n\nMy school has been almost entirely virtual with most classes having prerecorded lectures, I’m not even sure what they’re paying the professors to do aside from grading.",
      "author": "throwaway13630923",
      "created": 1613184018,
      "upvotes": 4,
      "replies": {
        "gn52md6": {
          "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn52md6/",
          "text": "Dude exactly. \nNew idea: burner emails to say what we really want to say 😂😂",
          "author": "SuccotashImaginary99",
          "created": 1613191016,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gn3hv6g": {
      "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn3hv6g/",
      "text": "I feel this so much. My professor is often so condescending just because we’re students. She talks to us like we’re third graders instead of fully grown adults. To make it worse, she’s about 80 years old and constantly says she would’ve retired 20 years ago if she didn’t love teaching as much as she did.",
      "author": "Anoot31",
      "created": 1613161058,
      "upvotes": 6,
      "replies": {
        "gn51zm6": {
          "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn51zm6/",
          "text": "Man. I hate to say this about little ole Gretchen but cuss her old ass out. \n\nLOL, jk. She’s old as shit, honestly it could be because of that. Everyone is a baby to her, even 60 year olds. It’s annoying, but you just gotta think man they ain’t gon keep her old ass for much longer.",
          "author": "SuccotashImaginary99",
          "created": 1613190622,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gn34pmr": {
      "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn34pmr/",
      "text": "Maybe forward the email to the head to the program because of that. She had no right to do that shit.",
      "author": "bluesolur",
      "created": 1613155134,
      "upvotes": 6,
      "replies": {}
    },
    "gn2x812": {
      "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn2x812/",
      "text": "I’m a professor, and I don’t understand why some of my colleagues won’t use the tools we have. It’s a thousand times easier to manage grades and grading in the LMS than it is to do it all on paper. I know some people are resistant to learning new technology for one reason or another, but when things like this happen, there’s really no defensible reason I can see not to realize that methods need to be updated.\n\nSorry you’re dealing with this!",
      "author": "PhDapper",
      "created": 1613151920,
      "upvotes": 54,
      "replies": {}
    },
    "gn2fuhl": {
      "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn2fuhl/",
      "text": "Sorry but... That don't make no damn sense. Wtf is she not using BB? \nLike, I get that all of my profs use excel spreadsheets to keep track of our official grades throughout the semester, and then have to post them to BB for us to see, bc BB won't allow a prof to put in a 0 for a missed assignment until the end of the semester. But, literally, Like you said- That's what BB is there for.",
      "author": "Alliski",
      "created": 1613144234,
      "upvotes": 34,
      "replies": {
        "gn2kiat": {
          "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn2kiat/",
          "text": "She’s very old school & I think she wants to keep doing stuff the way she’s been doing it, but it’s not helping us at all while we have to do online classes. She’s got all our grades on paper at her home and then emails us what we got (if you’re not unlucky like me LMAO) but there’s no way to see our overall average! We just have to pray that all our grades add up nicely in the end.",
          "author": "SuccotashImaginary99",
          "created": 1613146363,
          "upvotes": 26,
          "replies": {
            "gn35scu": {
              "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn35scu/",
              "text": "That's total bullshit. It's one thing to take forever to get grades back to students (which has happened ever since remote learning started. Total bullshit) but emailing you? That's so much more work than just posting it. She's making it harder and more disorganized just for the sake of being stubborn and not using the software. You should definitely report this because the fact that she's not using the school administered program AND the fact that she was disrespectful to you for a mistake that SHE made is a valid concern and I think it's worth bringing it up",
              "author": "vness1213",
              "created": 1613155603,
              "upvotes": 5,
              "replies": {}
            },
            "gn371f5": {
              "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn371f5/",
              "text": "I’m an instructor and intentionally don’t show my students their average. I show them the points they’ve fully earned in the course. Whenever I show averages as we go, students always end up complaining to my department head that their grades dropped inexplicably. However, I explain to them that the grade of 100 they got on the five quizzes worth 1 percent apiece don’t do much to raise the essay grade they got of a 70 that was worth 10 percent. They don’t understand how they can drop from a 100 average to an 80 with just one assignment. I tell them that they can, if they like, keep track of their average by hand or in excel like I did when I was a student. They never seem to want to do that. I provide the exact calculations for their grades from the beginning of the semester, including what percent of their grade every single assignment is worth. Not showing their “as you go” average has cut down on complaints immensely, allowing for more time to grade quicker and answer emails with more valid concerns.\n\nHowever, I do believe it’s important to keep all grades posted in Blackboard. I tally no grades outside of Blackboard, nor are their secret grades that don’t appear in the Blackboard gradebook. Are all of your grades available, OP? Is it possible you could calculate them by hand using [RapidTables.com’s Grade Calculator?](https://www.rapidtables.com/calc/grade/grade-calculator.html) I point all my students in that direction because you can have it work for literally every class. Honestly, excel is Better, but this one creates formulas on the fly based on grades and weights that you enter. You can adapt it to work with every single teacher’s grading breakdown. Granted, the one disadvantage it has against excel is that you can save your grades to the site and come back and add to them like you can with excel. \n\nIf I had to guess, though, it’s likely your teacher just gets massive anxiety when trying to work out a grading column’s calculations in Blackboard. I’m pretty technologically proficient, but that shit SUCKS. It’s one of those designs where if you make an error at the 13th step of the process, you have to completely start over. It’s absolute shitballs. Blackboard has so many errors and glitches it’s not even funny. For example: every semester I have to manually go to every quiz and hit submit before I adjust any due dates for assignments because if I don’t the dates get hung and don’t change over, but only for the assignments you forgot to hit “edit, submit, edit, submit, edit, submit, etc” on. Also, any time I modify a link in my course that goes to another part of my course, it automatically bumps the resultant edit to the very bottom of whatever folder it’s in. Realize I misspelled a word on accident or got a date wrong? I now have to manually reorganize the whole damn folder again. Blackboard looks nice on the surface but [honestly this is closer to the truth](https://i.imgur.com/wu2GlvQ.jpg).",
              "author": "chrisrayn",
              "created": 1613156140,
              "upvotes": 5,
              "replies": {
                "gn51g3b": {
                  "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn51g3b/",
                  "text": "Tbh i feel you and I feel for y’all professors who get hounded by students, but I pay thousands of dollars to receive instruction from teachers and feedback on my work. It feels \nwasteful that I have to practically teach myself the work because we’re remote and teachers are just spewing out textbook readings & assignments, but now entering grades is too much to ask for? I might as well be the professor. That’s like me being a waitress and telling my customers to take their own order, and then I still get a tip. \nI just feel like If I was a professor I wouldn’t make life this hard for students. I want them to feel like they had everything they needed to succeed and they didn’t have to reach out to a department head because they couldn’t talk to me out of fear of yet another nasty nice email. I’ve had classes like that so I know it’s possible. I truly believe some of your colleagues just get off on making us squirm. LOL",
                  "author": "SuccotashImaginary99",
                  "created": 1613190290,
                  "upvotes": -1,
                  "replies": {
                    "gn59o6b": {
                      "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn59o6b/",
                      "text": "You aren’t paying the instructors through your tuition.",
                      "author": "snoboy8999",
                      "created": 1613195761,
                      "upvotes": 3,
                      "replies": {
                        "gn873dq": {
                          "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gn873dq/",
                          "text": "I am still paying thousands of dollars to receive instruction though, no?",
                          "author": "SuccotashImaginary99",
                          "created": 1613229822,
                          "upvotes": 1,
                          "replies": {
                            "gnc5an2": {
                              "link": "/r/CollegeRant/comments/lid1m6/nasty_nice_professors/gnc5an2/",
                              "text": "That’s your prerogative not your instructors.",
                              "author": "snoboy8999",
                              "created": 1613269158,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634064360
}