{
  "sid": "rc6i0x",
  "link": "/r/CollegeRant/comments/rc6i0x/incredibly_stressed_for_finals_and_i_feel_like/",
  "title:": "Incredibly stressed for finals and I feel like crap",
  "text": "Especially for my stats final. The only way I’m gonna pass the class is if I somehow get an 85% on the final exam bc I’m genuinely doing terrible in this class. Plus the final will cover ANYTHING that we’ve gone over class and there’s a handful of things that I still don’t completely understand but can’t identify which right now. I’m seeing a tutor and the assignments right now aren’t that bad but I’m still not confident that I’ll know most of the content in the next 9 days.\n\nBut then again, this is the only class that I’m struggling with. I have A’s in my other courses and one them doesn’t even have a final. With that being said, hopefully I can spend more time studying for my stats exam.\n\nTL;DR: Super stressed for my stats final bc I need to get an 85% to pass the class. Not sure if I would be able to grasp most of the content in the next 9 days even though I’m seeing a tutor.\n\nEdit 12/10: Turns out the the final isn’t actually worth 80%, I just misread the syllabus. Still gonna study hard to get a B though.",
  "author": "orcanio-star",
  "created": 1639013991,
  "updated": 1639517927,
  "over_18": false,
  "upvotes": 36,
  "upvote_ratio": 0.93,
  "comments": {
    "hnsykyk": {
      "link": "/r/CollegeRant/comments/rc6i0x/incredibly_stressed_for_finals_and_i_feel_like/hnsykyk/",
      "text": "What the fuck is that exam weight??? That's dooming a majority of the students to fail.",
      "author": "lkmk",
      "created": 1639017947,
      "upvotes": 25,
      "replies": {
        "hnszxw8": {
          "link": "/r/CollegeRant/comments/rc6i0x/incredibly_stressed_for_finals_and_i_feel_like/hnszxw8/",
          "text": "It was originally supposed to be 2 tests (one for the final unit and the actual final) that would add up to 80%. My professor decided that we were too busy to take 2 tests so he combined them instead. So far no one has said anything about it.",
          "author": "orcanio-star",
          "created": 1639018564,
          "upvotes": 10,
          "replies": {
            "hnt0mjh": {
              "link": "/r/CollegeRant/comments/rc6i0x/incredibly_stressed_for_finals_and_i_feel_like/hnt0mjh/",
              "text": "But you'd be even busier studying for an exam like this?",
              "author": "lkmk",
              "created": 1639018878,
              "upvotes": 4,
              "replies": {
                "hnt1tnh": {
                  "link": "/r/CollegeRant/comments/rc6i0x/incredibly_stressed_for_finals_and_i_feel_like/hnt1tnh/",
                  "text": "Exactly! I’ll ask about the exam weight tomorrow in our lecture though. Hopefully either he’ll change his mind or my classmates will jump in with their opinions.",
                  "author": "orcanio-star",
                  "created": 1639019433,
                  "upvotes": 6,
                  "replies": {
                    "hnt4ua0": {
                      "link": "/r/CollegeRant/comments/rc6i0x/incredibly_stressed_for_finals_and_i_feel_like/hnt4ua0/",
                      "text": "Just my opinion, but your time may be better spent just listening during lecture tomorrow. \n\nThink about your end goal. It’s very unrealistic that the professor would (or even could) split the material into two exams at this point. So, one downside is you spend crucial lecture time discussing something other than exam material. And depending on how that discussion goes, you risk angering the professor who might end up making the exam more difficult (even subconsciously). \n\nOn the other hand, a private verbal or electronic message along the lines of “I hope you will take the fact that the exams are now combined into consideration when grading the final” *might* result in something positive. \n\nGood luck to you. I’m proud of you for all those A’s!!! Now, close Reddit and get back to studying for that final!",
                      "author": "cajunsoul",
                      "created": 1639020850,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnu87rc": {
      "link": "/r/CollegeRant/comments/rc6i0x/incredibly_stressed_for_finals_and_i_feel_like/hnu87rc/",
      "text": "There's no way you need an 85 on the final to pass. Assuming passing is at 55% even if you got 0 in everything else you would only need a 68% to pass. I agree that the weight of the exam is crazy though.",
      "author": "bobrosster",
      "created": 1639048234,
      "upvotes": 4,
      "replies": {}
    }
  }
}