{
  "sid": "lj87br",
  "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/",
  "title:": "Professors are literal deadbeats atm",
  "text": "Everyone of my professors usesMcGraw Hill to do everything, it’s literally comical how little they are involved. I have to teach myself with the book and pre-made slides and do the homework on that site. The only thing my professors do is take the grades i get and put them into blackboard. My one professor stands out and has a discussion group where we can ask questions if needed. Glad I’m shoveling out thousands for a $200 access code to teach me:)",
  "author": "tate3223",
  "created": 1613247208,
  "over_18": false,
  "upvotes": 330,
  "upvote_ratio": 0.99,
  "comments": {
    "gnqu32u": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnqu32u/",
      "text": "so relatable...... I'm in a chemistry lecture (PLUS lab... so a 4 hour class).... that's all just using online software. it's ridiculous. we have in person 'lab' only once every other week and the professor missed the 2nd one because she didn't even know what time she was supposed to show up........... I can't.....",
      "author": "ksnwvlsnwln",
      "created": 1613549135,
      "upvotes": 3,
      "replies": {}
    },
    "gnilt8y": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnilt8y/",
      "text": "oh my god this was my music appreciation professor last semester....barely interacted with the class besides discussions and this one concert report assignment we had to do. it almost felt like she was nonexistent as we had to do every assignment, quiz, and test on mcgraw hill. i really wish i interacted with her more even in zoom meetings. i feel like i could have enjoyed the class more if she expressed her passion about music (which she mentioned in her syllabus) while teaching us the concepts",
      "author": "helpapanickedstudent",
      "created": 1613377300,
      "upvotes": 3,
      "replies": {}
    },
    "gnfx5qj": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnfx5qj/",
      "text": "I think the COVID era is starting to make people realize something.  College is not all it's cracked up to be, and they've always been selling a few hundred dollars worth of material (think access codes and textbooks) thousands of dollars a semester.  \n\nProfessors are not any better.  They have always thought they are very important (when in reality, they are just a part of the medium we use to learn.  It can be done entirely without them).",
      "author": "intoxicatedMobyDick",
      "created": 1613323580,
      "upvotes": 7,
      "replies": {}
    },
    "gndgsxy": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gndgsxy/",
      "text": "I dont even get that. I was told to buy a 70 dollar textbook ... we read chapters, do the problems, hand them in, and take midterms/finals on random content... failed my first ever midterm today (long story) ... like, yeah I totally don't know how to program in this language... I only used to do it for the government and corporations 🙄... oh sorry I used something we didn't get to in the book yet or didn't indent it to your preference...",
      "author": "ComputeBeepBeep",
      "created": 1613289008,
      "upvotes": 3,
      "replies": {}
    },
    "gndbnzk": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gndbnzk/",
      "text": "This has been my experience across the board with STEM except for one stats professor with a PHD and a cushy corporate job who just does teaching for fun (coincidentally he was also a much superior teacher than the usual grudging candidate for the job of ‘educator,’ it’s almost like giving a shit makes a difference). My liberal arts and GEs weren’t much better: either overeager, self-absorbed loons who would rant about the state of the universe (and heavily imply that covid is a hoax and that they think lockdown is BS) and assign ridiculous amounts of writing that no full time CC student could plausibly be expected to complete in a week, or completely hands off professors who literally just assign reading and an essay a week and fuck off. No office hours, no emails, nothing. It’s fucking bullshit man, and as the son of an English teacher who instructs over 800 high school students a day, it’s incredibly painful to see that this is what education has become. Returning to in-person education once conditions are suitable might temporarily fix things, but I honestly think eliminating the “campus experience” just ripped open already gaping holes in the higher education system. The corporate Supra-infrastructure has cemented its control over the education system, thanks to our dependence on their services as a result of being online, and now professors are practically encouraged to sit back and let these companies do all the work for them. Otherwise they might get in trouble for letting an incident of cheating slip by, or they might get fired by the school for not getting with the program.",
      "author": "LonelyActor",
      "created": 1613286515,
      "upvotes": 4,
      "replies": {}
    },
    "gncy3xi": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gncy3xi/",
      "text": "\\*whispers\\*\n\nProfessors in college aren't there to educate, they only fight to get tenure and funding for their own personal research projects\n\n\\*gasps\\*",
      "author": "thanatosgawd",
      "created": 1613281015,
      "upvotes": 7,
      "replies": {}
    },
    "gncl785": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gncl785/",
      "text": "The title of this post is disgusting. It is so unfair to make broad generalizations. 9/10 instructors have no say in whether or not a $200 access code is required. I know it sucks but still. Last semester I had to purchase a $200 access code for my Spanish class (lecture class btw) and it’s a department decision which means one individual prof can’t do much to change the situation.",
      "author": "Mhoover0108",
      "created": 1613276399,
      "upvotes": 2,
      "replies": {}
    },
    "gnceeaw": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnceeaw/",
      "text": "A professor of mine was MIA for the first two weeks of class. He finally held a Zoom lecture last week. He explained that he spent a week transitioning the class to be asynchronous and that he would only have a single weekly lecture.  The class wasn't listed as such. The second week was spent at a conference supposedly.  The only assignment we have is a weekly essay due the day after his lecture.  \n\nProfessors have been using the online transition to make their lives easier at the expense of their students.",
      "author": "SwiftCEO",
      "created": 1613273246,
      "upvotes": 5,
      "replies": {}
    },
    "gnccomj": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnccomj/",
      "text": "Seriously, even in my in-person classes, the teachers don’t even teach. I find myself having to go on the internet just to teach myself what they should have taught me in the first place. Waste of fucking time.",
      "author": "ashley_halloween",
      "created": 1613272226,
      "upvotes": 4,
      "replies": {}
    },
    "gnccm5b": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnccm5b/",
      "text": "pearson instead but yeah",
      "author": "deathworld123",
      "created": 1613272184,
      "upvotes": 3,
      "replies": {}
    },
    "gnc4r1p": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnc4r1p/",
      "text": "Some professors are assigning more work than before. I have multiple classes where I read a chapter, do a bunch of assignments, watch a bunch of lecture videos, then go to class, and then do homework afterwards and start the process over.",
      "author": "worlds_away_",
      "created": 1613268942,
      "upvotes": 13,
      "replies": {}
    },
    "gnbj8e0": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnbj8e0/",
      "text": "What you described is unacceptable and you are fully justified in being so upset with the lack of value you are getting from the courses given the mi eu you paid. Period. You should raise your concerns with the dean of students, the department chair, college dean, anybody you can get to listen who is actually in a position of power to influence things. \n\nThat being said, to be honest, you probably have zero idea just how exhausted and overworked most professors are atm. \n\nI don’t blame you- I’m a professor now, but as a student I had no idea what professors actually did. Depending on the size of your school, the exact position your professors have, and a number of other variables, teaching may be their #1 priority or their last priority. It’s possible they are being lazy but I know a lot of faculty at a lot of different sized schools and the common feeling is that holy shit we are all very busy and losing our minds.",
      "author": "payattentiontobetsy",
      "created": 1613260333,
      "upvotes": 2,
      "replies": {
        "gngaufo": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gngaufo/",
          "text": "If professors are feeling overworked and exhausted right now, imagine how students with even less power who AREN'T getting paid feel.",
          "author": "milo_2244",
          "created": 1613327991,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gnbfnhx": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnbfnhx/",
      "text": "My math professor hasn't done a single thing all semester. We're using My Math Lab, she posted an announcement on the first day that the assignments are all posted on mylab and that we should read the sections in the book before doing assignments, and if we had questions she has office hours over zoom. I went to her office hours once. I sat in a virtual waiting room for an hour before she ended the meeting. My other classmates have all had similar office hours experiences. I'm about ready to contact administration and ask if she's even alive at this point.",
      "author": "ishouldbestudying987",
      "created": 1613259260,
      "upvotes": 44,
      "replies": {
        "gnbgp5b": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnbgp5b/",
          "text": "Is the professor tenured? How large is the school you are at?",
          "author": "payattentiontobetsy",
          "created": 1613259575,
          "upvotes": 14,
          "replies": {
            "gnbhkv6": {
              "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnbhkv6/",
              "text": "No she's not tenured as far as i know. Its a decent size community College",
              "author": "ishouldbestudying987",
              "created": 1613259829,
              "upvotes": 4,
              "replies": {
                "gnbleo2": {
                  "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnbleo2/",
                  "text": "You can tell by looking at their faculty page (on the department website for your CC). Tenure at community colleges is rarer, but not impossible. What’s her actual title?",
                  "author": "payattentiontobetsy",
                  "created": 1613261148,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gnbbr3u": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnbbr3u/",
      "text": "I’ve had it fairly great so far. I few hiccups (last semester the instructor overhauled the course mid-semester and it was a mess, but worked out...just stressful when it didn’t need to be). But this semester, I’ve got the worst French class and the instructor is MIA! :/",
      "author": "mother_of_nerd",
      "created": 1613258046,
      "upvotes": 7,
      "replies": {}
    },
    "gnb4ttt": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnb4ttt/",
      "text": "Exactly how my semester has been going. Prerecorded lectures that are generally just narration over PowerPoint slides. All homework made and graded by McGraw or Cengage. Can’t believe students have to pay thousands of dollars for this kind of stuff and the professors make tens of thousands for doing almost nothing. And God forbid you have to email them a question just to receive a rude response.",
      "author": "throwaway13630923",
      "created": 1613256292,
      "upvotes": 28,
      "replies": {
        "gnb5fqr": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnb5fqr/",
          "text": "At least you guys are getting homework, we have 4 Lockdown webcam exams and that's the entirety of our grading criteria lol",
          "author": "milo_2244",
          "created": 1613256441,
          "upvotes": 9,
          "replies": {
            "gnb60av": {
              "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnb60av/",
              "text": "I had that last semester for a finance class and boy was it annoying. But at least for that class, they had 5 optional Zoom recitations per week and the lectures were done by the one of the department heads.",
              "author": "throwaway13630923",
              "created": 1613256587,
              "upvotes": 6,
              "replies": {}
            },
            "gng7c6u": {
              "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gng7c6u/",
              "text": "Saaaame I’m so nervous for this first exam! No idea how difficult it’s going to be and it’s an upper level bio class and I am NOT. A bio major. Why am I taking it? Wanted to challenge myself plus it fills an elective for my minor. Not sure if I made a mistake or not yet but we’ll see!",
              "author": "Kind_Concert_6300",
              "created": 1613326253,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gncjd59": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gncjd59/",
          "text": "Your tuition doesn’t pay meager instructor salaries.",
          "author": "snoboy8999",
          "created": 1613275651,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "gnaqxcu": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnaqxcu/",
      "text": "Professor here. Please don't stop calling out these professors. End of semester evals are read by the department chair/head and potentially also by the relevant dean. If the school thinks stuff like this will hurt the bottom line, they will make a change.",
      "author": "real-nobody",
      "created": 1613252851,
      "upvotes": 97,
      "replies": {
        "gnawwxp": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnawwxp/",
          "text": "Oh don’t you worry about that. I am always 100% honest in them. If the professor does the bare minimums I’ll say it, if they go above and beyond I’ll say it.",
          "author": "tate3223",
          "created": 1613254257,
          "upvotes": 38,
          "replies": {}
        },
        "gnb43oz": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnb43oz/",
          "text": "I actually gave a really bad eval to one professor. He then took the first 15 minutes to look at the eval bar graph. He interrogated and tried to scare us into not doing it again.",
          "author": "CH705-807",
          "created": 1613256110,
          "upvotes": 20,
          "replies": {
            "gnbgtbi": {
              "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnbgtbi/",
              "text": "That's extremely fucked up. Why was he able to even view your reviews that early on? At my school reviews are given towards the end of the semester and professors don't see it til after official transcripts come in so that a professor won't be petty and end up making their class worse for their students",
              "author": "vness1213",
              "created": 1613259608,
              "upvotes": 15,
              "replies": {}
            },
            "gnchd5r": {
              "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnchd5r/",
              "text": "I've never been at a school where we even saw our evals until weeks after the semester was over. They are supposed to be anonymous. Sometimes you can tell who did one or two of them. But really, it sounds like that professor was breaking some rules.",
              "author": "real-nobody",
              "created": 1613274831,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "gnbqn37": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnbqn37/",
          "text": "I remember an incident at my school where we had to do the evaluation but we still had classes afterwards. One of my classmates called out the teacher for forcing her to do class work when she had a medical emergency and refused to give her extensions. He later took her into the hallway and “talked to her” cuz he got yelled at by his higher up person who read the reports. How was this appropriate??? We could all hear her crying in the hallway, the walls were super thin. We just looked at each other blankly. As far as I know, no one in the class would take him again but wtf. After that, I never knew if I should be cautious about what I wrote on the evaluations or not. my school had some pretty sucky teachers :/",
          "author": "Sakura372",
          "created": 1613263532,
          "upvotes": 17,
          "replies": {
            "gnch4kq": {
              "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnch4kq/",
              "text": "Not cool. The evals should be anonymous. Sometimes you can tell who one or tow of them are from. But it sounds like someone broke protocol in a lot of ways there.",
              "author": "real-nobody",
              "created": 1613274723,
              "upvotes": 5,
              "replies": {
                "gncj8oj": {
                  "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gncj8oj/",
                  "text": "They are anonymous but if you obvious as fuck personal circumstances nothing is anonymous.",
                  "author": "snoboy8999",
                  "created": 1613275599,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gnds4ij": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnds4ij/",
          "text": "Good point, I wish that were true for my school. :( A lot of colleges don’t have evals every term and/or their evals aren’t read by chairs or deans except during the tenure process!",
          "author": "hire_power",
          "created": 1613296992,
          "upvotes": 3,
          "replies": {}
        },
        "gngpes3": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gngpes3/",
          "text": "It depends, I've heard people say it barely affects tenured profs because they can't get fired barring extreme circumstance. I recently read a post from the prof sub where they were discussing student evals (and how totally evil and unfair they are, of course) and multiple profs said straight up that they are tenured and don't even read their evals anymore period because they're \"too mean\", and due to their tenured status they don't have to go over the evals with admin. Not all colleges are like that I'm sure but I was disheartened by how many admitted they do not even read them at all (wish we could simply choose not to receive the feedback on our assignments or ignore all customer feedback in a service based job but alas) and that their admin doesn't read them either. Or cannot/does not act on them.",
          "author": "fuschiaoctopus",
          "created": 1613335353,
          "upvotes": 3,
          "replies": {
            "gnk8v41": {
              "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnk8v41/",
              "text": "Yeah that is potentially true. More likely to be the case if the professors job is primarily research instead of teaching. Bigger universities are often actually more research focused than you realize, so some of the teaching stuff is devalued.\n\nThe eval process is fundamentally flawed. Probably for both professors and students. Some professors are indeed bitter about that. Most I know at least try to take them seriously. On the other hand, some people are just shit people. For students, doing the evals and taking serious issues to any department focused on student retention is probably the best you can do.",
              "author": "real-nobody",
              "created": 1613415829,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gnanhvi": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnanhvi/",
      "text": "Exactly. Not only are they relying on automated systems for homework, the written work I actually do (labs, exams) gets no feedback at all, just a number. Professors and TAs have gotten soo lazy over covid. \n\nLike, how does that make sense? In the real world, you almost always get feedback on your performance.",
      "author": "milo_2244",
      "created": 1613251876,
      "upvotes": 115,
      "replies": {
        "gnaofyy": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnaofyy/",
          "text": "I know it’s absolutely pathetic. If I gave the effort they gave I’d be failing miserably, but they still get paid. It makes no sense.",
          "author": "tate3223",
          "created": 1613252119,
          "upvotes": 47,
          "replies": {}
        },
        "gnjcsd1": {
          "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnjcsd1/",
          "text": "Same my physics teacher said he wouldn't leave feedback on the online labs because no one looks at them.\n\nBut the assignment is locked and never opens again after the due date, so we can't see the feedback anyway. So it's not like we get the choice to improve.",
          "author": "elocinkrob",
          "created": 1613399879,
          "upvotes": 4,
          "replies": {
            "gnjlilx": {
              "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnjlilx/",
              "text": "Yeah, tbh I've noticed the physics dept of any school tends to have the laziest professors. I have NO idea why, but it's almost always applicable.",
              "author": "milo_2244",
              "created": 1613404654,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gnaha03": {
      "link": "/r/CollegeRant/comments/lj87br/professors_are_literal_deadbeats_atm/gnaha03/",
      "text": "I’m sorry that this is your experience this semester. I’ve seen quite a few comments similar to this, and I honestly can’t believe so many professors are formatting their courses this way. We all knew adjustments would be made for Covid, but I didn’t expect it to get this bad. \n\nWith that being said, I wouldn’t put this on all professors. There are some who are genuinely trying very hard to continue their normal routine for classes, labs, HW, etc. I do understand your frustration, but just know that they are experiencing similar, but different difficulties as us students are.",
      "author": "chembug18",
      "created": 1613250438,
      "upvotes": 13,
      "replies": {}
    }
  },
  "updated": 1634062293
}