{
  "sid": "oc1v7g",
  "link": "/r/CollegeRant/comments/oc1v7g/knewton_alta/",
  "title:": "knewton alta",
  "text": "Why do teachers still use this program?! Especially for math. This program is so flawed in how it grades, it makes me wonder who would advocate for this! Not only is the “punishment for incorrect answers” system frustrating, it is not even to scale. If I forgot to add a negative sign to my answer, I will lose just as much progress as if I had not done the work and guessed incorrectly. Semester after semester I hear students saying they don’t want to use Knewton because they get stuck on one assignment for hours. If students are stuck on one subject/assignment for hours, THEN THE PROGRAM IS NOT TEACHING EFFECTIVELY. Which takes me to the next point, Knewton Alta may have the worst explanation system out of any online learning tool I have used. This program will leave you more confused whenever it tries to “explain” things. The explanations are so vague and OFTEN unrelated! I would not wish Knewton Alta upon any student.",
  "author": "Professional-Tea3203",
  "created": 1625196607,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "heh8nd9": {
      "link": "/r/CollegeRant/comments/oc1v7g/knewton_alta/heh8nd9/",
      "text": "It's impossible to make a fucking box plot, too.",
      "author": "bunnyCMACHHA",
      "created": 1632754829,
      "upvotes": 1,
      "replies": {}
    },
    "hazzr65": {
      "link": "/r/CollegeRant/comments/oc1v7g/knewton_alta/hazzr65/",
      "text": "My prof doesn't even fucking teach alongside  it we're just being set loose on this piece of shit program without any instruction FOR A REMEDIAL COURSE FOR PEOPLE WHO STRUGGLED WITH MATH IN HS",
      "author": "Cynical_puppy_uncle",
      "created": 1630370963,
      "upvotes": 1,
      "replies": {}
    },
    "h40ku16": {
      "link": "/r/CollegeRant/comments/oc1v7g/knewton_alta/h40ku16/",
      "text": "I feel your pain. Knewton Alta is horrible at explaining things. Wondering if the final will be within the program gives me anxiety because I’ll fail the whole question by forgetting a single negative sign.",
      "author": "trailurparkgurl6969",
      "created": 1625400602,
      "upvotes": 1,
      "replies": {}
    },
    "h3vmpc1": {
      "link": "/r/CollegeRant/comments/oc1v7g/knewton_alta/h3vmpc1/",
      "text": "We used Knewton for 2 semesters for CHEMISTRY at WVU. Not only did Knewton go over things we were never taught in class, our professor would set the MINIMUM amount of questions for a topic at 20, so unless you got 20 questions right in a row, you were probably doing anywhere from 30-50.",
      "author": "gman477",
      "created": 1625278016,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634064484
}