{
  "sid": "ri631u",
  "link": "/r/CollegeRant/comments/ri631u/why_do_instructors_emphasize_you_must_study_this/",
  "title:": "Why do instructors emphasize you must study this and not even ask a single question?",
  "text": "I was triggered when one of my professors emphasized that you must study \"*this topic for the final exam, it is a crucial topic on the 55% final exam!\"* \n\nAnd then not even ask A SINGLE DAMN QUESTION ABOUT IT.\n\nWhat was the \\*\\*\\*\\*ing point of me memorizing the entirety of the Wnt and TGF-β pathway: two big pathways that you mentioned not once, BUT MULTIPLE TIMES. I spent a good 3-4 days memorizing the pathway and what each protein, each transcription factor does in each progressive step.\n\nYou did not ASK a single damn question about EITHER pathway.",
  "author": "biologystudent123",
  "created": 1639706055,
  "updated": 1639788363,
  "over_18": false,
  "upvotes": 63,
  "upvote_ratio": 0.98,
  "comments": {
    "hovgwrv": {
      "link": "/r/CollegeRant/comments/ri631u/why_do_instructors_emphasize_you_must_study_this/hovgwrv/",
      "text": "I had a teacher give us a study guide. At the top it said \"Disclaimer the final is subject be not on these subjects or not on this\" like wtf. I notice a 3rd of the stuff I studied wasn't on the test. But I got a 85% on it.",
      "author": "MechanicExtension565",
      "created": 1639713523,
      "upvotes": 15,
      "replies": {}
    },
    "hoxbww2": {
      "link": "/r/CollegeRant/comments/ri631u/why_do_instructors_emphasize_you_must_study_this/hoxbww2/",
      "text": "That's why my professor explained he doesn't do study guides because then he has to actually follow it and if he doesn't students get mad.",
      "author": "IronGemini",
      "created": 1639753716,
      "upvotes": 9,
      "replies": {}
    },
    "hoxh33d": {
      "link": "/r/CollegeRant/comments/ri631u/why_do_instructors_emphasize_you_must_study_this/hoxh33d/",
      "text": "My evolutionary bio professor gave us a 55 question final 15 were cumulative and based of a reading he put in the exam, he said the the 15 questions will be based off the highlighted parts of the article, they were not. Maybe 5 were but the other 10 were just general questions. The other 40 questions were from the last third of content, i studied it for countless hrs, memorized all the stuff that was important, just to get questions about the stuff that either wasn't mentioned or was a word in a sentence that we hardly went over. Im just hoping i didn't fail but idk at this point.",
      "author": "Reaper_gaming_afk",
      "created": 1639755793,
      "upvotes": 4,
      "replies": {}
    },
    "hoyc0qw": {
      "link": "/r/CollegeRant/comments/ri631u/why_do_instructors_emphasize_you_must_study_this/hoyc0qw/",
      "text": "Mate, I feel your pain. I got a study guide for my pre-calculus final and studied every single topic. Not only were some of the topics not on the exam, but there were extremely complicated questions that we hadn't even gone over. \n\nIt's rough, I'm sorry that happened.",
      "author": "designingwoman",
      "created": 1639767622,
      "upvotes": 1,
      "replies": {}
    },
    "hozgetd": {
      "link": "/r/CollegeRant/comments/ri631u/why_do_instructors_emphasize_you_must_study_this/hozgetd/",
      "text": "To learn",
      "author": "Boney_African_Feet",
      "created": 1639784109,
      "upvotes": 1,
      "replies": {}
    }
  }
}