{
  "sid": "q44ls8",
  "link": "/r/CollegeRant/comments/q44ls8/tips_for_how_to_overcome_test_anxiety/",
  "title:": "Tips for how to overcome test anxiety!",
  "text": "Hi everyone! I recently finished my psychology degree and wanted to share some tips for taking tests and overcoming test anxiety. I had a lot of anxiety when taking tests, and I wish I knew these strategies a lot earlier in my degree!\n\nIf you’re experiencing test anxiety, it might be because you don’t feel prepared for your tests. If this is the case, then you may need to do more studying or you need to determine if your study strategies are working for you. Re-reading notes or chapters in the textbook is probably the study strategy that most students use but this isn’t the most effective way to study. You want to try to use a more active study strategy where you are more fully engaged with the material like making practice questions and testing yourself on the material. When we read things over and over again, we may think that we understand it because it looks familiar but we may not actually understand it or be able to apply the information during the test.\n\nYou also want to pay attention to how you’re talking to yourself, both before and during the test. Our thoughts can have a big impact on our feelings and our behaviour. For example, if we tell ourselves that studying won’t help and we won’t pass this class anyways, that will make us feel depressed and helpless, and we likely won’t feel motivated to study for the test. Instead, try to assess the situation accurately. How many hours did you spend studying? Do you understand the material? If you don’t, then try to do more studying, or get help from the professor, classmate, or tutor.\n\nIf we’re not feeling well physically, then we won’t feel well mentally. This means we have to take care of our physical health to prepare for a test too. A lot of students stay up late or all night studying for exams. If you can, avoid this. Sleep helps consolidate memories into long-term memory, and lack of sleep interferes with our attention and concentration. If you want to use sleep to your advantage, take a nap after a study session. You also want to avoid having too much caffeine on the day of the exam. It can heighten anxiety and make us jittery. \n\nI also made a short video about the causes of test anxiety and more strategies to overcome it: [https://www.youtube.com/watch?v=syIJ0u6K1oM](https://www.youtube.com/watch?v=syIJ0u6K1oM) \n\nGood luck on your tests! (:",
  "author": "lindaedith",
  "created": 1633720338,
  "updated": 1634093824,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hfwdy72": {
      "link": "/r/CollegeRant/comments/q44ls8/tips_for_how_to_overcome_test_anxiety/hfwdy72/",
      "text": "Thank you for the advice!!",
      "author": "EmelaJosa",
      "created": 1633725825,
      "upvotes": 2,
      "replies": {
        "hfx352y": {
          "link": "/r/CollegeRant/comments/q44ls8/tips_for_how_to_overcome_test_anxiety/hfx352y/",
          "text": "No problem!!",
          "author": "lindaedith",
          "created": 1633737047,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}