{
  "sid": "oxuvu5",
  "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/",
  "title:": "I feel so fucking lost",
  "text": " \n\nI graduated high school a few months ago. It's officially time to go to college and I'm just so fucking lost.\n\nI am usually a person who believes in myself and knows what I'm capable of but the world just got too real all of a sudden and now I've realized that I truly am embarking on a journey of my own and I still am not sure wtf to do with my life. I'm a creative; I've always been. I'm going that route but my parents have an inkling that it's probably not the smartest idea because \"creativity is not practical\".\n\nI'm scared of failing in life, I really am. I know it's pointless but I'm fucking terrified. I wanna be successful so bad and I'm ready to be just that, but, I feel like nobody around me really believes in me and it's hard to keep faith in myself if the people closest to me don't feel the same way.\n\nI'm just so fucking lost. And I feel defeated already and I haven't even started yet. Kinda wanna disappear off the face of the Earth for years and float into the abyss mindlessly.\n\nAnyway, this was just a rant that I wanted to share with you guys (for some reason). Merci for listening.",
  "author": "fkagrunge",
  "created": 1628090310,
  "over_18": false,
  "upvotes": 127,
  "upvote_ratio": 0.98,
  "comments": {
    "h7wjkdc": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7wjkdc/",
      "text": "Please don't let anyone tell you not to pursue a potential passion because it's \"not practical\". That's how people end up extremely unhappy in their lives. I've heard too many stories of people saying how they wish they wouldn't have let others pressure them into doing something they didn't want to do and regretting their decisions all because they didn't listen to themselves. I believe in you and am rooting for whatever it is YOU decide to do.",
      "author": "i_do_the_kokomo",
      "created": 1628228705,
      "upvotes": 2,
      "replies": {
        "h7x2nkc": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7x2nkc/",
          "text": "I fully understand that now. I made this post feeling absolutely defeated and I wasn't thinking clearly. I still am trying to instill confidence within myself. Your comment means so much to me so thank you from the deepest parts of my heart! I appreciate you very much.",
          "author": "fkagrunge",
          "created": 1628244449,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h7um29n": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7um29n/",
      "text": "Nothing matters, gravitate towards what makes you happy both in college and after and you’ll have a great life",
      "author": "SelfImproveDrew",
      "created": 1628194202,
      "upvotes": 2,
      "replies": {
        "h7vo70s": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7vo70s/",
          "text": "And that's what matters💖💖💖",
          "author": "fkagrunge",
          "created": 1628211604,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7s6yah": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7s6yah/",
      "text": "I went into college and I was a lost creative too, just like you. The only difference was that I didn't necessarily take the creative route nor did I care about how successful my life would turn out post-college. I honestly didn't care about anything.\n\nNow that I finally have a sense of what I truly want to do, I care to the point of being scared for my future and what is to come. But let me tell you, the feeling of being scared beats the feeling of being totally numb and apathetic by a long shot. Just knowing that I have a purpose and something to work towards makes life feel like living.\n\nI live by k.flay's lyric, \"The only thing to fear is never being scared.\" Because in my experience, it's true.",
      "author": "toofeduptocare",
      "created": 1628152233,
      "upvotes": 2,
      "replies": {
        "h7sb00e": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7sb00e/",
          "text": "This is honestly so beautiful. I'm so happy you have found your sense of self and purpose again. I'm gonna live by that lyric too. It makes sense. Being scared is just a sign of how great we can actually be. Thank you for this!",
          "author": "fkagrunge",
          "created": 1628155753,
          "upvotes": 2,
          "replies": {
            "h7sffic": {
              "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7sffic/",
              "text": "Thank you, I hope you are able to find yours too and I am beyond grateful that you found my reply useful. I wish you well in life!",
              "author": "toofeduptocare",
              "created": 1628159400,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h7s0v2q": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7s0v2q/",
      "text": "How do your finances look going into this? Are you taking on a lot of debt? Debt can absolutely make the journey less enjoyable, and force you into practical. I would avoid debt like the plague (this is my 44 yo self, also creative, talking to my younger self).",
      "author": "prof_is_out",
      "created": 1628147117,
      "upvotes": 1,
      "replies": {
        "h7sax2s": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7sax2s/",
          "text": "Not a lot of debt for me but what I fear losing is a lot of time and my creative spirit.",
          "author": "fkagrunge",
          "created": 1628155682,
          "upvotes": 1,
          "replies": {
            "h7v4as0": {
              "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7v4as0/",
              "text": "Yes, I get that, but if you take out huge loans, the burden of needing to pay those back can zap the creative spirit (beyond college). I personally would continue with your plan to major in something creative. Have you thought about how you might combine creative and practical? For instance, maybe you become an art teacher, something like that. Also, depending on your area, or geographic location, there might even be money in the creative work you do. Maybe you could double major in business and your creative field----business can be quite an easy major, at least one less focused on grades.",
              "author": "prof_is_out",
              "created": 1628202003,
              "upvotes": 2,
              "replies": {
                "h7vo4wg": {
                  "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7vo4wg/",
                  "text": "I agree! I was thinking of doing a double major in business and the creative field I wanna get into. I can definitely move around Europe in terms of my creative needs. I've already studied business in high school so I guess a major wouldn't come too difficult for me. It's definitely a smart idea. I'm gonna do it. \n\n&#x200B;\n\nThank you SOOO much for the help btw!! Sending love.",
                  "author": "fkagrunge",
                  "created": 1628211574,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h7rqpge": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7rqpge/",
      "text": "You need to always remember that creatives are the lifeblood of society. Without art in all its forms, this planet would be lost. No matter what anyone says or thinks, remember that you are needed, you are essential, you are valued, you are enough. Be strong and remember that everything in life, especially the dark, lonely, lost times are temporary. Don’t worry about big plans and having your life planned out. Take it day by day and, when your head hits the pillow at the end of the day, another new day with all its exciting possibilities is coming up tomorrow. College is not the be all and end all. Life goes on and you will succeed. Good luck, my friend!",
      "author": "OOBExperience",
      "created": 1628139814,
      "upvotes": 2,
      "replies": {
        "h7sashf": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7sashf/",
          "text": "This truly made me cry. Thank you SO much.",
          "author": "fkagrunge",
          "created": 1628155569,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7qtxt8": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7qtxt8/",
      "text": "It’s funny, I graduated college last May and I’m STILL “lost”.  I came to the realization that it’s all a matter of perspective, to put it as simply as possible (for more, look into stoicism).\n\nAll I can say is, make your resumè fat early. Do something on the side throughout your years, be it a job, volunteer, organization, build a skill, languages, whatever. The resumè is you, and you’ll want to be as confident as possible when giving it and talking about the things you’ve done during your interviews. To start, look at work-study opportunities at the college, that way the job fits reasonably into your schedule. Being the creative-type is awesome and admirable enough, as you could probably have a profitable hobby with that early. But you also need to have work experience alongside that, and the best way is with a position of sorts. Think less about getting the skill, and more about getting the position so you can talk about/build on the experience.",
      "author": "Zealomon",
      "created": 1628122829,
      "upvotes": 2,
      "replies": {
        "h7quyip": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7quyip/",
          "text": "That's exactly along the lines of what I was thinking. And, I guess the \"lost\" feeling is inevitable in life, no matter the situation. We just gotta make lemonades out of the lemons we got. \n\nThank you sincerely for the advice. It means a lot.",
          "author": "fkagrunge",
          "created": 1628123310,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7pxcec": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7pxcec/",
      "text": "Take a gap year if you want. You don’t need to go to college immediately. That way you can save money and time to know if college or something else is right for you.",
      "author": "Fristi2147",
      "created": 1628108207,
      "upvotes": 4,
      "replies": {
        "h7qugal": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7qugal/",
          "text": "That's good advice!! I'll consider it <3 Thank youu",
          "author": "fkagrunge",
          "created": 1628123075,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7pmpnx": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7pmpnx/",
      "text": "I think most people feel like that a lot of the time. I mean, you go to school from preschool-12th grade. What's that, 14 years? You get jammed with all kinds of information. No time to reflect on what it means to you. In the upper grades there is little to no time spent on how \"subjects\" translate into \"jobs\". What a huge mega-void. Right through 12th grade what happens? Still on \"subject matter\" not on \"real world opportunities\". \n\nThen when you are done with hs you're expected to \"know\" what you want to do? What is it, magic? No. It's crazy. You have your head down all these years to be filled up and now it's \"heads up\" time? Nuts. It doesn't happen like that.\n\nI think maybe getting a part- time job can help you to know what you don't want to do and maybe what you might want to do. You need experiences. A measly paycheck is great incentive to find better and find out what you want. Cause you don't want to work for nothing, doing something you hate forever. It's like wearing shoes that are too tight. All.the.time.\n\nMaybe take some community college classes. Maybe look into technical school. Blue collar jobs pay well and you won't have to do it forever if you don't want to. Once you get a little money travel.\n\nLook into the Occupational Outlook Handbook. [https://www.bls.gov/ooh/](https://www.bls.gov/ooh/)   It has a lot of information like occupation bands, work conditions, growth, pay. It's a start. What subject did you like in school? Maybe start there.\n\nThe thing is, you have to look inside yourself now. We aren't really taught how to process all of that information that was thrown at us and apply it to ourselves. We don't know what suits us because we spent our lives with our heads being filled with information. At the end of that education is a chasm between knowledge we gained and principals of reflective application that was never discussed. \n\nAdd to that a pandemic that is up and down and messing with everyone. Yeah. Total stress. But you do have time. Be kind to yourself. You are young. Give yourself time to sort it out. You aren't alone. Not by a long shot.",
      "author": "bluejazzblue",
      "created": 1628103715,
      "upvotes": 13,
      "replies": {
        "h7queuh": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7queuh/",
          "text": "Formal education is just a capital agenda, readying you for the corporate world. You're right, I need to look within. I'm scared of my potential but I think I'm ready. Thank you for the comment, it truly helped!",
          "author": "fkagrunge",
          "created": 1628123056,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h7pdmrj": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7pdmrj/",
      "text": "If I were in your place and didn’t know what to do with myself, I wouldn’t go directly to college after HS, unless you have some sort of scholarship or aide or something, because that’s not something to pass up. \n\nI’d 100% recommend college, don’t get me wrong, but maybe part time community college while you work on creative projects and a part time job-job. Travel around as much as possible — even if it’s just weekend trips with friends, (assuming it’s safe, pandemic-wise)  see if you can get something going first. Practice making friends and connections outside of a “school” environment. \n\n\nLike, it may give you an idea of what kind of work you want, or what salary range you want or where you want to be. It’s 100% normal to not be sure of what you want to do with the rest of your life just out of Hs, and even if you were super-super sure, it’s just as normal to change your mind years down the line.",
      "author": "Feigned_Muay",
      "created": 1628099924,
      "upvotes": 2,
      "replies": {
        "h7qum8e": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7qum8e/",
          "text": "I was thinking of doing that!! I need more experience and an outlet to work. I'm more ready to work than spend my entire time at college. So, I might go this route! Thank you!",
          "author": "fkagrunge",
          "created": 1628123151,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h7pde3s": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7pde3s/",
      "text": "bro i'm fucking halfway through college and i still feel the same way. I went for a business degree because its pretty generic and applicable to any field but my parents are still hounding me about law school and grad school. I understand why but come on. Its not like I wanna sit around on my ass and end up as a homeless bum for the rest of my life and its not like I went for an english or history degree or something, why can't I just figure things out as I go along? I dont really feel any desire to be making six figures straight out of college slaving away at a job that doesn't interest me. my mom keeps on telling me that \"she sees in her vision for me\" that i'll be a doctor or lawyer and go to yale or something and it just bothers me every single time. and apparently shes a psychic because she says that she had a vision for herself and my older brother and they're being fulfilled. Why does everything need to be planned out. i dont get it",
      "author": "2019ForestHillsDrive",
      "created": 1628099821,
      "upvotes": 6,
      "replies": {
        "h7quabr": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7quabr/",
          "text": "I guess the solidarity in the experience makes it less scary. We make plans and it never fucking works out. That's the funny thing about life. Plans don't work out and yet we all sit down and make them and effectively make life hell for other people who don't wanna be a part of your plan. But, this brought me comfort so thank you!",
          "author": "fkagrunge",
          "created": 1628122995,
          "upvotes": 2,
          "replies": {
            "h7qx8gl": {
              "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7qx8gl/",
              "text": "The older you get the more you realize everybody is just making it up as they go along",
              "author": "2019ForestHillsDrive",
              "created": 1628124396,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h7oxium": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7oxium/",
      "text": "It's all part of the journey (growing up). I've been there and I know a lot of people who have, too. That's adolescence for you. It'll be okay, dude. Everything is super scary at first and it's unavoidable but you will be okay whether you think so right now or not. \n\nChange is scary, especially with all the uncertainty. A *ton* of people feel the same way you do right now. \n\nYou're on your way to college so you must be doing something right. Have a little faith in yourself. You got this",
      "author": "unholymanserpent",
      "created": 1628093377,
      "upvotes": 1,
      "replies": {
        "h7quis9": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7quis9/",
          "text": "It's comforting to know that no matter the odds, everything does turn out to be okay <3 Thank you for the reminder",
          "author": "fkagrunge",
          "created": 1628123107,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h7oueot": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7oueot/",
      "text": "I felt similar when I was 17/18.  Don't be afraid to try new things, travel (at least once Covid dies down again), try to talk to successful people and ask them about how they got where they are - and how they messed up along the way.  \n\nDon't feel pressured into a major - but when contemplating majors, think about what you can do with it (both typical and outside the box).  Don't be afraid to change your mind.\n\nGet jobs, internships, etc. in related fields.  I knew a guy that \"knew\" he wanted to be a lawyer in college. Graduated, hand an internship lined up and was taking the LSAT and applying to programs.  3 months into the internship, he realized he hated legal work.  He could have wasted more time and money, but the internship helped him figure it out. Now he's in Medical school and much happier.",
      "author": "BiochemBeer",
      "created": 1628092092,
      "upvotes": 14,
      "replies": {
        "h7qu3cl": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7qu3cl/",
          "text": "This is really good advice! Thank you so much. It truly means a lot to me that you, a stranger, took time out of your day to help me out. I was in a downward spiral. Thank you!",
          "author": "fkagrunge",
          "created": 1628122903,
          "upvotes": 3,
          "replies": {}
        },
        "h7p3o9v": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7p3o9v/",
          "text": "That’s really great advice",
          "author": "alinaha97",
          "created": 1628095870,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7osacu": {
      "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7osacu/",
      "text": "You are still young!! You do not have to know what you want in life yet, just take it slow",
      "author": "kenzieeeeeeee",
      "created": 1628091218,
      "upvotes": 21,
      "replies": {
        "h7qu053": {
          "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7qu053/",
          "text": "Thank you! I needed to hear that <3",
          "author": "fkagrunge",
          "created": 1628122861,
          "upvotes": 8,
          "replies": {
            "h7rjbel": {
              "link": "/r/CollegeRant/comments/oxuvu5/i_feel_so_fucking_lost/h7rjbel/",
              "text": "Understand that the real risk is not majoring in something that is \"impractical.\" The actual risk is majoring in something just to get a job you end up hating in 10 years.",
              "author": "big__cheddar",
              "created": 1628135429,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634061753
}