{
  "sid": "r513yn",
  "link": "/r/CollegeRant/comments/r513yn/advising/",
  "title:": "Advising",
  "text": "I can't believe I pay as exuberantly of a price that I do for this school when their advising actively stands in the way of students. I'm a joint political science and business major. Because of my business advisor's screwup, I had to take exclusively business classes for the last two semesters, affecting my GPA (3.04) because those are the classes that I'm not particularly good at. After two semesters of fighting with the advisors and eventually calling the assistant dean of the Business School, the advisors finally evaluated my political science transfer credit and told me what political science classes I should take for this semester. I've been taking political science classes and find them to be substantially easier than my business classes, given I have far more of a passion for the subject. \n\nMy school also has a plus one masters program for Political Science degrees, with a minimum requirement of a 3.0 GPA to apply. When I tried to apply through the business school, my advisors directly told me they have no idea how to apply me and that I'd have to talk to an advisors from our humanities college. I don't have an advisor there. It took two and a half MONTHS before I could speak to someone about this program. I had to coordinate transferring my \"home\" school to the humanities college because after I told the humanities advisor that the business school doesn't know how to apply me for this program, they said that was my only choice. Now, after the entire semester of trying to get this paperwork and logistics done with advisors who don't know what to do, and finally transferring to the Humanities college so they can put me in this program, the graduate director of the program has told me that my GPA \"is lower than expected when applying to this program\" and that because I am \"just starting my political science classes\", I'm not a good fit for the program. He won't let me apply because my GPA, which is over the REQUIRED MINIMUM, is in his opinion, too low. After months of coordinating this and the headaches of talking to two different colleges at once about this program.\n\nHate it here",
  "author": "NovWH",
  "created": 1638207618,
  "updated": 1638481014,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hmmw0yf": {
      "link": "/r/CollegeRant/comments/r513yn/advising/hmmw0yf/",
      "text": "Omg I felt your pain just by reading this post. I'm so sorry that this whole shit show happened to you 😔",
      "author": "WilieFern",
      "created": 1638254979,
      "upvotes": 1,
      "replies": {}
    },
    "hmr53wy": {
      "link": "/r/CollegeRant/comments/r513yn/advising/hmr53wy/",
      "text": "this happened to my suite mate, bad professor and she had to transfer both math classes back to our school. I believe her parents made her drop poly sci and keep business then made her live at home and drive the days to class from home during a 5th year. She only had 2 classes each semester.\n\nShe ghosted me and another friend (or made it impossible to see her) over I suspect she blamed or a % blamed the gpa on me and the friend.\n\n(scream at me) I would take a 5th year and take some easy classes to cushion the gpa a bit. also depending on the workload it cannot be done.\n\nsame school, another situation with me. they wanted me to take 3 history classes in 1 semester to graduate, in the 3 was my capstone to graduate a semester late not the full year.\n\nin the extra semester I got a ba and 2 minors.\n\nnow I am 3 years later (1 year in) working on missing classes (post bacc) for my MBA and MS in information science",
      "author": "enoughstreet",
      "created": 1638330558,
      "upvotes": 1,
      "replies": {}
    }
  }
}