{
  "sid": "r2glq1",
  "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/",
  "title:": "When professors warn you to start a project months ahead of time, nobody actually....really does that, right?",
  "text": "i have a big-ass research-y powerpoint due in a week. i'm just now getting my head around the rubric and what's required of me; starting to brainstorm my topic and various sources i could check out\n\nnobody actually starts shit in september for something due in december, right?\n\n~~~\n\nalso this dude posted examples - one very thorough one that got a C for being too light, then an insanely thorough one that was deemed adequate enough for an A. fuckin ell m8\n\nedit: this wasn't really intended to be a jerk off thread about why you're a good student. commiseration pls",
  "author": "spacewalk__",
  "created": 1637907481,
  "updated": 1639872421,
  "over_18": false,
  "upvotes": 177,
  "upvote_ratio": 0.93,
  "comments": {
    "hm4y5xm": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm4y5xm/",
      "text": "I probably would. By the end of the semester and near the holidays my brain gets fried.",
      "author": "kizeltine",
      "created": 1637917635,
      "upvotes": 91,
      "replies": {}
    },
    "hm56oe5": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm56oe5/",
      "text": "I might not get anything substantive done, but I'll look at what they want to be done, start thinking of how I'm gonna approach it, those things that take time to brew",
      "author": "StarvinPig",
      "created": 1637925041,
      "upvotes": 64,
      "replies": {}
    },
    "hm5o7zw": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm5o7zw/",
      "text": "I do. But I'm a grad student. I probably wouldn't have when I was an undergrad.\n\nMy two cents is that life is easier if you don't procrastinate. You might be able to get away with it, but it's fucking stressful. doing a little bit here and there right from the start makes it a much more stress free experience.",
      "author": "HumanDrinkingTea",
      "created": 1637936951,
      "upvotes": 40,
      "replies": {}
    },
    "hm5cggk": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm5cggk/",
      "text": "I actually do. That way, I have more free time afterwards. Do early and you won't have to worry, as I always say!",
      "author": "HJSDGCE",
      "created": 1637929751,
      "upvotes": 16,
      "replies": {}
    },
    "hm4qvci": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm4qvci/",
      "text": "If it's a big project then it will be graded as such. If you can wing it then hood luck. But the professor is clearly looking for thoughtful quality in this. My capstone took months and we all started early, and my initial idea didn't pan out. I still had 2 months to get something together and it worked out. You may not have that. God be with you.",
      "author": "TJkiwi",
      "created": 1637911901,
      "upvotes": 27,
      "replies": {}
    },
    "hm5h74j": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm5h74j/",
      "text": "bro... you're supposed to at least check the examples and requirements when it's given so you have an idea of the time commitment before procrastinating within reason",
      "author": "gilgameshen",
      "created": 1637932941,
      "upvotes": 26,
      "replies": {}
    },
    "hm5aqct": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm5aqct/",
      "text": "If I’m given requirements I’ll work on it as soon as I have the information. I’ll research usually a few articles a day, then outline/idea map, more research, then start writing. I’m not perfect about it but I try to be on top of my assignments.",
      "author": "BlueOcean7987",
      "created": 1637928439,
      "upvotes": 8,
      "replies": {}
    },
    "hm5zp68": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm5zp68/",
      "text": "I do! The first thing I do when I get a big assignment is create a schedule for when I want to have it done. I know myself and know I procrastinate like fuck so I try and have it done like two weeks before the deadline (so I end up getting it done on time)",
      "author": "HighlyPolitical16",
      "created": 1637942551,
      "upvotes": 6,
      "replies": {}
    },
    "hm7eahj": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm7eahj/",
      "text": "I graduated college and nearly all huge projects were started at an uncomfortably late time. Two exceptions were huge group projects. I have adhd (unmedicated) so I tend to procrastinate",
      "author": "Important_Ad7070",
      "created": 1637965690,
      "upvotes": 5,
      "replies": {}
    },
    "hm5r4xw": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm5r4xw/",
      "text": "Well. I don't exist. I am the kind that ask for precision on big research project two months in advance. I want to have the time to know my subject and do quality research. If it is due in three months, there is a reason. It is very hard to achieve what is asked in a limited time.",
      "author": "the-morphology-queen",
      "created": 1637938473,
      "upvotes": 3,
      "replies": {}
    },
    "hm60zq6": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm60zq6/",
      "text": "Whatever you can do to make tomorrow shorter, your future self will be grateful",
      "author": "Sufficient-Fun-1619",
      "created": 1637943137,
      "upvotes": 3,
      "replies": {}
    },
    "hm76cup": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm76cup/",
      "text": "I didn't. I wouldn't wait until the last week, but I also never really struggled with research projects. Somehow I always got good grades.\n\nIf you know what you are capable of, you do you!",
      "author": "DrAlawyn",
      "created": 1637961983,
      "upvotes": 3,
      "replies": {}
    },
    "hm7getz": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm7getz/",
      "text": "Always create project or paper outlines even if the assignment isn't due until the middle or end of the term.",
      "author": "yashunnyqueen",
      "created": 1637966703,
      "upvotes": 3,
      "replies": {}
    },
    "hm7mh6x": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm7mh6x/",
      "text": "I always did… kinda. got lots of references and sorted the report then I would procrastinate :D",
      "author": "ericaceae-",
      "created": 1637969629,
      "upvotes": 3,
      "replies": {}
    },
    "hm5tdp0": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm5tdp0/",
      "text": "Have fun!",
      "author": "seattleinfall",
      "created": 1637939586,
      "upvotes": 2,
      "replies": {}
    },
    "hm6ylg1": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm6ylg1/",
      "text": "I tried it a few times and got shitty grades so I stopped being so lazy. I suggest the same in the future; now that I’m a teacher it’s pretty obvious who puts work into their projects and who doesn’t.",
      "author": "ContributionInfamous",
      "created": 1637958370,
      "upvotes": 2,
      "replies": {}
    },
    "hm7edsx": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm7edsx/",
      "text": "I would have started it in September now. In undergrad I wouldn’t of taken it seriously and procrastinated and then busted ass trying to get it all done at the last minute when I realized how thorough the professor actually expected  it to be. If I had a time machine and could go back I would have put way more time and effort into my classes.",
      "author": "Brigantias",
      "created": 1637965735,
      "upvotes": 2,
      "replies": {}
    },
    "hm88uws": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm88uws/",
      "text": "Have you been checked for ADHD? \n\nA lot of times, we get called lazy and we procrastinate and then we end up in these situations where we knew that the professor wasn't bullshitting us... but we have to do 2 months worth of work in a week. It works for some people, but if it wasn't for my mental handicap I would never be in that situation.",
      "author": "Financeonly",
      "created": 1637980894,
      "upvotes": 2,
      "replies": {}
    },
    "hm8iyzt": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm8iyzt/",
      "text": "I absolutely do not, whatever is due next is what gets done next. Godspeed and good luck",
      "author": "wanderingsanzo",
      "created": 1637986239,
      "upvotes": 2,
      "replies": {}
    },
    "hm8u4op": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm8u4op/",
      "text": "I do everything last minute, even in grad school. No thoughts, just vibes.",
      "author": "yeet20feet",
      "created": 1637992838,
      "upvotes": 2,
      "replies": {}
    },
    "hm53s27": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm53s27/",
      "text": "In my experience, no, but my experience mostly comes from community college students (I only just got into my first semester at my 4 year). As one could guess, there's less effort on a lot of students' parts at community colleges.\n\nProfessors would literally email out extensions of a week or more on big projects like these because they'd get too many panicked emails, or they themselves needed time to catch up/wind down before tackling grading huge projects like these.\n\nI personally never start huge projects until last minute, 2 days if it isn't that big, 4-5 days if it's REALLY daunting to me. You're doing better than I would already.\n\nSincerely, a chronic procrastinator (take everything I say with a grain of salt).",
      "author": "sesiously",
      "created": 1637922490,
      "upvotes": 3,
      "replies": {}
    },
    "hm5ju8o": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm5ju8o/",
      "text": "Do what works for you! Me personally I do my best work under pressure the closer to the end I get the sharper my focus gets, I once read a 300 page book and typed out a 10 page paper over the weekend for a 400 level class and got an A but not everyone works that way and that is okay. Do what you feel is best you know yourself better than anyone.",
      "author": "Scorosin",
      "created": 1637934529,
      "upvotes": 4,
      "replies": {}
    },
    "hm62uyn": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm62uyn/",
      "text": "Listen to your prof, kid",
      "author": "updog_nothing_much",
      "created": 1637943975,
      "upvotes": 4,
      "replies": {}
    },
    "hm680yv": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm680yv/",
      "text": "I do my projects in order, one week in advance, no more, no less. And only will start zoom meetings with group mates within two weeks. And a max of 1 a week.",
      "author": "peepeepoopoobutler",
      "created": 1637946228,
      "upvotes": 3,
      "replies": {}
    },
    "hm6ctan": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm6ctan/",
      "text": "My capstone is essentially a semester-long project. If you didn’t start it when it was assigned, you’re pretty much boned. I wouldn’t recommend procrastinating on big assignments, you’re just making your own life harder.",
      "author": "bumblebeequeer",
      "created": 1637948336,
      "upvotes": 3,
      "replies": {}
    },
    "hm6uveb": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm6uveb/",
      "text": "Professor tells you to look at the syllabus and follow directions.   I’m confused on what you want out of this post?   You are told what is needed of you and you just don’t want to do it?",
      "author": "Kind_Humor_7569",
      "created": 1637956596,
      "upvotes": 2,
      "replies": {
        "hm7l34l": {
          "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm7l34l/",
          "text": "Yeah this one is hilarious to me, especially with the edit acknowledging Op is only here for commissiration (read:validation). One of the core things someone should be learning in undergrad is executive functioning, which includes managing a todo list and not having to be reminded every third day about the list of things to do that explicitly lays out the expectations and timetable... but I am regularly floored (as a returning student) by how much of this hand-holding goes on, and how many students are ready to jump to acting like having a deadline is a personal attack of some sort.",
          "author": "ItsAll42",
          "created": 1637968940,
          "upvotes": 2,
          "replies": {
            "hm7lfyy": {
              "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm7lfyy/",
              "text": "Thank George w. Bunch for this.    It’s literally. What leave no kids behind makes.",
              "author": "Kind_Humor_7569",
              "created": 1637969116,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hm6h4qw": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm6h4qw/",
      "text": "Well. You are taking one week versus twelve weeks. This reminds me of the famous saying/tattoo: life's a gamble.",
      "author": "katCEO",
      "created": 1637950246,
      "upvotes": 0,
      "replies": {}
    },
    "hm7iudp": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm7iudp/",
      "text": "I do. Maybe not this semester but usually I’ll complete a big project a week or two after it was assigned. This semester though is horrible so yeah… I did an 8 page paper a week and a half before it was due… still have another paper that I need 2 more pages to do due in a week.",
      "author": "CritterCratter",
      "created": 1637967866,
      "upvotes": 1,
      "replies": {}
    },
    "hm890yl": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm890yl/",
      "text": "I always did.",
      "author": "orangeblackteal",
      "created": 1637980979,
      "upvotes": 1,
      "replies": {}
    },
    "hm8jfib": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm8jfib/",
      "text": "Yeah no I never start early. I usually get things rolling around the time prof randomly says “for those of you who haven’t started yet, youre behind…”",
      "author": "airbear13",
      "created": 1637986495,
      "upvotes": 1,
      "replies": {}
    },
    "hmact86": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hmact86/",
      "text": "No. Plenty of A-students do just that. And it’s obvious, they start early and they finish before the deadline too. And their work is of higher quality than the rest.",
      "author": "MyHeartIsByTheOcean",
      "created": 1638029958,
      "upvotes": 1,
      "replies": {}
    },
    "hm6tnki": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm6tnki/",
      "text": "I sure don’t. I don’t know what all these other people are talking about. I laugh to myself in my head when the professor says something about starting a project months in advance. I always do well anyway.",
      "author": "artificial_cow",
      "created": 1637956029,
      "upvotes": -1,
      "replies": {
        "hm7zk2j": {
          "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm7zk2j/",
          "text": "But wouldnt you rather get it out of the way? You dont ever stress or get anxiety about a due date approaching for something youve put 0 work into so far? I dont get what theres to laugh about, a ton of people struggle with procrastination and *dont* do well when they put it to the last minute. Some people have to told \"start this now\" in order for them to actually do it and do it well.",
          "author": "taybay462",
          "created": 1637976199,
          "upvotes": 1,
          "replies": {
            "hm8064j": {
              "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hm8064j/",
              "text": "Yeah, I do stress about it when the date is near but I do work pretty well under pressure. I am one of those people that struggle with procrastination. By laughing, I mean I laugh to myself because I know I would never actually start it early although I would like to. Not laughing about people who don’t do well.",
              "author": "artificial_cow",
              "created": 1637976513,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmmlsy5": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hmmlsy5/",
      "text": "Most people don’t. I never do. I usually always say to myself that “what I can do right now I will do twice as fast the day before under a lot of stress. may as well go have fun or relax and do smaller assignments until then.” \n\nfor the most part, that mentality works. but if the assignment is something fucking evil, then it’s worth at least reviewing the content, making some notes, and getting an outline ready for when the submission day comes and you’re down for the count",
      "author": "breadinhaler",
      "created": 1638248579,
      "upvotes": 2,
      "replies": {}
    },
    "hmplbv2": {
      "link": "/r/CollegeRant/comments/r2glq1/when_professors_warn_you_to_start_a_project/hmplbv2/",
      "text": "Lol I have six days to write ten pages I should've have prepared for months ago on a subject I only vaguely know. I didn't start it months ago because genetics was kicking my ass up and down. Like it would be beneficial to have started in September, but who tf has time . Not me.",
      "author": "JessicaPopplewell49",
      "created": 1638306167,
      "upvotes": 1,
      "replies": {}
    }
  }
}