{
  "sid": "o74718",
  "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/",
  "title:": "Transfer from 4 year to 2 year, then back to another 4 year?",
  "text": "I applied to GA Tech with the Talent Initiative Pathway and got denied admission after going through a year of bad mental health while taking online courses. I am currently attending Syracuse, and I want to try to apply to GA Tech again in for the spring or even next fall. But with my GPA currently at a 2.99, I don’t think I’ll be able to compete when the average GPA for transfer applicants is a 3.8. \n\nEven if I were to get straight As for the next semester or two at SU, the raise won’t be significant enough. This might sound really dumb, but instead of staying at SU, I was thinking about transferring to GSU Perimeter College (2-year, REPP partnered with GA Tech) to reset my GPA so that it’s easier for me to aim for that 3.8 GPA. What do you think?",
  "author": "RALPHY88_",
  "created": 1624551447,
  "over_18": false,
  "upvotes": 53,
  "upvote_ratio": 0.98,
  "comments": {
    "h2zm835": {
      "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/h2zm835/",
      "text": "PSA for others in the north half of Georgia, this is a great reason to *start* with places like Georgia Highlands College (another accredited USG school). Get your first year or two done at 1/4 the cost with small class sizes and closer relationships with faculty. Start at small schools, build a track record of success, THEN transfer completed areas of classes and finish and get your diploma from Tech, State, etc.",
      "author": "OtiksSpicedPotatoes",
      "created": 1624624800,
      "upvotes": 1,
      "replies": {}
    },
    "h2ygpdk": {
      "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/h2ygpdk/",
      "text": "I did exactly this. I started at GSU, went to west georgia technical college for a semester then transferred to uni of west ga. My gpa did reset at UWG but not for the technical college.",
      "author": "kenziechurch",
      "created": 1624592056,
      "upvotes": 1,
      "replies": {}
    },
    "h2xvw89": {
      "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/h2xvw89/",
      "text": "i will say, transferring colleges is different than high school to college. GPA isn’t as important because colleges understand you’re taking a college course load which is inherently harder than high school. i transferred to a school i never would’ve gotten into straight out of high school.",
      "author": "analieserae",
      "created": 1624580833,
      "upvotes": 1,
      "replies": {}
    },
    "h2xjjjz": {
      "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/h2xjjjz/",
      "text": "i’m in-state and my friends and family go to GT. GSU’s coursework is literally a cakewalk compared to GT’s, so be prepared to work a lot harder. besides GPA, do you have any relevant experiences, like internships? i believe those are also taken into consideration. even if you did the GSU-GT pathway, they will require your past transcript from SU and will factor your previous coursework and grades. those don’t disappear.\n\nanyway, i would highly suggest staying at SU. after building your resume, apply to GT for grad school. it’s not worth incurring debt. transfer students hardly get any financial support, especially OOS. if you were in-state with Zell or Hope scholarship, that would be a different story.",
      "author": "kaytherine",
      "created": 1624570223,
      "upvotes": 5,
      "replies": {
        "h2xr0c4": {
          "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/h2xr0c4/",
          "text": "Syracuse is about 75-80k a year and not a lot of scholarships are given. Probably be about the same debt wise which sucks but it’s life.",
          "author": "Expensive_Mushroom1",
          "created": 1624578173,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h2wpn37": {
      "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/h2wpn37/",
      "text": "Why not just finish at Syracuse? Otherwise, you may be stuck retaking courses to make them eligible for transfer. Seems like a waste of time and money.",
      "author": "SwiftCEO",
      "created": 1624556359,
      "upvotes": 35,
      "replies": {
        "h2wqcbc": {
          "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/h2wqcbc/",
          "text": "I’m a Computer Engineering major, and Georgia Tech basically has a much bigger engineering school and most likely more internship opportunities. As I mentioned before, my mental health sucked during first semester and it really held me back.",
          "author": "RALPHY88_",
          "created": 1624556664,
          "upvotes": 10,
          "replies": {
            "h2ws50d": {
              "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/h2ws50d/",
              "text": "Have you made the necessary changes to ensure that you'll be successful at GSU Perimeter? \n\nWould your GPA actually reset? I had to give a complete transcript every time I applied to transfer out of my CC.  I'm not sure GA Tech would simply write off the semester you bombed.",
              "author": "SwiftCEO",
              "created": 1624557456,
              "upvotes": 9,
              "replies": {}
            },
            "h2wtuv4": {
              "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/h2wtuv4/",
              "text": "Just raise your gpa at Syracuse and go to grad school at Georgia tech, you’ll still need to send in all your transcripts",
              "author": "tryingyourbest",
              "created": 1624558216,
              "upvotes": 8,
              "replies": {}
            },
            "h2xbz8m": {
              "link": "/r/CollegeRant/comments/o74718/transfer_from_4_year_to_2_year_then_back_to/h2xbz8m/",
              "text": "Syracuse has a great alumni base. Try to go to career services and get them to hook you up with someone. Even if you have an awful GPA they’ll still help you out with an internship.",
              "author": "Expensive_Mushroom1",
              "created": 1624566387,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634064471
}