{
  "sid": "rger2d",
  "link": "/r/CollegeRant/comments/rger2d/exam_cheating/",
  "title:": "Exam cheating",
  "text": "Ok this is not the promotion of cheating on exams, and I'm strongly against doing that, but if you're gonna cheat do it right. I was taking my final exam and we were in the middle of a quiet classroom and all of the sudden someone's phone blasts out question #1 over its speakers. I don't think I've ever held in a laugh that hard. I'm assuming they were using Quizlet as there is a read-aloud option. Surprisingly the professor didn't do anything to my classmate and allowed us to keep going.",
  "author": "8BitTxchniques",
  "created": 1639508958,
  "updated": 1639870082,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hojytow": {
      "link": "/r/CollegeRant/comments/rger2d/exam_cheating/hojytow/",
      "text": "Back when everything was online because of covid I took a calculus test in zoom with all of the other students in my class. It was a little stressful even though our cameras weren’t on since it’s not my best subject.\n\nAll of a sudden I start hearing two of my classmates asking each other what answers they got for some of their questions and suddenly the professor snapped and told them to turn in their tests right away.\n\nNext test we had all of us were required to be on camera",
      "author": "Rickrolled767",
      "created": 1639513049,
      "upvotes": 4,
      "replies": {
        "hoki8wn": {
          "link": "/r/CollegeRant/comments/rger2d/exam_cheating/hoki8wn/",
          "text": "I had a similar situation happen last year when a student had her mic unmuted during the exam and we all heard her talking to her roommate: \"I'm just going to look at the Quizlet for the answers, can you hold up the phone above my laptop for me?\"",
          "author": "FerThePro",
          "created": 1639520974,
          "upvotes": 51,
          "replies": {
            "hokk5j2": {
              "link": "/r/CollegeRant/comments/rger2d/exam_cheating/hokk5j2/",
              "text": "What an oh shit moment.",
              "author": "smpricepdx",
              "created": 1639521779,
              "upvotes": 32,
              "replies": {}
            }
          }
        }
      }
    },
    "hokqmky": {
      "link": "/r/CollegeRant/comments/rger2d/exam_cheating/hokqmky/",
      "text": "No like literally. Once two students in my online chem class were messaging each other ON ZOOM THE ANSWERS. Like are y’all dumb?! At least use something else what the hell the prof can see zoom chats 😭. Lol they got dropped from the class and the professor said the following week if you’re gonna cheat at least don’t be blatantly stupid about it. 😭",
      "author": "ttyltyler",
      "created": 1639524598,
      "upvotes": 52,
      "replies": {
        "hombih3": {
          "link": "/r/CollegeRant/comments/rger2d/exam_cheating/hombih3/",
          "text": "Lol 😂 😬",
          "author": "AngerChibi",
          "created": 1639553902,
          "upvotes": 1,
          "replies": {}
        },
        "hoqvp45": {
          "link": "/r/CollegeRant/comments/rger2d/exam_cheating/hoqvp45/",
          "text": "those students usually badmouth the professor during lecture, as though the professor can't see or save the zoom chat *while they're recording the lecture*.\n\nwell, assuming they attend the live lecture instead of watching video",
          "author": "wobbletelescope",
          "created": 1639632785,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hon71lj": {
      "link": "/r/CollegeRant/comments/rger2d/exam_cheating/hon71lj/",
      "text": "I need to know all the got caught stories from covid. Right now 💀💀💀💀",
      "author": "Cu4urthoughts",
      "created": 1639576474,
      "upvotes": 11,
      "replies": {}
    },
    "hone8ni": {
      "link": "/r/CollegeRant/comments/rger2d/exam_cheating/hone8ni/",
      "text": "I had a kid in my calc 1 final two years ago that played outloud the exact video with the same narrator we all had been hearing all semester that would explain to us how to solve questions step by step. He blared the sound outloud on zoom and the professor was too senile to understand what was going on and thought he had a question.",
      "author": "KIDPESOO",
      "created": 1639579810,
      "upvotes": 7,
      "replies": {}
    },
    "hoo56ey": {
      "link": "/r/CollegeRant/comments/rger2d/exam_cheating/hoo56ey/",
      "text": "I was taking an intro to finance course years ago- a pre req in the business school- so you’d get a lot of people just trying to get their C and not actually interested in the subject.\n\nI always assumed the people who always got up to use the restroom during the test were cheating. But during the final the same guy who asked “so it’s a 10 point curve right? So if I get a D in the class I’ll wind up with a C?” Also had his phone go off with what sounded like Siri going over the topics of the exam. Not once. But twice!\n\nThe first time the teacher ignored it, but the second he kind of had this uncomfortable smile on his face and asked what it was. The student said he had been studying on his phone beforehand and it just accidentally went off… twice. The teacher didn’t say anything more. The teacher was such a sweet awkward guy.\n\nWhen class was over the student asked talk to the teacher outside. I would have loved to have listened in on that convo!",
      "author": "cozyintherocket53",
      "created": 1639590516,
      "upvotes": 5,
      "replies": {}
    },
    "honihem": {
      "link": "/r/CollegeRant/comments/rger2d/exam_cheating/honihem/",
      "text": "It's such an arms race. Students try to find better ways to cheat, then instructors have to come up with more invasive means to prevent the cheating.",
      "author": "physgm",
      "created": 1639581634,
      "upvotes": 3,
      "replies": {}
    },
    "honssdk": {
      "link": "/r/CollegeRant/comments/rger2d/exam_cheating/honssdk/",
      "text": "I always assume cheating is rampant because the ones I catch are always so fucking dumb about it. Either doing a cut and paste where the fonts change for the copied part, or copying an obvious source, or having the exact same awkward wording as three other people in the class, or copying answers from another test that had different questions.",
      "author": "Donald_J_Putin",
      "created": 1639585700,
      "upvotes": 3,
      "replies": {}
    }
  }
}