{
  "sid": "rcu7jn",
  "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/",
  "title:": "\"Grading is very subjective\" Professor",
  "text": "You go to r/Professors and it's a lot of teachers complaining about grade grubbing when there the ones (or in some cases graders who are most of the time worse) who gave the grade. The whole idea that someone \"earns\" a grade and it's not an arbitrary set of hoops students jump through that change at any given time is just wrong. The only one who gives a grade isn't the student it's the professor and they should definitely be held accountable more often.",
  "author": "DizzyMajor5",
  "created": 1639092289,
  "updated": 1639517930,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.38,
  "comments": {
    "hnxlwkw": {
      "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/hnxlwkw/",
      "text": "It sounds like you’re frustrated. I get that there are issues with how grading is done. It certainly can feel arbitrary, especially when you’re less than a point away from the next grade up, and the difference in an entire letter grade is a tiny space.\n\nHow would you see grading happening so that you feel it’s more fair? If exams, rubrics, and such aren’t it, how can we assess students’ competency with the courses they’re taking and the subjects they’re pursuing (whether by choice or necessity)? Are all assignments just a series of arbitrary hoops? Also, how often do professors change goalposts on you during the course of an assignment? That last part isn’t cool - there shouldn’t be modifications to how something is graded vs what the rubric or other grading instrument says unless it’s absolutely necessary, and it shouldn’t be to the detriment of the student if that does happen.\n\nI don’t ask these questions to argue with you. I just want to understand your perspective a bit better.",
      "author": "PhDapper",
      "created": 1639102189,
      "upvotes": 4,
      "replies": {
        "hnxrs4e": {
          "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/hnxrs4e/",
          "text": "I'm not the op, but I would like to share my perspective- if you'll hear me out. \n\nGrading to me in college feels far to focused on exams, and quizzes. I think that is an incredibly ineffective way to test how competent a student is(or groups of students) in regards to whatever they are required to learn. I prefer classes that have more emphasis on homework , and lab experience versus classes that are primarily focused on exams as a way of testing competency.",
          "author": "Rich-Cryptographer-7",
          "created": 1639104746,
          "upvotes": 2,
          "replies": {
            "hnxss96": {
              "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/hnxss96/",
              "text": "I get that. I actually agree when we are talking about more advanced work (i.e., exams are good for ensuring that folks know the fundamentals, whereas applied work tends to be better once the fundamentals are mastered). For example, I would much rather give a series of problem-based projects to assess learning. The issue with those, though, is that someone could say that projects and such are graded too subjectively. That's why we usually have clear and granular rubrics - they allow for an objective as possible evaluation - but there is still the perception that subjectivity is involved, which leads to folks like OP saying that grades are not actually earned. So, what is the right way to address that so that grading reflects the student's mastery rather than a perceived bias on the part of the professor?",
              "author": "PhDapper",
              "created": 1639105191,
              "upvotes": 3,
              "replies": {
                "hny0gw5": {
                  "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/hny0gw5/",
                  "text": ">So, what is the right way to address that so that grading reflects the student's mastery rather than a perceived bias on the part of the professor?\n\nThat is the problem -there is no right way to approach that. The best would be to have some sort of problem based project/exam with a linear rubric that outlines specifically what you need to study and what to expect on an exam. However, I personally don't think any sort of exam is an effective way of learning and RETAINING info- as the human brain can only store/recall so much info at certain times. \n\nFurthermore, you toss professors bias into the mix, and grade results can be skewed accordingly  depending on how much a professor like you. I've had it happen before.",
                  "author": "Rich-Cryptographer-7",
                  "created": 1639108648,
                  "upvotes": 2,
                  "replies": {}
                },
                "hny1heq": {
                  "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/hny1heq/",
                  "text": "I think the best way to make it not subjective is to create a program that grades it for you based on the outputs of the assignment. I've seen many professors do it that way and it works. It's the only way to insure it's not subjective. \"Are all assignments just a series of arbitrary hoops\" many are. There's so many examples of professors changing grades based on things outside of anyone's control that to say it's entirely on the student and not a 2 way street to me would be wrong and it's hard to see students beating themselves up over something that isn't entirely in there control. Also, I'm not frustrated just about to graduate happy as can be.",
                  "author": "DizzyMajor5",
                  "created": 1639109124,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hnx2sit": {
      "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/hnx2sit/",
      "text": "So funny enough, I went to that subreddit and the first top post I saw was this: https://www.reddit.com/r/Professors/comments/rcrrnw/a_new_level_of_grade_grubbing_that_legit_made_me/?utm_source=share&utm_medium=ios_app&utm_name=iossmf. This is sort of different from what you’re referring to though, but I think it’s just a coincidence.",
      "author": "ranych",
      "created": 1639093614,
      "upvotes": 3,
      "replies": {
        "hnx3b42": {
          "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/hnx3b42/",
          "text": "Lol it's probably just me with a burner account trying to prove a point. That's a joke reddit mods.",
          "author": "DizzyMajor5",
          "created": 1639093840,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hnxbxid": {
      "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/hnxbxid/",
      "text": "Yeah that sub is ... something LOL. I go in there from time to time to read the comments, and I think to myself \"yeah, I think working in higher education def. attracts a lot of narcissists who wouldn't make it in the industry because of their narcism.\" \n\nLOL (and makes me thankful that 99% of my Profs have been amazing and deserve the world) Tbh, I feel like the ven diagram of Profs who use that sub and Profs who are assholes, is a whole fucking circle LOL. Tbh if I was a Professor, I wouldn't use ANY social media platform for venting because I would feel absolutely awful if a student came across a negative post/comment that I wrote about them. I think it's so gross, too, when there's a detailed post about a student's behavior. Like, don't any of y'all have friends or partners or a therapist or coworkers (in person) to vent to about it?? Not an entire reddit board, like, what if some 19 year old student came upon that post and found it out was about them. I'm an older student/non traditional student, so idk, I have a lot of empathy for students of the more traditional age, (18-25) -- ya'll are still learning about life and making mistakes and that's okay. And trying to go to university/college in the current world climate is so stressful, idk how ya'll do it -- I'm in my 30s and barely hanging on LOL, and my partner and I are financial stable (whereas most traditional college students are NOT financially stable & that adds hella stress) Anyway tl;dr there's too many assholes working in higher education, who don't understand the stress that the generation of current students are under.",
      "author": "ronwheezy87",
      "created": 1639097709,
      "upvotes": 2,
      "replies": {
        "hnxncwe": {
          "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/hnxncwe/",
          "text": "That sub has a seriously bitter undercurrent, and I kind of don't blame them for it.",
          "author": "lkmk",
          "created": 1639102837,
          "upvotes": 2,
          "replies": {
            "ho01t2g": {
              "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/ho01t2g/",
              "text": "That is the selection bias at work. Professors who are upset with their work are more likely to go online and vent about it. Those who are having a good time aren't looking for a platform to discuss their job.",
              "author": "hdorsettcase",
              "created": 1639152677,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hnxj250": {
          "link": "/r/CollegeRant/comments/rcu7jn/grading_is_very_subjective_professor/hnxj250/",
          "text": "Definitely agree for a lot of these kids they're barely making it financially and they  read these profs talking about how they're all grade grubbers and don't call the by there \"title\" it's gotta be brutal for kids just starting up these days.",
          "author": "DizzyMajor5",
          "created": 1639100932,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}