{
  "sid": "qhqgye",
  "link": "/r/CollegeRant/comments/qhqgye/regret_taking_a_course/",
  "title:": "Regret taking a course",
  "text": "I am so close to finishing school, but I had to take an elective this term. I chose to take a religious studies course since I’ve taken one before and I actually enjoyed it.The first week came by and the amount of work in this course was way too much and I instantly was turned away from the subject. It’s too late to drop it, so I’m just trying to get through it. I’ve also maintained a 4.1 gpa while in college, but I have a feeling this class is going to take me way down and I may or may not pass the course. I’m frustrated but also I’m extremely burnt out so at times I could really care less (I actually do care, but I can’t afford to stress myself out right now). Anyway, thanks for letting me vent.\n\nAny advice or words of encouragement? I am definitely taking a break once I graduate in summer.",
  "author": "TheRestIs_Confetti",
  "created": 1635437594,
  "updated": 1636191641,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "higogub": {
      "link": "/r/CollegeRant/comments/qhqgye/regret_taking_a_course/higogub/",
      "text": "I do have a couple questions: What kind of work do they have you doing in that course, and what program are you in that's less work in comparison?",
      "author": "TheMensaGuy1",
      "created": 1635474013,
      "upvotes": 2,
      "replies": {
        "higxpoe": {
          "link": "/r/CollegeRant/comments/qhqgye/regret_taking_a_course/higxpoe/",
          "text": "Psychology Program. I’ve taken a lot of “difficult” courses and still managed to pass with an A which I’m proud of since it keeps my GPA up. Most of my stats or advanced financing courses have been extremely hard. And not all psychology courses are technically easy. At the moment I’m taking a psych course (1 post a week, a quiz a week, and 3 projects in this term).\n\nI had a professor who gave us a 215 page syllabus before who was also demanding, but I still enjoyed the class. This one wants 3-4 essays a week and 2 projects. Each item has to be labeled specifically and I don’t mean like APA or MLA, he wants each assignment to follow certain guidelines. The essays are all on different articles or pages in the book and each one has to be written with the intent of explaining something new learned through the reading, something new that was understood, something we relate to, or something we did not understand. Which all sounds easy, but you have to incorporate certain content (he gave us all a pdf of sample papers). \n\nI had to ask for permission to write about a topic for a big project and I lost a point on the question even though it was accepted. The project also should’ve been easy but he had us use only 2 sources to gather our evidence from which also would’ve been fine if I picked a religion that was of a much larger community, I definitely did not. And in my case, I would’ve appreciated it more if he said the sources were optional because I found close to nothing on the religion I chose since it only refers to 0.5% of the US population and there’s barely any information  or other data on those two sources for the project. \n\nThe course should be easy, but he’s very strict. He’s a good person but a tough professor, I have emailed him a few times and he’s nice. I have a 50% in the class right now and I’m trying not to stress out about it right now.",
          "author": "TheRestIs_Confetti",
          "created": 1635478449,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}