{
  "sid": "rgg3zg",
  "link": "/r/CollegeRant/comments/rgg3zg/my_professor_gave_me_a_fifty_percent_grade_on_my/",
  "title:": "My Professor Gave Me A Fifty Percent Grade On My Essay Proposal. I’m Going To Scream.",
  "text": "My Professor Basically Failed My Final Essay Proposal\n\nHello everyone, I hope your final days of class are going well during finals week. I wish I could say the same for myself, but as the title implies, I'm screwed. I will use this post as a rant to get my feelings in order before finishing my final, so pardon me. \n\nI KEEP FUCKING UP MY ESSAY’S AND I DON'T KNOW WHY!\n\nEvery essay I write has barely passed the minimum requirement for this class. I'm trying to meet the standard that my professor is asking for. I'm honestly fucking trying, but it isn't enough. Either my thesis statements are not actual thesis statements because they aren't “claims,” or I’m not making any factual statements in my body paragraphs. \n\nWhen I make claims, they are either not delved into enough, or I haven't provided adequate evidence for the material. I've asked her what she wanted to see to get concrete examples, but even afterwards, I still fail. I'm fed up with this. \n\nI finally mustered up the courage to look at my Essay Proposal grade, and she barely passed me. Again. I'm so disheartened about my final. Failure is the only fucking end route for me at this point.",
  "author": "ClayMonkey1999",
  "created": 1639512674,
  "updated": 1639517847,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hok2kyw": {
      "link": "/r/CollegeRant/comments/rgg3zg/my_professor_gave_me_a_fifty_percent_grade_on_my/hok2kyw/",
      "text": "That must me frustrating, i bet most of us at some point struggled with school work or still are. Have you tried studying with someone you share the course with? Maybe having a study partner will make things abit easier and have a better perspective. I hope you find a way to make everything better. Sorry for that though.",
      "author": "Essayfairy",
      "created": 1639514533,
      "upvotes": 1,
      "replies": {}
    },
    "hok64a0": {
      "link": "/r/CollegeRant/comments/rgg3zg/my_professor_gave_me_a_fifty_percent_grade_on_my/hok64a0/",
      "text": "Have you ever gone to tutoring to help you write a paper? Have you gone to the professor's open office hours? Have someone read over your stuff",
      "author": "TimmyTurner7986",
      "created": 1639515975,
      "upvotes": 1,
      "replies": {}
    }
  }
}