{
  "sid": "nxf9fa",
  "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/",
  "title:": "Everything feels against you In college",
  "text": "College isn't what u expected at all, the professors most of them can't explain anything or just don't care enough to explain, they keep throwing out just pages and pages of information and expect us to memorize everything.\n\nIf they are late at finishing it means we will just get 2 lectures at once or just we study it ourselves, a professor just gave us 2 lectures and just gave us the material for the rest of the subject and left and didn't explain anything.\n\nOr other professors who brag about how hard their subject is and how many fail, good job you suck at your job and you are a peice of shit.\n\nI am rly angry that these people get paid for doing nothing, they don't give a shit about teaching or making people understand the subjects and then brag about how shitty they r at teaching.\n\nTL;DR: I am angry that there is professors who don't do anything useful and get paid for doing nothing and then brag about how much they suck at their job and how much people suffer and hate the subjects because of them.",
  "author": "shifer231",
  "created": 1623415916,
  "over_18": false,
  "upvotes": 230,
  "upvote_ratio": 0.95,
  "comments": {
    "h1s3pmn": {
      "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1s3pmn/",
      "text": "You’ll have a mixed bag of professors during your time as a college student. What I find helps is to look into classes/professors before you sign up for them using websites such as RateMyProfessor and ask around to see if anyone you know from your school might have useful info as well. You’ve got this!",
      "author": "FatalHorizen518",
      "created": 1623708069,
      "upvotes": 1,
      "replies": {}
    },
    "h1gft2n": {
      "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1gft2n/",
      "text": "I've said this a million times here before: Good teaching is not incentivized by current academia. Research output is the means by which professors advance. That means there will be many cases of sacrificing teaching for research. I'd bet 90% of students complaints about professor aloofness is due to this systemic structure. Individual professors are the symptom. The cause is the incentive structure.",
      "author": "big__cheddar",
      "created": 1623450687,
      "upvotes": 3,
      "replies": {
        "h1gg9ah": {
          "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1gg9ah/",
          "text": "I know research are very important for professors but it isn't an excuse.",
          "author": "shifer231",
          "created": 1623450920,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h1fmex4": {
      "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1fmex4/",
      "text": "Yesterday I had a professor post a group assignment with ~30 hours notice before it was due. Obviously coordinating 5 people’s schedules as well as finding time to actually do the assignment with that short of notice is difficult, and I work 12 hour shifts on Fridays. I asked if we could please have 48 hours notice before assignments are due because I and other students work and he told me that holding a job and taking his class at the same time was ‘unwise to say the least’. Lots of professors genuinely do not care about you and are so far out of touch, it’s insane. I’m taking this as a summer class at a community college too, I’d say the majority of students at CCs have to work to support themselves.",
      "author": "heartandliver",
      "created": 1623437109,
      "upvotes": 4,
      "replies": {
        "h1gbvq6": {
          "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1gbvq6/",
          "text": "I had a teacher like that last semester and one like that this semester. The stark difference between them and the teachers that release their modules at the same time every week is crazy.",
          "author": "Crochitting",
          "created": 1623448664,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h1f796u": {
      "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1f796u/",
      "text": "Tbh, and I say this is a student with SEVERE chronic mental illnesses who is on their last year of college, I feel like college really just exists to gatekeep certain people (i.e. those w/ mental illnesses, women, trans students, Black students etc) out of a career path and to keep those career paths full of only white men. \n\nI wish the USA would invest more in technical schools and programs. I'm a chem major and tbh like 90% of the stuff I learned, won't be applicable for me in the \"real\" world. I would have loved to do a hands-on chemistry program where I would just focus on the lab applications and techniques that are of actual use to me.",
      "author": "ronwheezy87",
      "created": 1623430456,
      "upvotes": 4,
      "replies": {
        "h1ghao8": {
          "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1ghao8/",
          "text": "As somebody with mental illnesses too, I wish they invested more in their counseling services, since a lot of the time they just feel like short term one size fits all solutions.",
          "author": "CapriciousSalmon",
          "created": 1623451463,
          "upvotes": 1,
          "replies": {}
        },
        "h1gslcv": {
          "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1gslcv/",
          "text": "It is 100% stacked against those with mental illness. I have read terrifying articles where students who left for mental health issues had serious difficulties coming back, even in upper years. It’s terrifying",
          "author": "craig_ferguson_owns",
          "created": 1623458007,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h1f5qsv": {
      "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1f5qsv/",
      "text": "I guess I just had a really great college experience",
      "author": "Pur3Savag3ry",
      "created": 1623429812,
      "upvotes": 6,
      "replies": {}
    },
    "h1eqyz7": {
      "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1eqyz7/",
      "text": "Professor here. Three things to say:   \n\n\nOne: you are correct that lots of professors should not be in that job. Remember that to teach in higher education you get a credential that trains you to be a subject matter expert, not an expert at explaining things to other people that are from diverse backgrounds and with many types of learning styles. SOME of us spend a lot of time doing supplemental education, workshops, CEs, and trainings in order to learn how to *teach* better, while also staying up to date on our *subject matter*. Many professors don't do that.   \n\n\nTwo: don't let others' failures determine your trajectory. Seek out the additional resources that are there for you to make sure you can still succeed even though they have clearly failed you. Your university almost certainly has free or cheap tutoring available in the subject matter, they almost certainly have some kind of peer mentoring systems or clubs in place, they almost certainly have student support and counseling services available. What do YOU need to move on from these poor professors without allowing their poor performance to shape your life?   \n\n\nThree: We don't all suck - at least some of try not to suck. For *many* college students, they have a lot of mediocre instructors and a few very good, very memorable ones. Those few often become your advisor, mentor, and write you letters of recommendation. You haven't found your few yet, but it doesn't mean they are not out there.   \n\n\nKeep at it!",
      "author": "OtiksSpicedPotatoes",
      "created": 1623423354,
      "upvotes": 50,
      "replies": {
        "h1etia5": {
          "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1etia5/",
          "text": "I know there are good ones and I know some don't know how to explain stuff but they try.\n\nBut the college I am in have alot who just don't care they usually have other jobs outside of college or project so college to them is like some extra money.",
          "author": "shifer231",
          "created": 1623424483,
          "upvotes": 15,
          "replies": {
            "h1fapho": {
              "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1fapho/",
              "text": "In my experience, most people make a decision about where to attend college based on how much college costs.  There are good professors, but you can expect that places that value education will pay their professors better, and that also means you'll probably be paying more tuition.  People who are not teaching full time, working as lecturers and adjuncts,  really are not getting paid much at all.  People who are full-time dedicated teachers cost a lot more to the university.  Education really is a situation where you get what you pay for.  I think that is, in itself, an education.",
              "author": "throw_away_smitten",
              "created": 1623431952,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "h1en2pj": {
      "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1en2pj/",
      "text": "You're not alone. The odds really are stacked against you in college.",
      "author": "MolecularMalevolence",
      "created": 1623421635,
      "upvotes": 10,
      "replies": {
        "h1enn9r": {
          "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1enn9r/",
          "text": "I still remember first day at college when they told us that a professor job is to open the door for us but we need to enter it ourselves.\n\nBut they don't open any shit they lock the door and tell you to break it and if you can't you r just lazy",
          "author": "shifer231",
          "created": 1623421892,
          "upvotes": 11,
          "replies": {
            "h1eo4pm": {
              "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1eo4pm/",
              "text": "[deleted]",
              "author": null,
              "created": 1623422104,
              "upvotes": 0,
              "replies": {
                "h1ep0w0": {
                  "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1ep0w0/",
                  "text": "And I know not all professors are bad, I know some who made me love the subject just because I know they care about me understanding and they want to actually teach",
                  "author": "shifer231",
                  "created": 1623422495,
                  "upvotes": 3,
                  "replies": {}
                },
                "h1eosrj": {
                  "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1eosrj/",
                  "text": "I know research is important, I was just saying that some lecturers do more harm than good.\n\nWe have some who r well known between students, workers, and other lecturers that they don't know what r they doing or just suck.\n\nAnd I took stuff under such people they would bring questions about stuff they didn't explain at all or just cram information and throw it to students.\n\nI once was sent 4 lectures in one day from 1 subject because the professors aren't good at finishing fast",
                  "author": "shifer231",
                  "created": 1623422397,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "h1ggylw": {
              "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1ggylw/",
              "text": "adding on, or they tell you you aren’t spending your time wisely. Why do they give the illusion we have limitless free time? Some of us have to work or commute.",
              "author": "CapriciousSalmon",
              "created": 1623451287,
              "upvotes": 1,
              "replies": {
                "h1gimjy": {
                  "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1gimjy/",
                  "text": "In my country they reduced the time of each semester due to Corona so the they expect from us to study good in a very short time.\n\nLike I feel for us to be prepared we should like finish a least one week before the finals not 2 days before it.",
                  "author": "shifer231",
                  "created": 1623452203,
                  "upvotes": 2,
                  "replies": {
                    "h1hquxz": {
                      "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1hquxz/",
                      "text": "In the US, some schools didn’t even have spring break. Or they would use reading days and give five days off. At my old college, it was fridays, which sucked because as a commuter school, most people had fridays off already. I was so grateful my school gave us a spring break and the professors didn’t give us any work. I really needed those five days.",
                      "author": "CapriciousSalmon",
                      "created": 1623480816,
                      "upvotes": 1,
                      "replies": {
                        "h1hrvdp": {
                          "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1hrvdp/",
                          "text": "We had a week holiday in here and the professors can't send us anything in it so in the week before the holidays they gave us double the lectures",
                          "author": "shifer231",
                          "created": 1623481731,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h1emj6c": {
      "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1emj6c/",
      "text": "There are some Lecterers who I feel should really not have jobs.\n\nAs for some of the shit about college, its true 99% of learning is self directed thrown into the deep end learning. It is how you deal with that is what counts.\n\nMy assignments also give estimates of how long a particular assignment should take.\n\nThis really bugs me as they are always wrong!",
      "author": "Impressive-Name5129",
      "created": 1623421384,
      "upvotes": 57,
      "replies": {
        "h1ent85": {
          "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1ent85/",
          "text": "Secondary note also read the online course resources. They are notes for your own learning",
          "author": "Impressive-Name5129",
          "created": 1623421965,
          "upvotes": 10,
          "replies": {}
        },
        "h1gguhh": {
          "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1gguhh/",
          "text": "I think a problem is with college, there is basically no qualification to become a professor. At my college, all you need is a bachelors to become an adjunct and a masters to become tenured (PhD if you want to be a department head), or you have to have a certain amount of experience equal to it.\n\nI’m trying to become an English teacher, and there’s tons of things you need to do to become one: you have to have so many hours of observation, you have to spend so much time student teaching (ie working with no pay), you have to have a degree in this, spend time doing that, you have to present yourself a certain way, you have to have fingerprints, background checks. You have to pay so much money (to become a substitute costs 200) and pass several state tests. And that’s not even getting into keeping the job. In my state, it used to be five years ago that if you posted a picture of yourself on Facebook at a party holding a glass, they could fire you for it.",
          "author": "CapriciousSalmon",
          "created": 1623451226,
          "upvotes": 4,
          "replies": {
            "h1jxelg": {
              "link": "/r/CollegeRant/comments/nxf9fa/everything_feels_against_you_in_college/h1jxelg/",
              "text": "A master's to get tenured? i've never heard of this and now I am curious. Would you mind sharing your location?",
              "author": "doornroosje",
              "created": 1623531046,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634064455
}