{
  "sid": "p95lwq",
  "link": "/r/CollegeRant/comments/p95lwq/someone_please_please_explain_to_me_why_i_need_to/",
  "title:": "Someone please, PLEASE explain to me why I need to take a chemistry class",
  "text": "Here's the thing: I don't do STEM subjects. I *can't*.\n\nI did well in math throughout elementary school, and then everything went to shit.\n\nIn high school I struggled so much, in Math and Physics, that I had a tutor for two years and *even then* I couldn't pass the tests. My professor gave me the lowest grade she could give me while still making me pass the classes because even *she* had figured out that I just... couldn't manage. I just don't get it, no matter how much I study and try and do the exercises and ask for help, I *can't*.\n\nI'm missing all the bases I should have gotten as a child.\n\nI can do basic operations and function without a calculator for day-to-day math related things, but that's about it, so I chose a major that wouldn't require me to have *anything* to do with STEM subjects in any possible way. I'm perfectly aware of my limits and 100% accept them, to the point that I took a computer class for my Math credit.\n\nSo *please*, tell me why the hell do I need to take a Chemistry class in order to graduate. PLEASE, I beg of you.\n\nI have never studied chemistry in my entire life, and the class descriptions says that a high school basis is needed to be able to understand. I tried explaining this to my advisor, and their response was \"Oh, but don't you worry, it's an easy class!\".\n\nEven eight grade math is supposedly easy, and yet I struggled so much that one of the most vivid memories I have of that time is me sitting at my desk at 9pm crying because I had to finish homework but just couldn't understand what was written and none of the words and numbers on the page made sense.\n\nI am legit panicking because no one seems to be able to understand this issue and it could lead to me not being able to graduate, and not being able to graduate because of a gen ed class I *don't* need for my major and will *never* need in my life in general makes me even more nervous and mad.\n\nThe only way to fix this issue would be for me to go back to middle school and start from there, and clearly I don't have the time to do that.",
  "author": "screamingracoon",
  "created": 1629604659,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.76,
  "comments": {
    "ha1400g": {
      "link": "/r/CollegeRant/comments/p95lwq/someone_please_please_explain_to_me_why_i_need_to/ha1400g/",
      "text": "Swap it for an easier science class!",
      "author": "kimlovescc",
      "created": 1629725665,
      "upvotes": 2,
      "replies": {}
    },
    "ha0sutp": {
      "link": "/r/CollegeRant/comments/p95lwq/someone_please_please_explain_to_me_why_i_need_to/ha0sutp/",
      "text": "Hm, if it’s for a science gen ed, why does it have to be chemistry? Look into the requirements, OP, you might be able to get away with doing other classes that count! I’m doing nutrition precisely to get away from having to do the harder sciences, and my other science was astronomy. My lab was covered by biology, but it was easy enough, and if math is your struggle (mine too), biology is the way to go. Look up the teachers on ratemyprofessor, and you may be able to get away with it with a more relaxed professor. Good luck!",
      "author": "tpfang56",
      "created": 1629719557,
      "upvotes": 3,
      "replies": {}
    },
    "h9yztnf": {
      "link": "/r/CollegeRant/comments/p95lwq/someone_please_please_explain_to_me_why_i_need_to/h9yztnf/",
      "text": "So I’m currently a graduate student in physics and if I had a dollar for every time I’ve heard this exact story, I wouldn’t have to worry about jobs after graduation because I would t need to work. Look, I’ve seen some stupid people graduate with physics degrees. There was one guy in my program who was so clueless, the mystery of him graduating was more complex than quantum mechanics.\n\nEveryone struggles in STEM- your determination matters more than your grades, and from the way your post is sounding, I don’t think you have much. You can pass chemistry, but you need to change your mindset and find better resources to study from\n\nTo answer the question, the reason why chemistry is important is because it applies to everything you see and do in life. It’s the backbone to physics, astronomy, biology, and math. You see and use chemistry on a day to day basis without even realizing that you do. Science is very important and very fascinating, and once you change your views on this topic you will see the beauty behind what science can do",
      "author": "bluenails4444",
      "created": 1629676692,
      "upvotes": 5,
      "replies": {}
    },
    "h9x5axb": {
      "link": "/r/CollegeRant/comments/p95lwq/someone_please_please_explain_to_me_why_i_need_to/h9x5axb/",
      "text": "Does it have to be chemistry or is it simply a science requirement? If it’s the latter you can take something like history of the universe or philosophy of science. It seems odd that they are demanding you take a chemistry class specifically if your major is in no way related to chemistry.",
      "author": "renebeca",
      "created": 1629647107,
      "upvotes": 3,
      "replies": {}
    },
    "h9vq4eh": {
      "link": "/r/CollegeRant/comments/p95lwq/someone_please_please_explain_to_me_why_i_need_to/h9vq4eh/",
      "text": "Because understanding the basics is how we get our stupid ass population out of the dark ages.  \n\nIt is good for you as a human and it's good for our society.  Please go to your classes and try.  Please.  The planet is counting on you.",
      "author": "poop_on_you",
      "created": 1629612802,
      "upvotes": 21,
      "replies": {}
    },
    "h9vj9qs": {
      "link": "/r/CollegeRant/comments/p95lwq/someone_please_please_explain_to_me_why_i_need_to/h9vj9qs/",
      "text": "Coming from someone who felt too stupid to ever pass organic chemistry, and ended up getting a B; i truly believe you can do this. Its going to suck and only reinforce your feelings on STEM, but just try your best and use all the youtube resources you can. They helped me a lot!",
      "author": "AreasofInterest",
      "created": 1629608133,
      "upvotes": 1,
      "replies": {}
    },
    "h9viug3": {
      "link": "/r/CollegeRant/comments/p95lwq/someone_please_please_explain_to_me_why_i_need_to/h9viug3/",
      "text": "Dude, I'm in the same boat. At least I'm allowed to pick my poison between several STEM options, all of them equally terrifying. Landed on chemistry because it seemed easier than the others... \n\nI want to do well and I genuinely want to learn whatever it is I'm enrolled in, but I picked a humanities major for a reason! Why do I have to have 11+ credit hours of science classes alone? On top of the mandatory math class. It doesn't make sense and makes me want to die. \n\nI'm having a lot of anxiety since my professor released the syllabus at 12 am - which was so great to see as I was literally about to go to bed. Now I'm looking through the course catalog and panicking and feeling nauseous and seeing if I can change last minute.",
      "author": "depressedstudent25",
      "created": 1629607862,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634061589
}