{
  "sid": "ngdmrm",
  "link": "/r/CollegeRant/comments/ngdmrm/hey_let_me_rant_pls/",
  "title:": "Hey let me rant pls",
  "text": "it's 2am and i can't stop thinking about college. i don't know how to afford college as a 17 year old and it's hard to earn money in the pandemic era for my parents so we really don't have a choice, but i really want to go to college as it is my dream. i can't apply for fast food restos because minors aren't allowed to go outside. i'm going to be taking animation or nursing. i am worried i am late for admissions as i only have 60 pesos and a dream. admissions are 500 pesos and i'm not even sure if i'll pass. 09173258133 is my gcash account. any amount, even 5 pesos and UPVOTES would be appreciated! ^-^",
  "author": "666ell4",
  "created": 1621449853,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.81,
  "comments": {
    "gzjx9ln": {
      "link": "/r/CollegeRant/comments/ngdmrm/hey_let_me_rant_pls/gzjx9ln/",
      "text": "You mentioned pesos so I’m not sure if you’re in the US, but is there any sort of federal financial aid like FAFSA where you live? That could help offset costs if your parents make below a certain threshold. \n\nWhen you apply to colleges, they might award you aid based on your family’s finances or your academic progress. You might look into whether colleges you are interested in have work study programs too. If your parents are completely unable to help, you can see whether you could partially pay tuition and then take out loans to make up the rest (which you could pay back when you graduate).\n\nIt may take awhile to get through college this way because you might not be able to take many classes if you’re working quite a bit, but it can be done. And if you can’t attend within the next few years, don’t worry! A lot of people don’t start college right out of high school and still find it to be a wonderful experience. You’ve clearly got the drive, so I’m sure you’ll go far!",
      "author": "GeeseEnPointe",
      "created": 1622058420,
      "upvotes": 2,
      "replies": {
        "h0vwa8s": {
          "link": "/r/CollegeRant/comments/ngdmrm/hey_let_me_rant_pls/h0vwa8s/",
          "text": "only saw this now, thank you so much for this! this means a lot for me.",
          "author": "666ell4",
          "created": 1623051056,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634062571
}