{
  "sid": "pmgpj7",
  "link": "/r/CollegeRant/comments/pmgpj7/help_i_kinda_fucked_up_really_bad/",
  "title:": "Help, I kinda fucked up really bad",
  "text": "So I am a rising sophomore at a pretty good school. I started fully remote last year, and I ended up being remote the entire year. My school does terms, and so in the fall and winter terms, I was doing really well. I didn’t mind being online; I loved my classes, my school, and I was motivated af. I still love my school and the classes I’ve taken, but by spring, being remote started feeling depressing, lonely, and pretty difficult. I know I wasn’t the only person going through that, so I don’t want to complain too much about it, but I think that made me unmotivated. I ended the winter term with all A’s in my 8 classes and had an overall 3.74 GPA for both term (i.e. 15 total courses) while also being in 4 clubs and stage managing 3 remote theater plays, for my theater production scholarship—that winter term.\n\nSpring rolled around, and I was excited; initially, it was okay, but by the middle of the term, I didn’t feel entirely focused on school. At that point, many people were going back to school. My school was allowing it, but all classes were still fully remote, and I personally don’t have money to blow like that bc dorming is expensive. But, the fact that many people were there, including my two roommates, made me feel kind of lonely. So that term, I spent a lot of time doing club stuff ( I'm in 5 or more clubs) and on my phone and social media because I felt I was missing out and wanted to feel connected (I also had 3 asynchronous classes which made me procrastinate more, so it was harder to stay on track of that work compared to my other 5 synchronous ones). I also had to apply for internships and had around 12 interviews to prepare for and finish. I didn’t fail any of my classes. Still, I finished with a pass/fail (which I never did before), one C, a couple Bs and only a few As, which was not good enough by my standards and made my GPA 3.49. I threw up that night from stress. At that point, I was really depressed and was holding onto a lot of guilt. I thought, ok, maybe I can do some summer classes to make up for it, so I took 5 classes this summer. Spoiler alert, It was not a good idea at all. I just finished my classes this summer. I had two F’s, a D, a B, and an -A. The classes weren’t challenging by any means. I had a bad start because my home's Wi-Fi connection was down during the first 2-3 weeks, and I would have to travel to places like Panera bread to get free Wi-Fi which was still really slow. That made me fall behind a lot, and then I got super burnt out as a result. I also had trouble because lots of the work we did require a lot of disk space to download and handle the software, and my computer is pretty old. For instance, photoshop would tell me that my scratch disk was full, so I bought an external hard drive to help, but after a few days of using it, it would say it was full again. I tried cleaning my computer, but it was honestly tricky because I had a lot of important stuff on there. Long story short, my GPA is now a horrible 3.13. Frankly, I feel sick to my stomach every time I think about it and have thrown up a few times. I’m going to be on an internship at Oracle this coming fall and winter, so I won’t be able to take classes till spring and summer (that’s how my school works). I don’t get breaks in the summer, from now on, which is fine because I’ll be at school. I’m just nervous that I won’t be able to bring up my GPA higher than 3.50. I really don’t want to disappoint my parents because they were so proud of me. Now, I’m on probation because my GPA for the term was 1.66. I’m lucky that my overall GPA is still in the 3. range, but I’m so ashamed of myself. \n\nAny thoughts?\n\nAm I an idiot? Has anyone else suffered through the same thing and has come back on top? please, I need hope :(\n\nAlso if you have any tips/advice, plsss share!\n\nThanks for reading all of this lol",
  "author": "ipatrizio",
  "created": 1631398905,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hcmu88y": {
      "link": "/r/CollegeRant/comments/pmgpj7/help_i_kinda_fucked_up_really_bad/hcmu88y/",
      "text": "I completely understand what it’s like to see an excellent GPA fall quickly like that. I know the feeling of embarrassment and disappointment. Good news for you, you definitely have enough time to get your GPA back up. Take a deep breath, you’ll be okay. Hopefully this experience will teach what does and doesn’t work in terms of your learning style. If you apply yourself going forward the way you did at the beginning of your university experience, you have nothing to worry about. Good luck, mate! :)",
      "author": "EyreOfUncertainty",
      "created": 1631493864,
      "upvotes": 1,
      "replies": {}
    },
    "hchwgl2": {
      "link": "/r/CollegeRant/comments/pmgpj7/help_i_kinda_fucked_up_really_bad/hchwgl2/",
      "text": "Dude, youre fine. My gpa is currently 1.6 from when i was in college years ago and im retaking shit now. After I got kicked out for an overall 1.6, i went to community college and just graduated with a 4.0. Im back at the original school and doing really well. I dont really do clubs but I work 15 hours a week and see my friends every few days. Anything above a 3 is honestly fine. But, you should really consider seriously downsizing your extracurricular stuff. Its really too much to handle. FOMO sucks, but you dont have to be in 5 clubs and whatever else. Retake the classes you got less than a C in asap. Breathe. Drink water.",
      "author": "taybay462",
      "created": 1631403223,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634062123
}