{
  "sid": "l4k8no",
  "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/",
  "title:": "I Miss Actual Books!",
  "text": "I never thought I'd say this but I miss hardbound books that you can touch and flip pages. I hate staring at a computer for so long- classes, assignments, internships and college clubs are all online and it's driving me crazy. Before corona, I used to have a solid 1-hour commute to college and I got so much reading- from physical books that I borrowed from the library- done in that hour. Last march I genuinely thought this online crap was going to last 3 months max. While I'm still getting decent grades it's only because I work twice as hard and force myself to focus and I'm burning out. When I had actual books it was easier to tune out electronics, switch off notifs and get work done. But my college profs update through email and I'm always on my phone and my internship is virtual so I'm always typing stuff and spend  12-14 hours hunched in front of a screen. I don't want to whine too much because I know others have it worse but it'll be easier if I knew when the pandemic will end so ill have a particular date to look forward to.",
  "author": "Drogo45",
  "created": 1611566152,
  "over_18": false,
  "upvotes": 184,
  "upvote_ratio": 0.99,
  "comments": {
    "gkrtn6e": {
      "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkrtn6e/",
      "text": "someone finally said it",
      "author": "morrisonsblues",
      "created": 1611622526,
      "upvotes": 1,
      "replies": {}
    },
    "gkrkzcu": {
      "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkrkzcu/",
      "text": "Physical books are so much more expensive. I'm really glad there are less expensive online options failed.",
      "author": "Mkg102216",
      "created": 1611617947,
      "upvotes": 1,
      "replies": {}
    },
    "gkr63t2": {
      "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkr63t2/",
      "text": "Same, but I don't not have physical books because of covid. Most of my books this and last semester don't have used ones available so it's like $200 for the ones I need. I'll pass.",
      "author": "team_liebniz",
      "created": 1611610684,
      "upvotes": 1,
      "replies": {}
    },
    "gkqmxec": {
      "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkqmxec/",
      "text": "I literally buy all my hard books at second hand book stores or discounted or local bookshops I haven’t yet to go a semester without finding a hard copy. Found my micro book (3 editions back) for 4$ it’s literally the same as the newiest edition.",
      "author": "Hawkbiitt",
      "created": 1611602059,
      "upvotes": 2,
      "replies": {}
    },
    "gkqgwbb": {
      "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkqgwbb/",
      "text": "Sure but not worth paying $200 for a textbook",
      "author": "Infinite_Anybody_113",
      "created": 1611599454,
      "upvotes": 6,
      "replies": {
        "gksbooy": {
          "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gksbooy/",
          "text": "I should have mentioned I'm not from the US. I usually find my textbooks in second-hand bookstores for really cheap prices or borrow from the college library. But it sucks that you guys have to pay so much for textbooks :(",
          "author": "Drogo45",
          "created": 1611632047,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gkqft2i": {
      "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkqft2i/",
      "text": "I agree. I have used digital books for the last few years because they are usually way cheaper, and are especially useful and needed due to current events. But gosh do I miss holding and marking up a physical book. Something about it is just so satisfying.\n\nAlso, for eye strain/headache issues, I bought myself a pair of blue light glasses. They’re relatively cheap, and you can find them on Amazon. I used to have issues with my eyes twitching and straining after a while, but withe glasses I don’t have that issue.",
      "author": "pdowney2",
      "created": 1611598981,
      "upvotes": 1,
      "replies": {}
    },
    "gkqcx5v": {
      "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkqcx5v/",
      "text": "If you are getting eye strain or headaches from looking at the computer so long, try a program like f.lux. I was getting awful headaches to the point were I would quit working and just lay on my bed, but f.lux (and some better time management) made my work less painful.",
      "author": "StellarLeviathan",
      "created": 1611597725,
      "upvotes": 9,
      "replies": {
        "gkr9lse": {
          "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkr9lse/",
          "text": "Hitching on to this comment... \n\nBlue light glasses help a lot. I’m now WFH and doing school full time from home. I literally stare at one of two computers for 12+ hours a day. Broke down and bought some decent blue light blocking glasses and they are a life-saver. I also switched all of my settings to dark mode so I don’t have to strain my eyes at a super bright screen.",
          "author": "justapublicservant",
          "created": 1611612348,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gkqba3f": {
      "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkqba3f/",
      "text": "There are still physical textbooks. It may be that your professors are using links to eBooks, but you can almost certainly still purchase an actual paper book.",
      "author": "college_prof",
      "created": 1611597025,
      "upvotes": 17,
      "replies": {
        "gkskx6u": {
          "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkskx6u/",
          "text": "I had a conversation about this earlier today. I’m with OP in the sense that I’d rather have physical books as well but my school didn’t give us the option. My eText fees were automatically charged to my account and I’m not going to pay for the eText and the physical book on top of that. Also physical books are unreasonably expensive",
          "author": "Silent-18",
          "created": 1611637491,
          "upvotes": 2,
          "replies": {
            "gkty4tx": {
              "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkty4tx/",
              "text": "Oh, well that's stupid that your school did that. \n\nI'm a professor and I work really hard to make my textbooks affordable. I think the most expensive text I use is about $60 if purchased brand new, less if purchased used, even less if rented. I know that's still a lot and it adds up, but I guess I just wanted to say that some of us are trying our best to make this process not suck.",
              "author": "college_prof",
              "created": 1611674818,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gkqb4k3": {
      "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkqb4k3/",
      "text": "I sure don't miss paying for real books",
      "author": "xXMassiveRoosterXx",
      "created": 1611596959,
      "upvotes": 41,
      "replies": {
        "gkql5xh": {
          "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkql5xh/",
          "text": "Gang shit 💲🔥",
          "author": "KungP0wchicken",
          "created": 1611601289,
          "upvotes": 9,
          "replies": {}
        },
        "gkrmjns": {
          "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkrmjns/",
          "text": "My E-books cost the same and I can’t even access them once the semester ends.",
          "author": "NoSpaceAlien",
          "created": 1611618760,
          "upvotes": 7,
          "replies": {
            "gkrnhkf": {
              "link": "/r/CollegeRant/comments/l4k8no/i_miss_actual_books/gkrnhkf/",
              "text": "That's crazy. My e-books are much cheaper than physical copies. Most of my classes aren't even using books this semester now.",
              "author": "xXMassiveRoosterXx",
              "created": 1611619253,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062615
}