{
  "sid": "otcug6",
  "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/",
  "title:": "Starting college with tons of untreated mental illnesses",
  "text": "Anxiety, depression, adhd and body dysmorphia (also suicidal). I have absolutely no idea how im gonna get through this. I’ve never been at a lower point in my life. I just feel nothing. I’m supposed to be starting a new and exciting chapter of my life lmao. I feel disgusting.",
  "author": "Zeyn0202",
  "created": 1627487998,
  "over_18": false,
  "upvotes": 138,
  "upvote_ratio": 0.94,
  "comments": {
    "h7a5vbn": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h7a5vbn/",
      "text": "Hey, old post but you’re not alone. I feel like im in the same boat. Im really low and depressed yet somehow am supposed to do full time online classes and act like everything is perfect. I dropped out and wasted a whole year, didn’t go to therapy or anything, am neglecting myself lately. Good luck to you, I think you will make the right decision and it’s ok if that means taking time off. 💕",
      "author": "newsadacc",
      "created": 1627794131,
      "upvotes": 1,
      "replies": {}
    },
    "h6yr969": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6yr969/",
      "text": "Maybe you could look into microdosing to help you get through (def do your research before getting into it tho.)",
      "author": "Elket4te",
      "created": 1627572014,
      "upvotes": 1,
      "replies": {}
    },
    "h6xav2h": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6xav2h/",
      "text": "I never had access to mental health care until university. If you go to a school with free CBT, or even group therapy sessions you may feel like they can really help. I even was about to go to a psychiatrist through my university and get medication for much less than I would have outside of school. \nBut if you are worried about how your mental health will be with all the changes that comes with college I encourage you to delay! There’s nothing wrong with waiting. Whatever you do seek therapy & get help as soon as possible, it turned my life around and allowed me to love college. \nI wish you the best\n\nEdit: I saw that you wanted to move away from parents. Which is another opportunity college gave me. I was lucky enough to live alone and meet wonderful people my second semester. It was so hard at some times, but I really feel like college gave me an opportunity for the first time to prioritize my mental health \n\nEveryone is different and all these comments give great advice. You will get through this whatever path you chose <3 and you will learn so much from the journey",
      "author": "raychelc1022",
      "created": 1627537459,
      "upvotes": 1,
      "replies": {}
    },
    "h6wsyc1": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6wsyc1/",
      "text": ">I have absolutely no idea how im gonna get through this\n\nYou're not. I was you two years ago--ADHD, depression, anxiety, trauma. The works. I did \n1.5 mediocre semesters and then the pandemic hit and everything went to shit. A long series of complications later, I have no idea if my school will even take me back because my financial aid is messed up, even though my mental health is getting better (though now I have the added complication of a chronic pain disorder, but that's unrelated).\n\nPlease take a year off and get yourself situated first. Please, please don't be like me. Starting college immediately and never taking time to take care of myself was the worst mistake I ever made.",
      "author": "It_is_Katy",
      "created": 1627526676,
      "upvotes": 1,
      "replies": {}
    },
    "h6vspam": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6vspam/",
      "text": "If you can’t delay college I would encourage you to go straight to your schools counseling center and talk to a professional. Also see if you can get SDS forms going to you get like help in certain areas. \n\nI have OCD and had to medical appeal a whole semester and failed a couple classes the next following semesters. It’s no joke. The stress from cowl legs will wear away at you and you’ll break. I was diagnosed with depression as well and it makes perfect sense cause I literally could not remember anything.",
      "author": "Ohhiitsmeyagirl",
      "created": 1627509217,
      "upvotes": 1,
      "replies": {}
    },
    "h6usx4e": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6usx4e/",
      "text": "I feel sorry for you. I’m on your side. Though probably not as harsh as your situation, this year I enrolled in uni with anxiety, depression, and suicidal thoughts lasting for several years.",
      "author": "sheepshooter13",
      "created": 1627494078,
      "upvotes": 7,
      "replies": {}
    },
    "h6ureqy": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6ureqy/",
      "text": "I started college at my lowest point and it ruined a lot of good opportunities and friendships for me. But staying at home wasn’t an option because my relationship with my parents wasn’t the best at that time. \n\nIf staying home isn’t going to further ruin your mental health, you should definitely consider delaying college. You could also just take one or two classes each semester at a community college!",
      "author": "lazairiaw",
      "created": 1627493456,
      "upvotes": 6,
      "replies": {
        "h6ve7m7": {
          "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6ve7m7/",
          "text": "That’s exactly the situation im in! I can’t bare to stand near my parents anymore, but i have no other choice. I’m either here with them or at uni ☹️  They don’t really want me staying any longer so i don’t think i do really have a choice.",
          "author": "Zeyn0202",
          "created": 1627503023,
          "upvotes": 2,
          "replies": {
            "h6vt6h8": {
              "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6vt6h8/",
              "text": "Could you get a job and rent a room in an apartment?",
              "author": "taybay462",
              "created": 1627509433,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h6uqnw9": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6uqnw9/",
      "text": "I think you should consider delaying college or doing part time as others have suggested. I had a roommate who had bad anxiety/depression & she barely left the room or did work. We talked about it and she agreed that she should probably take a break and get back to it when she’s feeling more up to it. I also think you’ll enjoy the college experience more once you’re in the right headspace. Best of luck to you.",
      "author": "mimi_00",
      "created": 1627493152,
      "upvotes": 8,
      "replies": {}
    },
    "h6upwa1": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6upwa1/",
      "text": "You may have access to better mental health resources through the university. I don’t know your specific situation, but most places have a student health center that is used to dealing with these sorts of issues (things that affect people who may not have had the support to deal with them prior to college). It’s worth checking with the school to see what is available.",
      "author": "furryworries",
      "created": 1627492835,
      "upvotes": 12,
      "replies": {
        "h6uu31a": {
          "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6uu31a/",
          "text": "the only caveat to this answer is that university mental health resources tend to be understaffed and overbooked, which may result in you struggling alone for weeks on end, waiting for an appointment.",
          "author": "meg_ea",
          "created": 1627494552,
          "upvotes": 6,
          "replies": {
            "h6uw006": {
              "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6uw006/",
              "text": "Very true. I’m hoping that if OP calls ahead of school starting that they will at least be closer to the front of the line. Access to MH resources can be so frustrating!",
              "author": "furryworries",
              "created": 1627495359,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h6vdy9q": {
          "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6vdy9q/",
          "text": "Unfortunately my university doesn’t provide resources like those. Mental health isn’t really taken seriously in my country. God i wish i studied in america :( tysm for your comment!",
          "author": "Zeyn0202",
          "created": 1627502913,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h6um8a3": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6um8a3/",
      "text": "Agree with possibly delaying college or taking part time (if you think staying busy would help). Depending on your college, they may licensed counselors or therapists that can help you. If you have a money problem they should be able to point you to the right direction.   \nSorry you're going through this. Just completed my first year with ADHD and OCD and it was hard but !with the proper help! I was able to do it successfully. Get help, you can't do it alone.",
      "author": "llamaintheroom",
      "created": 1627491329,
      "upvotes": 11,
      "replies": {}
    },
    "h6ulgiu": {
      "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6ulgiu/",
      "text": "I would encourage you to seriously consider delaying college. You will do so much better when you are in a better place. Get the help you need now. If you are focusing on classes you cannot focus on yourself enough.\n\nIn the long run, no one will care if you waited a year or two to go to college.",
      "author": "BiochemBeer",
      "created": 1627491018,
      "upvotes": 78,
      "replies": {
        "h6uuvz8": {
          "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6uuvz8/",
          "text": "This. I did not wait and I started uni with 1 mental illness. Now, three years in, I have 4. One of them is Anorexia and this is no joke anymore. I will prob have to drop out now anyways because my health in total is completely whacked. I wish I would have delayed my education. Maybe today I wouldn‘t have to „live“ with that. If you can, delay until you feel like you are strong enough and can actually do it.",
          "author": "mary_or",
          "created": 1627494886,
          "upvotes": 23,
          "replies": {}
        },
        "h6vdmzz": {
          "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6vdmzz/",
          "text": "Honestly i would love to do that, but my parents are not supportive about taking a gap year AT ALL. I know that i need tons of therapy, but they just like to say that everybody has these symptoms and that im exaggerating so i really have no choice. It’s impossible for me to support myself financially at this point so i guess i just have to do what they say :( I’m literally so scared because i know im gonna mess everything up and jump back in to my deep dark depression hole. Happens every year during school. Thank you for the comment though!",
          "author": "Zeyn0202",
          "created": 1627502783,
          "upvotes": 14,
          "replies": {
            "h6vsz4y": {
              "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6vsz4y/",
              "text": "I wrote another comment but go to your schools counseling center. You can get therapy for free through them as well as your schools student health services department.",
              "author": "Ohhiitsmeyagirl",
              "created": 1627509340,
              "upvotes": 2,
              "replies": {}
            },
            "h6vf3jv": {
              "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6vf3jv/",
              "text": "I'm sorry to hear that. \n\nI would encourage you to keep talking to your parents about it.  I don't know how open you are with them, but be as open as possible.\n\nIf they already know that you have felt suicidal, tell them that you feel that you fear this might make that worse.  Tell them that you want to succeed but that you aren't ready yet.  I'm sure they want what is best for you, but just don't understand fully your struggles.\n\nIf you need excuses beyond that, you can explain you also want to have more money saved up and want to work for a year to avoid debt.  If that doesn't work, reach out to the counselors at the school you are planning to attend ASAP.  See if they can do a virtual meeting with you.  Share your concerns and let them know your situation. If it is your desire to wait or a year or two, but your parents don't support that, tell them about that too.",
              "author": "BiochemBeer",
              "created": 1627503398,
              "upvotes": 2,
              "replies": {}
            },
            "h6vt2t0": {
              "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h6vt2t0/",
              "text": "No offense but your parents fucking suck. The cool thing about being an adult is you dont have to listen to them anymore. I can promise you that college will only add to your stress and only make things worse, and you will potentially waste money since you fail classes and have to end up taking them anyway. Take a break. Get help.",
              "author": "taybay462",
              "created": 1627509387,
              "upvotes": 1,
              "replies": {}
            },
            "h7m40gj": {
              "link": "/r/CollegeRant/comments/otcug6/starting_college_with_tons_of_untreated_mental/h7m40gj/",
              "text": "What if you worked for a year? If you found a decent job close to full time they might be more supportive of time off school?",
              "author": "craig_ferguson_owns",
              "created": 1628033147,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634063302
}