{
  "sid": "osrjfr",
  "link": "/r/CollegeRant/comments/osrjfr/hot_anxious_crying_mess_round_2/",
  "title:": "Hot Anxious Crying Mess Round 2",
  "text": "So literally about a month ago I had posted on here about how my university screwed me over big time by taking away my transfer credits and then not holding anyone accountable. Well I’m back for Round 2!! /s \n\nSo it turns out I could still graduate by the end of this summer IF I took another 3 credit course. My 6 missing credits were restored which meant that I was still missing 3 credits. Okay. I think the university’s a fucking joke who can’t hold themselves accountable, but I’ll take the class so I can get my damn degree. Yesterday, I got an e-mail saying I couldn’t graduate for the summer, and that I needed to withdraw and try again for a different semester. I was at work yesterday so I kinda brushed over the e-mail. Except this morning I sat down and read through it. Basically the registrar office said \n\n“We regret to inform you that you are currently not meeting the graduation requirements for your academic program to graduate in Summer 2021.”\n\nCue me shouting “what the actual fuck” then trying to reach the phone line, only for the worker to tell me to email the office instead. So I e-mailed the office after being told I’d get a speedy reply. 4 hours later and no response. So then I emailed the head advisor of my department and again 4 hours later and no response.\n\nThis same head advisor and the fucking Dean ensured that I could graduate this summer and earn my degree. My class literally finishes in 2 weeks and 3 days and my account says I’ve already registered to graduate by the end of this August.\n\nIn total I’ve had nearly 5-6 panic attacks, including 2 from today. My mental health is suffering and I can’t think straight. I’m so so tired. I just want my degree that I worked incredibly hard for. The university is a fucking joke. I don’t care if I sound like a bitch, I’m SUFFERING. When I get that degree with my two hands I’m going to write a letter to the school and express how disappointed and disgusted I am by how they treat their students.",
  "author": "scp2461",
  "created": 1627407776,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {},
  "updated": 1634063137
}