{
  "sid": "r7kpxb",
  "link": "/r/CollegeRant/comments/r7kpxb/failing_my_first_semester/",
  "title:": "Failing my first semester",
  "text": "I'm failing my first semester of college. I was a straight A student for my entire life, and I placed a lot of self worth on academic validation. I wanted to take a gap year, but because of c0vid, none of my plans were able to work out. I had to go to school and I didn’t want to, nor did I feel ready. When I moved in, I had a major PTSD episode that pretty much lasted until midterms and I fell super behind. I feel myself falling back into depression and it's so frustrating. I’ve had my mental health pretty under control for the past year and it's really discouraging to regress like this. \n\nI also never had to study in highschool so I have no strategies, and I have no idea what works for me. I tried doing better for the 2nd part of the semester, but I’m still failing most of my classes. I started off taking 5 classes, but I dropped my bio, and I am going to fail chem. I thought I was passing my stats class because online it says I have an 81, but I calculated my grade and it’s a 58. I know it’s all my fault, I was irresponsible and I didn’t study enough and do all of my assignments. My parents have been very understanding, but I am so scared to tell them that I’m failing stats because I was pretty confident that I could pass. The only classes I’m going to pass are an anthropology elective that’s not related to my major, and a one credit hour class that was pretty much pointless. \n\nI’m taking the spring semester off. I want to figure out who I am outside of school and work on my mental health. I have an opportunity to do unpaid work in the field that I’m interested in, so I am going to save up and then do that for a few months. I need to learn to separate school from my self worth, because right now I feel like utter shit. I know I was going through a lot mentally for a while, but I still feel awful. I’ve never failed a class in my life, and now I’m failing 2. I feel so discouraged and embarrassed. I wish I had put in more effort, especially at the beginning of the semester. I’ll probably go to a community college next year because I lost my scholarship. I feel like there was a lot of pressure on me to do well because I’m the oldest cousin in my family and I’ve always been kind of an example, and now I’m going to be a college dropout. I feel so ungrateful. I was given the opportunity to get an education, and I had a decent scholarship, and I blew it. \n\nTLDR; I'm failing my first semester because of mental health issues and also because I didn't put in a ton of effort and I kind of hate myself for it lol",
  "author": "swagperson5442",
  "created": 1638488797,
  "updated": 1639518123,
  "over_18": false,
  "upvotes": 27,
  "upvote_ratio": 0.94,
  "comments": {
    "hn0wk8a": {
      "link": "/r/CollegeRant/comments/r7kpxb/failing_my_first_semester/hn0wk8a/",
      "text": "I was so similar to you. Way back in the fall of 2015, I was in my first semester of university. I was just like you where I did not need to ever study and had no good study habits built up. I went off to college and I had my ass absolutely handed to me. It was just so rough.\n\nI ended up dropping out that December and felt lost. It was the most depressed I have ever been in my life. It was the only time in my life I genuinely felt like taking my own life. It all just felt so pointless. Moving back into my parents when I just moved out made me feel like such a loser. \n\nBut you know what? I slowly picked myself back up. It took a solid month and half before I found a decent job around my hometown. Through that job, I met some of the best friends I would have never met otherwise. My coworkers became my good buddies and we rented a cheap, shitty house together. We started a band and toured around. About 6 months after I dropped out, I enrolled in community college for something I have always loved, which was audio technology. Before I knew it, I went from having an empty life with nothing to do, to having friends, a job, and a cool degree I was working on. \n\nWell, time marches on, and I eventually finished that associates degree. Our band broke up (on good terms). I discovered what I really wanted to do all along was become an electrical engineer and design my own audio gear.\n\nSo after my getting my associates in 2018 and a summer, i enrolled in a bachelor’s program again and am funnily enough finally about to graduate in about two weeks.\n\nIt’s been so hard, the whole journey this far. Being several years older than all the other people in school was so weird at first. Being a 24 year old around 19 year olds felt strange to say the least. Seeing my friends get their degrees and start their lives hurt, but in the end, it seemed to work out. I am the happiest I’ve ever been now and excited about the future.\n\nSo what I was trying to say in so many words was that you should not worry OP. We, as a society, put too much pressure on young people to choose a career for the rest of their lives. Don’t feel bad for your path not being as straight as others, that is completely okay. As cheesy as it is, we truly are all on our own paths and I’m sure you will look back on this moment a few years from now and be able to smile at how far you’ve come.\n\nI believe in you, friend! You’ll find your way!",
      "author": "DyJoGu",
      "created": 1638503241,
      "upvotes": 10,
      "replies": {}
    },
    "hn0ueci": {
      "link": "/r/CollegeRant/comments/r7kpxb/failing_my_first_semester/hn0ueci/",
      "text": "Don’t beat yourself up too much, these things happen sometimes. I mean it’s good you feel a little guilty bc it shows you’re responsible. But failing out doesn’t necessarily mean you’re dumb or lazy or anything like that. Since Covid started there’s been mad pressure on a lot of people and even good students have suffered. In addition to that, college is just hard. Our parents, society, scholarships, and ourselves all put an absolutely ridiculous amount of pressure on us to hurry up and decide what we want to do for the rest of our life and then post good grades and I feel like a lot of times people get rushed into it w/out a good chance to prepare. That sounds like what happened to you so I just think you need a reset and what you have planned out seems like a  pretty good way to move forward.\n\nI know you said you don’t feel like you out in a lot of effort but it’s hard to know how much effort to give when you’ve never been challenged before and our mental state determines how focused we can be anyway. So just take this L and move on and let it motivate you to prep better for when you come back (if that’s what you decide to do).",
      "author": "airbear13",
      "created": 1638502257,
      "upvotes": 3,
      "replies": {}
    },
    "hn15sgs": {
      "link": "/r/CollegeRant/comments/r7kpxb/failing_my_first_semester/hn15sgs/",
      "text": "Similar experience here. Got accepted to a college way better than I deserved to because of sports and was pretty much doomed from the start. No study habits either and I felt stupid and pathetic around people far smarter and more motivated than me who’ve made the right choices at every step in life.\n\nFrankly I wasn’t ready to take any college seriously at 18. Over a decade later I still feel self-conscious about it. When I went back in my early 20s I picked a cheaper and easier local school which was a better fit. I have a computer engineering degree which I would never have survived at my first college, but nonetheless I got a fine job out of it.\n\nMy advice is to work a crappy job for a year, clear your head, and understand why it’s important to get a good education.",
      "author": "AnyProcess4064",
      "created": 1638507802,
      "upvotes": 1,
      "replies": {}
    }
  }
}