{
  "sid": "rfbkbi",
  "link": "/r/CollegeRant/comments/rfbkbi/i_might_fail_my_chemistry_final/",
  "title:": "I might fail my chemistry final",
  "text": "I just came here to rant, but I have no interest in chemistry at all. Before I went to college, I told my parents that I will be doing biochemistry and then become a doctor. I can't take it anymore. I genuinely don't like being in school, and I can't stand another 10 years of this.\n\nI'm in my first semester of college and I think that I'm going to fail my chemistry final tomorrow. It honestly sucks having to accept this, but I just have no interest in the subject at all. It is so boring. I know that if I put in the work, I might actually pass, but I don't see the point anymore. I'm shifting to business instead, which I actually wanted, and chemistry is not at all useful to that.\n\nI know that failing this class will have consequences on my transcript but I don't think it's worth giving energy anymore. I regret every trying and I should have used the days I tried to study for it on other subjects. I don't even know if I should bother showing up to the final tomorrow. I'm sorry to what a waste of money that class was, but I did need to take it for me to realize I hate it. So yeah, see ya chemistry, you're literally the worst.",
  "author": "seinless",
  "created": 1639386272,
  "updated": 1639517867,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hocyypn": {
      "link": "/r/CollegeRant/comments/rfbkbi/i_might_fail_my_chemistry_final/hocyypn/",
      "text": "Your only in your first semester so it’s normal to still be figuring out what you want to do. Don’t beat yourself up. College sucks",
      "author": "RainCareless8422",
      "created": 1639386595,
      "upvotes": 4,
      "replies": {
        "hoef52k": {
          "link": "/r/CollegeRant/comments/rfbkbi/i_might_fail_my_chemistry_final/hoef52k/",
          "text": "Thank you, when I first realized this/made the decision, I was a bit worried about the time I wasted. But, this definitely beats realizing it 2 years down the major.",
          "author": "seinless",
          "created": 1639415605,
          "upvotes": 2,
          "replies": {}
        },
        "hodedj3": {
          "link": "/r/CollegeRant/comments/rfbkbi/i_might_fail_my_chemistry_final/hodedj3/",
          "text": "College sucks when you don’t know what you are doing. It’s expensive- mentally, physically, and financially to waste time “exploring” after failed trials.\n\n\nThat’s just the truth.",
          "author": "loveworldpeace",
          "created": 1639398779,
          "upvotes": 1,
          "replies": {
            "hoeg0g3": {
              "link": "/r/CollegeRant/comments/rfbkbi/i_might_fail_my_chemistry_final/hoeg0g3/",
              "text": "This is true, but like I said earlier, I needed to take the course again for me to realize that it isn't for me. It was a waste of time and money, but there was that bright side. And, I think exploring is a good things for students as long as they limit it. Like, they can just try out their top 3 interests and settle on one of them. For me, I knew that I couldn't leave college without some science skill, so the business course I'm hoping to take has computer science with it. And, I know that I'm not creative enough for an arts degree so that removed the faculty of arts. To enter the faculty of science, chemistry is a pre-req, so LOL.",
              "author": "seinless",
              "created": 1639415956,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hodp2be": {
      "link": "/r/CollegeRant/comments/rfbkbi/i_might_fail_my_chemistry_final/hodp2be/",
      "text": "I’d recommend you follow your passion in business. Chemistry is hard and you have to love it to push through. Don’t let your parents dictate your life pls💚",
      "author": "No-Economy-666",
      "created": 1639404648,
      "upvotes": 1,
      "replies": {
        "hoeg98d": {
          "link": "/r/CollegeRant/comments/rfbkbi/i_might_fail_my_chemistry_final/hoeg98d/",
          "text": "My parents weren't necessarily dictating it, but I felt the pressure to keep my word, because I guess I value integrity. But, I wasn't being truthful to myself. Thank you for your encouragement. :)",
          "author": "seinless",
          "created": 1639416054,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}