{
  "sid": "n9efxo",
  "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/",
  "title:": "Having a 50% test average is not a good thing",
  "text": "I had a bio 329 (cellular and molecular bio) professor that would discuss our test average after each test, the vast majority being in the 45-50%, and he acted like it was perfectly fine. The tests counted towards the majority of our grade and not once did we get above a 60%. Having a below 60% average is not good, and it’s not the student’s fault if everyone fails.",
  "author": "mxddiecxmpbell",
  "created": 1620676600,
  "over_18": false,
  "upvotes": 54,
  "upvote_ratio": 1.0,
  "comments": {
    "gxr5jor": {
      "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxr5jor/",
      "text": "If you pride yourself on students consistently failing your course, you're bragging that you're a shitty teacher who should find a different job.",
      "author": "griffinicky",
      "created": 1620754843,
      "upvotes": 3,
      "replies": {}
    },
    "gxouq6p": {
      "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxouq6p/",
      "text": "cell bio professor at my school has an 80% fail rate for her class supposedly. Only prof that teaches the class cause it’s a small school. So glad I don’t need that class.",
      "author": "bakersydney01",
      "created": 1620704017,
      "upvotes": 3,
      "replies": {}
    },
    "gxocozj": {
      "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxocozj/",
      "text": "Colleges need to look at course average and exam averages when evaluating instructors. If your averages are that low the instructor is either not properly assessing your students properly or sucks as an instructor or most of the students in the course are lazy. From my experience in those courses (as someone who did well was labeled the \"curve wrecker\" even by instructors) the problem was sometimes improper assessments, but more often the instructor just sucked. It is rare that the majority of the students are just lazy. Off the top of my head I can think of 2 courses with the same instructor where the majority of the students were just lazy because I got over a 95% in both by putting in minimal effort even though the course average was below a 70%.",
      "author": "squirrel8296",
      "created": 1620694292,
      "upvotes": 5,
      "replies": {
        "gxol0lt": {
          "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxol0lt/",
          "text": "Unfortunately there aren’t a lot of incentives for professors to actually be good teachers. As long as you continue to publish and bring in grant money no one cares. Even as a grad TA the only thing that affects renewal of my contract is good grades, they don’t care if I suck as an instructor.",
          "author": "Gerardo1917",
          "created": 1620698606,
          "upvotes": 5,
          "replies": {}
        },
        "gxod59n": {
          "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxod59n/",
          "text": "yeah i wish my college weeded out or at least did something about professors who teach like this",
          "author": "mxddiecxmpbell",
          "created": 1620694526,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gxo0vu7": {
      "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxo0vu7/",
      "text": "I just took thermo and first two midterm averages were 49% and 56%.  Professor said he was disappointed with us and made midterm 3 practically impossible.  He also refused to round my grade up 0.1% to an A- because I clearly didn't master the material",
      "author": "drock121",
      "created": 1620688325,
      "upvotes": 7,
      "replies": {
        "gxqlerj": {
          "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxqlerj/",
          "text": "Wow what scores did you get on everything else to get such a high final grade?",
          "author": "bambiamberam",
          "created": 1620746506,
          "upvotes": 2,
          "replies": {
            "gxqm2xa": {
              "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxqm2xa/",
              "text": "I got Bs on all written midterms 100, 90,90, 100 for online midterms, 100 for online final and a 73 on the written final exam. Kinda strange but this class has two examss, one written and one online, for each midterm.  Hw grades were 80-100.  \n\nThey gave us some extra credit because people did so bad for some exams, which definitely helped.",
              "author": "drock121",
              "created": 1620746792,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gxnq68f": {
      "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxnq68f/",
      "text": "In my last semester of third year i took an Algorithms course. The class average for the midterm was 40%, curved to into a 51%. Never have i truly believed i would fail a class because the contents were near impossible to grasp. I failed an Ochem midterm before but knew if i retook it and wasnt a lazy, sad bitch i could pass. This midterm... I genuinely thought if i failed, thats it, doesnt matter how hard i try, that class was ass.\n\nIdk, prof ended up curving the class pretty hard. I failed the midterm WITH CURVE at 47% and came out with a 70%. Not amazing but honestly wtf. Why was the class such a hell hole.",
      "author": "OatmealRaisin254",
      "created": 1620683172,
      "upvotes": 7,
      "replies": {
        "gxpiibx": {
          "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxpiibx/",
          "text": "One professor I had made her class percentages so that if you failed the final, your grade would still go up. I went from a C- to a B+ because I got a D on the final.",
          "author": "CapriciousSalmon",
          "created": 1620722871,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gxnmqth": {
      "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxnmqth/",
      "text": "[deleted]",
      "author": null,
      "created": 1620681623,
      "upvotes": 14,
      "replies": {
        "gxnmuy8": {
          "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxnmuy8/",
          "text": "man i’m premed and i feel like all of my professors act like this. stay strong my friend",
          "author": "mxddiecxmpbell",
          "created": 1620681673,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gxnkqjw": {
      "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxnkqjw/",
      "text": "I always found it weird how professors would be like \"So, the average for this midterm was a 63%, which is comparable to the performances of previous semester. Good job everyone, pat yourselves on the back, bla blah blah\" Like wtfff?? Shouldn't you be aiming to increase the average scores instead of treating poor performance like a normal thing?",
      "author": "Narguin2",
      "created": 1620680729,
      "upvotes": 44,
      "replies": {
        "gxnl0e1": {
          "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxnl0e1/",
          "text": "exactly. it would be one thing if they saw how bad everyone did and either curve the test or at least try to help the students understand where it went wrong. but we never did that. and the other bio 329 had a test average of i believe in the 60-65%, which is still pretty bad but not horrific",
          "author": "mxddiecxmpbell",
          "created": 1620680850,
          "upvotes": 14,
          "replies": {
            "gxpifd4": {
              "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxpifd4/",
              "text": "I had a professor who did that. He would always make the quizzes super difficult and he realized we were suffering because of it. And it was a Gen Ed class no less. So he would curve grades. I ended up with a B+ so I can’t complain.",
              "author": "CapriciousSalmon",
              "created": 1620722789,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gxovdca": {
          "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxovdca/",
          "text": "Eh, at the end of the day, the prof's ability to increase scores on comparable assessments of the material is limited. If they're teaching a topic which is at all difficult, even the best teacher in the world will still have some failures, due to limits on their student's grasp of prerequisite knowledge, time constraints, willingness to devote effort to learning the material, and of course just average mental acuity. \n\nPoor performance may be a perfectly normal thing, because the average student may not be capable of mastering the material to the prof's satisfaction. \n\nAnd sure, they could make the assessments easier, but that doesn't solve the problem, it just hides it.",
          "author": "BarackTrudeau",
          "created": 1620704403,
          "upvotes": 5,
          "replies": {
            "gxpigjv": {
              "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxpigjv/",
              "text": "I think it does depend on the class. If it’s a Gen Ed I would probably be a bit more lenient since most people are only taking the class because they have to.",
              "author": "CapriciousSalmon",
              "created": 1620722821,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gxr5eka": {
          "link": "/r/CollegeRant/comments/n9efxo/having_a_50_test_average_is_not_a_good_thing/gxr5eka/",
          "text": "That's the problem. It IS a normal thing for those professors. They've never had repercussions for having shitty average scores so they continue doing whatever they call teaching and just say oh well",
          "author": "DontcheckSR",
          "created": 1620754785,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634061733
}