{
  "sid": "p5us3i",
  "link": "/r/CollegeRant/comments/p5us3i/do_any_other_sophomores_still_feel_like_freshmen/",
  "title:": "Do any other sophomores still feel like freshmen despite surviving one of the most ridiculous school years of all time?",
  "text": "Like I still have to catch myself when I'm about to select \"freshman\" on surveys because I'm not a freshmen.\n\nIm a sophomore. I've already been through 2.5 semesters of college, 11 classes, and survived with a 3.9 GPA all while the world was burning as we all collectively dealt with the aftermath of a once-in-a-century pandemic and everything else that made the 20-21 school year a complete dumpster fire.\n\nAnd yet despite all that, I constantly have to remind myself that I'm a sophomore, not a freshman. Hell, half the time I remind myself that I graduated high school because the only thing I got for that was my diploma unceremoniously mailed to me. Fuck, I only have a vague idea of what my campus looks like thanks to virtual tours and a student program event where I was finally on campus for the first time ever.\n\nWhere I almost immediately gave myself a panic attack getting lost because I had no idea what the jumble of letters and numbers that are supposed to indicate locations meant. You know, because the past year has been filled with Zoom links, so I never needed to know?\n\nEven once I eventually did figure out the format (it turns out it's two letters for the building, one number for the floor, and two numbers for the room) and eventually made my way into the room, I realized I had nowhere specific to go.\n\nThere were plenty of seats of course, but I had no one specifically that I had to sit next to despite the array of familiar faces from our Zoom meetings. We knew each other but at least for me, no one really bonded outside the context of Zoom meetings. Which especially stung seeing the juniors and seniors having happy reunions after a year apart while mentoring the freshmen\n\nIt just feels like the COVID-19 freshmen that are now the semi-post-pandemic sophomores are in a really weird spot. \n\nOn one hand, we still have some amount of experience to the point where we don't seem to get the same amount of \"coddling\" and \"hand-holding\" that the freshmen get in the form of orientations and campus tours and aid for transitioning to college life.\n\nBut unlike the juniors or seniors, we don't have an already established pre-pandemic college life that we can happily go back to now that the days of mostly remote classes and limited time on campus is starting to end. We spent an entire school year in isolation from our classmates and faculty and most of had no meaningful bonding despite seeing these people for weeks.\n\nWe also have little to no experience with what makes college college outside of the academic stuff, a lot of which doesn't exactly apply to in-person learning since, let's be honest, a lot of us took advantage of the lax policies and minimal proctoring to makes things...easier to say the least\n\nMaybe it will get better once the semester starts and things get into full swing, but for now, as someone who will officially be a sophomore this time next week, I'm just feeling all the anxiety and dread from freshmen year without the same reassurance and guidance.",
  "author": "sunnirays",
  "created": 1629166968,
  "over_18": false,
  "upvotes": 81,
  "upvote_ratio": 0.99,
  "comments": {
    "h9dhary": {
      "link": "/r/CollegeRant/comments/p5us3i/do_any_other_sophomores_still_feel_like_freshmen/h9dhary/",
      "text": "I'm an international student. I spent my freshman year on campus, until March 2020 of course cause that was when we were all sent home. Took my first semester of my sophomore year online and decided, fuck it, I'm not doing this online school shit no more. Took spring 2021 semester off and I will come back to school this fall so YES, I feel you, I feel like a freshman again after 2 YEARS 😱 This is ridiculous lol",
      "author": "Competitive_Space_43",
      "created": 1629260229,
      "upvotes": 3,
      "replies": {}
    },
    "h98tq1x": {
      "link": "/r/CollegeRant/comments/p5us3i/do_any_other_sophomores_still_feel_like_freshmen/h98tq1x/",
      "text": "I’m feeling this 100%. Luckily I joined student government so I know some people from that, but I’m honestly dreading starting classes next week. I’m excited of course, but I didn’t really make any friends last year and I have an apartment as opposed to a dorm so I’m extra worried about meeting people. I’m not entirely shy, and I have my roommate, but I’ve definitely been mourning the college experience I had been building up in my head for years. Like you said, hopefully it will get better as things get into full swing, and I’m trying to be optimistic but we are definitely in a weird spot. On top of that, a lot of the other sophomores I am friends with on Snapchat/follow on Instagram seem to have already made close friends either from living in the dorms last year (one per room) or somehow from connecting online. I feel behind, but I’m trying to stay positive. We will get there eventually!",
      "author": "bullwinkle1119",
      "created": 1629170095,
      "upvotes": 3,
      "replies": {}
    },
    "h98tpc6": {
      "link": "/r/CollegeRant/comments/p5us3i/do_any_other_sophomores_still_feel_like_freshmen/h98tpc6/",
      "text": "I’m a junior and still feel like a freshman. Spring Semester of Freshman year sent us home. Sophomore year was online. Currently in person for Junior year, but who knows what might happen now. Transferred due to old school still being 100% online this year. \n\nI’ve basically had the “real” college experience for one semester. A lot of the friends incoming Juniors had didn’t even bother coming back for the full year of online school, since it was easier to just stay at home.",
      "author": "MuskiePride3",
      "created": 1629170084,
      "upvotes": 27,
      "replies": {
        "ha995wb": {
          "link": "/r/CollegeRant/comments/p5us3i/do_any_other_sophomores_still_feel_like_freshmen/ha995wb/",
          "text": "Same! People ask what grade I am, I'm like, \"a junior by age/years in school, a senior by credits, and a freshman by what I feel like internally...\"",
          "author": "shirbert6540",
          "created": 1629867429,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634061496
}