{
  "sid": "pmk0t6",
  "link": "/r/CollegeRant/comments/pmk0t6/advicerant/",
  "title:": "Advice/rant",
  "text": " Context with college: I applied to a lot of colleges and was accepted to many of them. I narrowed down my choices and settled on one, talked it over with my parents, and sent in the deposit, and started planning class schedules and looking for roommates. A month later my parents want to talk to me and explained that they misinterpreted the total cost of going to the college I picked. They said I was going to need to go to the local college that my brother was also attending. So literally all by myself I needed to cancel everything and try and set everything up with the local college. I did all of this without a word of complaint and got 0 sympathy from anyone. Even worse the university couldn't offer me anything since it was past the deadline for scholarships and tried to offer me high-interest loans (which felt more insulting than anything). I tried shrugging it off and joined AFROTC during the fall semester and did well until I was medically disqualified (my eyesight is absolutely awful) right at the end of the semester without warning. Literally a week before final exams I was devastated, stressed, burnt out, and couldn't focus on studying. I did ok/well on every exam except math where I went from an A to a C- which put me under the limit to take Physics (a very critical class) and messed up the whole schedule I planned out two months before (and had already signed up for). I tried petitioning for a waiver since I was only a few percent away from the limit and because it was an honors class. I emailed the department multiple times and didn't get a response until three days before the beginning of the semester where I was automatically unenrolled from Physics and I needed to scramble to fill my schedule with classes that I needed to graduate/fill my schedule. I also did this all by myself.\n\nI'm starting my second year in a few days and I'm not really looking forward to any of my classes (mediocre teachers/a few heavy classes) and I just feel lost. Has anybody else gone through this?",
  "author": "RWriterG",
  "created": 1631412156,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.99,
  "comments": {
    "hclihe4": {
      "link": "/r/CollegeRant/comments/pmk0t6/advicerant/hclihe4/",
      "text": "lol yup. Sometimes life doesn’t pan out exactly how you want. You have to adapt, accept it and then, learn from it. If you don’t learn from these experiences then, you’ll probably make the same mistake twice which is worse. \n\nKeep your head up. You’ll be fine.",
      "author": "majoroofboys",
      "created": 1631473527,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634062162
}