{
  "sid": "ramx9a",
  "link": "/r/CollegeRant/comments/ramx9a/my_college_is_the_most_toxic_relationship/",
  "title:": "My college is the most toxic relationship",
  "text": "I hate my college. I can’t really take this shit anymore. I am a senior but i really can’t do this. Iam on the edge, literally. This place just keeps on ruining my life inside out. I cant hangout with my gf. I cant catch-up with my friends. All i do is sit at home, submit assignments and bla bla bla.\nMy gpa won’t matter after college from where i am, it would literally be just a number. College keeps on stressing me and i rly rly cant i want to cry. My college is 5 years and i keep on motivating myself that ive passed the previous 4 and only 1 (6 months) to go but meh i cant.\n\nI always regret choosing this major (petrochemical engineering) and this college. I enrolled into this major for some reasons (that i prefer not to speak of). \n\nIdk what to do or how to act but iam like 👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼",
  "author": "kimotata",
  "created": 1638839546,
  "updated": 1639517973,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hnnnbt7": {
      "link": "/r/CollegeRant/comments/ramx9a/my_college_is_the_most_toxic_relationship/hnnnbt7/",
      "text": "Must be nice to have someone to love you. Imagine doing all that and being alone. Stuck in an empty void, a shell of yourself looking at the mirror completely unhappy with the person you’ve become.",
      "author": "majoroofboys",
      "created": 1638921413,
      "upvotes": 2,
      "replies": {
        "hnnnraj": {
          "link": "/r/CollegeRant/comments/ramx9a/my_college_is_the_most_toxic_relationship/hnnnraj/",
          "text": "Yeah thanks, needed to vent sorry as me and my gf were having some issues lately. Idk maybe bec of my midterms i stress out and lose my shit. Idk fr fr fr",
          "author": "kimotata",
          "created": 1638921617,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}