{
  "sid": "q27oog",
  "link": "/r/CollegeRant/comments/q27oog/my_mental_health_is_at_an_all_time_low_because_i/",
  "title:": "My mental health is at an all time low because I can't get into a good grad school",
  "text": "Post got removed from r/college, so here I am.\n\nI'm not sure if this is how it works everywhere else, but the university I attend has a number of colleges affiliated to it; during examinations, answer scripts are always evaluated externally, that is, by professors of a different college under the same university.\n\nHowever, since the lockdown started and classes and exams began to be conducted online, our university declared that all answer scripts would be evaluated internally. Professors in all the colleges saw this as an opportunity to give their students a massive boost by evaluating their papers extremely leniently resulting in fantastic CGPAs. \n\nWell, all professors except the ones at my college. Our professors decided that now was the time to prioritise their \"integrity\" over all else, and graded our papers as strictly as they could, leading to my batchmates and I scoring significantly lesser than students of all the other colleges.\n\nMind you, it was our final semester and most of us aspired to study at some of the best universities in the country. Our college is also among the top 3 colleges in our state, so our grades shocked everyone (this issue got the attention of the press as well).\n\nAdmissions into graduate programmes started In early September, and 99% of the students from my class, including myself, have not been accepted anywhere. Not even into the sub-par institutions in the city.\n\nI had my entire career path meticulously planned out, and this just feels like such an insurmountable roadblock. I know I shouldn't let something like this discourage me, but I can't help it. It's so incredibly frustrating knowing that I deserve to go to a good university but I can't.\n\nMy anxiety is at its peak and I've been crying for days on end. Sorry for this essay and sorry if this is not the right sub but I just really had to get this off my chest.",
  "author": "imokareyouok",
  "created": 1633474381,
  "updated": 1634093865,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {}
}