{
  "sid": "rbsy1a",
  "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/",
  "title:": "Cheating classmates are going to get someone killed…",
  "text": "I’m in the nursing program and I have two classmates that are 100% cheating on all of the homework, tests, papers, and lab practices. The one girl is extremely two faced and backstabby. She’ll be your friend as long as she feels superior to you in some way, but the second she feels you’re surpassing her she’ll turn on you. The other girl is like her puppy and follows her around and does what she does. This girl really just wants to be a stay at home mom and genuinely does not want to be a nurse. \nThe only reason that they got into the program is because they did each other’s homework and took each other’s tests when everything was online. \nNow the cheating has gotten worse. I thought I was the only one who knew about it, but it turns out the ENTIRE cohort is aware and everyone is furious. Plus apparently, they openly talk about doing each other’s homework and quizzes. They both have been hit with plagiarism twice and I’m fairly certain that they’ve been reported at least half a dozen times. I think the one girl will drop and won’t be back in the spring, so if that happens the other girl won’t be able to cheat. That’s the general consensus at least. \nIt’s just so infuriating because the nursing program is hard and it’s serious. What if they fake their way and end up killing somebody?",
  "author": "popcornjellybeans88",
  "created": 1638974912,
  "updated": 1639869372,
  "over_18": false,
  "upvotes": 324,
  "upvote_ratio": 0.99,
  "comments": {
    "hnq6iys": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnq6iys/",
      "text": "This is terrible, as someone who is pursuing the medical field, you never want to hear this. You mentioned that they have been reported but I guess keep on reporting until something is done because this shouldn’t be happening in the first place.",
      "author": "ishan132456789",
      "created": 1638977437,
      "upvotes": 132,
      "replies": {}
    },
    "hnqeso5": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnqeso5/",
      "text": "[deleted]",
      "author": null,
      "created": 1638980774,
      "upvotes": 84,
      "replies": {
        "hnr9dk0": {
          "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnr9dk0/",
          "text": ">Cheating is always abhorrent, but when you’re in a life or death industry like medicine or engineering? \n\nI am glad that, as an English major, if I misinterpret *Waiting for Godot* or something, at least no one's going to die (most likely).",
          "author": "SavCItalianStallion",
          "created": 1638992471,
          "upvotes": 26,
          "replies": {
            "hnt8bcb": {
              "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnt8bcb/",
              "text": "They might die waiting...",
              "author": "CaptainMurphy1908",
              "created": 1639022566,
              "upvotes": 8,
              "replies": {}
            },
            "hnt5acq": {
              "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnt5acq/",
              "text": "LOL!",
              "author": "cajunsoul",
              "created": 1639021063,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hnqpsik": {
          "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnqpsik/",
          "text": "[removed]",
          "author": null,
          "created": 1638985019,
          "upvotes": 28,
          "replies": {
            "hnr7r4r": {
              "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnr7r4r/",
              "text": "[deleted]",
              "author": null,
              "created": 1638991861,
              "upvotes": 9,
              "replies": {
                "hnr84id": {
                  "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnr84id/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1638992003,
                  "upvotes": 17,
                  "replies": {}
                },
                "hnr8xtf": {
                  "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnr8xtf/",
                  "text": "Luckily for me (English major), in Canada it is possible to get through college while pursuing a humanities degree without taking on too much debt. You need some ingenuity, and might need to make some sacrifices, but it's not a debt trap if you play your cards right. I look at the tuition at some US schools, and I'm not sure how anyone (besides Jeff Bezo's kids) does it.",
                  "author": "SavCItalianStallion",
                  "created": 1638992309,
                  "upvotes": 7,
                  "replies": {
                    "hntb43f": {
                      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hntb43f/",
                      "text": "My parents are not rich and they are getting me through College (AND my two brothers) 100% debt free...so you simply must be exaggerating.",
                      "author": "Megadog3",
                      "created": 1639024017,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                },
                "hntb8r5": {
                  "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hntb8r5/",
                  "text": "lol what bullshit is this? There are plenty of non-STEM degrees worth pursuing, especially if you know what you want to do. \n\nI'm a Political Science major and I'm definitely not going to be working in a Coffee Shop.",
                  "author": "Megadog3",
                  "created": 1639024086,
                  "upvotes": 5,
                  "replies": {
                    "hntbhnr": {
                      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hntbhnr/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1639024217,
                      "upvotes": 0,
                      "replies": {
                        "hntbqjn": {
                          "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hntbqjn/",
                          "text": "Seems you've been brainwashed to think non-STEM = useless degree. \n\nI've not graduated, no, but I have been applying to jobs and I've gotten calls back and I've set up interviews with prospective employers. But you're right. My degree is totally useless.",
                          "author": "Megadog3",
                          "created": 1639024345,
                          "upvotes": 9,
                          "replies": {}
                        }
                      }
                    },
                    "hnx7lad": {
                      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnx7lad/",
                      "text": "See, you SAY that...\n\nCould be worse, though, you could be a Communications major.",
                      "author": "TrailLemec",
                      "created": 1639095744,
                      "upvotes": 1,
                      "replies": {
                        "hnxam3h": {
                          "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnxam3h/",
                          "text": "I SAY that because I’ve already applied to positions post-grad and I’ve gotten calls back and I’ve set up interviews with employers.\n\nLike for real, what gives you the idea that a Political Science degree is useless? Do you have any idea how many Government jobs, corporate jobs *working with* the Government, non-profits, campaigns, political analyst, political consulting, and on and on jobs there actually are? Maybe do even just a little bit of research before claiming to know everything about how useless my degree is.\n\nThe fact is, there are thousands of jobs that my degree is extremely applicable to. Do people think there are literally only STEM professions in the world or something?",
                          "author": "Megadog3",
                          "created": 1639097108,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnrhshw": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnrhshw/",
      "text": "If they're cheating, they'll never pass the boards because they won't know the material.",
      "author": "swearingino",
      "created": 1638995681,
      "upvotes": 22,
      "replies": {
        "hnrwx9m": {
          "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnrwx9m/",
          "text": "Honestly, that is my biggest relief when dealing with these two. They will absolutely not pass the boards IF they make it that far. The one girl is already telling everyone she’s probably gonna drop and the other girl won’t be able to pass the classes without cheating with her friend.",
          "author": "popcornjellybeans88",
          "created": 1639001491,
          "upvotes": 12,
          "replies": {}
        },
        "hnsmjxn": {
          "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnsmjxn/",
          "text": "Yep. Love that boards are there as the final weed through. Let them waste their time if reporting isn’t working.",
          "author": "Kakyoin-Here",
          "created": 1639012641,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hnqjoms": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnqjoms/",
      "text": "It's one thing if you look on quizlet for like history 101 homework. (Still not good)\n\nBut it's a whole different ballgame when you're cheating in your major, you need to actually know wtf you're doing.\n\nThis sounds horrifying. People in the medical field can not cheat their way through.",
      "author": "SkeezySkeeter",
      "created": 1638982663,
      "upvotes": 81,
      "replies": {
        "hnqpisr": {
          "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnqpisr/",
          "text": "[removed]",
          "author": null,
          "created": 1638984914,
          "upvotes": 16,
          "replies": {
            "hnt5kaa": {
              "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnt5kaa/",
              "text": "Oh, trust me, they know. *Especially* in a limited-entry program like nursing.",
              "author": "cajunsoul",
              "created": 1639021195,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnquq5v": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnquq5v/",
      "text": "REPORT THEM!!! You are right. They will end up killing someone. I know it's hard and you probably don't want to get involved, but consider how you would feel if they went out in the field and treated one of your loved ones. You are in a field where your work matters a great deal. It's important. Please don't let these cheaters bring down your chosen profession in any way.",
      "author": "cometdogisawesome",
      "created": 1638986891,
      "upvotes": 15,
      "replies": {}
    },
    "hnqleue": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnqleue/",
      "text": "Sounds like some nursing students at my college. I peer tutor at my college for English and other subjects and a LOT of nursing students use Quizlet for their assignments and other work. You are completely right that they are going to end up killing someone.",
      "author": "LibertarianLasagna",
      "created": 1638983324,
      "upvotes": 12,
      "replies": {}
    },
    "hnr9a7v": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnr9a7v/",
      "text": "It scares me how often fields that involve the care for vulnerable people attract people like this. I feel like they're looking for an outlet for their superiority complexes in a dangerous way.",
      "author": "40percentdailysodium",
      "created": 1638992437,
      "upvotes": 7,
      "replies": {
        "hnrxypl": {
          "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnrxypl/",
          "text": "This absolutely the one girl. She has said that she doesn’t ever want to work as a  nurse and that she just needs the letters behind her name so she can become a manager somewhere…..",
          "author": "popcornjellybeans88",
          "created": 1639001906,
          "upvotes": 4,
          "replies": {
            "ho030dp": {
              "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/ho030dp/",
              "text": "Let's pray she becomes a manager of something that isnt healthcare related lol.",
              "author": "SkeezySkeeter",
              "created": 1639153161,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnrq1sl": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnrq1sl/",
      "text": "I am currently in a nursing program and they make it so hard to cheat. All of our tests are proctored and some assignments have to be done on a lockdown browser. It would probably take more work to cheat than to actually sit down read and do the assignments 💀. I can imagine how frustrating it is too see people cheating on assignments while you’re working hard to understand the material. Nursing school is not easy and should not be taken lightly.",
      "author": "emewhi",
      "created": 1638998804,
      "upvotes": 7,
      "replies": {}
    },
    "hnsm9kz": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnsm9kz/",
      "text": "When I was in nursing school we were told that if the professors aren’t taking something seriously, you bring it up to the people above them. I highly recommend that you and other annoyed classmates get together and prepare something for the next step up. If you haven’t gone to your director yet I’d do that. The director was one above the professors at my school, but if you have someone in between the two go to them. Nursing follows the hierarchy heavily. You don’t just go straight to the Dean of the school or your state nursing board. It’s a long process but please take it up a level if the professors aren’t caring. That is ridiculous",
      "author": "Kakyoin-Here",
      "created": 1639012511,
      "upvotes": 5,
      "replies": {
        "hntn9bu": {
          "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hntn9bu/",
          "text": "profs almost always care. it's just that they get beaten down by the administrative process that is designed to be lenient on students. a lot of first offenses are not recorded and end up with alternative punishment like failing the assignment or course, so the next time they are caught cheating it is viewed as another \"first offense,\" and it happens over and over again.\n\nthe good schools allow that alternative punishment but also record the first offense so the second time is an actual punishment.",
          "author": "wobbletelescope",
          "created": 1639031185,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnrz4tn": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnrz4tn/",
      "text": "If you haven’t already reported it yourself, you should report it to your professor and/or your college’s academic integrity office.",
      "author": "Fleur498",
      "created": 1639002373,
      "upvotes": 3,
      "replies": {}
    },
    "hnsf6g0": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnsf6g0/",
      "text": "That’s pretty much exactly how I imagined nursing school",
      "author": "TheFlamingLemon",
      "created": 1639009320,
      "upvotes": 2,
      "replies": {}
    },
    "hntokmk": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hntokmk/",
      "text": "They can’t pass licensing exams like that. Let them waste their money.",
      "author": "FutureMDdropout",
      "created": 1639032100,
      "upvotes": 2,
      "replies": {}
    },
    "hntr5le": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hntr5le/",
      "text": "This is so wild to me because I wanted to go to nursing school in my early 20s but in California it was so in demand that all the schools basically had a lottery system. I didn’t want to wait so I just moved on to something else. I say this because I intended to go into the field seriously and with guest care as my highest priority, so it kind of pisses me off that these two not only got in but could seriously endanger their patients",
      "author": "welc0met0c0stc0",
      "created": 1639033984,
      "upvotes": 1,
      "replies": {}
    },
    "hnyez3g": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hnyez3g/",
      "text": "Im in school for nursing currently too and I heard of similar issues in the cohort ahead of me. Cheating your way through a major like nursing is pretty stupid as this information is  fully applicable to real life. Honestly, I wouldn't worry about it. You cant cheat your way into an NCLEX license, you can't cheat a job interview. You cant cheat the exit HESI. Cheating for them will only get them so far, and the distance for them will be a couple years with literally nothing to show for it.",
      "author": "Lufaro",
      "created": 1639116237,
      "upvotes": 1,
      "replies": {}
    },
    "hoxtsxc": {
      "link": "/r/CollegeRant/comments/rbsy1a/cheating_classmates_are_going_to_get_someone/hoxtsxc/",
      "text": "Why are they even in the medical field if they are so uninterested in it that they cheat",
      "author": "Rabbitboi69",
      "created": 1639760644,
      "upvotes": 1,
      "replies": {}
    }
  }
}