{
  "sid": "qglyp9",
  "link": "/r/CollegeRant/comments/qglyp9/i_seriously_regret_where_i_went_to_undergrad/",
  "title:": "I seriously regret where I went to undergrad",
  "text": "Warning: Long and whiney post ahead \n\nI am a senior English and Art History major at UNC Charlotte. I know so many students who love this school, and it all of my experiences have been bad. In fact, most of my experiences have been fine. I just know that this place was never a good fit for me and I wish I would have transferred a long time ago. \n\nFlashback to 2017-2018, my college application season. My parents are anti-loan (I’m sure I’ll appreciate that in the future) and had already saved up money for me to go in-state. I am very fortunate in this regard. I definitely didn’t want to stay in NC, but I realized that it was what I would have to do. I applied to UNC Chapel Hill regular decision. Thought UNC wasn’t my overall first choice, I knew I would like it best over the other public universities in NC. My mistake was applying regular decision, I think. I wanted to improve my SAT score, but I think I ended up shooting myself in the foot. Four of my classmates at my very small school were accepted Early Action, and they all go there now. The difference between me and them? Application round and they all took AP Calculus. \n\nMy great uncle was a professor at UNC, and I included this in my application. He even had his own library. I wrote quality essays and had multiple teachers edit them. I went to North Carolina Governor’s School. I had good letters of recommendation. My SAT was only a 1220 (690 ENG, 530 Math 😅), but I was the only student at my school to make a 5 on the AP Lang exam. I had a 4.2 weighted GPA and 4.0 unweighted. I was involved in multiple extracurricular activities and held leadership positions in more than one of them. I understand that UNC is a competitive school, I’m not denying that. There are plenty of people with better stats than me, but I felt like I still stood a chance all things considered. \n\nI was rejected at Chapel Hill but accepted at Bryan Mawr. My parents wouldn’t allow me to attend because we are not eligible for financial aid, and I have two younger brothers that they would like to send to college too, of course. While my other classmates were celebrating their acceptances for a senior class event, I was crying in the bathroom and my parents had to take me home. My cousin goes there now, and is able to study for a year at Trinity College Dublin, while UNCC cancelled my study abroad THREE TIMES due to Covid-19. Study abroad was one of the only things that kept me going in college, and now that has been taken away from me too. Must be nice to be one of the “beautiful people”. \n\nI gave UNCC an honest shot, because a part of me was just glad to be away from my small town and on my own for the first time. The first semester was okay. I made some friends, earned a spot on the Chancellor’s List, and enjoyed exploring the city. I was still thinking I would transfer at the end of my first year, but then I fell in love in early spring. \n\nMy relationship with my ex lasted for a year and nine months. It was toxic from the beginning and I’m glad I am out of it now, but I cried constantly for seven months after the fact. \n\nOverall, I’m ready for college to be done. I don’t like Charlotte, I don’t like UNCC, and I’m struggling to see the light at the end of the tunnel. I feel like I’m never gonna reach my full potential because I went to the wrong school for me, and from there I was denied one of my greatest dreams of studying abroad. \n\n\nTLDR: senior in college, don’t like my university, study abroad cancelled for third time while it wasn’t at another state college, and the whole thing has me miserable",
  "author": "No_Mobile9005",
  "created": 1635300132,
  "updated": 1636192040,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hi73e2d": {
      "link": "/r/CollegeRant/comments/qglyp9/i_seriously_regret_where_i_went_to_undergrad/hi73e2d/",
      "text": "Sounds like you’re more regretting the relationship and how it prevented transferring on top of the study abroad canceled. \n\nIs it really going to ruin your career, though? Are you considering grad school? \n\nAnd it’s fine to whine on here, that’s what the sub is for. I’ve already graduated, but I could write an epic rant on my anger towards my parents who didn’t just tell me straight up that I’m staying in state.",
      "author": "dalej42",
      "created": 1635300716,
      "upvotes": 1,
      "replies": {
        "hi745o2": {
          "link": "/r/CollegeRant/comments/qglyp9/i_seriously_regret_where_i_went_to_undergrad/hi745o2/",
          "text": "Yeah, that’s accurate. I regret the relationship, but I also don’t. I’m the kind of person who believes that if you’re meant to learn something, you will eventually, so I guess it was better I had that shitty relationship in college than later in life. \n\nI am considering grad school and would like to do so overseas, but I’m not sure if grad school is for me. I would like to become an arts journalist, but I’ve seen so many mixed opinions about the value of J-school for the cost, when you could just be working your way up the ladder. That’s another conversation though \n\nI get what you’re saying. Having finances or parental expectations limit your options totally sucks. I think my parents would have let me go out of state if I would have gotten a scholarship, but despite how many I applied to I only got a small handful (less than $5,00 total). I can relate to the “too poor for college, too rich for financial aid” trope pretty well.",
          "author": "No_Mobile9005",
          "created": 1635301068,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hijxlzf": {
      "link": "/r/CollegeRant/comments/qglyp9/i_seriously_regret_where_i_went_to_undergrad/hijxlzf/",
      "text": "Damn, I'm sorry this is your experience. I am in a tough spot with where i am at rn. I am a sophomore transfer student. I transferred from UMass Dartmouth to UMass Amherst. UMassD cut its division 3 swim team I was recruited and committed to a month before classes started(non covid reasons, school lied its way around the reason why, just to reinstate the women's swim team and not the men's after I left). Then because of covid we were told to stay home. I transferred for this year, I had the option to go out of state, but chose to stay in state. When I toured this school originally I did not feel like I belonged, and right now that's pretty much true. Came here partially because it had a club swim team, did 3 days of tryouts and was told to try again next semester due to space. Kind of wish my parents did not keep trying to get me to stay close to home, should of just gone with going out of state even though I was scared to. I guess I will try to transfer again if my spring semester here doesn't improve, having disappointing semester after semester is starting to get draining, especially since high school was not great. But idk if I want to put effort into transferring again. \n\nI hope you are able to make the best of your final year, stay strong.",
      "author": "Reaper_gaming_afk",
      "created": 1635536547,
      "upvotes": 2,
      "replies": {}
    }
  }
}