{
  "sid": "mhumew",
  "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/",
  "title:": "College readings are impossible",
  "text": "Am I the only one who get super frustrated trying to read an article for a college assingment where the author focuses more on pumping out as many five-dollar words in a row as they can than actual readability or comprehension? (I know, ironic given my run-on, but cut me some slack. I've been reading anthropology articles all day). Anyways, if I have to google every other word, I'm probably not going to finish the article. I get it, it's nice to use complicated words that express your meaning better than simpler ones, I like to use them too. Still, as a college student I would at least like to be able to read and comprehend what I'm supposed too in a reasonable amount of time. It's really annoying and I wish college professors would choose articles with simplified wording for complex topics. I'm not getting a whole lot out of an article if I can't understand it.",
  "author": "LillyAllenAirBalloon",
  "created": 1617281517,
  "over_18": false,
  "upvotes": 204,
  "upvote_ratio": 0.98,
  "comments": {
    "gtei9kd": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gtei9kd/",
      "text": "Yes, I have at least 3, 7-10 page readings I have to write about a week. You’d think you’d get better at it after doing it for so long, but it never does. What I do, is I just read the entire thing without stopping, maybe taking occasional notes on what I’m getting, and then see if I come come up with a general summary. Also, looking up whatever you’re reading + summary (although a lot of the stuff I read, and perhaps you read, is so down the rabbit hole it won’t be on the internet) and then when you think back to the details of the paper it will all make sense hopefully. Good luck, it’s still hard as shit though.",
      "author": "t2300thb48rus7",
      "created": 1617582821,
      "upvotes": 1,
      "replies": {}
    },
    "gtbzh48": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gtbzh48/",
      "text": "[removed]",
      "author": null,
      "created": 1617528968,
      "upvotes": 2,
      "replies": {
        "gtio543": {
          "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gtio543/",
          "text": "Flashbacks from anthro class. I had to read 20 page papers for what?! Ended up skimming them and luckily passed with an A lmao",
          "author": "spicyystuff",
          "created": 1617670531,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gt3p2b1": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gt3p2b1/",
      "text": "People just don’t appreciate brevity like they used to",
      "author": "LeeroyDagnasty",
      "created": 1617330780,
      "upvotes": 3,
      "replies": {}
    },
    "gt3b5g2": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gt3b5g2/",
      "text": "Flowery language",
      "author": "infinitywee",
      "created": 1617322702,
      "upvotes": 2,
      "replies": {}
    },
    "gt388mp": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gt388mp/",
      "text": "Yeah, when articles get too fancy, the left side of my face begins to droop. Keep it simple!",
      "author": "heyimjulia123",
      "created": 1617321073,
      "upvotes": 1,
      "replies": {}
    },
    "gt319c7": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gt319c7/",
      "text": "It's written for their peers, not for students. Learning a concept from a textbook makes me feel stupid, and reading a concept I'm already familiar with fills me with relief because I didn't have to translate or base my knowledge on their jargon-filled gobbledegook.",
      "author": "muffinfight",
      "created": 1617317300,
      "upvotes": 13,
      "replies": {}
    },
    "gt316zo": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gt316zo/",
      "text": "Dude, yes! Just say what you gotta say. It doesn’t have to be all fancy! I’m having the hardest time with my current course but last semester was able to fly thru 2 classes and do leisure reading. This semester, with this course, I’m dying!",
      "author": "Luckygyrl83",
      "created": 1617317266,
      "upvotes": 1,
      "replies": {}
    },
    "gt2x0uk": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gt2x0uk/",
      "text": "Well this is what happens when you focus on STEM without the Humanities, you end up with scientists that are unable to communicate their knowledge to the vast majority of people.",
      "author": "Wareve",
      "created": 1617315117,
      "upvotes": 12,
      "replies": {}
    },
    "gt1vm5k": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gt1vm5k/",
      "text": "They're not impossible if it's a PDF and you're not having a quiz on it only discussions post but at the end of the day all you really need to do is skim it and read the conclusion and abstract and if you don't have a quiz Central f the question that's what I always do",
      "author": "Old-Measurement4504",
      "created": 1617297706,
      "upvotes": 22,
      "replies": {}
    },
    "gt1qsvn": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gt1qsvn/",
      "text": "GOD YES\nlike i understand it’s a formal paper or whatever and even if i know what the words mean, there’s nothing that fried my brain more than an overly wordy sentence that uses giant words just to sound smarter",
      "author": "poppycatt",
      "created": 1617295527,
      "upvotes": 29,
      "replies": {}
    },
    "gt1oztd": {
      "link": "/r/CollegeRant/comments/mhumew/college_readings_are_impossible/gt1oztd/",
      "text": "I feel this on a spiritual level. Don't just assign the hardest piece of work you can find, assign something that won't make your students want to jump out of windows.",
      "author": "Floppy_Onion",
      "created": 1617294712,
      "upvotes": 49,
      "replies": {}
    }
  },
  "updated": 1634063401
}