{
  "sid": "qne0dc",
  "link": "/r/CollegeRant/comments/qne0dc/college_graduate_and_cant_find_a_job/",
  "title:": "College graduate and can't find a job",
  "text": " \n\n# \n\n&#x200B;\n\nI graduated with a B.A in Economics degree in May and I'm still stuck working in the hospitality industry. Pretty sure I can't find a job because I went to a shitty school (top 300). If I went to Wharton or something I'd have no problem getting recruited. My life is hell",
  "author": "Fun_Specific_6527",
  "created": 1636127388,
  "updated": 1636193343,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.85,
  "comments": {
    "hjfvsoh": {
      "link": "/r/CollegeRant/comments/qne0dc/college_graduate_and_cant_find_a_job/hjfvsoh/",
      "text": "Well.. not exactly. Did you do internships, spring/taster weeks, volunteering, work, research or anything? What GPA did you graduate with and **what area are you looking to work in**? Having connections through those not only opens doors but can get you great rec letters and fills out your CV.",
      "author": "CarrawayLights",
      "created": 1636133675,
      "upvotes": 6,
      "replies": {
        "hjg9vpo": {
          "link": "/r/CollegeRant/comments/qne0dc/college_graduate_and_cant_find_a_job/hjg9vpo/",
          "text": " Also most jobs look for experience. Which I hope he or she did internships and volunteer work.",
          "author": "Forever_ForLove",
          "created": 1636139070,
          "upvotes": 3,
          "replies": {}
        },
        "hjguo3l": {
          "link": "/r/CollegeRant/comments/qne0dc/college_graduate_and_cant_find_a_job/hjguo3l/",
          "text": "I did one two month internship the summer of 2018. My GPA was okay, but I didn’t put it on my resume. I’m mostly looking to work in banking.",
          "author": "Fun_Specific_6527",
          "created": 1636146879,
          "upvotes": 1,
          "replies": {
            "hjgwn9w": {
              "link": "/r/CollegeRant/comments/qne0dc/college_graduate_and_cant_find_a_job/hjgwn9w/",
              "text": "Banking is *extremely* competitive. A top tier university will get your foot in the door BUT going to a low ranked or even a barely known school will not mean you cannot do banking. However, in general (and especially as a non-target school student) you will need exceptional extracurriculars and a great GPA, aim at +3.5.\n\nNow ECs mean internships at the banks, specifically the ones you're interested in, doing relevant work experience, networking, maybe some pro-bono work, or languages if thats something you're interested in.\n\nSo, if you're 'banking or bust' you need to start by thinking about how to improve your application. If your GPA is low and there is no way to get experience, maybe consider going for a masters.",
              "author": "CarrawayLights",
              "created": 1636147636,
              "upvotes": 7,
              "replies": {
                "hjh44zs": {
                  "link": "/r/CollegeRant/comments/qne0dc/college_graduate_and_cant_find_a_job/hjh44zs/",
                  "text": "I can’t afford grad school. I have 40k in student loans. Looks like I’m gonna be stuck in low wage jobs the rest of my life. I shouldn’t have went to college",
                  "author": "Fun_Specific_6527",
                  "created": 1636150576,
                  "upvotes": 1,
                  "replies": {
                    "hjj4vxc": {
                      "link": "/r/CollegeRant/comments/qne0dc/college_graduate_and_cant_find_a_job/hjj4vxc/",
                      "text": "**If you want real advice**: Stop whining and pushing yourself down, \"I’m gonna be stuck in low wage jobs the rest of my life\" yes you are if you're not going to do anything about it. But it will *NOT* be because of your degree. Do you really think a Harvard grad with a 1.0 is getting job offers thrown left and right because of the shiny name? No. They get them because of the names they've networked with and the experience they've had.\n\nWhat is your GPA? If it really is bad; study your ass off, take the GREs or GMATs and get a scholarship. Don't waste your time at grad school and actually do all the things I've mentioned in my previous comment. If you cannot do this due to financial reasons, save up and then go. IB pays a lot, having 40k isn't that bad and if you use everything out of that grad degree and decide banking isn't for you, you will have all of those skills for any job really.\n\nNow another option is to get work experience or volunteer and work yourself up. Get that admin desk job, in a few years you'll know the ins and outs and might be successful at securing an interview at the firm. Obviously this isn't going to be JP Morgan but you'll have a starting point.\n\nIf your GPA is good, what did you do during college? I mean anything, what did you spend your summers doing? During semesters, did you do anything but study? If so, what did you do? You can use that in the applications. Similarly depending on the stage of applications you've reached it can be something other than your GPA that is preventing you.",
                      "author": "CarrawayLights",
                      "created": 1636191199,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjijkmd": {
      "link": "/r/CollegeRant/comments/qne0dc/college_graduate_and_cant_find_a_job/hjijkmd/",
      "text": "Your GPA, school you went to and proactiveness (interships) all determine your job prospects. People who say they don't are the same people without work. I'm in computer eng at a good school (3.9 gpa) and have talked to several employers who have all told me this. The reason graduates can't find work is due to them thinking a degree is good enough. Your grades say a lot of your work ethic, you going to a good school means you had to work hard to get there and internships demonstrates initiative. Might sound harsh, but unfortunately this is the reality",
      "author": "menglish025",
      "created": 1636174764,
      "upvotes": 1,
      "replies": {}
    }
  }
}