{
  "sid": "qdv7ry",
  "link": "/r/CollegeRant/comments/qdv7ry/frustrated_undergrad/",
  "title:": "Frustrated Undergrad",
  "text": "\nHello there. I am a rising senior who is majoring in Neuroscience (finally decided) and minoring in Biology. Since August, I have been working in my first research lab and it’s been going pretty okay but I have had a slow build up of anxiety and anger towards my mentor. Im working with yeast and while it’s not really my forte, I am willing to learn and engage. I have not made any big big mistakes and always ask/double check with my mentor to make sure I am doing what I am suppose to do. However, they seem to be easily frazzled and scatter- brained in general. For instance, Ill present at lab meeting and I will say “oh hey, I did xyz remember? Because yesterday you said to do xyz” and they’ll go “…..I dont remember that???”. They also seems to get frazzeled when I do a procedure that we went over yet I may have done it wrong (i.e. not specifying which plate to plate the yeast on  ex: YPD or NAT + YPD) and I feel stupid yet angry cause they did not specify that this time I was suppose to slightly change it for different results. My mentor told me when I first started “This is your project take initiative” and I want to but Im also taking classes and Im not used to just preforming experiments as Ive had lab classes but the TAs did the crucial part. Also I cannot be in the lab by myself after 6 even when I feel confident that I know what I should do. When I need help with protocols I rely on my other colleagues who are grad students to help me. They are nice. I just feel frustrated and give up trying to be the best lab “citizen” I can be. Ik life is not always going to yield the nicest people but Im going to stick it out and Im just venting.\nTLDR; My mentor makes me wanna scream but I find mini-comfort in my fellow colleagues as they experience the same anxieties with them.",
  "author": "BunnE3",
  "created": 1634953318,
  "updated": 1635185226,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {}
}