{
  "sid": "p5wtn0",
  "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/",
  "title:": "STOP MAKING ME PAY TO ACCESS HOMEWORK",
  "text": "I pay yall thousands a semester, why am I now being charged $100 to literally do my homework? FAFSA doesn’t take things like this into account and I shouldn’t be failed for not paying even more money. Aaaaaaaaaa.",
  "author": "Yori_R6",
  "created": 1629174936,
  "over_18": false,
  "upvotes": 436,
  "upvote_ratio": 0.98,
  "comments": {
    "h9i0t39": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9i0t39/",
      "text": "Looking at you, Mastering Chemistry and lab fees",
      "author": "Pusheen___",
      "created": 1629351337,
      "upvotes": 1,
      "replies": {}
    },
    "h9f5oq0": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9f5oq0/",
      "text": "Mhm. $100 for homework access, $100 for an online book you’ll use twice, $100 for parking etc. It’s frustrating. I normally don’t even care long term when it’s a loan situation, but the initial paying out of pocket is what gets me every year. Don’t exactly have a ton of funds and dropping nearly $500-1k every semester on various books/resources and waiting 1-2 months to get that money back is brutal.",
      "author": "XxNHLxX",
      "created": 1629301777,
      "upvotes": 3,
      "replies": {
        "h9f9482": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9f9482/",
          "text": "Seriously what is my money going towards if not the shit I’m actively using lol. And then last semester I had a professor who I don’t even know the name, gender, age anything of, never submitted a video of themselves or anything. It was 3 tests and that was it for the semester. I could’ve gone on quizlet to do that same thing for free lol.",
          "author": "Yori_R6",
          "created": 1629303297,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h9eh8jm": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9eh8jm/",
      "text": "Teacher perspective here:\n\nI teach quantitative materials and the standard textbooks in my field have gotten stupidly expensive ($300 and up, some over $400). I found a decent text - decent, not great - for one class that was $140 so I switched. The book wasn't very popular. It's hard for a new name to get a foothold in some disciplines and this book didn't succeed. It went out of print and we couldn't even find enough used copies for my classes.\n\nMy options were to return to crazy expensive books or create sufficient materials to go without a text. I created materials for some of my classes, but I couldn't do it for all of them.\n\nI looked into ebook/homework combinations and found one for $120. My students don't usually read through the text, they just use it as a resource so an ebook should be sufficient. It's still more than I'd like my students to spend, but it's far cheaper than a physical text.\n\nI can see how it feels like they're being charged to access homework problems, but for me, it was best option I had for them to get a decent book at a somewhat reasonable price.\n\nWith some publishers, the single fee provides access to ***all*** of the publisher's books. If you can get enough teachers to agree on textbooks from a single publisher, then it would be even cheaper for the students. Unfortunately, faculty are fiercely independent about their textbook choices and it's nearly impossible to get them to agree on a single publisher.",
      "author": "WisconsinBikeRider",
      "created": 1629289688,
      "upvotes": 3,
      "replies": {
        "h9eld2g": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9eld2g/",
          "text": "It’s definitely more helpful in your situation but mine isn’t like that.\n\nOur books are generally pretty cheap, and we have to separately pay JUST for the homework access. Not a text/homework combo…just homework. So we have to pay seperately to access our book and our homework and it’s almost always more expensive than if I had just got a book myself.",
          "author": "Yori_R6",
          "created": 1629292093,
          "upvotes": 1,
          "replies": {
            "h9eotmo": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9eotmo/",
              "text": "That sucks. I wonder if your teachers could choose the book/homework combination or if their hands are tied by administrative rules.\n\nI've been doing this for over 25 years and I didn't start noticing book/material costs until 15 or 16 years ago. I'm not proud of that but it just wasn't on my radar early in my career. Even when I started talking about book costs, I couldn't get many colleagues to pay attention. It's an embodiment of the principle/agent problem: professors (agent) select the books but students (principle) purchase them.\n\nFortunately, more and more faculty - young and old - are now talking about books costs. It won't change as fast as it should, but I think we're starting to make progress on it.",
              "author": "WisconsinBikeRider",
              "created": 1629293892,
              "upvotes": 1,
              "replies": {
                "h9ep4ve": {
                  "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ep4ve/",
                  "text": "I have some professors do it. Everybody in my university is free to choose how to give books and homework, just as long as the require a book. But even the book/homework combo just isn’t cheap, I’m broke so I’ll search up and down till I find my required book for $30. The online stuff is always a minimum of $70….and I don’t even get to keep it!! It’s temporary access. I want to get physical copies so I can read well past my graduation. \n\n\nI’m glad more people are becoming aware of this though, just attending college costs plenty…we don’t need to add onto that 😅",
                  "author": "Yori_R6",
                  "created": 1629294049,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h9eh4x2": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9eh4x2/",
      "text": "This post is reading my mind",
      "author": "Sharkattack970",
      "created": 1629289626,
      "upvotes": 1,
      "replies": {}
    },
    "h9eag5l": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9eag5l/",
      "text": "When ever I see one of those Pearson things, I email the teacher and ask them if I really need it.  id say 7/10 times, they will say I do not need to buy it.  The teachers at my college said they had to \"use\" certain books n products becaue they were contracted with the publisher, but they proceeded to say, we aint doing that shit tho.  I was at a community college, and all of the teachers i had were well aware of what a scam it was and they had no guilt about finding ways around it for students.",
      "author": null,
      "created": 1629285020,
      "upvotes": 1,
      "replies": {}
    },
    "h9cicox": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9cicox/",
      "text": "One of the things I loved about my community college was that those fees were included in the tuition bill (if you were taking a class that required those programs). So even though you had to pay it, financial aid and other awards would take care of it.\n\nNow that I'm at a university I have to spend $100-300 each semester to do homework, not including book access.",
      "author": "Thecrazysharklady",
      "created": 1629241753,
      "upvotes": 8,
      "replies": {
        "h9cifpn": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9cifpn/",
          "text": "Right?! It’s such a scam.",
          "author": "Yori_R6",
          "created": 1629241794,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9ci0gb": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ci0gb/",
      "text": "I once brought this up to a professor who demanded we buy the more expensive newer edition of the class textbook and he said “well $100 isn’t that much. Think of it as an investment in your education”. And I was like lmao dude I’m broke I don’t have money to “invest”.",
      "author": "Jdenney71",
      "created": 1629241583,
      "upvotes": 12,
      "replies": {
        "h9ci4kr": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ci4kr/",
          "text": "My investment to my education is the 10k it costs a semester 🙄",
          "author": "Yori_R6",
          "created": 1629241640,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "h9c2wa7": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9c2wa7/",
      "text": "Actually, Federal Student Aid can cover these costs. In your Cost of Attendance (COA) which is what your school uses to determine how much aid you can get, fees are part of what they figure it costs you to go to school. They usually use an average number. If you find that these fees/costs are too high, you can contact you school to see if they can adjust your budget.",
      "author": "Petronella17",
      "created": 1629234637,
      "upvotes": 5,
      "replies": {}
    },
    "h9c26mz": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9c26mz/",
      "text": "In my last accounting course, the homework was optional and it was all accessed on a program we had to pay for.  It wasn't even homework really, it was extra credit.  It cost $65 and I was just like, no.  My professor told me I would have gotten an A if I had done the extra online work.  I'll take my B on principle.  He basically said that for $65, I could have bought an A.",
      "author": "i2enjoyboops",
      "created": 1629234335,
      "upvotes": 20,
      "replies": {
        "h9ch7ii": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ch7ii/",
          "text": "Colleges go mask off more and more every year. Soon they’ll have Premium Classes where you buy in to get smaller class sizes and in person instruction, while the plebs stay on Zoom.",
          "author": "LonelyActor",
          "created": 1629241195,
          "upvotes": 15,
          "replies": {}
        },
        "h9d3wsv": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9d3wsv/",
          "text": "Oh my god, that last part made me so mad. I'm not in college to get good grades. I'm here to learn and get a degree. I don't care if I get bad marks, so long as I pass and learn something from it.",
          "author": "HJSDGCE",
          "created": 1629252689,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h9bx11a": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9bx11a/",
      "text": "and it’s the most absolute shittiest program in existence. every. time.",
      "author": "charlvs",
      "created": 1629232202,
      "upvotes": 6,
      "replies": {}
    },
    "h9b4azc": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9b4azc/",
      "text": "The textbook/access code package I offer my students is almost $100 cheaper than just the textbook by itself.  Even professors who don't use the access code still offer this package because it's cheaper.",
      "author": "-Economist-",
      "created": 1629218202,
      "upvotes": 1,
      "replies": {
        "h9b6dxq": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9b6dxq/",
          "text": "This is not the case for this class. I can find almost any textbook free online, we still have to buy our textbooks anyway, we just have to pay more simply to access homework. We can’t do our HOMEWORK without paying. It’s B.S.",
          "author": "Yori_R6",
          "created": 1629219108,
          "upvotes": 8,
          "replies": {
            "h9ct1fb": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ct1fb/",
              "text": "Ohhh so it's an e-book where you read and do your homework and you're mad because you can't just pirate it?\n\nNgl I teach a class where the dept picks the book and if a student says they are using the library copy I just send them a pdf of the homework questions.  It's a pain and extra to grade (and sometimes I forget to do it so they get it back late) but it works for the people who don't want to spend the money.  So maybe ask your prof if there is an accommodation to be made.  Maybe they give you a free access code so you can just log in.",
              "author": "poop_on_you",
              "created": 1629247166,
              "upvotes": 1,
              "replies": {
                "h9ctfsu": {
                  "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ctfsu/",
                  "text": "Huh? No. \n\nIt is the homework. I literally have to buy the textbook, and then separately pay to do my class work. I shouldn’t have to pay to do my work.",
                  "author": "Yori_R6",
                  "created": 1629247371,
                  "upvotes": 3,
                  "replies": {
                    "h9cuu4w": {
                      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9cuu4w/",
                      "text": "Weird.  That's usually packaged with the book and profs can send out freebies.",
                      "author": "poop_on_you",
                      "created": 1629248086,
                      "upvotes": 1,
                      "replies": {
                        "h9cv0w7": {
                          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9cv0w7/",
                          "text": "Yeah it hasn’t been in my last few classes. It’s extremely frustrating for myself and others I know already struggling with tuition as is.",
                          "author": "Yori_R6",
                          "created": 1629248184,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "h9b7bgz": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9b7bgz/",
              "text": "It’s a weird argument to make. Textbook costs are factored into aid packages. Your pirating them is not.",
              "author": "urnbabyurn",
              "created": 1629219567,
              "upvotes": -8,
              "replies": {
                "h9b7h00": {
                  "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9b7h00/",
                  "text": "Theyre not, and it’s common knowledge you can email textbook authors and ask for the textbook and they’ll often just give a pdf for free. I don’t get nearly enough aid to afford to pay $100 for 5 books and $75-$100 for 5 courses access to homework.",
                  "author": "Yori_R6",
                  "created": 1629219652,
                  "upvotes": 11,
                  "replies": {
                    "h9b82f9": {
                      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9b82f9/",
                      "text": "https://studentaid.gov/resources/prepare-for-college/students/choosing-schools/consider-costs\n\nThe cost of books is factored in. It’s not to say you are getting all the money you want. But it’s accounted for in the decisions.",
                      "author": "urnbabyurn",
                      "created": 1629220014,
                      "upvotes": -7,
                      "replies": {}
                    },
                    "h9ct9la": {
                      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ct9la/",
                      "text": "Uhh most authors get paid when you buy the book so no that isn't normal.  And if someone is sending out PDFs they're violating copyright.  Not saying I have a problem with that (bc fuck publishers) but it's what it is.",
                      "author": "poop_on_you",
                      "created": 1629247284,
                      "upvotes": -1,
                      "replies": {
                        "h9ctk3q": {
                          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ctk3q/",
                          "text": "Nah this is a common thing, google it. A lot of scholarly sources and textbooks are available if you email the authors because they too want people to access their stuff. Unless they suck. I first saw it on this sub.",
                          "author": "Yori_R6",
                          "created": 1629247432,
                          "upvotes": 2,
                          "replies": {
                            "h9cuojq": {
                              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9cuojq/",
                              "text": "That's awesome and not at all true of the authors I know 🤣",
                              "author": "poop_on_you",
                              "created": 1629248005,
                              "upvotes": -1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h9b0d6v": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9b0d6v/",
      "text": "When I was an undergrad I had to pay for online homework up until my senior year. I majored in Biology and it was mostly for chemistry and math that they did this for. Aleks and Pearson and Wiley plus. I hate them all.",
      "author": "chelkitty1",
      "created": 1629216657,
      "upvotes": 15,
      "replies": {
        "h9b827h": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9b827h/",
          "text": "sapling was the death of me",
          "author": "shadowwolfsl",
          "created": 1629220010,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h9ar2g1": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ar2g1/",
      "text": "This is why I turn a blind eye to downloading textbooks through online sources, any of then that aren’t like the ones you listed.",
      "author": "Topazz410",
      "created": 1629212967,
      "upvotes": 5,
      "replies": {}
    },
    "h9acf86": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9acf86/",
      "text": "Hey I'm a professor and I just want to say I'm sorry y'all are dealing with this capitalist takeover of higher Ed. I promised we exist who loath these predatory publishing companies and do everything we can to undermine them. \n\nMany dependents, colleges, and universities do not give instructors a choice. I highly encourage student protests and walk outs to force administrators to rethink this model of content delivery. \n\nOpen source materials are readily available in many fields. But know that lab fees are set by admin, not your professors. I have complete and total control over which texts and resources I require, but thats the exception rather than the rule.\n\nYou all should be furious about the current state of higher education, but most of that angst should be directed at the administration, not your professors.\n\nThey often have much, much less control over this stuff then you might think.",
      "author": "middledeck",
      "created": 1629206651,
      "upvotes": 38,
      "replies": {
        "h9ae9mi": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ae9mi/",
          "text": "I appreciate the response and honesty.",
          "author": "Nameless_Bunny",
          "created": 1629207500,
          "upvotes": 10,
          "replies": {}
        },
        "hgmz18c": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/hgmz18c/",
          "text": "As a professor you should call-out other professors who could be potentially forcing students to pay for these subscriptions illegally   \nhttps://www.reddit.com/r/CollegeRant/comments/q84sjw/if\\_the\\_cost\\_of\\_online\\_homework\\_programs\\_sappling/",
          "author": "Cat_Daddy_Z",
          "created": 1634234051,
          "upvotes": 1,
          "replies": {
            "hgqfbp7": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/hgqfbp7/",
              "text": "I feel like you missed the point in my comment where I said it's not profs choosing these subscription based services. It's the administration.",
              "author": "middledeck",
              "created": 1634302874,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h99spcx": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h99spcx/",
      "text": "exactly like what if i drop the class? do i get a refund ? no. i lose it. that's not right.",
      "author": "Letmetellyouabtlyfe",
      "created": 1629194764,
      "upvotes": 24,
      "replies": {
        "h9clptm": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9clptm/",
          "text": "I dropped a class that's used mylab math and was able to get a refund but it took MONTHS",
          "author": "-nerd-alert-",
          "created": 1629243408,
          "upvotes": 5,
          "replies": {
            "h9cm80b": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9cm80b/",
              "text": "i honestly didnt know how to get a refund so i lost the money :(",
              "author": "Letmetellyouabtlyfe",
              "created": 1629243663,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "h9ddvio": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9ddvio/",
          "text": "Even better. Before COVID started, my prof made us use an app to answer questions on the projector in class and it helped with attendance because it would report the wifi access point IP to the prof to tell them if you actually attended class or just signed in from your dorm room. . Well when we all got sent home we obviously had no use for it. Contacted the company that we gave a large amount of money to and they said they would contact the professor to see if he was still using it AND HE TOLD THEM YES LIKE A LYING BITCH and I didn't get a refund",
          "author": "TURKEYBUZZARD101",
          "created": 1629258138,
          "upvotes": 3,
          "replies": {
            "hbipyao": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/hbipyao/",
              "text": "Bv hmmm the nnnnlnnn ppl n n blc bgbv bgbv BB gb BBe bbnh lb bbbvbb canh bbnh BBBbh j htg bbgg NB g VCc BB gc VT g GG NB v with you bc",
              "author": "brnout",
              "created": 1630719843,
              "upvotes": 2,
              "replies": {
                "hbiq0yy": {
                  "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/hbiq0yy/",
                  "text": "Uhhhh, you good? Pocket typing?",
                  "author": "TURKEYBUZZARD101",
                  "created": 1630719881,
                  "upvotes": 2,
                  "replies": {
                    "hbiwk9o": {
                      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/hbiwk9o/",
                      "text": "Haha... Yep.  No stroke happening here.",
                      "author": "brnout",
                      "created": 1630723309,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h99r6q4": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h99r6q4/",
      "text": "[deleted]",
      "author": null,
      "created": 1629193548,
      "upvotes": 41,
      "replies": {
        "h9almrj": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9almrj/",
          "text": "It’s the articles with paywalls for me, that happened in almost all of my classes.",
          "author": "MelodicImpact",
          "created": 1629210655,
          "upvotes": 13,
          "replies": {
            "h9apcbu": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9apcbu/",
              "text": "Two things\n\n1. If it's a newspaper or magazine article use [outline.com](https://outline.com) \\- enter the URL. It will give you just the text of *many*  (not all) things that require subscriptions.\n2. Your college/university likely has a subscription to journals that your professor wants you to use. You might need to go through your library website or through an online gateway if you are off campus.  If that fails - you can get articles through Interlibrary loan.  Most places don't charge a fee for that. Don't be afraid to ask a librarian or to e-mail your professor or TA.",
              "author": "BiochemBeer",
              "created": 1629212233,
              "upvotes": 29,
              "replies": {
                "h9mmy97": {
                  "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9mmy97/",
                  "text": "Didn't know about Outline, would give you a helpful award if I had it.",
                  "author": "ericgol7",
                  "created": 1629437217,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h99i7sb": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h99i7sb/",
      "text": "if you talk to your professor after class or during office hours and explain you’re not in a position where you can afford the online textbook, they will help you get resources on campus without having to pay for it. i had to do it when my mom stole all the money from my bank account. most schools have a fund for people who need it, they just don’t advertise it because it could be taken advantage of",
      "author": "sameoldlamedame",
      "created": 1629186107,
      "upvotes": 37,
      "replies": {
        "h99j5pb": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h99j5pb/",
          "text": "I’ll have to do that, thank you!",
          "author": "Yori_R6",
          "created": 1629186865,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "h99agr5": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h99agr5/",
      "text": "Yes, its outrageous.  Now pearson is trying to sell a subscription for their pearson plus app.\n\nThey also changed the water mark when printing an etext page. Now its a huge circle showing your email address.",
      "author": "DividedConscious",
      "created": 1629180143,
      "upvotes": 50,
      "replies": {
        "h9aayzi": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9aayzi/",
          "text": "The Pearson subscription is likely a actually cheaper than the previous rental or purchase options. Only problem I see is the one Pearson book I used last year isn't included. So I'm wondering if this is really just \"cheap\" and old books and the ones your likely to need still aren't included.",
          "author": "DanHassler0",
          "created": 1629205965,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "h99aez3": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h99aez3/",
      "text": "Starting my freshman year last year and realizing i would need to pay for My math Lab and My Labs plus by Pearson was my joker moment.",
      "author": "Fickle-Management",
      "created": 1629180107,
      "upvotes": 126,
      "replies": {
        "h9agtgh": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9agtgh/",
          "text": "That shit is ridiculously expensive for absolutely no reason",
          "author": "uplink2",
          "created": 1629208621,
          "upvotes": 48,
          "replies": {
            "h9bk8jp": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9bk8jp/",
              "text": "Theres a reason. Its $$$ in the pockets of whoever owns the software",
              "author": "taybay462",
              "created": 1629226884,
              "upvotes": 20,
              "replies": {}
            },
            "h9mmqkp": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h9mmqkp/",
              "text": "They are not even trying to improve their software. It's frustrating.",
              "author": "ericgol7",
              "created": 1629437067,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h99afka": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h99afka/",
          "text": "we live in a society",
          "author": null,
          "created": 1629180119,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h994z3c": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h994z3c/",
      "text": "Yeah I don’t get it. You don’t want people to cheat yet you use services that easy to share and are up for years. It just makes it hard to do it too. Oh your electric/WiFi/school web/blackboard stopped working guess you will be taking some zeros for the week. Oh it’s just like a textbook you mean I can buy it used? No can I sell after I’m done with the class? No can i at least have access to after this class since it’s my main subject and could use the information down the road? No. Ug my eyes…",
      "author": "Kirbylover16",
      "created": 1629176401,
      "upvotes": 90,
      "replies": {
        "h995beg": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/h995beg/",
          "text": "Oh my gosh that last part. We have online textbooks with supplemental assignments, so I LOVE my subject but if I want to continue reading next year, I have to buy the textbook after paying for the $65 subscription because it expires after my class ends. It doesn’t make any sense.",
          "author": "Yori_R6",
          "created": 1629176615,
          "upvotes": 45,
          "replies": {}
        }
      }
    },
    "hgmv28l": {
      "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/hgmv28l/",
      "text": "Oh dang, I hope I am not to late but I took on my university (UNLV) last fall semester over this and was able to get $88k returned to students because unless those costs are disclosed to the student at the TIME of registration it is illegal.  \n\n\nI will link my post on my universities subreddit where I [outline](https://www.reddit.com/r/UNLV/comments/ihdvew/please_read_if_your_professor_is_making_you_pay/) all of this, as well as my [victory](https://www.reddit.com/r/UNLV/comments/ik9jdh/victory_tastes_oh_so_sweet/) [post](https://www.reddit.com/r/UNLV/comments/jtecyx/my_homework_crusade_against_unlv_cost_them_88k/)",
      "author": "Cat_Daddy_Z",
      "created": 1634232419,
      "upvotes": 2,
      "replies": {
        "hgmv6eh": {
          "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/hgmv6eh/",
          "text": "UM I wonder if I can get refunds?!",
          "author": "Yori_R6",
          "created": 1634232468,
          "upvotes": 2,
          "replies": {
            "hgmvfmg": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/hgmvfmg/",
              "text": "Yes you can, in fact if your university doesn't comply they can get federal funding from the Dept. of Education revoked",
              "author": "Cat_Daddy_Z",
              "created": 1634232572,
              "upvotes": 1,
              "replies": {}
            },
            "hgmy1fp": {
              "link": "/r/CollegeRant/comments/p5wtn0/stop_making_me_pay_to_access_homework/hgmy1fp/",
              "text": "Here is a Google Doc I put together that explains [everything](https://docs.google.com/document/d/1wzZFgE-SJVP90Ae0oUkgPZFknpjwHA9pIYPiJfWvAwY/edit?usp=sharing)",
              "author": "Cat_Daddy_Z",
              "created": 1634233642,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1636192534
}