{
  "sid": "or611k",
  "link": "/r/CollegeRant/comments/or611k/dear_universities_please_attach_your_asynchronous/",
  "title:": "Dear Universities: Please attach your asynchronous or synchronous class statuses on the schedule.",
  "text": "It's ridiculously inconsiderate to tell students that they'll have to commit to four or five days a week of live lectures, and then reveal on the first day of class that they don't actually need to commit to any specific time at all. Also, don't make students guess when they'll have availability. This bizarrely irresponsible oversight in regard to online classes could make students turn down jobs that they might actually be able to take, or take jobs only to find out that their schedules don't line up.",
  "author": null,
  "created": 1627192298,
  "over_18": false,
  "upvotes": 44,
  "upvote_ratio": 0.94,
  "comments": {
    "h6rmdsm": {
      "link": "/r/CollegeRant/comments/or611k/dear_universities_please_attach_your_asynchronous/h6rmdsm/",
      "text": "The reverse happened to me last quarter. They said it was online, non-lecture, which means it’s a pretty much self-taught thing within watching videos and certain time frames for assignments. So, I had a course I signed up for, and the first day I saw the Professor post, “You don’t have to be in the lectures, but it is HIGHLY RECOMMENDED if you want to be successful in this course.” I failed it. I’ll have to re-take it this year as it’s a core requirement in my major, but it pissed me off so much. It messed with my mental health a lot because I was so busy.",
      "author": "Artsy-Jellyfish",
      "created": 1627428523,
      "upvotes": 1,
      "replies": {}
    },
    "h6jk240": {
      "link": "/r/CollegeRant/comments/or611k/dear_universities_please_attach_your_asynchronous/h6jk240/",
      "text": "At the universities I’ve been a professor at, this kind of thing would be against policy. We are required to teach our courses how they’re listed, barring an emergency situation that necessitates a change for some reason. We can’t just say “oh, I’m going to do what I want despite what the schedule says.”",
      "author": "PhDapper",
      "created": 1627266793,
      "upvotes": 2,
      "replies": {}
    },
    "h6g9ydr": {
      "link": "/r/CollegeRant/comments/or611k/dear_universities_please_attach_your_asynchronous/h6g9ydr/",
      "text": "This! And also professors deciding to switch the format (in person or online) literally an hour before the first class was set to start. If professors sign up to teach an in person class, they need to commit to it unless there is a serious emergency, not decide to do synchronous online lectures on a completely different day and time than what was on the course catalog. This happened to me multiple times last year and I had to drop classes because they interfered with each other.",
      "author": "notthelettuce",
      "created": 1627197669,
      "upvotes": 12,
      "replies": {
        "h6gdxyz": {
          "link": "/r/CollegeRant/comments/or611k/dear_universities_please_attach_your_asynchronous/h6gdxyz/",
          "text": "A different day and time? Jeez that’s next level unprofessionalism.",
          "author": null,
          "created": 1627201239,
          "upvotes": 2,
          "replies": {
            "h6hkfcc": {
              "link": "/r/CollegeRant/comments/or611k/dear_universities_please_attach_your_asynchronous/h6hkfcc/",
              "text": "Oh yeah that was the single most unprofessional professor I’ve ever encountered. Changed the class time from 8-9:50 Tuesday Thursday in person to 2-4:15 on Wednesday online. Literally at 7:15ish on Tuesday, the supposed first day of class. She was very rude, gave us lengthy assignments wednesday evening to be due Friday morning, and one of the assignments included overhauling our PERSONAL social media pages to her specifications. Absolutely ridiculous and I even talked to the head of the department about it and they said everything was completely inappropriate.",
              "author": "notthelettuce",
              "created": 1627230494,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "h6k26nk": {
          "link": "/r/CollegeRant/comments/or611k/dear_universities_please_attach_your_asynchronous/h6k26nk/",
          "text": "[removed]",
          "author": null,
          "created": 1627278246,
          "upvotes": -2,
          "replies": {
            "h6k2p0q": {
              "link": "/r/CollegeRant/comments/or611k/dear_universities_please_attach_your_asynchronous/h6k2p0q/",
              "text": "How would I have no idea what I’m talking about when it literally happened to me? On multiple occasions? 🤨",
              "author": "notthelettuce",
              "created": 1627278638,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634063864
}