{
  "sid": "pyoi2l",
  "link": "/r/CollegeRant/comments/pyoi2l/everyone_is_sick/",
  "title:": "Everyone is sick",
  "text": "I’ve been sick twice since the semester started and i’m still getting over something. This has really put a damper on my schoolwork as I’m too mentally drained to retain any information and the work that I’m doing is not my best. I’m really trying to be healthy but i just keep getting sick out of nowhere!! And it’s not covid just infections/cold. \nIt’s not just me either, everyone else is getting sick too and I don’t really know what to do anymore to stay healthy.",
  "author": "cryphus",
  "created": 1633022640,
  "updated": 1634093913,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "heytowu": {
      "link": "/r/CollegeRant/comments/pyoi2l/everyone_is_sick/heytowu/",
      "text": "It's hard to focus on the class when I'm sandwiched between two people coughing.",
      "author": "Important_Ad6281",
      "created": 1633090882,
      "upvotes": 4,
      "replies": {}
    },
    "hey8ml0": {
      "link": "/r/CollegeRant/comments/pyoi2l/everyone_is_sick/hey8ml0/",
      "text": "I feel your pain so fucking much right now. I got a fever the first week here about a month ago after transferring from community College to a 4 year and all people did was laugh it off and call it \"The [insert my school name here] Plague\". I had a fucking fever of 107 and hallucinations, chills, sore throat, head cold, etc. \n\nWhat's so irritating is I went into my school's health clinic and it wasn't Covid so they like ok here's a lollipop now get tf out. Or at least that's what it felt like. Then it was like I was the only one sick at the entire school of 30k+ folks but today it's like I'm the only one not coughing and blowing my nose. If I get sick again....\n\nAll to say in this rant lol that I feel your pain, it really sucks not only does it drain you physically but also mentally and even emotionally plus it absolutely destroys your ability to focus on hw and class",
      "author": "seantaylornation21",
      "created": 1633073845,
      "upvotes": 2,
      "replies": {}
    },
    "hez0ix4": {
      "link": "/r/CollegeRant/comments/pyoi2l/everyone_is_sick/hez0ix4/",
      "text": "this is what i have been saying. it is week 6 on campus for me, and everyone either has covid, bronchitis, strep, or pneumonia. luckily i have gone the whole 6 weeks without getting sick (despite my roommate being sick the whole time with bronchitis/eye infection)…. however this morning i woke up with a sore throat. sigh. i think it is my time",
      "author": "ham_alamadingdong",
      "created": 1633094537,
      "upvotes": 2,
      "replies": {}
    }
  }
}