{
  "sid": "qp91i1",
  "link": "/r/CollegeRant/comments/qp91i1/should_i_take_a_gap_semesteryear/",
  "title:": "Should I take a gap semester/year?",
  "text": "This is my second year at college, but my first semester with consistent in person classes. I graduated from high school in the pandemic, but I’ve gotten so lazy from online school. I did decently well in school before pandemic but I went to a very small school (200 people in the hs) and we just didn’t have great resources or planning for \n\n\nI only have four classes, 1 F(Chem),2D’s Personal Finnance and My Biology class and one B which is an online business class. \nI have started going to my schools counseling and have been diagnosed as ADHD, but am unmedicated.\n\nI have been extremely stressed. I have no motivation and my mental health has honestly never been worse (I have a history with mental health problems related to a trauma) , I can’t afford to work much less and I feel myself causing conflict in my relationships because I’m so stressed.\nI very badly want to do well in school and continue my education but I just don’t feel capable right now. Is it even possible for me to pass this semester? Please help.\n\nTl;  DR: school has been extreamtly stressful for me lately. I have been starting to deal with mental health issues from my past and cannot afford to work less. Should i take a break or just stick it out? Is it even possible for me to pass this late in the semester?",
  "author": "crocheff",
  "created": 1636358838,
  "updated": 1636656364,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hjsfmpa": {
      "link": "/r/CollegeRant/comments/qp91i1/should_i_take_a_gap_semesteryear/hjsfmpa/",
      "text": "I don’t know where you are located however counselling outside of college can be very pricey if you are located in the USA. So you may have to stay at college to receive help. But I don’t know you financial situation nor what level of help you need. \n\nIf you think a gap semester and or year would benefit you, do it. Because for me it sounds like you may get onto academic probation if you don’t (I’m form 🇨🇦 and it is a thing here idk if it is elsewhere). Take the W in Chem if you still can.\n\nADHD is a strange thing to cope with especially in college. A lot of people  find adderall  beneficial however it isn’t necessary to live with ADHD. Talk to a primary health provider to see if it would help you. \n\n\nTalk to your profs or TA, don’t feel hopeless, do your work, (trust me worrying and sulking makes things worse), and get help when you need it but don’t rely on it (most North American colleges have free tutoring paid for by tuition).",
      "author": "jenniferrook9",
      "created": 1636368219,
      "upvotes": 4,
      "replies": {}
    },
    "hjwzr1z": {
      "link": "/r/CollegeRant/comments/qp91i1/should_i_take_a_gap_semesteryear/hjwzr1z/",
      "text": "If you feel like taking a gap semester/year is what's best then definitely do it. I was feeling the same way last semester, but because I let my family talk me out of it I didn't and I now extremely regret it. Everything that I expected would happen if I still took classes this semester did (mainly for me, very early burn out). Talk to your circle of support. Be it profs, mentors, counselors, friends, etc concerning your semester now AND your plans to take next semester off. Burn out and fear of imminent failure are scary things. Though it may feel like the only thing you can do right now is keep going forward and working, please try to take care  of yourself and do something you enjoy everyday no matter how small it is.",
      "author": "stevenbo",
      "created": 1636448565,
      "upvotes": 2,
      "replies": {}
    },
    "hk462ia": {
      "link": "/r/CollegeRant/comments/qp91i1/should_i_take_a_gap_semesteryear/hk462ia/",
      "text": "Thanks for the advice guys I will be taking a gap semester!",
      "author": "crocheff",
      "created": 1636577176,
      "upvotes": 1,
      "replies": {}
    }
  }
}