{
  "sid": "qqng50",
  "link": "/r/CollegeRant/comments/qqng50/do_professors_get_into_trouble_if_a_lot_people/",
  "title:": "Do professors get into trouble if a lot people don't show up and/or fail their class?",
  "text": "I go to penn state and in my math class a lot of people don't show up and/or have dropped the class since the drop late date is November 12th. I was talking to some of the other people that up seem to be barely passing or are failing.",
  "author": "MechanicExtension565",
  "created": 1636523517,
  "updated": 1636656332,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hk1d7x1": {
      "link": "/r/CollegeRant/comments/qqng50/do_professors_get_into_trouble_if_a_lot_people/hk1d7x1/",
      "text": "Nope. If it’s a pattern over multiple semesters, it may be a conversation that a chair or dean has with the professor, but if the problem is due to a demonstrable lack of attendance, then the blame can be placed solidly on students’ lack of attendance and not on the professor.",
      "author": "PhDapper",
      "created": 1636524420,
      "upvotes": 7,
      "replies": {}
    },
    "hk1ewp0": {
      "link": "/r/CollegeRant/comments/qqng50/do_professors_get_into_trouble_if_a_lot_people/hk1ewp0/",
      "text": "Depends on the professor’s level. If they’re an assistant or associate professor they may have to deal with it during their annual review, in addition to their other activities like research, service, etc. Tenure is also another factor that plays into it as well. There would have to be a serious and consistent issue, though most likely it would not result in termination.",
      "author": "JoshfromNazareth",
      "created": 1636525629,
      "upvotes": 2,
      "replies": {}
    },
    "hk1gfx8": {
      "link": "/r/CollegeRant/comments/qqng50/do_professors_get_into_trouble_if_a_lot_people/hk1gfx8/",
      "text": "My freshman year my math class was full but by August 28 just 7 days into the class ppl was leaving the class or Not showing up. (It was 30 students and only 15 was only showing up) From what rumors that was going on it was mostly due to not understanding the math (Pre Calculus 2 or  pre Tri is the name). Ngl I was failing but didn't give up cuz the teacher put a stopped to it and made a study group to help us all and those who just didn't come had to pay the school back (from what i heard it was $200 for the next few each month of the class) Long story short the 15 of use passed and moved on idk about the rest.",
      "author": "Forever_ForLove",
      "created": 1636526787,
      "upvotes": 2,
      "replies": {}
    }
  }
}