{
  "sid": "rbm1ev",
  "link": "/r/CollegeRant/comments/rbm1ev/fuck_knewton_alta/",
  "title:": "FUCK KNEWTON ALTA",
  "text": "How do you even fuck up a math program this badly. I'm 5 seconds away from smashing my laptop if knewton alta gives me one more fucking refresher. It's like they tried to formulate a math program to make students hate math as much as possible.",
  "author": "SIRETE",
  "created": 1638949744,
  "updated": 1639517952,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hnp0uck": {
      "link": "/r/CollegeRant/comments/rbm1ev/fuck_knewton_alta/hnp0uck/",
      "text": "Whew as someone who hates math and if I had to deal with this I'll blow up.",
      "author": "Forever_ForLove",
      "created": 1638950236,
      "upvotes": 1,
      "replies": {}
    },
    "hnqnuve": {
      "link": "/r/CollegeRant/comments/rbm1ev/fuck_knewton_alta/hnqnuve/",
      "text": "Oh man I've been using that for chemistry and I despite it. It tried to tell me once I had 24 more questions left and I finished the assignment within 4 questions. \n\nIf you get an answer wrong too many times it forces you to go back and relearn stuff, and multiple questions of it too which is frustrating (and often times has no impact on the current lesson im doing) and you cannot skip it. \n\nOne thing I've learned though is very often in multiple choice questions answer 4 is the answer because they want you to work through all the answers first for more practice. (Applies more to chem then math but some math topics I could see this too).",
      "author": "StoicFable",
      "created": 1638984270,
      "upvotes": 1,
      "replies": {}
    },
    "hofwom4": {
      "link": "/r/CollegeRant/comments/rbm1ev/fuck_knewton_alta/hofwom4/",
      "text": "Literally the worst online homework software in existence. So many of the questions they give are completely irrelevant to material on exams and the other 50% of questions are so completely useless/random and arbitrary that it looks like they were made by smashing random numbers and letters on the keyboard.",
      "author": "Nick9195",
      "created": 1639437444,
      "upvotes": 1,
      "replies": {}
    }
  }
}