{
  "sid": "r4z05t",
  "link": "/r/CollegeRant/comments/r4z05t/i_simply_cannot_destress_i_havent_even_started/",
  "title:": "I simply cannot de-stress. I haven't even started college classes and im already breaking down.",
  "text": "Incoming mini-rant. \n\n\nI graduated high school about half a year ago, and recently joined a college too. Classes haven't even started yet and I'm already stressed. About what, you may ask? Nothing. Absolutely nothing. At this point Im half convinced that being stressed 24/7 for nearly 4 years have finally had its effect on me. \n\n\nI cannot seem to do anything without having a goal to achieve at the end of it. I still call myself out on \"procrastinating\" when I don't really have anything urgent to procrastinate on. \n\n\nIm worried that I'll miss out on actually enjoying college life and fun experiences because I'm too worried about random things. \n\n\nHas anyone else experienced this? Advice?",
  "author": "sivbarat",
  "created": 1638201894,
  "updated": 1638207509,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hmjq4hr": {
      "link": "/r/CollegeRant/comments/r4z05t/i_simply_cannot_destress_i_havent_even_started/hmjq4hr/",
      "text": "As someone who went straight to college with the same mindset, I deeply regret not taking a break. You *need* to let go for the time that you have. There's no guilt because stressing about the work will slow you down later, which will cause you more stress, and then it becomes a cascade. If you take a break now and clear your mind of work, you'll have a strong start (which is CRUCIAL) and you've set yourself up for a better semester.\n\nBut don't take this time to be on social media all the time. My dopamine addiction is killing my work ethic. I'm trying my best to break it. Create some healthy habits. I highly suggest finding the time to engage in physical activity because that's something that's hard to do in college.\n\n I really wish I knew all of this before I started. But hindsight is clearer than foresight.",
      "author": "International-Band52",
      "created": 1638203955,
      "upvotes": 2,
      "replies": {}
    }
  }
}