{
  "sid": "qzg1lt",
  "link": "/r/CollegeRant/comments/qzg1lt/my_university_is_overpriced/",
  "title:": "My University is Overpriced",
  "text": "My University is dreadfully overpriced for many reasons. I go to an Ivy League. I'm not saying the name since I still want to graduate. Considering the amount of mental and physical damage I have endured in this abusive school, they should be paying me more. I've had a plethora of incompetent professors, many arrogant, gas lighting professors. I literally had one ask to pay for my freaking wi-fi over the pandemic. So uncalled for, incredibly invasive and insensitive. One asked a poorer student why they didn't buy the books yet a week into the semester  in front of the whole class and they had to say they couldn't afford them yet. I've had two professors call me lazy, one suggest I go to the office of disability just because I asked to take a quiz in her office (an arrangement I had with a previous professor or the same subject.) One prof would get up and sit next to me every class, even though I tried to sit as far away from them as possible. Another would give me the turkey neck confused face whenever I asked a question in class. I straight up had to say \"yeah, seriously\" before he would answer my questions. I had a couple near death experiences (because I became very ill and almost died) and I had hoped my professors would try to be a bit flexible with my grades and stuff, but they told me to drop their classes instead. And this is just the professors and it's not even all the stories I have on them.\n\nOther than the professors, the student community is toxic as hell. The perfectionism is overkill. Students dick measure by asking how many hours you've slept a night. If you have a healthy sleep schedule, you're not working hard enough. If they don't see you in the library until 1AM at least twice in the semester, you must not be working hard enough. If you don't feel the need blackout drunk once a week, you must not be working hard enough. If you aren't trying to go vegetarian or vegan, you must not be working hard enough to save the world. If you don't go to protests, you must not be working hard enough to save the world. If you get a B in a class, you must not be working hard enough. If you don't have color coded notes, you must not be working hard enough. Don't even get me started on the hookup culture, it's wild af.\n\nNow for some miscellaneous stuff that damn near broke my soul once I finally became depressed from this oppressive atmosphere. My dorm didn't have heat in the winter. The vending machines charge you 6 dollars for a small bag of Doritos (what a mockery to poorer students). The dining halls aren't good at labelling things for food allergies. One of my friend's nearly died a week into my first year because of this. There are few mental health resources that I know of despite the school having one the highest suicide rates in the country. General conversations between students and even staff are excruciatingly shallow. I asked to make a bakery and my Head of College, suggested I do a coffee shop with \"avocado on toast\". She knew already that I've never tasted coffee in my life. It was a big point in the conversation prior to this moment.\n\nOk, I'm done--Oh! Yeah, I caught covid and had to withdrawal, but the policies are keeping me from reenrolling. lol bye\n\n&#x200B;\n\nEDIT\n\nTL;DR : Many of the professors suck, student community sucks, no care for mental or physical health. Not worth the money.",
  "author": "Liver_Dancer",
  "created": 1637566638,
  "updated": 1639873122,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.75,
  "comments": {
    "hlo6o8r": {
      "link": "/r/CollegeRant/comments/qzg1lt/my_university_is_overpriced/hlo6o8r/",
      "text": "That's why I chose my state school. Cheaper & I still get cool research opportunities & internships.",
      "author": "Gamerz1818",
      "created": 1637607454,
      "upvotes": 1,
      "replies": {}
    },
    "hlnmgeb": {
      "link": "/r/CollegeRant/comments/qzg1lt/my_university_is_overpriced/hlnmgeb/",
      "text": "You pay them to be their. Demand your rights. They suck at teaching then go to office hours sit there 5 hours a week going over shit with them. They better be as miserable as you are. Lectures are brutal for us students.",
      "author": "Ged395",
      "created": 1637599445,
      "upvotes": -1,
      "replies": {
        "hlqlwuu": {
          "link": "/r/CollegeRant/comments/qzg1lt/my_university_is_overpriced/hlqlwuu/",
          "text": "Yeah no. 😂😂😂",
          "author": "snoboy8999",
          "created": 1637648035,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hm8i9mu": {
      "link": "/r/CollegeRant/comments/qzg1lt/my_university_is_overpriced/hm8i9mu/",
      "text": "I went to a small liberal arts (wanna be ivy) and can tell you with a straight face, I am a data analyst, who graduated with a minor in computer science, did not have math requirements, no python or C programming languages. and now its been 3 years and java and SQL been 7 years ago (need brush up). I am coming off of a grant job where I was cataloging photos records.\n\nMy history capstone was a phd out of my butt in 4 months. Basically I ranted enough to get a B-, when reality he wanted an idea for his sequel of his book.\n\nAnd the college classmates of mine were straight toxic, cannot go into details as I am still working through the abuse they had. But it was nothing for me to sit there and be talking (not fully dating yet) a guy then he ghosted me and everyone else did even know I knew him. Yeah totally normal people.",
      "author": "enoughstreet",
      "created": 1637985852,
      "upvotes": 1,
      "replies": {}
    },
    "hm8lhx7": {
      "link": "/r/CollegeRant/comments/qzg1lt/my_university_is_overpriced/hm8lhx7/",
      "text": "I'm going to a Private school as well and this sounds almost spot on except for the fact that my shit school is completely useless. I told the dean that the only reason they won't let me graduate is because they haven't finished milking me for money :/ I hope things get better for you OP",
      "author": "AverageGuy16",
      "created": 1637987659,
      "upvotes": 1,
      "replies": {}
    },
    "hmaj679": {
      "link": "/r/CollegeRant/comments/qzg1lt/my_university_is_overpriced/hmaj679/",
      "text": "So transfer to a different college. Why do you need to stay in that toxic atmosphere for a fancy school name in your resume? Do you think jobs these graduates get are any better? No, those workplaces are also toxic AF. Move. It is never late.",
      "author": "MyHeartIsByTheOcean",
      "created": 1638032756,
      "upvotes": 1,
      "replies": {
        "hmamvfk": {
          "link": "/r/CollegeRant/comments/qzg1lt/my_university_is_overpriced/hmamvfk/",
          "text": "I’m worried that I may suffer from that “grass is greener on the other side” issue and if I transfer, it won’t be any better anyway. And if that’s true, then all the effort of suffering through one school then struggling to get my credits transferred would be for nothing.  Also my university hooks you up with some top tier jobs right off the bat, not because of the name, but because of the internships and contacts they have. One of my friends already has a six figure job right out of college because of this. The alumni network is insane, nepotism strikes again.",
          "author": "Liver_Dancer",
          "created": 1638034336,
          "upvotes": 1,
          "replies": {
            "hmau7wz": {
              "link": "/r/CollegeRant/comments/qzg1lt/my_university_is_overpriced/hmau7wz/",
              "text": "Not quite. The snobbery of Ivy League schools is a known phenomena. Transfer to a flagship state university and you will get good education, recognized college degree, and maybe get to enjoy some of your college years. Depending on your major - jobs may never be a problem. For examples Business schools are able to place close or above 90 percent of their grads. Engineering’s schools place well too.",
              "author": "MyHeartIsByTheOcean",
              "created": 1638037398,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}