{
  "sid": "qbqyts",
  "link": "/r/CollegeRant/comments/qbqyts/roommates_fighting/",
  "title:": "Roommates fighting",
  "text": "My roommate has a problem with one of my suitmates and whenever my one suitmate does something my roommate doesn’t like she complains about it to me and my suitmate and I are pretty cool like I would rather live in a room with her than my roommate. Also my other suitmate hates everyone that my roommate hates and they try to make their problems my problem and I’m done with it and I cleaned my hands of it and I tell my suitmate what they say about her so she knows they have a problem with her. I’m also under a lot of stress and don’t want to deal with drama. Does anyone else have this problem in their dorm full of females?",
  "author": "SupermarketCommon259",
  "created": 1634696990,
  "updated": 1636193290,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.92,
  "comments": {
    "hhbqyb2": {
      "link": "/r/CollegeRant/comments/qbqyts/roommates_fighting/hhbqyb2/",
      "text": "Last year I lived with 3 other girls. 2 of them were fine, but the 3rd girl just absolutely hated me for some reason. She just picked on me to bully. She always complained to the other 2 girls about me, but they were always busy and so they never gave her much time. The drama escalated and I was calm and composed, but that just enraged her even more. \n\nI've found that a lot of times, people just wanna fight. It doesn't make sense why, and never will. I'd suggest just keep to yourself, and don't let anyone walk over you. Don't engage.\n\nI'd really recommend looking up on how to set boundaries and enforce them. That really helped me.",
      "author": "theuniverse_hatesme",
      "created": 1634705085,
      "upvotes": 2,
      "replies": {}
    },
    "hhf2sqt": {
      "link": "/r/CollegeRant/comments/qbqyts/roommates_fighting/hhf2sqt/",
      "text": "If you don't want to deal with drama, don't. Tell them that you have no issue with either of them and you don't want to hear about them complaining about each other since it just makes the living situation uncomfortable for everyone involved.\n\n&#x200B;\n\nAlso, this problem is not \"female\" specific. When stressed out individuals are living in close quarters they're bound to butt heads at some point. Their sex/gender is completely irrelevant.",
      "author": "--QueenofSwords--",
      "created": 1634767996,
      "upvotes": 2,
      "replies": {}
    }
  }
}