{
  "sid": "rdvirw",
  "link": "/r/CollegeRant/comments/rdvirw/how/",
  "title:": "How???",
  "text": "Hello everyone, I’m truly devastated. This semester I had only 4 classes to take care of, yet I somehow managed to get (at most) 2 Ds (if not Fs). \nThis semester I was feeling a lot better mentally and was prepared for improving my GPA before transferring next fall. While I agree I did procrastinate on a class where there were no due dates, I did as much as I could. I even took a tutor in the middle of the semester for discrete math, yet completely failed all tests (9/21 problems solved in 4 hours?? Come on…). It hurts me that I used to have a 4.0 GPA in hs about 4 yrs ago, & now I’m here in the dump. I often wonder if I should just drop out and move. Yet, so many people who’ve come in contact with me have tried their best to get me up, from my school’s mental & academic counselors to my new colleagues and supervisor at my internship. It’s such a shame their efforts are not reflecting on my work\nIt’s getting so hard to maintain focus or follow a plan I sat for an hour setting up. It’s so hard feeling happy what whatever I actually do good on. I don’t even want to celebrate the holidays or enjoy winter break… I feel I don’t deserve any free time, but also don’t want to do anything. I guess I just want to cease existing for a little while until I feel better, so that I am better prepared by then. I don’t know\n\nTL;DR: I feel awful for failing my classes.\nPD: I’m on mobile\n\nFeel free to delete this, and sorry for whoever read all this crap. I hope everyone has a better end of the semester than I did. Good luck on your finals to those who vent taken them yet",
  "author": "AyumuHoiHoi07",
  "created": 1639211977,
  "updated": 1639517897,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "ho4bvtk": {
      "link": "/r/CollegeRant/comments/rdvirw/how/ho4bvtk/",
      "text": "Hey man, Discrete's hard as shit, especially if you didn't understand the early concepts. You build on the early stuff and reference it constantly, so if you were struggling from the start, it was gonna be an uphill battle. I wish you luck in your next semester. Take some time over winter to destress, decompress. Play some video games and vegetate. You literally can only go up from here.",
      "author": "IcarusRyder",
      "created": 1639230352,
      "upvotes": 4,
      "replies": {
        "ho6lbte": {
          "link": "/r/CollegeRant/comments/rdvirw/how/ho6lbte/",
          "text": "Yeah, i was already thinking of taking winter off for the first time, now I guess it’s for the best. Thank you for your kind words",
          "author": "AyumuHoiHoi07",
          "created": 1639266580,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}