{
  "sid": "qwbdno",
  "link": "/r/CollegeRant/comments/qwbdno/my_roommate_is_annoying_tf_out_of_me/",
  "title:": "My roommate is annoying tf out of me",
  "text": "He’s been having some trouble making friends and I feel for him, but he’s kind of glomming on to me since I have made some. He’s super social and is good at making acquaintances but he doesn’t really make friends it seems. And tbh I’m fine with taking someone under my wing and introducing them to my friends, but it feels like he wants to be part of my group more so out of necessity and fear of being alone than actually wanting to be friends with me/my friends. He’s always asking me where I’m going to the point where I’m actively avoiding him. I genuinely do feel bad for him but I don’t like him and don’t want to spend time w him. I really shoulda gotten a single  ¯\\_(ツ)_/¯",
  "author": "shwarmaramen101",
  "created": 1637190166,
  "updated": 1639872447,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "hl4xcc3": {
      "link": "/r/CollegeRant/comments/qwbdno/my_roommate_is_annoying_tf_out_of_me/hl4xcc3/",
      "text": "Sounds like you would be doing your roommate a favor to tell him honestly. Who needs a friend like you?",
      "author": "Ill-Document-4126",
      "created": 1637252670,
      "upvotes": 4,
      "replies": {
        "hlu6uu2": {
          "link": "/r/CollegeRant/comments/qwbdno/my_roommate_is_annoying_tf_out_of_me/hlu6uu2/",
          "text": "Bahahahah I’m very good to my friends, he is not a friend. He doesn’t understand boundaries and is not a good or fun person",
          "author": "shwarmaramen101",
          "created": 1637713463,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl2fgnm": {
      "link": "/r/CollegeRant/comments/qwbdno/my_roommate_is_annoying_tf_out_of_me/hl2fgnm/",
      "text": "Just talk to your roommate. Honestly the problem will get worse. Or email your RA about it saying you are concerned with your roommates well being. Literally your RA is a resource for you. This is coming from an RA.  But yeah it's difficult living with someone you hangout with all the time",
      "author": "19Riften99",
      "created": 1637200567,
      "upvotes": 2,
      "replies": {}
    }
  }
}