{
  "sid": "ou8x1f",
  "link": "/r/CollegeRant/comments/ou8x1f/failed_units/",
  "title:": "Failed units",
  "text": "Honestly, all my life I've hated study. I absolutely dislike it but having Asian parents had caused such high standards. My older brother who is 26 just graduated with a mechanical engineering degree which I'm proud of him for but it sucks because I'm continuously being compared. My parents don't give a crap about my feelings, I'm looking for alternatives? What can I do to climb my way up, opportunities... etc, I wanna do something with my life but it's just so difficult when I'm constantly being compared, it's not motivating for me what so ever but others could say otherwise.",
  "author": "RoseBestGrill",
  "created": 1627601165,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "h74zdho": {
      "link": "/r/CollegeRant/comments/ou8x1f/failed_units/h74zdho/",
      "text": "{Okay! Long comment up ahead 😅}\n\nWell, you know that you don’t like study, so what *do* you like to do? **Do you have a hobby or favorite pastime? Something that brings you peace, happiness, or makes life a little better for you?** If you have no idea, you can easily find a bit of inspiration on the internet with vague searches (“things to do”, “bizarre careers”, “ways to make money”) and incorporate these as hobbies at first to get a feel of whether or not you would like to do them in life.\n\n**No matter what you like to do, it can always be turned into a business, or an opportunity to gain traction.** Even if you don’t know how to make it profitable just yet, advertising on major social media platforms such as TikTok and Instagram can help you gain followers for your “niche community” (anybody that follows your page to experience whatever it is you do!) which develops into business opportunities (and sometimes even a career) over time. \n\n**There is a disadvantage involved with doing your own thing — in that your parents may not agree with you doing it**, and, if you are already in school following the path that they want you to follow, making time for this side hobby or quitting school altogether can be challenging and even life-altering. It takes courage and strength to pursue something besides what your parents want you to do, but weigh out your options. Are you going to live at home forever, for your parents to supervise the way you live your life? Beyond that, are you going to give them that power once you are fully grown up, and move away from home, to continue dictating your lifestyle and your life choices? Parents sometimes feel a level of entitlement over their children over which they do not allow their child to set up boundaries for themselves, so when you grow up, it can be hard to make life choices, especially because we’re not always equipped to do things that are required for adults to do (taxes, bills, income, feeding ourselves, getting a car and house, etc). \n\n**Alternatively, there are ways to stay in school and end up doing things that truly bring you joy.** If you’re in college for one thing and want to do something else, changing your major can come with it’s own challenges, but it can be done! And what’s worth more than doing what you really want to do, versus what someone else wants you to do?\n\nJust think about what you like to do, something you could see yourself doing as a career, and Google/search up different majors and minors for college that can help you get there. Sometimes there are multiple things we want to do, so it is a great idea to check out whether or not those things can be integrated, whether one major or major/minor combination can suffice to do all of those things in the future, or whether you would rather focus on one of those things you like, and maintain the other one as a side hobby instead.\n\nIf you’re in school for what you want to do, but you’re stumbling on obstacles, try talking to someone (that works) at your school. There are ways for you to overcome any academic obstacle that you could possibly face because someone has been where you are before. \n\n**(As a side note: sometimes people don’t like school because they feel like they’re not smart enough** — if this is you, know that you CAN do anything! It’s all in what you *want* to do, not in what you can or can’t do. Many successful people have failed courses (I have myself!) and it doesn’t mean that you can or can’t do school or successful things! Don’t let the course failure make you believe that YOU’RE a failure. It can be discouraging, but it has nothing to do with your capabilities as an individual or as a powerful person. College makes you pay to teach yourself anyway! 😂 And we’ve been in the first pandemic of our lives, so that disruption probably hasn’t helped, either. 💕)\n\nA major piece of advice that I would note would be to **search up people like yourself that do what you could see yourself doing**. Go onto your social media platforms and search and follow people in a similar position as you, with a similar story to yours (people you feel you can relate to), or who do what you would like to see yourself doing. Be on the look out for success stories, tips of how they got there from where they were, trade tips, and if necessary, student survival guides. \n\n**I would say do this *especially* if you are a minority, or are in any way underrepresented in what you want to do.** Are you a woman (or man, or anything else) that is underrepresented in your dream field/career? Search for and follow people that do what you want to do and who represent what you want to represent. Are you ethnic or a minority? Follow people of your origins or of lesser-represented origins that are successful doing what you see yourself doing. These people can offer you valuable advice on *your* particular (or potential) struggles when faced when obstacles getting you to where you want to go. **Representation is such an important subconscious signal for envisioning where you want to go, and having the self-confidence and belief in yourself that it takes to get there.**\n\nIf it’s possible, **join a community** of people that do what you see yourself doing (online or physical!), so that you can get an understanding of how things work in the field, and so that you can have a community that will be supportive and relatable to you and what you want to do. My best wishes to you! ❤️",
      "author": "No_Jellyfish_8446",
      "created": 1627684143,
      "upvotes": 1,
      "replies": {}
    },
    "h73yfk1": {
      "link": "/r/CollegeRant/comments/ou8x1f/failed_units/h73yfk1/",
      "text": "Sorry if I can’t help that much, cuz I’m kinda going through the same thing especially since I am also Asian American too.",
      "author": "Fristi2147",
      "created": 1627668018,
      "upvotes": 1,
      "replies": {}
    },
    "h71ydav": {
      "link": "/r/CollegeRant/comments/ou8x1f/failed_units/h71ydav/",
      "text": "You could look at trade schools.",
      "author": "wetbogman2",
      "created": 1627626071,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634064363
}