{
  "sid": "rffj4e",
  "link": "/r/CollegeRant/comments/rffj4e/most_awful_teamwork_experience_ive_ever_had/",
  "title:": "Most awful teamwork experience I've ever had.",
  "text": "For the last couple of months I've been working on a group project with the most discouraging people I have ever met. The assignments are \"stupid\", \"impossible\" and half of the people who we're making the assignment for, the clients (it's an unpaid project of course, meant for practice), are foolish and delusional. Our lessons are obviously boring, useless and stupid too. \n\nI've really tried to keep my spirits up, but I think it's only being interpreted as annoying and naive. I answered questions, helped others with their share, have been respectful towards their reasons for not showing up... Got nothing in return. My questions are being ignored in the group chat, just like my suggestions. If they do acknowledge my questions or suggestions, they're not taken seriously. \n\nIt feels like it has only gotten worse and worse. My attempts to battle their attitudes with a stronger presence, less presence or a professional attitude (to the point, taking the lead here and there) have brought me nowhere. \n\nI feel ignored, ridiculed and overall really awful. Worked until two AM yesterday to finish my part of our project so we could discuss our work today, but apparantly I'm the only one who didn't understand that we didn't really mean it when we agreed to meet online today. \n\nThe worst thing is, a voice in the back of my head always blames myself. If the three of them get along so well, the problem must surely lay with me. \n\n\n(I'm sorry for any mistakes in spelling or grammar, English is my second language.)",
  "author": "Chaosproducer1",
  "created": 1639401471,
  "updated": 1639517868,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hofhiml": {
      "link": "/r/CollegeRant/comments/rffj4e/most_awful_teamwork_experience_ive_ever_had/hofhiml/",
      "text": "That’s a classic group project dynamic fo sho, the good student does all the work and the others just coast by. There’s nothing wrong with you, you just happen to be the good student in this group and the others are either immature, prioritizing other stuff, or both. They’ll get along better bc they’re just having fun while you’re reminding them there’s work to do, that’s all it is.",
      "author": "airbear13",
      "created": 1639431089,
      "upvotes": 2,
      "replies": {
        "hohu4je": {
          "link": "/r/CollegeRant/comments/rffj4e/most_awful_teamwork_experience_ive_ever_had/hohu4je/",
          "text": "Thanks for your support, I forgot to mention something in my rant tho: they do actually work. And although what they do is the absolute minimum, I certainly don't have to remind them of the assignment, I just get ignored when I'm trying to communicate. I feel left out and am afraid of losing touch with the project.",
          "author": "Chaosproducer1",
          "created": 1639476897,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}