{
  "sid": "r8g6om",
  "link": "/r/CollegeRant/comments/r8g6om/what_is_wrong_with_me/",
  "title:": "What is wrong with me",
  "text": "I just bombed the living shit out of my midterm. Bombed as in I wasn't doing great to begin with amd there's next to no chance I'm going to pass the class now.\n\nIt's ochem 2. It's the first time I've had chemistry in person since gen chem and I've been struggling. Not surprising either since I deadass had to take ochem 1 three different times. The first time I had a complete mental breakdown over the anniversary of my sexual assault and I requested a late withdrawal. The second and third time the best I could do was a C-. \n\nI feel like such a loser. Anyone I used to be friends with in my program has now far outpaced me. I went into college with 10 AP courses and a 32 on the ACT. I thrived in high school and I had such a fucking bright future. Then I was abused in student housing my first semester, and everything started falling to pieces, and once you're behind in chemistry (and you're bad at it to begin with), you're fucked.\n\nThe other thing is that I've had an otherwise perfect semester. Got a lab position. Straight As in all my other classes (5 of them, mostly complex biology courses). This was supposed to be the semester that rescued my GPA but now it means nothing because ochem is 4 credits. I even aced both ochem labs. I don't know what the fuck is wrong with me that I can't do well in the lecture courses.\n\nMaybe it's test anxiety, I don't know. I've been doing well on assignments but the exams killed my grade. I already lost my scholarships at the beginning of the semester so I guess there's not much else to lose. I just feel like a mess.",
  "author": "whoontheplanetearth",
  "created": 1638587621,
  "updated": 1639518042,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "hn7kp8u": {
      "link": "/r/CollegeRant/comments/r8g6om/what_is_wrong_with_me/hn7kp8u/",
      "text": "You probably can do better in ochem if you’re doing well in the ochem labs and assignments. Test anxiety is real but you’re acing the other classes so I don’t think it’s that alone. I think maybe ur not giving your mental recovery from SA enough attention and maybe that’s causing a lot of extra background anxiety that’s keeping you fr performing your best? Just an idea\n\nIn any case you’ve been through a lot and are still performing pretty well so give yourself credit for that. You are a good student but even good ones get overwhelmed sometimes!",
      "author": "airbear13",
      "created": 1638635731,
      "upvotes": 5,
      "replies": {
        "hnaendj": {
          "link": "/r/CollegeRant/comments/r8g6om/what_is_wrong_with_me/hnaendj/",
          "text": "Yeah, that's definitely a possibility. I was thinking it could also have something to do with the fact that these are my only in person exams, or just because the repeated failure in ochem is applying even more pressure to do well.\n\nThanks for the supportive words, I appreciate it. ❤",
          "author": "whoontheplanetearth",
          "created": 1638680412,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hn5uru8": {
      "link": "/r/CollegeRant/comments/r8g6om/what_is_wrong_with_me/hn5uru8/",
      "text": "I’m so sorry :( sending you love",
      "author": "Alwaystrying2better",
      "created": 1638595016,
      "upvotes": 4,
      "replies": {}
    }
  }
}