{
  "sid": "r0xt33",
  "link": "/r/CollegeRant/comments/r0xt33/i_got_yelled_at_by_my_professor_even_though_he/",
  "title:": "I got yelled at by my professor even though he messed up too.",
  "text": "This is my history class. His moods can be very unpredictable as some days he comes in very happy and some days he's ready to blow. I just happened to take the brunt of it I guess. Must've been a bad day but that's no excuse to be rude to me. 🤷🏻‍♀️ \n\nWe typically have reading assignments and then do discussion questions during class. He started posting the specific questions on blackboard for us to see because our class was confused the first few times due to unclear instructions. He was pretty consistent with it too until... Today or the few days before, he never posted them and our syllabus was off because we were a few days behind schedule so I just assumed that we didn't have readings to discuss on a Tuesday (last class before school shuts down for Thanksgiving). I went to class, lecture was over, and as I was getting ready to wrap it up for the night, he says \"We're gonna have reading discussions.\"\n Oh Shit.. What? I didn't do any reading! I didn't even bring my book. You never posted any announcements or the questions? I knew I was fucked. I decided to play it cool as I was hoping my classmates would answer the questions about the reading. He opens up his book and asked the first question. Silence. OMG.. It wasn't just me. It seemed like the whole class also was confused so I asked him, \"Were we supposed to do readings?\" He was clearly upset at this point. \"YESSS...\" I asked again \"I'm sorry but I was confused. You didn't post the questions on Blackboard.\" You guys.. Here we go.. \n\n\"WELL I DIDN'T GET THE CHANCE TO. YOU SHOULD'VE DONE THE READING ANYWAYS. THEY ARE ASSIGNMENTS AND YOU SHOULD'VE DONE THEM REGARDLESS IF I POSTED THEM OR NOT IT IS YOUR RESPONSIBILITY...\" blah blah blah. I stopped listening. I was fuming. Are you fucking serious? I was expecting something more like \" I'm sorry I messed up as well. Let's try to discuss it anyways.\" Nope. Degraded me in front of the whole class. I took the brunt of it because I was the only one who spoke up for the class. \n\nAfter embarrassing the shit out of me, he continued to discuss the readings and kept rubbing it in by making snarky remarks like\" since no one did the reading...\" I thought about arguing back or walking out but I'm not the confrontational type and I'm not about to argue with someone who clearly can't take responsibility for their mistakes and have emotional/personality problems. This is a grown ass man. \n\nAfter class was over, I walked out quickly and called my bf. I cried the whole drive home. We went out and he bought me IHOP for dinner so I feel so much better. Thank God that I only have 3 weeks left of this shit class. Don't expect any response from me anymore, my lips are zipped.\n\nTL:DR History teacher yelled at me for not doing Readings. Embarrassed me in front of the whole class and I'm not about to argue with a grown ass man. Rubbed it in the whole time while he discussed readings and once class was done, I rushed out. Cried home and got IHOP for dinner. 🖕him.",
  "author": "justanotheryellowcat",
  "created": 1637732929,
  "updated": 1638207550,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hm23fqm": {
      "link": "/r/CollegeRant/comments/r0xt33/i_got_yelled_at_by_my_professor_even_though_he/hm23fqm/",
      "text": "Rate my professor wouldn’t be bad idea either. Warn the next batch of students. Sorry this happened to you op being yelled at is never okay.",
      "author": "BlueOcean7987",
      "created": 1637862592,
      "upvotes": 3,
      "replies": {
        "hm23twa": {
          "link": "/r/CollegeRant/comments/r0xt33/i_got_yelled_at_by_my_professor_even_though_he/hm23twa/",
          "text": "Yeah, manure happens. I was actually going to be rating him on there once class ends.",
          "author": "justanotheryellowcat",
          "created": 1637862753,
          "upvotes": 1,
          "replies": {
            "hm286t4": {
              "link": "/r/CollegeRant/comments/r0xt33/i_got_yelled_at_by_my_professor_even_though_he/hm286t4/",
              "text": "Did you get the class evaluations yet?",
              "author": "BlueOcean7987",
              "created": 1637864587,
              "upvotes": 1,
              "replies": {
                "hm2c23f": {
                  "link": "/r/CollegeRant/comments/r0xt33/i_got_yelled_at_by_my_professor_even_though_he/hm2c23f/",
                  "text": "Actually not but I'm waiting patiently for it.",
                  "author": "justanotheryellowcat",
                  "created": 1637866224,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlvgbr5": {
      "link": "/r/CollegeRant/comments/r0xt33/i_got_yelled_at_by_my_professor_even_though_he/hlvgbr5/",
      "text": "honestly id go and tell the department chair about this. he could be a great professor, but a big part about teaching is communicating with your students in a way that promotes a healthy learning environment—what he did was incredibly disrespectful.",
      "author": "Divinebookersreader",
      "created": 1637737020,
      "upvotes": 3,
      "replies": {
        "hlvh6jp": {
          "link": "/r/CollegeRant/comments/r0xt33/i_got_yelled_at_by_my_professor_even_though_he/hlvh6jp/",
          "text": "I agree that what he did was messed up. I'm honestly just trying to get this class over with. I don't want anything else to tie me to him by reporting him. I'm almost done with this college as well. Just one more semester and I'm out of here for good.",
          "author": "justanotheryellowcat",
          "created": 1637737617,
          "upvotes": 2,
          "replies": {
            "hlwuzhn": {
              "link": "/r/CollegeRant/comments/r0xt33/i_got_yelled_at_by_my_professor_even_though_he/hlwuzhn/",
              "text": "You could also power through the last weeks and report him after you're done. Not unusual for students to wait until they feel safe to report due to the power dynamic between faculty and students.",
              "author": "hdorsettcase",
              "created": 1637769012,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}