{
  "sid": "mepr22",
  "link": "/r/CollegeRant/comments/mepr22/anyone_experiencing_burnout/",
  "title:": "Anyone experiencing burnout?",
  "text": "What the title says.\n\nIn my personal experience, our university canceled our spring break so it's been nonstop with assignments, exams, and projects since returning to classes in January. I almost busted out crying cause this past week was hell and next week is gonna be the same if not worse. While some professors are understanding of the situation, I can't bring myself to study or work on assignments. I am constantly anxious, have migraines, and probably slowly killing myself with my poor health routines.",
  "author": "Environmental_Geek",
  "created": 1616888754,
  "over_18": false,
  "upvotes": 32,
  "upvote_ratio": 0.98,
  "comments": {
    "gslxhd7": {
      "link": "/r/CollegeRant/comments/mepr22/anyone_experiencing_burnout/gslxhd7/",
      "text": "Our college got rid of spring break as well, and I will never understand why. Most of my friends from other colleges are out here enjoying their spring break while I have to cram so much work. I'm also having a burnout and since it's almost finals season, my professors still keep teaching and shoving us more material down our throats.",
      "author": null,
      "created": 1616958969,
      "upvotes": 1,
      "replies": {}
    },
    "gslgpht": {
      "link": "/r/CollegeRant/comments/mepr22/anyone_experiencing_burnout/gslgpht/",
      "text": "Ify. I am always having burnouts. I do my requirements for the sake of passing and at the very last minute. I never take quizzes seriously. Not to mention I have a hard time focusing on lectures I end up being on my phone the second half of it. Online school isn’t for everyone. When some may find this productive for them, others are struggling to stay afloat. I wish when schools said they value their students physical & mental health, they really meant it and take actions for it.",
      "author": "creaaamyspinachdip",
      "created": 1616950975,
      "upvotes": 4,
      "replies": {}
    },
    "gsjxzaj": {
      "link": "/r/CollegeRant/comments/mepr22/anyone_experiencing_burnout/gsjxzaj/",
      "text": "You are not alone. I’m so behind on my lectures and have a midterm coming up, still can’t bring myself watch them. Endless lectures and essays that probably wouldn’t be so daunting if I wasn’t so sick of doing online school with no friends. Haven’t been taking care of myself, constantly bring myself down for not having motivation, can’t relax or enjoy most things, and I’m writing this after crying yet again :’). God this semester is horrible and I’m afraid that my bad studying habits are going to carry over into the next semester",
      "author": "julsya004",
      "created": 1616908293,
      "upvotes": 9,
      "replies": {
        "gteq3yh": {
          "link": "/r/CollegeRant/comments/mepr22/anyone_experiencing_burnout/gteq3yh/",
          "text": "Felt that, I have no friends either. It would be nice to have someone to talk to and rant to who understands the struggles of being unmotivated",
          "author": "t2300thb48rus7",
          "created": 1617587278,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gsjmgm1": {
      "link": "/r/CollegeRant/comments/mepr22/anyone_experiencing_burnout/gsjmgm1/",
      "text": "Me too :( if it is possible, give yourself an evening to do absolutely nothing/sleep in once a week",
      "author": "tinydustball",
      "created": 1616901310,
      "upvotes": 5,
      "replies": {}
    }
  },
  "updated": 1634063830
}