{
  "sid": "pftgtd",
  "link": "/r/CollegeRant/comments/pftgtd/mental_health_issues_how_am_i_supposed_to_study/",
  "title:": "Mental health issues- how am I supposed to study when there’s shadow people in the waiting room?",
  "text": "I've been on a couple of psychiatric meds in the past few weeks that I haven't reacted well to. On top of the normal stuff that comes with PTSD, BPD, bulimia, and bipolar disorder, I'm dealing with some significant brain fog (trouble remembering things, poor reaction time, extreme fatigue, disorientation), excess anxiety, and some physical issues. Recently, I’ve also been experiencing a lot of psychotic symptoms (believing someone’s watching me and plotting to hurt me, seeing things like spiders and shadows, hearing people yelling my name/“hey!”) which I think could be bipolar related but I’m not really in an episode right now.\nI've been in and out of my doctor's office and my psychiatrist's office for the last handful of weeks. I got tested for COVID-19 twice this month, just to be sure I didn’t have it after experiencing symptoms that I now know were a mild case of serotonin syndrome caused by my new meds. Yesterday, I had to go to my doctor because of an allergic reaction I was having. I was advised to take some antihistamines, and if it got any worse, I was supposed to call an ambulance. Said antihistamines made me incredibly sleepy, so I was dead asleep from 11am until about 5pm yesterday, even with my roommate making a quilt with her amusingly loud sewing machine. Then, I still fell asleep at 8pm but woke up because of nightmares twice, one of which, upon waking, I screamed because I saw someone standing in front of my bed. They disappeared after a while.\nI talked to my psychiatrist earlier this month about the psychotic symptoms, but looking at the notes on my patient portal it seems she ignored them. \nI have reached out to my school’s crisis intervention team, but even they are seemingly taking forever to set up an appointment with me.\nI keep a planner, usually religiously, but because I’m losing so much time I keep thinking I’ve already updated it when really that was 2 or 5 days ago. I have my schedule set on google calendar and have reminders set for events at one hour and at 20 minutes before each event. Same with assignment due dates- two days and one day before they need to be submitted. Still keep thinking it’s Friday when it’s really Tuesday. When I do remember to do assignments, it takes me forever to understand the material well enough to write any kind of response to it. \nI’m going to talk to my academic advisers about potentially dropping a class, because I can go down to 12 credit hours and still be considered full-time and keep my scholarship. I think that would at least reduce some of my academic stress.  I’m also going to talk to someone at the student success center about making a study plan, so maybe when the brain fog clears a little bit I’ll have an easier time following a schedule and taking time to understand things.\nLast semester I had an accommodation for flexibility with deadlines because of my mental illnesses by themselves, and I am trying to get it renewed for this semester and possibly adding some other accommodations, but my therapist is taking a bit to get documentation for the disability center. \nI need to figure something out where I can handle my physical/mental health, do well in class and work to afford the ridiculous amount of medical care and prescriptions I've had to deal with.\nIf it were up to me, I would take a break and come back to school when I’m not losing it. But I am on a full ride scholarship and care through student health is the only way I can afford to get any kind of help for all these issues. Not only that, but I would have to move back home and my parents are not okay with mental illness, other than maybe anxiety.\nI'm doing my best to hold it together, but juggling all of this, working (*edit: I work on-campus 16 hours a week at our minimum wage of $10.30 an hour, which gives me just enough income to cover meds + therapy, both of which are not covered by student health), spending 3 hours a week in therapy, and classes/schoolwork is proving too much for me to handle and resulting in me losing things constantly, not knowing what day it is, and frequent anxiety attacks. \nI don’t know what to do anymore. If anyone has any advice, I’d love to hear it.\n\nTL;DR: My mental health problems are causing academic problems and I’m scared.",
  "author": "caseygrace1213",
  "created": 1630501417,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.93,
  "comments": {
    "hbdxfsd": {
      "link": "/r/CollegeRant/comments/pftgtd/mental_health_issues_how_am_i_supposed_to_study/hbdxfsd/",
      "text": "Try to find out if your college has an option for medical withdrawal or a leave of absence. It may be possible to take time off now for medical reasons and return with your scholarship still there waiting for you. It sounds like you're dealing with some pretty serious mental health issues, but you can almost certainly learn to manage them if you take some time away from the added stress to figure it out. Don't feel bad about needing time off. If you found out you had cancer, would you feel like taking time away from school for your health was wrong? I hope not. This isn't any different just because it's brain chemistry instead of cancer cells. Get better, then go back and excel in school when you're ready.\n\nEdit: also, explore public assistance options if living with your parents is impossible. Can you qualify for public housing assistance? Can you qualify for Medicaid?",
      "author": "ExplainsSocialNorms",
      "created": 1630629464,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634063154
}