{
  "sid": "pnkn0v",
  "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/",
  "title:": "12 FUCK DOLLARS!!!!",
  "text": "Are you shitting me with that shit? Fuck my university, fuck any university that charges students so much money for fucking parking. \n\nSchools already so damn expensive, the fucking audacity! \n\nAnd contract parking, what makes you think I can afford that per semester? Maybe I could save the money but then I got bills to pay and tuition fees. \n\nSo honestly go fuck yourself school, go fucking fuck yourself. \n\n6 fucking dollars per hour! \n\nTaking transit is not an option for me, I’ve got work right after class is over and I don’t have time to run to the bus take some time to be late. I can’t afford that.",
  "author": "DumbHuman53",
  "created": 1631555644,
  "over_18": false,
  "upvotes": 41,
  "upvote_ratio": 0.98,
  "comments": {
    "hcrw96x": {
      "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcrw96x/",
      "text": "I live in a city. 440 for 24/7 parking in a lot on campus from september to may. I wonder what that is per hour of much i actually park there",
      "author": "taybay462",
      "created": 1631588104,
      "upvotes": 2,
      "replies": {
        "hcrwrkx": {
          "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcrwrkx/",
          "text": "440 doesn’t seem that bad from sept- may, especially 24/7 parking \n\nLast year, I moved into the university Apartments (not dorms) and it was $150 for parking, limited spaces left. I had no choice to take it because side street parking was a bitch! There was only a certain number of hours to park, so u had to move ur car or just keep getting those tickets.",
          "author": "DumbHuman53",
          "created": 1631588348,
          "upvotes": 1,
          "replies": {
            "hcryek0": {
              "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcryek0/",
              "text": "150 for how long? I pay 50/month to park at my house. If you mean per month thats outrageous",
              "author": "taybay462",
              "created": 1631589147,
              "upvotes": 2,
              "replies": {
                "hcs69yz": {
                  "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcs69yz/",
                  "text": "Per month!!! It was $4,000 per semester to live there, PER SEMESTER!!! \n\nLuckily financial aid did cover the housing cost, but still. \n\nI should have declined housing and taken the $4,000 that would have been given to me, to get my own apartment, preferably cheap.\n\nUghhhh",
                  "author": "DumbHuman53",
                  "created": 1631593143,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hcqb5tg": {
      "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcqb5tg/",
      "text": "Parking usually can’t be funded with tuition dollars by state law, so they have to charge separately for parking, and it can be a lot. It’s no less frustrating, and it’s really expensive, so I get it.",
      "author": "PhDapper",
      "created": 1631562629,
      "upvotes": 4,
      "replies": {
        "hcqcbyn": {
          "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcqcbyn/",
          "text": "I guess so, but I wish they didn’t make it so expensive. \n\nNothing we can do about it.",
          "author": "DumbHuman53",
          "created": 1631563096,
          "upvotes": 3,
          "replies": {
            "hcqdgt7": {
              "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcqdgt7/",
              "text": "Lots are super expensive to maintain, and they usually have to fund busses, security, etc. through that office, so I get that they have costs to cover, but it can be really burdensome, especially when people have no other practical option of getting to campus except for driving.",
              "author": "PhDapper",
              "created": 1631563554,
              "upvotes": 2,
              "replies": {
                "hcqjiy9": {
                  "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcqjiy9/",
                  "text": "Plus, for any schools in urban or semi urban areas, the physical space is going to be quite limited, and if they made it cheap then a lot more people would drive than they have space for. \n\nSetting a high enough cost provides a decent enough disincentive for parking to allow efficient use of the scarce resource.",
                  "author": "BarackTrudeau",
                  "created": 1631565983,
                  "upvotes": 5,
                  "replies": {
                    "hcrwf5j": {
                      "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcrwf5j/",
                      "text": "I guess that makes sense, maybe I’ll just start leaving even early to park somewhere free and take the bus.",
                      "author": "DumbHuman53",
                      "created": 1631588182,
                      "upvotes": 2,
                      "replies": {
                        "hcs601z": {
                          "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcs601z/",
                          "text": "I used to park a mile a way from campus and walk everyday.  Not bad unless it was raining hard or super hot out.  Saved me a few hundred dollars a year and I got some exercise out of it.",
                          "author": "BiochemBeer",
                          "created": 1631592986,
                          "upvotes": 2,
                          "replies": {
                            "hcus870": {
                              "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcus870/",
                              "text": "I’m all about saving, I guess I’ll just do what you did in park and walk the rest, but not a mile away😅 there is street parking near my campus and it’s only a 0.2 walk to class. \n\nBut street parking gets full, fast! So I got to start leaving early to do that.  \n\nI live in MN, and winters are a bitch! Here, so I need to figure out a schedule that will work now and for winter.",
                              "author": "DumbHuman53",
                              "created": 1631645938,
                              "upvotes": 2,
                              "replies": {
                                "hcusp23": {
                                  "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcusp23/",
                                  "text": "If I would have been able to get there early enough everyday I could have walked a lot less. But even getting in at 8:30 would usually be about a mile. I got there at 7:00 I could you know walk maybe a quarter of a mile.",
                                  "author": "BiochemBeer",
                                  "created": 1631646122,
                                  "upvotes": 2,
                                  "replies": {
                                    "hcv182g": {
                                      "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcv182g/",
                                      "text": "Ooof. I’m just crossing my fingers we go back to zoom classes next semester so no one has to find parking",
                                      "author": "DumbHuman53",
                                      "created": 1631649491,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hcq0oda": {
      "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcq0oda/",
      "text": "If you’re located in a major city that’s probably why.",
      "author": "snoboy8999",
      "created": 1631558381,
      "upvotes": 12,
      "replies": {
        "hcqbzcu": {
          "link": "/r/CollegeRant/comments/pnkn0v/12_fuck_dollars/hcqbzcu/",
          "text": "Yeah, I live in a big city. I’ll just have to suck it up for the next 2 years.",
          "author": "DumbHuman53",
          "created": 1631562957,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064337
}