{
  "sid": "hufwmd",
  "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/",
  "title:": "COVID has made me so unmotivated, is it ok to feel this way or should I be pushing myself to be more productive?",
  "text": "Now that college starts next month, idk if I should be acting like this. \n\nDuring my spring semester, I was very motivated and had a lot on my plate (18 credits, internship + volunteering) but still managed it all pretty well.  But now that covid has hit and I am back home, I've done a complete 180 and barely move out of my bed. I started out with binging shows like a maniac and now I've been watching nonsensical youtube videos till I get tired and can sleep again.\n\nMy friend recently created a virtual volunteering club. They mentioned opening applications for executive board positions. I know that I need good leadership positions to boost my resume, but for some reason when I looked at the writing portion of the application (never been good at this stuff) I just closed the tab. Part of me felt ashamed that I couldn't push myself to do one thing, and that this bite me in the ass in the future, but part of me was also like \"I wont get the position and I'm too tired anyways, why bother\".  I also thought about how I didn't actually care for the club, I just wanted a leadership position\n\nI don't know if what I doing can be considered as \"winding down\" and relaxing or just letting go of opportunities that I will regret in the future.\n\n(btw, as for more career dreams, I am going to apply clinical laboratory science program spring 2021, 30-40% acceptance rate. I can only apply then because they only allow sophomores to apply to their BS program. So I shouldn't bee taking it slow anymore.)\n\nI also don't have a good track record of getting into things so I am extra nervous..but also lazy..\n\nthoughts? tips? advice? :(",
  "author": "2363ar",
  "created": 1595224063,
  "over_18": false,
  "upvotes": 62,
  "upvote_ratio": 1.0,
  "comments": {
    "fz6ycdi": {
      "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fz6ycdi/",
      "text": "Trust me, take a break and don't burn out of college (and good GPA for recruitment's sake, although not really the most important factor). You need the rest. Actually, you probably shouldn't do a schedule that fills all hours of your day or none at all.\n\nI recommend filling in time with ways to be productive at least a little bit at a time. Make a schedule or a to-do list. To-do list is very flexible and can be tailored suited to the day (night before or morning of). Likely no one in your life will teach you productivity when you aren't forced to. Self-employed first-timers run into the same issue or overwork not realizing how to take time for self-care.\n\nPen, paper, checkboxes. You can put \"Enough Binging\" when you know you've done enough. Then you'll have checked out. It's okay to just do nothing for an entire hour and just think. You'll have to actually think about all the media you've consumed eventually. The thing is, now your schedule is filled with unproductive tasks.\n\nPen, paper, checkboxes. Notebook good. \"But digital\" you may say. No. That is an all purpose distraction machine. Put your thoughts on paper and enhance what you do with your tools. Your mind will annoy you to be productive when you bothered to write it down. Checklist tools are buried beneath the sand that is PHONE.\n\nPen, paper, checkboxes. You don't have to be productive in summer, but it probably helps to learn how to be productive when no one tells you to. That's probably the one thing you can learn that is more important than a year's worth of college.",
      "author": "cudgeon_kurosaki",
      "created": 1595682144,
      "upvotes": 2,
      "replies": {}
    },
    "fz2b00r": {
      "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fz2b00r/",
      "text": "Woah! How do you manage your time so efficiently in your spring semester?\n\nAnd it’s okay to feel unmotivated time to time. But if you want to get back into your groove, maybe start picking up a few habits since you have nothing else to do. \nLife sucks, it’s really challenging, but we just have to adapt to our current circumstances. I hope you start feeling more motivated! :)",
      "author": "chocopizza1",
      "created": 1595569724,
      "upvotes": 2,
      "replies": {
        "fz2cr9f": {
          "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fz2cr9f/",
          "text": "I basically lived in the library. I think the most important thing was getting proper sleep and going out. I was in an acapella club + I would go out to eat dinner with friends almost everyday. Also, if i really didn't feel like studying, I would leave it and then come back to it. I think that really kept my mind easygoing and less stressed. I saw a huge improvement from high school. I think if u treat school like a job u should be good. My hours were 12pm - 7pm. (My classes started at 1pm, I was lucky). So just arranging your study time around your class schedule really works. While also doing what you want outside those hours. That said, I didn't go to any parties because I'm not very social + I didn't want screw up my sleep schedule (very importanr!!). To me, college parties aren't really that important, so I didn't do it. But if that's important to you, then you should! You shouldn't have regrets because that will only add on to stress. But of course, party responsibly. Hope this helps!",
          "author": "2363ar",
          "created": 1595571149,
          "upvotes": 1,
          "replies": {}
        },
        "fz2cxrl": {
          "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fz2cxrl/",
          "text": "Thank you! All of these responses have been making me feel a lot better. Like I can get back up",
          "author": "2363ar",
          "created": 1595571301,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fyp8nst": {
      "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fyp8nst/",
      "text": "I totally feel this. I was taking 22 credit hour last semester and was a full time volunteer activist. Now I just wake up, go to work, and binge anime lmao.  I think we are all feeling this and it's completely understandable. Seeing how active you were preCovid tells me you're going to be right back up on your feet when the world makes a bit more sense.",
      "author": "ishperson",
      "created": 1595280543,
      "upvotes": 2,
      "replies": {
        "fyp9ekh": {
          "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fyp9ekh/",
          "text": "Saaaame I watched all of jojo and Saiki K and few others this summer. Rn I'm watching Haikyuu s4",
          "author": "2363ar",
          "created": 1595280911,
          "upvotes": 2,
          "replies": {
            "fyp9jqa": {
              "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fyp9jqa/",
              "text": "Saiki K was good. Idfk what happens at the end though",
              "author": "ishperson",
              "created": 1595280984,
              "upvotes": 2,
              "replies": {
                "fypnc6c": {
                  "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fypnc6c/",
                  "text": "ya that was a doozy",
                  "author": "2363ar",
                  "created": 1595288040,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fyo7wzn": {
      "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fyo7wzn/",
      "text": "This sounds to me like the beginning of cabin fever. Don't judge yourself, just try to get some sun and exercise a few times a week. Go to a new place, walk through downtown,  get carryout and eat on a bench somewhere. Your brain might just need a bit of a jolt to get going again. Humans need social activities, sunlight and exercise for mental health.",
      "author": "Unicornrescue",
      "created": 1595262669,
      "upvotes": 2,
      "replies": {
        "fyoc4pj": {
          "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fyoc4pj/",
          "text": "thank you, I'll try getting out a bit more",
          "author": "2363ar",
          "created": 1595264712,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fymtwbj": {
      "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fymtwbj/",
      "text": "Wow! That sounds like a lot of work you had last semester. Is there a near-ish deadline for the leadership application? I'm in a (barely) similar boat- I'm applying for nursing this fall for next fall, and have to take my TEAS. I was pushing it off sooooo much, but what's helped me is I take things really slow, studying casually at first for a few hours a day, or listening to A&P videos while I sew, which is what I suggest you try. \n\nIt's not bad to be unproductive unless you feel really unhappy because of it. Everyone is so stressed out with current events, and honestly anything that makes you happy is in some way productive, so don't stress! Maybe write a bit of what you need each day, slowly get yourself back into the mindset, and eventually you'll have yourself back in the position to where you *want* to be doing it all.\n\nBest of luck! Stay safe!!",
      "author": "joyleaf",
      "created": 1595224703,
      "upvotes": 12,
      "replies": {
        "fymudc0": {
          "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fymudc0/",
          "text": "The application deadline passed, it was the 11th. But also, thank you for your response! It's a good idea to start slow and ease myself back into things.",
          "author": "2363ar",
          "created": 1595225114,
          "upvotes": 3,
          "replies": {
            "fymus7e": {
              "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fymus7e/",
              "text": "Oh no! Still alright all the same though (-:",
              "author": "joyleaf",
              "created": 1595225479,
              "upvotes": 3,
              "replies": {
                "fymv1j0": {
                  "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fymv1j0/",
                  "text": "Idk im just so bad at those \"why do you think you should have this position?\" questions, it tired me out. I hate those questions",
                  "author": "2363ar",
                  "created": 1595225710,
                  "upvotes": 3,
                  "replies": {
                    "fymv4e6": {
                      "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fymv4e6/",
                      "text": "Oh I hate writing too, I'm not bad at it really but just hate it, and I also hate those questions so I would've noped easily too! hahaha it's like, why do you think??",
                      "author": "joyleaf",
                      "created": 1595225779,
                      "upvotes": 3,
                      "replies": {
                        "fymvju5": {
                          "link": "/r/CollegeRant/comments/hufwmd/covid_has_made_me_so_unmotivated_is_it_ok_to_feel/fymvju5/",
                          "text": "Ya exactly! Everyone (including me) only wants the leadership position for their resumes  unless it's a hobby driven club that they're actually passionate about. \n\nIf there's no specificity no one is gonna care unless it's personally beneficial. Those questions only test lying and writing skills. Smh.",
                          "author": "2363ar",
                          "created": 1595226161,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634064459
}