{
  "sid": "re6tk8",
  "link": "/r/CollegeRant/comments/re6tk8/can_you_pass_a_concentration_class_with_c/",
  "title:": "Can you pass a concentration class with C?",
  "text": "I’ve been trying to contact my advisor about this but of course she never answers. This is going to sound ridiculous but I have a 92.95 in a class and I’m convinced I’m gonna failed the final. My professor ain’t a harsh grader, he seems to want for every to pass, the lowest grade I’ve gotten this semester in the class is a 77 C and that’s the only low grade. However I’ve convinced myself that I’m gonna fail the final and end up with a C or worse (even tho I did check and even if I got a total 0 I would only get a B for the total course) so yeah my brain is playing the worst games with me at the moment and I half way though my finals project that’s for Tuesday 😀",
  "author": "Inevitable-Tomato-81",
  "created": 1639250729,
  "updated": 1639517890,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "ho7mpqh": {
      "link": "/r/CollegeRant/comments/re6tk8/can_you_pass_a_concentration_class_with_c/ho7mpqh/",
      "text": "I feel it. I have huge anxiety surrounding grades. We just finished finals on Thursday and I have been obsessively checking for scored. The due date for scores is Monday. I just can't help it though! I have these thoughts that I'm going to bomb my finals and end up with terrible grades even though I know that's not really possible. I'm planning on talking to my counselor at school about it when I get back next semester.",
      "author": "ScubaLevi20",
      "created": 1639285166,
      "upvotes": 5,
      "replies": {
        "ho904jz": {
          "link": "/r/CollegeRant/comments/re6tk8/can_you_pass_a_concentration_class_with_c/ho904jz/",
          "text": "This is literally me. Grades for my college are also due on Monday @ 9am. I’m still waiting on final grades in 2  classes. It’s so nerve wrecking.",
          "author": "2legit2quit28",
          "created": 1639319702,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho6llm0": {
      "link": "/r/CollegeRant/comments/re6tk8/can_you_pass_a_concentration_class_with_c/ho6llm0/",
      "text": "So I have OCD and the strategy I would use for this would be to just say “That would suck” or “It could happen” and move on. It helps me dismiss the thought and stop obsessing. Maybe it would help you too.",
      "author": "AppleTreeBloom",
      "created": 1639266702,
      "upvotes": 2,
      "replies": {}
    },
    "ho6yemj": {
      "link": "/r/CollegeRant/comments/re6tk8/can_you_pass_a_concentration_class_with_c/ho6yemj/",
      "text": "This depends on your school’s policy.",
      "author": "ThisIsntRealWakeUp",
      "created": 1639272815,
      "upvotes": 1,
      "replies": {}
    }
  }
}