{
  "sid": "qp0ptt",
  "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/",
  "title:": "My coding professor thinks I cheated. No the fuck I didn’t!",
  "text": "I want to rant.\n\nI got my grade for this particular assignment back earlier today and I got a 0/100. The professor claims it looks similar to the code of 2 other students. I’m not sure how that’s even possible due to the fact I did this all by myself and submitted my assignment before anyone else spoke. I then requested to see these codes she claimed I copied, and while it does look similar I can safely say there is no way in hell I copied. Mine looks completely fleshed out while the 2 others look like they where rushed over night and submitted a few minutes before the due date.\n\nI am many things but a cheater ain’t one of them. I feel offended… I paid for my classes out of pocket and to have this thrown at me is a crime to my character. I emailed my professor immediately after I saw my grade was posted but she has not gotten back to me.\n\nTomorrow I’m going to talk to her and if she won’t budge on accusing me of copying then I’m going to the dean.",
  "author": "Tactical_Leo",
  "created": 1636327760,
  "updated": 1636656357,
  "over_18": false,
  "upvotes": 232,
  "upvote_ratio": 0.98,
  "comments": {
    "hjqmo5t": {
      "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/hjqmo5t/",
      "text": "It can be upsetting to be falsely accused of something, but it most likely wasn’t personal. Try to keep your emotions out of it if you do go to the department chair - who, by the way, should be the next stop (don’t go right to the dean - this usually doesn’t go well, and you’ll probably be kicked down to the department chair, anyway).\n\nGood luck!",
      "author": "PhDapper",
      "created": 1636328263,
      "upvotes": 159,
      "replies": {
        "hjtup2i": {
          "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/hjtup2i/",
          "text": "My university has a thing called Academic Ombud who might also be able to help with something like thus",
          "author": "AcademicBME",
          "created": 1636393671,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hjqnkyv": {
      "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/hjqnkyv/",
      "text": "Universities have a strict set of guidelines that must be followed in case of possible cheating. Be patient and know the rules. \n\nAt my school, a prof is **not allowed to communicate with a student** if an allegation of cheating has been made. The same may be true at your school. Confronting them will not go well for you.\n\nWhen the time comes, you'll be informed of the next step. You can explain your case then. \n\nMake sure you speak with someone who knows the process. It's very easy to get yourself into trouble if you don't keep quiet.",
      "author": "Aler123",
      "created": 1636328665,
      "upvotes": 64,
      "replies": {}
    },
    "hjqmpyv": {
      "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/hjqmpyv/",
      "text": "Go to dept head first, go up the chain",
      "author": "SoniCode12",
      "created": 1636328285,
      "upvotes": 51,
      "replies": {}
    },
    "hjqv4iu": {
      "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/hjqv4iu/",
      "text": "You are right to be frustrated, but try to understand the professors position in dealing with those who do cheat.\n\nThe timing of when you submitted the assignment seems critical. Be kind and polite to the instructor and note how you turned it in much earlier than the other two and point out the differences.  Ask her to test your knowledge if she doesn't believe you were capable of the work.\n\nIf she doesn't budge then move up the chain - generally chair, then dean, but follow the order your school has established.",
      "author": "BiochemBeer",
      "created": 1636332055,
      "upvotes": 34,
      "replies": {}
    },
    "hjsqscv": {
      "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/hjsqscv/",
      "text": "Bruh I swear some of these fuckers think they are some detectives or some shit. Like if u wanted to be a detective ur in the wrong job u fuck. get the fuck out. (Talkin about the professors lol) Also I’m pretty sure in the case of programming there’s a limited amount of ways of doin something. So idk how they can say code looks like someone else’s. What if 2 people think the same way? Why is that not a possibility? Also why is cheating such a big problem on tests and shit? If u have access to information (phone, Google, etc) WHY TF NOT USE IT? To learn a bunch of useless shit in High school?! And then get to college with no real idea of what the fuck to do?",
      "author": "Salvationzzzz",
      "created": 1636376070,
      "upvotes": 8,
      "replies": {}
    },
    "hjr4th8": {
      "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/hjr4th8/",
      "text": "This is why I cheat. I cannot have my character damaged if I am literally a cheater.",
      "author": "allgone6996",
      "created": 1636336645,
      "upvotes": 23,
      "replies": {}
    },
    "hjr500z": {
      "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/hjr500z/",
      "text": "Reading the comments here makes me scared abou going to college for computer science, might just dip out of it and take the internship/self learning route",
      "author": "HappyDragonBoy",
      "created": 1636336730,
      "upvotes": 10,
      "replies": {
        "hjrv6tc": {
          "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/hjrv6tc/",
          "text": "You should still go",
          "author": "GentlyWeepingGuitar_",
          "created": 1636350983,
          "upvotes": 7,
          "replies": {
            "hjrwpkr": {
              "link": "/r/CollegeRant/comments/qp0ptt/my_coding_professor_thinks_i_cheated_no_the_fuck/hjrwpkr/",
              "text": "👍",
              "author": "HappyDragonBoy",
              "created": 1636352071,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}