{
  "sid": "qgp3u2",
  "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/",
  "title:": "GOD-FUCKING DAMN IT- FUCK COLLEGE",
  "text": "NSFW: Language\n\nIt's the middle of the damn semester, these fucking professors haven't marked any of my stuff, yet pushed for me to submit on time (I HAVE NO IDEA OF MY ACADEMIC STANDING) . I FUCKING PAID THOUSANDS of dollars out of pocket for tuition (I'm poor and don't qualify for student aid), they tell us to BUY textbooks worth Hundreds of dollars, and we only use 2-4 chapters OR THEIR POSTED SLIDES, and then...THEN have the audacity to say \"when we posted it on the \"REQUIRED textbooks section\", it was just a suggestion\".\n\nAdditionally, my accounting professor wants us to NAME OUR WORK FILES HER FUCKING WAY SPECIFICALLY, OR WE GET A 0 FOR THE ENTIRE FUCKING ASSIGNMENT (Bitch, I have the content correct, and it opens fine on your pc IN FUCKING PDF FORMAT). FUCK THIS BITCH ESPECIALLY.\n\nIN THE MIDDLE OF THE FUCKING SEMESTER, DURING A PANDEMIC, I HAVE TO GO TO A DAMN FUCKING RESTAURANT MILESSS AWAY FROM MY HOME TO COMPLETE A BUSINESS REPORT ON THAT BUSINESS FOR MY BUSINESS CLASS.\n\nTHEN...THENNNNN I HAD TO PAY CLOSE TO $600 FOR ONLINE LAB PROGRAMS FOR MY STATS AND ACCOUNTING COURSES...WHAT. THE. FUCK.\n\nAS A FIRST-GENERATION COLLEGE STUDENT, I SEE THIS AS SOME HIGH-QUALITY FUCKERY.\n\nI'M ONE SEMESTER AWAY FROM GRADUATING, BUT THESE FUCKERS ARE TESTING ME TO MY ABSOLUTE FUCKING LIMIT.\n\nI'M BROKE. I'M DEPRESSED. I HAVE NO TIME. I'M SLEEP DEPRIVED\n\nI KNOW I'M NOT FUCKING DUMB, BUT FOR SOME REASON, EVER SINCE THIS ONLINE FUCKERY HAS OCCURED, I JUST FUCKING FEEL DUMB, AND USELESS. WHAT THE FUCK TYPE OF SORCERY IS THIS EH? I'M AT THE END OF MY ROPE, AND ITS A SHORT FUCKING ROPE.\n\nIN CONCLUCION: AAAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH\n\n&#x200B;\n\ntl;dr : College is really fucking with me at the moment, and I've had enough.",
  "author": "rainbows_and_rum",
  "created": 1635311295,
  "updated": 1636191418,
  "over_18": true,
  "upvotes": 231,
  "upvote_ratio": 0.96,
  "comments": {
    "hi7zog0": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi7zog0/",
      "text": "Same felt all those",
      "author": "_readyforww3",
      "created": 1635320582,
      "upvotes": 61,
      "replies": {}
    },
    "hi8fono": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi8fono/",
      "text": "one thing online school taught me was to always take screenshots of things",
      "author": "mingxingai",
      "created": 1635333667,
      "upvotes": 19,
      "replies": {}
    },
    "hi87mq8": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi87mq8/",
      "text": "Im suprised your post didn't get taken down for having all caps title, must be the other subreddit then",
      "author": "TheRapidTrailblazer",
      "created": 1635327523,
      "upvotes": 34,
      "replies": {}
    },
    "hi99gla": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi99gla/",
      "text": "As students I think as a whole we need to start pushing back. We are the ones paying for the education and we should start grading teachers. Requiring high standards for students yet not fulfilling their literal job duties is bull shit. They are actually required to give feedback. Btw they have a Reddit page so you can see how they really view us as students: r/Professors",
      "author": "Wrong-News8267",
      "created": 1635348193,
      "upvotes": 24,
      "replies": {
        "hi9mvhj": {
          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9mvhj/",
          "text": "That place is toxic and horrible.\n\nEdit: check out the website rate my professor",
          "author": "GroveHere",
          "created": 1635353592,
          "upvotes": 19,
          "replies": {
            "hi9nuhr": {
              "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9nuhr/",
              "text": "I was scrolling through it and you’re absolutely, 100% correct.",
              "author": "rainbows_and_rum",
              "created": 1635353976,
              "upvotes": 7,
              "replies": {}
            },
            "hia4avv": {
              "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hia4avv/",
              "text": "I didn't see anything really horrible on that sub, am I missing something?",
              "author": "Sharthog69",
              "created": 1635360381,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "hia8rmm": {
          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hia8rmm/",
          "text": "The Professors (most public Universities and some private) are PROTECTED by their Union! Which means they practically need to kill or severely harm a student to get anything done! \n\nAnything from not wanting to learn new technology (Zoom) to exerting their “privileges” through tenor! They also manipulate their ratings on rate my professor!!",
          "author": "RomanLion29",
          "created": 1635362128,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hiaw5hu": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hiaw5hu/",
      "text": "Ahhh I felt every single thing about this rant",
      "author": "43richierich43",
      "created": 1635371175,
      "upvotes": 3,
      "replies": {}
    },
    "hi86a8b": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi86a8b/",
      "text": "This was hilarious",
      "author": "rahrah_2",
      "created": 1635326356,
      "upvotes": 12,
      "replies": {}
    },
    "hi8l82n": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi8l82n/",
      "text": "Yes",
      "author": "Pretend-Reality-3468",
      "created": 1635337053,
      "upvotes": 2,
      "replies": {}
    },
    "hi9bq6e": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9bq6e/",
      "text": "*pat pat*",
      "author": "updog_nothing_much",
      "created": 1635349098,
      "upvotes": 2,
      "replies": {}
    },
    "hi9dr40": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9dr40/",
      "text": "Like for real man I’m so done with it just want to graduate",
      "author": "MichaelaRene",
      "created": 1635349946,
      "upvotes": 2,
      "replies": {}
    },
    "hi9mqil": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9mqil/",
      "text": "Mood",
      "author": "GroveHere",
      "created": 1635353537,
      "upvotes": 2,
      "replies": {}
    },
    "hia6k89": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hia6k89/",
      "text": "Are you me?= California State University Long Beach!!! \n\nI hope you feel better and that getting it out on here helped, since all “supportive” programs on campus are anything but “supportive” (IHO) since the ones with any real power to change things aren’t listening (IHO)\n\nRainbows 🌈 and Rum 🍹: Close your eyes, you Can see the Rainbow up ahead...take a long hard gulp of that Rum....the finish line is in sight....and..Regroup—don’t let the gargantuan machine eat you December is around the corner and this Fuckery will soon be over! You’re almost there...I’m right behind you! Keep pushing!!!\n\n* NOT ONE DAMN DIME to ALUMNI OFFICE! NOT ONE!!!  (FACT)",
      "author": "RomanLion29",
      "created": 1635361261,
      "upvotes": 2,
      "replies": {
        "hiamjee": {
          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hiamjee/",
          "text": "Taking a class (FASH 141) that follows CSULB curriculum and… seriously I hate your school just for the unnecessary shit I do in this gen ed class.",
          "author": "ATTWL",
          "created": 1635367381,
          "upvotes": 2,
          "replies": {
            "hib65bo": {
              "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hib65bo/",
              "text": "Hear that??? Read that??? Anyone Considering CSULB AVOID going here!!! It is everything described in this post and more!!! Not worth your grants, scholarship and sure as hell not with your Ed Loans (with interest)!!! ( My Experience: Businesses School)",
              "author": "RomanLion29",
              "created": 1635375426,
              "upvotes": 3,
              "replies": {
                "hibmx27": {
                  "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hibmx27/",
                  "text": "Nah I’m just annoyed that I have to do a large group project in fucking fashion merchandising. GE classes are supposed to be easy dammit.",
                  "author": "ATTWL",
                  "created": 1635382899,
                  "upvotes": 2,
                  "replies": {
                    "hibpip8": {
                      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hibpip8/",
                      "text": "😂🤣",
                      "author": "RomanLion29",
                      "created": 1635384066,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hib2gd8": {
          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hib2gd8/",
          "text": "Oh my god, this has got to be the most purest of pure comment I’ve ever come across. I don’t know you, but I fricking love you random stranger. Hope your semester is going well too. I’m a New Yorker enrolled in a Senior City University. Btw, even though my body’s in NY, my mind, body and soul are in CA.\n\nThey’re (Alumi) not gonna see a dime 😅\n\nI really do appreciate the kind words!",
          "author": "rainbows_and_rum",
          "created": 1635373811,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hichjeu": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hichjeu/",
      "text": "I send my love stranger, usually mull over rants but yours was so sincere and freaking angry! Heck yes! Felt it in my core. Thank you for helping me release some. You’re not alone. \nMy experience had even caused an interest in teaching rather than researching. I’m an ecology student, two semesters from graduation. The amount of professors I have felt that are seriously just hateful towards younger generations and/or seem to have given up is saddening. Not entirely our faults. \nTake a look at recent media and average opinions towards teachers or professors. Why wouldn’t you just hate everything and give up.",
      "author": "DucTape696",
      "created": 1635398331,
      "upvotes": 2,
      "replies": {}
    },
    "hie5w0e": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hie5w0e/",
      "text": "Jesus. This is college for you folks :)))) I’m in the same boat buddy, all I can say is I wish you good luck",
      "author": "InfluenceNatural4149",
      "created": 1635435815,
      "upvotes": 2,
      "replies": {}
    },
    "hi9tkdm": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9tkdm/",
      "text": "College is a fucking scam.",
      "author": "bumblebeequeer",
      "created": 1635356248,
      "upvotes": 5,
      "replies": {
        "hie6221": {
          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hie6221/",
          "text": "True, but it also depends on what you make out of it.",
          "author": "InfluenceNatural4149",
          "created": 1635435882,
          "upvotes": 2,
          "replies": {
            "hie7jzr": {
              "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hie7jzr/",
              "text": "To add on to my previous comment, maybe college itself isn’t a scam, as you do get the degree you pay for if you earn it, however I believe the way it’s marketed and run is extremely predatory. Young people are told they must go to college and often have many people in their life telling them to major in whatever the F they want, which leads to a lot of people in massive debt and a useless piece of paper they can’t use. \n\nCollege might not be a scam, but it’s certainly a business, and a skeevy one at that.",
              "author": "bumblebeequeer",
              "created": 1635436473,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hi9xtsx": {
          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9xtsx/",
          "text": "Its not lol. Very few colleges are actually scams. Theres just a lot of things that could be improved on, but I mean its pretty straightforward - you pay the price and get a degree (if you pass). If a college specifically promises something that they dont deliver on theres ways to try to rectify that. I see your type of comment all the time here and its just not true",
          "author": "taybay462",
          "created": 1635357883,
          "upvotes": 1,
          "replies": {
            "hiap3rn": {
              "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hiap3rn/",
              "text": "Imo it depends on the college and if the professor and students are willing to get it. At least two colleges Ik have a failed their students (LeMore Owen is one)",
              "author": "Forever_ForLove",
              "created": 1635368363,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hi82805": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi82805/",
      "text": "Sorry to break the news to you, but you’d be just as angsty even if covid were never a thing. Have fun at school today bb!!",
      "author": "yeTaughtMe2",
      "created": 1635322786,
      "upvotes": -15,
      "replies": {
        "hi8i6j8": {
          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi8i6j8/",
          "text": "Sorry to break it to you, but I’d have to disagree. Professors are piling on 2x-3x as much work because of the illusion that we have more free time as well as giving less time to submit, but forget that some of us are working, have families/kids, etc. The subscription cost for programs,  that otherwise would have been provided free on college PC is just intense, and, the fact that full tuition is required, even though we don’t use any school services except zoom (which is free), just sucks.",
          "author": "rainbows_and_rum",
          "created": 1635335260,
          "upvotes": 8,
          "replies": {
            "hi8nams": {
              "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi8nams/",
              "text": "You don’t have more free time, but you don’t have to commute which saves you a lot of time. Do your work an hour or 2 earlier the you won’t be so overwhelmed, how many times do you have to go through the same issues for yourself before you learn?",
              "author": "yeTaughtMe2",
              "created": 1635338183,
              "upvotes": -16,
              "replies": {
                "hi9g94w": {
                  "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9g94w/",
                  "text": "Some of us don’t have that comfort. There’s bills, rent, work and family to care for. Moreover, my original post also stated that these professors are too damn lazy to just grade my items in a timely manner so that I know my academic standing in the course so I could know if to drop or not. Additionally, when there’s applications for graduate schools breathing down your back, and these due dates that are significantly shorter than when in person, there’s chaos. I submit shit on time, or even prior to deadline. My main concern is that these college professors don’t respect their students enough to grade on time, or even cater for their students situations. Additionally, they can come whatever the fuck time they want to class, but I sign in later due to internet issues or whatever and all of a fucking sudden, I’m the lackadaisical one.",
                  "author": "rainbows_and_rum",
                  "created": 1635350956,
                  "upvotes": 8,
                  "replies": {
                    "hi9gxoi": {
                      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9gxoi/",
                      "text": "Don’t lump every single professor in that category, not all of them are like that. Got a problem with how they perform their jobs? Then speak with those professors personally in office hours like a responsible adult and let them know that you feel they’re not grading on time. Let them know that you turn things in on time and would appreciate your hard work being accounted for. I can assure you that they don’t have that “comfort” you speak of either. Bottom line, everyone’s out for themselves why should they treat you as if you’re special? You’re another number. Welcome to the real world.",
                      "author": "yeTaughtMe2",
                      "created": 1635351234,
                      "upvotes": -2,
                      "replies": {
                        "hi9i4y7": {
                          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9i4y7/",
                          "text": "I’m not speaking from one semester’s experience, about one professor. We’ve been in an online format for close to 1.5 year, and it’s a trend that’s been occurring. I am not the only student, there’s a great number more facing the same issue. We’ve spoken with professors, they said they’ll don’t A but instead do B or nothing at-all.\nI’m not carrying out this thread anymore. My bottom line is; I paid my hard earned money, I want my service to be well done.",
                          "author": "rainbows_and_rum",
                          "created": 1635351713,
                          "upvotes": 6,
                          "replies": {
                            "hi9q6aq": {
                              "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9q6aq/",
                              "text": "You and everybody else buddy, I didn’t particularly enjoy living in shitty dorms and going to in-person classes. To each their own, you’ll live through this in any case I promise. Still, have a great rest of your day though!",
                              "author": "yeTaughtMe2",
                              "created": 1635354908,
                              "upvotes": 0,
                              "replies": {
                                "hi9qg5q": {
                                  "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9qg5q/",
                                  "text": "Likewise, enjoy the remainder of your day my dude/dudette.",
                                  "author": "rainbows_and_rum",
                                  "created": 1635355019,
                                  "upvotes": 6,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hi9j5gp": {
                  "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9j5gp/",
                  "text": "Not all persons can follow the same ritual as you my dude. Different people, different situations. Some colleges are shit, some ain’t, same for most professors, they get power hungry. It’s like the Stanford prison experiment but smaller and in a class room with these professors.",
                  "author": "HereTheForNews101",
                  "created": 1635352116,
                  "upvotes": 4,
                  "replies": {
                    "hi9qsu9": {
                      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9qsu9/",
                      "text": "Wow you have such a difficult life it brings a tear to my eye just reading about it, really…",
                      "author": "yeTaughtMe2",
                      "created": 1635355158,
                      "upvotes": -2,
                      "replies": {
                        "hi9xmgn": {
                          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9xmgn/",
                          "text": "What kind of condescending bullshit response is that lmao. I didnt get that read from that comment, at all. Theyre just pointing out that everyones situation is different, doing your work an hour or two earlier isnt always possible. You could be getting out of work at that time or having childcare duties at that time. Also, dude, this is a *rant* sub and youre telling people basically \"oh boo hoo your life is so hard\"??",
                          "author": "taybay462",
                          "created": 1635357805,
                          "upvotes": 3,
                          "replies": {
                            "hi9y627": {
                              "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hi9y627/",
                              "text": "Hmm yes, I suppose I am. I don’t understand all these excuses, you have such a great opportunity that a lot of people all over the world would absolutely kill for, the opportunity for a higher degree. You live in a first world country with all the food, clean water, and shelter you could ever need. No one said it was gonna be easy but life ain’t that bad lol quit whining.",
                              "author": "yeTaughtMe2",
                              "created": 1635358015,
                              "upvotes": -1,
                              "replies": {
                                "hia3sjm": {
                                  "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hia3sjm/",
                                  "text": "What excuses are you seeing..? I just see people complaining about valid, annoying things. An excuse is when you do something wrong and are trying to, well, excuse it. No one did anything wrong here.\n \nIts really, really not too much to ask for wanting *something* graded at this point in the semester. Complaining is fine, especially considering *this is a rant sub* which I dont think you fully understand. Shit could ALWAYS be worse. Yes we are privileged to be in college and have clean water and all that. That doesnt mean we can never ever complain lmao, if that were true then no one except tortured sexually abused orphans could complain which is obviously ridiculous. Again. This is a rant sub. Its important to get feelings off your chest. \n\n>quit whining.\n\nSir, this is a rant sub. I seriously dont know what other kind of content should be expected here.",
                                  "author": "taybay462",
                                  "created": 1635360183,
                                  "upvotes": 3,
                                  "replies": {
                                    "hia7vwt": {
                                      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hia7vwt/",
                                      "text": "Juust less whining, perhaps more justified complaining. How many times have you seen a post here complaining about the same generic bullshit that literally everybody in school deals with. “My professor sucks, lifes so unfair blah blah blah” who gives af you’re not special. It’s so hackneyed and cliche at this point and I’m entitled to my opinion, which is that this place is a cesspool of privileged college students. Don’t like it? No one’s holding a gun to your head forcing you to go to school buddy that’s on you. Your local McDonald’s is certainly hiring currently, but wait, no? You wanna get a good degree and make good money? Oh ok. But ofc you don’t want to do any of the hard work for it, you just want something for nothing for the rest of your life. Typical entitled people shit. This whole subreddit is the real excuse lol. Idgaf if u don’t like my opinion stay mad and go do your homework instead of Reddit browsing then ig, laters✌️",
                                      "author": "yeTaughtMe2",
                                      "created": 1635361783,
                                      "upvotes": -1,
                                      "replies": {
                                        "hiacwhu": {
                                          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hiacwhu/",
                                          "text": "Then complain about those posts on those posts, not on a post with valid criticisms lmao. But also.. this is a rant sub.. if you think someones rant is petty then downvote and move on. You seem to care a lot for some reason",
                                          "author": "taybay462",
                                          "created": 1635363719,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "hia2sc3": {
                          "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hia2sc3/",
                          "text": "[removed]",
                          "author": null,
                          "created": 1635359794,
                          "upvotes": 2,
                          "replies": {
                            "hia6cyu": {
                              "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hia6cyu/",
                              "text": "Cool idgaf, stay mad lmaoo",
                              "author": "yeTaughtMe2",
                              "created": 1635361182,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hifs90s": {
      "link": "/r/CollegeRant/comments/qgp3u2/godfucking_damn_it_fuck_college/hifs90s/",
      "text": "Revolutionary regimes didn't target universities for no reason",
      "author": "Lpmikeboy",
      "created": 1635459134,
      "upvotes": 2,
      "replies": {}
    }
  }
}