{
  "sid": "rd9nzq",
  "link": "/r/CollegeRant/comments/rd9nzq/is_this_a_dumb_thing_to_do/",
  "title:": "Is this a dumb thing to do?",
  "text": "My professor assigned my class a review sheet for the final and you can get an extra credit of 5 points if you complete it. The questions and all the answers were straight from her PowerPoints and other resources. I completed mine and sent it in. Some of the students in the group chat from that class asked if anyone completed the review sheet. I said that I did and someone texted me asking for a copy of it. I sent it to them told them to make a few changes and then he asked if he can send it to the class. I agreed and said just tell them to make some changes if they can. Was that a bad idea? I just thought since I copied all the answers from the resources that were posted that everything was right there.",
  "author": "jennamimi",
  "created": 1639145983,
  "updated": 1639517919,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.25,
  "comments": {
    "ho048ed": {
      "link": "/r/CollegeRant/comments/rd9nzq/is_this_a_dumb_thing_to_do/ho048ed/",
      "text": "I never give other students my homework. Why would you help people that are too lazy to do it themselves",
      "author": "crystalliite",
      "created": 1639153644,
      "upvotes": 16,
      "replies": {
        "ho061b8": {
          "link": "/r/CollegeRant/comments/rd9nzq/is_this_a_dumb_thing_to_do/ho061b8/",
          "text": "I did it because I felt bad since they waited to the very last minute. I kept getting countless texts asking to send my review sheet. I just thought since I copied everything from the professors presentation that it would be the same thing",
          "author": "jennamimi",
          "created": 1639154361,
          "upvotes": -6,
          "replies": {
            "ho088r6": {
              "link": "/r/CollegeRant/comments/rd9nzq/is_this_a_dumb_thing_to_do/ho088r6/",
              "text": "Their waiting to the last minute is not your problem. Their bad planning isn’t your emergency (a great saying that applies in a thousand ways to life situations).",
              "author": "PhDapper",
              "created": 1639155232,
              "upvotes": 11,
              "replies": {}
            },
            "ho2fiyp": {
              "link": "/r/CollegeRant/comments/rd9nzq/is_this_a_dumb_thing_to_do/ho2fiyp/",
              "text": "Thats their fault",
              "author": "elkfn2",
              "created": 1639187934,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hnzpkb1": {
      "link": "/r/CollegeRant/comments/rd9nzq/is_this_a_dumb_thing_to_do/hnzpkb1/",
      "text": "Because the professor is giving out points for completing this assignment, this can be considered cheating. Yes, all the answers are throughout PowerPoints and resources, but you had to comb through the material to find the answers, and by doing so, you were reviewing the material. Handing another student your completed review to turn in means that that student isn’t reviewing the material, and is only turning it in for the 5 points.",
      "author": "coopsanders7",
      "created": 1639147474,
      "upvotes": 8,
      "replies": {}
    },
    "ho0uwax": {
      "link": "/r/CollegeRant/comments/rd9nzq/is_this_a_dumb_thing_to_do/ho0uwax/",
      "text": "Yeah it was a bad idea. I always avoided group chats for this reason it’s just lazy students wanting to copy/cheat on everything for the most part. Just find an actual study group of people you know and trust to work together on assignments (if ur prof allows it)",
      "author": "airbear13",
      "created": 1639164198,
      "upvotes": 5,
      "replies": {}
    },
    "ho0zd7u": {
      "link": "/r/CollegeRant/comments/rd9nzq/is_this_a_dumb_thing_to_do/ho0zd7u/",
      "text": "I know your heart was in the right place but you shouldn’t do this again. Sharing assignments to copy is an honor code violation. If they go down you will get in trouble with them equally and no one will care that you had good intentions. Next time someone asks a good response might be “I’m sorry I’m not comfortable sharing because of the honor code, but I can help you know where to find the material or understand something if you’d like.” That way you’re saying no but still being helpful. That being said though I’m sure you will be okay this time around, don’t stress over it too much!",
      "author": "lemonadesun",
      "created": 1639165992,
      "upvotes": 3,
      "replies": {}
    }
  }
}