{
  "sid": "pjpa8c",
  "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/",
  "title:": "Teachers that answer a question with a question.",
  "text": "Ok sorry if you disagree with me so don't attack me but I just need to vent. AHHHHHH!!!! I HATE teachers that answer your questions with another question what the hell is wrong with these people??? I get it if they are trying to make you think but when it's a simple question that I need to know the answer to like what units do we use for this specific thing? Then they tell me.. well with the info I have given you you should be able to figure it out. Well no!!! I cannot figure it out because I've been looking at all of the damn homeworks and papers and online stuff you have given me and googled everything and I cannot get a clear answer anywhere and since you are grading my work I want to know what you want from me!!! Can you just give me one clear answer because that is why I am asking you a freaking question!!! \n\nOk I'm done now thank you for letting me vent.\n\nTl;Dr I hate it when teachers don't answer a question clearly and instead respond with a question.",
  "author": "radchicken23",
  "created": 1631028440,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.81,
  "comments": {
    "hbyw2qv": {
      "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbyw2qv/",
      "text": "That's not answering a question with a question. That's answering a question with, \"Read the instructions.\"",
      "author": "hdorsettcase",
      "created": 1631043243,
      "upvotes": 5,
      "replies": {
        "hbz0jtc": {
          "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbz0jtc/",
          "text": "Yep-- I've taught students and I've done the \"answer a question with a question\" thing but the key is to ask questions that the student knows the answer to and that will lead them to the answer to the question they have. The point is to guide them in the right direction so they can learn what questions to ask themselves the next time they get stuck in the same situation.\n\nHonestly, though, as a teacher if all we're doing is teaching students to regurgitate information then we're not really doing our job. Like when I was teaching piano I had so many kids that just wanted me to show them how a piece went so they could copy it and then they'd get all whiny when I made them learn how to actually read the music. Years later when they were way ahead of their peers they didn't complain though.",
          "author": "HumanDrinkingTea",
          "created": 1631045047,
          "upvotes": 2,
          "replies": {
            "hc4nfpm": {
              "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hc4nfpm/",
              "text": "Sounds to me like u/radchicken23’s complaint is more so that his professors hand out assignments and aren’t clear enough on the instructions for the assignments. For example, they don’t clarify whether they want MLA or APA format on essay assignments.",
              "author": "Comprehensive-Ad3963",
              "created": 1631149547,
              "upvotes": 2,
              "replies": {
                "hc75riy": {
                  "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hc75riy/",
                  "text": "Yes that's what has been happening to me they can't answer with a simple answer most of the time. Not all teachers do this but some of them do and it annoys me ahhh!!!!",
                  "author": "radchicken23",
                  "created": 1631205189,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hbzc2z6": {
              "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbzc2z6/",
              "text": "Yes I agree sometimes it is useful when they are leading you to the answer but this teacher I have I sometimes ask a direct question like what type of format do you want this paper to be? And they answer with a question and I'm like ...what?? Lol but I do get what you are saying when you ask it in a way to lead to an answer then it is helpful",
              "author": "radchicken23",
              "created": 1631049800,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hbzbtjq": {
          "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbzbtjq/",
          "text": "Yes, but they sometimes answer with a question but I didn't give an example of it, but both annoy me!!",
          "author": "radchicken23",
          "created": 1631049690,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbyv865": {
      "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbyv865/",
      "text": "I'm a high school teacher and college student and i always do the asl questions thing when i don't know much about the subject myself or when i want to show my students i'm trying to engage with them and i appreciate that they ask questions.\nEdit; okay i just read it again and your teacher either isn't confident about their own knowledge or they are one of those teachers who think that the subject is easy for *them* it is easy and obvious for everyone. That's usually an issue that a lot of professors have. Most of them don't actually have a pedagogical or teaching degree, which is why they suck at teaching and do these dumb things.",
      "author": "churchisforbrunettes",
      "created": 1631042890,
      "upvotes": 1,
      "replies": {
        "hbzc9if": {
          "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbzc9if/",
          "text": "Yeah I agree with you. I have a feeling this teacher thinks it's easy for them but a lot of us are learning it for the first time so we don't know anything about the subject.",
          "author": "radchicken23",
          "created": 1631049877,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hbxzwtt": {
      "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbxzwtt/",
      "text": "That's totally a dick move. I don't really have great advice, but if you have tutoring services offered by the school, they will help you for free.",
      "author": "SouthernRhubarb",
      "created": 1631029964,
      "upvotes": 4,
      "replies": {
        "hbzbq74": {
          "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbzbq74/",
          "text": "Thank you, yes I think tutoring does help. I know not all teachers do this, but the ones that do annoy me so much!!",
          "author": "radchicken23",
          "created": 1631049651,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbxybdg": {
      "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbxybdg/",
      "text": "This\nI feel college existence is pure pain, its not even remotely close to real life\n\nIn a job they train you, you can ask colleagues if you're doing something right or wrong\nnot giving you a direct answer has always been my frustration",
      "author": "GadgetSun",
      "created": 1631029315,
      "upvotes": 12,
      "replies": {
        "hbzblnw": {
          "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbzblnw/",
          "text": "Yes! I agree with you I can't wait to have a job and be put of school!",
          "author": "radchicken23",
          "created": 1631049599,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064343
}