{
  "sid": "q8l914",
  "link": "/r/CollegeRant/comments/q8l914/multi_discipline_point_of_view_useful_or_worthless/",
  "title:": "Multi Discipline Point of View, useful or worthless?",
  "text": "I am in my final year in undergraduate Psychology program. I am repeat 2,5 years.   \n\n\nTl;dr: have a different point of view from others, in the positive, i am sure that my PoV could be use in real life (outside college), but it is not what the Uni want from their graduate. frustrate cause i feel worthless.   \n\n\nAt the beginning of college, i choose to go in campus wide extracurricular organization instead of faculty one. because of that, most my friend come from other faculty and discipline. i also discuss with them a lot. This grant me with multi discipline point of view. in the first and second year, with that PoV i got no worth problem. then beginning at 3rd year, i notice that i fall behind in analysis and sharpness from others. i notice that the others get so fast in determine and find connection between evidence, theory, and construct, and their analysis is also deep. While i tend to generalize and find connection to other discipline. I realize, why they became like that is because they are discuss with each other (same faculty) and that add the weight to their argument. meanwhile, because i mostly discuss to people from other discipline, i tend to simplify and generalize so that they can understand. This difference make me fall behind. cause the lecturer consider me as lack of understand.   \n\n\nYet, when i took internship, i  find the real use of my PoV. with my PoV, i can talk and discuss things with other people from different discipline. i can follow their talk and add my share. meanwhile, my other friend need some time to adjust their level. Then goes my dilemma, because i know very well that my PoV is useful in real life, but is consider worthless in academic setting, where sharpness and deep analysis is the one that to be expected. i decide to keep my PoV and modify it. and because of that i repeat years in college. i just frustrate over this matter. cause, real life problem is multi discipline, and could not be solved by only one discipline. but, my pint of view is consider worthless in the faculty.   \n\n\nThe lecturer is chill tho, cause i manage to bring unusual question from other discipline and pique their interest, but i could not meet faculty standard, so i get many red marks, and repeat years.",
  "author": "Ditto_Long",
  "created": 1634292177,
  "updated": 1634332059,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}