{
  "sid": "q2gluj",
  "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/",
  "title:": "I want to change major but hesitant",
  "text": "# THIS IS GOING TO BE A LONG RANT I AM SO SORRY ABOUT THAT :(\n\nwassup guys I am a 3rd year of college for computer engineer.\n\nMy problem with me is that I am simply just so uninterested and unmotivated to do well in classes in my major.\n\nI had no idea what major I wanted to do back in high school and I guess I chose the major that has decent job opportunity with good salary.\n\nHowever jesus christ I am so bad at this major and I find it so boring. I am terrible at coding, I am lost in most if not all of my classes to the point that I don't know what to ask for help, my grade is completely down the shitter. Taking a gap year didn't help when I returned since I just forgot everything I've learned (if I learned anything) before. Everyone in computer engineer seems to have some background with coding even before coming to college which was not the case for me at all.\n\nI considered myself a very lucky person to have a family who can financially support me through college unlike most students who need to have part time jobs to support themselves and I have no idea what to tell my parents who has financially supported me so far. (This is causing more stress to me than it really should considering how much I love my parents and I know how much they love me)\n\nI guess the most simple solution to my problem is to change major. Even with that I am so uncertain and scared since what if I find myself not liking my new major?\n\nI also tried to change my major at my 2nd year and discussed it with my advisor and she honestly simply said no. She was honestly garbage advisor who would never contact you and made excuses because of her pregnancy at the time. (I have a new advisor now so I kinda have my hopes up)\n\nWhen I think about it now, I don't think I was ever a hardworking person my entire life. I grades were never particularly impressive and it was either right at average or below.\n\nAnother major factor I think is affecting me is that I don't have any close friends in college. I do have couple of classmates that I would talk to in class but nobody that I would hangout with outside of class. I guess this is to blame entirely on me but transition from small high school (96 students in my grade) to a college (about 4000 students in grade) was really hard and I am an introvert.\n\nFor new major, I would like to pursue something art related (animation, computer drawing art etc.) but is changing major to something entirely unrelated to your old major a good idea? Is changing major even possible if your grade from previous major is so ass? I was always fascinated and interested in art related courses and I did apply for a game design initially and got computer engineer instead (my 2nd choice).\n\nThis was a long ass rant and I am sorry about that (I am quite stressed out of my situation) but any comment would help.",
  "author": "tuckmyhomietobed",
  "created": 1633510942,
  "updated": 1634093853,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 1.0,
  "comments": {
    "hfl8yz7": {
      "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfl8yz7/",
      "text": "If you're truly unhappy with your major, I would say do it. If you're scared about committing to a major, you should try one or two classes to see if you like it. Just a heads up, if you change your majod you would probably have to stay in college an extra year or two, but it's totally worth it.",
      "author": "Brian2017wshs",
      "created": 1633518140,
      "upvotes": 8,
      "replies": {
        "hfn6xy7": {
          "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfn6xy7/",
          "text": "Yeah it seems that is the case. Honestly I am fine with spending few years in collage but I feel like dead weight to my parents, making them pay tuition for me as I mentioned above. \n\nIf it comes to worst, I guess I would do some part time job and look for more financial aid. \n\nThanks for the comment bro, means a lot to me.",
          "author": "tuckmyhomietobed",
          "created": 1633550270,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hfm7xus": {
      "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfm7xus/",
      "text": "Alright, so what I normally tell people is this. You have to realize that at this point in your life it is OKAY to explore new areas of academic interest. That's kinda one of the many purposes of college. Look, I'mma be honest here, I love coding. Been coding since 16 in high school and I love to solve the problems that arise from it, but I'm not saying that to flex I'm saying that to also point out that I know damn well just how soul-crushing these university-level coding assignments can be. I thought it would be better once I got into the industry through an internship. In some cases, it actually is bc many companies will offer you resources to learn a particular technology that meets their needs and this can be a better way to learn programming.\n\nThe bad news is, it gets worse. I mean way worse. As a computer engineering student, you work on the low-level side of things, and lemme tell you these companies don't play. You know what to do, or you don't. Anybody is welcome to debate me on that, I'm not a comp engineering major tbh (I'm electrical), so I wouldn't fully know everything the industry expects from y'all. But at that point, you should ask yourself are you willing to risk finding that sweet job where it's easy to learn and still get the salary and career benefits of an engineer, or end up with a job that's far too overwhelming for you where you don't even like what you do?\n\nThen we also have you and your real passion. There is nothing wrong with changing majors to art you can find a very fulfilling career out there that involves doing what you love! Animation is a kick-ass career field, I personally wanted to be a 3D animator as my career before going into engineering. Don't be stressed, you're still figuring things out. Talk to your new advisor, and see what can be done. \n\nQuick note: I'm currently a senior electrical engineering major with a double minor in computer science and cybersecurity, so dm me if you need any help with school, advice, etc. Hope this helps!",
      "author": "TAMUVIBEZ",
      "created": 1633535650,
      "upvotes": 3,
      "replies": {
        "hfn6oz2": {
          "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfn6oz2/",
          "text": "Thanks so much for encouraging words and honest opinion of the major. \n\nYour comment helped me panic less and ease down a bit and hopefully I can change my major.\n\nYour comments means a lot to me thank you",
          "author": "tuckmyhomietobed",
          "created": 1633550169,
          "upvotes": 1,
          "replies": {
            "hfnok2f": {
              "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfnok2f/",
              "text": "Happy to help! Don't panic bc things will be alright you've still got time!",
              "author": "TAMUVIBEZ",
              "created": 1633557918,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfmmybr": {
      "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfmmybr/",
      "text": "I just wanna say, I don't blame you for wanting to get out of coding. Shit has been a nightmare for me my entire college career.",
      "author": "unholymanserpent",
      "created": 1633541781,
      "upvotes": 3,
      "replies": {
        "hfn6567": {
          "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfn6567/",
          "text": "Yeah I can see why some ppl enjoy it tho and try to learn it so much since it has good job opportunity and high salary. Unfortunately it doesnt seem to be the major for me :(",
          "author": "tuckmyhomietobed",
          "created": 1633549939,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfscne5": {
      "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfscne5/",
      "text": "If the thought crossed your mind, you more than likely want to change. I can speak from experience. I was a freshman in college in 2019, and I chose animal science as my major. I had a HUGE case of imposter syndrome because everyone had shadowed with vets or volunteered at shelters. I had done none of the sort. I felt so behind and I just got there. As I progressed throughout the semester, I hated every animal science class from the content to the work. It stressed me out beyond comprehension and I wasn’t even interested in what I was learning, I just wanted to do well. The thought of changing my major was always in the back of my mind, but I was so unsure.\n\nI stuck it out until the beginning of my sophomore year, and realized I couldn’t take it anymore. I changed my major to Communications and I’ve been super happy! I made the right decision and I’m ACTUALLY intrigued by what I’m learning.\n\nWith my long story in mind, I hope this brings you some closure and answers. I wish you the best no matter what path you choose!☺️",
      "author": "amarzing19",
      "created": 1633647030,
      "upvotes": 3,
      "replies": {
        "hfslxfu": {
          "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfslxfu/",
          "text": "Yeah I think I am exactly in your shoe. Hopefully my new major interests and motivates me as it did for you. Thanks for the comment man.",
          "author": "tuckmyhomietobed",
          "created": 1633651597,
          "upvotes": 3,
          "replies": {
            "hfsm3p9": {
              "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfsm3p9/",
              "text": "for sure! I know that hearing someone else’s story can provide closure and make you feel less alone. (also, I’m a girl☺️)",
              "author": "amarzing19",
              "created": 1633651685,
              "upvotes": 3,
              "replies": {
                "hfsmc4x": {
                  "link": "/r/CollegeRant/comments/q2gluj/i_want_to_change_major_but_hesitant/hfsmc4x/",
                  "text": "oh shoot thank you fam XD",
                  "author": "tuckmyhomietobed",
                  "created": 1633651804,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}