{
  "sid": "qiuet0",
  "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/",
  "title:": "Might be graduating at 22-23 (is this bad?...)",
  "text": "I took a gap year and I'm excited about college but I feel bad that I'm graduating at 22-23 because I feel like I'm wasting my life or something at college and a year wasted cause I had to take a gap year due to finances. I want to start a small business and work my way up while in college but then I feel like my drive is now suddenly downhill since I didn't start my career at an undecided age. I might have to even do classes in the summer to catch up. Well, not catch up but go graduate at the proper age. Ugh, time sucks.",
  "author": "luludica_is_ded",
  "created": 1635570096,
  "updated": 1635780256,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.56,
  "comments": {
    "himf1lb": {
      "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/himf1lb/",
      "text": "That’s the normal age to graduate..",
      "author": "Dependent-Cause",
      "created": 1635583998,
      "upvotes": 33,
      "replies": {}
    },
    "him975f": {
      "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/him975f/",
      "text": "No it’s not. I am 26 and will be finally getting my bachelor’s degree this year. I also want a master’s degree so I will be done at 28. I can relate to your worries but there are so many people who graduate later than what’s deemed “normal” so don’t give up :)",
      "author": "Pianokeys1995",
      "created": 1635579231,
      "upvotes": 14,
      "replies": {}
    },
    "him2o10": {
      "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/him2o10/",
      "text": "I’m 32 and finishing my bachelors. You are fine. I had a good time at 23. You have plenty of life left to do whatever you’d like",
      "author": "megs1288",
      "created": 1635574178,
      "upvotes": 13,
      "replies": {}
    },
    "himgdsr": {
      "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/himgdsr/",
      "text": "22 is the average age to graduate if you completed college in four years, but most don’t complete college in four years and do it in five. Graduating at 22-23 is completely normal and I wouldn’t waste a second more thinking about that. If it makes you feel any better, I’m just starting school at 22 considering I worked like many for a few years before college.",
      "author": "MedicalResolution7",
      "created": 1635585124,
      "upvotes": 11,
      "replies": {}
    },
    "hin6b3m": {
      "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/hin6b3m/",
      "text": "I graduated at 23 with my Honours Bachelor of Arts in Law & Legal Studies this past June, AND just went back im September to the same university to pursue a second undergraduate degree, a BSc in Neuroscience. I wanted to be a lawyer my entire life because I literally grew up in a law office and was always surrounded by it, the subject also came naturally to me so that was always a plus. But in my second year I panicked because I felt crushed by damn near everything about being a lawyer: the office environment, the law being very limited in being able to make substantial changes in most situations, the corporate attire even. I started taking science electives (ones I could anyway) and fell in love with neuroscience and medicine. \n\nSo in order to get into the neuroscience degree, and eventually go to medical school thereafter, I completed 2 grade 12 math classes during my senior year of my degree. After crushing those I applied and did the whole application process I did 4 years ago. I finished my degree (on the dean’s list) and graduated in June 2021 and matriculated into the neuroscience program at Carleton University in Canada. I’m hoping to attend medical school in about 3-4 years, at that I will be approximately 28. \n\nMy family doc was 28 when he started medical school and was very adamant about age not being something to stress over. And I’m actually going to look at going into a surgical specialty such as neuro or plastics so I will be in my 40s before I actually start practicing without training wheels. \n\nStop putting all this time pressure on yourself. Society does enough of that bullshit. So do tests and entrance exams. \n\nYou’ll be alright :)",
      "author": "painted_dancer",
      "created": 1635602308,
      "upvotes": 4,
      "replies": {}
    },
    "hiniv8n": {
      "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/hiniv8n/",
      "text": "I'm 22 and will likely graduate at 24 or 25. I don't see it as bad or wasted time. We'll have a whole lifetime to catch up on the so-called wasted years we spend in college.",
      "author": "TheAeroSpacial",
      "created": 1635608101,
      "upvotes": 2,
      "replies": {
        "hinzx1y": {
          "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/hinzx1y/",
          "text": "Same here dude!! So comforting to read your comment :) let’s succeed!",
          "author": "chitsu195",
          "created": 1635615214,
          "upvotes": 2,
          "replies": {
            "hio78yi": {
              "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/hio78yi/",
              "text": "Likewise! Thank you for saying so, let's do it 😁",
              "author": "TheAeroSpacial",
              "created": 1635618285,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hio7bpx": {
          "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/hio7bpx/",
          "text": "Same 😭",
          "author": "chicityhopper",
          "created": 1635618317,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hio6srb": {
      "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/hio6srb/",
      "text": "A degree program is typically 4 years so unless you took more classes than average or gained credits through high school courses, you’d be graduating at 22 at the bare minimum. You’re definitely fine. There were 40 year olds and 20 year olds in my classes, college does not have a timeline.",
      "author": "sassyashle__",
      "created": 1635618099,
      "upvotes": 1,
      "replies": {}
    },
    "hitosjq": {
      "link": "/r/CollegeRant/comments/qiuet0/might_be_graduating_at_2223_is_this_bad/hitosjq/",
      "text": "I went to college after high school and am gonna graduate (4 years in) when I’m like 22 and 2/3s so no thats very very normal.",
      "author": "TWR3545",
      "created": 1635723304,
      "upvotes": 1,
      "replies": {}
    }
  }
}