{
  "sid": "k9gsjl",
  "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/",
  "title:": "Is college supposed to be this stressful and depressing?",
  "text": "Been stress crying for months now because I'm not sure if this is really what I want. I dont want to sound ungrateful but I'm seriously not happy about college... or school in general. I hate conforming to the strict rules and deadlines. Is this really worth it?\nI just want to focus on my small business tbh...\n\n I just feel like a lot of my time is wasted doing hw instead of doing what I want to do. I'm so tired... I wanna quit.\n\nEdit: the fact that almost 200 people agree shows how there's something wrong with the school system. Learning should be fun, not torturous.",
  "author": "elizahmendoza",
  "created": 1607473493,
  "over_18": false,
  "upvotes": 225,
  "upvote_ratio": 0.99,
  "comments": {
    "gfbpa8s": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gfbpa8s/",
      "text": "> I'm so tired... I wanna quit.\n\nHow I felt this whole semester. The worst part about it for me was realizing that a college degree won’t guarantee you a job. College is a gamble, one that I feel like I’ve lost big time and now I’ll be graduating with debt",
      "author": "CantuTwists",
      "created": 1607635530,
      "upvotes": 2,
      "replies": {
        "gfg1p5a": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gfg1p5a/",
          "text": "I agree 💯. I feel better doing things in the real world rather than work for a degree.",
          "author": "elizahmendoza",
          "created": 1607721778,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gfawfzw": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gfawfzw/",
      "text": "Yeah, I'm turning in mediocre work for grades and I could really be working on awesome projects. This realization does suck and stress me out, but I'm looking forward to it.",
      "author": null,
      "created": 1607621623,
      "upvotes": 2,
      "replies": {
        "gfg2005": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gfg2005/",
          "text": "Looking forward to what?",
          "author": "elizahmendoza",
          "created": 1607721930,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gf6pxs7": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf6pxs7/",
      "text": "Switching to part time for the first time next term.",
      "author": "ZenithCrests",
      "created": 1607534717,
      "upvotes": 1,
      "replies": {
        "gf74hgn": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf74hgn/",
          "text": "How do you do that? Does that only apply to US colleges?",
          "author": "elizahmendoza",
          "created": 1607541364,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gf6o1i4": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf6o1i4/",
      "text": "People who say \"college was the best years of their life\" are just rich kids who's parents just dropped them off to adult daycare for four years.",
      "author": "NoChannel1",
      "created": 1607533859,
      "upvotes": 8,
      "replies": {}
    },
    "gf6jgo6": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf6jgo6/",
      "text": "When you start your business please hire me, I don't wanna do college anymore either 😂😭",
      "author": "snowytigers",
      "created": 1607531761,
      "upvotes": 2,
      "replies": {}
    },
    "gf69y5u": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf69y5u/",
      "text": "The answer is essentially yes. In Canada instead of Spring Break we have what’s call Reading Break, and while the purpose is supposed to help you catch up on your studies, the real reason is I guess this week had the highest rates of suicide for post secondary students as it was usually the around the time students would be finding out if they qualified for graduation that year...or not, or if they got into their masters or doctorate program...or not.\n\nThe program I took would deliberately overload its first and second years students to weed out the weak ones. We had 12 more credits in our major than average so the first and second year students would take six classes a semester. I was a transfer student so I was able to avoid the grind a little since I had enough credits I didn’t have to do six courses a semester. I ended up cutting my course load down to 4 a semester, did way better, and actually was able to enjoy the experience. \n\nConsider doing that if you can. Real life can wait another year. As someone who was a mature student I don’t get this drive kids have to get their degree by 21. Slow down, live a little.\n\nOr if you’re just interested in your small business maybe you’re in the wrong program? There are a a lot of small business or administration type programs at community colleges. I actually started my post secondary education at this type of program, and completed a one year administration certificate so I could break out of the retail and food service jobs. Then decided to keep going and got a degree but I’ll be honest with you that administration certificate and experience has gotten me more jobs than my fine arts degree has, and has even been a factor in the fine arts jobs I have gotten.",
      "author": "sweetnesssa",
      "created": 1607527218,
      "upvotes": 5,
      "replies": {
        "gf743x7": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf743x7/",
          "text": "Oh wow, I'm glad you mentioned fine arts because I'm actually thinking of maybe taking that degree instead of fashion design. How was it? Do you recommend studying it and getting a degree?\nI'm studying in the UK and credits don't necessarily apply here.",
          "author": "elizahmendoza",
          "created": 1607541193,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gf66x29": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf66x29/",
      "text": "One thing to consider is, is this your first semester? If so, know that this is NOT what college is typically like. It can be busy and still stressful, but you’re in a community that’s all in it together rather than just a bunch of boxes on your screen and working to finish (objectively more than normal) assignments. Talk to a councilor and they might recommend taking a gap semester if the online is too difficult to adjust to. It’s not for everyone and most people are struggling with it in one way or another",
      "author": "sloppytraveler99",
      "created": 1607525653,
      "upvotes": 3,
      "replies": {
        "gf74dez": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf74dez/",
          "text": "Yeah, its only been a couple of months and its already so stressful... I'm actually thinking about taking a gap year as well but we already paid for tuition so I don't know if that's still a good idea. What do you think?",
          "author": "elizahmendoza",
          "created": 1607541312,
          "upvotes": 1,
          "replies": {
            "gf7917u": {
              "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf7917u/",
              "text": "I would definitely talk to an academic councilor. At my school you can get a refund on tuition through like the first week of the semester, so you can likely get your money back for the spring if you paid already. If you take time off, that’s totally ok, just make it purposeful. It sounds like you have something going with your business. That might be a good use of your time right now until the pandemic settles down and you can focus on school when class is in person again. I know people that have taken time off though, only to go to a low paying service job like they had in high school and never return. There’s a lot that someone at your school can help with, just make an appointment with them and I’m sure they can answer all your questions. At the end of the day it’s up to you though",
              "author": "sloppytraveler99",
              "created": 1607543461,
              "upvotes": 1,
              "replies": {
                "gf9p62l": {
                  "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf9p62l/",
                  "text": "With the pandemic, it's going to be pretty complicated to use that as a reason to drop out because there's already a vaccine. \n\nFocusing on my business sounds like a good idea actually and that's all I've been thinking about but I don't have much time to work on it anymore because of fkn uni. I'm scared to drop out because when I wasn't in uni, I felt like i was being left behind and I felt stuck. But now that I am in uni, I feel so stressed out.\n\nI honestly don't know what to do but thank you so much for the good advice.",
                  "author": "elizahmendoza",
                  "created": 1607601010,
                  "upvotes": 1,
                  "replies": {
                    "gfac1cx": {
                      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gfac1cx/",
                      "text": "Just a couple last things, \n\nJust because there is a vaccine doesn’t mean the spring will be different. I’m still entirely online in the spring just because not enough people will get it in time for the semester. \n\nAlso, a gap semester is NOT dropping out. Again, just talk to an advisor and they can essentially defer you for a semester until the fall. You don’t need to have a big reason, some people do that just to work 40 hours a week at some basic job and get money to finish school. Others are just burnt out and need a break for a bit. Some people finish school quickly and others might take longer, that’s ok. It’s the degree in the end that matters, regardless of when you get it.",
                      "author": "sloppytraveler99",
                      "created": 1607613650,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gf606p2": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf606p2/",
      "text": "College shouldn’t be so stressful that it creates depression and suicidal thoughts. U should be excited to learn and even proud of ur failures and successes but the current culture around college is toxic! I personally hate it.",
      "author": "Hawkbiitt",
      "created": 1607521760,
      "upvotes": 5,
      "replies": {
        "gf73qdq": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf73qdq/",
          "text": "Exactly. And the fact that we pay so much just to be stressed like this doesn't make sense to me at all. I hate it so much.",
          "author": "elizahmendoza",
          "created": 1607541016,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gf5g510": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf5g510/",
      "text": "i’m so sorry you’re not having a good time in school. it pains me to see that your professors are so strict with deadlines and class work during a pandemic when all we have (for the most part) is online school. \n\ni hope you figure out what you want to do soon :)) in the meantime, i’m sending lots of hugs and positivity your way!",
      "author": "mr_smithers_o",
      "created": 1607503399,
      "upvotes": 3,
      "replies": {
        "gfslpxe": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gfslpxe/",
          "text": "Awww thank you so much :)",
          "author": "elizahmendoza",
          "created": 1607934224,
          "upvotes": 2,
          "replies": {
            "gfsmc1q": {
              "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gfsmc1q/",
              "text": "no problem :)) i don’t hear this enough so i figured i’d say what it to someone",
              "author": "mr_smithers_o",
              "created": 1607934834,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gf57q0f": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf57q0f/",
      "text": "I've wondered this since I started. People say \"college is the best years of your life.\" What are those people, fucking masochists? Even before covid it was nonstop studying and isolation. No time for hobbies or friends. Honestly, it will probably be the same when I'm done with college too. More than likely the problem is me.",
      "author": "WashiBurr",
      "created": 1607495798,
      "upvotes": 15,
      "replies": {
        "gf61on3": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf61on3/",
          "text": "i literally had to cancel on my friends so much and give up many of my hobbies because of my time being taken by studying its so stressful and i cant tell you the amount of times i sat and cried because i could be enjoying going out to the movies and dinners with friends and family but i have a test in 2 days and the professor doesnt explain much so i have to watch online tutorials and create an extensive study guides with whatever information i could find. i cant do hobbies because it takes too much time and i cant socialize cause it takes too much time its so  mentally draining",
          "author": "Noxythegreat",
          "created": 1607522676,
          "upvotes": 7,
          "replies": {
            "gf7rsxv": {
              "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf7rsxv/",
              "text": "Quit whining.",
              "author": "orangeblackteal",
              "created": 1607552382,
              "upvotes": -3,
              "replies": {}
            }
          }
        },
        "gf68tg5": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf68tg5/",
          "text": "I feel this way too. Online classes only made it worse and more isolating, like yeah I may not have seen my friends that much before Covid but at the least I didn't feel as alone because I was surrounded by my classmates and talked w them (i have smaller classes and have to talk to my peers often) or I'd at least be working in a library with a lot of people around. I barely even saw people walking around campus this year",
          "author": "strangelyahuman",
          "created": 1607526648,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gf52d4e": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf52d4e/",
      "text": "definitely feel free to be ungrateful. \n\ncollege, or at least some colleges, seem designed to elicit this sort of reaction, unless you're some sicko who enjoys working and dresses up for class and shit",
      "author": null,
      "created": 1607491679,
      "upvotes": -6,
      "replies": {
        "gf549pz": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf549pz/",
          "text": "Don’t know where to start with ur comment. Just wow",
          "author": "too105",
          "created": 1607493069,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gf50vh6": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf50vh6/",
      "text": "For the most part yes, especially since online learning :/",
      "author": "cbgbecca",
      "created": 1607490646,
      "upvotes": 3,
      "replies": {}
    },
    "gf50a0i": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf50a0i/",
      "text": "Yes and no. College has also made anxious, stressed, and depressed mostly due to the work load, the pressure of exams, high tuition, and how the education system is typically ran. Am I all those things mentioned above because of my major? Not really? I still enjoy what I’m learning and am curious about the field.\n\nYour case might be different. Is your major related at all to your small business idea? Have you gotten passed all the gen ed stuff you have no interest in? If not, try to push forward until you can take electives (based on your major) to see if you still like school. If the work load is to much then try being a part time student, that way you can balance school, social life, etc better.",
      "author": "DressingForTheWall",
      "created": 1607490247,
      "upvotes": 14,
      "replies": {}
    },
    "gf4zgas": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf4zgas/",
      "text": "im taking a few semesters off until covid blows over and i can take classes in person. in the meantime im planning on starting a swimwear line :) ur not alone in this",
      "author": "SnooPineapples706",
      "created": 1607489705,
      "upvotes": 9,
      "replies": {
        "gf73l6a": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf73l6a/",
          "text": "are you doing a fashion design degree too or is it just a passion of yours?",
          "author": "elizahmendoza",
          "created": 1607540948,
          "upvotes": 3,
          "replies": {
            "gfem1ba": {
              "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gfem1ba/",
              "text": "no just a passion of mine! i spend so much time addicted to my phone and social media and am plagued guilt about the opportunities i’m wasting. we spend our time glued to a piece of glass looking at brainless tiktoks but I could be using technology to expand my knowledge and teach myself anything i want. So, i’m teaching myself social media marketing and e-commerce and hopefully i’ll be starting a swimwear company through Instagram in the next few months! fuck college, for the first time in the history of humanity nearly everyone has access to the resources to literally teach yourself anything. so get started",
              "author": "SnooPineapples706",
              "created": 1607704723,
              "upvotes": 3,
              "replies": {
                "gfg1xac": {
                  "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gfg1xac/",
                  "text": "Omg that's amazing 👏 what am I doing getting a degree in fashion design then 🤦‍♀️ how did u teach yourself those things? Can you send me the links?",
                  "author": "elizahmendoza",
                  "created": 1607721891,
                  "upvotes": 3,
                  "replies": {
                    "gfizhkh": {
                      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gfizhkh/",
                      "text": "honestly i’ve just been using youtube and googling questions i have and just surfing around researching! googling things like social media marketing, how to sell stuff on instagram, instagram shops, pinterest marketing, blogging, etc. digitalnomadwannabe is a blog that teaches you everything about blogging and making money through blogs. which is fascinating by the way, tons of free resources on her site",
                      "author": "SnooPineapples706",
                      "created": 1607781782,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gf4k0jz": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf4k0jz/",
      "text": "i understand the feeling. college is one of the largest reasons why im depressed. its honestly so mentally and emotionally grueling for some of us, so i truly get it.\n\nbefore considering dropping out, i would go for more of a middle ground first. you could decide to take the semester or the year off. see how it suits you. if its what you want and you have a reasonable plan of action, you could simply transition from that gap into just dropping out completely. you can always go back to school, so there's truly no rush if you see a better route for yourself.\n\ni would also try to narrow down exactly what's causing you distress. is it your specific major? is it your specific college? is it the idea of a 4 year university? how's community college sound? trade school? this will not only help you make a more informed decision, but make a more confident decision.\n\nwhatever you decide, i wish you the best of luck. remember to take care of your mental health, whatever that means for you.\n\nedit: another possibility you could consider is becoming a part-time student rather than a full-time student, if thats an option your school gives you.",
      "author": "reflexivesound",
      "created": 1607480934,
      "upvotes": 81,
      "replies": {
        "gf5j6v2": {
          "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf5j6v2/",
          "text": "This is a great decision tree. I'll also add this- it's much easier to bear the difficulty of higher education if you're truly passionate about your major. The fact that you're questioning what you want out of college tells me that the light at the end of the tunnel may not be worth the heartache for you. There's no reason to put yourself through this if it's not going to get you where you want in life.\n\nBest of luck OP, we're here for you.",
          "author": "JustVibing458",
          "created": 1607506588,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "gf4aaiq": {
      "link": "/r/CollegeRant/comments/k9gsjl/is_college_supposed_to_be_this_stressful_and/gf4aaiq/",
      "text": "I’ve loved it more than anything until remote learning.",
      "author": "jeropian-fly",
      "created": 1607476055,
      "upvotes": 25,
      "replies": {}
    }
  },
  "updated": 1634062094
}