{
  "sid": "r8iw16",
  "link": "/r/CollegeRant/comments/r8iw16/computer_science_is_not_as_fun_as_i_thought_it/",
  "title:": "Computer science is not as fun as I thought it would be",
  "text": "Coding classes are obliterating my self-esteem. I don't know why I thought coding would be fun when I'm abysmal at math. I honestly didn't think I would struggle with it so much. \n\nI went to see my professor during office hours today for help with my homework and I can tell he thinks I'm a total dumb-dumb. It was really embarrassing and it made me think less of myself.\n\nI cannot wait until next week when I'm officially done with my coding classes and can just enjoy classes like \"Intro to Travel and Tourism\" next semester. That is, if I don't fail my Object-Oriented Programming Methods class. \n\nI don't considering coding fun AT ALL and having a career in it sounds miserable aside from the pay.  I didn't really enjoy my IT classes, either. I honestly don't even like my career field now. \n\nI hate being frustrated all the time and seeing everyone be better than me. It's embarrassing and I feel dumb. Should have chosen a different career path. I'm already a senior and scheduled to graduate in May so there's no turning back now.",
  "author": "unholymanserpent",
  "created": 1638597083,
  "updated": 1639518031,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hn6hto1": {
      "link": "/r/CollegeRant/comments/r8iw16/computer_science_is_not_as_fun_as_i_thought_it/hn6hto1/",
      "text": "Haha, yeah that’s how it be. Before I got really good, I suffered the similar. Programmers are complete assholes to people who are new. I don’t know why but, they are. So, don’t take it personally.\n\nSecondly. You really don’t have to be good at math. Basic algebra handles most stuff for you. Anything complex is usually linear math (graphics), calculus (physics) and data science. Anything else is practically handled for you somewhere else. \n\nThirdly, the trick to being good is to learn by doing what you want to do. Find a project that you want to complete / is cool and literally do it. Break the problem into steps and google each step. You’ll find out a few things. StackOverflow is the holy grail. GeeksForGeeks is a cheat code to life. Documentation is actually cool to read and, best of all, programming is fun. \n\nClasses are boring. Even I get bored of them. I just use whatever I learn and make something cool. And then, I nerd out on the small cool things I make because I have no friends. Yay\n\nSource: I’ve been coding for over a decade.",
      "author": "majoroofboys",
      "created": 1638612116,
      "upvotes": 7,
      "replies": {}
    },
    "hn5yvxs": {
      "link": "/r/CollegeRant/comments/r8iw16/computer_science_is_not_as_fun_as_i_thought_it/hn5yvxs/",
      "text": "What made you choose computer science? i remember on my first year of CS 60% or more did not even finish first semester, professors would be a pain on first semester to thin out the amount of students, and see who really wanted to be there",
      "author": "zeacu",
      "created": 1638597440,
      "upvotes": 1,
      "replies": {
        "hn62fwc": {
          "link": "/r/CollegeRant/comments/r8iw16/computer_science_is_not_as_fun_as_i_thought_it/hn62fwc/",
          "text": "I really don't even know. I didn't even know what a programming language was before choosing computer science. I just knew I liked computers and messing around with them. It was really dumb in retrospect. I had no idea what I was getting myself into. The only reason I haven't changed my major is because I don't like the feeling of being conquered by something and I really don't like the idea of giving up. So stubbornness basically.",
          "author": "unholymanserpent",
          "created": 1638599764,
          "upvotes": 2,
          "replies": {
            "hn7216k": {
              "link": "/r/CollegeRant/comments/r8iw16/computer_science_is_not_as_fun_as_i_thought_it/hn7216k/",
              "text": "Not sure how your college is, but some colleges will explore all aspects of computers, so you might end up finding something you love in one of those courses, it is also possible you not enjoying programming because you only had bad teachers, try looking at some online courses or websites that give you easy challenges to try tackle.\nBut most of all, if after a couple semesters you still not enjoying any of it, look for something else, life is too be short to suffer through something, and if you go to the end hating it, you might end up doing something you hate for the rest of your life",
              "author": "zeacu",
              "created": 1638626833,
              "upvotes": 2,
              "replies": {
                "hn7duyk": {
                  "link": "/r/CollegeRant/comments/r8iw16/computer_science_is_not_as_fun_as_i_thought_it/hn7duyk/",
                  "text": "Unfortunately I'm one semester away from graduation and I've completed all of my IT and CS classes except Computer Science Ethics, a 1 hour credit class. The rest of my classes are just electives I need to reach the 120 credits I need to graduate. So I've already taken a bunch of other classes relating to CS. For example, I'm wrapping up my Cybersecurity class right now and I found it pretty boring. It sucks. And being so close to graduation means finding a job very soon (something I should have already done). I don't know what to do. Maybe it depends on the type of job I get. I know I don't want to have to grind LeetCode for a programming job. So idk. Thanks for taking the time out to try to help me tho",
                  "author": "unholymanserpent",
                  "created": 1638632695,
                  "upvotes": 1,
                  "replies": {
                    "hn7ea7v": {
                      "link": "/r/CollegeRant/comments/r8iw16/computer_science_is_not_as_fun_as_i_thought_it/hn7ea7v/",
                      "text": "Look into QA area, it is an area good for people that like to identify issues with the systems, and to play around with computer, without having a heavy need to be a great developer, being able to understand the logic already get you in a good direction",
                      "author": "zeacu",
                      "created": 1638632893,
                      "upvotes": 1,
                      "replies": {
                        "hn7mpi5": {
                          "link": "/r/CollegeRant/comments/r8iw16/computer_science_is_not_as_fun_as_i_thought_it/hn7mpi5/",
                          "text": "Quality Assurance huh. Alright I'll look into it. Thanks for the advice",
                          "author": "unholymanserpent",
                          "created": 1638636584,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hn7p9wl": {
      "link": "/r/CollegeRant/comments/r8iw16/computer_science_is_not_as_fun_as_i_thought_it/hn7p9wl/",
      "text": "You’re not dumb you just chose the wrong major 😌 nothing else to do now besides pass ur last hard classes and then enjoy your reward of intro to travel and tourism. Ofc before you graduate you’ll want to find a job in your degree area that you think you’ll be least miserable in and start interning. Either that or find out about some grad school option that’s vaguely related and will let you switch up your field.",
      "author": "airbear13",
      "created": 1638637636,
      "upvotes": 1,
      "replies": {}
    }
  }
}