{
  "sid": "pvinn0",
  "link": "/r/CollegeRant/comments/pvinn0/one_week_in_and_ive_already_had_my_first_college/",
  "title:": "One week in and I've already had my first college breakdown",
  "text": "So my precalc professor had assigned 7 different 20 question homework assignments to us all due by Monday and I was feeling really overwhelmed. They're not difficult, they seem to be upper high school level, but doing 140 questions in two days doesn't seem very appealing to me. I was planning to drop the class, especially since I have some undiagnosed mental health problems (can't get a therapist at the moment so I have to live with it for a few months), but I accidentally slipped it to my dad and now he's telling me I'm just bad at planning stuff and time management, and got into a brief argument about dropping the class for a new professor until I just shut up and left.\n\nI fucking missed both of my first assignments for math and English (math because there were 7 total papers to do front and back, English because I was so focused on math and work and not fucking up my mental health that I forgot the assignment even existed) and that argument just pushed it to the last straw. I know I should email my English professor about missing assignment, I know I should email my math teacher to see what to do about it, but I just want to cry right now.\n\nFor context I'm a freshman, this is my first quarter. People dropped the class before, but for some reason I'm still not sure if it's just me being undisciplined or if this actually is too much work for me",
  "author": "Monthly_Vent",
  "created": 1632614884,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 1.0,
  "comments": {
    "hec3bnu": {
      "link": "/r/CollegeRant/comments/pvinn0/one_week_in_and_ive_already_had_my_first_college/hec3bnu/",
      "text": "Email your professors. The biggest mistake students make is missing the first assignment, feeling shame, getting themselves into a spiral of unfinished work, failing to drop courses when there is still time to do so, and then going to professors at the end of the term to see what can be done. Talk to them now, and discuss how to get back on track. One thing to keep in mind: sometimes dropping a course IS good time management, if it means being able to complete all your other courses successfully. College is a marathon, not a sprint, so figure out how many courses you can successfully manage and get the grades you want in, and base your term on that. Too many students overload themselves.",
      "author": "Felixir-the-Cat",
      "created": 1632656572,
      "upvotes": 3,
      "replies": {
        "hedyqyj": {
          "link": "/r/CollegeRant/comments/pvinn0/one_week_in_and_ive_already_had_my_first_college/hedyqyj/",
          "text": "Wait this is common? Huh. I stayed up hours at night because I was extremely anxious about sending a stupid email, then having to cope with the anxiety, then going back and getting anxious about emailing again. Couldn't find the guy's syllabus which made it even harder cause \"what if he doesn't accept late work? I forgot what he said about late work during the zoom meeting oh gawd I'm going to embarrass myself\". Luckily he reached out to me first, but still, thank you for telling me that. I don't know why, but it makes me feel better to know professors probably dealt with this situation before, and that I'm not a special case they're going to remember. \n\nAlso thank you for saying college is a marathon, not a sprint. And yeah, it's my first year here, so I'm really confused if something's too much workload or I'm just being a bitch about it. Cheesed my way through the last three years of high school, plus the mental health problems means I know I'm pretty undisciplined and I'm working on trying to do better (have a habit app and all that, which somehow I haven't run into any issues with as long as I'm flexible with myself. Also trying to use psychological tricks to help me get into the \"zone\" and all), so getting into a bad start with work overload from one class and missing an assignment from the other felt awful. I'm still really confused if this is a me problem and I just have to suck it up and deal with the workload, or if it's better for me to find a class more compatible with the rest of the things in my life and my dad just didn't trust me again",
          "author": "Monthly_Vent",
          "created": 1632686600,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "heaebko": {
      "link": "/r/CollegeRant/comments/pvinn0/one_week_in_and_ive_already_had_my_first_college/heaebko/",
      "text": "Check if your campus has a disability center. They can make accommodations for students with mental illness. You are not required to tell your professor about your health problems so don't feel inclined to do so. Try tutoring centers as well, maybe even finding a friend to help out. Trust in your abilities and you'll succeed. You made it this far.",
      "author": "Difficult-Can-1812",
      "created": 1632617631,
      "upvotes": 4,
      "replies": {
        "heaiotq": {
          "link": "/r/CollegeRant/comments/pvinn0/one_week_in_and_ive_already_had_my_first_college/heaiotq/",
          "text": "Probably should have said in my post I don't have a diagnosis. My parents don't believe in therapy and I still live with them, not to mention I can't drive or get a job (the work is some long-term volunteering thing. If we get enough money raised we can get paid but for now I'm unpaid) so I'm pretty much somewhat dependent on them to be unable to get one until I can at least drive by myself. For now, I just know I have problems with sleep and emotions\n\nAnd like I said, I'm able to do the work. It's high school level right now. I've done it before and I can do it again. Worse comes to worst I can just photomath what I don't understand, or ask the precalc discord I was invited to. Just.. 140 problems in two days seems like way too much right now, but I'm not sure if this is the standard and I'm overreacting or if it's actually a lot (in which case the class isn't up for me)",
          "author": "Monthly_Vent",
          "created": 1632619742,
          "upvotes": 3,
          "replies": {
            "heav7ld": {
              "link": "/r/CollegeRant/comments/pvinn0/one_week_in_and_ive_already_had_my_first_college/heav7ld/",
              "text": "You don't have to go to therapy.\n\nJust schedule a visit with your family doctor. If your parents ask why, tell them you suspect you have a health issue (the details of which are none of their business). Tell your family doctor you suspect a mental health issue and would like a doctor's note to send to the school. You might also inquire about going on medication.\n\nFor your sake, keep Mom & Dad out of the doctor's exam room. Keep the details you divulge to a minimum. All they need to know is that you have a health issue for which you are seeing the doctor and taking medicine. *MAYBE* tell them the name and dosage of the drug so they can relay that information in the event that you need to be rushed to the ER and are unable to speak.",
              "author": "Comprehensive-Ad3963",
              "created": 1632625868,
              "upvotes": 3,
              "replies": {
                "hedwa6y": {
                  "link": "/r/CollegeRant/comments/pvinn0/one_week_in_and_ive_already_had_my_first_college/hedwa6y/",
                  "text": "Sorry for the late reply but thank you. I didn't know you can get a mental health diagnosis from a family doctor. That changes things, although I'm still thinking about how to get a ride (I'm playing with the idea of having a friend or acquaintance drive and pretending like we're hanging out, but I can also ask my mom about an overdue checkup when she comes back) and paying for it if there's more than one trip, since I don't know if insurance can reveal information about a diagnosis or not (I know they're definitely going to tell my parents if I ask for medication)\n\nAnd for telling my parents, I'd rather they know little to none. I'm sort of hesitant if revealing everything means I need to schedule multiple appointments, since one, I don't have the money saved up for multiple appointments (and I'd rather not rely on my parents if they're so adamant on me not getting any mental health support), and two, if my parents find out they'll probably be crying their tears out scared since they tend to catastrophize health issues, and having multiple appointments is going to justify that I'm on the road to getting cancer or something. Best case scenario is to go to the doctor secretly, get a diagnosis, pay from pocket, and leave.\n\nBut again, thank you, this at least helped me see that I can do this right now instead of waiting until I got an actual job to start",
                  "author": "Monthly_Vent",
                  "created": 1632685616,
                  "upvotes": 1,
                  "replies": {
                    "hee6quh": {
                      "link": "/r/CollegeRant/comments/pvinn0/one_week_in_and_ive_already_had_my_first_college/hee6quh/",
                      "text": "Contact your health insurance company and ask them to keep as much information secret as they can.\n\nYour personal medical information is protected by the Health Insurance Portability and Accountability Act. Absent your explicit consent: Your doctor's office, pharmacy, and therapist are all prohibited from disclosing, to any third party, any medical information the third party does not need to know.\n\nYour insurance company can disclose the services you are receiving to the policyholder, though, so - again - be sure to tell them you don't want them to disclose any medical information.\n\nAlso, get your own insurance plan ASAP for total privacy.",
                      "author": "Comprehensive-Ad3963",
                      "created": 1632689891,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "hee7c4e": {
                      "link": "/r/CollegeRant/comments/pvinn0/one_week_in_and_ive_already_had_my_first_college/hee7c4e/",
                      "text": "Again, just tell your parents you suspect/have an ongoing medical issue. If the parents ask for any details beyond the fact that you are seeing a doctor and are on medication, tell them \"I'd rather not talk about it/That's none of your business.\"\n\nYou don't even need to lie about what you're doing. Just say \"I think I have a health issue of some sort.\"",
                      "author": "Comprehensive-Ad3963",
                      "created": 1632690146,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hexq8jo": {
      "link": "/r/CollegeRant/comments/pvinn0/one_week_in_and_ive_already_had_my_first_college/hexq8jo/",
      "text": "That amount of homework for any math class just sounds insane. I definitely feel you on that one. Currently in Calc 2 and it feels like the stress is never ending.",
      "author": "redit01101101",
      "created": 1633060317,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634063383
}