{
  "sid": "mcnq7z",
  "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/",
  "title:": "I just wanna take a class I'm interested in",
  "text": "It's not a part of my degree sure, but classes like pottery or costume construction seem interesting to me, abd it gives me a chance to learn skills and knowledge I may be able to use again. So why am I shut down every time I express interest in them, when I'm the one paying for them? So far my college experience has been rough, and I just wanna explore my interests more and find things I enjoy doing.",
  "author": "chef-wifey",
  "created": 1616639550,
  "over_18": false,
  "upvotes": 183,
  "upvote_ratio": 0.99,
  "comments": {
    "gs6q42r": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs6q42r/",
      "text": "My parents are supporting and helping me with college, even with helping me with tuition costs, and I talked with one of them about something like this. \n\nThere was a class I signed up for that interested me. They didn’t want me to take it and I took it off of my list of courses before the drop rule went into place for this semester. They want me to stay on track. \n\nI understand that my parents want the best for me and I’m fortunate that they’re even supporting me. However, I’m only taking my basics and have not clue in what I even want to major in. If I was able to take classes that didn’t involve the plan I’m on, I feel like I would be able to explore some things I might enjoy and potentially help find something to major in, or at least get an idea.",
      "author": "Best_Bisexual",
      "created": 1616689194,
      "upvotes": 1,
      "replies": {}
    },
    "gs6jg96": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs6jg96/",
      "text": "It's always a great idea to take interesting classes like these! I took an a music class even tho I'm a science major and I don't regret it. Definitely take a class you like and chill with!",
      "author": null,
      "created": 1616686484,
      "upvotes": 3,
      "replies": {}
    },
    "gs6hv2u": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs6hv2u/",
      "text": "Don't take unnecessary classes in college. If you don't need to take it then don't take it. It is better to explore your interests on your own time outside of college. That way you are not paying a 1000+ dollars for some stupid class like gender studies. Youtube is a great learning tool.",
      "author": "Rich-Cryptographer-7",
      "created": 1616685868,
      "upvotes": -4,
      "replies": {}
    },
    "gs6dbd8": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs6dbd8/",
      "text": "Wtf? Trust your parents and take some useful classes. They know better than you. In hindsight you will think about this differently.",
      "author": "Strudelfick",
      "created": 1616683985,
      "upvotes": -6,
      "replies": {}
    },
    "gs67ykp": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs67ykp/",
      "text": "Who’s shutting you down?",
      "author": null,
      "created": 1616681650,
      "upvotes": 1,
      "replies": {}
    },
    "gs6342l": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs6342l/",
      "text": "Dude you’re probably going to need to take electives anyway to get your total credits to graduate. Take what ever you want, your paying for it, why should your parents care, plus your parents don’t need to know your schedule just sign up for it and enjoy your time",
      "author": "imarabianaff",
      "created": 1616679412,
      "upvotes": 5,
      "replies": {}
    },
    "gs5yyg8": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs5yyg8/",
      "text": "Shut down? Go online and sign up for the class. You don’t need permission right?",
      "author": "thnx4thememeories",
      "created": 1616677318,
      "upvotes": 1,
      "replies": {}
    },
    "gs5xqk4": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs5xqk4/",
      "text": "As a parent, I would freak out if my kid took pottery classes in college. Look around for cheaper alternatives in other venues.",
      "author": "ThatProfessor3301",
      "created": 1616676673,
      "upvotes": -1,
      "replies": {}
    },
    "gs5wpnr": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs5wpnr/",
      "text": "College should be a time to take anything that interests you.\n\nIn high school, I had this career project where i had to interview someone in the career i wanted. (At the time i wanted to be a writer but I dont anymore). When I asked her a question of what kind of classes should I take in college to be in her career, she said to take anything I want to learn about or have an interest in. For writers, it's good to have a lot of knowledge on different subjects and that can give you inspiration for what you may want to write about. \n\nThat story may be for a writing career, but I feel it can apply to any field or anyone who just wants to learn stuff. Knowledge is power, so why not obtain knowledge in a wide variety of fields? I've taken electives in a bunch of different fields because I wanted to get a taste of what they were like. Criminology, psychology, women gender studies, philosophy, intercultural communication, etc. I feel like I'm a more rounded person because of it.",
      "author": "k8wolfx",
      "created": 1616676111,
      "upvotes": 5,
      "replies": {}
    },
    "gs585ls": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs585ls/",
      "text": "If youre the one paying, then take the classes. Sounds like youre shutting yourself down.",
      "author": "OsculatingPlanes",
      "created": 1616655746,
      "upvotes": 4,
      "replies": {}
    },
    "gs54e8p": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs54e8p/",
      "text": "You’re not alone! I’m a biology major and pre-PT but I’ve also taken classes in music business, art, history, foreign languages, etc. I’ve had multiple advisors and most basically tell me I’m wasting my time but I don’t like being pushed into one subject. Yeah my career goals and strongest interests are my major but that doesn’t mean I don’t have a dozen other interests too. If you’re willing to pay for it go for it!!",
      "author": "PuzzleheadedEar1107",
      "created": 1616652438,
      "upvotes": 10,
      "replies": {}
    },
    "gs4maik": {
      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs4maik/",
      "text": "Who is shutting you down? Your college? The counselor or your parents?",
      "author": "dogandcats424242",
      "created": 1616640319,
      "upvotes": 45,
      "replies": {
        "gs4mhn2": {
          "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs4mhn2/",
          "text": "My parents. I haven't talked with my counselors because of everything, but I just feel like they want me to stay on track even though I'd be taking these classes on top of classes for my degree",
          "author": "chef-wifey",
          "created": 1616640428,
          "upvotes": 45,
          "replies": {
            "gs4n5id": {
              "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs4n5id/",
              "text": "I see what you mean. My advice is you could just sign up for the elective classes you want, take them credit/no credit (or p/np) and tell your parents the elective is required by your school for personal enrichment. (Some schools do actually require enrichment electives.) I’m a STEM major and I also try to take some kind of personal interest elective every semester that has nothing to do with my degree, as my fun class, (last semester it was playwriting, this semester it’s bio anthropology, next semester it’ll be an art class). Otherwise the semesters do get very rough.",
              "author": "dogandcats424242",
              "created": 1616640796,
              "upvotes": 41,
              "replies": {}
            },
            "gs4nrzx": {
              "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs4nrzx/",
              "text": "So take the class then. You're an adult now, you don't have to do everything your parents tell you to do anymore.",
              "author": "BarackTrudeau",
              "created": 1616641147,
              "upvotes": 29,
              "replies": {
                "gs4to60": {
                  "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs4to60/",
                  "text": "I remember my freshmen year I was crying to my therapist about failing a class and being scared of telling my parents, and feeling like an idiot.\nMy thereapist was like “W-why do you need to tell them?” And yeah, they don’t pay for my classes I don’t need to let them know every class I take or every grade I get.",
                  "author": "Bojyo",
                  "created": 1616644633,
                  "upvotes": 28,
                  "replies": {
                    "gs7gnml": {
                      "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs7gnml/",
                      "text": "Exactly. You don’t need to tell your parents everything that’s happening in your school if you’re paying for it. You don’t even need to tell them anything if it’s giving you anxiety.",
                      "author": "slopcrusher",
                      "created": 1616700014,
                      "upvotes": 1,
                      "replies": {
                        "gs8bq5k": {
                          "link": "/r/CollegeRant/comments/mcnq7z/i_just_wanna_take_a_class_im_interested_in/gs8bq5k/",
                          "text": "Honestly even if they’re paying for it you don’t need to tell them. Personally if my parents ask how class is going I just shrug my shoulders and say “eh it’s going.” \n\nAlso, heads up to anybody that might not know. Your parents aren’t allowed to access your grades or student account.",
                          "author": "Bojyo",
                          "created": 1616714098,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634063543
}