{
  "sid": "qvubgs",
  "link": "/r/CollegeRant/comments/qvubgs/fuck_it_im_just_going_to_give_up/",
  "title:": "Fuck it, I’m just going to give up",
  "text": "Not academically, but socially. I don’t think I’ve ever tried harder in my life to try to find something socially, but I either fuck it up, no traction is gained, or something else happens and I’m never able to join a group of friends. Fuck it, I’m giving up. I tried damn hard to claw myself out of a very low period, and yet I failed, I feel myself sinking again, and I’m still alone. I literally see people make best friends in like 2 weeks and in the 12 weeks I’ve been here I still have fucking no one, and I’m almost sure people hate me or think I’m stand off-ish. I just don’t even know what to do, and quite frankly I’ve pushed so much I just fucking give up. This is probably a sign to just focus on myself because I don’t know what the fuck I’m supposed to do anymore.",
  "author": "oompaloompa543",
  "created": 1637135989,
  "updated": 1639869516,
  "over_18": false,
  "upvotes": 19,
  "upvote_ratio": 0.92,
  "comments": {
    "hkz9644": {
      "link": "/r/CollegeRant/comments/qvubgs/fuck_it_im_just_going_to_give_up/hkz9644/",
      "text": "Yeah, I've come to the same point. I've realized some people just are not social butterflies and decided to do my own shit. If I meet people cool, if not then whatever.",
      "author": "TheDiscoJew",
      "created": 1637151224,
      "upvotes": 7,
      "replies": {
        "hl03w0s": {
          "link": "/r/CollegeRant/comments/qvubgs/fuck_it_im_just_going_to_give_up/hl03w0s/",
          "text": "Yea you’re right but like I kinda hoped to find a dependable group of people and all that jazz",
          "author": "oompaloompa543",
          "created": 1637165865,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkzedql": {
      "link": "/r/CollegeRant/comments/qvubgs/fuck_it_im_just_going_to_give_up/hkzedql/",
      "text": "Well, that’s cool. You figured out what you don’t have. How about appreciating what you do have?\n\nSource: Me too.",
      "author": "majoroofboys",
      "created": 1637154326,
      "upvotes": 2,
      "replies": {
        "hl03sb8": {
          "link": "/r/CollegeRant/comments/qvubgs/fuck_it_im_just_going_to_give_up/hl03sb8/",
          "text": "Because it sucks to have no one, like at all. I’m sick of being alone but all my efforts seem to be in vain. I guess you’re right though, but it still would be nice to have someone to talk to",
          "author": "oompaloompa543",
          "created": 1637165825,
          "upvotes": 1,
          "replies": {
            "hl1bf4c": {
              "link": "/r/CollegeRant/comments/qvubgs/fuck_it_im_just_going_to_give_up/hl1bf4c/",
              "text": "I’ve been doing random stuff and learned a bunch of skills due to my absence of friends. I think that you never want to be dependent and simply put, you have to work with what you have. It sucks not having anyone to talk to but, at the same time.. no one is stopping you from being the best version of yourself. You have absolutely no one judging you. Be you.",
              "author": "majoroofboys",
              "created": 1637183051,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hl1l5ri": {
      "link": "/r/CollegeRant/comments/qvubgs/fuck_it_im_just_going_to_give_up/hl1l5ri/",
      "text": "I’m not gonna try and give you cheesy advice like join a club or approach people or some shit because I hate hearing it too. All I’m gonna say is that what you’re feeling is completely valid and it is okay for you to give up and sink in these feelings. A lot of people feel the same way and it is comforting to vent and know that you’re not alone. It’s a rough life out there. Time stands still when it comes to making any progress on our desires and we all get stubborn. It’s a big part of becoming an adult. That’s at least what I’ve realized in my time of overthinking my feelings so being self-aware has made me feel a bit better knowing it is okay for me to have these feelings, and it makes me appreciate little positive things that happen to me (socially, personally, etc.) much more",
      "author": "escapefromreality42",
      "created": 1637187049,
      "upvotes": 3,
      "replies": {}
    },
    "hlll763": {
      "link": "/r/CollegeRant/comments/qvubgs/fuck_it_im_just_going_to_give_up/hlll763/",
      "text": "Have you thought about joining religion, a cult, a martial arts gym, a band or becoming some form of enthusiast that goes to enthusiast meetings?",
      "author": "DizzyMajor5",
      "created": 1637553764,
      "upvotes": 1,
      "replies": {}
    }
  }
}