{
  "sid": "hhj0dc",
  "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/",
  "title:": "I hate Freud. I really, really HATE him.",
  "text": "I understand he's the basic of all psychology, but why can't we just learn everything about him ONCE during the Introduction and than NOT put him in tests every single psychology-related course you take after? No, just  because I have to learn about him over and over and over again doesn't mean I'm gonna memorize all the shit he came up with.\n\nErikson was more throughout in extending Freud's' theories. Erikson is *interesting*. Can't we just be like \"Yeah Freud invented this and that, but Erikson can teach you both his Theory and include more updated steps\"? Can't we  just skip to learning Erikson's theory from the very beginning and shove Freud aside?\n\nIt's the sex thing, isn't it. Freud was all about sex so the academic world holds him in a such a high regard because our professors are a bunch of dirty old f\\*\\*\\*\\* (it's a joke, obviously. I'm just bitter because I've had to learn about that jackass for three years straight in three different classes. You know how you read the same material over and over again but instead of memorizing it it just get so boring you can't read in anymore and just keep skimming through?)",
  "author": null,
  "created": 1593367146,
  "over_18": false,
  "upvotes": 66,
  "upvote_ratio": 0.95,
  "comments": {
    "g3g6nif": {
      "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/g3g6nif/",
      "text": "I’m way more into Jung’s ideas than Freud’s. And more into Victor Frankl’s too\n\nHowever, my dislike for Freud and desire for him to be less well-known is partially because he makes my major look bad, and that’s not fair to him because he clearly did contribute to the field and it’d be mean to “deny” him. If I were Freud I’d be really hurt, I guess.\n\nI’m also tired of how much he’s mentioned, though.",
      "author": "strawberrysweetpea",
      "created": 1598865460,
      "upvotes": 2,
      "replies": {}
    },
    "fx20xzp": {
      "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/fx20xzp/",
      "text": "Carl Jung changed freuds theories and made them significantly more logical.",
      "author": "deathworld123",
      "created": 1593998922,
      "upvotes": 2,
      "replies": {}
    },
    "fws3fnx": {
      "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/fws3fnx/",
      "text": "I can relate so bad. Hearing about him in AP Psychology, again in Human Development, and then I’ll hear about him again when I need to take two more Psychology courses sounds like a headache. His theories are so fucking gross too lmao even with a better understanding of them, I’d rather hear Piaget’s or Erikson’s OR ANYONE ELSES theories of development and anything else.",
      "author": "NotNinjachicz",
      "created": 1593756587,
      "upvotes": 2,
      "replies": {}
    },
    "fwdp5s0": {
      "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/fwdp5s0/",
      "text": "Freus is completely over rated",
      "author": "Wanderlust_and_Love",
      "created": 1593448047,
      "upvotes": 2,
      "replies": {}
    },
    "fwbnqw5": {
      "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/fwbnqw5/",
      "text": "I understand where you’re coming from, I’ve loved psychology for the last couple of years but since college, I’ve found it to be quite dry (sociology major). Besides that, I don’t love Freud but I don’t exactly like him either. I think most psych classes talk about him bc he’s a ‘founding father’ of psychology and brought up things no one else did. I agree with his beliefs on a surface level, but nowadays it’s very eccentric. \n   I think Freud is a good building block for many psychologists, like Jung for example. They take what he started with and simply improve/revamp it in their own way. Personally I really like Jung, but I can see why you don’t like Freud. Things like the Oedipus complex make me uncomfortable, but I like that I can apply that to other subjects (like English). Idk, basically it’s fucked up but take the parts of it I like and move along. I believe that you don’t have to completely side with one psychologist/sociologist/whoever, but taking bits and pieces from people gives you a more rounded perspective.",
      "author": "popcorn314",
      "created": 1593393747,
      "upvotes": 2,
      "replies": {
        "g3g6xen": {
          "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/g3g6xen/",
          "text": "I feel like psychology is just turning into neuroscience now, and I’m not a fan of reductionism. I had the realization sociology might be a better fit for me in terms of interest, but I wouldn’t be able to become a therapist (which makes sense). 🙁",
          "author": "strawberrysweetpea",
          "created": 1598865770,
          "upvotes": 2,
          "replies": {
            "g3rc11m": {
              "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/g3rc11m/",
              "text": "I’m a sociology major! It’s great honestly. I planned on being a psych major for a long time but changed my mind senior year of high school. And what makes you say you can’t be a therapist?",
              "author": "popcorn314",
              "created": 1599075549,
              "upvotes": 1,
              "replies": {
                "g3sfy9i": {
                  "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/g3sfy9i/",
                  "text": "I looked up career opportunities for sociology degrees after grad school (bc I’m psyc. undergrad right now but I am going to go to grad school for psychology most likely). There was no mention of therapist or even counselor. : ( Otherwise I’m almost for sure I’d do a graduate program in it and study relationships (namely marriage).",
                  "author": "strawberrysweetpea",
                  "created": 1599092465,
                  "upvotes": 1,
                  "replies": {
                    "g3ze89t": {
                      "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/g3ze89t/",
                      "text": "You can be a therapist/counselor with a sociology background for sure! I think with a psych background, you’d more likely go to grad school for that, but you can go on that path coming from socio or psych. The 2 both correlate a lot",
                      "author": "popcorn314",
                      "created": 1599227158,
                      "upvotes": 2,
                      "replies": {
                        "g3zfes2": {
                          "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/g3zfes2/",
                          "text": "I didn’t know that! Thanks 🤗",
                          "author": "strawberrysweetpea",
                          "created": 1599227586,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fwaugel": {
      "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/fwaugel/",
      "text": "THANK YOU!!! In undergrad, I took a minor in psychology and every single class, whether it was at the first-year level or fourth-year, HAD to have a section where they introduced Freud, when he was born, the years where he did his shit. I’m not against Freud but I was absolutely SICK of having to learn the same crap over and over again. The worst was the dates. In 1920 he did X, in 1921 he did Y. It’s tedious.",
      "author": "a-streetcar-desire",
      "created": 1593377353,
      "upvotes": 7,
      "replies": {}
    },
    "fwalfns": {
      "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/fwalfns/",
      "text": "I can so relate w the last paragraph man I don't know anything about psychology but my college here in India has triple degree things and I've learnt the same fkn carbohydrates module in all three subjects I want to fucking cry I AM DONE AKDNKANAH",
      "author": "mekhhhzz",
      "created": 1593372666,
      "upvotes": 4,
      "replies": {}
    },
    "fwaka25": {
      "link": "/r/CollegeRant/comments/hhj0dc/i_hate_freud_i_really_really_hate_him/fwaka25/",
      "text": "Freud was a bastard and despite every intro psych class claiming otherwise he was not the first person to propose the “unconscious” theory. \nIf I had a time machine I would go back and kick the shit out of him. Right after pavlov. I have a lot of feelings about Freud lol.",
      "author": "SheriffSpooky",
      "created": 1593372038,
      "upvotes": 27,
      "replies": {}
    }
  },
  "updated": 1634063379
}