{
  "sid": "qy08w9",
  "link": "/r/CollegeRant/comments/qy08w9/should_i_take_a_semester_off/",
  "title:": "Should I take a semester off?",
  "text": "I’m at a point in my life where I have absolutely no clue what I’m going to do with it :). As y’all probably know, it’s time to start registering for next semester but I don’t even know what my major I want to commit to. As of now I’m majoring in Accountancy, but I don’t know if that’s what I want to do with my life (and honestly I think I kinda suck at it lmao). Im going to school on financial aid and don’t want to waste it on classes that might not even follow through on. Then again, if I were to take a semester off I don’t know what I’d do in that time. Any advice would be greatly appreciated. 😮‍💨\n\n— Sincerely, a fellow stressed out undergrad\n\nTL;DR - Should I take a semester off since I don’t know what the heck to do with my life? If yes, what should I do in that time?",
  "author": "ArleneHeere",
  "created": 1637392334,
  "updated": 1637689671,
  "over_18": false,
  "upvotes": 40,
  "upvote_ratio": 1.0,
  "comments": {
    "hldc1k5": {
      "link": "/r/CollegeRant/comments/qy08w9/should_i_take_a_semester_off/hldc1k5/",
      "text": "Disclaimer: I'm a dumb 3rd year talking out of my ass.\n\nProbably depends on your year, level of burnout, life commitments, etc. Definitely been in a similar position (though I do Trimesters, so it's not as big of a deal to take a lighter term) and have tried both ways. Taking a deep breath and chugging through sucks ass, usually pushing you into spooky territories of mental health if it's arduous enough and you don't have a proper support system (usually just means you might start acting more rashly than normal, might snap and do somthing stupid once or twice). But it seems like the alternative, taking a term (or full semester in your case) off, honestly does put you way behind and bites you in the ass. \n\nMight want to talk to your advisor, or to a professor that you know has experience in industry, and they can help you either direct your major in a better direction, or figure out a good alternative. \n\nAnother thing to consider is that, depending on where you go after school, I've been given the impression that you might have some freedom to direct projects if you communicate properly with supervisors. If there's something you really enjoy (and if not, you could try poking around, see what seems appealing), and you think it could be applicable to your work, it's a good opportunity to both make things less soul crushing and show off your skillset. Big picture is that even if your school work itself isn't as appealing as you'd like, you can sorta make it work in the real world by deliberately pushing things more into territory you're into. This might not apply to every position, it's just what I've experienced personally over a few internships, again emphasizing good communication with the higher ups.",
      "author": "ISwearToFuckingJesus",
      "created": 1637402302,
      "upvotes": 10,
      "replies": {}
    },
    "hldzndz": {
      "link": "/r/CollegeRant/comments/qy08w9/should_i_take_a_semester_off/hldzndz/",
      "text": "if you have to ask then yes. yes yes yes\n\ncollege is not a race\n\nwhen i took time off i worked in restaurants. it was a nice change of pace because it was completely the opposite of school. gave me time to think",
      "author": "spacewalk__",
      "created": 1637418818,
      "upvotes": 6,
      "replies": {}
    },
    "hledxbf": {
      "link": "/r/CollegeRant/comments/qy08w9/should_i_take_a_semester_off/hledxbf/",
      "text": "Do you have any scholarships that you may lose by taking a semester off?\nAlso, I've never personally met someone who took a semester off and then actually went back to school. I'm not saying they don't exist or that you can't, but it seems the vast majority of people who take a semester off never finish their degree. Maybe that's not the case for you, but it's incredibly common where I'm from. That's also something to consider. \n\nUltimately you have to decide for yourself. There are pros and cons each way. \n\nI don't plan on taking a semester off, because I'll lose my scholarship, and if I'm being real with myself, I'd probably never go back.",
      "author": "Panashda",
      "created": 1637425366,
      "upvotes": 1,
      "replies": {}
    }
  }
}