{
  "sid": "nkb2xo",
  "link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/",
  "title:": "WTF even is college?",
  "text": "So the semester wrapped up last week and good lord, I'm over this shit. I just finished sophomore year  and every time I think about school, I don't really think positively about it. Either I'm just a bum or the CS department has killed any and all interest in coding for me, I'm doing a major I don't even like (nor will I use after graduation bc I'm a product designer), and I just miss my fucking friends for Christ sake. My immigrant parents also don't understand any of my issues bc \"education is key\" or whatever (pulled a 3.58 this semester, not great but not \\*bad\\* either). \n\nCan someone explain to me what college is for? They say learning but I'm not doing that, my school doesn't have an HCI major so I'm just chasing a stupid GPA for my parents. They say growing but I'm stuck in my childhood home. I really turned down a $70k job offer for this shit, kill me now.",
  "author": "neptunestrident11",
  "created": 1621897840,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.88,
  "comments": {
    "gzo9bc8": {
      "link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzo9bc8/",
      "text": "College has become strictly a credentialing service.",
      "author": "arkonix1000",
      "created": 1622144095,
      "upvotes": 5,
      "replies": {}
    },
    "gzeads0": {
      "link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzeads0/",
      "text": "I'd never decline a 70k job offer to go to college instead. college is a waste. you pay for a degree so employers consider you. ur parents are stupid shits. most of what you learn in college is easily accesible online, just need self-discpline.",
      "author": "jhf6782",
      "created": 1621953822,
      "upvotes": 10,
      "replies": {
        "gzgbh09": {
          "link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzgbh09/",
          "text": "A degree is to filter out non degrees because I guess they generally assume non degrees are harder to work with. If someone had to follow instructions for 4 years the employers rather want that over anything less. \n\nI heard from accounting recruiters that they just straight up train accounting majors because each companies' system is different. But they say the core fundamentals are important so that makes sense.\n\nI'm guessing self discipline online learning is what separates the dedicated vs the casual student. \n\nI wouldn't say op's parents or anyone's parents are stupid shits. They were born and raised in a much different world, environment than teens today in this technology computer era. They probably heard through word of mouth how graduates earn more so they take that as a new way of life.",
          "author": "executordestroyer",
          "created": 1621986552,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gzdiiww": {
      "link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzdiiww/",
      "text": "> Can someone explain to me what college is for? \n\n\ngetting you into debt so you'll become a slave to the system.",
      "author": "ObjectiveAnalysis643",
      "created": 1621937299,
      "upvotes": 14,
      "replies": {
        "gzdu3lq": {
          "link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzdu3lq/",
          "text": "Beat me to it. This. This right here",
          "author": "majoroofboys",
          "created": 1621945669,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gzcjkpa": {
      "link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzcjkpa/",
      "text": "What was the job offer for?",
      "author": "jatea",
      "created": 1621910486,
      "upvotes": 3,
      "replies": {
        "gzcq1lr": {
          "link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzcq1lr/",
          "text": "product designer! I got a short contract during winter break but they wanted to keep me for the year as full-time",
          "author": "neptunestrident11",
          "created": 1621914197,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064413
}