{
  "sid": "omtxmg",
  "link": "/r/CollegeRant/comments/omtxmg/i_just_wanted_one_day/",
  "title:": "I just wanted one day",
  "text": "One day to sleep in. Not even one day to relax because I have to finish medical school applications. But after the chaos that was last year, on top of graduating a year early and having to take biochem, ochem, and physics the same semester- on top of working a full time job after studying several months for the mcat and working for the university to get my dorm paid for - I asked my parents last night to let me sleep in for 1 day. And you know what they do? Come into my room at 10:30 and wake me up. 10:30 is sleeping in to me after having gotten up at 7-8:40 for my job the past 2 months but I’m beyond pissed that I asked them to let me sleep in and they blatantly ignored me. I told my dad off for waking me up and you know what? I’m not even sorry. He comes home from his full time job and watches TV every single day while my mom cleans the house and I apply to med school. And I can’t sleep in past 10:30? I’m so irritated and wait to go back to living in the dorms",
  "author": "kylieb209",
  "created": 1626625898,
  "over_18": false,
  "upvotes": 148,
  "upvote_ratio": 0.97,
  "comments": {
    "h5pg5e4": {
      "link": "/r/CollegeRant/comments/omtxmg/i_just_wanted_one_day/h5pg5e4/",
      "text": "What reason did they give for waking you up? They may have thought that an extra two hours was sleeping in. Maybe next time be more specific. Like don’t wake me up at all, or not before this time.",
      "author": "xohwhyx",
      "created": 1626661082,
      "upvotes": 6,
      "replies": {}
    },
    "h5nfvul": {
      "link": "/r/CollegeRant/comments/omtxmg/i_just_wanted_one_day/h5nfvul/",
      "text": "Sounds like your parents don’t respect your boundaries. Sending you good vibes and hoping you get a chance to sleep some more. Good luck on med school apps :)",
      "author": "VanGoghsSeveredEar",
      "created": 1626627876,
      "upvotes": 59,
      "replies": {}
    }
  },
  "updated": 1634064361
}