{
  "sid": "r9yvx7",
  "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/",
  "title:": "How to stop overthinking a 7 page paper",
  "text": "I have done the reading and everything but I’m on the verge of a panic attack every time  I sit down to write it. \n\nI have this narrative that I believe I am so stupid and need to have these high standards for myself. I’m so hard on myself for no reason. But I do fine academically but I’m so fixated on what I failed at.  \n\nTLDR: I panic every time I start a paper.",
  "author": "jenniferrook9",
  "created": 1638766099,
  "updated": 1639517981,
  "over_18": false,
  "upvotes": 30,
  "upvote_ratio": 0.97,
  "comments": {
    "hnffm4e": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnffm4e/",
      "text": "you should write without stopping anytime you think about the assignment. it doesn’t need to be perfect, just get thoughts on paper. you can edit it later of course. \n\nthis helps me when i feel overwhelmed about a writing assignment because i want it to be good and well written on the first try.",
      "author": "crazyhow",
      "created": 1638770476,
      "upvotes": 23,
      "replies": {
        "hnhk2dj": {
          "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnhk2dj/",
          "text": "A timer is your friend. Also, separate your writing and editing time. Writing time should happen when you're clear-headed, got enough sleep, and have a decent chunk of uninterrupted time. Editing can come when you have less time and energy. \nFor example, you might set a timer for one hour to write. Tell yourself that this time is for getting your big ideas down and organized only. No agonizing over a single sentence. A few days later, you may only have 20 minutes during an evening. That time can be used to re-read and edit. \n\nNo one's writing is great on the first try. I say that as a professor and published author who teaches writing and STILL struggles to get started. The goal should not be a perfect first draft. You want a polished final draft.",
          "author": "Courageous_Chameleon",
          "created": 1638814537,
          "upvotes": 7,
          "replies": {}
        },
        "hnfika3": {
          "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnfika3/",
          "text": "THIS 100%.",
          "author": "ttyltyler",
          "created": 1638772409,
          "upvotes": 6,
          "replies": {}
        },
        "hngxayg": {
          "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hngxayg/",
          "text": "Just start writing. It is so insanely helpful it’s like a super power. Let it start running and come back to alter it later.",
          "author": "Responsible-Bank371",
          "created": 1638805554,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnfnejf": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnfnejf/",
      "text": "How much time do you have? What kind of paper is this, and for what class? If I had 4 days, my approach would be to to open a page in word, and write the most important points I can think of in complete sentences.  \n\nLets say I wrote 8 sentences. I'll keep my font Times New Roman 12pt, but restrict the lines spacing to single. I find that this helps me more easily see where my ideas are going, and it helps me to stop checking how much more I have to write. (Seriously, when I start writing in double-line spacing, I get very distracted).\n\nAim to address two of your main points in full on one page everyday like this, and you'll be done in 4 days, with more than enough text you can cut down. Highlight all, format to double space, and you have 8 pages. Slap together your summary and intro on your last day based on what you wrote along with any extra text, ~5 sentences each. Keep it simple. Run it through grammarly before you reread. You can easily get this done by spending 1 to 1.5 hours on it a day without rushing.",
      "author": "MolecularMalevolence",
      "created": 1638775926,
      "upvotes": 12,
      "replies": {
        "hnfofpd": {
          "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnfofpd/",
          "text": "Already overdue and waiting from prof to know the final day I can submit. History (source analysis), I guess I am overthinking the body paragraphs. I’m a first year thus it is my first time having to write more than 5 paragraphs. I have no idea how to expand an idea across multiple paragraphs and have them still be together(tips are welcomed).  \n\nI’m also stressing because I have finals this week. My mind has been bad all term.",
          "author": "jenniferrook9",
          "created": 1638776726,
          "upvotes": 6,
          "replies": {
            "hnkkjz1": {
              "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnkkjz1/",
              "text": "A good trick is to split paragraphs into two if they're too big.",
              "author": "lkmk",
              "created": 1638864773,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hnkkiit": {
          "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnkkiit/",
          "text": "This method has helped me so much.",
          "author": "lkmk",
          "created": 1638864741,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnfifua": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnfifua/",
      "text": "Try to break it into parts and don't write the introduction first. Start with the body and write anything down even if it isn't perfect yet. You'll end up getting in the zone after you can start.",
      "author": "genericusername_____",
      "created": 1638772326,
      "upvotes": 6,
      "replies": {}
    },
    "hnggib9": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnggib9/",
      "text": "In the long term, work on the perfectionism, as it is death to getting anything done. Writing is all about editing, so the more you delay due to perfectionism, the more you sabotage the final project. \n\nThe good news is, writing is the best way to challenge your perfectionism, because all writing starts with a shitty first draft. Try the pomodoro method if you are blocked, and then just plow your way through the first three paragraphs. Do something relaxing, and if you have time, come back the next day and do a quick revise of those and write three more. Do this until it’s done, set it aside, and then come back fresh and revise again.  \n\nThe thing with writing is that you usually can only find your argument and the shape of your paper by writing it. This is why the first draft is necessary. Take the pressure off that first draft by just telling yourself, “This is my shitty first draft where I think through my ideas.”",
      "author": "Felixir-the-Cat",
      "created": 1638797838,
      "upvotes": 4,
      "replies": {}
    },
    "hnfiix3": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnfiix3/",
      "text": "I mean, I wrote all my English papers high.. I mean I got As..💀. I’m a drastic over thinker too and when I’d get high I’d just let my ideas flow and write like a mad man. Not saying you need to get high, but have some warm tea, a nice snack, and just sit down in a comfy Environment and write. Having a good outline was crucial for me. If it’s a rough draft just let your ideas flow. Just try your best ok? I get overthinking as It’s plagued me my college journey. Especially if it’s a rough draft don’t be so hard on yourself. Don’t focus on your failures as those only make you stronger. Keep pushing I know you can do it! \n\nAlso go to your schools tutoring center, office hours, and utilize online resources. Purdue owl has some great resources for MLA formatting as well if your paper needs it. Good luck!!! I’m rooting for you.",
      "author": "ttyltyler",
      "created": 1638772382,
      "upvotes": 7,
      "replies": {
        "hnfoqgi": {
          "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnfoqgi/",
          "text": "Thank you I mean it. I feel like I’m paralyzed by overthinking to the point I breakdown. I get confused by outlining as well I can’t seem to get my points to fit. \n\nAlso I feel like i don’t deserve a spot and just drop out but I also want to stay. I guess I’m trying to prove myself even though I already have (3/5 of the exams I have taken have been A).",
          "author": "jenniferrook9",
          "created": 1638776962,
          "upvotes": 3,
          "replies": {
            "hnhm9a9": {
              "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnhm9a9/",
              "text": "I agree to just start writing, but it sounds like you are so anxious that you might need a little extra help to be able to begin. If you can locate some Magnesium Glycinate and some L-Tryptophan, these can be very effective in slowing down your thought processes enough for you to be able to start doing what you are actually fully capable of doing. Good luck!",
              "author": "Wingbatso",
              "created": 1638815390,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hng2yg7": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hng2yg7/",
      "text": "same boat. only 300ish words so far. lol. my source dying on me certainly doesn't help. I can't access the pdf and their website seems to be down",
      "author": null,
      "created": 1638789013,
      "upvotes": 3,
      "replies": {
        "hnkkkfp": {
          "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnkkkfp/",
          "text": "Try archive.org?",
          "author": "lkmk",
          "created": 1638864784,
          "upvotes": 2,
          "replies": {
            "hnl4w8u": {
              "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnl4w8u/",
              "text": "ooh didn't know this existed. thanks",
              "author": null,
              "created": 1638880855,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hng7bpw": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hng7bpw/",
      "text": "Make an outline first, as detailed as you can. You'll be much more comfortable when you have a framework you can build your paper on.",
      "author": "AtomicPunk30",
      "created": 1638792315,
      "upvotes": 3,
      "replies": {}
    },
    "hngcjiz": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hngcjiz/",
      "text": "I’m an English teacher, start with “it was a dark and stormy night” and just keep typing. Don’t delete anything. Don’t edit anything. Put on some music you can study to and try to type for an hour straight, no pressure. After an hour take a break. Repeat process until finished, then edit.",
      "author": "YoghurtIll1478",
      "created": 1638795638,
      "upvotes": 3,
      "replies": {}
    },
    "hnh6vhv": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnh6vhv/",
      "text": "You don’t panic when you start a paper,\nYou panic when you THINK about starting a paper.  Just get some shit typed out and then go from there.  You can revise all you want later but get stuff down on the document.",
      "author": "kryppla",
      "created": 1638809392,
      "upvotes": 3,
      "replies": {}
    },
    "hnhycy9": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hnhycy9/",
      "text": "I jot all my ideas down like “oh this idea branches off to this idea so it’s factual or it makes sense” then I rearrange it so like all dozen of my ideas are in order. I use the textbook and one academic article to support each paragraph. Even if it doesn’t fit exactly, some parts may prove your argument so just use it and it really beefs it up. You don’t even need to read the entire academic article sometimes, just the abstract.",
      "author": "TheRestIs_Confetti",
      "created": 1638820144,
      "upvotes": 3,
      "replies": {}
    },
    "hni6bfd": {
      "link": "/r/CollegeRant/comments/r9yvx7/how_to_stop_overthinking_a_7_page_paper/hni6bfd/",
      "text": "Just write an outline on a piece of paper helps me organize my thoughts more easily",
      "author": "Near_River21",
      "created": 1638823231,
      "upvotes": 3,
      "replies": {}
    }
  }
}