{
  "sid": "o2r366",
  "link": "/r/CollegeRant/comments/o2r366/can_i_do_my_masters_in_something_completely/",
  "title:": "Can I do my Master's in something completely different than my Bachelor's?",
  "text": "&#x200B;\n\nI'm starting my 3rd year in Computer Science, and I'm regretting taking CS. I don't like this field at all. I'm having a lot of trouble learning CS. However, I'm interested in Biology, and I've self-learned Molecular Biology. There are a lot of Master's involving CS and biology like bioinformatics, computational neuroscience, etc. I've learned python but I'm not interested in coding. I've seen a lot of CS students doing Arts for their Master's. I'd like to know if there are careers in biology and healthcare-related.\n\nThanks a lot!",
  "author": "Spirited-Advice9501",
  "created": 1624028472,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "h2by80p": {
      "link": "/r/CollegeRant/comments/o2r366/can_i_do_my_masters_in_something_completely/h2by80p/",
      "text": "Sure. I did. \n\nAs u/bs-scientist noted, this involved taking some courses to get up to speed. I’d been out of school for some time so I picked up my calculus and principles classes one at a time while I worked; some programs may ask you to do a qualifying year, or you can just take some courses at a local community college or four year college if you want to save some money.",
      "author": "tomcrusher",
      "created": 1624116423,
      "upvotes": 2,
      "replies": {}
    },
    "h2802io": {
      "link": "/r/CollegeRant/comments/o2r366/can_i_do_my_masters_in_something_completely/h2802io/",
      "text": "You can do something completely different. \n\nBut going into biology with absolutely no knowledge of biology, is going to be very difficult for you. Both subject wise and potentially finding someone to take you as a student. It’s likely you may have to take remedial courses.",
      "author": "bs-scientist",
      "created": 1624031542,
      "upvotes": 5,
      "replies": {}
    }
  },
  "updated": 1634062128
}