{
  "sid": "nrhcsd",
  "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/",
  "title:": "Do you also do reporting (teaching) of your lessons in class instead of your professors?",
  "text": "I don't know if it's just here, but when I entered college, half of our semester is taught by us students instead of our professors. Like, we're the ones who actually teach in class. It's actually the same when I was in high school. \n\nI'm just so sick of learning all these things by my own. Isn't it their job to teach, not ours? I shouldn't have enrolled if I'm just going to self-study. Sometimes I feel like I'm just forcing myself to do these tasks instead of actually learning lol. \n\nAside from this, it does not help that I really get anxious when I report my assigned topic. I really suck at public speaking. It takes me hours, maybe days, and a lot of preparation because of my anxiety.\n\nSo yeah. I'm curious, is this really normal? Does your college do this too? Is it different there? I just wanna move outside this country if I could only be that lucky. Maybe I could actually learn something if I did.",
  "author": "inconsistentdreamer",
  "created": 1622737178,
  "over_18": false,
  "upvotes": 32,
  "upvote_ratio": 0.78,
  "comments": {
    "h0jv107": {
      "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0jv107/",
      "text": "you need to get good at public speaking--there is no avoiding it. \n\nyou will need to present at work--to clients, to coworkers, to trainees. try to get better at it so you can convince people to see things your way.",
      "author": "ObjectiveAnalysis643",
      "created": 1622802815,
      "upvotes": 6,
      "replies": {
        "h0oh20d": {
          "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0oh20d/",
          "text": "Thank you! I will keep this in mind.",
          "author": "inconsistentdreamer",
          "created": 1622896160,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h0h75up": {
      "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0h75up/",
      "text": "Yes, it’s normal because it’s good pedagogy. Studies show that you retain knowledge more effectively when you’re ‘teaching’ it to someone else. This is because you first need to understand the topic and it’s implications, and then you need to understand it well enough to communicate it to others and answer their questions. \n\nCollege really is a lot of self study, partially because you’re in class so much less than you are in high school. Professors are there to guide your learning and keep you on track, but it’s your job to learn the material and be able to track your studies. \n\nFinally, it’s totally normal to be anxious to present! That doesn’t mean you’re any worse of a student than anyone else in the room. Even though it sucks, it does get less nerve wracking over time. Also, a lot of people aren’t great at public speaking, but if you continue to practice and get better it’ll make you look more competitive in the job market. \n\nGood luck!",
      "author": "HighlyPolitical16",
      "created": 1622748892,
      "upvotes": 28,
      "replies": {
        "h0ogx67": {
          "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0ogx67/",
          "text": "That's a great way of viewing it. Thank you for this wonderful insight. Reading this somehow made me shift my perspective towards this type of studying. I'll try seeing it in a different light and will keep all these things in mind!",
          "author": "inconsistentdreamer",
          "created": 1622896068,
          "upvotes": 7,
          "replies": {
            "h0ppt4b": {
              "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0ppt4b/",
              "text": "That's a great attitude! Another way to think about it is that you're learning the material independently, but you're not doing it *alone*. You have a literal expert as your guide! They pick the materials, so you don't have to waste time finding materials to study and you don't have to worry about whether you're studying from a legitimate source of knowledge or some kind of pseudo-knowledge produced by someone who doesn't know what they're talking about. You can ask an expert any time you get confused, and you have a community of learners that can help each other with smaller questions. College is like those little arm floaties little kids wear during swimming lessons; the goal is for you to be able to swim on your own by the time you graduate. College teaches you how to learn independently, with support so that you don't drown, but with the hope that you will be able to keep learning new things for the rest of your life even once that support is gone.",
              "author": "ExplainsSocialNorms",
              "created": 1622918921,
              "upvotes": 5,
              "replies": {
                "h0x30zi": {
                  "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0x30zi/",
                  "text": "I'll take note of these. Thank you!",
                  "author": "inconsistentdreamer",
                  "created": 1623079754,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h0h0ba3": {
      "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0h0ba3/",
      "text": "Yea we did this for the entire semester with 2 of our classes",
      "author": "Anyaness",
      "created": 1622745974,
      "upvotes": 2,
      "replies": {}
    },
    "h0gzr8q": {
      "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0gzr8q/",
      "text": "I remember in high school I was able to test out of classes, like Spanish, bc I already spoke the language. And didn’t have to spend entire semesters in a class I pretty much was fluent in. I wish they would practice that in college. Like let me test out subjects I’m just teaching myself since the professors clearly aren’t trying to teach.",
      "author": "Hawkbiitt",
      "created": 1622745742,
      "upvotes": 5,
      "replies": {
        "h0h03b2": {
          "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0h03b2/",
          "text": "My university lets you test out of classes. It's called \"challenging the class\" but I've never known anyone who has done it. The process is listed on our website and it says the professor needs to create a final exam for you that proves you know everything in the course, and if you pass that, you pass the class without having to take it for the whole semester.",
          "author": "TheJaycobA",
          "created": 1622745882,
          "upvotes": 6,
          "replies": {}
        },
        "h0jgx5t": {
          "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0jgx5t/",
          "text": "And welcome to https://www.britannica.com/science/Dunning-Kruger-effect",
          "author": "Gihead",
          "created": 1622790575,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h0gzphu": {
      "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0gzphu/",
      "text": "[deleted]",
      "author": null,
      "created": 1622745721,
      "upvotes": 1,
      "replies": {
        "h0jgzme": {
          "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0jgzme/",
          "text": "Oh my god you had to apply higher order thinking instead being spoonfed? The nerve!",
          "author": "Gihead",
          "created": 1622790633,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634063932
}