{
  "sid": "ipola3",
  "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/",
  "title:": "College is overrated",
  "text": "Idk if it's just me but college is not as \"glamorous\" like people often perceive it to be. I was told college was gonna be the best years of my life, so far it's not. It's alot of work and frustration. Racial incidents are occurring on my campus as we speak, making matters worse. Living in dorms suck. People are so nasty and have no respect for others. For now, I hate it. And no I can't dropout, because my family would think I'm a disappointment and a good for nothing. Sorry for the rant, I'm just overwhelmed and angry.",
  "author": "Aivine131",
  "created": 1599683794,
  "over_18": false,
  "upvotes": 191,
  "upvote_ratio": 0.98,
  "comments": {
    "g5bn3s7": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g5bn3s7/",
      "text": "People also said the same about highschool lol. And that was a lie.",
      "author": "deprimada",
      "created": 1600142191,
      "upvotes": 2,
      "replies": {}
    },
    "g4pf0id": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4pf0id/",
      "text": "Never do anything because of ur parents. That’s going to lead u down a path of resentment and u my find that’s not actually what u want to do in life. No one can live it for u so make sure u make decisions that lead to u peace of mind and well being.",
      "author": "Hawkbiitt",
      "created": 1599755684,
      "upvotes": 1,
      "replies": {}
    },
    "g4p2ayj": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4p2ayj/",
      "text": "I would have to say it takes time to realize how good it is. It’s not perfect by any means, but once you find the right group of friends it’s special. You’ll never live within a mile of all your friends again and just be able to hang out whenever, the all nighters in the library, a couple of my friends and I all worked in the same restaurant. They might not be the best years of your life, but there’s certainly nothing like college ever again.",
      "author": "subpar1715",
      "created": 1599751818,
      "upvotes": 2,
      "replies": {
        "g4pan07": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4pan07/",
          "text": "Thanks. I know it's gonna take a while before I find my group. As of now, I'm taking it one step at a time.",
          "author": "Aivine131",
          "created": 1599754242,
          "upvotes": 1,
          "replies": {
            "g4prj73": {
              "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4prj73/",
              "text": "It took me almost until the end of my freshman year. Keep your grades up for now, keep being yourself and it’ll all fall into place. Best of luck.",
              "author": "subpar1715",
              "created": 1599760095,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g4oxz19": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4oxz19/",
      "text": "I'm sorry you feel this way, OP. You're right, college is hard and here at my 4th year it's the hardest it's ever been. We are investing in our own futures, we are stronger and smarter every year! You're doing a great job, let's crush this college burn out ❤🤞🏻💪👍",
      "author": "wienerte",
      "created": 1599750671,
      "upvotes": 2,
      "replies": {
        "g4pb2ve": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4pb2ve/",
          "text": "Thank you for the encouragement! Good luck!",
          "author": "Aivine131",
          "created": 1599754335,
          "upvotes": 2,
          "replies": {
            "g4pbpfv": {
              "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4pbpfv/",
              "text": "You too! Let's be angry too, that's okay too",
              "author": "wienerte",
              "created": 1599754520,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g4ou0s0": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4ou0s0/",
      "text": "If you’re not in a club or an organization or getting involved with campus activities, then it won’t be fun. This is what people usually mean when they make that statement and they don’t have to work when going to school.",
      "author": "Ok_Marionberry_8468",
      "created": 1599749554,
      "upvotes": 2,
      "replies": {
        "g4pbf7d": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4pbf7d/",
          "text": "With covid there's barely any \"on campus\" activities going on.",
          "author": "Aivine131",
          "created": 1599754417,
          "upvotes": 1,
          "replies": {
            "g4q4mhp": {
              "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4q4mhp/",
              "text": "Yeah, but that’s what the college culture is about. Hopefully next year college culture and COVID prevention will be better.",
              "author": "Ok_Marionberry_8468",
              "created": 1599763583,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g4or6ej": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4or6ej/",
      "text": "Not to sound ignorant of other problems, but I'm in absolute heaven right now. College has been great so far. A bit dull this semester because I'm locked away in my room all day, but good nonetheless",
      "author": "zarnonymous",
      "created": 1599748859,
      "upvotes": 2,
      "replies": {
        "g4pbkqf": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4pbkqf/",
          "text": "I'm glad you're having a good time. Hopefully, I can say the same in the future",
          "author": "Aivine131",
          "created": 1599754470,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4o8bsx": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4o8bsx/",
      "text": "Okay, okay. You want a lasting fix to solve your problems, eh? How many years you got penciled in at that college? After that, how many years grinding every single day for your share of scraps going around with your little piece of paper acting like someone actually cares about it or it matters (let alone cares about you)? Are you studying something now a robot or developing world freelancer can't easily do for 1/10th the cost? Colleges bring you in to make money, greatest credit sharks you'll ever meet. They sell you on a promise to make more but leave you owing one-tenth a million with no experience in the job market. But hey, McDonald's is always hiring. Most college operate like businesses in the USA and most students (to make matters worse) waste their time in college, playing a bunch of video games, jerking off everyday, perusing social media, doing the bare minimum studying, drinking wildly, just checking the box. I doubt the \"best times in someone's life\" are based on studying 8 hours a day or whatever the benchmark is that's set in most classes. Those fond memories likely come from a time when they weren't weighed down witn mortgages, kids, ex-wives, high blood pressure, debt, male pattern baldness, hopelessness, etc. They look at 'being young' with fondness because now they are older and that era seemed more carefree. You write that \"college is overrated,\" well so is a career, so is partying, so is everything that you base someone else's opinion on. College is unneccessary if you have half an idea what you want to do with your life. It's not about a job title, but more about the relationships you cultivate, the passion projects you continually work on, how dedicated and disciplined you are in staying healthy, showing up to work, the people you serve, and the awareness of your life spirit, breath, and moving toward greater happiness. No institution is going to give you any of that. But you can find it within. But regardless, I believe you can make college work for you. Snap judgements two weeks in will not be overarching. You'll adapt I believe and find that \"it is what it is,\" for better or for worse.",
      "author": "Writeyourpaper",
      "created": 1599743871,
      "upvotes": 1,
      "replies": {}
    },
    "g4nfwft": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4nfwft/",
      "text": "What types of racial issues are you facing? I’m 16 and I’m thinking of getting into a college after I graduate. I want to make myself knowledgeable so that I can help out my friends of color or any people of color. Sending you all the love 💓",
      "author": "Doumekitsu",
      "created": 1599733067,
      "upvotes": 1,
      "replies": {
        "g4nl43y": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4nl43y/",
          "text": "Thanks. My school has a rock and people often spray paint messages on the rock. Black lives matter was spray painted on the rock before. A week later someone spray painted \"white lives matter\". The rock was sprayed again until someone decided to spray paint \"blacks have no home here\". It was disheartening and sad to see such an offensive message. As a freshman, I've already been through enough this year but seeing that message really bothered me. You can look at my profile for images if you want to see it.",
          "author": "Aivine131",
          "created": 1599735208,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4n0uds": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4n0uds/",
      "text": "It happens people are different some people like it some people hate it, I get where your coming from though. I thought the same till I realized I wasn't about fake smiles and acting \"on\" all the time or different for people. College is a strange place.",
      "author": "TubboTheGreat",
      "created": 1599726012,
      "upvotes": 6,
      "replies": {
        "g4nm9jo": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4nm9jo/",
          "text": "I agree with you. The amount of fake I've seen so far is daunting. It's like people are trying act like someone else just to \"fit in\". I can't live my life being a actor. I'm a quiet person, so I'm not the most outgoing person but I don't need to be or pretend to. College is fucking weird.",
          "author": "Aivine131",
          "created": 1599735673,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4mz790": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4mz790/",
      "text": "I have to agree and disagree on this. College is given to much importance. Yes. College is made to seem easy if you know what you are doing. Also yes. That said, college most likely will help you achieve a higher goal. It's not easy. It's not fun.\nSince I got in college I'm struggling with major anxiety issues and depression. I'm nearly done with it but I can see my work paying off when people come to me with job offers. I would honestly maybe repeat it for the fun of learning but I hate the whole system as it's not turned to learning but to paying and give some kids a pass while others suffer immensely",
      "author": "AlthaeaAmakiir",
      "created": 1599725255,
      "upvotes": 2,
      "replies": {
        "g4nnbg2": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4nnbg2/",
          "text": "Yes college is still important and will help you achieve your ambitions and goals in life, but I wish people were a little more realistic. People glorified college making it seem like it was gonna be some glamorous amusement park. I just wish people were little real with me and not fill my head with fantasies.",
          "author": "Aivine131",
          "created": 1599736110,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g4ml613": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4ml613/",
      "text": "It's glamorous if you have scholarships to afford it. I work three jobs and was homeless at one point.",
      "author": "BecuzMDsaid",
      "created": 1599715470,
      "upvotes": 1,
      "replies": {}
    },
    "g4ma31g": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4ma31g/",
      "text": "For me the overrated part about college is people think that you have to have the full college experience by living in dorms. I think living in dorms is overrated. I don’t know why people trash on students who go to community college. It doesn’t mean they are dumb because they can’t make it into Ivy League or a “normal” 4 year college. Although I am only a freshman in college so I can’t speak much about the full college experience, but for me when I feel like I can’t do it anymore I think about everything my parents had did for me and I get motivated to work hard. I hope you look at things at the brighter side and don’t let those annoying kids in college affect you! At the end of the day it’s your life and you got to start living for yourself instead of living for others. I hope you feel better!",
      "author": "Lizzie567",
      "created": 1599707695,
      "upvotes": 5,
      "replies": {
        "g4nol86": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4nol86/",
          "text": "Thanks! And yeah dorms are for sure overrated. People are so nasty disrespectful. Not gonna lie, my roommate  is cool and all but damn I wish I had my own privacy. Also, I'm kida of tired of the dude trying to advertise his business to me. I'm opting out housing as soon as possible because I can't live here for another year. Fuck that. I wish I had gone to a cc, its more cheaper and with everything being online it would make the most sense. Good luck to you as well",
          "author": "Aivine131",
          "created": 1599736632,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g4m6rlq": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4m6rlq/",
      "text": "Could've saved thousands in future debts, had your own room at home, met much prettier hometown girls, and been the big fish in a little pond if you just had gone to community college dude. But, nothing is ever as it's hyped up to be, which is why most people drown their life in distractions and false truths. Look on the bright side. You made it, and are seeing it for what it is. What will make it better is...meeting a woman (23-26ish) off campus who will make you dinner, let her sleep at her place, and show you the fine art of fellatio.",
      "author": "Writeyourpaper",
      "created": 1599705721,
      "upvotes": -1,
      "replies": {
        "g4nprdo": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4nprdo/",
          "text": "Idk dude. If it's women I wanted to meet i think going to a 4yr college is more guaranteed because they're everywhere. But what does this have to do with anything? Idgaf about meeting women or whatsoever. I have bigger things to worry about. If meeting a chimera makes you happy, good for you then. Sleeping with a women wouldn't make my situation any better. Temporary pleasure never solves any problems.",
          "author": "Aivine131",
          "created": 1599737111,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4m6eoe": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4m6eoe/",
      "text": "Completely agree my friend.",
      "author": "shirbert6540",
      "created": 1599705517,
      "upvotes": 3,
      "replies": {}
    },
    "g4lnr1u": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4lnr1u/",
      "text": "u/Aivine131 college is what you make of it. You get back what you put in. How you perceive college also depends on the individuals you choose to spend your time with. Just as Motivational speaker, Jim Rohn, once said “You are the average of the five people you spend the most time with.” I think that quote really rings true in terms of the way in which a college age individual perceives the atmosphere at their chosen institution.\n\nBefore I transferred to the University of Arizona in 2019, I thought all universities were overrated in one way or another. But after I moved away to college, I found a whole new crowd to folks to socialize with an met my roommate, who I will will be rooming with again when I return to Tucson, AZ in January for senior year. My roommate and I are very good friends, we text multiple times a week just to shoot the breeze.\n\nThe point I am trying to make is don’t dismiss or rule out the “college experience” just yet. Give it time, feel it out. Hang out with or talk to folks you have never hung out with or talked to. You might meet some interesting individuals who will positively impact your life in some way or another. There will be some unpleasantness in your life everywhere you go and in most settings.\n\nI have endured my fair share of ups and down in life and at college. There were many times when I wanted to lay down and give up, but I always went back to the bigger picture and and reset my motivation. From that, I learned that Life’s not fair, it never was, it isn’t now and it won’t ever be. Get over it and get on with it.",
      "author": "DConMont505",
      "created": 1599695565,
      "upvotes": 11,
      "replies": {
        "g4nqqkz": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4nqqkz/",
          "text": "Thanks. Life will never be fair. It's always about the experiences.  You didn't have to deal with Covid. Covid ruined my senior year of hs and now is wrecking my first year of college. Nobody except the class if 2020 doesn't know how its like to accept this whole situation as a new normal and still smile despite the anger and fear in you. Anybody who says otherwise is ignorant and pathetic. But as of right now, I'm starting to have slight regrets. I've never had to deal with this much uncertainty in my life. As an 18 year, this is scary to me. Sorry if my post came off as offensive or unpleasant.",
          "author": "Aivine131",
          "created": 1599737497,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4ln93p": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4ln93p/",
      "text": "Hi, teacher credential grad student here. I don't disagree with you in the slightest; even tho my parents weren't going to pay for the on-campus life for me (I've stayed home every year of undergrad and grad.), I still remember being told or at the very least alluded to by the children's pastor at my old church (I used to volunteer in that dept, but I really can't stand the church (As in the mainstream Christian church. Mine was Baptist. Still counts.) as it behaves.) that I was going to regret not living on campus and getting the #campuslife.   \n\n\nLike, buddy, I'm already disenfranchised with college because I spent undergrad on something I didn't actually want to do as a profession. I chose it because I *needed to choose a fucking major.* I'm in grad school now because it took me forever to actually find out what I really wanted to do. As it turns out, I actually like teaching.\n\n&#x200B;\n\nSure wish someone would've helped me figure that out in high school./s",
      "author": "wildtallywacker",
      "created": 1599695301,
      "upvotes": 5,
      "replies": {
        "g4m7tnp": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4m7tnp/",
          "text": "Yeah by sophomore year you have to choose",
          "author": "merciBoucoup95",
          "created": 1599706340,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4lcfok": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4lcfok/",
      "text": "[deleted]",
      "author": null,
      "created": 1599689901,
      "upvotes": 12,
      "replies": {
        "g4mqr4a": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4mqr4a/",
          "text": "College was easy for you?? I feel like it’s kinda easy but I’m not sure about college. Idk if that makes sense lol",
          "author": "diegm9",
          "created": 1599720417,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4lagc2": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4lagc2/",
      "text": "I love my school so much.",
      "author": "rctid2000",
      "created": 1599688950,
      "upvotes": 3,
      "replies": {}
    },
    "g4l8sny": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4l8sny/",
      "text": "In my view, it’s necessary for my goals because I want a job that financially supports my life (software engineering). The people that are having fun are either a) majoring in something easy b) have rich parents c) are having fun at the cost of crippling student loan debt; or a combination of those three. Most students that aren’t wealthy, are studying challenging majors, and are financially smart aren’t having fun because they’re too worried about being successful.",
      "author": "JoeJoe1492",
      "created": 1599688089,
      "upvotes": 30,
      "replies": {
        "g4lol7p": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4lol7p/",
          "text": "I have to refute the majoring in something easy thought. I majored in theatre art, something I'm sure some people would call easy because it has the word \"art\" attached to it. Personally, it wasn't easy for me. As I went along, I quickly realized *I really wasn't that great at this*. Like, not to self-deprecate, but the people I worked around were far more talented in the area, both in the technical and performance sides.\n\n&#x200B;\n\nWhy didn't I just switch majors? Cause I was told I \"just needed the degree\" by my dad (He really does think that a degree will just open doors for you. Explain that to unemployed STEM grads. Doors never just \"open\".), was told in H.S that everyone needs to go to college because reasons never disclosed to me outside of \"you'll be more successful/make more money.\" (I know all about the statistics that say degree holders earn more yearly, and it's extremely misleading.), was in my school districts AVID college prep program at the behest of both my parents (It's okay, I learned cornell notes.). And honestly? I didn't switch because I didn't know what I wanted. I never had any actual guidance counseling to help me decide if college was right for me, and what major/career path I'd want to consider, so I stuck with what I did more out of being too far in/complacency. That, and if I dropped, I'd have to move out of my parents house, in California no less. I'd be homeless if I did that.\n\n&#x200B;\n\nThe problem is that we expect everyone to go to college. Not everyone should. Now I'm pursuing my teaching credentials so I can be the teacher and counselor I wish I had. We throw too many kids out into college and just expect them to figure it out. Many just end up indebted.",
          "author": "wildtallywacker",
          "created": 1599696011,
          "upvotes": 12,
          "replies": {}
        },
        "g4m7pnv": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4m7pnv/",
          "text": "I agree that it depends on what you’ll be doing, interested in, because even outside after graduation everything you learn is the intro to your job and there are big learning curves, but that’s why you go to college so you at least understand how to tackle real world problems. Easy is also subjective, some people find writing essays every week hard and others love it. Some people find singing hard but others enjoy it , it all requires effort and time but your investing in yourself to be able to gain that well rounded knowledge in the real world. Now with this being said yes most people will be un employed OR work in something different from their major but it shows the employer your worth ethic because college is Jed and you’re at least well rounded enough to be adequate at whatever job you’re at. It definitely should cost less but it still has to be valuable. Freshman and sophomore year you’re kind of fucking around and getting through but junior senior year when you have electives and things get harder you realize oh shit I need to graduate and really try. \n\nSome people get lucky with podcasts,starts ups, influencers but not everyone is .. which that also can be hard work bc of marketing, exposure and likability it just depends on what you’re willing to put in effort in in order to get something out of it",
          "author": "merciBoucoup95",
          "created": 1599706272,
          "upvotes": 5,
          "replies": {}
        },
        "g4ogh8t": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4ogh8t/",
          "text": "Or maybe people that are having fun work extra hard to balance their school and social life",
          "author": "awholelottahooplah",
          "created": 1599746075,
          "upvotes": 3,
          "replies": {
            "g4ornwt": {
              "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4ornwt/",
              "text": "Definitely it’s all about time management",
              "author": "merciBoucoup95",
              "created": 1599748938,
              "upvotes": 2,
              "replies": {}
            },
            "g5bnbxe": {
              "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g5bnbxe/",
              "text": "It could never be that. Theyre just lazy and entitled /s",
              "author": "deprimada",
              "created": 1600142339,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g4orwu5": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4orwu5/",
          "text": "Im just happy about my situation, no roommate all year. It's been fun being alone for once",
          "author": "zarnonymous",
          "created": 1599749024,
          "upvotes": 1,
          "replies": {}
        },
        "g4pfazj": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4pfazj/",
          "text": "U should get ur certificates, A+, networking +, CCNA, security +, jobs care about ur hands on application not your degree.",
          "author": "Hawkbiitt",
          "created": 1599755825,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4l820p": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4l820p/",
      "text": "The people who tell you that it’s the best years of their life really peaked in college and I wouldn’t wanna live like that",
      "author": "uzeruzer",
      "created": 1599687702,
      "upvotes": 95,
      "replies": {
        "g4lnwcd": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4lnwcd/",
          "text": "Yeah. Or maybe the recruiters ... should not listen to people who make money when you sign up.\n\nHaving said that, they were the best years of my life... all 10 years as a student and 11ish as a professor.\n\nAgain, don’t listen to people like me.",
          "author": "ThatProfessor3301",
          "created": 1599695640,
          "upvotes": 24,
          "replies": {
            "g4oufy8": {
              "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4oufy8/",
              "text": "I mean it depends. It's a lot of work but I really enjoy learning so much stuff. That being said it is definitely stressful and costs way too much; I wouldn't complain if it was cheaper.",
              "author": "Pacman042",
              "created": 1599749689,
              "upvotes": 3,
              "replies": {
                "g4pj3no": {
                  "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4pj3no/",
                  "text": "It was much cheaper for me. Undergrad was $1000 per year and my scholarship covered it in full and lived with my parents.\n\nMBA was $900 per semester and I made $4500 per semester as a TA.",
                  "author": "ThatProfessor3301",
                  "created": 1599757326,
                  "upvotes": 2,
                  "replies": {
                    "g4qe3g7": {
                      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4qe3g7/",
                      "text": "Wow lucky. It costs me as much for a single class as it cost you for a year. And I'm talking community College classes. Even with inflation that's crazy.",
                      "author": "Pacman042",
                      "created": 1599766141,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g4ormmu": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4ormmu/",
          "text": "or they had a lot of fun and wanted to give a college freshman something to look forward to",
          "author": "zarnonymous",
          "created": 1599748927,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4l6m24": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4l6m24/",
      "text": "Completely agree. Personally I think teens who are graduating highschool should get just 1 year of college life, just to have the experience of being \"out in the world and away from home.\" Unless you really want to go or your dream career calls for it, I wouldn't recommend going to college fully.",
      "author": "smurffeet",
      "created": 1599686949,
      "upvotes": 30,
      "replies": {
        "g4pbgsj": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4pbgsj/",
          "text": "So true. I consider freshmen in college as going in 13th grade. They’re still children but old enough to get into serious trouble, so I always see university policies attempting to coddle them into adulthood. It’s like one last hand-holding session before the training wheels of life are taken off",
          "author": "too105",
          "created": 1599754428,
          "upvotes": 7,
          "replies": {}
        },
        "g4lnh11": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4lnh11/",
          "text": "living in the barracks in the army kinda teaches you that too.",
          "author": "condomm774",
          "created": 1599695422,
          "upvotes": 8,
          "replies": {
            "g4loosk": {
              "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4loosk/",
              "text": "I didnt know that. Well thats another option for them too!",
              "author": "smurffeet",
              "created": 1599696066,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "g4orr4a": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4orr4a/",
          "text": "I do, it's great.",
          "author": "zarnonymous",
          "created": 1599748970,
          "upvotes": 1,
          "replies": {}
        },
        "g4oukzo": {
          "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4oukzo/",
          "text": "They need a one year warranty on college ong",
          "author": "Wizcombo",
          "created": 1599749740,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4l4z23": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4l4z23/",
      "text": "Yeah traumatic but brings people together lol , especially freshman year, dorms suck everyone is selfish and trying to be cool, but in the end those are memories made and great stories to tell.",
      "author": "merciBoucoup95",
      "created": 1599686102,
      "upvotes": 12,
      "replies": {}
    },
    "g4l3a8x": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4l3a8x/",
      "text": "Lots of kids this generation are slowly realizing this lol. College is for sure tough and overrated in a lot of respects, what you make of it.",
      "author": "fluffychiblets",
      "created": 1599685220,
      "upvotes": 62,
      "replies": {}
    },
    "g4l2wex": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4l2wex/",
      "text": "Could go online",
      "author": "gabbagabbalabba",
      "created": 1599685025,
      "upvotes": 2,
      "replies": {}
    },
    "g4l1tei": {
      "link": "/r/CollegeRant/comments/ipola3/college_is_overrated/g4l1tei/",
      "text": "agreed",
      "author": "Wowzaitstorii",
      "created": 1599684479,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634062038
}