{
  "sid": "rddkjw",
  "link": "/r/CollegeRant/comments/rddkjw/first_c/",
  "title:": "First C",
  "text": "This is my first semester of college and got 3  As and a 79.52% in my college algebra course. I’m really pissed ab it so idk what to but post ab it here. On the bright side I finished my first semester and can finally start relaxing. How important is GPA when it comes to looking for jobs and careers?I’m a finance/accounting major",
  "author": "legitmb",
  "created": 1639156819,
  "updated": 1639517901,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.79,
  "comments": {
    "ho0lai1": {
      "link": "/r/CollegeRant/comments/rddkjw/first_c/ho0lai1/",
      "text": "It's not. I'm 25 and have been in the \"real world\" for a while (went back to college last semester) and no one even puts their GPA on their resumes and employers don't ask. Not only will no one ask for your GPA, they will also under zero circumstances scrutinize your transcript. Only if you plan on going to gradschool will someone be looking at your transcript and even then one C in a bunch of As might not matter that much.",
      "author": "envurban",
      "created": 1639160364,
      "upvotes": 11,
      "replies": {}
    },
    "ho217gx": {
      "link": "/r/CollegeRant/comments/rddkjw/first_c/ho217gx/",
      "text": "GPA is usually the last thing an employer cares about. However, this is dependent on your career. For example, a doctor definitely needs to have a high GPA. Where someone with a business administration degree generally (not always) GPA maters far less. Don’t stress you’ll be fine. College DOES NOT DEFINE YOUR ENTIRE LIFE OR CAREER. I cannot stress this enough to students",
      "author": "shitshow_420",
      "created": 1639181529,
      "upvotes": 6,
      "replies": {}
    },
    "ho1x3e9": {
      "link": "/r/CollegeRant/comments/rddkjw/first_c/ho1x3e9/",
      "text": "Ngl it’s pretty important in our field. You want to make sure you’re on target for finishing at least 3.5 GPA or above bc that gate keeps a lot of the top dev programs in finance. If you lean more towards accounting then you might be ok but you still wanna make sure you know algebra better.",
      "author": "airbear13",
      "created": 1639179737,
      "upvotes": 1,
      "replies": {}
    },
    "ho2nx1z": {
      "link": "/r/CollegeRant/comments/rddkjw/first_c/ho2nx1z/",
      "text": "Shouldn’t they round the 79.5 to 80 in the final grade?",
      "author": "RillaBam",
      "created": 1639191769,
      "upvotes": 1,
      "replies": {
        "ho3o9uu": {
          "link": "/r/CollegeRant/comments/rddkjw/first_c/ho3o9uu/",
          "text": "Some professors are picky and don’t round up",
          "author": "kinguhishan",
          "created": 1639213953,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}