{
  "sid": "r07pr9",
  "link": "/r/CollegeRant/comments/r07pr9/i_am_concern_too_comfortable_or_normal/",
  "title:": "I am concern. Too comfortable or normal?",
  "text": "So…\n\nI’m in a group. I’m a girl in her early 20s. I’m working on a group final project, we’re about to turn it in. 2/4 of our members have put in the bulk of the work. One of those two includes me, the other is a group-mate. It’s a long story and no we’re not happy about it. I will refer to them as gp. He is male in early or mid 30s\n\nGp and I have worked on projects together before, we’re a good team, I guess.\n\nLately the conversations with him have been…. Sexual? But not in a way that I can downright call flirting. And anytime he implies something between me and him I don’t address it.\n\nHe’s made it clear he’s into girls with my ethnicity. He has called me pretty. He’s made jokes about…. Sexual stuff with me.\n\nI’m friendly so I haven’t really addressed it, maybe because things like that don’t bother me and I’m sex-positive.\n\nI’ve considered it and.. no. I won’t fuck him. I’m in the middle of a dry spell T-T so of course I’ve thought about it.\n\nBut… no. No god no he’s not my type at all. He’s made it clear his Dick is big. He’s having emergency surgery this week.\n\nHe’s asked me to take care of him for the first couple of days that he’s recovering.\n\nI have said yes. Because…. I DINT KNOW??!! JESUS FUCK. I’m so conflicted. Am I uncomfortable? No, he has yet to make a move on me…. I think… I AM pretty socially awkward. It takes me a while to realize peoples intentions… sometimes.\n\nFor him, I think his intentions are to make it clear he wants to sleep with me if given the chance. But he def. won’t make the first move, in a way he is a gentleman. (Waiiiit but do gentlemen talk like this???) But… I’m so conflicted. I have hope he won’t try anything. I have also implied HEAVILY that I’m not planning on making any booty calls with anyone any time soon. \n\nHe has asked me if our zodiacs are compatible(red fucking flag). And I told him “haha no. You should go for a [completely different zodiac sign than mine], and I should go out with [not his sign]”\n\nBut Christ man, this isn’t the first time guys have talked to me like this. Especially like this. He’s fucking shooting his shot isn’t he? I’ve just come to that realization. He’ll keep shooting. And if I turn it down? Directly? But has he asked me out directly? Maybe, but like I said for every attempt I’ve given a soft no. I guess this cycle will just continue… or at least for however long we need to interact with each other… I just want this semester to be over…",
  "author": "Scarcity-Any",
  "created": 1637652233,
  "updated": 1637689641,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.2,
  "comments": {}
}