{
  "sid": "qk68y6",
  "link": "/r/CollegeRant/comments/qk68y6/am_i_doing_the_whole_collegeuni_thing_right/",
  "title:": "Am I doing the whole college/uni thing right?",
  "text": "I (18, Male Presenting) am a freshman at a large state university nearly 2,200 miles from home on the opposite side of the country. I came here for the specific purpose to escape my family and friends and start a new life for myself. \n\nThis summer, before I left, I found a gf on tinder and it was wonderful. long story short, I liked her very much and I believed she had the same feelings, but after trying long distance together, she broke it off. I would still consider her my best friend even though we aren’t exactly speaking at the moment because she is undergoing medical treatment. \n\nAnyways, i’ve been here about 2 months and I haven’t made friends where I really feel like we connect like my boys at home. Whenever people invite me to do things, I would say I accept about 60% of the time. I’ve been trying to go to parties, but I don’t enjoy going alone, and my “friends” don’t go as often as I myself would like to be going. i’m also kinda outta the loop when it comes to hearing about parties and I always have to ask other people what is going on that night. \n\nCommon areas are closed due to covid, and I don’t really study in the library or the buildings because I suck at studying and I just feel more comfortable studying in my room. I also have some “friends” on my floor in my dorm who i’m aight with but we don’t really align at a core level. they’re just people to help me pass the time and feel good with in the moment. \n\ni’m also an engineering major. coursework is packed and very technical. little to no time for social interaction, and precious time in between classes is used for eating or studying. I most definitely want to be clear that I am going to my classes and trying to meet people in those classes, but they are not reciprocating at all because the coursework is so demanding and I don’t want to be the guy who is distracting them from lectures or the weird guy who is striking up conversation with a passerby. \n\ni’m also in the all mens choir because i’m not good enough to audition for the coed choir, but I def wanna meet more artsy friends or at least people who share that interest in the arts with me. \n\nI’ve tried my best to put myself out there and ask some people out to eat or to just do mundane activities but it hasn’t really gotten me anywhere. I was talking to one girl tonight who I kinda like and she was saying that getting a job on campus may be a good way to meet people and get into parties but i’m not all that sure if I have the time for that. her and I are presenting a discussion tmrw and i’m considering asking her out to lunch sometime this week during the break in the discussion. \n\ni’ve also put myself on tinder and went on a date with one girl who was very nice and clearly very interested, but I genuinely feel like I was underselling myself looks wise. \n\nthere are also two clubs that may interest me: piano club and dance club. two things i’ve always wanted to learn, one of which has not gotten back to me, and the other of which i’m just too embarrassed because I can’t dance lol\n\nso, all of this is to say, I feel like i’ve been giving college a valiant effort so far, for being a relatively introverted guy, and nothing of substance has come from it. are there any tips you all can give me to meet people? even if I had a few people I was really close with, it would make the whole college experience a little less crummy. ideally, I would love to find a partner, and i’ve been trying to find some compatibility, and maybe that’s been too much of my focus. \n\nTL:DR How do I make friends/meet people at college? Including romantics. I feel like i’ve been giving it a valiant effort by getting somewhat involved on campus and not completely isolating. what am I doing wrong?",
  "author": "wglenn03",
  "created": 1635740365,
  "updated": 1635780114,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hiuombj": {
      "link": "/r/CollegeRant/comments/qk68y6/am_i_doing_the_whole_collegeuni_thing_right/hiuombj/",
      "text": "I think you're doing just fine. \n\nI think that for some people, it takes time to make friends that you feel comfortable with. It can definitely take longer than 2 months. Sometimes it just takes a while to meet the right people. I currently haven't made any friends through uni and have been studying since the start of the year. I think that the right people will come into my life when it's the right time. \n\nHave you thought about going a little bit out of your comfort zone and studying with someone in one of your classes? Having that bond of studying together for the same class somewhere might help you both out. \n\nSometimes just sitting next to someone in class can help. It can open up an opportunity for when, or if, a professor asks you to discuss something with the people around you. There's also an opportunity to ask at the end of the class if they'd like to study with you, and if they're interested, get their contact info and give yours. \n\nI think that you should give the dance club a go if you have time. There's nothing to be worried about, people aren't constantly watching you to see if you mess up or do something wrong. If someone notices a move that you might be doing wrong, I'd assume they'd come over to help you so you can dance better. \n\nOverall, the one thing you can be consistent with is being confident and not caring too much what others think of you.",
      "author": "foodisloveeee",
      "created": 1635742860,
      "upvotes": 1,
      "replies": {
        "hiush0y": {
          "link": "/r/CollegeRant/comments/qk68y6/am_i_doing_the_whole_collegeuni_thing_right/hiush0y/",
          "text": "hey tysm this means I lot. I read your comment in its entirety and i’ll take the things you said seriously. especially the studying with people. thanks again!",
          "author": "wglenn03",
          "created": 1635745765,
          "upvotes": 1,
          "replies": {
            "hiusxfk": {
              "link": "/r/CollegeRant/comments/qk68y6/am_i_doing_the_whole_collegeuni_thing_right/hiusxfk/",
              "text": "It's ok! I hope that it all works out for you. Best of luck for finding friends, or at least people you can talk to from time to time.",
              "author": "foodisloveeee",
              "created": 1635746141,
              "upvotes": 1,
              "replies": {
                "hiuw3my": {
                  "link": "/r/CollegeRant/comments/qk68y6/am_i_doing_the_whole_collegeuni_thing_right/hiuw3my/",
                  "text": "thanks :)",
                  "author": "wglenn03",
                  "created": 1635748925,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}