{
  "sid": "n0lkf6",
  "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/",
  "title:": "Why are professors allowed to be so bad at their jobs?",
  "text": "I am in the last class required for my major and have a 3.8 GPA in my major to date. This class has caused me so much stress that my hair is falling out. Here's a rundown of how the class works:\n\nOnline lectures where the professor projects his typed notes onto the screen and reads off of them nearly word for word. These notes are essentially just the book paraphrased. There is also one midterm and one final exam that make up most of our grade. \n\nThe midterm was rough. I failed and upon reaching out to my classmates, realized that everyone who I spoke with failed with the exception of one who got 1% above failing. The professor refused to tell us the average on the exam and refused to curve. I asked for clarification on his grading on one specific question and he pretty much told me everything was technically correct, but I had forgotten to check one of eight things so I got nearly 3/4ths of the points taken off. On top of being a hard grader, he gives us the hardest problems from the book for our homework. My tutor is even unable to help me with some of the problems and he has a graduate degree in the subject. The professor also does not have office hours, instead he asks that we send him emails to ask questions. The catch is he doesn't respond to every email. Even when he does help, half of his answers are just stating that something is easy so we should do that part on our own. The class has shrunk greatly in size from the start of the semester due to people withdrawing. \n\nI have reached out to my dean to raise my concerns about the professor. They said they will speak with him and get back me, but I don't feel like they will do anything.",
  "author": "GreenEqualiTea",
  "created": 1619634996,
  "over_18": false,
  "upvotes": 379,
  "upvote_ratio": 0.98,
  "comments": {
    "gwhg6i4": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwhg6i4/",
      "text": "This might seem a little long but bear with me:\n\nA reason i found is usually they aren’t hired because they teach great but because either they have a lot of notoriety in their field or because they are great researchers who can get the university lots of money. \n\nUsually with professorships there isn’t that much qualification you need besides having a certain degree or experience in that field. At my school, you just need a masters in order to be an adjunct. Meanwhile to be any other teacher, you need to go through countless background checks, a certified program, get fingerprints, spend so many hours observing, pass the praxis, student teach, get a degree, sometimes get a masters, etc. etc. \n\nAnd on top of that there’s a ton more rules you have to follow because teachers tend to be held to a higher standard: some teachers can get fired just for dressing “provocatively” ie in a pencil skirt and a blouse, whereas another teacher no joke got fired because she said she was depressed. \n\nOn top of that, colleges are more willing to cover up when a professor does something wrong. Or a student doesn’t report them because they’re older or it doesn’t seem necessary. There was a professor I had who wouldn’t give a girl an extension on her midterm because he doesn’t accept late work; said girl had a concussion and her doctor told her not to look at a screen or she’d make it worse. If this was grammar school, he’d get written up. In college, she didn’t feel like reporting him. \n\nNot only all that I just mentioned but professors hold your entire life in their hand. If you have a bad teacher in high school, your parent could complain or you could just go to summer school. In college, you could lose your scholarship, have to spend more money, etc.",
      "author": "CapriciousSalmon",
      "created": 1619825628,
      "upvotes": 1,
      "replies": {}
    },
    "gwboive": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwboive/",
      "text": "We're not allowed to be bad at our job -- there is actually an extremely high standard -- but our job, as evaluated by the administration, is research, not teaching.\n\nTenure, promotion, salary increases -- everything -- depends on producing high quality research. Good teaching is not rewarded. Literally, the only way that teaching is rewarded is through feel-good rewards like \"teacher of the year\" but these are meaningless and don't help our career at all. \n\nThe only thing that motivates us to be good teachers is knowing that we have helped students grow and improve. In other words, intrinsic motivation derived from positive relationships with our students. Typically, young faculty put a lot of energy into teaching even though they aren't rewarded for it because they are optimists and believe students have good motivations and a sincere dedication to learning. That naivety wears off slowly, as one gets to know students and their deceptions, and once the well of optimism has run dry, there is no reason to put more than the absolute minimum into teaching.",
      "author": "TheProfessorsCat",
      "created": 1619719098,
      "upvotes": 2,
      "replies": {}
    },
    "gwb83yl": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwb83yl/",
      "text": "I understand, man.\n\nI had a precalculus professor in community college - WORST. GRADER. EVER. He'd dock points for not dotting your i's and crossing your t's. Like, I think he might have docked me a point simply because I circled my answer instead of drawing a rectangle around it. Needless to say, I filed withdrawal paperwork within a day, and took the class the following semester with a different professor.\n\nThen, there was this guy at my current university - a primarily teaching university, mind you. Nice guy, but the homework was somewhat difficult and he was not that great at teaching the material. I attended labs with his TA's to complete the lab assignments, and I still only eked out a B+. At the end of the semester, he asked me how I thought the course went. I decided I had to be honest with him, and he said he could understand and that the next semester would have a different syllabus. The problem was, his hands were somewhat tied because of other professors who just use his syllabus.",
      "author": "Comprehensive-Ad3963",
      "created": 1619712936,
      "upvotes": 1,
      "replies": {}
    },
    "gwb19i8": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwb19i8/",
      "text": "Does the instructor have anything in the syllabus about how long it takes to get back to you on an email? My syllabi do, and I’m required as an instructor to put that in there. I have to respond within 24 hours on a weekday, Monday through Thursday, but not on the weekends. Online courses don’t have office hours usually, but if he has no office hours, it would be incredibly important for him to answer emails in a timely way as per his syllabus. You can document every email and it’s reply response time and send that collectively to the dean or his department chair, showing there’s a problem. They need data to take action.",
      "author": "chrisrayn",
      "created": 1619710096,
      "upvotes": 1,
      "replies": {
        "gwb3aaa": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwb3aaa/",
          "text": "His syllabus does not say how long it will take. It is a very short syllabus with minimal information. I did document the emails he has not responded to and sent it to the dean.",
          "author": "GreenEqualiTea",
          "created": 1619710943,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gwapwqx": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwapwqx/",
      "text": "Personally I find this more common than not. Find it crazy how most lecture notes/ lectures are shorter and less detailed than notes I took in secondary school .",
      "author": "Cianza456",
      "created": 1619705206,
      "upvotes": 1,
      "replies": {}
    },
    "gwaooqy": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwaooqy/",
      "text": "Nothing is as bad as my boyfriend's current professor. Our school offers the ability for any class to be asynchronous now that things are online and lectures can be recorded. So, my boyfriend took a film class asynchronously because it overlapped with another class that he needed this semester. Well, instead of the professor recording the lectures (like literally EVERY professor does) he instead writes out the lecture word per word, without formatting, and sends it to my boyfriend after every lecture. There is another student who's asynchronous in the class as well and both of them have been struggling all semester. \n\nThe only good thing is that for exams they can just ctrl-F through the lectures",
      "author": "cabbage-soup",
      "created": 1619704645,
      "upvotes": 1,
      "replies": {}
    },
    "gwaeo8w": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwaeo8w/",
      "text": "Suggestion:\n\n1. Ask for a formal review of the mark on your midterm. Your university would have a process for this.\n2. Get together with the other students and individually get every single one of them to do the same thing as you. The more formal reviews the better. \n\nYour reasons:\n\n1. Improper materials to prepare for an assessment\n2. Improper teaching to prepare for an assessment\n3. No feedback or support that would set you up for success on the assessment\n4. The tutor is not equipped to support you on the assessment\n\nYour university will have a process around this, and it will be specific and time-based so enquire as soon as you can and get moving on it. Appeal at every point you can. \n\nThen, set up a zoom meeting with the Dean, and invite everyone else from your class. Get them all in on the meeting and let him know that all of you are going to formally appeal every assessment from this professor while you are in the unit. \n\nInvestigate which options are available to you outside the university (in my country there is a government authority over universities you can appeal to once you have exhausted all internal university options).\n\nGo to the university publication, and indicate there is a student movement against the poor teaching in the department and refer them to the dean to comment. \n\nAt the start of the next online lecture, let the professor know you will be recording him for the purposes of reviewing his teaching and marking as per the assessment. \n\nThe kind of professor you describe is exercising a criminal abuse of his power. He is an ass and he needs to have the students use his people power to push back. Other opportunities:\n\n1. Contact the industry associations he belongs to and complain about his unprofesionalism. make sure all complaints have a variety of signatures on them.\n2. Contact the student guild/union and find out what services may be available to you. \n3. Contact the University president outlining all of the steps your class is taking on the matter. \n\nSee if you can find his other students or ex students to join your actions. \n\nThe goal is to get the Dean to have someone take over the class while you are in it.",
      "author": "ourldyofnoassumption",
      "created": 1619699541,
      "upvotes": 1,
      "replies": {
        "gwagsyf": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwagsyf/",
          "text": "I appreciate you leaving this comment so hopefully other students can benefit from it. My lectures are already over and my final exam is in a few days so I don't believe I'd have time or benefit much from doing much of this at this point. I have gotten support from most of my class who agreed to sign my initial complaint to the dean and department head and encouraged them to submit formal complaints as well. I will probably try to appeal my grade though. Thanks again!",
          "author": "GreenEqualiTea",
          "created": 1619700721,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gwacgal": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwacgal/",
      "text": "So, I’m a bit in both boats. I teach at my local community college, but as part of a career change, I’m a student at the same community college. I’m horrified at what some of my professional peers think makes a good class :/\n\nI’d say that just under half of them are over the top fantastic and the other chunk are terrible. There’s no middle ground. One has completely changed the course rules several times regarding due dates and project requirements. Her rubrics bare beyond subjective and lazy. The grading scale is differ from the rest of the department and school. If I get a 94%, I’m getting a B- (an A according to the department and school) and she never grades anything above 90% and gives feedback of “I’d like to see more.” MORE!? I wrote 1.5x the requirement and in-depth. I generally have to hold myself back because I’ve gotten used to writing at the g actuate level and for professional reasons and it’s gotten easy to write 20-30 page papers on “basic” topics. So I could easily do that for many of the lower level under grad courses I’ve taken. The whole thing just hurts my head.",
      "author": "mother_of_nerd",
      "created": 1619698219,
      "upvotes": 2,
      "replies": {}
    },
    "gwac7vu": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwac7vu/",
      "text": "I feel your pain. I once had a professor who told me “No, anything more than ten minutes of my time is a waste of our time”. I was meeting him after class to set up a time to meet for his office hours. Why even post you have office hours? I had another professor who didn’t have office hours. He also explained that we weren’t allowed to go to the tutoring center. He told the tutors not to help us. If he found out, we would go down for academic dishonesty. So, we could only get help during lab hours. The best part was the TAs couldn’t help us during labs. If the TAs helped most of us with the code, then the students and the TA would go down for academic dishonesty. The TAs were terrified to help. God forbid a couple students work looked the same after they got help from the TA. The professor also made his own Chegg account to answer students questions to catch them that way too. Do I need to mention that 75 students out of 125 got caught cheating and sent to the dean. My class was just one semester. He was also the department head. He would laugh if you said you were going to the dean.",
      "author": "welikt1",
      "created": 1619698074,
      "upvotes": 2,
      "replies": {}
    },
    "gwa4zqk": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwa4zqk/",
      "text": "I don’t actually know the reasons except that I’ve assumed it’s because they can’t find anyone else to teach?? I’ve had one class where the “lecture” was just a robotic voice reading the textbook pages in ppt form. Another “lecture” class just had assigned readings. No ppt or lecture at all. My lowest grade is in creative writing bc my professor grades extremely harsh and subjectively (like, no one gets above a 90. Average is 70). One ASL teacher at my school has TERRIBLE reviews and all of them say that she doesn’t know ASL and is faking. \n\nI *know* that have students complain about the ASL teacher for years and she is still the only teacher for those courses, so I assume they don’t have the option to hire anyone else. But the quality of education needs to be higher if we’re paying thousands of dollars per class. It’s really infuriating.",
      "author": "roseyelephant33",
      "created": 1619692987,
      "upvotes": 3,
      "replies": {
        "gwapgue": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwapgue/",
          "text": "Could also be tenure. We have a professor who teaches outdated material because he never kept up with learning relevant and modern information (for reference, he teaches adobe flash in 2021.. when flash is dead). Also most of his lecture is telling us about random travel stories that are irrelevant to the class. But nobody can do anything about him because he has tenure. The head of the department can speak to him about it and ask him to change his material, but if he doesn't listen then it doesn't do anything.",
          "author": "cabbage-soup",
          "created": 1619705005,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gw9twb0": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9twb0/",
      "text": "Agreed, I have a professor that yelled at a crying student during an online exam and wouldn't help her. She also favors all her other classes more than ours and just reads off the slides that she didn't write. We (class group chat) know she favors other classes because some students are in other classes of this professor and the attitude is a complete 180. We spoke to the department chair and it looked like things were going to change but it changed for maybe a week. This professor also lied to us about the contents of the test and claimed that (over half the class) misunderstood her when she explained the test.",
      "author": "Captain_Hoang",
      "created": 1619682762,
      "upvotes": 2,
      "replies": {}
    },
    "gw9ljod": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9ljod/",
      "text": "I'm at a mediocre university getting my degree after 20 years away from school. The professors seem like they got their degree from some guy on Craigslist. They are completely incompetent and have zero mastery of their subjects. If all the profs I've taken, only 1 seemed to know what she is doing. It's sad that I'm paying all of this money to deal with this epic level of bullshit.",
      "author": "daisuki_janai_desu",
      "created": 1619675819,
      "upvotes": 6,
      "replies": {}
    },
    "gw9f7qm": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9f7qm/",
      "text": "About 3 semesters ago I remember that there were two open positions in my major. Candidates would have interview and such but there was also a presentation of their work as well as their past experiences in the field. Students were highly encouraged to  sit and listen and we were given little evaluation sheets so we could express our thoughts on the potential new professor. I don’t know how much weight they carried but it felt nice to be heard. \n\nI’m not sure if this is normal or not but letting the students interact and ask questions was really nice.",
      "author": "Morning_Frost_",
      "created": 1619671165,
      "upvotes": 5,
      "replies": {
        "gwd0a86": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwd0a86/",
          "text": "This was nice to hear and, to confirm, asking students for feedback on potential hires is normal- I’ve been on several hiring committees and we always have finalists do the kinds of presentations you described, and collect student feedback. \n\nNow, how many/which students are invited to/attend those presentations, how the feedback is collected, and most importantly, how it’s used in the final evaluation is very varied...\n\nIn my experience, I’ve never seen student feedback be the deciding factor, but usually because students felt the same way about the candidates as the committee did.",
          "author": "payattentiontobetsy",
          "created": 1619739288,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gw9d7mi": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9d7mi/",
      "text": "I’m saying this not to be snarky, but to make a point about the historical roots of the profession and clarify why the “system” as others talked about devalues teaching. \n\nThere is a difference between a “teacher” and a “professor.”  Teachers teach, professors profess. You have a professor, not a teacher. \n\nI don’t agree with this, but I’m my career in higher ed, I’ve worked at 40,000 student universities and 1,000 student liberal arts colleges. There is a big difference between faculty at large state schools and SLACs in terms of the focus, interest and importance for promotion of being a good teacher. But I’m all of them, we get very little training on how to teach. \n\n70 years ago, the only place you could find advanced knowledge about chemistry or Latin or law, was at a university, and you had to pay $$$ to have access to that knowledge. All the person had to do was being an expert in their field and, well, profess. 70 years later, that knowledge is a Google search away, but we’re still slowly evolving from that old professor model.",
      "author": "payattentiontobetsy",
      "created": 1619669866,
      "upvotes": -5,
      "replies": {
        "gw9vbyy": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9vbyy/",
          "text": "Knowledge is a google search away? So is a lot of bullshit. Wisdom is knowing the difference. Wisdom is not a google search away. College is where you learn how to discern truth from bullshit, or it should be at least.",
          "author": "big__cheddar",
          "created": 1619684104,
          "upvotes": 6,
          "replies": {}
        },
        "gwbtu6k": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwbtu6k/",
          "text": ">There is a difference between a “teacher” and a “professor.”  Teachers teach, professors profess. You have a professor, not a teacher.\n\nActually, we (society) use that language to \"justify\" paying k-12 educators a lot less than college-level educators. Women make up a majority of the k-12 educational force, while men make up the majority of college-level educators.  It's literally a bunch of white, male-centric language used to justify shitting on our k-12 educators (who, imo, actually deserve to be paid MORE than college-level educators).\n\nAt the end of the day ya'll are educators and you need to do that part of our job - and a lot of you, who are employed as educators at a research facility, don't.",
          "author": "ronwheezy87",
          "created": 1619721269,
          "upvotes": 1,
          "replies": {
            "gwch5mp": {
              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwch5mp/",
              "text": "I want to be 100% clear about what I’m saying:\n\nI completely agree that we as a society greatly devalue K12 teachers in many, many ways. I also (very) strongly agree that that devaluing is rooted in misogyny.  We as a society devalue the work of women in many, many ways, and shitting on K12 teachers, a profession you correctly pointed out is disproportionately held by women, is definitely one of those ways. And , to some degree, overvaluing “college professors” is also an artifact and living example of our institutional and societal misogyny. I do not disagree with that at all. \n\nHowever, in addition to that, there is still a lot of difference between the profession of “K12 teacher” and “college professor.”  And my point was that one of the biggest differences is the amount of training and support higher education faculty get on “how to teach.” I don’t say that as an excuse to defend bad teaching by faculty (I am massively critical of bad teaching at universities), but to point out the reality that the jobs are different and it’s not appropriate to judge a college professor’s teaching skills to those of a K12 teacher. \n\nI know this because I have had careers as both and currently work as a professor in a “teaching first” small liberal arts college, specifically in teacher preparation. I also provide instructional workshops on how to be a better teacher to other faculty at my institution and elsewhere. In general, these standalone workshops are the only formal preparation/training professors get on “how to teach,” and this is at a “teaching first” institution. Professors at larger, research focused institutions get even less. I don’t think most college students realize just how little formal training in pedagogy, instruction, etc. most higher ed faculty get, which was my main point. \n\nI like to point out the semantic difference between he verbs “to profess” and “to teach” as a way of highlighting the way the professor position has traditionally been conceived, which manifests in the job requirements, professional expectations and, in my point above, how much instructional training and support faculty get. \n\nLastly, you also might be surprised at the pay.  I made more money as a K-12 teacher (Middle School ELA) than I do as a college professor... and I wasn’t in a particularly high paying state or district, and I’m in a very good position now- a tenure track assistant professor. You should do a search in r/Professors to hear the horror story of faculty pay for non-tenure track professors.",
              "author": "payattentiontobetsy",
              "created": 1619730550,
              "upvotes": 2,
              "replies": {
                "gwch6nq": {
                  "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwch6nq/",
                  "text": "Here's a sneak peek of /r/Professors using the [top posts](https://np.reddit.com/r/Professors/top/?sort=top&t=year) of the year!\n\n\\#1: [An email I got from a student](https://i.redd.it/dba60mmui2161.png) | [204 comments](https://np.reddit.com/r/Professors/comments/jzsf4r/an_email_i_got_from_a_student/)  \n\\#2: [They're playing hard to get](https://i.redd.it/c7f4iz1q9p651.jpg) | [48 comments](https://np.reddit.com/r/Professors/comments/hejoew/theyre_playing_hard_to_get/)  \n\\#3: [I'm so happy](https://i.redd.it/hvospic4zwi51.jpg) | [80 comments](https://np.reddit.com/r/Professors/comments/ifle8r/im_so_happy/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/joo7mb/blacklist_viii/)",
                  "author": "sneakpeekbot",
                  "created": 1619730562,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gw9b4h0": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9b4h0/",
      "text": "i think because most people attend universities and at universities, professors are valued for the research they do academic writings they publish much more than their ability to teach undergraduate students. At liberal arts colleges, I believe overall these professors view teaching students as more important than professors at universities.\n\nprofessors can suck :( i'm sorry for what ur going through",
      "author": "ThinkingSmash",
      "created": 1619668571,
      "upvotes": 10,
      "replies": {}
    },
    "gw98jz9": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw98jz9/",
      "text": "I had a professor say once “I don’t give a fuck what you say about me cause I have tenure. Anything short of a felony, that then have to prove, I’m staying right here”",
      "author": "historicalily",
      "created": 1619667077,
      "upvotes": 20,
      "replies": {
        "gwaq2ie": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwaq2ie/",
          "text": "My fiance had an art professor with a brain tumor and she would tell them to do one thing then say she told them to do another and failed everyone. He went to the dean and the dean was like:\n\"She has tenure 乁( ⁰͡ Ĺ̯ ⁰͡ ) ㄏ\"",
          "author": "vickyisicky",
          "created": 1619705279,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "gw98hc2": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw98hc2/",
      "text": "Welcome to college, where great professors get laid off and shit ones get tenure.",
      "author": "JohnLeRoy9600",
      "created": 1619667035,
      "upvotes": 13,
      "replies": {}
    },
    "gw8y1y8": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8y1y8/",
      "text": "Tenure… it’s unfortunate because a lot of them know they can’t get fired so they don’t even try. Not all of course but that’s usually how it goes. It sucks for us students when that’s the case.",
      "author": "undercovergrl42",
      "created": 1619661583,
      "upvotes": 15,
      "replies": {
        "gw9v0bf": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9v0bf/",
          "text": "Tenure is not the issue. If teaching was incentivized more than research, better teachers would be tenured and the issues raised in the OP would be better mitigated. Tenure protects academic freedom, so that professors can teach about climate change, racism, capitalism, and other controversial matters without retaliation. Those who want to eliminate tenure bc they want to fire controversial professors do so by claiming it makes professors lazy and out of touch with their students. The issue is disincentivized teaching, not tenure.",
          "author": "big__cheddar",
          "created": 1619683798,
          "upvotes": 10,
          "replies": {
            "gwbyatw": {
              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwbyatw/",
              "text": "Well from my experience these professors I am referring to are not controversial. They just suck at their job or simply don’t care about teaching students just their research. If they can’t do their job right then they shouldn’t be there, but they know they won’t get penalized for it which is the issue I am referring to. A lot of them are a pain in the ass not just for students but also staff. I know because I know advisors that work at a research institution. Lots of complaints. However, that’s why I mentioned that not all of course. Some are able to juggle their responsibilities and do them right. I don’t mind tenure if I feel like I am going to get my money’s worth and the professor cares. The issue is when they are careless and we (the students) suffer or get half ass education from it. We pay a lot of money to be there and it’s important to bring up the issues that also surround this topic. Many abuse that power. Again, not all so both your perspective and mine stand.",
              "author": "undercovergrl42",
              "created": 1619723022,
              "upvotes": 2,
              "replies": {
                "gwc0jus": {
                  "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwc0jus/",
                  "text": "My and your perspective are less compatible than you're suggesting. The issue is incentives. Students like you suffer not because professors abuse tenure. Tenure abuse is the symptom, not the cause. The problem is that tenure is not structured to reward professors for meeting students demands. Students get their money's worth not just from professors who meet their demands but also from professors who are free to deliver truth without retaliation. Professors' working conditions are students learning conditions. That applies no less to tenure incentives than anything else.",
                  "author": "big__cheddar",
                  "created": 1619723890,
                  "upvotes": 5,
                  "replies": {
                    "gwhae3x": {
                      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwhae3x/",
                      "text": "Well clearly there is still an issue with it. Talk to advisors too and they will let you know all about that. It’s not the tenure itself, it’s how they abuse it. We can go on and on forever, but it’s not worth it. You refuse to listen to what I am telling you and it’s fine. No one is saying to abolish tenure. I’m saying the shitty thing that comes from it. I’ve done what I can on my end to provide reviews to professors to get tenure to those who deserve it cause they actually care. But that’s why i responded the way I did to this post. Because this has been my experience and many other students. I do what I can by giving good and bad reviews to those who deserve it cause my main concern are students. It’s not how much these professors believe they bring to the table if the students are saying otherwise. That’s why a lot of the higher education system is fucked up. Fucked up power structures.",
                      "author": "undercovergrl42",
                      "created": 1619822636,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gw8tko3": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8tko3/",
      "text": "i had almost the exact same experience, from the midterm and final making up most of the grade to the millions of unanswered emails. (seriously, he accidentally shared his home screen on his ipad. 23,000 unread emails.) we as a class have also raised concerns to our dean (twice!) but nothings been done. seriously, how hard would it be to make profs take an introduction to teaching class?? maybe then we would at least get our tuition’s worth!",
      "author": "shayyates",
      "created": 1619659483,
      "upvotes": 17,
      "replies": {
        "gw9iop2": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9iop2/",
          "text": "That’s crazy. When I was in CC, there was a class that went to the head of the department about a professor and the professor ended up having to redesign his course and actually going through to see how long the homework was taking. He was a good professor and a good person but yikes",
          "author": "kapbear",
          "created": 1619673653,
          "upvotes": 7,
          "replies": {
            "gw9jmcy": {
              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9jmcy/",
              "text": "god i wish. just thankful my semester is over and i never have to take a class in that department ever again",
              "author": "shayyates",
              "created": 1619674350,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gw8rks4": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8rks4/",
      "text": "I’m a professor, who left to do student success coaching because this is something I could not grasp. I was a good professor. But it’s a job where the good ones get paid the same as the bad ones so the good ones just end up burning out from all that they do and the injustice of it.",
      "author": "angelinuta",
      "created": 1619658533,
      "upvotes": 59,
      "replies": {}
    },
    "gw88ze4": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw88ze4/",
      "text": "Just curious: Why you think you’re owed the class average. \n\nFollow-up: Let’s say the average was low. Why do you think you’re owed a curve?",
      "author": "TimeAverage",
      "created": 1619649513,
      "upvotes": -22,
      "replies": {
        "gw8asjp": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8asjp/",
          "text": "Why should a class average be a secret? \nAs for a curve, I wouldn't ask for one had the professor had realistic expectations for us. I don't see how a professor cannot take any ounce of responsibility for the majority of students failing. To fail the class and have to retake it, delay graduation, and turn down job offers because of this seems like a punishment to me. I don't think I am owed a curve, but I also don't think I should be punished for negligence on the professor's part.\n\nEdit: I would like to say that the reason I was upset about the class average situation was more so because the professor did not respond to my email at all. I would have been perfectly content if he had told me he was not willing to provide it or had not calculated it.",
          "author": "GreenEqualiTea",
          "created": 1619650378,
          "upvotes": 14,
          "replies": {
            "gw8hz2c": {
              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8hz2c/",
              "text": "\" Why should a class average be a secret? \"\n\nThat's is a circular argument and you don't answer a question with a question.\n\n\"As for a curve, I wouldn't ask for one had the professor had realistic expectations for us.\"\n\nIt is not your expectations that need to be met to pass a course. If we only ever gave you things that were easy and you knew what is the point of taking a class, you would never learn anything.\n\n\"I don't see how a professor cannot take any ounce of responsibility for the majority of students failing.\"\n\nProbably because they were not the one taking the test  ¯\\\\\\_(ツ)\\_/¯ \n\nWe aren't there to make you happy and give everyone what they want. We are there to guide, set objectives, and evaluate your progress to those objectives. Some groups do better than others.  When I taught undergrads I would have semesters where my distribution skewed left and then I would have semester where it skewed heavily right. I did nothing different and even used the same exams. The difference? The students. \n\nIn the end, after more than a decade with undergrads I summed all of my distributions and you know what I discovered? For all of the complaints of classes being impossible and everyone failing my distribution was a beautiful bell curve.  Centered over a low C. Or, as we call it A-Excellent, B-Good, C-Average, D-Below Average, and F-Failing. Shockingly, on average people were average.",
              "author": "Doctor_HowAboutNo",
              "created": 1619653852,
              "upvotes": -14,
              "replies": {
                "gw8k8ae": {
                  "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8k8ae/",
                  "text": "\n\"We aren't there to make you happy and give everyone what they want\"\n\nNo, but professors are there to teach me and \"guide\" me as you say. I have not gotten this from my professor. I made this post to rant about my frustrations that professors are not held accountable for doing their jobs. I am allowed to be frustrated with paying a professor who doesn't even have the decency to meet with me in office hours, respond to my emails, or adequately explain to me why my work did not meet their standard and what the correct answer would be. These are bare minimums that I request in a professor which have not been met and my main points of complaint. That being said you are entitled to your opinion as I am to mine, so I hope you have a nice day.",
                  "author": "GreenEqualiTea",
                  "created": 1619654944,
                  "upvotes": 9,
                  "replies": {
                    "gw8y7dx": {
                      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8y7dx/",
                      "text": ">These are bare minimums that I request in a professor which have not been met and my main points of complaint. That being said you are entitled to your opinion as I am to mine, so I hope you have a nice day.\n\nAh, the consumer driven model. It is unfortunate so many subscribe to this model as it is ruining education. No, we do not owe you to meet your expectations and to give you the grade you want. \n\nThe only argument you might have is they are not fulfilling the university requirements for office hours and since you did not cite such other than to say they don't without providing what their syllabus says and what the university says means they probably are and you are just not utilizing them. \n\nThere is a bit of difference, your opinion is not one based on knowing anything about the structure and model of the system. Rather, it is based on what you want to be given. If you want to learn something you would pay attention to people who can actually tell you what is going on rather than just rallying around your complaining without knowing anything about how Universities work.",
                      "author": "Doctor_HowAboutNo",
                      "created": 1619661654,
                      "upvotes": -8,
                      "replies": {
                        "gw8znqh": {
                          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8znqh/",
                          "text": "Have you ever heard the saying that assumptions make an ass out of you and me? You seem to be doing a lot of that. I have done you the justice of not making judgements on the type of professor or person you are and hoped you could have the kind courtesy to do the same for me. Maybe you should ask yourself if you are projecting onto me. But this is the last of your responses that I will be reading or responding to. So really have a good day, and if you are not capable, have a day.",
                          "author": "GreenEqualiTea",
                          "created": 1619662359,
                          "upvotes": 6,
                          "replies": {
                            "gw9ae8o": {
                              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9ae8o/",
                              "text": "Don't even pay that miserable person any mind. \n\nTheres a few shitty, miserable professors that hate their life and job. So they lurk here and comment dumb shit, to feel smart smh. And they wonder why they're so miserable lol\n\nThat perosn you were responding too is obviously one of those shitty professors. Otherwise this post would not have bothered them. Hit dogs will holler lol",
                              "author": "Throwaaawaayyy123456",
                              "created": 1619668140,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gw8ygot": {
                      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8ygot/",
                      "text": "Also looks like your puppet account got their post deleted in AskProfessors. That should tell you something.",
                      "author": "Doctor_HowAboutNo",
                      "created": 1619661780,
                      "upvotes": -8,
                      "replies": {
                        "gw9qozs": {
                          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9qozs/",
                          "text": "You're a professor, right? You have to be at least in your early-mid 30's, but you still argue online with teenagers like a fucking loser. I don't really agree with OP, but you come off as absolutely insufferable.",
                          "author": "aminodumpster",
                          "created": 1619679934,
                          "upvotes": 4,
                          "replies": {
                            "gwauxyj": {
                              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwauxyj/",
                              "text": "Not agreeing with a misguided and obviously fabricated rant while explaining how College actually works is not what one would call arguing. Correcting people, however, is rarely popular to misguided mobs.",
                              "author": "Doctor_HowAboutNo",
                              "created": 1619707428,
                              "upvotes": 0,
                              "replies": {
                                "gwav78o": {
                                  "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwav78o/",
                                  "text": "Nah, dude. You're a petty bitch. Especially in that comment I responded to.",
                                  "author": "aminodumpster",
                                  "created": 1619707537,
                                  "upvotes": 0,
                                  "replies": {
                                    "gwaw3mm": {
                                      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwaw3mm/",
                                      "text": "Nicking someone's sock puppet that is spamming for Karma is hardly what one would call petty.",
                                      "author": "Doctor_HowAboutNo",
                                      "created": 1619707919,
                                      "upvotes": 0,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gw98tuv": {
                  "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw98tuv/",
                  "text": ">We are there to guide, set objectives, and evaluate your progress to those objectives.\n\nThis is false advertising lol they barely scratch the surface\n\nImagine students paying thousands to attend only for ppl to tell them the profs don't owe them anything n don't need to take responsibility and instead project it onto the student n assume the students aren't trying. classic move. \n\nyes they DO owe us",
                  "author": "Letmetellyouabtlyfe",
                  "created": 1619667232,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "gw8e42v": {
              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8e42v/",
              "text": "I think you’re missing the operative root word in “Professor” (contrast that with “Teacher”). There’s a standard that you have to meet in order to pass the class. If you did poorly in the class, have you considered the possibility that you didn’t meet the standard? If the professor passes everyone, despite clear evidence that they do not possess the requisite knowledge/skill, do you understand that a variety of stakeholders suffer? Your university produces a substandard graduate. The value of all present and future degrees are devalued, etc. Have you considered any of the downstream consequences of constantly curving grades? Or do you just want your piece of paper so that you can move on?",
              "author": "TimeAverage",
              "created": 1619651983,
              "upvotes": -16,
              "replies": {
                "gw8f9zo": {
                  "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8f9zo/",
                  "text": "I am aware of all of these things and agree that professors shouldn't pass students who don't understand the course material. My issue is that several of my classmates and I do understand. My tutor knows I understand the material, and I have never been afraid to work hard to earn a good grade. I have read the book, seen multiple tutors, done extra problems, watched YouTube videos on the subject, etc. to learn all I can and understand the material. I have never complained about a professor in the past and have always been one to love the professors everyone else hates for being too tough. But I am being genuine in my feeling that the professor expects too much of us for our level. I understand that you are a stranger and have no reason to take my word sincerely, but sometimes the professor is the issue.",
                  "author": "GreenEqualiTea",
                  "created": 1619652545,
                  "upvotes": 10,
                  "replies": {
                    "gw8h3mm": {
                      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8h3mm/",
                      "text": "Of course the professor can be the issue! And it’s great that you read the book and practiced with a tutor! But when it was time for your skills to be assessed, did you competently accomplish the task? If so, you have a valid complaint.",
                      "author": "TimeAverage",
                      "created": 1619653431,
                      "upvotes": -13,
                      "replies": {}
                    }
                  }
                },
                "gw982yd": {
                  "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw982yd/",
                  "text": ">“Professor” (contrast that with “Teacher”)\n\nAll i know is they both need to teach WELL.",
                  "author": "Letmetellyouabtlyfe",
                  "created": 1619666809,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gw7uvp3": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw7uvp3/",
      "text": "[deleted]",
      "author": null,
      "created": 1619643159,
      "upvotes": 8,
      "replies": {
        "gw8tkgu": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw8tkgu/",
          "text": "And possibly tenure as well.",
          "author": "BYFUGLlEN",
          "created": 1619659481,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gw7udkj": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw7udkj/",
      "text": "You all need to go to the department and complain. ALL OF YOU! Cause this isn’t right and talk to your graduate tutor and make sure you have him chime in too. \n\n\nThis is a necessary evil you have to take down cause fuck that guy.",
      "author": null,
      "created": 1619642947,
      "upvotes": 16,
      "replies": {
        "gwagxtj": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwagxtj/",
          "text": "Power in numbers! If at least half the class complains over the same thing they have got to take notice",
          "author": "Analyst_Unlucky",
          "created": 1619700793,
          "upvotes": 4,
          "replies": {
            "gwb1z7d": {
              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwb1z7d/",
              "text": "Exactly!",
              "author": null,
              "created": 1619710396,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gw7o77l": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw7o77l/",
      "text": "Partly because teaching is hugely devalued throughout the history of American higher education; professors get little to no training for teaching, and are largely evaluated on their ability to do research and not on their teaching (at least at most universities). They receive little incentives to do well in teaching. If you have professors who are outstanding teachers they might put a ton of effort in and receive little extrinsic award for doing so. \n\nI'm sorry you have a professor who is seemingly doing a terrible job. That is demotivating and a waste of your time and money.",
      "author": "ReluctantAcademic21",
      "created": 1619640389,
      "upvotes": 155,
      "replies": {
        "gw7oj9u": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw7oj9u/",
          "text": "I totally agree with this. I wish we could change the system because both teachers and students would benefit from putting a higher value on teachers.",
          "author": "GreenEqualiTea",
          "created": 1619640529,
          "upvotes": 41,
          "replies": {
            "gw7q519": {
              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw7q519/",
              "text": "YES! Everyone would benefit. I wonder how this change would come about. I wonder if this kind of shift has happened in other types of professions.",
              "author": "ReluctantAcademic21",
              "created": 1619641212,
              "upvotes": 13,
              "replies": {}
            }
          }
        },
        "gw87o9j": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw87o9j/",
          "text": "This is true for research-oriented universities. One way to get around that is to go to a liberal arts university, which usually has much more focus on teaching and professors are actually trained and evaluated on their ability to teach students well.",
          "author": "WitnessNo8046",
          "created": 1619648894,
          "upvotes": 24,
          "replies": {}
        },
        "gwhgul2": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwhgul2/",
          "text": "Adding on to this, educators tend to be held to higher standards than most people. In grammar school, a teacher (not at my school) got fired because she was dressing “provocatively” ie a pencil skirt, blouse and high heels, something that you’re allowed to wear in any other profession. \n\nThat doesn’t exist in a professorship. A teacher can get fired for talking about their political beliefs because it’s corrupting kids or trying to influence them. Yeah there is a difference between saying “bill clinton got impeached on perjury not an affair” and saying “bill Clinton is a pervert monster and everybody who voted for him is an idiot” however. In college, nobody reports it. \n\nIt’s easy to get carried away with the amount of power you have as an educator in college when you can get away with way more than a normal teacher.",
          "author": "CapriciousSalmon",
          "created": 1619825971,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gw7kdc0": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw7kdc0/",
      "text": "I'm a junior in college and I feel like this is pretty normal. Definitely not a good thing, but normal. I currently have a professor that wont post any of our grades and there's no way of knowing how you're doing in the class until the last day of the semester. \n\nAll I can say is get used to teaching yourself everything in college. You can't count on professors to help you learn any of the material. They're really just there to give you an arbitrary grade at the end of the semester. Not how it should be, but just the way it is.",
      "author": "Sir_JMo_III",
      "created": 1619638791,
      "upvotes": 61,
      "replies": {
        "gw7lnek": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw7lnek/",
          "text": "I'm graduating this semester and have not had these issues in the past (at least this bad). I've taught myself classes before but never had a professor willing to fail nearly everyone.",
          "author": "GreenEqualiTea",
          "created": 1619639324,
          "upvotes": 25,
          "replies": {}
        },
        "gw9ebx4": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9ebx4/",
          "text": "That is awful. I teach at a community college, and I hope no one ever feels that way about my classes. Yikes! I hope you find great professors in the future!",
          "author": "inamedacatVlad",
          "created": 1619670582,
          "upvotes": 15,
          "replies": {
            "gw9ik5n": {
              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw9ik5n/",
              "text": "My community college professors were amazing!! I miss them so much. Remembering my name, grading anything, coming to lab.... I truly took it for granted.",
              "author": "kapbear",
              "created": 1619673564,
              "upvotes": 12,
              "replies": {}
            },
            "gwc4px9": {
              "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gwc4px9/",
              "text": "honestly every class i've taken with a CC has been great and Profs have always shown more consideration when it comes to communication. I think there's so much more accountability and interaction that goes on with CC's and I sort of feel bad for students who didn't get that experience and went straight to a four year.",
              "author": "infinite_frogs",
              "created": 1619725483,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gw7fxzk": {
      "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw7fxzk/",
      "text": "I majorly feel this right now I’m in my first semester of college and I can’t believe how bad some professors are ?? Like how can you not answer questions it’s literally your job. There’s been several questions I’ve proven to my teacher have the wrong “correct answers” so the computer grades us wrong and she has done nothing to fix it. I hope the dean does something about your teacher. I’m very tempted to say something to mine there’s just so much crap my professors have done I don’t even know if I can remember it all.",
      "author": "Cooch_2119",
      "created": 1619636912,
      "upvotes": 22,
      "replies": {
        "gw7jodo": {
          "link": "/r/CollegeRant/comments/n0lkf6/why_are_professors_allowed_to_be_so_bad_at_their/gw7jodo/",
          "text": "Sorry to hear about your professor. My suggestion would be to not say anything if you are going to pass the class. Try to save your complaints for the ones you really need it for so they don't see you as the boy who cried wolf. That being said, write all your complaints in the student evaluations and hope something changes for the better.",
          "author": "GreenEqualiTea",
          "created": 1619638499,
          "upvotes": 9,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634062597
}