{
  "sid": "rc3332",
  "link": "/r/CollegeRant/comments/rc3332/i_failed_my_first_class_today_and_i_feel_like/",
  "title:": "I failed my first class today and I feel like such a fucking idiot and failure",
  "text": "It was some dumb number theory course I didn’t even need to take, but my advisor told me it’d be easy to pass for a math credit. This was the hardest class I’ve ever taking in my life. I’m a junior and I’ve never failed an assignment unless I just didn’t turn it in. I constantly failed homework in this class. \n\nI failed our 2 midterm exams and our final. I spent all week prepping for this final. If I wasn’t in class I was at the library studying and practicing. I had like 2 meals in the last 3 days because I was so busy getting ready. I didn’t even study for my other exams because I had As and at worst I go down to Bs.\n\nThis final was the difference between a D (passing for my university) and an F and I got a 51. I have never felt so stupid in my life. I don’t get how I can devote a so much time to studying for this class and still not know what to do on the exam. I’m such a fucking dumbass.",
  "author": "dogbraincarchase",
  "created": 1639003603,
  "updated": 1639517935,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hnsrxcj": {
      "link": "/r/CollegeRant/comments/rc3332/i_failed_my_first_class_today_and_i_feel_like/hnsrxcj/",
      "text": "Been there and done that, keep your head up man. I know how you feel and there’s no point in dwelling on it, what’s done is done. Now you should take a look at your study habits and figure out what went wrong and make the appropriate adjustments to make sure this doesn’t happen again. Learn from your mistakes",
      "author": "Ruthless_Aj",
      "created": 1639015005,
      "upvotes": 4,
      "replies": {}
    },
    "hnt8o4p": {
      "link": "/r/CollegeRant/comments/rc3332/i_failed_my_first_class_today_and_i_feel_like/hnt8o4p/",
      "text": "I’m guessing you have other finals this week. \n\nOnce you are finished, *please* report the advisor! If you feel it necessary, do so anonymously. There are a number of reasons that advisor may have said that to you, (ranging from ignorance to malicious, with nothing positive in between). \n\nBe sure to copy the next level of administration.\n\nSo sorry you experienced this, and best of luck to you.",
      "author": "cajunsoul",
      "created": 1639022746,
      "upvotes": 0,
      "replies": {
        "hntkdrk": {
          "link": "/r/CollegeRant/comments/rc3332/i_failed_my_first_class_today_and_i_feel_like/hntkdrk/",
          "text": "Uh sorry if this sounds dumb but why should OP report the advisor? We can just report them if our classes are wrong?\nHad I known.... On my very first semester one advisor recommended me to take a geometry class (a class that I found out later I didn't even need nor counted towards my degree). Just remembering the out of station tuition I had to pay for that joke of a class, Jesus... Had I known I could, I would have reported her",
          "author": "WilieFern",
          "created": 1639029294,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  }
}