{
  "sid": "o3jpvv",
  "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/",
  "title:": "Tying to get ahead in my 8-week history class so I can visit my sick grandpa. Exhausted.",
  "text": "I’m in two other 8-week classes, as well. I have to be enrolled in this much so I can transfer on time. I don’t have lectures for two of the classes so I’m legit just reading the digital textbook and taking notes. My eyes burn so badly even though I take breaks & use glasses. I have to read two chapters per week along with other assignments on top of that for history alone and I’ve been trying to get a bit ahead so I can have less assignments to worry about when I visit my grandpa. It takes a full day of driving to get there, so that’s already two days on no work. I’m going to have to fit in time to read/do hw whenever I can there instead of just focusing on spending time with my 99 year old grandpa with worsening dementia. \n\nI know I have a choice and *could* just do nothing while I’m there and let my grades drop, but I’m have anxiety & hate letting people down. I want to do well & show my professors that I care.😔",
  "author": "roseyelephant33",
  "created": 1624119669,
  "over_18": false,
  "upvotes": 128,
  "upvote_ratio": 0.96,
  "comments": {
    "h2ebjv0": {
      "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2ebjv0/",
      "text": "That sounds tough. You’re doing great btw. \n\n\nHang with gramps is my advice. Listen to his stories. Get him his favorite foods (in moderation). Take pictures. I wish I had more pictures. \n\n\nI lost my brother and grandpa about 15 years ago while in college. I wish I could go back and take a year off to hang with them instead of being in those classes. I miss them every day and I haven’t cared about my GPA until this post reminded me how much I worked for it. \n\n\nMy mom definitely doesn’t care. \nMy dad has never once asked. \n\n\nI agree with seeing your Professors and also communicate with them. So much can be avoided with clear and direct communication. Some Professors do take themselves too seriously but most are understanding.",
      "author": "mashate",
      "created": 1624163906,
      "upvotes": 6,
      "replies": {
        "h2f15jf": {
          "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2f15jf/",
          "text": "He had a really good day last time, remembered everything. Though he was crying about not seeing family enough and missing us all. He also got chocolate ice cream in the hospital and was overjoyed at that.🥲 \nThank you for sharing and I’m so sorry for your loss. Rationally I know that my GPA honestly doesn’t matter *that much*, & your comment helps me see that.",
          "author": "roseyelephant33",
          "created": 1624187079,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h2dpv6q": {
      "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2dpv6q/",
      "text": "You've probably already checked, but I'll drop this here anyway: check the syllabus and any announcements from the professor to see if you are allowed to use the text and any other provided resources during tests. I've noticed that several of my classes so far have allowed it, because they don't ask straight fact questions so much as a combo of fact and interpretation questions. I've had at least one class that utilized documentaries from Films on Demand, which have an option to download the transcripts of the documentaries. \n\n\nMy point is, IF you're allowed to use the text on tests, read through the relevant readings once during the week, and once right before the test. Then, have the digital text open and use the search function in the reading app if you're unsure of anything. This won't work out for you if you don't read and understand the material beforehand though. I just figure it'll save you time and eyestrain on note-taking.\n\n\nSpeaking of eyestrain, look into getting cheap blue-light filter reading glasses from a website like Zenni or whatever. They're amazing.\n\n\nEdit: paragraph spacing",
      "author": "Daughter_of_Anagolay",
      "created": 1624150630,
      "upvotes": 2,
      "replies": {
        "h2f1e0a": {
          "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2f1e0a/",
          "text": "I can do that for quizzes but not tests, sadly. I am in a public speaking class, so I have to film myself and write speeches. I have to do one while I’m visiting as it is due next week (I don’t feel the need to ask for an extension as I can get it done). For my history class, my tests have essay portions and MC, no open book. I really wish it were…memorizing random details in case they’ll be on the test doesn’t help me understand the material in the long-term.\n\nI do have blue-light glasses for the computer and also have a blue-light filter in my regular prescription, though I’ll admit I don’t wear them enough. \n\nThanks for your comment. I do love the search function during quizzes.🙂",
          "author": "roseyelephant33",
          "created": 1624187296,
          "upvotes": 2,
          "replies": {
            "h2f2fnc": {
              "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2f2fnc/",
              "text": "The search function is my favorite thing ever. I bought physical books for my current classes just out of paranoia, but I think next time I'll just go full digital. \n\nDo they give you some sort of study guide at least? Sounds like you're taking an upper division class; my upper division classes have tests like that too. When they do provide study guides, I type my notes into them as I go through lectures and readings.",
              "author": "Daughter_of_Anagolay",
              "created": 1624188214,
              "upvotes": 1,
              "replies": {
                "h2f38hu": {
                  "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2f38hu/",
                  "text": "It’s American History I 💀. There is a section for study guides that is empty, so I guess he hasn’t made them. They’d be helpful for notes so I knew exactly what to write down!",
                  "author": "roseyelephant33",
                  "created": 1624188898,
                  "upvotes": 3,
                  "replies": {
                    "h2f3gzp": {
                      "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2f3gzp/",
                      "text": "EW I hated American History even in high school. I think I have to take it in college as part of my minor though 🙃\n\nOof definitely email him about the study guides. They're super helpful.",
                      "author": "Daughter_of_Anagolay",
                      "created": 1624189091,
                      "upvotes": 2,
                      "replies": {
                        "h2f48pi": {
                          "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2f48pi/",
                          "text": "I hated “world history” in HS. Took college level version but didn’t end up counting since I switched schools. Do not enjoy this class, LOL. Thanks for the convo, though. I’m sending an email ASAP! Give me the study guides, man!",
                          "author": "roseyelephant33",
                          "created": 1624189732,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h2d057l": {
      "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2d057l/",
      "text": "I agree with eilig. You should definitely talk to your professor. This is a situation involving family so you should see if you can get an extension.",
      "author": "Best_Bisexual",
      "created": 1624136088,
      "upvotes": 10,
      "replies": {
        "h2d85zt": {
          "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2d85zt/",
          "text": "Thank you💜",
          "author": "roseyelephant33",
          "created": 1624140421,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h2cquo3": {
      "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2cquo3/",
      "text": "Go to your professors’ office hours and tell them about your grandfather. If office hours aren’t an option, send them all emails. See if you can maybe get an extension or two on the assignments that are due while you’re with your grandpa. I’m sorry you’re stressed. It’s worth a shot to see if some will give you some leniency, even if it’s just one class out of the three.",
      "author": "eilig",
      "created": 1624131166,
      "upvotes": 31,
      "replies": {
        "h2d88kc": {
          "link": "/r/CollegeRant/comments/o3jpvv/tying_to_get_ahead_in_my_8week_history_class_so_i/h2d88kc/",
          "text": "Thanks. I didn’t even consider that for some reason. I get so nervous asking for extensions or accommodations but I will.",
          "author": "roseyelephant33",
          "created": 1624140463,
          "upvotes": 12,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064350
}