{
  "sid": "reilb8",
  "link": "/r/CollegeRant/comments/reilb8/feeling_like_a_failure/",
  "title:": "Feeling like a failure",
  "text": "Just a little vent so I don’t spiral:   \n\nI maintained a 4.0 all throughout freshman year with minimal effort.   \n\nNow as a sophomore (before my final exams are graded) I will be ending with a mix of A’s, B’s and C’s. I feel like I worked significantly harder this semester and yet still didn’t get the results I wanted. I don’t know what to do. \n\nMy predicted GPA after this semester will be close to a 3.6 which is barely enough to keep me in good academic standing for my colleges honors program.   \n\nI’m premed so that’s also a concern and I just feel so hopeless and stressed.\n\nI cannot afford to have another bad semester.   \n\nI just feel like all my life I was told I was “smart” and “gifted” and I had the grades to back those statements up but this is the first year in which I’ve felt painfully mediocre and I don’t know how to deal with that.",
  "author": "hshbsbaj-x",
  "created": 1639289119,
  "updated": 1639517885,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.86,
  "comments": {
    "ho7yroh": {
      "link": "/r/CollegeRant/comments/reilb8/feeling_like_a_failure/ho7yroh/",
      "text": "Trust and believe that I get how you’re feeling right now. I’ve been going through the same thing. Never thought that being told that I’m “smart” was gonna bite me in the butt so hard.",
      "author": "stfleu",
      "created": 1639292603,
      "upvotes": 5,
      "replies": {}
    },
    "ho84brs": {
      "link": "/r/CollegeRant/comments/reilb8/feeling_like_a_failure/ho84brs/",
      "text": "what is the A rate in the US.",
      "author": "Ok_Scientist_691",
      "created": 1639296908,
      "upvotes": 1,
      "replies": {}
    },
    "hocto6l": {
      "link": "/r/CollegeRant/comments/reilb8/feeling_like_a_failure/hocto6l/",
      "text": "Ugh, I feel your pain. First of all though, you're not a failure. Just look around Reddit, your school's groupchats, etc. This semester absolutely wrecked most people. I don't know one person who's truly \"doing okay.\" You're doing well :)\n\nSecond, if I can offer any advice as someone who also panics over my GPA for my school's honours program, don't worry too hard about the GPA to the point that it's stressing you out or you can't focus. You're still a semester away from applying for the honours program (assuming you guys apply for honours in the spring of second year like we do) the more classes you take, the more your GPA will likely even out. Don't stress, just set yourself up for success next semester",
      "author": "acrylicvigilante_",
      "created": 1639382180,
      "upvotes": 1,
      "replies": {
        "hoctp2q": {
          "link": "/r/CollegeRant/comments/reilb8/feeling_like_a_failure/hoctp2q/",
          "text": "\nHello! You have made the mistake of writing \"ect\" instead of \"etc.\"\n\n\"Ect\" is a common misspelling of \"etc,\" an abbreviated form of the Latin phrase \"et cetera.\" Other abbreviated forms are **etc.**, **&c.**, **&c**, and **et cet.** The Latin translates as \"et\" to \"and\" + \"cetera\" to \"the rest;\" a literal translation to \"and the rest\" is the easiest way to remember how to use the phrase. \n\n[Check out the wikipedia entry if you want to learn more.](https://en.wikipedia.org/wiki/Et_cetera)\n\n^(I am a bot, and this action was performed automatically. Comments with a score less than zero will be automatically removed. If I commented on your post and you don't like it, reply with \"!delete\" and I will remove the post, regardless of score. Message me for bug reports.)",
          "author": "ectbot",
          "created": 1639382200,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}