{
  "sid": "qhdery",
  "link": "/r/CollegeRant/comments/qhdery/how_can_someone_be_so_clueless_constantly/",
  "title:": "How can someone be so clueless constantly",
  "text": "Honestly I almost feel jealous of people who are fucking clueless, so ignorant, with their head so deeply shoved up their own ass that they just simply don’t give a fuck how their actions affect other people, or literally just have never learned the art of self reflection. Must be peaceful and nice. \n\nMy roommate is actually fucking horrible and I basically am a commuter now because I just cannot live with this bitch anymore. I had read roommate horror stories before but wow. This is my reality and I fucking hate her bro. Like god she’s just awful she has clearly never lived with anyone she slams shit and turns on lights when I’m trying to sleep and plays loud music, never lets me know when she will be back, could be 8 pm, could be midnight, could be 4 am. Then she comes in when I’m sleeping, turns on lights and slams down her shit, plays videos on her phone, takes fucking phone calls at 1 am. Like wow. I am truly amazed this person is in college. 6 year olds act like this. Not 20 year olds. \n\nAnyways I just needed to rant because I’m about 2 seconds away from just telling her she fucking sucks and if she acts like this throughout her whole life then people will really hate her. She lives in her own little world in her head and no one else matters. I swear she forgets I’m even in the same room with her.",
  "author": "anonymouslambclown",
  "created": 1635390080,
  "updated": 1636193194,
  "over_18": false,
  "upvotes": 63,
  "upvote_ratio": 0.98,
  "comments": {
    "hidqb44": {
      "link": "/r/CollegeRant/comments/qhdery/how_can_someone_be_so_clueless_constantly/hidqb44/",
      "text": "Probably begin by calmly telling her how her actions are affecting you. Higher chance of success",
      "author": "thicckar",
      "created": 1635429351,
      "upvotes": 16,
      "replies": {}
    },
    "hicotyo": {
      "link": "/r/CollegeRant/comments/qhdery/how_can_someone_be_so_clueless_constantly/hicotyo/",
      "text": "What she say?",
      "author": "depressedbuttermilk",
      "created": 1635403701,
      "upvotes": 3,
      "replies": {}
    },
    "hieii7r": {
      "link": "/r/CollegeRant/comments/qhdery/how_can_someone_be_so_clueless_constantly/hieii7r/",
      "text": "r/roommates but I’d like to point out you mentioned “6 year olds act like this, not 20 year olds”. You’re also acting like a 6 year old to me. You’re an adult, address the situation like one. Have a calm constructive conversation with her.  If you’re in a dorm you can also talk to the supervisor.",
      "author": "hannahc99",
      "created": 1635440746,
      "upvotes": 1,
      "replies": {
        "hifhd0z": {
          "link": "/r/CollegeRant/comments/qhdery/how_can_someone_be_so_clueless_constantly/hifhd0z/",
          "text": "Interesting reaction to this post. You judge and insult OP based on assumptions. To me, that is childish.",
          "author": "okaynextcrisis",
          "created": 1635454506,
          "upvotes": 4,
          "replies": {}
        },
        "hifa66w": {
          "link": "/r/CollegeRant/comments/qhdery/how_can_someone_be_so_clueless_constantly/hifa66w/",
          "text": "I have talked to her. She doesn’t change. And it’s an off campus apartment and I’m stuck in the lease. I don’t think ranting on a rant forum is acting like a 6 year old. If I were doing things on purpose to annoy her and be petty, then yeah I’d be acting like a 6 year old. I’ve been extremely patient with her. She’s just an asshole.",
          "author": "anonymouslambclown",
          "created": 1635451624,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hifhzwk": {
      "link": "/r/CollegeRant/comments/qhdery/how_can_someone_be_so_clueless_constantly/hifhzwk/",
      "text": "I feel your frustration, OP. If you haven’t already, speak with the apartment complex management about the situation. Unfortunately, not everything can be resolved and you may end up waiting out the lease. I wish you the best. You deserve a peaceful home.",
      "author": "okaynextcrisis",
      "created": 1635454764,
      "upvotes": 1,
      "replies": {}
    },
    "hifsipt": {
      "link": "/r/CollegeRant/comments/qhdery/how_can_someone_be_so_clueless_constantly/hifsipt/",
      "text": "This is why I refuse to have a roommate. I’m lucky enough to still live at home but when I move out it’ll be to a single bedroom apartment. Only way I will live with someone is if I’ve had a boyfriend for a couple years",
      "author": "randay17",
      "created": 1635459261,
      "upvotes": 4,
      "replies": {}
    },
    "hig461m": {
      "link": "/r/CollegeRant/comments/qhdery/how_can_someone_be_so_clueless_constantly/hig461m/",
      "text": "My roommate stormed into our room while I was studying and yelled at me until I cried, causing me to fail a midterm. So I feel you.",
      "author": "sthedragon",
      "created": 1635464621,
      "upvotes": 2,
      "replies": {}
    }
  }
}