{
  "sid": "r3t8av",
  "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/",
  "title:": "I don't fucking understand college",
  "text": "After 2 miserable years, multiple failure s, a pandemic, I can't still fucking figure out how to do college . I wanna get this bullshit degree done,make bucks and smash but idk wtf am doing wrong neither know why.i wish I could take trades but I want big shit fast and got ppl on my ass. Uni doesn't do shit to help fuck counselors, any body got some fucking ideas? I failed clep even fuck",
  "author": "chicityhopper",
  "created": 1638065543,
  "updated": 1638207520,
  "over_18": false,
  "upvotes": 95,
  "upvote_ratio": 0.85,
  "comments": {
    "hmcnffk": {
      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmcnffk/",
      "text": "I’d hate to break it to you, but getting a degree doesn’t guarantee good money.",
      "author": "Spicybooiii",
      "created": 1638066193,
      "upvotes": 63,
      "replies": {
        "hmcuftt": {
          "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmcuftt/",
          "text": "I know chico",
          "author": "chicityhopper",
          "created": 1638069661,
          "upvotes": -33,
          "replies": {}
        }
      }
    },
    "hmdukhy": {
      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmdukhy/",
      "text": "Here's what you're doing wrong:\n\nFirst, you're way too confident in your ability. You're not a genius and you're not supposed to be. You're in school for a reason.\n\nSecond, the reason you're in school is to learn. Stop thinking it's a golden ticket because it's not. It's what you do with the knowledge you learned that will get you those \"big bucks.\"\n\nThird, you need to take the time to do these things yourself. Talk to your professor, learn about the industry you want to go into, start making plans. \n\nFourth, no one owes you shit. \n\nFifth, it sounds like you need to eat some humble pie. You're not going to get anywhere in any industry with an attitude that says, \"everyone is wrong but me.\"",
      "author": "thazmaniandevil",
      "created": 1638092939,
      "upvotes": 38,
      "replies": {}
    },
    "hmctpj0": {
      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmctpj0/",
      "text": ">make bucks and smash\n\n>I want big shit fast\n\n>bullshit degree\n\nYou are wasting your time and money.",
      "author": "varaaki",
      "created": 1638069295,
      "upvotes": 60,
      "replies": {
        "hmcumg4": {
          "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmcumg4/",
          "text": "Ik that I spent 10k and failed",
          "author": "chicityhopper",
          "created": 1638069752,
          "upvotes": -28,
          "replies": {
            "hme92jm": {
              "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hme92jm/",
              "text": "Right. So... stop doing more of that. The fact you wasted 10k isn't a reason to go keep wasting another 10k or 20k or however long it takes for you to figure out that you don't actually want to do this.",
              "author": "BarackTrudeau",
              "created": 1638104107,
              "upvotes": 14,
              "replies": {
                "hmgxcma": {
                  "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmgxcma/",
                  "text": "Ik",
                  "author": "chicityhopper",
                  "created": 1638145992,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmcpda1": {
      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmcpda1/",
      "text": "That's your problem: you want big and expensive things in the easiest way, which is perhaps contradictory.\n\nHonestly, I don't blame you – I am a Computer Science student, and when I'm taking general education courses they are essentially just sitting for a few hours copy-pasting slides from an outdated and ugly formatted PowerPoint. Sometimes you watch movies or shitty videos, like... wtf, seriously? When the exam comes, I need to memorize a lot of random shit. You don't even analyze nor think; you just literally memorize.\n\nMeanwhile, in my computer science class we read the mathematical and computational theory of an algorithm or a data structure, etc. Then we analyze how it works, and eventually we try to translate those ideas to code. Sometimes it works; sometimes it doesn't. You use APIs... Man, I love my degree because it makes me think – it has complex math, it has code and such things could be applied literally anywhere. I got to the point in which I just enjoy and have a need to learn more concepts. I sure want to materialize my effort, but it'd be a poor mentality to just care about money.\n\nTry to find something you actually enjoy, or change the way you've been doing things if you don't have another option – take more notes, take less classes if required so can organize your work schedule. Do things different, I'm sure it's possible.\n\nFinally, I don't think is \"miserable.\"",
      "author": "SexyMuon",
      "created": 1638067152,
      "upvotes": 42,
      "replies": {
        "hmcukw1": {
          "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmcukw1/",
          "text": "Woah 😳....I ...didn't think about it like that",
          "author": "chicityhopper",
          "created": 1638069731,
          "upvotes": 15,
          "replies": {}
        },
        "hmetjau": {
          "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmetjau/",
          "text": "this is exactly how I feel about my psych degree! I’m so excited to go to my classes to learn about the theories that people have developed through studies and experiments since the inception of the field and interpreting them through my own lens is the most interesting part to me. I’m never bored, I’m always excited to keep learning.",
          "author": "thisisme1202",
          "created": 1638114818,
          "upvotes": 3,
          "replies": {}
        },
        "hmdnf2e": {
          "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmdnf2e/",
          "text": "Just remember, you pay for those random classes. As much as I agree (also a cs major), college is meant to drain you of money. Learning is no longer a priority. While OP wants to smash and make tons of money, outside of this, it’s not a bad thought. \n\nDegree can’t guarantee you money. All it does is let you apply. Your knowledge level is random per person.",
          "author": "majoroofboys",
          "created": 1638087218,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hmdl5z0": {
      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmdl5z0/",
      "text": "Yes, I have hated it since the orientation camp. It had been 3 years and shit did not change. I feel like I can't breathe. And many of my friends seem to have a pretty happy college life and I wonder whether it's my problem. Sigh",
      "author": "Ok_Scientist_691",
      "created": 1638085501,
      "upvotes": 4,
      "replies": {
        "hmfe9n8": {
          "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmfe9n8/",
          "text": "Same bro same!",
          "author": "BoredasUsual88",
          "created": 1638123481,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmfmhym": {
      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmfmhym/",
      "text": "Maybe try studying? Might help",
      "author": "Good_Hospital573",
      "created": 1638126704,
      "upvotes": 3,
      "replies": {
        "hmgxk0j": {
          "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmgxk0j/",
          "text": "I have :(",
          "author": "chicityhopper",
          "created": 1638146082,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmdboqi": {
      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmdboqi/",
      "text": "Maybe you aren’t at the right school? My brother went to USC for a while and didn’t do so well partially because of the party culture so he transferred to Pitt and immediately clicked better with his classes.\n\nI understand the want to get rich fast, I’m a business major, but there’s no easy way to make big bucks. Even with time there’s no guarantee. \nHonestly trades people make a ton of money every year, much more than the average American. If you think you’d be happy doing a trade, go for it.",
      "author": "NovWH",
      "created": 1638079139,
      "upvotes": 5,
      "replies": {}
    },
    "hmdbovn": {
      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmdbovn/",
      "text": "> fuck counselors \n\nyeah. they don’t help. im sorry- I know it’s frustrating. it all is. hopefully it gets better for you",
      "author": "imakeonionscryy",
      "created": 1638079141,
      "upvotes": 5,
      "replies": {
        "hmeshob": {
          "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmeshob/",
          "text": "No offense but like… what schools do you guys go to? My counselors aren’t always amazing but it is literally their job to help me, so they usually do",
          "author": "Boney_African_Feet",
          "created": 1638114359,
          "upvotes": 3,
          "replies": {
            "hmesqqk": {
              "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmesqqk/",
              "text": "I go to MSU in Montana. They do their jobs yes but they make me feel like I’m bothering them when I’m just trying to get through school. My first semester, my counselor put me in classes I didn’t even ask for and she wouldn’t let me have any say.",
              "author": "imakeonionscryy",
              "created": 1638114473,
              "upvotes": 1,
              "replies": {}
            },
            "hmexyk8": {
              "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmexyk8/",
              "text": "Wanted to change majors and my counselor at the time sent me a link to the university page of the degree I was curious about and told me to see if I could \"find who might be the counselor for that major and email them\". Found someone but ended up not being the major I wanted even though they told me it was. Wasted nearly a whole year before I actually found a university with my desired major and could get myself transferred. Sometimes college counselors just aren't helpful or are so overworked they aren't careful.",
              "author": "kid_bala",
              "created": 1638116738,
              "upvotes": 0,
              "replies": {
                "hmha83k": {
                  "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmha83k/",
                  "text": ">. Found someone but ended up not being the major I wanted even though they told me it was\n\nundergraduate education is meant to be rather broad. specialization happens in graduate school. that's why at the best universities you don't see super specific majors like \"cybersecurity\" whatnot.",
                  "author": "wobbletelescope",
                  "created": 1638151818,
                  "upvotes": 1,
                  "replies": {
                    "hmhbbnf": {
                      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmhbbnf/",
                      "text": "Well, I was wanting an ESL Education license and they told me an English Lit. Ed. degree would get me to that goal by the end of the degree. But it actually just would lead to an ELA license with an ESL certification added on, which they ended up dropping completely as a possibility at the end of my first semester anyway in that major. But the licenses for ESL vs ELA are completely different, so I ended up having to transfer to a completely different university to get the degree I wanted. I got it figured out now and am almost to graduation, but I could have definitely saved some time and money if the counselors had been more transparent and helpful.",
                      "author": "kid_bala",
                      "created": 1638152325,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmezkb8": {
      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmezkb8/",
      "text": "Hate to break it to you, but you know all the people who say it gets better? Well you find out that's all bullshit right after college. In college you are surrounded by people your age with all kinds of events going on. Plus, you get more free time (yes, even with all the hours studying). Sure I was broke, but I still had more fun than I currently am with the bullshit of real life. Now I'm just broke with less free time, more responsibilities, and doing the same soul crushing shit every day. Enjoy it while it lasts OP even if it seems like dogshit now, trust me it can and often will get a lot worse.",
      "author": "tracenator03",
      "created": 1638117419,
      "upvotes": -4,
      "replies": {
        "hmfr4px": {
          "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmfr4px/",
          "text": "Left college 2 years ago. A lot less stress now.",
          "author": "shadowwolfsl",
          "created": 1638128542,
          "upvotes": 3,
          "replies": {
            "hmfrwrw": {
              "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmfrwrw/",
              "text": "Well maybe I'm wrong. At least I hope so. It's been a year and a half since I left and the stress has been getting to me. Not saying college wasn't stressful, but I spent all of this time unemployed or doing something unrelated to my degree for 50-60 hours a week and low pay.  I'm actually about to start a new job tomorrow in my field so maybe things will change.",
              "author": "tracenator03",
              "created": 1638128861,
              "upvotes": 0,
              "replies": {
                "hmgdpcw": {
                  "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmgdpcw/",
                  "text": "If you find a job you at least like then yes it does get better.",
                  "author": "shadowwolfsl",
                  "created": 1638137595,
                  "upvotes": 1,
                  "replies": {}
                },
                "hmgr797": {
                  "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmgr797/",
                  "text": "What did you major in?",
                  "author": "Jayjay_130",
                  "created": 1638143315,
                  "upvotes": 1,
                  "replies": {
                    "hmhb8my": {
                      "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmhb8my/",
                      "text": "Geology. Although things may be turning up as I just now received yet another job offer with about 20% more pay than the one I'm just about to start tomorrow! What a wild month it's been. Looks like I'm wrong!",
                      "author": "tracenator03",
                      "created": 1638152285,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hmgxj2d": {
          "link": "/r/CollegeRant/comments/r3t8av/i_dont_fucking_understand_college/hmgxj2d/",
          "text": "I have no free time I just hustle and make dough but I do want this load off so I can afford place to live",
          "author": "chicityhopper",
          "created": 1638146071,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}