{
  "sid": "qzfvdg",
  "link": "/r/CollegeRant/comments/qzfvdg/is_it_normal_to_feel_this_pathetic/",
  "title:": "Is it normal to feel this pathetic",
  "text": "So I'm currently a freshman civil engineer student but I'm transferring to environmental science, but as these finals are apparently, I'm getting more stressed and anxious about it all. I'm not really doing that well in the most of my classes. It's been a mixture of getting fucked over my professor who don't give a shit about you and the fact I had a gaint mental breakdown mid semester. Nevertheless, I've been doing my best to study and work as much as I can but as I'm getting closer to the finals, I'm starting to realize that I didn't take fucking ANYTHING away from my courses. If you asked me to describes what I learned in a class, I genuinely don't think I could give you a good answer. It just feel like I'm just moving day to day just trying to pass the next exam and never actually learn anything. \n\nI'm so scared to fail a class. I'm usually government money(military benefits from my dad) for school and if I fail a class I have to repay that money before the next semester begins and I honestly don't think I can afford it. \n\nThat makes me more mad is that i feel like such a disappointment from this whole situation. Even as a little kid, everyone told me \"oh you're so smart\" \"man, you're really going to make it out there\". Even my mom used to joke saying I was her ticket out of here. Now that I'm doing this shitty this early in college, I feel like the biggest failure and it's not like I'm not studying for my classes. All I ever do if work and work and work, I rarely give myself the chance to just sit down and relax. I've skipped on multiple meals, I barely get sleep, I rarely that the time to enjoy myself and when I do, I get behind on everything. \n\nIt's nice to know my family still supports me but I just don't want to let them down. I've had this conversation before with my dad and he's told me \" Hey this isn't going to define you. Just do the best you can, I know you're smart enough to get through this\" but I just don't feel this way about myself. \n\nIs it normal to feel like this? My school offers wellness programs but I've never had time to actually go to one",
  "author": "nooter70",
  "created": 1637565941,
  "updated": 1637689661,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {}
}