{
  "sid": "qmmata",
  "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/",
  "title:": "Loosing motivation",
  "text": "HELP! I am loosing motivation to study. I don’t know what to do. Online schooling sucks and I am so lazy. I need help.",
  "author": "MilkshakeIcecream",
  "created": 1636037535,
  "updated": 1636137987,
  "over_18": false,
  "upvotes": 41,
  "upvote_ratio": 0.99,
  "comments": {
    "hjaexug": {
      "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjaexug/",
      "text": "I got a study app when I started online learning! Mine was called Study Bunny, and the more time you log studying the more coins you earn. You then use them to get food and outfits for your bunny. It’s really cute! I’d look at study apps and see if one catches your eye. I like using reward systems, too. If I get more of this rough draft done, then I can have a snack. Definitely requires some self-discipline, but it’s worth it!",
      "author": "invisibilitycap",
      "created": 1636037887,
      "upvotes": 13,
      "replies": {
        "hjb53hu": {
          "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjb53hu/",
          "text": "Same idea for Forest which plants trees and bushes. It is free unless you upgrade which then donates real trees for the work you do.",
          "author": "tethypoothelkins",
          "created": 1636048001,
          "upvotes": 3,
          "replies": {}
        },
        "hjaf3nv": {
          "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjaf3nv/",
          "text": "Thank you! Would try that. Is it for free?",
          "author": "MilkshakeIcecream",
          "created": 1636037951,
          "upvotes": 2,
          "replies": {
            "hjb5hkg": {
              "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjb5hkg/",
              "text": "Of course! It should be :)",
              "author": "invisibilitycap",
              "created": 1636048152,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hjaxnn8": {
      "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjaxnn8/",
      "text": "try tightening it",
      "author": "cozymedusa",
      "created": 1636045115,
      "upvotes": 4,
      "replies": {}
    },
    "hjd4jl1": {
      "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjd4jl1/",
      "text": "There are people who livestream themselves studying on YouTube. I keep Woojin’s livestream in the background of my computer. He does 10 sessions of pomodoro. It really motivates me to study",
      "author": "nissanpacific01",
      "created": 1636077426,
      "upvotes": 2,
      "replies": {}
    },
    "hjcxesk": {
      "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjcxesk/",
      "text": "The only way to cure laziness is to focus on your goals. Ask yourself, what do I want to accomplish? What am I hoping to gain from this experience? And most importantly, what steps do I need to take in order to earn these achievements? You can get through this, and you really should because there is so much to gain from this educational stage in your life. Get excited about your classes. Allow what you learn to change the way you think. Allow yourself to grow, and allow yourself to rest.",
      "author": "Temporary-Complex751",
      "created": 1636074243,
      "upvotes": 2,
      "replies": {
        "hjd3gjf": {
          "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjd3gjf/",
          "text": "Awwww thank youuuuu for the advice! I’ll try to have a positive outlook.",
          "author": "MilkshakeIcecream",
          "created": 1636076925,
          "upvotes": 3,
          "replies": {
            "hjd3obz": {
              "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjd3obz/",
              "text": "Hell yeah! Proud of you, homie. You got this",
              "author": "Temporary-Complex751",
              "created": 1636077023,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hjbxxy4": {
      "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjbxxy4/",
      "text": "The only tip I can offer you is: Do it anyway. Don't feel like it? Too bad. Do it anyway. You'll feel worse if you don't. You'll feel better if you do. Get up and do it. Start now. You don't have to finish everything in one day. Work step by step. Answer one question. Answer another. Take a break. Read one paragraph. Watch one video. Take a break. Answer three more questions. Take a shower or eat dinner or whatever. Piece by piece. Just do it. And start as early as you can. Start by making a weekly plan. On the first day of your week, go through your course schedule and figure out what you need to do. Make a checklist, and check off each item that you complete. Try to complete as much as you can as soon as you can. That way, you'll finish early, and you'll have the rest of the week to slack off.",
      "author": "Temporary-Complex751",
      "created": 1636059314,
      "upvotes": 1,
      "replies": {
        "hjcvuy1": {
          "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjcvuy1/",
          "text": "I don’t know why this is getting downvoted. It’s pretty sound advice.\n\nFor me, I make everything a competition and that’s how I end up getting everything done. I just think “I have to take this course anyway, I don’t want to have to take it again, might as well get it done.” I take breaks too, but I always remember that I HAVE to take these courses to obtain my degree and be successful so let’s just get it done. \n\nIt also is very helpful to get work done as soon as you can so you aren’t stuck doing it last second. If I have free time and I can do my assignments, I make myself do it because I know that if I start them close to the due date then I’ll just stress myself out. \n\nAlso what I like to do is count how many assignments I need to get done in each course. I write it down so I can see it on paper the total number of assignments and as I get them done, I change the number. It’s kind of rewarding to see the number go down.",
          "author": "TheRestIs_Confetti",
          "created": 1636073554,
          "upvotes": 3,
          "replies": {
            "hjcvzko": {
              "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjcvzko/",
              "text": "Hey, these are excellent strategies. Thanks for sharing",
              "author": "Temporary-Complex751",
              "created": 1636073611,
              "upvotes": 3,
              "replies": {}
            },
            "hjd3asn": {
              "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjd3asn/",
              "text": "Ill try that thank you very much!",
              "author": "MilkshakeIcecream",
              "created": 1636076853,
              "upvotes": 3,
              "replies": {
                "hjd74ua": {
                  "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjd74ua/",
                  "text": "Yeah no problem! And you know, right now I’m taking one of my last courses I need to get my BA. Man I can’t tell you just how burnt out I am. But making it a competition for myself, like it sounds dumb, but it makes it kind of fun and I’m getting it all done. Just be the best person you can rely on because you really can’t rely on anyone else for your success in college.",
                  "author": "TheRestIs_Confetti",
                  "created": 1636078644,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hjd39jd": {
          "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjd39jd/",
          "text": "Thank u!",
          "author": "MilkshakeIcecream",
          "created": 1636076837,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjdlcds": {
      "link": "/r/CollegeRant/comments/qmmata/loosing_motivation/hjdlcds/",
      "text": "watch youtube study motivation videos",
      "author": "Adrien0715",
      "created": 1636085963,
      "upvotes": 1,
      "replies": {}
    }
  }
}