{
  "sid": "p6h4tr",
  "link": "/r/CollegeRant/comments/p6h4tr/as_much_as_i_pay_in_tuition_i_really_would_prefer/",
  "title:": "As much as I pay in tuition, I really would prefer reliable wifi",
  "text": "Like, you know the Internet sucks when the entire classroom has to resort to mobile hotspots to access documents online. Even the computers that were directly plugged in through Ethernet were downloading at less than a megabyte per second.\n\nHalf the class ended up leaving early because there was no way we were going to get any work done.",
  "author": "tlacct",
  "created": 1629249814,
  "over_18": false,
  "upvotes": 294,
  "upvote_ratio": 1.0,
  "comments": {
    "h9evp6e": {
      "link": "/r/CollegeRant/comments/p6h4tr/as_much_as_i_pay_in_tuition_i_really_would_prefer/h9evp6e/",
      "text": "My campus should at least have good connection in the lounge areas and near where computers are but no. I spent so much time looking for a good spot to crash that has reliable WiFi but no dice, have to settle for 1-2 bars.",
      "author": "fullofregrets2009",
      "created": 1629297212,
      "upvotes": 3,
      "replies": {}
    },
    "h9ddauk": {
      "link": "/r/CollegeRant/comments/p6h4tr/as_much_as_i_pay_in_tuition_i_really_would_prefer/h9ddauk/",
      "text": "I’m already prepared for absolute trash connection in a dorm. Brand new building too and have zero expectations. I just hope I can run games on my PS5 with under 100 ping while wired. Every campus I’ve been to has just terrible WiFi connection to the point even a google search takes a good while to load. Watching a movie may as well have had commercial with the amount of buffering it had. I totally get it being stressed with hundreds of people using it, but you’d think with how much money they make it would be the absolute top of the line stuff throughout the schools.",
      "author": "XxNHLxX",
      "created": 1629257803,
      "upvotes": 11,
      "replies": {}
    },
    "h9cyqqv": {
      "link": "/r/CollegeRant/comments/p6h4tr/as_much_as_i_pay_in_tuition_i_really_would_prefer/h9cyqqv/",
      "text": "Best thing to do is reach out to your school IT, explain the issues",
      "author": "Thewarrior556",
      "created": 1629250069,
      "upvotes": 47,
      "replies": {
        "h9cyujq": {
          "link": "/r/CollegeRant/comments/p6h4tr/as_much_as_i_pay_in_tuition_i_really_would_prefer/h9cyujq/",
          "text": "Professor contacted IT, but there’s no telling when they’ll respond. Could be the next day or the next week.",
          "author": "tlacct",
          "created": 1629250121,
          "upvotes": 35,
          "replies": {
            "h9cza3a": {
              "link": "/r/CollegeRant/comments/p6h4tr/as_much_as_i_pay_in_tuition_i_really_would_prefer/h9cza3a/",
              "text": "Yeah unfortunately most of the time it sucks corresponding through schools in general, but its only because they are busy",
              "author": "Thewarrior556",
              "created": 1629250343,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062700
}