{
  "sid": "g3dd51",
  "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/",
  "title:": "This is ridiculous. How do these people get PhDs?",
  "text": "I recently took a midterm, my first exam during the quarantine, my first exam using Respondus. And I can say with no hesitation: what a load of absolute bullshit.\n\nExams count for high portions of class grades in a short period of time - they’re stressful enough under the regular testing conditions. So here we are at a time of unprecedented crisis, what do you do professor?\n\n* Have students install the infamous Respondus lockdown browser, which you might as well call malware, intrusively hijacking and monitoring your computer, streaming your webcam and microphone; can’t wait for the security flaws that come forth in that.\n* Violate students, forcing them surrender their privacy and record their surroundings in their living space for the professor and TA to watch through Orwell's eye.\n* Scramble the order of the questions. Yeah, if they’re all equal multiple choice, it makes sense. But otherwise – ya know how you’ll have some True and False, some multiple choice, some short answer, and some long answer, in some reasonable order? Nah, fuck that. Long answer at the start, make me nervous for whether I’m saving enough time for the other questions, and do shitty on this big question.\n* Prevent students from going back to review questions. God forbid I want to think about this question while answering other ones. Or otherwise be smart with my time like one does on an exam.\n* And randomly, in the middle of the exam.\n\n>“Type your name below to certify you didn’t cheat. If you admit it now, there are less consequences?”\n\nHere I am. Thanking Pepe^(TM) on the daily that my family is in good health, with this virus killing a New Yorker every \\~109 seconds. And the professor is wasting my energy on this moronic ass question? The whole exam isn’t even over yet. Oh fuck oh shit, how will I type my name in this box if I cheated, my evil plans are thwarted. /s.\n\nAnd to what end? To the end of academic integrity and maintaining the reputation of this school (which I 100% support)? \n\n# No.\n\nThis is the epitome of **security theater**. Exacerbate the stress of honest students, while doing absolutely nothing to prevent dishonest students from cheating.\n\n* As if my 1/2 pixel potato webcam in this shitty lighting is going to pick up a cheat sheet. I’m the one filming the environment video, I can hide whatever I want.\n* And as if a class of upper division Computer Science students can’t figure out how to isolate and mitigate the Respondus trash? I can play a fake recording from a virtual webcam. Put Respondus in a VM. A second computer/monitor. The field of vision of my webcam can barely fit my giant head, you can’t effectively see my surroundings and me simultaneously while I’m taking the exam.\n* And how does scrambling the questions do anything but make it more frustrating to take a test? If students are collaborating, they’ll tell each other what the question they’re on. Doesn’t matter if they’re scrambled.\n* A god damn sheet of paper under my keyboard. Gosh golly gee, It isn’t rocket science, the possibilities are endless.\n\nBut hey, if I’m so smart, how do I say we fix this? How?\n\nWell that’s easy. Make cheating not cheating. There are many better ways to ensure students are learning lecture content than to give this condensed second (as if we've learned that much since the first one) midterm exam that didn’t move from its original schedule on the syllabus, after Spring break, after all students being forced to move out of their dorms, after an extra week off, and after a week where a sizable chunk of class was invested in turning the boomer into a Zoomer.\n\nGive an open assignment, have students explain their rationale for each question. Every student will learn the material if they haven’t already through the assignment. Make it a bit complex, open ended, thought provoking, sure. Nothing more realistic than having students answer questions, and if they don’t know the answer, they consult the material – sounds like the real world to me. Spend a class session going over the material instead of this useless exam. Use safe assign, that’s non-intrusive and effective. It’s a win win, if the aim is to facilitate understanding.\n\nBut no. hurt honest students. If the University supplies us dedicated hardware, a 360 camera, a solid internet connection, deploys Pepe^(TM) to bless each of our homes and watch over us (from 6ft away), then *maybe*, we can prevent cheating ­to some degree. But until then?\n\nWe're all adults. I'm here to learn. Spare the bullshit.\n\n`</rant>`",
  "author": "SeniorIndependent6",
  "created": 1587167135,
  "over_18": false,
  "upvotes": 118,
  "upvote_ratio": 0.98,
  "comments": {
    "fnsf4r8": {
      "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnsf4r8/",
      "text": "Unrelated but the statement that a New Yorker is being killed every ~109 seconds is very incorrect.",
      "author": "TerryLovesLavender",
      "created": 1587220274,
      "upvotes": 1,
      "replies": {}
    },
    "fnrj7o4": {
      "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnrj7o4/",
      "text": "I teach an upper undergraduate course that uses Respondus and many of the features you mentioned for exams. It’s not lost on us that there are hundreds of ways to circumvent these measures. It’s also not fully my choice to use these cheating deterrents, but rather something imposed on us at the department level. \nWith all of this in mind, they are cheating deterrents - not cheating prevention. I definitely believe that these efforts deter cheating for those less determined to do so.",
      "author": "Enzohere",
      "created": 1587190643,
      "upvotes": 4,
      "replies": {
        "fvpmyni": {
          "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fvpmyni/",
          "text": "> I definitely believe that these efforts deter cheating for those less determined to do so.\n\nDo you think it's worth the extra stress it induces upon students who are poor test-takers?",
          "author": "skeptical_moderate",
          "created": 1592886512,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fnqvd56": {
      "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnqvd56/",
      "text": "I agree with everything here.\n\nWhat’s the best way to prevent cheating in online AND offline test-taking environments? Make the content stuff you can’t pluck from a couple-minute search or write down somewhere ahead of time. Inference-based stuff. \n\nYou can search/write down “what is operant conditioning,” but you can’t search/write down “An owner stops playing a loud noise from a hand-held device when their cat jumps off the counter. What method of learning is being used, and what is the flaw in this learning method?”",
      "author": "mittmop",
      "created": 1587173050,
      "upvotes": 6,
      "replies": {}
    },
    "fnqp63z": {
      "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnqp63z/",
      "text": "I had a six hour take home exam today. It took me almost the entire time. This is getting ridiculous.",
      "author": "anniza",
      "created": 1587169187,
      "upvotes": 20,
      "replies": {
        "fnqzhh9": {
          "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnqzhh9/",
          "text": "6 hours?? How long did the prof say it would take?",
          "author": "mypuppyisamonster",
          "created": 1587175688,
          "upvotes": 6,
          "replies": {
            "fnqzl51": {
              "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnqzl51/",
              "text": "6 hours... it was two parts. Each part took about three hours.",
              "author": "anniza",
              "created": 1587175755,
              "upvotes": 6,
              "replies": {
                "fnr0clb": {
                  "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnr0clb/",
                  "text": "God. I'm so glad my school capped our exams to 2.5 hours or like a take home paper or something.",
                  "author": "mypuppyisamonster",
                  "created": 1587176258,
                  "upvotes": 4,
                  "replies": {
                    "fnr0s7t": {
                      "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnr0s7t/",
                      "text": "My prof is insane. Our exams normally consist of 6 questions each with 1 to 2 parts. It normally takes me 2-3 hours to finish (we have 4 hours). This exam had a total of 8 questions each with 4 or more parts. It took me almost the entire time. It’s physical chemistry, I’m one of the few ppl in the class with an A so I imagine some ppl didn't even finish.",
                      "author": "anniza",
                      "created": 1587176554,
                      "upvotes": 8,
                      "replies": {
                        "fnr1hdo": {
                          "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnr1hdo/",
                          "text": "Gross. That's like an entire day. Some ppl literally don't have time for that.",
                          "author": "mypuppyisamonster",
                          "created": 1587177035,
                          "upvotes": 6,
                          "replies": {
                            "fnr1w4i": {
                              "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnr1w4i/",
                              "text": "I’ve been wondering about people who didn’t have time for it. We had 24 hours to do both parts  but that’s still not realistic, people need sleep.",
                              "author": "anniza",
                              "created": 1587177312,
                              "upvotes": 4,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fnqo52e": {
      "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnqo52e/",
      "text": "Amen",
      "author": "RileyG00",
      "created": 1587168557,
      "upvotes": 8,
      "replies": {}
    },
    "fnqntz1": {
      "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnqntz1/",
      "text": "What major are you? What type of questions do you think the professors should give on the open assignment? \n\nIs their any thing in life preventing you from putting in effort, such as anxiety, having to work long hours or the death of someone? \n\nI'm already kinda 😠 for this post, but I guess it's understandable. 😤",
      "author": "chenthehen",
      "created": 1587168374,
      "upvotes": 2,
      "replies": {
        "fnqvnkz": {
          "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnqvnkz/",
          "text": "I don’t think the point of OP’s post is to complain that they can’t cheat because of online exam formats. They’re complaining about the overall lack of security and effectiveness of the format, part of it being their pointless methods of preventing cheating.\n\nThey’re not advocating cheating, they’re arresting that the program, which is a security risk, isn’t even working - so why should they have to download it?",
          "author": "mittmop",
          "created": 1587173236,
          "upvotes": 8,
          "replies": {
            "fnr1v7v": {
              "link": "/r/CollegeRant/comments/g3dd51/this_is_ridiculous_how_do_these_people_get_phds/fnr1v7v/",
              "text": "Don't know. Because professors think their's no other way to prevent cheating.",
              "author": "chenthehen",
              "created": 1587177294,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634063315
}