{
  "sid": "mgx2g4",
  "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/",
  "title:": "“Quit your job and focus on school!”",
  "text": "Professors are so disconnected with reality. \n\nI am one of the few lucky people who managed to get a job during a recession and global pandemic. I got this job because I don’t plan on being on EBT for forever and I cannot afford the basic necessities, nevertheless university, without an income. \n\nThis year, I’ve held off buying groceries and skipped meals because I couldn’t afford it. My insurance refused to cover my medications so I’ve been trying to save up enough to afford my monthly dose. I spent all of my summer earnings paying for textbooks and class fees for the fall, and all of my fall earnings attempting to pay my spring tuition. \n\nMy professor was so flabbergasted that I work 40 hours a week while being a full time student. I told them I was struggling in my major because of all of the requirements and I couldn’t lessen my class schedule because my scholarship requires a certain number of credit hours a semester. \n\nIt’s so frustrating to be working just for the “privilege” of attending university, and have the university act as though students are absurd for working. If universities wanted students to focus on their studies, they should give out more scholarships (preferably ones that don’t require 15+ credits a semester), and work on reducing tuition. Until then, I will continue to work because otherwise I cannot attend nor afford school.",
  "author": "jempai",
  "created": 1617161053,
  "over_18": false,
  "upvotes": 337,
  "upvote_ratio": 0.99,
  "comments": {
    "gt4ple9": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gt4ple9/",
      "text": "I go to school online, doing my undergrad in psychology, hoping to do a dual degree afterwards, i don’t work now only because of savings, disability, & etc. i am changing careers, i am in my forties, and recently diagnosed with ADHD; I did attend college in my twenties, went full time and worked full time.  I am still trying to figure out how I did it because soon, i will have to do it again. My program is completely online, I AM TEACHING MYSELF THIS TRASH! \n\nOnce the professor sets up the course for the semester, which THEY DID NOT EVEN DESIGN BECAUSE ITS DESIGNED BY THE DEPARTMENT, it’s pretty much automatic.  Some do not return emails, and when they do, you wish you never reached out because the condescension makes you want to find out where they live and send a boiled rabbit, insteadI write scathing evaluations. They never want to explain or guide you in anything. You tell them you are not understanding the concept of the subject matter and they ask you to get back to them when you have a specific question!!!!\n\nWhat???? You mean to tell me you have a whole entire PhD, you have been studying the discipline for decades, probably wasting the college’s air teaching or instructing for a good amount of time, and you have no idea what i am not grasping??? You need to be guided??? The professor is supposed to be able to extrapolate from the information  I give what my problem is likely to be due to experience and education. I shouldn’t have to do paint by numbers for them.\n\nThe professor should be able to make the explanation for my problem RELATABLE TO THE CHANGING SANDS OF  MARS!\n\nThese deadlines are ridiculous, we have new units every week on Monday, that we are teaching ourselves, with “discussion posts” being the new “essay” (they need to just call it an essay, because it’s not a discussion) due on Thursday, responses, quizzes, and official papers due on Sunday??? One class has 2 discussions, We’d and Fri and the rest on Sun, for Statistical Methods, which she didn’t teach, she just “assigned” work!",
      "author": "Impossible_SLuv2016",
      "created": 1617362375,
      "upvotes": 1,
      "replies": {}
    },
    "gsykueb": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsykueb/",
      "text": "I work full time and have a military career on top of that. I'm taking an arbitrary science/lab that has fuck all to do with my history major. I'm not a scientist. I will never apply that course to my career or life. It's pointless.",
      "author": "TJkiwi",
      "created": 1617225915,
      "upvotes": 2,
      "replies": {}
    },
    "gsy02f7": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsy02f7/",
      "text": "I had a teacher that basically said if you can't make the dates on the syllabus or dedicated this many hours to studying then you need to drop my class. \nShe understood that other things got in the way, but instead of saying quit your job she just said leave school. Which to many is just like telling them to quit there job or progress in life.",
      "author": "elocinkrob",
      "created": 1617216352,
      "upvotes": 6,
      "replies": {}
    },
    "gsxypz3": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxypz3/",
      "text": "I’m in the same spot sort of. I work as much as I can as well as being a full time student. I don’t understand the people who don’t work and just go to school. Like how do you afford it? I live at home and don’t have the pay rent thankfully but I still have bills and buy groceries for my home. Like I just don’t understand how you can not not work?",
      "author": "worlds_away_",
      "created": 1617215735,
      "upvotes": 4,
      "replies": {}
    },
    "gsxo1th": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxo1th/",
      "text": "Another prof here - the four year college degree was designed for hyper privileged students who had parental support OR for students who could work a full time summer job to pay for all upcoming expenses.\n\nThose two modes no longer fit the majority of the student body, and we are aware of that. However, one day our “works 20-40 hours per week” student is going to compete against the “could study full time student” on standardized tests (think MCAT and GRE) and we need our working student to perform as well as the privileged student. The profs at the working-student-population school can’t make their courses any less rigorous than the profs at the privileged-student school. You should always expect 2-3 hours per credit per week of studying regardless of which school you go to.\n\nSo what’s the solution? Take less courses per semester. You don’t need to finish in four years and for many of you, it will be better to take slightly longer and get better grades. \n\nIs that what you want to hear? Is it fair? Probably not, but again, we profs need to make sure you can compete with the other students when you go head to head in applications and tests.",
      "author": "FlimsyIsopod",
      "created": 1617210893,
      "upvotes": 5,
      "replies": {}
    },
    "gsxnc7b": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxnc7b/",
      "text": "This reminds me of my professor during winter session. I understand that it's an accelerated course, but we had homework due every night, quizzes every Friday, and tests every Sunday. On top of that he decided to make assignments due at 5pm! Some people don't even get home from work that early! His response to not just letting us have the week to get work done was that \"it's an accelerated class so youre responsible for keeping up\". So many students dropped the class because if they had known they literally would be unable to turn in work on time due to their work schedules, they wouldn't have picked his class in the first place. We had 2 assignments due on the first freakin day",
      "author": "vness1213",
      "created": 1617210575,
      "upvotes": 2,
      "replies": {}
    },
    "gsxkawi": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxkawi/",
      "text": "Professor here. I get where you are coming from 100%. This is a societal issue, and it was not like this for previous generations. A lot of professors don't understand this, because it does not make sense for what things were like years ago. I'm not defending your professor's behavior, but it might help to know why it happens. Be frustrated with the professor, sure. But this might also be an opportunity to educate. They need to know how much things have changed. All of us need to realize the current state of things, and not accept it. It will take political activism to improve things.\n\nHere is what I tell to students though, because I know that being just a full time student is not reasonable for many of them. You don't have to take as many classes at once. Graduating one or two semesters late may be very worth it in the long term. It's better than barely graduating at all. Things have changed. The four-year full time student expectation is just not reasonable for a lot of people now. I know sometimes there are scholarship and other restrictions that don't let that happen. But it's worth considering for those that have the ability to pace themselves.\n\nAlso, the generational differences affect us too. I'll never make as much money as my professors did. And I've worked much, much harder to get to where I am than they had to in their time (not that they didn't work very hard). Competition is high, and compensation is low. Some of the older professors really just don't get what it is like now. All of this is a related societal issue. It sucks.",
      "author": "real-nobody",
      "created": 1617209214,
      "upvotes": 12,
      "replies": {}
    },
    "gsxk57x": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxk57x/",
      "text": "My family said the same thing to me, as I am a freshmen, but literally for the last few weeks I’ve been living off of ramen, and nothing else because I only had 34$ to my name. Therefore I had to get a job, and still go to college, because nobody is gonna pay for my phone bill, nobody is gonna pay for tampons and pads, nobody is going to pay for these textbooks and subscriptions, nor are they going to pay for my dinner. Only I can do that, therefore I have to work😤",
      "author": "cocapcookie",
      "created": 1617209143,
      "upvotes": 7,
      "replies": {}
    },
    "gsxgxg8": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxgxg8/",
      "text": "I’m a manager at my job, and when I check in with the lower level staff (who are also all students), they tell me about their second or third jobs. I spoke with a freshman about how her main job is the only time she has available for completing homework since she works 60 hours a week at her jobs combined. \n\nMeanwhile, with my classmates in my major, most don’t work and are still feeling overwhelmed with full time credits because school is so dense. It’s hard enough trying to complete a major that is very time consuming and exhausting, but balancing a job on top of that is impossible. \n\nIt’s just so draining. The class divide basically forces poor students to work harder to the point of hospitalization just to afford school, while wealthy students can dedicate their time to unpaid internships and building up their resume and experiences.",
      "author": "jempai",
      "created": 1617207709,
      "upvotes": 8,
      "replies": {}
    },
    "gsxgbk8": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxgbk8/",
      "text": "Most professors either:\n\n1. Haven't worked in industry for a long time so have no idea how hard it is to get work or the 24 hour clock many of their students are on;\n2. Were supported by someone through their schooling (parents, government, scholarships, spouse) because otherwise they couldn't do it;\n3. Went to university full time and that is all they did to the exclusion of other things.\n\nThe more elite the university is, the more likely this is true.",
      "author": "ourldyofnoassumption",
      "created": 1617207437,
      "upvotes": 11,
      "replies": {}
    },
    "gsxg1r5": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxg1r5/",
      "text": "There does seem to be a huge disconnect with some and then significant amounts of empathy with others. I feel like people whose parents or scholarships paid their way while they didn’t have to work do not have a firm grasp on how people must balance work/school/children. The pandemic made my uni open up the education degree to online and have an on campus and totally online version of the degree, otherwise I would have had to beg my job to allow me to take half days and work strange hours to accomplish my degree. Legitimately the only reason myself or the other adults with jobs/kids are able to graduate is because of the pandemic.",
      "author": "lem0n-lacroix",
      "created": 1617207315,
      "upvotes": 3,
      "replies": {}
    },
    "gsxfqvd": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxfqvd/",
      "text": "I have a supervisor at my first job that tells me stuff like “why dont you just __” I dunno man, did you consider that I fucking did. Ngl, this is what sometimes makes me hesitant to connect with professors and professionals in my field because the condescending attitude drives me insane. \n\nMy best professor ever was a guy who was going through grad school during the semester on top working a high stress job, and was understanding when we couldn’t devote every waking hour to his class.",
      "author": "sans_serif_size12",
      "created": 1617207180,
      "upvotes": 8,
      "replies": {}
    },
    "gsxfc4k": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxfc4k/",
      "text": "[deleted]",
      "author": null,
      "created": 1617206992,
      "upvotes": 10,
      "replies": {
        "gsxzjqj": {
          "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxzjqj/",
          "text": "I wish unemployment worked that way! \nYou might be able to get an 8 week class past them but after that you need to find a job basically the day your class ends.\nPlus that's messing with the system which they can find out or something",
          "author": "elocinkrob",
          "created": 1617216111,
          "upvotes": 1,
          "replies": {
            "gsxzokh": {
              "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxzokh/",
              "text": "[deleted]",
              "author": null,
              "created": 1617216175,
              "upvotes": 1,
              "replies": {
                "gsyn7a4": {
                  "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsyn7a4/",
                  "text": "Dam that's terrible. \nI do get where she's coming from during covid. If she said it before covid then that would be 100% crazy.",
                  "author": "elocinkrob",
                  "created": 1617227078,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gsy5ae9": {
          "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsy5ae9/",
          "text": "In Canada you're not allowed to be on any type of welfare or assistance while you take post-secondary education. You get in HUGE trouble and have to pay it back if you get caught.",
          "author": "xaxathkamu",
          "created": 1617218746,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gsxc8ev": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxc8ev/",
      "text": "Professors, are too busy raking in the public pensions, sitting on their nest eggs, especially tenured professors to give a shit",
      "author": "RomanLion29",
      "created": 1617205600,
      "upvotes": 3,
      "replies": {}
    },
    "gsx6xmf": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsx6xmf/",
      "text": "Homie. I tried what you did. And i couldn't do it. I'm not strong enough. I'm joining the Navy cause i quit. \n\nYou're my hero for being able to do this. Truly. I couldn't. It was too much",
      "author": "mr_munchers",
      "created": 1617203183,
      "upvotes": 27,
      "replies": {
        "gsxz8x7": {
          "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxz8x7/",
          "text": "What you doing in the navy?\nAre you joining just to continue school? \nWhere I was station I wasn't able to attend college during my 4 years unless I was willing to pay out of pocket. which supporting a unemployed husband and his student loans didn't really put me in a good position to spend extra money.",
          "author": "elocinkrob",
          "created": 1617215975,
          "upvotes": 2,
          "replies": {
            "gsy0njs": {
              "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsy0njs/",
              "text": "Idk. Im looking at a really good transferable skill. Haven't taken the real asvab yet. So i can't really pick yet",
              "author": "mr_munchers",
              "created": 1617216622,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gsz8igt": {
          "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsz8igt/",
          "text": "Go airforce in stead, the navy is garbage.",
          "author": "barc0d3_",
          "created": 1617238272,
          "upvotes": 0,
          "replies": {
            "gsz8mgf": {
              "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsz8mgf/",
              "text": "Why is navy garbage if u don't mind me asking?",
              "author": "mr_munchers",
              "created": 1617238332,
              "upvotes": 1,
              "replies": {
                "gszdmfd": {
                  "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gszdmfd/",
                  "text": "I was a nuke electrician. I worked on submarine nuclear reactors. My schooling was 2 and a half years long. Once i got to the fleet i spent the majority of my time cleaning. It wasn't unusual to spend 8 hours a day in port cleaning, its all we did. If I wasn't cleaning i was doing maintence. Due to navy beuracracy, a two hour maintence job would be stretched into a 6 hour maintence job. \n\n&#x200B;\n\nThen there is duty. Duty is when you spend 24 hours on the boat every 3 days, then work a full work day the day after. So if you have duty Monday, you'll have duty again on Thursday, then Sunday, and so forth repeating every 3 days till the day you step off the boat. On your duty day you will stand 12 hours of watch. Watch is when you take readings on the same gauges every hour and write down there value, they never change. \n\n&#x200B;\n\nThe cleaning, the maintence, and the duty results in a average work week of 100 hours, for 6 years. This is just in port, out to sea your working 18 hours days, every day, till you pull back into port, at which point you go back to standing duty and cleaning. I cannot overstate how bad standing duty is, its like a guillotine that is constantly hanging over your head. Want to party Saturday night? Cant because you have to be up at 4 am to be on the boat by 6 am to stand Sunday duty, then when your duty day is done you have to work a full work day Monday. You would go out friday night but your tired from Thursday dudy and the fact that you only got 4 hours of sleep on your duty day. \n\n&#x200B;\n\nAll these problems are things that cannot be made better by your chain of command, only worse. i could write a book on how toxic the leadership i had was. Your captain will run you into the ground just so he can be promoted. I had a captain that I heard say \"who cares if they kill themselves, the navy will send me a new one\". People just don't give a shit about you. \n\n&#x200B;\n\nDo yourself a favor and go airforce, or coast guard. I have buddies in all the branches and those two seem to be the best in terms of quality of life and work/life balance. \n\n&#x200B;\n\nIF what I wrote didn't dissuade you from joining the navy, at least go officer. Its still awful, but you get paid 3x what enlisted do and you get a small amount of respect.\n\n&#x200B;\n\nSide note, while it was awful while I was in, I'm no longer in the navy and am semi-retired at the age of 27. Was it worth it? No, but I cant look over the fact that i would not be where I am in life had i not joined the navy, so take that for what it is.",
                  "author": "barc0d3_",
                  "created": 1617240954,
                  "upvotes": 3,
                  "replies": {
                    "gszdzou": {
                      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gszdzou/",
                      "text": "Fuck... That's alot to think about...",
                      "author": "mr_munchers",
                      "created": 1617241147,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gsx2lwj": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsx2lwj/",
      "text": "I mean...school requires money and a job provides that. I don't know why a professor can't figure out that much.",
      "author": "UpbeatFaithlessness6",
      "created": 1617201131,
      "upvotes": 10,
      "replies": {}
    },
    "gsx2ca8": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsx2ca8/",
      "text": "There are churches, food banks, and such that give groceries for free! And you could also apply for food stamps. I know those aren't ideal but i think it's much better than skipping meals! I hope this helps at least a little bit as I'm not sure what to do about everything else...I just end up taking out loans because I can't handle the pressure of working full time during school or I'd fail (and i needed impressive grades for PA school). I commend you for your efforts though!",
      "author": null,
      "created": 1617201004,
      "upvotes": 5,
      "replies": {}
    },
    "gsx0cll": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsx0cll/",
      "text": "I had a very similar thing happen with a professor. Was living out of state, renting an apartment, feeding myself, etc. and had to pay for it myself. I was working so much, and my organic chemistry professor told me “you should just quit your job to focus on school” it’s like lol I wish, but I’d also like to continue to eat and not be homeless. I couldn’t afford to pay for school stuff with what I was making though, so now I’m looking at 50k+ of student loans.",
      "author": "amiriteamiriteno",
      "created": 1617200032,
      "upvotes": 7,
      "replies": {}
    },
    "gswz7hu": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gswz7hu/",
      "text": "Its not so much they are out of touch per say, but many people still have this notion you can do everything at once and not be phased by it. Things are different than previous generations on the whole and for some its hard to get a mind set around it",
      "author": "electricdom",
      "created": 1617199457,
      "upvotes": 2,
      "replies": {}
    },
    "gswt33w": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gswt33w/",
      "text": "I also work 40 hours a week and attend school. I used to attend one of those schools that markets towards \"working adults\" and it was literally paying $1200 to write a forum post once a week and get an A. Felt like a complete diploma mill so I transferred. Now I'm in real university and I'm surprised at how professors are so stubborn on so many things like exam time conflicts... and professors have started using Cengage/McGrawhill to teach the entire course and barely respond to emails. Have you applied for Medicaid? In most states you are still eligible for EBT if you work part time. And food banks give out food for free, you can hit up multiple ones. Lots of my friends have their medications covered by Medicaid.",
      "author": null,
      "created": 1617196153,
      "upvotes": 14,
      "replies": {}
    },
    "gswr1b2": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gswr1b2/",
      "text": "I was on the flip side. My work wanted me, who already was working 30 hours a week, to tell my professor that I needed an extension on my test because I needed to go in to work that day because we were short handed! A day that in my file was stated I couldn't work because of school. So i quit and found out that either way you can't win.",
      "author": "willowmei",
      "created": 1617194920,
      "upvotes": 18,
      "replies": {
        "gswxbuz": {
          "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gswxbuz/",
          "text": "Sounds like my last job. I told them what hour/days I couldn’t work because of school. They agreed. Barely two months later I was arguing with my supervisor and HR because they kept trying to schedule me to work on my “blackout” days or pick up more hours. Heck, and even do doubles. The guilt tripping was the worst, my gosh. \n\nY’all wouldn’t be struggling if you hired enough people in the first place ffs.",
          "author": "reinakun",
          "created": 1617198483,
          "upvotes": 11,
          "replies": {
            "gsxx4vd": {
              "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxx4vd/",
              "text": "Thats exactly what was going on! Or they would hire kids fresh out of high school that had no sense of responsibility. We had two in particular that would either forget they worked or would show up 4 hours late to a shit and receive no disciplinary action.",
              "author": "willowmei",
              "created": 1617215005,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gswkii4": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gswkii4/",
      "text": "Literally that professor can get down on his knees and blow you. He has no right to even talk to you like that and disrespect you. You are right, professors nowadays have no idea how much we work. I do about the same as you, so therefore I work and go to school everyday. I am not shy to put my professors in their place when they talk sweet to me about working too much. I know it sucks right now but it will all be worth it. It’s making you a strong individual, people that don’t work in college go real soft real fast. Good luck!",
      "author": "Frenchdu",
      "created": 1617190389,
      "upvotes": 9,
      "replies": {}
    },
    "gsvufm2": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsvufm2/",
      "text": "The thing is is that if you want to be a professor you have to have the ability to go to grad school and get paid dogshit for 4-7 years, then again for a 2 year post doc. That is to say, most professors come from a place of financial privilege and probably can’t fathom having to work to pay your bills as a student.",
      "author": "Gerardo1917",
      "created": 1617167310,
      "upvotes": 36,
      "replies": {}
    },
    "gsvu1wh": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsvu1wh/",
      "text": "Same! I teach at a local community college, but am also a student (career change) and I can’t believe how disconnected with reality my colleagues are. One keeps changing due dates because as education major students, we should be full time students in her eyes and flexible to her whim or something crazy like that. Ugh",
      "author": "mother_of_nerd",
      "created": 1617167023,
      "upvotes": 52,
      "replies": {}
    },
    "gsvsf3z": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsvsf3z/",
      "text": "I'm going for nursing (prenursing rn) and I get this *all* the time! I get that nursing school is hard, I know it'd \"be best\" to not work and focus on school full time, but how do you think I pay rent?? Eat?? Pay for gas to drive to your bum ass school??? They're so horribly out of touch that it's full infuriating at this point. \n\nAnd then they say to just work full time summers to pay during the semester, as if the wages for non-degree work (even full time!!) can somehow be enough to cover expenses for the summer and following semesters? As if anyone is willing to hire someone for only 2-3 months?",
      "author": "joyleaf",
      "created": 1617165788,
      "upvotes": 137,
      "replies": {
        "gswy4u4": {
          "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gswy4u4/",
          "text": "Prenursing student here as well, shit is garbage. 🥲",
          "author": "AiriAnime",
          "created": 1617198904,
          "upvotes": 10,
          "replies": {}
        },
        "gsxhr77": {
          "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsxhr77/",
          "text": "This. it so hard to get a job that will pay $14+ just because they know your only going to be working from May till August 🙄it’s fucking bullshit",
          "author": "Thaunagamer",
          "created": 1617208079,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gsvq5i6": {
      "link": "/r/CollegeRant/comments/mgx2g4/quit_your_job_and_focus_on_school/gsvq5i6/",
      "text": "They probably think tuition/housing costs what it did back when they were in school. 🙄 but that is awesome that you are able to work full time and accomplish all you do at school, too, good job!",
      "author": "jendominates",
      "created": 1617164187,
      "upvotes": 39,
      "replies": {}
    }
  },
  "updated": 1634062793
}