{
  "sid": "nezqhn",
  "link": "/r/CollegeRant/comments/nezqhn/feeling_bummed_about_others_graduating/",
  "title:": "Feeling bummed about others graduating",
  "text": "So I’ve been almost 4 years in community college. My friends from high school are all graduating university and I feel bummed about it. I’ve paid for community all myself and this upcoming 2022 year I’m about to receive my associates for transfer. I’ve taken breaks from cc because of either bad mental health or money issues. I’m proud of myself for getting through college but bummed that it’s taking me longer. Anyone else feel this way?",
  "author": "jeansarenice",
  "created": 1621307616,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.89,
  "comments": {
    "h2udli8": {
      "link": "/r/CollegeRant/comments/nezqhn/feeling_bummed_about_others_graduating/h2udli8/",
      "text": "Don't feel bummed look at what happened to those who transferred in 2020; they paid full tuition and stayed at home! You spent those years learning about the economy, job employment and what you wanted to do. You're fine. Just focus on a major you like and that is in demand and work towards attending university",
      "author": "SkepticDrinker",
      "created": 1624502995,
      "upvotes": 1,
      "replies": {}
    },
    "gytttas": {
      "link": "/r/CollegeRant/comments/nezqhn/feeling_bummed_about_others_graduating/gytttas/",
      "text": "I feel you. I spent 4 years at cc and didn’t even get an associate degree. I was messing around, taking classes that didn’t matter, ended up transferring to a university and now only one class away from graduating. It may take longer than others, but you’ll get there. At least I believe you can.",
      "author": "sharetan",
      "created": 1621522030,
      "upvotes": 2,
      "replies": {}
    },
    "gyqumwc": {
      "link": "/r/CollegeRant/comments/nezqhn/feeling_bummed_about_others_graduating/gyqumwc/",
      "text": "You are doing a great job! I’m 33, and I spent 4-5 years at a CC because I had to work and had other life issues that didn’t give me support in my education. I’m STILL going to school and working toward my bachelors. Instead of comparing yourself in a negative light, look at how persistent and determined you are to not give up and create more life opportunities for yourself.",
      "author": "Hungryyy4",
      "created": 1621458621,
      "upvotes": 2,
      "replies": {}
    },
    "gyqke8a": {
      "link": "/r/CollegeRant/comments/nezqhn/feeling_bummed_about_others_graduating/gyqke8a/",
      "text": "A degree is a degree, and we are all on our own paths in life. \n\nMy mom is in her 40s and currently doing an associates because she always wished she went to college. \n\n&#x200B;\n\nPlus, it seems to me like you aren't going to have student load debt. At least not from the first two years anyway. That in itself is a huge accomplishment.",
      "author": "bs-scientist",
      "created": 1621454605,
      "upvotes": 3,
      "replies": {}
    },
    "gyjnx58": {
      "link": "/r/CollegeRant/comments/nezqhn/feeling_bummed_about_others_graduating/gyjnx58/",
      "text": "I feel this in so many ways. I graduated when I was 16 in Manila. 6 years later and still hasn’t started anything. I’ve been on and off with college too because off my mental illness. I’m going back this fall hopefully it works out. Don’t get bummed about it. We all have different paths in life. You’ll get there. :)",
      "author": "arfarf19",
      "created": 1621325499,
      "upvotes": 3,
      "replies": {}
    },
    "gyj0fzk": {
      "link": "/r/CollegeRant/comments/nezqhn/feeling_bummed_about_others_graduating/gyj0fzk/",
      "text": "You're doing fine! I took 5 years (well, assuming I don't fail the class I'm taking this semester and can graduate this semester) to get my associates degree.",
      "author": "SouthernRhubarb",
      "created": 1621308301,
      "upvotes": 5,
      "replies": {}
    },
    "gyj03ov": {
      "link": "/r/CollegeRant/comments/nezqhn/feeling_bummed_about_others_graduating/gyj03ov/",
      "text": "I'm proud of you for persevering even when times were tough! It may have taken you longer, but you didn't give up! You should be proud of yourself too! It doesn't matter how long it takes you to get there as long as you keep going.",
      "author": "ScubaLevi20",
      "created": 1621308111,
      "upvotes": 6,
      "replies": {}
    }
  },
  "updated": 1634063994
}