{
  "sid": "jz0nym",
  "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/",
  "title:": "lost all motivation",
  "text": "i have a 7 page essay due in less than 24 hours but i can't bring myself to write anything. i thought i could make it through the beginning of this semester but i have been depressed ever since the second week and recently i just feel like a failure. i cant tell if its because of remote learning or that im really not suited for college",
  "author": "Apprehensive_End8228",
  "created": 1606069864,
  "over_18": false,
  "upvotes": 167,
  "upvote_ratio": 1.0,
  "comments": {
    "gdb8612": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gdb8612/",
      "text": "I'm right there with you. My first semester is coming to a close but I have felt so overwhelmed, unmotivated, and discouraged. Full time and online is really taking a toll on me. I'm currently trying to switch to part time student for next semester. Hoping that it will help tone down some of the stress...",
      "author": "GeminiGirl1718",
      "created": 1606116265,
      "upvotes": 1,
      "replies": {}
    },
    "gdayvv5": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gdayvv5/",
      "text": "I felt the same way when I had a research paper to do. 😭 But honestly I told myself the better thing to do is to just start it to get it over with. \n\nPlay your favorite playlist take breaks in between . Reward yourself in between breaks . Do something while writing your paper. Honestly it helped me tremendously",
      "author": "Tina_reformed",
      "created": 1606108497,
      "upvotes": 1,
      "replies": {}
    },
    "gdatwck": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gdatwck/",
      "text": "Write it up. You got this.",
      "author": "CamoChild",
      "created": 1606105160,
      "upvotes": 1,
      "replies": {}
    },
    "gdaq9o4": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gdaq9o4/",
      "text": "I literally wrote a 7 page paper 2 days ago 😭😭\nGood luck 💗💗",
      "author": "tiffytiff101",
      "created": 1606102936,
      "upvotes": 1,
      "replies": {}
    },
    "gdaofm4": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gdaofm4/",
      "text": "(I'm gonna vent out too)\n\nSame thing here. Currently on 3rd Year college and our Tech Research instructor gave us a 200-page baby thesis project during our midterm and is due for Semi-finals. Midterm was on October 20 and our semis will be at the end of the month. Said he wanted everything compiled (all four chapters) for submission on that date, and they barely even discussed anything they just went and handed us pdfs straight out of Google docs without going in-depth of teaching them and on what we should do. Though I've completed the 1st chapter, I haven't touched it for a while now . But this time maybe after posting this comment I would start working on the remaining chapters. I hope you could start on yours, too. Plus, no you aren't a failure. Maybe all you need is time to de-stress your mind a bit. Take that time. Just not all of it though coz you might miss out on the deadline 😅. You can do this.",
      "author": "I_am_Ravs",
      "created": 1606101852,
      "upvotes": 1,
      "replies": {}
    },
    "gdanzy8": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gdanzy8/",
      "text": "7 pages aint that bad dude you got this. A lot of us been feeling like this. Only thing thats left for us to do is basically postpone our feelings until the next sort of break we get; save that shit for after the essay. Id rather be sad with a half-assed 7 page paper done at 11:59 than one that still needs to be turned in late.",
      "author": "GoScience123",
      "created": 1606101598,
      "upvotes": 2,
      "replies": {}
    },
    "gdaj8rm": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gdaj8rm/",
      "text": "Chances are they might not read it that carefully... Use speech to text, and just talk it out.",
      "author": "Hunterlegoking",
      "created": 1606098921,
      "upvotes": 2,
      "replies": {}
    },
    "gdainlu": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gdainlu/",
      "text": "What is your paper about? What class? How can we help get you motivated? I just finished a 10 page paper myself for English 102.",
      "author": "physics4thawin",
      "created": 1606098586,
      "upvotes": 2,
      "replies": {}
    },
    "gda7zgr": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gda7zgr/",
      "text": "Online is ass, stick to it until you've had college in-person. It's so much better (for me, at least).",
      "author": "muffinfight",
      "created": 1606092699,
      "upvotes": 1,
      "replies": {}
    },
    "gda6g54": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gda6g54/",
      "text": "we are in the same boat. I had my speech due for public speaking due on Friday. I didn’t even turn it yet bc I have to record it. None the less I have projects past due. I’m at this point of “ you’re gonna get it when you get it” idc about late deductions either.",
      "author": "shygirlsclub",
      "created": 1606091996,
      "upvotes": 1,
      "replies": {}
    },
    "gda22d7": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gda22d7/",
      "text": "Damnnn I wish I could upvote this 100000x. I really feel like this and I’m in my junior year... idek how I’m gonna get through another semester of online. Like I miss campus, the people I’d associate with and the freakin library...a library, like huh. Man I need to get my shir together before I fuq everything up/:",
      "author": "stephaniedun",
      "created": 1606090022,
      "upvotes": 2,
      "replies": {}
    },
    "gda163v": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gda163v/",
      "text": "Same. Still procrastinating on every assignment and that's really not ideal because you can't bullshit your way through STEM projects as easily. I end up pulling all nighters left and right and it sucks.",
      "author": "internally",
      "created": 1606089589,
      "upvotes": 1,
      "replies": {}
    },
    "gd9vpqv": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd9vpqv/",
      "text": "Hi OP. \n\nKeep going. \n\nYou’re almost there. \n\nWhenever I’d feel the overwhelming  pressure, I’d wanna give up cus it was the easiest thing to do. But I somehow pushed through and told myself: write what you can, but turn in something. If your instructor isn’t too harsh of a grader, some points are worth more than nothing. \n\nWho knows, maybe you’ll turn in a half decent paper? 🤷🏻‍♀️ best of luck.\n\nEdit: clarity",
      "author": "SecretMuggle",
      "created": 1606087119,
      "upvotes": 3,
      "replies": {}
    },
    "gd9q5c5": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd9q5c5/",
      "text": "ok I feel you",
      "author": "limevirgo",
      "created": 1606084522,
      "upvotes": 1,
      "replies": {}
    },
    "gd9jam3": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd9jam3/",
      "text": "be like naruto, never give up until you're the hokage. works every time",
      "author": "milomiso",
      "created": 1606081030,
      "upvotes": 2,
      "replies": {}
    },
    "gd9izl5": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd9izl5/",
      "text": "Completely understandable, I’ve felt the same way this semester and I’m currently procrastinating on some assignments. It’s still possible to do it or you can try to ask for an extension and write it little by little so it’s much easier to stomach :) Good luck, we’re rooting for you! 🍀",
      "author": "frankuvibes",
      "created": 1606080877,
      "upvotes": 2,
      "replies": {}
    },
    "gd9fadg": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd9fadg/",
      "text": "I honestly feel the same and am in a very similar situation. I have a mini project due at the end of the night tomorrow and I keep procrastinating. I don’t have any motivation to do it, and I feel depressed and my family is having issues right now so I’m extra distracted. I know the project is easy, and I’ve done much more difficult things in less time in the past but I just can’t convince myself as well to do it like I usually can. I’m so sorry that you’re struggling. But I think it is more due to the online learning then you being suited to college. Don’t let this crap semester convince you college is not for you, this semester is not a true example of what college is usually like I promise. I was fine, even great in college until COVID happened.",
      "author": "VWinterfell1918",
      "created": 1606079105,
      "upvotes": 5,
      "replies": {}
    },
    "gd9efsm": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd9efsm/",
      "text": "Sorry you're having so much trouble. Ya I have an assignment due today as well, but I'm not doing it out of principle. Lame but it's a small grade so I'm taking the L for a week. Can't seem to care, the assignment bothers me. With that being said, it's true, you do still have time.  Especially if you start now. Doesn't have to be the perfect essay. Just try to get SOMETHING in ya know? No matter how half assed it is. Anything is better than a 0. We're rooting for you!",
      "author": "vness1213",
      "created": 1606078713,
      "upvotes": 4,
      "replies": {}
    },
    "gd9chbg": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd9chbg/",
      "text": "You still have time, start working on it now. I’ve done a couple essays on the due day. Sometimes I’m not motivated to do it till it’s the last minute.",
      "author": "talex625",
      "created": 1606077793,
      "upvotes": 12,
      "replies": {}
    },
    "gd96k8t": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd96k8t/",
      "text": "We all are",
      "author": "fruithat123",
      "created": 1606075001,
      "upvotes": 1,
      "replies": {}
    },
    "gd960c6": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd960c6/",
      "text": "I understand your depression this semester. Doing online college is really tough! Coming from a college student who's been able to experience in-person classes, I promise it gets better..online classes are just really, really hard to get through! The past few semesters during covid have been extremely isolating and I too have felt a loss of motivation. You're not a failure! Just take it one step at a time, begin with writing a paragraph or two, and take a break. You got this, don't convince yourself you cant do it!",
      "author": "sorrryimlost",
      "created": 1606074756,
      "upvotes": 48,
      "replies": {}
    },
    "gd8v02k": {
      "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd8v02k/",
      "text": "My friend i totally get you it is rough. But when when you get that piece of paper saying you graduated itll be worth it",
      "author": "fruithat123",
      "created": 1606070197,
      "upvotes": 28,
      "replies": {
        "gd8zv3l": {
          "link": "/r/CollegeRant/comments/jz0nym/lost_all_motivation/gd8zv3l/",
          "text": "thanks, its my first semester of college too so i've been stressed by the workload and i am starting to doubt if i can do this for another 7 semesters. i just feel really exhausted and at the same time, i'm scared of failing.",
          "author": "Apprehensive_End8228",
          "created": 1606072023,
          "upvotes": 14,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634063004
}