{
  "sid": "p92m2t",
  "link": "/r/CollegeRant/comments/p92m2t/parking/",
  "title:": "Parking",
  "text": "\nRant.\n\n\nWhy after spending easily over 1k per class, and paying the stupid fees such as athletics or health (that most will never use or care about) must you also pay $1-4 an hour/ day to park? \n\nLike i can deal with all of the other areas to be fucked over. But why must they even insult students with such small insignificant needed fees on top. I would rather I pay a $100 semester parking fee instead up front instead of that BS. \n\n\nOffensive ^probably :\n\nHonestly surprised colleges aren’t the ones getting shot up (US obviously) with there being more reasons to hate the establishment over highschools. Not to even start with the personal politics involved. \n\n\n\n\nBack to regularly scheduled rant: \n\nWhy hasn’t anyone created a college actually for students. Where grading is based on material instead of tests and fees and payments are actually for things the student needs and uses..or are at least communal. \n\nMaybe it’s different in other places, but from what I have heard and seen it’s not too common if it is.",
  "author": "CJKS2348",
  "created": 1629592226,
  "over_18": false,
  "upvotes": 26,
  "upvote_ratio": 0.96,
  "comments": {
    "ha02t4y": {
      "link": "/r/CollegeRant/comments/p92m2t/parking/ha02t4y/",
      "text": "as someone who lives 5 mins away from my college, yet i’m considered off campus.. i’d rather pay $1-4 hourly then FUCKING $300 A FUCKING SEMESTER. for my 2 classes each day",
      "author": "PuertoRicoPapi",
      "created": 1629698334,
      "upvotes": 1,
      "replies": {
        "ha2twvl": {
          "link": "/r/CollegeRant/comments/p92m2t/parking/ha2twvl/",
          "text": "$300/semester would prob be cheaper than the hourly rate. Still a ripoff tho",
          "author": "BylvieBalvez",
          "created": 1629751556,
          "upvotes": 2,
          "replies": {
            "haax9tq": {
              "link": "/r/CollegeRant/comments/p92m2t/parking/haax9tq/",
              "text": "yeah no kidding. guess that’s what i get for attending a private college",
              "author": "PuertoRicoPapi",
              "created": 1629905354,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h9xcz32": {
      "link": "/r/CollegeRant/comments/p92m2t/parking/h9xcz32/",
      "text": "I’m debating if I should get a parking pass since I can drive  to school now (takes 15 minutes to get there depends on traffic) or should I have one of parents drop me off and pick me up since they work from home. Also, I only go to school for one class Monday-Thursday. I don’t know yet.",
      "author": "BoredasUsual88",
      "created": 1629650352,
      "upvotes": 1,
      "replies": {}
    },
    "h9webhx": {
      "link": "/r/CollegeRant/comments/p92m2t/parking/h9webhx/",
      "text": "It sucks, but since most colleges don't have enough spaces for all of their faculty, staff, students, and visitory, they will charge for parking in part to encourage people to find other ways to get to campus. That sort of makes sense, but what really gets me are the ridiculously expensive fines/punishments (withholding your degree??), and how parking offices/rules seem to be so impossibly complicated and exploitative. Make parking cheaper, yes, but also make it easier, more convenient, and less like a quick money grab.",
      "author": "griffinicky",
      "created": 1629632939,
      "upvotes": 6,
      "replies": {
        "hb5age4": {
          "link": "/r/CollegeRant/comments/p92m2t/parking/hb5age4/",
          "text": "Sadly my campus has plenty of parking. No real other alternatives to get there other than a 2 hour bus ride. Literally highway robbery",
          "author": "CJKS2348",
          "created": 1630468375,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9uw2xc": {
      "link": "/r/CollegeRant/comments/p92m2t/parking/h9uw2xc/",
      "text": "When you pay the 100 parking fee and then there’s never any parking spots :(",
      "author": "Kirbylover16",
      "created": 1629595923,
      "upvotes": 18,
      "replies": {
        "h9v35bm": {
          "link": "/r/CollegeRant/comments/p92m2t/parking/h9v35bm/",
          "text": "I think I’d rather that then literally 1 acre of lot and 5 4 story parking garages reserved for staff (at a school that is proud of its high student to teacher ratio) and you have to pay the fee to use any of them.\n\nAt least with not having the spaces it can just be lumped in with the rest of the useless fees.",
          "author": "CJKS2348",
          "created": 1629599367,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634063806
}