{
  "sid": "j35mhq",
  "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/",
  "title:": "Why do my professors not allow us to go back to previous questions for online exams?",
  "text": "To me it's a little ridiculous just because we're already using Honorlock for the exam so they'll see my whole process so what do they think I'm going to be doing? During in-person exams I always skip questions that I don't get at that moment and come back later. It's very frustrating not to have the option to do that. Having to instead spend my time on questions I don't get so I'm rushing questions at the end of the exam that I may have gotten if I had time. I don't know, just wanted to get that off my chest.\n\nEdit: Hey, thank you all for commenting and such! I think the the arguments for cheating are completely valid. The only thing that kind of differentiates this case is that Honorlock is a proctoring system. So before the exam I have to show ID and show my work space. It also has guidelines that prohibit background noise, so my roommates have to be silent. With a system watching me take the exam through my camera recording me, and recording my screen at the same time, I think that the cheating issues wouldn't be that big an issue. ",
  "author": "freetrialexpiredsry",
  "created": 1601546168,
  "over_18": false,
  "upvotes": 143,
  "upvote_ratio": 1.0,
  "comments": {
    "g7c3nt0": {
      "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7c3nt0/",
      "text": "# 1 rule of test taking is answer all the questions you know and go back and try to answer the ones you don’t know",
      "author": "perfectbarrel",
      "created": 1601589515,
      "upvotes": 2,
      "replies": {}
    },
    "g7b82fq": {
      "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7b82fq/",
      "text": "I have the same problem with c++ class and got A exam tomorrow, wish me luck",
      "author": "_readyforww3",
      "created": 1601575592,
      "upvotes": 5,
      "replies": {
        "g7bfm91": {
          "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7bfm91/",
          "text": "Good luck!",
          "author": "freetrialexpiredsry",
          "created": 1601578860,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g7b73xi": {
      "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7b73xi/",
      "text": "Because we’re told to by our admins and IT departments. \n\nOnline assessment is difficult and there are a lot of concerns regarding academic integrity with sharing answers/questions. As a result, administrators and IT departments have constructed “guidelines” for how assessments should be done online and I imagine many faculty follow them without thinking about it much. \n\nThere’s some merit to linear exams reducing cheating, but how much does it reduce cheating is questionable (in my experience you can give students the literal exam in advance and they’ll still have a normal distribution with their scores). \n\nI personally have never liked online exams, because it’s too difficult, in my opinion, to tell if it’s validly assessing student comprehension, especially if the exam isn’t proctored (which is its whole own other issue). Thankfully, we’re being permitted to waive finals this semester and I can experiment with other assessment methods instead of forcing students to deal with online exams.",
      "author": "Jonjoloe",
      "created": 1601575172,
      "upvotes": 5,
      "replies": {}
    },
    "g7b4oip": {
      "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7b4oip/",
      "text": "I used to work at my university’s blackboard support desk and my theory is it prevents students from forming cheating rings and taking the exam “together” (either virtually or in person) even with a question bank of 50 something questions that are pulled randomly and/or people get different versions but arranged questions. It forces the student to think for the moment at that question. I once indirectly blew the whistle on it when multiple people from the same class kept calling me asking why is the test set up the way that it was. Big oof y’all messed up. \n\nAlso a reason why, you could have question #6 say one thing, but question #12 directly answers question #6 in its context. \nI’ve had these exams and they are a pain, I’ll admit but seeing it from the other side definitely opened my eyes.",
      "author": "AXXII_wreckless",
      "created": 1601574134,
      "upvotes": 7,
      "replies": {
        "g7bfh78": {
          "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7bfh78/",
          "text": "Hey! That is a big oof on their end! I agree that some questions might provide direct answers, but at the same time if I were in an in-person exam we have all the questions in front of us anyway. I think it's the teacher's responsibility to create an exam in which those sort of questions do not appear on the same exam together. But I've never been a teacher so I won't claim to know how hard it is to make an exam.",
          "author": "freetrialexpiredsry",
          "created": 1601578803,
          "upvotes": 3,
          "replies": {
            "g7cxpm8": {
              "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7cxpm8/",
              "text": "It’s hard. We had to do a fake one as part of our training. Our questions were fun and light hearted like “Are Hot dogs sandwiches?”\nWhile sometimes they do make their own (types of questions fill in the blank,matching, exact text, etc.) they are usually importing the question bank directly from the book itself (they can also edit this if they wanted to) but most times a course designer is making the overall design of each test. they do work with the professor together, but that’s a stressful thing in itself. \nI can imagine now due to everything being online course designers aren’t doing as much as they usually do, there’s more training on the professors due to the overwhelming amount of work that has to be done this year.",
              "author": "AXXII_wreckless",
              "created": 1601605825,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g7avu7c": {
      "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7avu7c/",
      "text": "I agree that it’s not cool, but the professors I know do it because students are emailing/texting each other (and online tutoring services)  and so allowing them to go back to answers makes this easier to do while keeping in the timed exam.",
      "author": "imabe24",
      "created": 1601570198,
      "upvotes": 4,
      "replies": {
        "g7ccq5v": {
          "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7ccq5v/",
          "text": "But OP stated he was using an exam proctoring service. This doesn't apply here.",
          "author": "IntrovertTurtle2",
          "created": 1601594361,
          "upvotes": 1,
          "replies": {
            "g7cpotc": {
              "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7cpotc/",
              "text": "Good point, I guess I was thinking of other exams not being digitally proctored like that",
              "author": "imabe24",
              "created": 1601601497,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g7aqh88": {
      "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7aqh88/",
      "text": "I had this happen in physics 2 and the questions towards the beginning of the exam were the toughest. There was outrage but the professor insisted he was helping by formatting it like that. Honestly it did not help at all and made it more difficult than an in person exam.",
      "author": "thestrawbeery",
      "created": 1601567881,
      "upvotes": 9,
      "replies": {}
    },
    "g7an2fc": {
      "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7an2fc/",
      "text": "It's to force students to answer or admit they don't know the answer. On paper, this is a reasonable thing to want students to do but it completely ignores the entire purpose of the exam, which is to test your knowledge overall. So if you know it will take you a while to think up the answer, you can't move on, answer the dozens that you do know first and come back to it. So now you have to either take a point loss for not having *memorized* the answers (ie the thing competent educators *don't want you to do* because *memorization is not the same as learning*), go Russian Roulette and hope you selected the right one, or just sit there and waste valuable time because you've got a road block.\n\nIt's the tool of hacks who think they know far better than they do.",
      "author": "-LuciditySam-",
      "created": 1601566423,
      "upvotes": 33,
      "replies": {}
    },
    "g7a0lzn": {
      "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g7a0lzn/",
      "text": "I’ve honestly never understood the whole idea that only showing one question at a time ensures “exam integrity.”",
      "author": "Songibal",
      "created": 1601554332,
      "upvotes": 42,
      "replies": {}
    },
    "g79u5wh": {
      "link": "/r/CollegeRant/comments/j35mhq/why_do_my_professors_not_allow_us_to_go_back_to/g79u5wh/",
      "text": "Yeah I feel like it serves no purpose NOT letting students do this. Just let us have this one thing that would be allowed anyway if the test was on paper.",
      "author": "ripprinceandrey",
      "created": 1601548711,
      "upvotes": 65,
      "replies": {}
    }
  },
  "updated": 1634062648
}