{
  "sid": "jqnhru",
  "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/",
  "title:": "Can someone just tell me that it’s okay to fail an exam?",
  "text": "I’m sorry if this isn’t allowed, I’ll remove it if it’s not supposed to be here. I just didn’t know where else to post this.\n\nI have a physics exam tomorrow that I know I’m going to fail. I had a pchem exam and an orgo 3 exam a few days ago and after taking them, I just burnt out and didn’t study for physics at all. I’m so tired and I just need a break. This semester is killing me. I’m losing weight from stress and I’m exhausted all the time and I just needed to take a weekend off but now I’m feeling guilty for knowingly not trying. I just hate that college culture is working through burn out at the expense of your health.\n\nWe have four exams in physics, the lowest is dropped, and I’ve gotten over 100 on the first two because of the curves. I know that my grade is going to be okay but I just need someone to tell me that I’m not stupid for burning out and needing a break.\n\nTL;DR I’m a perfectionist and I need someone to tell me it’s okay to mess up.\n\nEDIT: I just really want to thank everyone who commented for the support. Since we’re remote, I don’t get as much support from my friends so this was very needed. It means so much to me and you all really helped feel better about this.  You’ve made it easier to pick myself back up. I have a week off for thanksgiving break before my next exam and I promise all of you that I’ll crush the next one. Thanks guys.",
  "author": "judolphphph",
  "created": 1604882963,
  "over_18": false,
  "upvotes": 51,
  "upvote_ratio": 0.95,
  "comments": {
    "gbqc29d": {
      "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbqc29d/",
      "text": "I can tell you personally that failing an exam won’t ruin anything. I usually finish classes with soaring grades and great numbers. Just last week I got a 58% on my exam. Took my grade to a C-. As long as you can keep your overalls grade where you want it, you’re fine!",
      "author": "Lil_Stapler",
      "created": 1604939350,
      "upvotes": 3,
      "replies": {}
    },
    "gbpj2lj": {
      "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbpj2lj/",
      "text": "hey, I just want you to know that every student fails an exam at least once in their lifetime. I've failed a number of exams, and I've failed three classes before, all math related. And I ended up at a competitive university that was my dream school and am on track to grad school. that's not to toot my horn or anything (for real,) it's just to show that you can still be successful even though you've failed at something. sometimes, you need to fail multiple times at first to succeed in the end. don't lose hope, and take care of your mental and physical health right now. get yourself a break, a real one. as a student, i'm personally always doing homework, always checking my email, and always organizing pretty much every day of the week. what I started doing is giving myself one full day of the week where I get to intentionally relax and do nothing school related. a day where i don't feel guilty doing so. i do this especially after exam days. you could even do a half day but just know that you are not stupid for burning out, and that it's OKAY to take a break. now go close your laptop and do something you enjoy <3",
      "author": "iridescent_skiess",
      "created": 1604920245,
      "upvotes": 2,
      "replies": {}
    },
    "gbpemx9": {
      "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbpemx9/",
      "text": "It’s more than ok. I was a lot like you once. But then I had too much going on and failed an exam. I was feeling like absolute garbage, but life must go on and I passed the class on my second try. And now I‘m much more relaxed, because I know it’s actually not that bad to fail a class, it does not define you or your worth as a person. And it sounds like your exam isn‘t even about passing or failing a class, it‘s just about having a good or an excellent grade, so you really shouldn‘t worry too much. Or at least try to.",
      "author": "alicecooperunicorn",
      "created": 1604915232,
      "upvotes": 3,
      "replies": {}
    },
    "gbpac3a": {
      "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbpac3a/",
      "text": "pchem, physics, and orgo 3 all in one semester? how could you not burn out?? you should be proud of yourself! everyone burns out at some point, you’re human. don’t let it consume you. you’re doing great",
      "author": "lilgoosebeans",
      "created": 1604910379,
      "upvotes": 2,
      "replies": {}
    },
    "gborkhx": {
      "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gborkhx/",
      "text": "I don't have a test due tonight but I do have an assignment. I thought I did all my work during the week (which I purposely did so that I could finally have a weekend off) but somehow I missed it and didn't know about it til yesterday when I got a text alert reminder. I just needed to get myself together this weekend so I've actively chosen to just not do it and although I feel kinda guilty since I can be a perfectionist when it comes to school as well. I'm not saying you SHOULDN'T study. HOWEVER, if you're burnt out and not gonna retain anything then try to at least get some rest. It happens. Especially this time of year when work is getting cramped in since the end of the semester is approaching (even though it doesn't feel like it)",
      "author": "vness1213",
      "created": 1604894660,
      "upvotes": 5,
      "replies": {
        "gboulj6": {
          "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gboulj6/",
          "text": "I’m sorry about your assignment but I have to say, I’m kinda glad I’m not the only one feeling this way. I know we’ll all get through it, it just sucks right now. Thank you.",
          "author": "judolphphph",
          "created": 1604896678,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gboret8": {
      "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gboret8/",
      "text": "It's okay to fail one exam. I had a solid C average for a year in undergrad (lots of personal issues). I have a PhD now. It's okay to fail one exam, it's what you do after that matters.",
      "author": "Cjb3z4",
      "created": 1604894561,
      "upvotes": 2,
      "replies": {
        "gbouf2b": {
          "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbouf2b/",
          "text": "Thank you, stories like that make me feel so much better. Congratulations on your success.\n\nI know it’s stupid to be so worried about it (especially since it’s going to be dropped anyway). I just really needed the reassurance. The prof for this class likes to go off at us for not trying hard enough and being “dumber than his 8th grader” so I’ve felt like I needed to be perfect all semester.",
          "author": "judolphphph",
          "created": 1604896555,
          "upvotes": 2,
          "replies": {
            "gbounfv": {
              "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbounfv/",
              "text": "I really dislike professors that do this. It can get better. Take time for yourself and make a manageable plan.",
              "author": "Cjb3z4",
              "created": 1604896713,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gboe3yq": {
      "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gboe3yq/",
      "text": "I failed physics once, it’s ok, retook it and did much better. Sounds like you can afford to fail one exam and not get penalized at all. Probably still smart to study some, but really if you’re already stressed to hell and back you should probably take some time to relax. You can fail some assignments, exam, even a whole class and be ok.",
      "author": "TWR3545",
      "created": 1604886784,
      "upvotes": 6,
      "replies": {
        "gboj0dn": {
          "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gboj0dn/",
          "text": "I actually really like physics. I’m a chem major so it’s not my main interest but the content is interesting. The class is just so fast paced it’s brutal. \n\nLike I know in my big brain that this exam will be dropped anyway and it’s not going to have any bearing on my grade whatsoever but my stupid lizard brain is afraid of failure and making me feel guilty about not trying hard enough. My department’s culture basically boils down to “if you’re not going hard 100% of the time, are you even trying?” and it’s really starting to get to me.",
          "author": "judolphphph",
          "created": 1604889540,
          "upvotes": 1,
          "replies": {
            "gbon6gz": {
              "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbon6gz/",
              "text": "Gotta purge that lizard brain then. Also you’ll probably feel better once it’s done and over",
              "author": "TWR3545",
              "created": 1604891989,
              "upvotes": 3,
              "replies": {
                "gbonxp3": {
                  "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbonxp3/",
                  "text": "You’re right, thank you mystery person for talking me down. I just really needed to hear that it was okay. I’ll do my best to purge my lizard brain.",
                  "author": "judolphphph",
                  "created": 1604892448,
                  "upvotes": 1,
                  "replies": {
                    "gbp5uok": {
                      "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbp5uok/",
                      "text": "You is welcome, good luck on the purge",
                      "author": "TWR3545",
                      "created": 1604905903,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gbo9gha": {
      "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbo9gha/",
      "text": "I feel the same way. Please remember to take care of yourself despite everything else. I know it’s hard but failing one exam is temporary and it does not mean that you are a failure ❤️",
      "author": "sophannabanana",
      "created": 1604884096,
      "upvotes": 12,
      "replies": {
        "gbocslk": {
          "link": "/r/CollegeRant/comments/jqnhru/can_someone_just_tell_me_that_its_okay_to_fail_an/gbocslk/",
          "text": "Thank you, that means a lot. It just gets to me because I know that I was capable of doing well on this exam, I just couldn’t bring my best anymore because of the burnout.\n\nI’ll try to take some time to night to just relax and try to deal with the fact that tomorrow whatever happens happens.",
          "author": "judolphphph",
          "created": 1604886031,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064449
}