{
  "sid": "rai5fr",
  "link": "/r/CollegeRant/comments/rai5fr/am_i_going_to_college_to_end_up_working_at_a/",
  "title:": "Am I Going to College to End Up Working at a Warehouse?",
  "text": "I've never enjoyed college. I don't like partying at all, friends are too much of an obligation so I keep my interactions somewhat limited, and I genuinely just don't really know what I want to be doing. I really like making music. And truthfully, that's all I have in mind.. is to make good music. And yes, that's the classic \"I'm not going to college - music is my calling\" response which I'm mature enough to realize is fairly unrealistic. Honestly, I've only been making awful music lately that I just end up deleting which puts me back into the \"I guess it's back to literally just existing throughout college.\" I'm happy though. My classes are done by noon, and I go to the gym, do my homework and study, and then work on my hobbies. My days are so fast it's like time isn't stopping anymore. So what do I do? I'm pursuing a finance degree, but I have a 3.3 GPA. I don't do any clubs, and I don't really want to because I like working on my hobbies. But my resume looks like the most average resume I've ever seen. I feel like I can't even score a good job with something like that. My dreams have always been to start my own business, or do music. I am definitely a dreamer. But I have no idea WHAT kind of business I could make - with no idea, I have no motivation to drop out and create a business that's just going to barely support me if it were just another generic business.\n\nWith a finance degree, I'd really want to work at a record label.. I feel like I'd be able to make some cool connections that would tie into my music passion. My parents are taking care of my college tuition which I am forever grateful and fortunate for, yet I still feel like I'm wasting my time. Does getting a job at a record label seem like a realistic goal? Also, despite wanting to be a producer/artist, I always procrastinate going to my desk and sitting down and creating. It's all very weird.\n\nThis seems like such a rant, and quite honestly it is just that. Do you guys have any advice? Such a weird time in life. Thanks.",
  "author": "chughzy",
  "created": 1638825844,
  "updated": 1639517972,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.87,
  "comments": {
    "hnjnekw": {
      "link": "/r/CollegeRant/comments/rai5fr/am_i_going_to_college_to_end_up_working_at_a/hnjnekw/",
      "text": "[deleted]",
      "author": null,
      "created": 1638845609,
      "upvotes": 5,
      "replies": {
        "hnjnkca": {
          "link": "/r/CollegeRant/comments/rai5fr/am_i_going_to_college_to_end_up_working_at_a/hnjnkca/",
          "text": "I have no idea what to do. I really don’t want to spend 50 years reaching a high rank in a financial firm just to be close to dying 🤷‍♂️",
          "author": "chughzy",
          "created": 1638845679,
          "upvotes": 5,
          "replies": {}
        }
      }
    }
  }
}