{
  "sid": "paa3cj",
  "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/",
  "title:": "Today was my first day of in-person classes in one and a half years, reminds me of how much I hate it.",
  "text": "What a waste of fucking time, energy and money. Forcing me to sit in a class that I couldn't give any less shits about listening to a monotone professor read off of some powerpoint slides. When I was online I could skip, or minimize the zoom or do some other more productive shit. Now it's in-person and I have to sit in the class and pretend like a little goody-two shoes that I give a shit when I don't. Have to spend money to commute and on top of all that shit, you got the pandemic. Great. Fucking great. Schedule ruined. Everything ruined. I could workout during a online class, now I gotta sit on my ass and stare. I could do homework or do my passion, but no now I gotta sit and stare. Fuck in-person classes.",
  "author": "jhf6782",
  "created": 1629756728,
  "over_18": false,
  "upvotes": 69,
  "upvote_ratio": 0.79,
  "comments": {
    "ha6zw04": {
      "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha6zw04/",
      "text": "Omg this. Covid made me realize my love for online classes. I hate hate hate in person classes that fucking suck. I would change but now it’s too late so I feel your pain",
      "author": "sadgirlxxx00",
      "created": 1629830459,
      "upvotes": 5,
      "replies": {}
    },
    "ha672s1": {
      "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha672s1/",
      "text": "I don’t get it...Why not switch to online? Is your school making in person mandatory?",
      "author": "whatwhatchickenbutt_",
      "created": 1629818917,
      "upvotes": 6,
      "replies": {}
    },
    "ha3uszy": {
      "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha3uszy/",
      "text": "YES, YESSS! Literally my sister, u/APGalore21 and I’s problem as well! 😩😄",
      "author": "Fristi2147",
      "created": 1629767849,
      "upvotes": 1,
      "replies": {
        "ha3v7ws": {
          "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha3v7ws/",
          "text": "So True! Period!",
          "author": "APGalore21",
          "created": 1629768035,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ha3ignp": {
      "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha3ignp/",
      "text": "Attempt to take notes or actually learn the material, I know it SUCKS sometimes but try to remember that education/knowledge is a priviledge. Hell, if you can afford to, buy you a new special notebook or pencil and see if that will get your gears turning.",
      "author": "toofeduptocare",
      "created": 1629762233,
      "upvotes": 19,
      "replies": {
        "ha3mzv9": {
          "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha3mzv9/",
          "text": "Wow! \"learn the material\" you think I don't? I have a 4.0! Oh wait, grades don't mean shit because they're all fucking inflated! I assume you think I'm sort of slacker whiner, good stereotyping. I hope you realize students on the opposite side of slackers feel the same way for different reasons. Slackers hate classes because they want to be lazy, other students hate classes because it wastes their time and they want to do something more productive like an actual *relevant* class to their interests.\n\nThis is r/collegerant not r/\"be grateful you can have an education\". No shit I know it's a privilege  but it doesn't mean I can't be upset about it. Just because I have food to eat doesn't mean I can't complain about the food I'm eating. What a stupid false dilemma.",
          "author": "jhf6782",
          "created": 1629764349,
          "upvotes": -8,
          "replies": {
            "ha4evbb": {
              "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha4evbb/",
              "text": "Why are you being so aggressive? This person was just trying to encourage you to make the best of a situation that you do not personally like. Plus the way you made it sound, it seemed like you weren’t trying actively trying to listen to the zoom. This person was trying to explain that maybe listening intently might help you to enjoy the class and see the benefits of being in said class.",
              "author": "Street_Historian_598",
              "created": 1629777667,
              "upvotes": 24,
              "replies": {
                "ha5c2ro": {
                  "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha5c2ro/",
                  "text": ">Attempt to take notes or actually learn the material  \n>  \n>see if that will get your gears turning\n\nYou read these? He knows exactly what his dumbass was implying and decides to backtrack and cover it up as some \"positive\" asswipe. See through the lies my guy. you like everyone else lap up shit like there's no tommrow. and then when that person turns out to be a bad person you're all in shock. same problem with shit like celebrity worship.",
                  "author": "jhf6782",
                  "created": 1629803378,
                  "upvotes": -15,
                  "replies": {}
                }
              }
            },
            "ha3ougx": {
              "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha3ougx/",
              "text": "No, you can have damn 5.0 but that doesn't mean that you are actually learning and understanding the material. I never thought or claimed you were a slacker either, because I don't personally know you and I didn't know your GPA before this interaction either. \n\nI'm just trying to encourage you to try and find something positive about the classes you take, regardless of how relevant they are. Even the smartest person alive still has a lot to learn.",
              "author": "toofeduptocare",
              "created": 1629765189,
              "upvotes": 22,
              "replies": {
                "ha4ewxv": {
                  "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha4ewxv/",
                  "text": "Exactly",
                  "author": "Street_Historian_598",
                  "created": 1629777694,
                  "upvotes": 12,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ha3gypk": {
      "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha3gypk/",
      "text": "💯 percent this! Let me go back to online classes! I hate it here and I’m miserable!",
      "author": "BoredasUsual88",
      "created": 1629761531,
      "upvotes": 30,
      "replies": {
        "ha88vyy": {
          "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha88vyy/",
          "text": "Sameeee",
          "author": "xwintercandyapplex",
          "created": 1629849338,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ha39vwf": {
      "link": "/r/CollegeRant/comments/paa3cj/today_was_my_first_day_of_inperson_classes_in_one/ha39vwf/",
      "text": "Fuck you!",
      "author": "Thewarrior556",
      "created": 1629758330,
      "upvotes": -9,
      "replies": {}
    }
  },
  "updated": 1634063371
}