{
  "sid": "rcy9r0",
  "link": "/r/CollegeRant/comments/rcy9r0/almost_there_not/",
  "title:": "Almost there? Not.",
  "text": "So like I always do, I waited until almost last minute to get my semester projects done. Submitted my web development and programming projects and got full points. Almost done with my database project and theeeeennn I looked at my small business project and I have to write a 20 page business plan. Just kill me now. I started it last night and made a bit of progress but it’s rooouuggh. I picked a half ass business idea in the beginning of the semester since I don’t actually plan to start a business and I dread writing about it every time. This class has been the worst and I can’t wait for it just to be over. I’d deal with programming headaches all day if it meant never writing another thing about this small business. 😩",
  "author": "sidewalkeater",
  "created": 1639104685,
  "updated": 1639517914,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hny4bww": {
      "link": "/r/CollegeRant/comments/rcy9r0/almost_there_not/hny4bww/",
      "text": "I hate thinking like a business major. Can’t wait to return my BIS book and never see it again",
      "author": "AppleTreeBloom",
      "created": 1639110461,
      "upvotes": 2,
      "replies": {
        "hnz367e": {
          "link": "/r/CollegeRant/comments/rcy9r0/almost_there_not/hnz367e/",
          "text": "Agreed. This has easily been the worst class I’ve ever taken, but the teacher is half the problem. He just assigns a shit ton of work and calls it a day. Literally just posts as many exercises out of the book as he can. There’s no lectures, no actual class, and then on his tests he’ll have questions such as “As discussed in class…” and multiple questions with similar answers or possible answers to trick you. Im just staring at it like…wut? Lol. Oh well, it’s almost at the end.",
          "author": "sidewalkeater",
          "created": 1639134633,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnyxe39": {
      "link": "/r/CollegeRant/comments/rcy9r0/almost_there_not/hnyxe39/",
      "text": "Had to write two business plans this quarter. I’m so burned out.",
      "author": "hammydogvomit",
      "created": 1639129851,
      "upvotes": 2,
      "replies": {
        "hnz39to": {
          "link": "/r/CollegeRant/comments/rcy9r0/almost_there_not/hnz39to/",
          "text": "I feel for you. Writing one is bad enough, I couldn’t imagine having to write another one.",
          "author": "sidewalkeater",
          "created": 1639134712,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}