{
  "sid": "qswcmh",
  "link": "/r/CollegeRant/comments/qswcmh/stem_major_struggles/",
  "title:": "STEM major struggles",
  "text": "Hello everyone,\n\nI'm almost halfway through my college experience and it's been a struggle. I think most of these struggles have come from my gap between expectations and reality. I went into college thinking I would do research in a STEM field. I would watch documentaries and read books about science. I was wowed by the way that these scientists viewed the world, that they could find beauty from equations. I also enjoyed and was good at my science classes in middle/high school, so it seemed like the right choice.\n\nComing into college, the STEM field was presented to me in a very practical, non-fantastical way. It's childish, but the idea that I would be discovering things for an industry/product and not because I was unraveling the secrets of the universe depressed me. To make things worse, I have an issue where I hyperfixate on my grades, which makes me anxious and stay away from my course material, which further kills my curiosity. I can't stick to a major. I've gone from materials science engineering to biochemistry, but I've also considered microbiology, chemistry, or just giving up on STEM and pursuing architecture/some other creative major. And now I'm thinking about physics, but I have a strong feeling I like the idea of it and would not muster up the discipline to actually do the classes.\n\nI have a friend who is a physics major over at Columbia. He's passionate about the major and does the work for it dutifully too. I look up to him and am envious of his sense of purpose. We were talking one time and he mentioned that he didn't like most classes he was taking, but still enjoys pursuing his major and I think about this a lot.\n\nI don't really have a strong sense of self or purpose that outweighs my perfectionism. I don't understand what it is I actually enjoy in reality, not just in my head. I'm thinking of dropping out of college and returning at a later point. I could kick my phone addiction, meditate, travel for a while and get a better sense of reality, who I am, and what I really want. I just really want something to change and so far it hasn't.",
  "author": "watermelon-555",
  "created": 1636789721,
  "updated": 1637182333,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.86,
  "comments": {
    "hkgk58s": {
      "link": "/r/CollegeRant/comments/qswcmh/stem_major_struggles/hkgk58s/",
      "text": "Engineering is going to be more about designing and building something than a pure science. A pure science as an undergrad will still be mostly learning the basics of the field. A PhD is really where you get to do new research.",
      "author": "s1a1om",
      "created": 1636813729,
      "upvotes": 3,
      "replies": {}
    },
    "hkh9yf5": {
      "link": "/r/CollegeRant/comments/qswcmh/stem_major_struggles/hkh9yf5/",
      "text": "Are we the same person? I am in the exact same predicament my friend i am leaving school and have no idea what do next but i know i will come back because the only thing i love in this world is learning about science and the universe but i chose aerospace Engineering for 3 years i was doing okay but COVID worsened my depression and anxiety and i was just diagnosed with adhd so a break and reevaluating my life’s purpose is what I’ll have to do for a while i thought of just traveling for a couple months but will see",
      "author": "WonderfulAd634",
      "created": 1636825400,
      "upvotes": 1,
      "replies": {}
    },
    "hkk2axi": {
      "link": "/r/CollegeRant/comments/qswcmh/stem_major_struggles/hkk2axi/",
      "text": "I’m a physics major doing research in cosmology who over romanticized it as well. I would definitely not do physics if you’re already worried about not doing the coursework. I luckily have grown to love it but it’s definitely not what the documentaries make it out to be. I still romanticize some aspects but sometimes you can’t afford to without making yourself look dumb",
      "author": "FigBar_",
      "created": 1636870836,
      "upvotes": 1,
      "replies": {}
    },
    "hkmg96l": {
      "link": "/r/CollegeRant/comments/qswcmh/stem_major_struggles/hkmg96l/",
      "text": "I loved science (particularly chemistry) in high school; I was quite good at it, and had teachers that made classes fun, while also encouraging me to pursue that interest further in my own time. So, I go to college intending to major in chemistry, and I absolutely *hated* it, to the point that I stop going to any of my classes and get kicked out at the end of my 1st year. \n\nAt that point, I enlisted in the Army, and eventually ended up becoming a military bomb technician--a field in which my interest in chemistry proved extremely useful (there were a couple of times in Afghanistan where I'm pretty sure the stuff I learned tinkering in my basement lab saved my life...) I loved that job, and the only reason I got out is that I was about to be promoted into desk job that I had no interest in.\n\nAnyway, the point is NOT that you should go join the Army. More that there are lots technical fields in which having a solid *qualitative* grasp of scientific principles can be both useful and rewarding in an immediate and practical sense that often seems to be lacking in academic science education (particularly at the undergraduate level.) \n\nSomewhere, there is a niche that fits you, but knowing what it is (or even how to look for it effectively) isn't always easy to figure out.",
      "author": "CubistHamster",
      "created": 1636917516,
      "upvotes": 1,
      "replies": {}
    }
  }
}