{
  "sid": "qyy7xe",
  "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/",
  "title:": "I don't understand how anyone gets this shit done in a clean 4 years, man",
  "text": "Like I'm only in community college right now but between figuring out what I actually want to pursue in life and taking the classes to get there I can't see how anyone can finish in four years. I'm already predicting to be in cc for 3 years at the very least... :/ I dunno.",
  "author": "oyasumiee",
  "created": 1637511227,
  "updated": 1639872563,
  "over_18": false,
  "upvotes": 221,
  "upvote_ratio": 0.98,
  "comments": {
    "hliyiiv": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hliyiiv/",
      "text": "From a quick google search, apparently the average student take 6 years to graduate.",
      "author": "unholymanserpent",
      "created": 1637512851,
      "upvotes": 97,
      "replies": {
        "hlkndfj": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlkndfj/",
          "text": "It took me like 10 yrs lol",
          "author": "self_depricator",
          "created": 1637537812,
          "upvotes": 20,
          "replies": {}
        }
      }
    },
    "hliy99k": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hliy99k/",
      "text": "I agree. I think the reality is many people don't. At least, at my school graduating in 5 years is also considered on time.",
      "author": "khgsst",
      "created": 1637512746,
      "upvotes": 61,
      "replies": {
        "hljk3aj": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hljk3aj/",
          "text": "At my university, students tend to do internships and co-ops, and sometimes double major as well, which means the typical student at my school graduates in five years instead of four.",
          "author": "min_mus",
          "created": 1637521509,
          "upvotes": 21,
          "replies": {}
        }
      }
    },
    "hljhyz0": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hljhyz0/",
      "text": "The way my advisor described it, the degree plans can be done in 4 years but that course load can be a lot on people so people will usually go 4 classes a semester instead of 6 to have a more manageable work load. I'm a environment science major and while I can be down in 4 years, it average years to complete it is 4.5-5 years",
      "author": "nooter70",
      "created": 1637520693,
      "upvotes": 27,
      "replies": {
        "hlkwpsc": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlkwpsc/",
          "text": "This made me feel so much better about being a  junior still at 24 when a lot of people I know are graduated with adult jobs already",
          "author": "msgingersnap",
          "created": 1637542069,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hljji0z": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hljji0z/",
      "text": "Yupp. In CC and doing a full time job to support myself. I’m not going to graduate on time lmao",
      "author": "dancin_disco_daddy",
      "created": 1637521277,
      "upvotes": 20,
      "replies": {
        "hlk3ll6": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlk3ll6/",
          "text": "Same here and I have to work.",
          "author": "TragicalKingdom",
          "created": 1637529260,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hlky7k3": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlky7k3/",
      "text": "When I graduate next fall, it will have taken me about 7 years. \nWhen I first graduated high school, I was undecided and took gen ed courses at my community college for a few semesters. Then I took a year off because I had no idea what I wanted to do. I went back, took another course, then took another year off. I honestly struggled with finding the motivation to continue and I also hated in person classes because of social anxiety. \nWhen I finally figured out what I wanted to do, I tried taking as many courses as I could while still working a full-time job. It took me 2 additional years to get my associates degree and now I am in pursuit of my bachelors (which should be completed by next fall).\n\nWord of advice: take your time and learn more about yourself and what you like. There’s really no rush. It’s better to think hard about it and immerse yourself in possible degree/career paths rather than jumping into a major you may end up hating.",
      "author": "taurustheghost",
      "created": 1637542768,
      "upvotes": 12,
      "replies": {
        "hlncqwj": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlncqwj/",
          "text": "This is really good advice.  I used to teach in a community college, and have raised three kids.\n\nThere are a couple of factors at work here.\n\n1. College is super expensive; instead of a few thousand dollars for an extra year it can be 10s of thousands of dollars.  Parents got pissed about this and demanded colleges reduce the time-to-graduation.  This resulted in students being driven to declare a major within a semester of entering college and no wiggle-room in their track.\n2. By and large, an 18 year old really doesn't know what they want to do in life.  But they are forced into a decision.  The first couple of years:  No big deal.  But then stuff gets *hard*, and you see all these threads about \"I'm so burnt out\" or \"I haven't studied all semester\" or \"I have no motivation.\"  It's normal for motivation to wax and wane a bit, but it should recover by itself.  What's going on here is indicative of something much deeper— like feeling stuck on the wrong track.\n\nSo it's good to take a bit of time to figure things out.  My youngest went through this.  He's the most academic of all my kids, but he dropped out of his third year in physics/engineering to join the Marines!  He needs some time and experience to figure out what he wants to do in life.",
          "author": "StudySwami",
          "created": 1637595458,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlkxx3n": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlkxx3n/",
      "text": "I think the 4 year thing is a bit dated at this point. Can it be done? Sure. But is it as practical as it used to be. I personally don’t think so. \n\nCollege is much more expensive than it used to be causing students to spend more time working to pay for the classes. Also degree requirements are constantly being “upgraded” to make it more competitive. I changed my major halfway through and was told if I just entered as that major it would have been easier because they added a study abroad requirement and a few additional classes you can only take on specific semesters. So you miss that semester or the class fills up, you could wait another year despite having everything else done. I also think there’s a larger emphasis on field experience. These classes take more time and energy than a typical class (travel, prep, etc.).",
      "author": "Katelynnjanet",
      "created": 1637542629,
      "upvotes": 6,
      "replies": {}
    },
    "hllxd8r": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hllxd8r/",
      "text": "Omg. I feel like society thinks it’s takes about the same amount of years to graduate college in the same about high school. But in high school you don’t have to worry about classes getting filled up or figuring out what classes you need to take. The stereotype of that college needs to be fours years is just really unrealistic.",
      "author": "Loud-Collection-6242",
      "created": 1637560782,
      "upvotes": 6,
      "replies": {}
    },
    "hlkme1s": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlkme1s/",
      "text": "Im in 5th year dude and Im probably going to need one more year after that. Everyone graduates within their own time. The biggest thing is that you graduated!!!!",
      "author": "Brian2017wshs",
      "created": 1637537366,
      "upvotes": 5,
      "replies": {}
    },
    "hll2c4k": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hll2c4k/",
      "text": "I graduate in 6 months and it has taken me 5 years. A friend of mine has spent the same amount of time in cc. I’ve learned overtime everyone has their own path to graduating. Some people don’t start college until their late 20’s, some people take time off (I did), some people change their majors and have to restart\n etc.",
      "author": "Midnighttonigght",
      "created": 1637544731,
      "upvotes": 6,
      "replies": {}
    },
    "hlk0yy8": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlk0yy8/",
      "text": "Everyone graduates at their own speed. I did my bachelors in 3 and spent another 4 on a doctorate. My SO spent 5 years on a bachelors. My younger sister spent 4 years, older sister spent 4.5, Brother in law spent 5.5 years. We all finish degrees at different speeds.",
      "author": "Concerned-23",
      "created": 1637528224,
      "upvotes": 10,
      "replies": {}
    },
    "hll1cdy": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hll1cdy/",
      "text": "i made the horrible mistake of taking 21 credits this semester at my local CC because i wanted to transfer just in time, and i’m currently dying inside :’)",
      "author": "sourcherrykun",
      "created": 1637544257,
      "upvotes": 3,
      "replies": {}
    },
    "hll5kxa": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hll5kxa/",
      "text": "i feel the same way. part of me wants to drop out already and do a trade but i also feel inclined to keep going to community college because of the importance my family places on it.",
      "author": "thrwaway839202",
      "created": 1637546238,
      "upvotes": 4,
      "replies": {}
    },
    "hlliycu": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlliycu/",
      "text": "You can't four year degrees are a thing of the past they want more money out of you now so they require more classes",
      "author": "DizzyMajor5",
      "created": 1637552640,
      "upvotes": 4,
      "replies": {}
    },
    "hllx7ag": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hllx7ag/",
      "text": "It's rough. Graduating in 4, at the very least, requires outside financial support (full scholarship, heavy loans and/or parents) and a couple summer/winter sessions. I'm managing to graduate in 4 only because of my parents support and the fact that I'm attending state school with a state scholarship for tuition. Still have to pay in full for the summer and winter sessions....\n\nEven still, I'll have my bachelor's in the spring and I don't feel like I've learned enough. There's so much to do and so many things to research and write about. I'm definitely going for a post grad degree of some sort, but have to work for a year or two at least before applying :'( I almost wish my scholarship was such that I could draw out my bachelor's an extra year or two. \n\nHang in there buddy, you'll get through this and might just leave wanting more lmao",
      "author": "coastalpillar",
      "created": 1637560671,
      "upvotes": 5,
      "replies": {}
    },
    "hljcwla": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hljcwla/",
      "text": "You can’t anymore without taking at least 15 hours at my uni. They have added so many hours required to graduate you have to be over the minimum to graduate in four years. My advisor suggested I take 21 hours next semester. 😐",
      "author": "lem0n-lacroix",
      "created": 1637518740,
      "upvotes": 16,
      "replies": {
        "hlk1ffc": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlk1ffc/",
          "text": ">without taking at least 15 hours\n\n\n….uuhhhhhh 15 is like the “normal” load…?",
          "author": "IthacanPenny",
          "created": 1637528400,
          "upvotes": 12,
          "replies": {
            "hlk1leb": {
              "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlk1leb/",
              "text": "12 hours is my state’s official full time status, 15+ required to graduate in 4 years as opposed to 5-6.",
              "author": "lem0n-lacroix",
              "created": 1637528463,
              "upvotes": 3,
              "replies": {
                "hlk2c3k": {
                  "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlk2c3k/",
                  "text": "Yes. 12 is the *minimum* load to be considered full time. So like if you start at 15 and have to drop one normal 3 credit class you can maintain “full time” status and it won’t have scholarship implications. But yeah 15 is standard pretty much across the board. It’s not an absurd requirement.",
                  "author": "IthacanPenny",
                  "created": 1637528752,
                  "upvotes": 22,
                  "replies": {
                    "hlk6s8k": {
                      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlk6s8k/",
                      "text": "Yes? I’m not debating that and mentioned 15 was minimal. The absurd bit was my advisor suggesting I take 21 hours to graduate in four years.",
                      "author": "lem0n-lacroix",
                      "created": 1637530596,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlk3k6s": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlk3k6s/",
      "text": "Same smh same here,",
      "author": "TragicalKingdom",
      "created": 1637529244,
      "upvotes": 3,
      "replies": {}
    },
    "hlki92l": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlki92l/",
      "text": "Does it depend on which school you going to? I’m having a minor rn and my advisor told me that I’m capable of moving the minor to double major and still be able to graduate early in 3 year. The course load will range from 16-18 credits per sem and it seems manageable to me tho",
      "author": "remisme",
      "created": 1637535511,
      "upvotes": 3,
      "replies": {}
    },
    "hlm0h7d": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlm0h7d/",
      "text": "It really depends on the person. You go at your own speed and stop comparing yourself to others. I know people who've graduated in 3,4,5,6+ years. It doesn't matter when you graduate, you got it",
      "author": "milkteacream",
      "created": 1637562920,
      "upvotes": 3,
      "replies": {}
    },
    "hlkoob0": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlkoob0/",
      "text": "I would've finished my degree on time, had the pandemic not happen. Now I realize I'm such a fool.",
      "author": "HJSDGCE",
      "created": 1637538391,
      "upvotes": 2,
      "replies": {}
    },
    "hlld40p": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlld40p/",
      "text": "They don't. The 4-year degree was a myth even when I was an undergrad 15 years ago - unless you don't work, take *at least* 15 credits/semester, and know exactly what your major will be from day one. Maybe it worked back when Boomers roamed campus and paid for their tuition with a handshake and a promise to fuck over their kids'/grandkids' lives, but not now.",
      "author": "griffinicky",
      "created": 1637549795,
      "upvotes": 2,
      "replies": {
        "hllqlqy": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hllqlqy/",
          "text": "It can be done but a lot of things have to go right. You can take 12hrs every semester so in 4 years you’d be at 96hrs. You also have 4 summers, assuming 1 summer you only do an internship, you have 3 summer minimesters to take 24 hours. That’s 8 credit hours during each of those summers which is 2 classes over the summers. Plus if you graduated with some AP/dual credit from high school it makes it easier. And this can be done working part time saturdays too.",
          "author": "Nanami_overtime",
          "created": 1637556602,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hllhzgl": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hllhzgl/",
      "text": "No big deal, homie. We all go at our own pace. It’s taken me 3 yrs to transfer out of my cc and I haven’t even been working for the last yr of it. I start at my uni in the spring and I am gonna be taking 17 units but who knows if I’ll get out in 2 yrs as I am hoping. My advisor keeps saying people can get out in 3 semesters but I won’t hold my breath because I know the work load is going to be heavy. You’re done when you’re done. It’s not a big deal if you can’t get it all done in 4",
      "author": "drmantistobbogen",
      "created": 1637552161,
      "upvotes": 2,
      "replies": {}
    },
    "hlm2kf5": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlm2kf5/",
      "text": "it took me 5 years, i could’ve done it in 4 years but i double majored +  was working and i didn’t want to stress myself more than what i already was. I went to CC for 2 years and 3 years at 4 year university. Staying a 5th year was the best decision i made for myself. \n\nYou gotta remember that this is your life and you’re on your own timeline.",
      "author": "Kitycat18",
      "created": 1637564439,
      "upvotes": 2,
      "replies": {}
    },
    "hlkmjdh": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlkmjdh/",
      "text": "How are some of you people taking so much units per semester? I would be able to do full-time school, but that means that I would have to be single, take all distractions away from my life, do a part-time job (maybe not even a job). Like, I can’t imagine myself taking 4-5 classes per sem, and then having to deal with finals and projects due at the end of the semester… idk some of yall are just liars or just built different.",
      "author": "Zosoluna16",
      "created": 1637537434,
      "upvotes": 5,
      "replies": {
        "hllpz7q": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hllpz7q/",
          "text": "I think it depends on the major. I used to be a biology major, and 18+ credits would have been impossible for me unless I let my gpa drop below a 3.5. I’ve since changed majors to web development and I think I could handle 18+ credits if I had to and stil maintain a good gpa",
          "author": "Shalkic",
          "created": 1637556252,
          "upvotes": 2,
          "replies": {
            "hlql3q2": {
              "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlql3q2/",
              "text": "I’m currently majoring in business adm, and my counselor just told me that I’m going to end up transferring over from a community college to a university and I have to do 60 units at the University… and I heard that a bachelors degree doesnt even give you anything now-a-days. I think im going to finish my 2 Associates degrees in Business at this community college, and drop out or something.",
              "author": "Zosoluna16",
              "created": 1637647489,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hlmdm5h": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlmdm5h/",
          "text": "I wonder this too. I had a friend with a part time job who still managed to take 5 classes. It was unthinkable to me. I'm sure you get burnt out quick doing that.",
          "author": "globalwar_ming",
          "created": 1637573532,
          "upvotes": 2,
          "replies": {
            "hlqkb7x": {
              "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlqkb7x/",
              "text": "Exactly! Some people might be able to do it but for how long before the end up getting getting burnt out… i’m starting to be convinced that some people are just built different or they are just inhaling Adderall every day lol",
              "author": "Zosoluna16",
              "created": 1637646970,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hljyan5": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hljyan5/",
      "text": "The only reason why I’m graduating on time is because I took 8 credit over the summer between my sophomore and junior year, and I take at least 14 credits every semester.",
      "author": "denver_rose",
      "created": 1637527160,
      "upvotes": 4,
      "replies": {}
    },
    "hlkob0b": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlkob0b/",
      "text": "I found college was less stressful than HS where I had 6 classes a day, worked part-time and also attended school events.  College was 2 or 3 classes every other day. I still worked part time and attended school activities.  I didnt have to do chores everyday like I did in HS either.  I graduated on 3 years from a major university but was able to test out of 18 hrs.\n\nAll three of my children graduated college in 4 years.  All 3 were very involved in college sports and/or extra-curriculars and all had part time jobs.",
      "author": "moisme",
      "created": 1637538226,
      "upvotes": 1,
      "replies": {
        "hllq8ec": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hllq8ec/",
          "text": "To me hs was way harder",
          "author": "Shalkic",
          "created": 1637556394,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hljau4m": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hljau4m/",
      "text": "They do their work, study, and pass their classes\n\nEdit: this sub just wants to complain about college without wanting to hear how anything may be even slightly their fault.",
      "author": "din0d0nut",
      "created": 1637517906,
      "upvotes": -17,
      "replies": {
        "hljou37": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hljou37/",
          "text": "You like to complain about how not everyone is a perfect little egg like you.",
          "author": "Comrade_Corgo",
          "created": 1637523344,
          "upvotes": 7,
          "replies": {
            "hljv54f": {
              "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hljv54f/",
              "text": "> GenZedong user who thinks they’re going to overthrow capitalism\n\n> can’t even do their assigned homework",
              "author": "din0d0nut",
              "created": 1637525892,
              "upvotes": -2,
              "replies": {
                "hlleqru": {
                  "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlleqru/",
                  "text": "I don't think I'm going to overthrow capitalism because there are too many dummies like you in the states.\n\nI do my homework, I just think people like you are insufferable little pricks.",
                  "author": "Comrade_Corgo",
                  "created": 1637550581,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "hljkivc": {
          "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hljkivc/",
          "text": "I know plenty of students who graduate in four years. They either did nothing but school for four years--no outside jobs and no vacations--or they did just enough to pass (\"Cs get degrees!\").",
          "author": "min_mus",
          "created": 1637521673,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hlmd3d0": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlmd3d0/",
      "text": "Agreed. It has been 4 years officially for me, but I'm nowhere near finished. I could've been done, but I chose to have a manageable workload. A couple of my friends who are also in university are taking gap semesters. It's tough.",
      "author": "globalwar_ming",
      "created": 1637573061,
      "upvotes": 1,
      "replies": {}
    },
    "hlmsdcw": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlmsdcw/",
      "text": "I did mine in 3 years. It was those summers that really put me over. I would end up taking 8 or 9 classes each time",
      "author": "AgeofPhoenix",
      "created": 1637585226,
      "upvotes": 1,
      "replies": {}
    },
    "hln1xfl": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hln1xfl/",
      "text": "I graduated from University in two years with a BS. And all I can say is overload as much as you can and dont take “summer break” off. That’s honestly the only way I got through as incredibly fast as I did.",
      "author": "loungegirl",
      "created": 1637590541,
      "upvotes": 1,
      "replies": {}
    },
    "hlk5tcv": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlk5tcv/",
      "text": "It's not supposed to take longer......but everyone's circumstances are different.",
      "author": "KindnessRule",
      "created": 1637530185,
      "upvotes": -5,
      "replies": {}
    },
    "hlk4wk0": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hlk4wk0/",
      "text": "I don’t know what schools you all go to because I took four classes every semester and graduated in four years. I guess my school had less requirements? Idk",
      "author": "Gerardo1917",
      "created": 1637529801,
      "upvotes": -2,
      "replies": {}
    },
    "hm8l90u": {
      "link": "/r/CollegeRant/comments/qyy7xe/i_dont_understand_how_anyone_gets_this_shit_done/hm8l90u/",
      "text": "Ngl I took 3 years roughly to graduate with an Associates from CC before transfering out and its pretty much normal at this point. I have a bunch of friends as well who also ended up taking 4-5 years for the bachelors. It's easy to compare yourself to others man but honestly it does you no good because their will always be someone better off and someone worse off. Focus on yourself and creating healthy habits and routines and remember its okay to take some mental breaks here and there. Life is stressful as fuck now a days and I completely agree with you, I'm stuck being forced to take 6 classes next semester and one in the winter and I literally feel nauseous whenever I think about it.",
      "author": "AverageGuy16",
      "created": 1637987516,
      "upvotes": 2,
      "replies": {}
    }
  }
}