{
  "sid": "qkcc9s",
  "link": "/r/CollegeRant/comments/qkcc9s/my_major_not_in_my_schedule/",
  "title:": "My major not in my schedule",
  "text": "I really thought I just needed to take college math and English for the prerequisite because that’s what it says…. Then next year I can finally take a class for my major but my schedule for next semester doesn’t have it. I told my counselor my major and she said I’ll just take these other classes for the next 2 years to get enough credits for an associate's degree and when I switch over to a university I can take my major. I was hoping to start learning and experiencing my career shortly but I’m going to be 2 years behind. In high school, I was taught that I could just pick any class I wanted. I’m bummed out. Has this ever happened to anyone?",
  "author": "Hoplessjob",
  "created": 1635767752,
  "updated": 1636191375,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiwivoy": {
      "link": "/r/CollegeRant/comments/qkcc9s/my_major_not_in_my_schedule/hiwivoy/",
      "text": "Yup, this is how it is for me as well. I'm a biology major and so far I haven't taken any biology classes (I received credit from AP exams for intro bio). I'll finish my associates in the spring with all of my basics done and when I transfer to university I'll be in my major only courses.",
      "author": "chloeaugustine",
      "created": 1635785978,
      "upvotes": 2,
      "replies": {
        "hj4nqgj": {
          "link": "/r/CollegeRant/comments/qkcc9s/my_major_not_in_my_schedule/hj4nqgj/",
          "text": "Ah well glad I’m not the only one. I’m a animal science major. Are you taking other sciences? I take biology and will be taking chemistry. I just feel like a fraud for some reason when I say my major bc I see freshman already taking the classes for their field.  And I feel like ppl will think I’m somewhat of an expert on this and it’d be awkward to say well I’m not taking the class rn.",
          "author": "Hoplessjob",
          "created": 1635933303,
          "upvotes": 1,
          "replies": {
            "hj5jj0x": {
              "link": "/r/CollegeRant/comments/qkcc9s/my_major_not_in_my_schedule/hj5jj0x/",
              "text": "I've taken chemistry 1 and I'm in 2 currently. As well I've taken physics 1 and A&P. So definitely had some science course but truly nothing related to my degree title. I try not to think about it too much because I know I still have two and a half years full of science courses ahead of me. I definitely have felt like a fraud a couple of times, but I just try to remember that I'm getting the same education, just maybe not in the same order.",
              "author": "chloeaugustine",
              "created": 1635950676,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}