{
  "sid": "ra08qn",
  "link": "/r/CollegeRant/comments/ra08qn/getting_kicked_out/",
  "title:": "Getting Kicked Out",
  "text": "I’m doing fairly well in my other classes, but I’m going to end up failing math. My parents said they would kick me out if I failed and it looks like it will happen. I have until February 28th to figure stuff out and I’m not sure what to do. This is basically a rant I guess, but the thing is something happened to me in my personal life involving an ex in the spring of this year which caused me to stop doing school work. My family knew I wasn’t mentally okay, but this semester they forced me to quit my job as a delivery driver at Pizza Hut, and go back to school even though I was not ready. Now I have no job and only two months. I’m not sure what to do or how to not feel like a disappointment",
  "author": "Tr3y_L3g3nds",
  "created": 1638770697,
  "updated": 1639517986,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "hnfptme": {
      "link": "/r/CollegeRant/comments/ra08qn/getting_kicked_out/hnfptme/",
      "text": "Right now is a great time to find a job due to the labor shortage. You should easily find a job within two months. How close are you to graduating? If your parents kick you out make sure to continue taking classes, even if it’s just one or two classes a semester.",
      "author": "Nanami_overtime",
      "created": 1638777819,
      "upvotes": 4,
      "replies": {}
    },
    "hni3lgj": {
      "link": "/r/CollegeRant/comments/ra08qn/getting_kicked_out/hni3lgj/",
      "text": "Kinda shitty of the parents to kick you out just for failing a class when they knew about your mental health",
      "author": "Jamesmcmillian",
      "created": 1638822187,
      "upvotes": 3,
      "replies": {}
    },
    "hnh9fop": {
      "link": "/r/CollegeRant/comments/ra08qn/getting_kicked_out/hnh9fop/",
      "text": " I know it's stressful but the good news is that many college students live on their own without support from their parents. Once you're independent you don't have to do anything they say. So my suggestion is to work towards moving out so you can make your own decisions on your own time line and if you're parents still try to micromanage your life, ignore it, and focus on what you need first.",
      "author": "russophilia333",
      "created": 1638810389,
      "upvotes": 1,
      "replies": {}
    }
  }
}