{
  "sid": "rfy7i2",
  "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/",
  "title:": "Stop blaming the professor when you were just lazy",
  "text": "So I'm a senior and I took a 100 level psychology course as a general elective, which was literally a cakewalk.\n\nThe homeworks allowed for unlimited attempts, could be turned in up until the last week of class, and the professor basically posted the answers after a couple weeks went by. Final exam was open notes and literally just a completion grade; as long as you got a 70% or higher, you got credit. She allowed multiple attempts on that too. And on top of all of this, she was seriously the nicest professor I've had in college.\n\nI went to RateMyProfessors to give her a good rating after the semester ended and it was just filled with complaints. Some person spammed upvotes on bad reviews and downvotes on good reviews to make her look bad. People clearly didn't go to class, and the reviews showed it. I can barely even trust the reviews on RateMyProfessors anymore when half these people are just mad that they were too lazy to do the work.\n\nTL;DR: Seriously, take some accountability for your actions. It's not the professor's fault that you failed one of the easiest courses offered in my college.",
  "author": "throwaway13630923",
  "created": 1639453098,
  "updated": 1639517842,
  "over_18": false,
  "upvotes": 159,
  "upvote_ratio": 0.96,
  "comments": {
    "hoh7bvp": {
      "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoh7bvp/",
      "text": "A lot of people won't admit it (and, to be fair, they probably don't even know any better), but most students are the farthest thing from \"college prepared\" - some even being borderline illiterate and/or innumerate.\n\nAgain, it's not exactly their fault since a number of confounding factors which were present before the pandemic were exasperated with its arrival. That said, undoing this mess without simply \"passing people through\" (like high school) is going to be an enormous feat for those working in higher education; it's going to require *a lot* of reality checks and confrontation.",
      "author": "Sezbeth",
      "created": 1639459823,
      "upvotes": 64,
      "replies": {
        "hoigc5e": {
          "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoigc5e/",
          "text": "This is exactly spot-on, and I've been in the game for decades.  Colleges started trying to change course by implementing the \"First-Year Experience,\" but that turned more into getting students into a social net than teaching them how to learn and get something out of the money they are spending on education.  \n\nStudents basically have to (1) recognize there is a problem with how they go about their work and (2) be willing to do something about it.\n\nIt's easier to just complain and blame the college/professors/etc.  But no matter whom they blame, they still are the ones who lose in the end and get stuck in shitty jobs.\n\nThe ones who attack the problem on their own come out way ahead.  It turns out those skills are actually useful in careers that require ongoing learning.",
          "author": "StudySwami",
          "created": 1639491010,
          "upvotes": 13,
          "replies": {}
        },
        "hoin3br": {
          "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoin3br/",
          "text": "This problem is an overwhelming one. How do we even begin to stop this issue, much less reverse the damage it’s done? I almost wonder if in the next few years universities are going to need some kind of intensive “boot camp” to figure out which students are prepared enough to deal with even the most entry-level of courses and basic of self-management requirements (ie, using a calendar to make sure they do stuff on time). The problem is, what about the ones who aren’t prepared for even that level? That doesn’t even consider the inequities across high school education along a variety of dimensions.\n\nUgh, now I have a headache.",
          "author": "PhDapper",
          "created": 1639494230,
          "upvotes": 9,
          "replies": {
            "hoj91v9": {
              "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoj91v9/",
              "text": "I don’t think colleges should have to deal with unprepared students, elementary/jr high/high schools are the places that need to be fixed. They shouldn’t allow anyone to pass to the next grade if they aren’t prepared. It shouldn’t be a universities job to teach 2nd grade level reading.",
              "author": "ohheyitslaila",
              "created": 1639502972,
              "upvotes": 2,
              "replies": {
                "hoj9cn7": {
                  "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoj9cn7/",
                  "text": "I completely agree!",
                  "author": "PhDapper",
                  "created": 1639503088,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hogxcqi": {
      "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hogxcqi/",
      "text": "I think 1xxx level psychology is super easy at any college regardless of professor. This is bizarre OP. \n\nThey suck balls.",
      "author": "loveworldpeace",
      "created": 1639454549,
      "upvotes": 38,
      "replies": {
        "hogy9dt": {
          "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hogy9dt/",
          "text": "In all honesty I just feel bad for the professor. Nicest person, easy class, and I learned a lot. Sucks that people are going to give her poor evaluations when they just didn't want to put in the (small amount of) work.",
          "author": "throwaway13630923",
          "created": 1639454987,
          "upvotes": 24,
          "replies": {
            "hogyibw": {
              "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hogyibw/",
              "text": "It’s the norm that college students only want easy a’s.",
              "author": "loveworldpeace",
              "created": 1639455111,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "hohbp48": {
      "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hohbp48/",
      "text": "The worst part to me as a professor is that the \"good\" students who come to class, pay attention, and put in the work barely need to interact with with me (because if you do these things it's easy to do well in my courses).  This leaves only the \"lazy\" students who want an A but without having to think as the only ones I get to interact with. It's really draining and takes the fun out of teaching.",
      "author": "Kdel8",
      "created": 1639462566,
      "upvotes": 21,
      "replies": {
        "hoif6jj": {
          "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoif6jj/",
          "text": "I can see how that is true. I got an A in my cell bio class and I only talked to my professor like once. \n\nMeanwhile the biochem class I was failing I met my professor a couple of times. I am passing now but I understand how it can be draining when the only students that visit you are desparate because they simply don't understand or they didn't do anywork and are expecting you to save their grade.",
          "author": "TheRapidTrailblazer",
          "created": 1639490461,
          "upvotes": 10,
          "replies": {
            "hojvuaa": {
              "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hojvuaa/",
              "text": "I don’t mind at all the students who struggle and then come for help.  It’s part of why many of us enjoy teaching. The one on one or small group help is better than lecturing. Nothing better than seeing that student who starts out failing the course and works hard to pass the class.  \n\nThe draining ones are the ones who spend office hours or meetings arguing about grade issues or due dates and not the content of the course. Or they come for help on content expecting to be spoon fed and show no good faith effort to have tried. \n\nI’d take the struggling student in need of help over the B+ student trying to make excuses and squeeze an A- by arguing points.",
              "author": "urnbabyurn",
              "created": 1639511884,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hoid3kc": {
      "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoid3kc/",
      "text": "> I can barely even trust the reviews on RateMyProfessors anymore when half these people are just mad that they were too lazy to do the work.\n\nYeah. RMP reviews really can't be trusted. It's almost entirely shitty students trying to find a scapegoat for the consequences of their own actions.",
      "author": "BarackTrudeau",
      "created": 1639489439,
      "upvotes": 9,
      "replies": {
        "hoigsd6": {
          "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoigsd6/",
          "text": "I guess its dependent on the school because RMP has been great for me.. all my professors woth bad ratings are actually pretty bad, I usually got good grades in their course but the professors can be straight dicks and its always the bad rating ones and ill rate accordingly no matter what grade I get",
          "author": "elkfn2",
          "created": 1639491221,
          "upvotes": 7,
          "replies": {}
        },
        "hojh46d": {
          "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hojh46d/",
          "text": "RMP has been super helpful and accurate for me. It’s kinda easy to tell the people that aren’t doing well because of themselves apart from just a bad professor. Something to look out for if there are quite a few bad reviews: check the date. If all the bad ones were left on one date but otherwise good reviews, they are probably a good professor",
          "author": "sjon97",
          "created": 1639506120,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hohpz0x": {
      "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hohpz0x/",
      "text": "That actually made me sad; I think it’s just students taking advantage of a teacher that isn’t as firm or strict as the others, and then get upset when their unwillingness to take the class seriously backfires. It’s a shame to think she may completely revise her teaching method, just based on the overwhelming negative reviews, which makes it unfair for the students who would actually take her class seriously and could benefit from a good grade in class.",
      "author": "Plastic_Tadpole_260",
      "created": 1639473337,
      "upvotes": 4,
      "replies": {}
    },
    "hoi9bwk": {
      "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoi9bwk/",
      "text": "I took this 4000 level computer science class that had a program over interpreters as the final homework assignment. I didn't even complete it fully and got full credit - literally 10 lines added to an example program he provided - while the average was a 40 and people were complaining over discord about the difficulty.",
      "author": "Ibaneztwink",
      "created": 1639487484,
      "upvotes": 4,
      "replies": {}
    },
    "hoilovr": {
      "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoilovr/",
      "text": "RMP is garbage. Do students really use this?",
      "author": "-Economist-",
      "created": 1639493620,
      "upvotes": 3,
      "replies": {
        "hojw80r": {
          "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hojw80r/",
          "text": "Yeah, oddly they do a lot.  My guess is that while it isn’t a useful sample, those that do post to complain are complaining about workload and difficulty for the most part. And students who use it largely just want to know which classes are easiest. They don’t care how engaging the professor is in presenting material or other aspects of the content or course design.",
          "author": "urnbabyurn",
          "created": 1639512032,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoih046": {
      "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hoih046/",
      "text": "And this is why I never use RMP anymore.",
      "author": "yobaby123",
      "created": 1639491321,
      "upvotes": 2,
      "replies": {}
    },
    "hojp2l0": {
      "link": "/r/CollegeRant/comments/rfy7i2/stop_blaming_the_professor_when_you_were_just_lazy/hojp2l0/",
      "text": "RMP is a terrible site for trying to gauge how a class will be for you.  Of course, it’s a biased sample, making it a collection of people who either really love or really hate it.",
      "author": "urnbabyurn",
      "created": 1639509243,
      "upvotes": 2,
      "replies": {}
    }
  }
}