{
  "sid": "nc9nqq",
  "link": "/r/CollegeRant/comments/nc9nqq/got_my_first_d_as_a_junior_math_student_venting/",
  "title:": "got my first D as a junior math student / venting + request for advice?",
  "text": "This class is a 3000 level math course, thought it would be easier since it is pretty much considered an introduction to proofs course and I'm taking upper level maths currently. (have taken many math courses already, this is just one of the general reqs I hadn't done). Not saying I didn't think it would be challenging, but just saying I wasn't expecting to do so so poorly given my background.\n\nI tanked the first midterm \\~40 and my next 2 midterms improved substantially but not greatly. My homework average was really good. Each exam counted for 25% of my grade though, and the homework was only 25%. My class average did come out around mid 60s. I think I would've needed a 70 to get a C-.\n\nI'm freaking out some. I can accept my grade, I understand why I received it. I'm just nervous and sad. I'm gonna have to retake the course to get my degree (I'm actually a double major in CS), and I'm already pressed for time somewhat and worried I'll have to overload.\n\nI am talking to the professor today about the last midterm just to go over what I missed. I am a bit embarrassed, but I at least wanna go out showing I care.\n\nDoes anyone have general advice for how to cope with this and any tips for speaking with the professor? I wanna maintain professionality. I'm not sure if he'll mention my final grade or not.   \n\n\nUpdate: I actually spoke to the professor. I didn't mention my final grade at all, and I don't know if I should have. I don't think there's anything I can do since it has been submitted. ",
  "author": "Piece-Which",
  "created": 1621001823,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "gyqmprh": {
      "link": "/r/CollegeRant/comments/nc9nqq/got_my_first_d_as_a_junior_math_student_venting/gyqmprh/",
      "text": "D's sometimes happen. I made two of them when I was an undergrad. One in genetics, one in statistics. \n\nThese days I do a lot of genetics and statistics. Funny how that worked out. \n\nTry not to lose any sleep over it.",
      "author": "bs-scientist",
      "created": 1621455596,
      "upvotes": 1,
      "replies": {}
    },
    "gy3pjl3": {
      "link": "/r/CollegeRant/comments/nc9nqq/got_my_first_d_as_a_junior_math_student_venting/gy3pjl3/",
      "text": "I failed a chemistry exam my freshmen year. After more studying and persistence, I finally see why I failed. I saved the exam and reviewed It a semester later and wondered how I could’ve failed it. The Work came so easy. Point is sometimes it takes a while for things to click and you just understand the material like it’s nothing. It’s like any other skill, it takes time to develop and some are faster than others. Some people may excel faster than you at this but you may excel faster at them in other areas. Don’t beat yourself up and keep trying. I think with persistence you will do better. Just keep studying and practicing. Good luck.",
      "author": "Full_Resource_1809",
      "created": 1621002149,
      "upvotes": 6,
      "replies": {}
    }
  },
  "updated": 1634062117
}