{
  "sid": "olb4lw",
  "link": "/r/CollegeRant/comments/olb4lw/i_wish_i_liked_college_more/",
  "title:": "I wish I liked college more",
  "text": "I’m grateful for the opportunity to go to college and pursue something I’m interested in, but I hate attending college. I feel mostly culpable for this bc I looked forward to going to college for so long and I think I envisioned something more enjoyable than it actually is and set myself up for disappointment. \n\nFor example, before college I was really excited about the new classes I could take but now I see those classes for the textbooks/homework codes associated with them. I was looking forward to being in a club but now I doubt my ability to make the time commitment. I wanted to look into undergraduate research but there is always this crippling fear that I am too dumb to be of any use(I still apply though so maybe I’ll find something). And I really wanted to study abroad bc we afford to go out of country and I received this stipend to go abroad but now I don’t even know if that stipend will cover enough and I know I will not be able to come up w the money on my own. \n\nMoney has become a major stressor for me and I know I’m not alone in that situation by any means but I hate always being broke. It makes me feel inadequate. And I know I won’t stop being broke for a long time. \n\nAlso my mental health was bad before college but now it is even worse. I tend to dissociate a lot more now and I have this problem with sensory overload that’s been made worse by ever present stench of coolant leaking from the ac units??? I know it’s pretty fussy of me to say it but some of my worse memories of college so far have been me walking back from studying or something, crying with a headache and then smelling that damned coolant. \n\nIn spite of this, I’m still grateful for the opportunity to go. I know that going to college aligns with my goals(I’m studying chem engineering). I’ve made wonderful friends here who definitely make going here easier. But I wish I liked this more. As it stands, I’m my happiest when I leave campus when my mom picks me up or my friends and I go somewhere. (Also I developed this really bad escapism habit as a coping mechanism I guess and it is a major problem but that is another thing altogether).\n\nTL;DR: College is disappointing, my mental health is suffering, but I’m still going to see it through. At least some good has/will come out of it?",
  "author": "buckysrightnut",
  "created": 1626416632,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 1.0,
  "comments": {
    "h7c80a5": {
      "link": "/r/CollegeRant/comments/olb4lw/i_wish_i_liked_college_more/h7c80a5/",
      "text": "Being broke sucks. But you're a chem-e major so you def. won't stay that way forever. \n\nI wish I liked college more too. But don't beat yourself up for the way you're feeling. It's a completely valid feeling. Enjoy what you can enjoy, and look forward to life after college!",
      "author": "shirbert6540",
      "created": 1627841813,
      "upvotes": 2,
      "replies": {
        "h7wm2sb": {
          "link": "/r/CollegeRant/comments/olb4lw/i_wish_i_liked_college_more/h7wm2sb/",
          "text": "Thank you for your kind words :)",
          "author": "buckysrightnut",
          "created": 1628230566,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634062040
}