{
  "sid": "oao98f",
  "link": "/r/CollegeRant/comments/oao98f/completely_over_the_virtual_everything/",
  "title:": "Completely over the virtual everything",
  "text": "I just failed an exam that I studied my ass off for, because the test in the lockdown browser froze and I couldn't even submit my answers. I messaged my professor, but today was the due date and I'm really hoping to be given another attempt for this test since it crashed on me. I just really wish I could've just gone to the testing center instead. I've always done online classes, but even then I just miss not having to deal with the hassle of doing every single thing virtually. With everything opening back up, why can't they give us the option to make an appointment at the testing center or the lockdown browser? I'd rather be in a quiet place where I know there's less of a chance of something like this happening.",
  "author": "GroovyGravyBaby",
  "created": 1625022664,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "h3ktjoe": {
      "link": "/r/CollegeRant/comments/oao98f/completely_over_the_virtual_everything/h3ktjoe/",
      "text": "Are you me? I fucking hate Respondus. I hate studying my assoff for exams only to lose a fuck ton of points because it first takes the program way too long to pass my facial detection check, leaves me an anxious mess starting time test, slows my computer down so far that ticking answers is ridiculously annoying, and, of course, the coup de gras...lowering my score a full six points because it freezes and I cannot I put my answers.\n\nI’m trying to get into a ridiculously competitive program. Now my transcript is dotted with Ws, and fucking Respondus is making my grades in class I keep a fight.",
      "author": "ACaffeinatedWandress",
      "created": 1625071309,
      "upvotes": 1,
      "replies": {
        "h3l9ez5": {
          "link": "/r/CollegeRant/comments/oao98f/completely_over_the_virtual_everything/h3l9ez5/",
          "text": "Yes! This! It was a 2 hr test was supposed to begin after answering the first question, but by the time I actually got to the test, I had 1hr 40 mins remaining 🤦 I really hate it and I feel your pain all the way. I'm looking at 2 different universities to transfer to and one of them has a 38% acceptance rate, so I cannot handle anymore bs. I've already had countless issues with my current school in general. One of them being fucking up my academic program that left me with an extra semester of classes to take once the issue was found and fixed and I'm still fighting and not getting a response from my school from a professor almost failing me over incorrect grading (went from almost a 99% in the class to a 76% that also dropped my GPA considerably). The covid situation just seemingly made college impossible and I'm having actual mental breakdowns over it. It's just an absolute nightmare",
          "author": "GroovyGravyBaby",
          "created": 1625078070,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h3kaqb9": {
      "link": "/r/CollegeRant/comments/oao98f/completely_over_the_virtual_everything/h3kaqb9/",
      "text": "They have to give you another chance and if they don't take it to the dean",
      "author": "Old-Measurement4504",
      "created": 1625063137,
      "upvotes": 1,
      "replies": {
        "h3l9o48": {
          "link": "/r/CollegeRant/comments/oao98f/completely_over_the_virtual_everything/h3l9o48/",
          "text": "They actually did! She extended the date and gave me another attempt for the test, but I still have to take it in Respondus 😑 I am really thankful that she did it, but in the moment I was so upset that I was ugly crying",
          "author": "GroovyGravyBaby",
          "created": 1625078180,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h3iuqko": {
      "link": "/r/CollegeRant/comments/oao98f/completely_over_the_virtual_everything/h3iuqko/",
      "text": "Hope they give you another chance.",
      "author": "Wide-Iron8830",
      "created": 1625025691,
      "upvotes": 5,
      "replies": {}
    }
  },
  "updated": 1634064419
}