{
  "sid": "lukbs3",
  "link": "/r/CollegeRant/comments/lukbs3/i_feel_like_im_not_reaching_my_full_potential/",
  "title:": "I feel like I'm not reaching my full potential",
  "text": "So I am now in my 3rd year of university. I'm studying biomedical science, I did excellent in my final exams in school attaining marks in the top 8% of Ireland. However in college I have just been passing. Now I know that previous years it has been due to mental illness. I suffer from depression and had to take a year out and I was an inpatient for a brief period. This year however I only managed C grade across the board. I am doing a lot  better mentally but I feel like my memory isn't what it used to be? I found the start of the semester very challenging and found myself constantly climbing upward on a mountain of work because I found it hard to settle in for weeks. However I thought my exams went well in the end. I was confident that most exams I would get an A or B. I feel like I have no concept of what professors are looking for in exams. I worked really hard toward the end of the last semester but obviously it wasn't good enough. Where as a few years ago I feel like if I had put in that amount of work I would have gotten As. \n\nDoes anyone else find this issue with college? This semester I am very much on top of things but I feel like its all pointless. I feel as though I'll sit my exams and feel content with them just to receive a mediocre grade again. \n\nAny advice?",
  "author": "fktwine",
  "created": 1614530695,
  "over_18": false,
  "upvotes": 106,
  "upvote_ratio": 0.99,
  "comments": {
    "gpr1yif": {
      "link": "/r/CollegeRant/comments/lukbs3/i_feel_like_im_not_reaching_my_full_potential/gpr1yif/",
      "text": "I have only been asked to produce my transcript one time after graduation, and that was only to prove I was eligible for licensure. Maybe diversify your efforts and network extra hard with your peers, professors, active alumni. Talk to your mentor or career counselor about beefing up your resume with leadership positions. You are more valuable than grades can quantify. Keep up all your efforts, you got this!",
      "author": "drawingnot2scale",
      "created": 1614930264,
      "upvotes": 1,
      "replies": {}
    },
    "gp8h6y7": {
      "link": "/r/CollegeRant/comments/lukbs3/i_feel_like_im_not_reaching_my_full_potential/gp8h6y7/",
      "text": "Very relatable. Definitely coming from a different angle as a senior humanities student but the entire thing seems like such a racket after having gone through it. It's for churning out employees, not thinkers.",
      "author": "Gracchusinbyzantio",
      "created": 1614550611,
      "upvotes": 1,
      "replies": {}
    },
    "gp7fwvy": {
      "link": "/r/CollegeRant/comments/lukbs3/i_feel_like_im_not_reaching_my_full_potential/gp7fwvy/",
      "text": "i’m a first year pharmaceutical engineering student - graduated top of my class in high school. now i’m struggling to keep a B in all my classes. i just started my second semester and i’m already burnt out. everything is already stressing me out and it’s still my first day. everyday i wake up and i’m dreading the day. it sucks.",
      "author": "jennie033",
      "created": 1614538229,
      "upvotes": 18,
      "replies": {
        "gp7s9tz": {
          "link": "/r/CollegeRant/comments/lukbs3/i_feel_like_im_not_reaching_my_full_potential/gp7s9tz/",
          "text": "Make that grade a C and the major Civil Engineering and that's me right there lol",
          "author": "Sharthog69",
          "created": 1614542121,
          "upvotes": 4,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634061597
}