{
  "sid": "rf6di7",
  "link": "/r/CollegeRant/comments/rf6di7/rough_semester_opinion/",
  "title:": "Rough semester opinion",
  "text": "This fall semester was if not the hardest I’ve ever had. I took a total of 15 hours which I have done before. This time I felt that professors were jerks and the amount of work due was ridiculous. I however put aside many things like my mental health and having fun for school. I sacrificed sleep and would go the extra mile for every class. I consider myself an average student but I do struggle when it comes to comprehensive exams. And boy were there many. I had so much to do everyday and I poured my heart into everything I did at school. I worked so hard all semester and when I recently got my final grades I was disappointed. My grades were not what I expected and I feel so defeated. I feel like my best wasn’t good enough and I’m not proud of myself. It’s causing me to be uneasy back home for break and I don’t wanna be upset the whole time. I just want to know if I am being too hard on myself.",
  "author": "Square_Half_3742",
  "created": 1639367383,
  "updated": 1639517871,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.95,
  "comments": {
    "hoc719j": {
      "link": "/r/CollegeRant/comments/rf6di7/rough_semester_opinion/hoc719j/",
      "text": "I'm in the same situation. I have a math final tomorrow. Which I know for sure I'll fail. The teacher pretty much read word for word from a PowerPoint. I ended up deciding to go back to my community college there I'm pretty ill not have to take math classes since I completed the math requirement for that degree there. Idk but I felt most semester I'm going to not be successful. Specially since my degree that I'm at requires business calculas(I've never taken calculas of any sort). I talked to my counselor and he pretty much suggested a major tyat didn't require so much math.",
      "author": "MechanicExtension565",
      "created": 1639368030,
      "upvotes": 2,
      "replies": {}
    },
    "hocrhfb": {
      "link": "/r/CollegeRant/comments/rf6di7/rough_semester_opinion/hocrhfb/",
      "text": "Dude please don't beat yourself up. A 15 hour course load is a *lot* and the fact that you're still standing after a semester like that says a lot about you. Don't give up!\n\nAlso, don't feel bad about taking less classes per semester if you need to. Especially if you have a lot of other things going on like work or volunteering or anything that will end up helping your career in the future. Don't force yourself into 5 classes unless you have to. Nothing wrong with taking 3-4 classes at a time to really give those classes focus. If you're worried about finishing within a set time period, you can always take classes during the summer.",
      "author": "acrylicvigilante_",
      "created": 1639380474,
      "upvotes": 1,
      "replies": {}
    },
    "hoffmm1": {
      "link": "/r/CollegeRant/comments/rf6di7/rough_semester_opinion/hoffmm1/",
      "text": "You are but everyone feels like crap when their best isn’t getting the results they want. Maybe just scale back from 15 to 12 or something and give yourself more time to sleep would help a lot",
      "author": "airbear13",
      "created": 1639430314,
      "upvotes": 1,
      "replies": {}
    }
  }
}