{
  "sid": "nbswqi",
  "link": "/r/CollegeRant/comments/nbswqi/feeling_behind_in_college/",
  "title:": "Feeling Behind in College",
  "text": "At this point, it seems like college is not going how it was supposed to. I have to take summer courses in order to catch up on my classes, but this is not what I am complaining about. The fact that I could have gotten college credits earlier makes me feel hopeless. I have taken AP and IB courses in high school, yet only ended up getting a credit for one course. If I had gone to another college, then I would at least have enough credits, but going to a university that is not close was obviously not possible for many reasons. \n\nAt this point, I would not have to be so worried about finishing my degree and would already move on with my life. Getting employment is certainly not possible for me, which is why I needed to finish my degree earlier. It just takes too much time and I need to move on already. It feels like school is the only thing I can do as of right now.",
  "author": "gustavossj",
  "created": 1620944102,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "gz94a6d": {
      "link": "/r/CollegeRant/comments/nbswqi/feeling_behind_in_college/gz94a6d/",
      "text": "I’m 37 and I’ll have finished a year of college courses once this term is over. I really wish that I had buckled down and gotten my degree back when I first went to college, but I don’t think I’d be in the right mindset if I didn’t traverse the path I took.\n\nIt’s okay if it takes longer than expected. The important thing is to continue working hard to achieve your goal (no matter how long it takes) - to experience, to persist, to grow, to inspire. You are doing well, but you also have remember to enjoy the journey.",
      "author": "GamerGrin",
      "created": 1621845305,
      "upvotes": 1,
      "replies": {}
    },
    "gymi71l": {
      "link": "/r/CollegeRant/comments/nbswqi/feeling_behind_in_college/gymi71l/",
      "text": "College is different for everyone. I entered college with Sophomore credit status but I also need to take summer courses in order to graduate on time. My boyfriend is taking 5 years to graduate and his brother has taken 6 (he also switched majors about 3 times). I also have a classmate who’s 39 that’s finally graduating after dropping out during his last semester in his 20s. Just do what you need to do to stay healthy and get your degree :)",
      "author": "cabbage-soup",
      "created": 1621376055,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634063778
}