{
  "sid": "rbz9zo",
  "link": "/r/CollegeRant/comments/rbz9zo/how_do_i_forgive_myself_for_this/",
  "title:": "How do I forgive myself for this?",
  "text": "I don't think anyone will read this, because it is way too long, but it feels good to rant.\n\nToday I woke up at 9:00, after a week of practically no sleep, ready to take my final exam for politics. It turns out that it was a take-home exam that was due at 9:00 and I somehow forgot that was the case. I emailed my professor but he's granting no extensions. Now I’m trying not to have a panic attack because this is now the fourth class I’m probably going to fail.\n\nI took 5 courses this semester (most of my friends at this school are taking 3) so that I could have enough credits to transfer to a bigger university. I’m tutoring other university students the same time, so that I can contribute at least a little bit to my student loans and I’m fully taking on another course for one of the students I tutor. In total, that’s 6 courses as a physics major and a part-time job. \n\nHowever, most of my energy has gone to dealing with three different court cases. Well two, actually, because I decided to discontinue one of them. My father was arrested for domestic and child abuse and I haven't seen him since, except in court. This was prior to this semester, but I've been having a lot of difficulty dealing with having a parent being removed from my life and having to step-into their role. My mom is an immigrant and English is not her first language, so I've been meeting with lawyers and trying to navigate through the abuse case and a divorce case as well. For a while, I was also dealing with the police in a sexual abuse case after being (TW!!!) raped by three guys at a party, but I ultimately dropped the case because it was too much for me to handle, especially because I was keeping it a secret. I knew my mom would be devastated, but also probably put the blame on me, so I've been working through that situation by myself, really. I felt really alone and started dating somebody who drained me in every way possible. He was an emotionally abusive narcissist that spent all of my money, made me lose all of my friends, forced me to do all of his school work, made me cook and clean for him, and practically held me hostage at his place by throwing tantrums every time I tried to go to the gym or visit my family. When my mom was diagnosed with a tumour that required a very risky procedure to remove, she asked me to come over to help her write her will. My boyfriend freaked out at me and didn't want me to leave, because he had an exam he wanted me to do for him that day. I decided to break up with him and he absolutely lost it. He called me saying he tried to stab his dad and is running from the police. Then he started to say he was going to kill himself and that it would be all my fault. I thought he was lying, until the police reached out to me for information on where he might be. He called me one final time saying goodbye, then hung up the phone. I thought he was dead and couldn't reach him for over 8 hours, before I found out from one of his friends that he was just smoking weed at a friend's house.\n\nAs soon as the relationship ended, I was determined to get my life on track. Because my ex-boyfriend has forced me to stay with him, I lost my apartment that I had worked hard to move out to when I was 18. I moved back into my mom's house and even though I still pay rent, it is much less than before. I'm dating a new guy and we have a good relationship. My mom's diagnosis turned out to be the doctor's mistake in reading her scans. The divorce case is still on-going, but the abuse case is done now. For the first time in awhile, I had time to focus on putting my life together. I made a plan for myself to transfer to my dream school and took on a really tough course load. I have really bad attention problems, so it's a miracle that I had maintained over 95% in all of my classes for the first half of the semester. I definitely had to spend triple the amount of time than my classmates on studies, most of the time, which was really spent just staring at my computer screen doing nothing. I just barely slept and only left my desk to eat, so that I could keep my grades up. I was feeling good about my grades, but the stress was beginning to take a toll on my mental health. I talked to my doctor and was prescribed Lexapro. That's when everything went downhill. I went from having trouble getting out of bed in the morning to feeling like it is absolutely impossible. So, I allowed myself to take a break from studying for a few days, while adjusting to this medication. That is my biggest regret. I would wake up in the morning but stay hidden under my covers until 7 or 8 at night. I stopped eating and dropped down to 90 lbs, losing all the muscle I had built in the gym over the past 3 years. My sisters, friends, and my boyfriend all asked me to help with their assignments, thinking that I was already on top of my own work. I didn't have the heart to say no, so I would sit in bed with my computer and force myself to get them done. It was so mentally draining and it took all my will-power to focus, but I wanted to feel useful because hiding in my room in the dark all day was making me feel like a loser. Eventually, I tried to revisit my own studies and realized that I had missed assignments that meant that I could no longer have A's in any of classes, even if I finish everything else on time. My attention problems got even worse, so I couldn't get myself to do any assignments. I thought it was because of the medication, so I stopped taking it and my mental health got far worse. I could now probably manage C's in my classes, but I was so disappointed in myself for not having A's that I basically gave up. After realizing how stupid that was, I talked to my doctor about new medication. She decided to give me some questionnaires for ADHD and bipolar disorder and I ended up scoring very high on both. Because both disorders have a lot of overlap and require different treatments, she put me on a year-long waitlist to see a specialist to make sure that the diagnosis was correct. I was given new anti-depressants which have been a lot better for me, but I was definitely still struggling with my ability to focus. Before I knew it, finals season began. I made a detailed plan to try to salvage my grades. They weren't going to be high, but I was still hoping to pass. My new meds gave me enough motivation to get out of bed, so for the past two weeks, I've been doing assignments and studying for finals non-stop. It's been absolute torture and I feel like I'm losing my mind. \n\nA few days ago, I emailed my professors to see what marks I would need to achieve on my finals to pass, and three of them wrote back saying it's too late to save my grades. I was devastated. I had spent so many all-nighters jacked up on over-priced energy drinks or study drugs (which I spent way too much money on), just cramming for exams. Because I was born very premature, I have a weak heart, and subjecting myself to all that sent me to the hospital. Now I know that it was all for nothing. I won't even receive credits for these courses and it's going to take me ages to repay student loans that I completely wasted. I'm doing better now, but I feel like my physical health still hasn't fully recovered. My mental health is getting worse again and finding out that I missed a final exam today is absolutely killing me. I've never felt like a bigger failure, especially given that life was finally giving me a break from all this external chaos and I still couldn't manage. I guess that all the problems I hadn't sorted through in my head had just caught up to me all at once.\n\nI've always loved learning. Growing up, I've wanted to stay in school for the rest of my life. I just think that I'm not capable of doing well anymore and it's crushing me because I feel like I'm suddenly directionless. I don't want to keep putting myself into deeper debt if I'm just deceiving myself in thinking that I could succeed academically. I just feel stupid and irresponsible. My discipline, which took many years of conscious effort to develop, has gone at the window. I don't know what to tell my mom and I'm embarrassed to tell my boyfriend and friends. I know it's up to me to pull myself together and that it's just counterproductive and cowardly to mope around, but I just can't stop obsessing over how much of a loser I am. How do I get out of my head and stop torturing myself psychologically????",
  "author": "tds137",
  "created": 1638992695,
  "updated": 1639517937,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hns955i": {
      "link": "/r/CollegeRant/comments/rbz9zo/how_do_i_forgive_myself_for_this/hns955i/",
      "text": "It’s okay to fail. It’s okay to take a break. It’s okay to never go back at all. Especially in your situation. Take a step back and just focus on yourself. Get to that specialist or even find yourself a therapist and psychiatrist so you don’t have to wait so long. Get your meds right before trying again. I’ve been in your place. You will only run yourself into the ground further if you don’t take some time for yourself. Hugs.",
      "author": "LenoraNoble",
      "created": 1639006610,
      "upvotes": 7,
      "replies": {
        "hntadyb": {
          "link": "/r/CollegeRant/comments/rbz9zo/how_do_i_forgive_myself_for_this/hntadyb/",
          "text": "This is all really sound advice.\n\nSo many people have found themselves in very similar situations and have made it through to a better life. \n\nDo things suck right now? Yes.\n\nIs it all your fault? No. \n\nForgive yourself. Self-loathing only prolongs you reaching a better place.\n\nTrust me, if you truly love learning - I mean *truly* love it - then the ability to gain knowledge will always be there for you. \n\nBut before you return to a formal institution, you have to get to a better place - physically, mentally, and emotionally.\n\nIt won’t change anything about how much life sucks right now, but once you reach that place, you will look back and realize that it was formative.\n\nFor now, I highly recommend quality sleep, drinking plenty of water, and focusing on breathing deeply. \n\nI wish you well, my friend.",
          "author": "cajunsoul",
          "created": 1639023631,
          "upvotes": 3,
          "replies": {
            "hnyz1ie": {
              "link": "/r/CollegeRant/comments/rbz9zo/how_do_i_forgive_myself_for_this/hnyz1ie/",
              "text": "Thanks a lot, it means more than you know! :-) I think I’m stuck in a mindset which asserts that everything I’m experiencing is a result of my own actions. I’m sure that when I’m in better mental/physical shape it’ll be easier to see things in a different light. I just need to remind myself to stop equating my worth to my success in school.",
              "author": "tds137",
              "created": 1639131245,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hnyynur": {
          "link": "/r/CollegeRant/comments/rbz9zo/how_do_i_forgive_myself_for_this/hnyynur/",
          "text": "I’ll definitely consider talking to a therapist/psychiatrist when I have the financial ability. Thank you for the advice❤️",
          "author": "tds137",
          "created": 1639130927,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}