{
  "sid": "nv5cet",
  "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/",
  "title:": "Fuck my absolute entire life. ugh",
  "text": " I dunno what I am doing. This is my 2 nd semester. I have less than 2 months before exams. Probably offline exam. Never have given an actual college exam before. I am an Econ major. Don't really know what I am doing with my life at this point. I am really really behind. I know nothing. And I caused all of this. I want to disappear into thin air. fuuuuck.\n\nSorry. Just needed to talk. ugh.",
  "author": null,
  "created": 1623162609,
  "over_18": false,
  "upvotes": 149,
  "upvote_ratio": 0.98,
  "comments": {
    "h137kjc": {
      "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h137kjc/",
      "text": "Hey friend! I’m an econ major in my senior year and I totally get feeling like I’m the only who doesn’t know what the fuck I’m doing. Trust me, you’ll have more of those along the way, and possibly even after u graduate but even tho this major’s a pain in the ass, if you’re actually passionate & interested about it then you will be able to see it through!!! You got THISSS",
      "author": "mikaachu_",
      "created": 1623194512,
      "upvotes": 3,
      "replies": {
        "h14mjzf": {
          "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h14mjzf/",
          "text": "Haha thank you :)\n\nIt's a bit of a pain in the ass but I hope it will be worth it.",
          "author": null,
          "created": 1623224858,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h12vmz8": {
      "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h12vmz8/",
      "text": "I am taking a summer off college and picking up a second job. First time I am not in classes in 4 years. It is a much needed break. Doing my last semester in the fall. See if you can get a good plan/schedule and someone to help you stick to it till the semester ends. It helped me last till I could have a breather this summer.",
      "author": "Kyro0098",
      "created": 1623188797,
      "upvotes": 5,
      "replies": {
        "h14mbeb": {
          "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h14mbeb/",
          "text": "Wow! congrats on the summer break.Sounds so good.\n\nyup. I need to talk to my mother about my deadlines and stuff. That might help me keep up if I check with her regularly. thanks for the good advice!",
          "author": null,
          "created": 1623224645,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h12mot2": {
      "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h12mot2/",
      "text": "Well you have the Econ major right.  :)\n\nIt's an amazing field.  So many opportunities.",
      "author": "-Economist-",
      "created": 1623184784,
      "upvotes": 2,
      "replies": {
        "h14mcqa": {
          "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h14mcqa/",
          "text": "yes :)",
          "author": null,
          "created": 1623224679,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h12m9gw": {
      "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h12m9gw/",
      "text": "I'm also an econ major. Dude have confidence in yourself and try to study for the exams that's all you can do.",
      "author": "Asim99x",
      "created": 1623184597,
      "upvotes": 3,
      "replies": {
        "h14mq6j": {
          "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h14mq6j/",
          "text": "Ikr.You gave me the real talk right there. Thanks btw",
          "author": null,
          "created": 1623225010,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h11lyrw": {
      "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h11lyrw/",
      "text": "Funny I came across this, I too am an econ major who is in a rut. My S/O and I had a breakdown about it yesterday and honestly it's gotten to the point where I'm thinking about joining the military just to have some sort of direction and structure. However I'm not saying I recommend doing the same, I believe that this past year has had a mental impact on most people which in turn has led to stress, doubt and depression. If money permits it, I recommend taking a nice long trip this summer where you can avoid the shitty aspects of life and in its place try to focus on you or focus on having some sort of adventure. You honestly never know what you'll learn about yourself when you do knew things.",
      "author": "wizrad98",
      "created": 1623169285,
      "upvotes": 44,
      "replies": {
        "h11m39f": {
          "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h11m39f/",
          "text": "Also let me say that I'm sorry for what you're going through, and I hope that things get better",
          "author": "wizrad98",
          "created": 1623169337,
          "upvotes": 10,
          "replies": {
            "h14lxn0": {
              "link": "/r/CollegeRant/comments/nv5cet/fuck_my_absolute_entire_life_ugh/h14lxn0/",
              "text": "Thank you for the kind reply:)\n\nThe military is not an option for me where I am from (it requires some extra qualifications) and the covid situation here is pretty bad too so we are under lockdown. So I am keeping my expectations low about the summer. If things open up, I hope to go get nail extensions or a mani-pedi. I know it sounds weird but I have never done them and the thought of it makes me happy so why not.\n\nBtw have a  very nice summer!",
              "author": null,
              "created": 1623224298,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634061493
}