{
  "sid": "o379df",
  "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/",
  "title:": "Why can't professors tell you what's on an exam?",
  "text": "What's the point of having a surprise exam? Life is a struggle so let's make it worse. I don't get it.",
  "author": "Upbeat-Ad-5678",
  "created": 1624073873,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.8,
  "comments": {
    "h2cefgx": {
      "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2cefgx/",
      "text": "Is this a serious question?",
      "author": "orangeblackteal",
      "created": 1624124679,
      "upvotes": 1,
      "replies": {
        "h2cmm5a": {
          "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2cmm5a/",
          "text": "Rhetorical",
          "author": "Upbeat-Ad-5678",
          "created": 1624128885,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h2biuty": {
      "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2biuty/",
      "text": "You just answered yourself \"Life is a struggle\". I'm not fresh out of high school like most traditional college students are.  I am in my late twenties. I  went straight into the work force as a mechanic for automation, factories, etc. learning a skill after high school.  I decided  to go to college after seeing that I wanted to be an engineer and working with them first hand at my company. When it came time for exams or tests I easily noticed the cringe and sighs from classmates when the amount of content that was going to be on it ranged from chapter a to chapter z. 18 year old me would have done the same but me know understands this is what it is and real world \"unfair life\" moments are worse and oh boy surprising of all kinds can be \"fun\". Life isn't easy. \n\nWorking in a full time job where there are deadlines,  quotas to be met, lazy coworkers, calling out coworkers, back stabbing coworkers, horrible and incompetent managers/ bosses, surprise \"forced\" overtime, numbers over quality performance environments, etc. , having a test with broad ranges of topics covered without the prof not telling you 100% what is on it isn't so bad. If anything its a good way to get students into the mindset of a \"challenging\" or not \"fair\" work mindset for when they graduate, they can't say \"wow I didn't know the real world was like this\". But this is me now thinking like this, I don't know how old you are but 18 year old me would have thought exactly the same as what your subject line states.",
      "author": "XenOz3r0xT",
      "created": 1624107786,
      "upvotes": 12,
      "replies": {}
    },
    "h2agkwv": {
      "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2agkwv/",
      "text": "Let's say you're taking an anatomy class, and you're in a week where you're supposed to learn the bones of the body.  If the professor told you that the quiz would only ask about the bones in the foot, would you memorize the rest of them?",
      "author": "ksuprof",
      "created": 1624075760,
      "upvotes": 12,
      "replies": {
        "h2agydu": {
          "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2agydu/",
          "text": "Touche. But now picture a chemistry class, Chemical Quantitative analysis is what I'm complaining about, and we have a ton if information. What's lectured isn't tested ok and 3 to 5 chapters per week are tested on. I'd at least like a list of objectives of what we should get from complex subjects.",
          "author": "Upbeat-Ad-5678",
          "created": 1624075983,
          "upvotes": 5,
          "replies": {
            "h2ai1ma": {
              "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2ai1ma/",
              "text": "That's outside of my field, and I don't know the specifics of the class level, program, or learning outcomes, so it's difficult to assess.  In the humanities it's not uncommon to assign readings and expect the students to distill the important points on their own.  It's not a skill that everyone is born with, so some definitely struggle in the intro classes.  However, those classes provide opportunities to practice how to read and process information, which prepares students for reading assignments in upper-level classes.",
              "author": "ksuprof",
              "created": 1624076634,
              "upvotes": 5,
              "replies": {
                "h2c9hpq": {
                  "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2c9hpq/",
                  "text": "Yes, this. Being able to take a large amount of information and distill it into the most important points  without handholding is a huge life skill.",
                  "author": "PhDapper",
                  "created": 1624122202,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h2aeqcv": {
      "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2aeqcv/",
      "text": "An exam is intended to be a summative assessment of your knowledge. Part of being able to demonstrate true knowledge is being able to answer questions unprompted ahead of time. If you’re handed a list of questions (or what basically amounts to that), all you’ll be showing is that you can cram a bunch of stuff into your head long enough to spill it onto an exam and then flush it out the airlock afterward (not that you would, but that’s the general idea).",
      "author": "PhDapper",
      "created": 1624074668,
      "upvotes": 10,
      "replies": {
        "h2ag1ri": {
          "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2ag1ri/",
          "text": "Wouldn't it be most beneficial to have you get a lost of objectives you should know for an exam instead of giving large amounts of information and pulling random things from anywhere.",
          "author": "Upbeat-Ad-5678",
          "created": 1624075440,
          "upvotes": -4,
          "replies": {
            "h2brydt": {
              "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2brydt/",
              "text": "Learning objectives should be part of the course. They are often discussed or presented at the beginning of each chapter or unit of material (“after this [measurement unit of material], you should be able to...”). Learning objectives are also usually provided on syllabi, but those apply to the course as a whole.",
              "author": "PhDapper",
              "created": 1624113086,
              "upvotes": 7,
              "replies": {
                "h2f7h7r": {
                  "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2f7h7r/",
                  "text": "Well designed classes should have both course and lesson/module/chapter level objectives that are then assessed. Not everyone does this however. Not their fault. We don’t get pedagogy training in grad school unfortunately…",
                  "author": "phrena",
                  "created": 1624192261,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h2cehlc": {
              "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2cehlc/",
              "text": "Objectives are usually in the syllabus, no?",
              "author": "orangeblackteal",
              "created": 1624124707,
              "upvotes": 3,
              "replies": {}
            },
            "h2k3eiz": {
              "link": "/r/CollegeRant/comments/o379df/why_cant_professors_tell_you_whats_on_an_exam/h2k3eiz/",
              "text": "The \"large amounts of information\" is a list of the stuff that you should be expected to know for the exam. If they're bothering to teach it to you, then it's a valid topic for the exam.",
              "author": "BarackTrudeau",
              "created": 1624296251,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062532
}