{
  "sid": "otmddn",
  "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/",
  "title:": "What’s up with disrespecting teachers?",
  "text": "I was raised to treat teachers like police, fire, and EMS - thankfully. I hope I don’t have to work with toxic people who disrespect their teachers. The purpose of school is to adapt. If you need to insult someone to do that then maybe you’re in the wrong place.",
  "author": "Zealousideal-Yard803",
  "created": 1627517275,
  "over_18": false,
  "upvotes": 27,
  "upvote_ratio": 0.84,
  "comments": {
    "h8h5m2g": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8h5m2g/",
      "text": "It can be frustrating when you are blamed for behavior when two people are in a conversation together. If one isn’t skilled enough to help the other behave safely, then it is only worse when neither can help each other or themselves. Sometimes you can only watch. Sometimes that’s because neither wants to help themselves. The most important thing is that nobody gets hurt.",
      "author": "Zealousideal-Yard803",
      "created": 1628641081,
      "upvotes": 2,
      "replies": {}
    },
    "h8cppfy": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8cppfy/",
      "text": "Once during my fall semester this past year, I was in a math class when a girl so blatantly disrespected my teacher (not professor, was earning a grad degree and TAing) that my jaw dropped (this was a freshman-level math class that was as close you could get to remedial without it actually being remedial).  The class was mostly in-person, but there were some people joining over Zoom.  My teacher was lecturing and had moved away from the computer.  \n\nWell apparently, the kids who were on Zoom couldn't hear my teacher very well but he didn't see the comments they were typing in.  I understand that this was frustrating to them.  However, when I saw that one girl had commented \"why the fuck can't you listen to us we can't fucking hear you idiot\" (not an exact quote but basically the gist of it), I lost all sympathy.  My poor teacher, who was very nice and accommodating to everyone, saw the comment at the end of class.  He didn't even look mad, just really disappointed.  He briefly announced to the class to please not use that language towards him.  I still can't believe people who talk to teachers like that even make it to college.  I'm an education major and I am really not looking forward to that part of the job.",
      "author": "dandelioncommittee",
      "created": 1628555412,
      "upvotes": 3,
      "replies": {
        "h8cquzw": {
          "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8cquzw/",
          "text": "I’m studying accounting. You might say, how do accountants deal with the belligerent? Hurt people hurt people. We all in one form deal with belligerent people. Being disgruntled is not an excuse for treating people as garbage. If the student had been in class, then the problem wouldn’t have been. I know many people who have the policy of removing them from the others’ space. As a leader, and teachers are in leadership roles, it is the teacher’s responsibility to protect the students from threats. Psychologically, emotionally, physically, mentally, and spiritually damaging people is a threat. Removing the students who are threats to learning is how to deal with them. Leadership requires thinning the herd if toxicity is damaging the most important part of the team...its people.",
          "author": "Zealousideal-Yard803",
          "created": 1628555967,
          "upvotes": 2,
          "replies": {}
        },
        "h8cr3qq": {
          "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8cr3qq/",
          "text": "And I’m sorry that happened to you.",
          "author": "Zealousideal-Yard803",
          "created": 1628556081,
          "upvotes": 1,
          "replies": {
            "h8cvocp": {
              "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8cvocp/",
              "text": "The comment was made towards my teacher and it just sucks that you can't really do much about it.  I plan on teaching high school, so I'll have to deal with a lot of parents (who probably don't know shit about teaching) telling me how to do my job or yelling at me that I'm \"indoctrinating the youth\" or whatever.  I know exactly what I'm signing up for.",
              "author": "dandelioncommittee",
              "created": 1628558279,
              "upvotes": 1,
              "replies": {
                "h8h11es": {
                  "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8h11es/",
                  "text": "My advice to you is get advice from someone who can help prepare you for customer service. Everything we do at work is serving, and while you might say “so what?” One thing I learned is that some people, a minority of people, are rude and feel entitled to treat you like garbage. They have no right to treat people like garbage, but you need to be prepared to sway them into believing that they are understood. The most helpful skill I learned in “putting out fires” that entitled people cause is customer service. When they are frustrated, they want someone to tell them that both of you are frustrated. They feel lonely and need help. While somebody solves their problem by swearing and screaming, another solves the same problem with questions and friendship. Some people are taught to distrust their peers. As a teacher, you will have the power to show them that learning about how they act can impact their future. If a student is endangering your class, you will need to act for them. Working on your leadership skills out of the classroom will certainly help you overcome your nervousness in an argument with a student. I was taught against verbal abuse, but it is my responsibility to teach others the benefit of the way I was taught. Even if someone is so frustrated with me I think what works is simply saying I am sorry you are frustrated so am I! At this moment, the old adage “how you speak matters more than what you speak” is disproven. When someone is behaving so erratically and everyone freezes in terror, “what you say becomes more important than how you say it”. Learn a script to use when speaking to someone who is erratic. My example is the donkey in Shrek. When he speaks to the dragon he focused on what he said, not how he said it, and that made her feel better- but we all know, and the rest of the class knows too - that the donkey is better. \n\nNobody is born with leadership skills. I suggest you learn them that way you can avoid the problem of being a surrogate parent for your students and you can feel healthy and able with them that they look to you and expect you to show them how to behave.\n\nIf you need examples of free videos and some clubs and groups that teach leadership skills, send me a PM. I don’t want somebody else to say their opinion about the group and sway you into apathy. I keep my mind clear of the time it takes to share great ideas with the public because not everyone else has been working toward the same end as I have. \n\nGood luck. And for example, it does suck that students act that way when all you want to do is teach them to be successful. I am sorry you are frustrated with them and I too am frustrated! Does free advice for winning the class over sound suitable to your needs? You can let me know in PM or you in this thread. What do you think will help you? I wish I could do more.",
                  "author": "Zealousideal-Yard803",
                  "created": 1628638823,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h717fu8": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h717fu8/",
      "text": "You might be thinking, “well he doesn’t know all teachers.” Take your concerns about respect to the principal - that won’t be disrespectful.",
      "author": "Zealousideal-Yard803",
      "created": 1627610284,
      "upvotes": 2,
      "replies": {}
    },
    "h70fzvp": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h70fzvp/",
      "text": "Honestly professors rarely treat their students as actual adults. We should all treat each other with kindness and compassion as a default, but that goes both ways.",
      "author": "Gerardo1917",
      "created": 1627597344,
      "upvotes": 0,
      "replies": {}
    },
    "h708hcv": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h708hcv/",
      "text": "I had a classmate raise his voice at our female professor after he decided that the material on the test and from the past few lectures weren’t what he thought was most important to get out of the class. For context, this was an upper division elective math course and the student was an engineering major. When the prof asked calmly that he come to office hours to voice his complaints, he doubled down and argued that many people in the room agreed with him. No one backed him up and it was incredibly awkward. That was probably the single most arrogant and entitled student I have ever seen in a classroom.",
      "author": "runnerboyr",
      "created": 1627594039,
      "upvotes": 4,
      "replies": {
        "h8h6hrj": {
          "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8h6hrj/",
          "text": "Sorry you had to endure that. I’m frustrated when one student interrupts the learning of tens or hundreds of students who paid the same price. If a teacher notices the student who threatens their students in any form, I suggest they petition for the student’s removal. If that doesn’t suit the teacher, I suggest the student be petitioned into online classes for reduced interruptions.",
          "author": "Zealousideal-Yard803",
          "created": 1628641512,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h6zgfw6": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h6zgfw6/",
      "text": "For some people, it seems to be coming from a place of “this person is a customer service agent; I can treat them however I want.” Of course, that’s totally bogus, but some people think it’s okay to be rude and demanding to try to get your way (or just because that’s how they are). It may also just be lack of EQ or bad manners, or they may have seen their parents acting that way toward people and think it’s okay.\n\nFortunately, the vast majority of my students have always been polite, and I’ve never had any serious problems. A few have gotten a little combative over grades, and a few have been nasty in evals just to try to spite me for one reason or another (calling me a horrible person, saying I’m arrogant, etc. all because they just didn’t do the work they should have), but they’re very few and far between.",
      "author": "PhDapper",
      "created": 1627582354,
      "upvotes": 4,
      "replies": {
        "h8h69ez": {
          "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8h69ez/",
          "text": "Customer service agents are treated like garbage. It’s in some of the videos that train them. They are taught to fire the customer if they are being abusive. It is frustrating when students behave themselves in that manner. Teachers who do not want to lose their jobs and become news stories do not treat their students like garbage - it’s probably illegal. Teachers should be able to petition students to be transferred to another teacher or professor when at their wits end. Some people might say “some teachers want to be fired”. Is it suitable to say removing some students from some teachers would benefit the student and the teacher?",
          "author": "Zealousideal-Yard803",
          "created": 1628641398,
          "upvotes": 2,
          "replies": {
            "h8h7yql": {
              "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8h7yql/",
              "text": "When I’ve heard of cases of students being outright abusive, colleagues of mine have kicked them out of class and told them they can’t come back until they speak to the dean. It’s great when we have supportive deans who back us up in cases of people being nasty. Not everyone has that luxury, unfortunately.",
              "author": "PhDapper",
              "created": 1628642227,
              "upvotes": 3,
              "replies": {
                "h8haed8": {
                  "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8haed8/",
                  "text": "Sorry for the deans too. They have to make the decision that could cause complaints throughout the district or campus. A teacher should always have the power to change the class and at any time the group is threatened. It is that power that makes students followers and has grown my respect for the profession of teaching. Someone might say “they could be rapists”, if so I’ll wait for a jury to decide whether they are or not. \n\nSo if I understand you correctly, deans might not back up a teacher? I think that constitutes weak leadership. The teacher was chosen by measures far more stringent than requirements for classmates. If the dean cannot stand by their decision to choose a teacher and back up a teacher, then the dean might suitably be unqualified. For those who have opinions about “the story behind the teacher”, there are choices here based on no information. Standards are taught to keep the group safe. Many educators vote for new teachers and those not voted for cannot work for the school. Someone might say “the word vote triggers me, politicians aren’t trustworthy.” This wouldn’t be a suitable conversation for you.",
                  "author": "Zealousideal-Yard803",
                  "created": 1628643435,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h98a84s": {
              "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h98a84s/",
              "text": "I think I know why some people disrespect teachers...you guessed it...they don’t want what the teachers have to offer. I for one have appreciated to the T every piece of knowledge a teacher has ever offered me. And here I am succeeding. I call them knowledge nuggets. And my teachers are the best.",
              "author": "Zealousideal-Yard803",
              "created": 1629160838,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h6yqbuc": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h6yqbuc/",
      "text": "I agree that disrespecting teachers is wrong. However you’re not disrespecting them if they never had or earned respect in the first place.",
      "author": "GhostBlue1821",
      "created": 1627571622,
      "upvotes": 5,
      "replies": {
        "h8h5stp": {
          "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8h5stp/",
          "text": "I’m sorry. It is frustrating when somebody doesn’t want your respect. It’s frustrating to me too. I can only speak for myself.",
          "author": "Zealousideal-Yard803",
          "created": 1628641171,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6xbj8i": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h6xbj8i/",
      "text": "Everyone should be treated with kindness and dignity provided they have not given reason to be treated otherwise, but respect should be earned, not assumed. Someone jumping through the hoops of academia does not automatically earn my respect. One's willingness to earn academic credentials does not reflect their ability to teach, to build relationships, to be empathetic, to manage a classroom, build a lesson plan, or even necessarily mean that they are intelligent in a worldly way outside their scope of expertise.",
      "author": "Eighth_Octavarium",
      "created": 1627537948,
      "upvotes": 2,
      "replies": {}
    },
    "h6x8mn0": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h6x8mn0/",
      "text": "If you were taught by mommy and daddy that rapists and pedophiles were to be respected, you'd just believe it based on your broken logic.\n\nLet's be real, your job doesnt automatically determined if you're a good person or not.\n\nYou're lacking a lot of critical thinking here especially in a college sub. Flip the question on yourself... Are you sure you're in the right place? (College).",
      "author": "WickedProblems",
      "created": 1627535882,
      "upvotes": 12,
      "replies": {
        "h8h727u": {
          "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h8h727u/",
          "text": "I’m sorry you were taught that some people respect rapists and pedophiles. That’s frustrating to me too. I don’t think that’s fair. Those are criminal convictions. Is it suitable to suggest criminal actions are not stable enough to be apart of any community for an entire semester? I’ll check back and see what you have to say in a week or so.",
          "author": "Zealousideal-Yard803",
          "created": 1628641789,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6whrxx": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h6whrxx/",
      "text": "It goes the other way too. I dont understand why some teachers have such a bad and toxic attitude towards their students. Ive seen everything from girls running out of the class crying to a full blown shouting match. Some teachers are out of control",
      "author": "AreasofInterest",
      "created": 1627521203,
      "upvotes": 11,
      "replies": {
        "h6wx8ow": {
          "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h6wx8ow/",
          "text": "Yeah I agree. Can’t we just acknowledge that we both don’t want to be there and make the best of the situation?",
          "author": "Sleepy_Lingerie_Art",
          "created": 1627528948,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h6wf8qa": {
      "link": "/r/CollegeRant/comments/otmddn/whats_up_with_disrespecting_teachers/h6wf8qa/",
      "text": "Have my upvote",
      "author": "kneelender",
      "created": 1627519968,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634063973
}