{
  "sid": "mbbrdk",
  "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/",
  "title:": "You guys ever feel like this all a scam ?",
  "text": "We’re paying thousands of dollars for an “education” that consists of us staring at our laptops for hours at a time. I go to a school that is kinda known for business but we’re not some Ivy League school. Every kid here thinks they’re gonna work for Goldman Sachs or JP Morgan but that’s simply not the case. I read this line in a book I’m reading and I think it’s so true. “Competition makes people hallucinate opportunities that aren’t there”. They got us competing with grades, clubs and recommendations for high paying jobs that clearly prefer Ivy League students yet we all think we’re gonna make 90k out of college. The student debt just keeps going up cause more and more people are buying into this scam. Realizing this just made me completely lose motivation for school.",
  "author": "Johnboy1330",
  "created": 1616495680,
  "over_18": false,
  "upvotes": 276,
  "upvote_ratio": 0.98,
  "comments": {
    "gs4b02n": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gs4b02n/",
      "text": "I feel like people graduating high school think college is the only path. I have my own office working for the government and I don’t have a degree. I recently started college just because because I’m not paying for it.",
      "author": "Spicybooiii",
      "created": 1616634495,
      "upvotes": 2,
      "replies": {}
    },
    "gs1z0oa": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gs1z0oa/",
      "text": "While I believed that college was a scam, to begin with, I did not really see the full extent of it till this pandemic. Sure, while in-person classes existed, we all had to take those random gen ed classes that felt like a waste, sure we had random fees and overly priced textbooks with information you could google search, but one thing has been clear. This pandemic tested the abilities of administration and exposed a lot of poor administrative decisions which will ultimately hurt the student. Many schools have raised their tuition rates due to \"technological reasons\" despite receiving aid from the CARES Act, something that makes zero sense. While college is good for some and has benefits, you'd have to weigh out the pros and cons and see if it's a fit for you. Personally, if I could have found something else to do, I would have never went to college.",
      "author": "Hess20",
      "created": 1616597649,
      "upvotes": 2,
      "replies": {}
    },
    "gs0p84d": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gs0p84d/",
      "text": "Yea....and honestly I'm not even sure what to do about it anymore. It feels as if you knew it was a terrible thing, but you feel powerless to do anything about it.",
      "author": "oompaloompa543",
      "created": 1616564800,
      "upvotes": 2,
      "replies": {}
    },
    "gs0nevn": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gs0nevn/",
      "text": "Just remember, March madness generates a billion dollars, yet Players get zero.",
      "author": "The_Rhyne",
      "created": 1616563301,
      "upvotes": 3,
      "replies": {
        "gs0oh8z": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gs0oh8z/",
          "text": "Idk how people are okay with this. The athletes should have coordinated and stopped playing. No one should make a billion dollars off the backs or predominantly black players while they aren’t compensated at all",
          "author": "Johnboy1330",
          "created": 1616564172,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gs03zb5": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gs03zb5/",
      "text": "It is absolutely a scam. It's literally tens to a couple hundred thousand for a paper saying *yeah, they can work hard and know some stuff* ; and worse most of the money gpes to the board of the uni and progams that bring in the most funding/students, not even the uni, professors, etc.",
      "author": "Thermic_Aarvdarc",
      "created": 1616551276,
      "upvotes": 3,
      "replies": {}
    },
    "grzloou": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grzloou/",
      "text": "I vehemently disagree. As soon as I graduated high school I started working. I hated every second, working horrible fast food/retail/warehouse jobs, getting burnt with oil, yelled at by Karens, breaking my back from a falling package. I tried to teach myself programming but no one would hire without some sort of a college degree/internship. Sites like Indeed just auto rejected me to jobs. Eventually sucked it up and took my savings and enrolled full time in Computer Science at the local univeristy. I actually really appreciate how rigorous it is and my college offers free bootcamps, hackathons, career fairs for networking. I actually secured a $40 an hour full time summer internship as a junior- really excited to start. There is also a high chance they will offer me a part time job after the internship, so I will be able to pay off most of my loans, and the experience will be great for my resume. Without college I would have never had all these opportunities. I'm super excited to graduate and land a good paying job and be able to work remotely in a lovely tropical affordable place like Thailand! College is what you make of it, but it has been extremely beneficial for me.",
      "author": "janareena",
      "created": 1616541867,
      "upvotes": 2,
      "replies": {}
    },
    "grz2uge": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grz2uge/",
      "text": "Not to mention the scam of unpaid internships... internships are shitty in general as they are often a privelage to have bc of them mostly being unpaid or paid low, so only wealthy kids can afford to take them. Not to mention they’re competitive to get to just work for free or cheap basically. But many jobs require you to have them",
      "author": "peepeepoopaccount",
      "created": 1616533195,
      "upvotes": 10,
      "replies": {}
    },
    "gryev4h": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gryev4h/",
      "text": "It's a scam unless you're rich.\nIf you're rich big universities will always keep the door open for you, and then you can say you went to a school that is recognized throughout the country even if you barely pased your classes and don't know shit.",
      "author": "WhatABlake",
      "created": 1616522875,
      "upvotes": 2,
      "replies": {}
    },
    "gryd5j0": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gryd5j0/",
      "text": "Of course it’s a scam! I felt that way going through undergrad and I still do after earning my masters. Why are we forced to take courses that aren’t relevant to our degrees? To pay out more money that the colleges know the federal government will back. Why does tuition cost rise above the rate of inflation each year? My cost of living adjustment (not everyone is lucky enough to receive) is lower than the percentage increase in tuition each year. Why is Richard Lee Aaron, a professor of cello at U of M in the School of Music, Theatre, and Dance getting paid $216,929 annually? Statistically, none of his students will go on to earn what he earns by just being a professor. I could go on but I won’t. Looking back, the trades is where it’s at.",
      "author": "Successful-Heart9134",
      "created": 1616522149,
      "upvotes": 2,
      "replies": {
        "grz9n8h": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grz9n8h/",
          "text": "You’re so angry dude for absolutely no reason.",
          "author": "snoboy8999",
          "created": 1616536138,
          "upvotes": -1,
          "replies": {
            "gs0oj76": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gs0oj76/",
              "text": "he literally laid out a few reasons you dunce",
              "author": "Plat_4_Beat_Faker",
              "created": 1616564219,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gryaggf": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gryaggf/",
      "text": "Well yah know college isn't for everyone, its always kinda been that way, either you go to the house of education or well you find another way to pave your way through life. \n\nHands you the keys to the steam roller,, well get paving.",
      "author": "electricdom",
      "created": 1616521015,
      "upvotes": 2,
      "replies": {}
    },
    "grxzhfp": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxzhfp/",
      "text": "I think the best thing to do while in college, is to gauge the market in the area you’re planning on living and working after school and compare it with your major. How many jobs are available? How many of them require a master’s over just a bachelor’s? What’s the pay? And make adjustments accordingly. \n\nAt least where I live, any good paying job in Biology wants at least a Masters degree. I’m personally aiming for Optometry because I don’t see college being worth my time if I’m not making $100,000/year at least. I’d rather spend 8-10 years in school than to finish with just a bachelors and only make $50k TOPS. \n\nNow I’m saying this as a 30 year old with two kids. I’m a senior now and didn’t start college until I was 25 so my priorities are obviously different but it’s important to think long term. If you’re young, take the time to go for at least a master’s.",
      "author": "thnx4thememeories",
      "created": 1616516328,
      "upvotes": 2,
      "replies": {
        "grydnmb": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grydnmb/",
          "text": "This! If I would have only earned my bachelors, I’d be making crap pay. Now with my masters, I earn decent pay with room to earn more as I gain experience and grow as a professional but in a highly demanding and stressful field.",
          "author": "Successful-Heart9134",
          "created": 1616522360,
          "upvotes": 2,
          "replies": {
            "gryduds": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gryduds/",
              "text": "Love this for you!",
              "author": "thnx4thememeories",
              "created": 1616522439,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "grxyfb2": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxyfb2/",
      "text": "[valuetainment college](https://youtu.be/tXgCG50YoWs)",
      "author": "AP_MASTER",
      "created": 1616515877,
      "upvotes": 2,
      "replies": {}
    },
    "grxtovd": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxtovd/",
      "text": "I’m only doing my basics currently at a community college and don’t have debt (sorry if having no debt seems like bragging, I’m not trying to). Both last semester and this semester were at least $1300-$1700 for 3-4 classes each semester. \n\nThis semester, I had to pay for 2 textbooks that I don’t even use.",
      "author": "Best_Bisexual",
      "created": 1616513855,
      "upvotes": 2,
      "replies": {
        "grxu5br": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxu5br/",
          "text": "definitely regretting not considering the community college route at least for this first year",
          "author": "Johnboy1330",
          "created": 1616514052,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grxrtm5": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxrtm5/",
      "text": "It's more like a \"dog eat dog\" kinda thing!",
      "author": "Washingtonlover70",
      "created": 1616513040,
      "upvotes": 1,
      "replies": {}
    },
    "grxr3wn": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxr3wn/",
      "text": "i’ve thought college was a scam since before i got to college now i’m even MORE convinced lmao anyone who says otherwise is kidding themselves tbh. also ivy vs state vs private schools. Most times there really isn’t a huge difference in education and teaching. i can’t even count the amount of times i’ve had friends who went to brown harvard hale and princeton and we all took some of same way electives and gen ed’s and we use the same textbook. I’m gonna go on a limb and say the only difference is networking opportunity, prestige, and work load. I just think of ivy leagues as just a very intense AP class but it doesn’t make you special lmao",
      "author": "whatwhatchickenbutt_",
      "created": 1616512725,
      "upvotes": 10,
      "replies": {
        "grxttew": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxttew/",
          "text": "Yea I’m not saying Ivy League students are all geniuses it’s just that at least for one of the careers I’m pursuing(finance) most of the jobs I’d really want almost only recruit from Ivy League schools. They call the ivy’s and few other super prestigious schools target schools. There’s semi-targets and non-targets and whether your school is a target, semi, or non can play a part in you getting hired",
          "author": "Johnboy1330",
          "created": 1616513909,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "grxorvq": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxorvq/",
      "text": "Even if you were to start making \"90k\" in many cases that's not enough money to make if you're paying 16% in taxes which many middle to lower working class people have to pay",
      "author": "ldra994",
      "created": 1616511695,
      "upvotes": 1,
      "replies": {}
    },
    "grxo71r": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxo71r/",
      "text": "Oh yeah, especially since you're not guaranteed a high-paying job even after getting a degree.  I've worked with a lot of college graduates in retail.",
      "author": "UpbeatFaithlessness6",
      "created": 1616511440,
      "upvotes": 9,
      "replies": {}
    },
    "grxmuvs": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxmuvs/",
      "text": "[deleted]",
      "author": null,
      "created": 1616510848,
      "upvotes": 6,
      "replies": {
        "gry18k0": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gry18k0/",
          "text": "I 50% disagree. Haha. It’s just hard for everyone. For some people, giving school their ALL is easier for some than others. Especially when you consider financial and home life situations. Students with more support from their parents and family have a much better opportunity to excel in college. Where others have to work a full time job, some have kids or sick parents they have to care for. It’s not a one size fits all. If it was only a matter of working hard, that would be a much better situation. Unfortunately, there’s so much more going on in people’s lives that can prevent them from devoting copious amounts of time to their education.",
          "author": "thnx4thememeories",
          "created": 1616517076,
          "upvotes": 4,
          "replies": {}
        },
        "grxt52a": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxt52a/",
          "text": "Nah. Too expensive.",
          "author": "mr_munchers",
          "created": 1616513617,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "grxlale": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxlale/",
      "text": "It’s all a scam. My friend was in the nursing program at a community college and she was on her last semester. She had to take a capstone class and she failed one exam by 0.8 points and they kicked her out. Years of work are now wasted.",
      "author": "denver_rose",
      "created": 1616510149,
      "upvotes": 17,
      "replies": {
        "grxlk7k": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxlk7k/",
          "text": "Yea that’s insane, couldn’t imagine going through that. I’m worried about getting a C as a freshman and she had all her work and effort basically wasted",
          "author": "Johnboy1330",
          "created": 1616510270,
          "upvotes": 8,
          "replies": {
            "grxmpy3": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxmpy3/",
              "text": "Yeah this is why I didn’t even consider becoming a nurse or doctor because I knew how brutal it is.",
              "author": "denver_rose",
              "created": 1616510787,
              "upvotes": 4,
              "replies": {
                "grz9iwg": {
                  "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grz9iwg/",
                  "text": "Two totally separate processes. If you don’t meet minimum criteria in nursing school you don’t get certified. Point blank.",
                  "author": "snoboy8999",
                  "created": 1616536085,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "grxkiu7": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxkiu7/",
      "text": "I think that quote is true. \n\nI think you're right about the cost of education. I bet college enrolment will decrease significantly over the coming decade because of rising costs and diminishing returns to students of a college degree. \n\nI would recommend that you stay in school though, you don't need a job at Goldman to be a successful human, and a college degree does open other doors. However, if you're already crippling in debt, it's been proven time and time again that we do not need college degrees to become successful people.",
      "author": "sgRNACas9",
      "created": 1616509793,
      "upvotes": 8,
      "replies": {
        "grxm6zj": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxm6zj/",
          "text": "But that’s the issue. Everyone knows you don’t need a college degree to be successful. That’s more true now than any other time throughout Americas history. You can go to trade school, coding bootcamps, or just buy a course in anything you wanna learn. So although we know college isn’t necessary to be successful the shift to more kids doing other routes hasn’t happened yet so dropping out right now still looks bad. So although I know I don’t need this, it’s a waste of time and money, and there are options that would probably put me in a better spot to succeed,if I don’t go to college I’ll be considered a failure.",
          "author": "Johnboy1330",
          "created": 1616510553,
          "upvotes": 2,
          "replies": {
            "grxnguu": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxnguu/",
              "text": "I see what you're saying about being considered a failure. Such a shitty situation. I invite you to ask yourself if you're working on your college degree for education and career opportunities, or to adhere to a societal norm.",
              "author": "sgRNACas9",
              "created": 1616511120,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "grxhw77": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxhw77/",
      "text": "Yeah after a 1 1/2 semester I really felt no point in being in college especially after I lost interest in my major, so I withdrew",
      "author": "pyrrhicperson1643",
      "created": 1616508552,
      "upvotes": 9,
      "replies": {
        "grxjn0m": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxjn0m/",
          "text": "I really wish I could do that. I know for a fact spending the next three years working on something I’m good at and is profitable would be more beneficial than paying 70k to sit in front of a computer screen. Unfortunately there’s too many people counting on me, even if I tried to explain to them how much of a waste of time college is they’d just see it as me wasting an opportunity. My parents sacrificed so much for me to get my “education” and not getting it would crush them. All I can hope is the next three years get better once we can start having in person class. Are you taking a gap year or are you just not going back?",
          "author": "Johnboy1330",
          "created": 1616509384,
          "upvotes": 7,
          "replies": {
            "grxsqg9": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxsqg9/",
              "text": "I originally told everyone (including my parents) that I was going to take a year off. But now that I have actual time to work on myself and my job. I’ve found that I’m a lot happier right now than ever before. Even if I won’t make a ton of money currently (my work is employee owned so they enroll each employee in a stocks (ESOP) program) I enjoy having time for myself. So I really don’t know if I’ll ever go back. If I do I’d just want to do something short and simple like get a certificate in something. \n\nI think everyone should live their life they way they want. My parents worked hard to try to get me to be Mormon, but I couldn’t stick with it and had no interest in it. If your parents aren’t paying for your school then I suggest making a pros and cons list and doing what you think feels right. I withdrew but I still have to pay back my scholarships and my federal loan. So keep that in mind if you drop out too.",
              "author": "pyrrhicperson1643",
              "created": 1616513438,
              "upvotes": 2,
              "replies": {}
            },
            "gry0anl": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gry0anl/",
              "text": "Wont classes be back in person next semester?",
              "author": "thnx4thememeories",
              "created": 1616516674,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "grxdado": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxdado/",
      "text": "If I was 18 again, I would have worked hard to finish college as fast as possible. No, college is not meant for partying. It’s all about the connections you make, the job experience, and your grades, so you could at least pass the filter. Get in, make of it as much as you can, and get out as soon as you can. The college experience is meant for the rich kids.",
      "author": "StarDingo",
      "created": 1616506275,
      "upvotes": 69,
      "replies": {
        "grxegx2": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxegx2/",
          "text": "I can’t buy into the grades thing. I wanted to push myself to get good grades this semester but I just can’t. I’m not sure if it’s the fact I’m learning over zoom or how pointless most of the classes I’m taking feel. Everyone around me cheats so studying just makes me feel even more down. Part of me feels like I should just aim for B’s while learning a technical skill like coding.",
          "author": "Johnboy1330",
          "created": 1616506879,
          "upvotes": 22,
          "replies": {
            "grxhxi8": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxhxi8/",
              "text": "When it comes to the situations like your’s, remember this: “Don’t make decisions for temporary comfort.” Tough it out. Go to the local library. Once you get a job, everything that is causing you discomfort won’t matter. For now, grind it out and get a job.",
              "author": "StarDingo",
              "created": 1616508569,
              "upvotes": 19,
              "replies": {}
            },
            "grzkdy7": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grzkdy7/",
              "text": "Why not change your major to Comp Sci then? You still have time if you are a freshman.",
              "author": null,
              "created": 1616541224,
              "upvotes": -2,
              "replies": {}
            }
          }
        }
      }
    },
    "grxcou2": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxcou2/",
      "text": "I decided my specific sector of business major this semester. This semester was also the first time I'm taking that class. I miscalculated how I'll do in that class last night and sent my professor 3 separate emails during my subsequent panic attack. \n\nThis hundred of thousands (but let's be honest, interest can make it closer to a million) dollar education is giving me panic attacks and worsening mental health, meanwhile I haven't actually retained anything",
      "author": "discerningpotato",
      "created": 1616505969,
      "upvotes": 16,
      "replies": {
        "grxdrhp": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxdrhp/",
          "text": "Damn dude I get the struggle, there’s no way most kids are actually learning like this over zoom, everyone I know just cheats",
          "author": "Johnboy1330",
          "created": 1616506519,
          "upvotes": 9,
          "replies": {}
        },
        "grxu2oi": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxu2oi/",
          "text": "i dont get anything at all. im just getting assignments done just so i can get the grade. it makes me sad bc i have a passion, but all of this feels useless now.",
          "author": "feedmebananas",
          "created": 1616514019,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "grxclcj": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxclcj/",
      "text": "You have to realize that you must be your own advocate and do your own research when you're an adult. My brother went to a normal state school and got a business degree. Big 4 loves recruiting from state schools and they are golden on a resume. Many employers also pay for your MBA, and it's significantly easier to get into Ivy Leagues for post-grad, and if you network with that you can make it into Investment Banking (although I would never want to work for JP Morgan/Goldman Sachs, they literally work 100 hours a week, just read experiences on Quora/Job boards like Glassdoor). Do your own research, to me work life balance matters much more than prestige, I would much rather work for something like a federal contractor that offers great flexibility and work life balance vs Goldman Sachs and kill my self slaving 100 hours a week just because of the status.",
      "author": null,
      "created": 1616505920,
      "upvotes": 10,
      "replies": {
        "grxjmqg": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxjmqg/",
          "text": "Part of the problem is that when you are 18 you don't know any of this.\n\nI agree with you. State school, never a private school unless you get a dream scholarship that makes it as affordable as a state school.\n\nAlso, major in something that makes you employable as soon as you graduate. Sorry English majors but as lovely as literature is, it doesn't pay unless your daddy already set you up with a trust or family business.\n\nIf you are going to get a loan, please understand that it is compound interest and your debt will grow fast. You will have to pay more than what you borrowed. A lot more. That is what compound interest does.\n\nAnd in relation to online vs. face-to-face, you are not struggling because classes are online, you are struggling because life sucks for everyone right now. I'm in my fifties and nothing has sucked more than this past year (honorable mention to my last year of my PhD though). The joke is that many grandmas die at the end of the semester. I lost count how many of my students' grandmas have died this year for real. It's a really, really bad year.",
          "author": "ThatProfessor3301",
          "created": 1616509380,
          "upvotes": 18,
          "replies": {}
        }
      }
    },
    "grx9a6c": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grx9a6c/",
      "text": "Oh bro. College is totally a scam. Especially universities. They get MILLIONS of dollars out of sponsors for their athletic programs. Another million out of \"generous\" donations. More like \"here's alot of money, and you take my kid no matter WHAT his/her gpa. Deal?\". Money from \"Charities\". Tax write offs from \"art\", \"historical\", \"education\", \"refinance\", fuckin ugh...\n\nBut insist \"oh yea, you gotta pay thousands for books, and about ten thousand for the class, and that's on the lower end, oh yea. And u gotta pay for parking. You'll probably just end up walking everywhere cause there's never a spot. But yea... Sorry 🙂\"\n\nAnd don't get my started on the quid pro quo that's going on between them and BANKS. Profiting off eachother teaching people that Debt is normal.. It's fucking not btw",
      "author": "mr_munchers",
      "created": 1616504175,
      "upvotes": 100,
      "replies": {
        "grxalr7": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxalr7/",
          "text": "When I found out how endowments work and that colleges got to basically be hedge funds and invest their endowments how ever they want while also getting tax breaks for being a school I couldn’t believe it. They make us go into debt for a mediocre educations that have no guarantee of a job when if we took that money we would pay for school with and invested it like they do with their endowments we’d be in a much better spot then paying for an “education”",
          "author": "Johnboy1330",
          "created": 1616504884,
          "upvotes": 32,
          "replies": {
            "grxsoaw": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxsoaw/",
              "text": "[deleted]",
              "author": null,
              "created": 1616513413,
              "upvotes": 2,
              "replies": {
                "grxuh5n": {
                  "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grxuh5n/",
                  "text": "I maybe confusing endowments with something else but I know that college have large sums of money that they basically get to invest as if they were a hedge fund. I’d love for you clear things up for me if I’m just way off",
                  "author": "Johnboy1330",
                  "created": 1616514193,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "grx6me8": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grx6me8/",
      "text": "Well yes you are right. Completion has made us hallucinate things. Ive seen kids that partied all 4 years and they still tell me “ oh I’ll get a job when I’m out of college, I’m exited to get in the real world”. But the question is, where the hell have you been for 4 years. What I would advise for college and it is not fun. Take on as much load as possible and work on the side. Work teaches you things and college some things too. Yes, college has become more of a business practice. Just do you and don’t take anybody opinion but yours",
      "author": "Frenchdu",
      "created": 1616502670,
      "upvotes": 46,
      "replies": {
        "grx7wyn": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grx7wyn/",
          "text": "That’s exactly what I’m talking about, kids will literally put in no effort into learning real world skills but somehow still think that high paying job is just gonna be sitting there waiting for them",
          "author": "Johnboy1330",
          "created": 1616503420,
          "upvotes": 17,
          "replies": {}
        },
        "grx83px": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grx83px/",
          "text": "I blame the universities because it’s the dream they sell us. They advertise the “average expected salaries” of their graduates without any context at all and as a 18 year old you just completely buy into it",
          "author": "Johnboy1330",
          "created": 1616503526,
          "upvotes": 20,
          "replies": {
            "grx8qp8": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grx8qp8/",
              "text": "Again, I’d say it really depends how naive you are of the world. Personally, my parents forced me to go so I did. But I never bought into the bullshit they be selling.",
              "author": "Frenchdu",
              "created": 1616503880,
              "upvotes": 7,
              "replies": {}
            },
            "gry7jxp": {
              "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gry7jxp/",
              "text": "Exactly, it sucks even more when the professors barely know what they’re doing. I’ve heard about a lot of people who had to spend an extra semester or even YEAR at school because their advisor didnt know what they were doing. I wanted to do the BA/MA program at my school and my professor/advisor said I’d be a good fit. Then I told her i was second guessing it the following semester and she was like “yeah i dont think youre ready for it”. That was her immediate response after she already told me I was capable????",
              "author": "kickitlikeadidas",
              "created": 1616519772,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "gry69z1": {
          "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/gry69z1/",
          "text": "The only good thing i have gotten out of college is the 3 years of customer service experience at the library, have met tons of people, and the chance to study abroad. Probably wouldn’t have gotten that anywhere else.",
          "author": "kickitlikeadidas",
          "created": 1616519227,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "grx4bul": {
      "link": "/r/CollegeRant/comments/mbbrdk/you_guys_ever_feel_like_this_all_a_scam/grx4bul/",
      "text": "Depending on the major you choose, yes.",
      "author": "HorseJr12",
      "created": 1616501252,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634063765
}