{
  "sid": "khn883",
  "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/",
  "title:": "Dear Professors, I know structuring upper division courses to be online is difficult, but assigning more work =\\= better and consistent learning",
  "text": "Sincerely, a student who has been frantically (but efficiently) working on final projects and finals for quite literally 11-13 hours everyday for the past week.",
  "author": "pinkaloe",
  "created": 1608575943,
  "over_18": false,
  "upvotes": 287,
  "upvote_ratio": 1.0,
  "comments": {
    "ggt5rgy": {
      "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggt5rgy/",
      "text": "Was your instructor new to online teaching? The first thing I discovered when I had to take my courses online was that it took considerably longer to cover the same amount of material or get the same amount of work done in a Zoom classroom. Even once an instructor is proficient in running a Zoom classroom (and many of us were thrown into it and had to learn on the fly), everything takes longer: the interface is unwieldy, transitions take longer, it's easier for students attention to wander, and time is wasted repeating instructions and getting them on task. I suspect that many professors in this situation tried to make up for lost in-class work by shifting that work to homework.",
      "author": "SnooHobbies3488",
      "created": 1608741491,
      "upvotes": 4,
      "replies": {
        "ggt8v2c": {
          "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggt8v2c/",
          "text": "That’s fair, there are definitely a lot of factors to consider when evaluating professor’s performance in a new online setting. You bring up great points! I definitely wasn’t trying to diss all professors, this is a learning experience for everyone.\n\nThe professor I was referring to in this post was one who actually nailed down the course materials and how he presented them. It was suggested that the class was thoroughly planned all summer, and it showed ! Being in comp sci too, he definitely had a leg up.\n\nThe main issue was that since there was a greater divide between him and the students, and the fact that the course was in his research area, he tended to have lofty expectations for the projects assigned throughout the semester. The amount of requirements made them very time consuming to implement, especially for students who are using the technologies for the first time. Despite watching his lectures asynchronously on 1.5-1.75 speed, I still was spending upwards of 13-15 hours a week on a 3 credit class. Granted I did well, but it shouldn’t be nearly impossible (time-wise) to get A’s in courses when you’re taking a full credit load. \n\nSo, I guess what I’m just trying to say that internet student anonymity and slowed communication contributed to a disconnect that can cause professors to unintentionally overburden their students",
          "author": "pinkaloe",
          "created": 1608743101,
          "upvotes": 2,
          "replies": {
            "ggto5pc": {
              "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggto5pc/",
              "text": "And your comments are fair as well. I was commenting on a more general trend I witnessed since Covid.\n\nSince your prof. plans his course so carefully, I'll bet he's taking into account student feedback as he prepares for the upcoming semester. Sorry you got buried this semester, but it sounds like you came through well.",
              "author": "SnooHobbies3488",
              "created": 1608751037,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ggoh7uw": {
      "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggoh7uw/",
      "text": "Yeah it sucks;(",
      "author": "jakepem91",
      "created": 1608631675,
      "upvotes": 1,
      "replies": {}
    },
    "ggo3kuu": {
      "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggo3kuu/",
      "text": "This!!! My only saving grace was my lack of filter and my professors having monthly check ins. Over the spring, each class had assigned readings, 2 Zoom discussions, 2 written discussions, a quiz, two essays, and of course, 2-3 comments on each written discussion. Then midterms and finals and additional \"more heavy\" weeks. Any time I completed a class with a decent grade, I'd fill out those check ins and say how the work was way too much. Did it change anything? Just my chaotic rage being channeled somewhere.",
      "author": "Automatic_Corgi_3237",
      "created": 1608618306,
      "upvotes": 7,
      "replies": {
        "ggoxeb1": {
          "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggoxeb1/",
          "text": "One of my profs had similar check ins and every single time every student would say that the exams were too different from the practice exams, and he never did anything about it",
          "author": "NeonRose222",
          "created": 1608645915,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ggnpbar": {
      "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggnpbar/",
      "text": "As someone who has been dealing with \"upper-level\" classes this term, I can relate. I absolutely hate how much work I have to do, and then my professor doesn't mention that we have work over Christmas break until after we have left for break. This is also while she is so far behind grading our work and not responding to emails.",
      "author": null,
      "created": 1608608719,
      "upvotes": 13,
      "replies": {}
    },
    "ggnlgin": {
      "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggnlgin/",
      "text": "I had a professor assign 20 assignments not including the readings, every week. If I didn’t spend at least 6 hours a day just doing the assignments, I was falling behind. I took 4 grad classes and this ended making me work half the day away(literally 9-12 hours) while I was taking care of the house and babysitting. I was super frustrated with this class and the professor was reported to the dean. She had to take down so many assignments from the syllabus and she was consistently behind on grading the assignments that had already been turned in. Like a month behind. I don’t see why the professor would do that to herself as all assignments were written and not quizzes or multiple choice. Everything was response based.",
      "author": "Philofmyfuture7813",
      "created": 1608606501,
      "upvotes": 32,
      "replies": {
        "ggnq2vd": {
          "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggnq2vd/",
          "text": "That’s the biggest L 😭",
          "author": "pinkaloe",
          "created": 1608609160,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "ggn3xhj": {
      "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggn3xhj/",
      "text": "also, work != good; difficult != good",
      "author": null,
      "created": 1608596857,
      "upvotes": 39,
      "replies": {
        "ggo19pv": {
          "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggo19pv/",
          "text": "me actually understanding this because I took a stats class with R this semester 😏😏",
          "author": "ilovestephenhawking",
          "created": 1608616445,
          "upvotes": 3,
          "replies": {
            "ggpk5e8": {
              "link": "/r/CollegeRant/comments/khn883/dear_professors_i_know_structuring_upper_division/ggpk5e8/",
              "text": "it’s sad i know what this means",
              "author": "mybonsaiherbie",
              "created": 1608658308,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634064440
}