{
  "sid": "ri10cr",
  "link": "/r/CollegeRant/comments/ri10cr/bombed_final/",
  "title:": "bombed final",
  "text": "idk why I did. Im well at calc and my average has been an A until today. I left like so many blank because I just didnt have motivation to finish them. idk why. its making me hella depressed. my grades gonna be a B which is pretty ok and good. but idk. today was awful, not sure why I feel like this. I thought I was gonna do well cause I prepared well. its not the end of the world I just hate this feeling fr. Im praying I at least got a 66 :/ \n\nlike it doesn't get better than this huh?",
  "author": null,
  "created": 1639690953,
  "updated": 1639788367,
  "over_18": false,
  "upvotes": 39,
  "upvote_ratio": 0.93,
  "comments": {
    "hou7b9l": {
      "link": "/r/CollegeRant/comments/ri10cr/bombed_final/hou7b9l/",
      "text": "You got a B in a math class. Good job!",
      "author": "Throwawaynobodywoo",
      "created": 1639693266,
      "upvotes": 27,
      "replies": {
        "houms8w": {
          "link": "/r/CollegeRant/comments/ri10cr/bombed_final/houms8w/",
          "text": "Thanks! Gotta think positively 😭",
          "author": null,
          "created": 1639699984,
          "upvotes": 5,
          "replies": {}
        },
        "houx7em": {
          "link": "/r/CollegeRant/comments/ri10cr/bombed_final/houx7em/",
          "text": "facts I would absolutely kill for an B in a math class",
          "author": "Skylord_ah",
          "created": 1639704705,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "houlx78": {
      "link": "/r/CollegeRant/comments/ri10cr/bombed_final/houlx78/",
      "text": "Idk about I thought I was going to flunk 2 finals this week. I got a 85% on the one and a 76% on the other. Idk how I did it since I barely studied for either. Isk I've notice I tend to do decent if I don't study",
      "author": "MechanicExtension565",
      "created": 1639699590,
      "upvotes": 6,
      "replies": {
        "houmpow": {
          "link": "/r/CollegeRant/comments/ri10cr/bombed_final/houmpow/",
          "text": "Yo that’s good, you probably smart as hell though. Fr imma have to think positively then thanks 😭",
          "author": null,
          "created": 1639699952,
          "upvotes": 2,
          "replies": {
            "houoy6l": {
              "link": "/r/CollegeRant/comments/ri10cr/bombed_final/houoy6l/",
              "text": "I've noticed it depends on the subject like math passed them with no issue but I bombed my math final",
              "author": "MechanicExtension565",
              "created": 1639700976,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hoxm355": {
      "link": "/r/CollegeRant/comments/ri10cr/bombed_final/hoxm355/",
      "text": "This happens to me sometimes, I usually attribute it to test anxiety, too much stress, or lack of sleep.  The best thing you can do is treat it as a learning experience and work on mentally preparing yourself for your next test.  You said you had been doing well jn math, so understanding is not the issue.  Maybe find some calming exercises you can do to recenter your mind, or make sure you get a good night's rest before.  Those both sound silly but knowing how to test and knowing how to prepare for a test are both skills that can be learned.\n\nCongrats on the B, it's still a good grade. Enjoy your break!",
      "author": "stumbling_thru_sci",
      "created": 1639757726,
      "upvotes": 6,
      "replies": {}
    }
  }
}