{
  "sid": "q5finu",
  "link": "/r/CollegeRant/comments/q5finu/missing_precovid_college_life/",
  "title:": "Missing pre-COVID college life",
  "text": "Don't get me wrong, I'm happy to be here and it's a MUCH better year than last. But as a senior I still kind of long to return to the way things were two years ago. On-campus events are returning thankfully, but there are far more limitations to what can be done. Outdoor events are as good as they were in 2019 but there are far, far fewer indoor events. Used to things would sometimes be held on on-campus houses, but because of COVID a house can get shut down now for holding an indoor event. I was never even a partier, but even I kind of have nostalgia for the days when everyone actually got excited about parties and the like without all the worrying about anyone's health. Plus, my school used to sometimes sponsor short trips to off-campus events. Now it won't even advertise for anything off-campus in its newsletter.\n\nAgain, I'm much happier than I was a year ago, don't get me wrong. We have entirely in-person classes again, and we're actually allowed to sit in the coffee shop and the student center once more. Those things are a breath of fresh air and I feel far more relaxed than I could have even imagined six months ago. Nonetheless, it's definitely not the same as living in a pandemic-free time.\n\nI have friends who go to colleges that have pretty much reverted to pre-COVID life minus mask mandates. I recognize that the way my school is being more vigilant is more responsible and do not think they're making a bad choice. Yet I kind of envy my friends who don't have to worry as much. Particularly since my school has a vaccine requirement, I kind of hoped (even if I recognized it wasn't realistic) that we could let go of pandemic anxiety this year. We're moving towards that point thankfully, but we certainly aren't there yet.\n\ntl;dr life was a lot more relaxed on campus before the pandemic.",
  "author": "thereslcjg2000",
  "created": 1633896039,
  "updated": 1634093801,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.92,
  "comments": {
    "hg6newm": {
      "link": "/r/CollegeRant/comments/q5finu/missing_precovid_college_life/hg6newm/",
      "text": "My first semester at a four year college was right in the middle of the pandemic. It was a really awful time for me. My grades seriously suffered that semester since I was stuck in a place with people who were in their own friend groups, or didn't really see me as a friend material or that I was the weird one. I felt like everything that was built up by my family about college life was a lie. That I'd meet my best friends here, enjoy parties, that this will be the best years of my life before it goes downhill after graduation. I hate how the media and people around us hypes up this place, yet now, I just want to get my cap on and leave.",
      "author": "ThisisUnicorn996",
      "created": 1633920816,
      "upvotes": 3,
      "replies": {}
    }
  }
}