{
  "sid": "r6lwd9",
  "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/",
  "title:": "I just don’t have the endurance for this.",
  "text": "Every year it’s always the same, I end up doing well in the first couple of months, then I start slacking and not caring since it starts getting repetitive. I don’t understand why it’s like this for me, but it’s been annoying how I work so hard to just waste it all in the end anyway. I am already three years in and I’m probably going to end up saying I’m a sixth year at this rate. I thought I would enjoy aerospace engineering since I was so passionate about it. Now I can’t stand having to go through hours of coursework and sleepless nights just to end up with C’s or even a C- which means I have to retake the class again. It’s also embarrassing taking a class as junior that is dominated by freshmen. I don’t even care about having a job at this point as I’d hate my life even more.",
  "author": "tiger_wristwatch",
  "created": 1638384321,
  "updated": 1639872544,
  "over_18": false,
  "upvotes": 120,
  "upvote_ratio": 0.98,
  "comments": {
    "hmulazl": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmulazl/",
      "text": "Bruh burnout is such a pain...\n\nIts always easy in the first two months, then you forget something and get mad and sad and give up because you lost your perfect streak. You end up oversleeping and missing an 8am class. Then you wake up and realize you dont have food in your dorm but your alarm is always set perfectly so that you cant go out of your way to get food elsewhere or you will miss the beginning of class. You never arrive late to class out of embarrassment, you would rather just miss it. Its a whole mess.\n\nThis is why next semester only one of my classes will be an 8am and the rest of them will be afternoon. This sucks because my favorite class will be the 8am one, and I had to drop another class because its only option was another 9am. So I will compromise on one 8am and being able to always sleep in the next day. I cant wait, except now it will be freezing everywhere!",
      "author": "Erosion139",
      "created": 1638394756,
      "upvotes": 34,
      "replies": {
        "hmwc9ry": {
          "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmwc9ry/",
          "text": "On a related note, a number of universities are offering more 8-week courses. You might see if there are any offered that fit your degree plan.",
          "author": "cajunsoul",
          "created": 1638422887,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmuv3do": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmuv3do/",
      "text": "i understand you OP the cycle is draining. but do you really have to pay money retake a class for a C? C's get degrees.",
      "author": "Revolutionary_Bad405",
      "created": 1638398596,
      "upvotes": 11,
      "replies": {
        "hmvqdzj": {
          "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmvqdzj/",
          "text": "D’s too, as long as it is not a prerequisite of any required course",
          "author": "allgone6996",
          "created": 1638412283,
          "upvotes": 2,
          "replies": {
            "hmwcw1r": {
              "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmwcw1r/",
              "text": "Unfortunately most colleges count D's as failing if they are in a major related course.",
              "author": "cabbage-soup",
              "created": 1638423239,
              "upvotes": 8,
              "replies": {
                "hmwd63x": {
                  "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmwd63x/",
                  "text": "At my college, D is a passing grade but only C and beyond satisfy the requirement if that class is a prerequisite of other classes. Just wanna clarify.",
                  "author": "allgone6996",
                  "created": 1638423398,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "hn1a7h3": {
          "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hn1a7h3/",
          "text": "Not for a C but for a C-, for some classes a C- isn’t considered passing.",
          "author": "tiger_wristwatch",
          "created": 1638510354,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hmu9stz": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmu9stz/",
      "text": "Hey- junior here- first semester as a junior and will be getting 4 C's due to burnout and stress.\n\nCould fail the classes if I don't work hard enough. You gotta believe in yourself and pace yourself. Tell yourself that you will pass- you will pass. I will pass. It is all about how you look at it. Tell yourself that you will do better next semester- I will do better next semester. Tell yourself that mistakes happen- you will learn- Mistakes happen- I will learn. \n\nYou got this! I got this!",
      "author": "Pandora_sus",
      "created": 1638390451,
      "upvotes": 9,
      "replies": {}
    },
    "hmwhbrz": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmwhbrz/",
      "text": "Remember that a grade doesn't define you. I spoke to an systems engineer for Facebook who works on servers(shes project lead btw after being an engineer for 2 years). It took her 7 years and she started college a year later than most, and she doesn't regret the time it took her, the classes that she failed, and the embarrassment she endured because ultimately she learned something every time. She told me that failure is like shooting a target. If you miss, you use the results of you last effort to adjust. You try again. see where it lands. repeat. Eventually you hit your target. Some peoples targets are further away so its a harder shot. The further the target, the greater the achievement.\n\nbottom line, keep your head high, hang in there, hardship builds character, its going to work out.",
      "author": "Mason_08061996",
      "created": 1638425958,
      "upvotes": 4,
      "replies": {}
    },
    "hmwy33m": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmwy33m/",
      "text": "This is objectively bad advise, but try doing something crazy and stupid (but not somthing TOO dangerout obviously). I'm back in complete burnout mode just like you and probably need to get to it pretty soon. Last year it was heading out on a bike at 3 pm and going as far out as I could; ended up looping back way too late and spent a few hours totally lost in the dark before following a highway back home, didn't get back till 10 (extremely dangerous and stupid). Jarring experience, but helped ground me for the next couple weeks, you know. That or routine nightwalks, just something to mix it up (which I hate doing normally because I prefer living in my room 24/7 mostly and don't attend most classes).",
      "author": "ISwearToFuckingJesus",
      "created": 1638439065,
      "upvotes": 3,
      "replies": {}
    },
    "hmwcs81": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmwcs81/",
      "text": "I'm the same way. I start off every semester strong and I end each semester by skipping a majority of my classes and working on personal projects instead. School is draining as hell",
      "author": "cabbage-soup",
      "created": 1638423180,
      "upvotes": 2,
      "replies": {}
    },
    "hmwrgp9": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmwrgp9/",
      "text": "I feel this… I was an aero major too, and always knew I would be, even went to Space Camp as a kid, twice actually. I would’ve been a Junior this year. Then last semester, I snapped. I fell into a depressive episode so bad I wouldn’t eat at all some days, wouldn’t shower for over a week, and just generally lied in bed crying all day. So much as touching my books or laptop gave me panic attacks. It’s worth noting I didn’t have a history of  mental illness prior to all of this, quite simply, college in the time of the pandemic fucking destroyed me. I was forced to take an indefinite leave of absence from school, and I don’t know when or if I’ll ever be able to return. It could happen to anyone, so please take care of yourselves.",
      "author": "TheBryanScout",
      "created": 1638433427,
      "upvotes": 2,
      "replies": {}
    },
    "hmuqy2k": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmuqy2k/",
      "text": "So you've identified the problem, you lose your motivation, so that's what you need to solve.  Don't just expect things to change, figure out how to overcome that obstacle.  Talk to a counselor, your school has them for free (well you've already paid for it).",
      "author": "kryppla",
      "created": 1638396929,
      "upvotes": 2,
      "replies": {}
    },
    "hmv3bfo": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmv3bfo/",
      "text": "Exact same boat",
      "author": "MardiGrowl",
      "created": 1638402250,
      "upvotes": 1,
      "replies": {}
    },
    "hmv9jm0": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmv9jm0/",
      "text": "Weird suggestion but maybe aerospace should be treated more as a hobby rather than a career. I sort of had to accept that the major I'm currently going for might be too much work for me, even though it's the one subject that I find myself always curious about, and that it should be something I should just do for fun rather than something I'll burnout in. Idk how the career advisors are in your college, but I'll suggest going there anyways. There's really not much to lose except your faith in humanity, and that's worst case scenario. At least for me, we were able to talk about careers that require less work but also still in demand, as well as other potential careers that might be easier for me to autopilot through in case my dream career ends up doing more harm than I thought. It's a journey, and maybe I'm misunderstanding the situation, but there's times where you need to fix the problem and times where you need to let it die and move on.\n\nEdit: should probably mention that I'm not saying you should do something else. At the end of the day, I'm just a stranger on the internet; I don't know the situation as well as you do. But I guess I'm projecting *a lot*, and I want to sort of give out a suggestion in case it's too much to just cope through motivational problems. Especially if you have any mental issues alongside this, it might be easier to find something with a lot less expectations and have something you're passionate about outside of work. But then again, I will admit, I don't know jackshit about aerospace, nor anything surrounding your situation, so please take what I said with a grain of salt.\n\nAnother thing - I also just remembered about pass/fail. If you're getting C's, I suggest utilizing that. Although, weigh your options still, cause having sleepless nights is probably the easiest way to accidentally give your burnout its own burnout if that makes any sense.",
      "author": "Monthly_Vent",
      "created": 1638404963,
      "upvotes": 1,
      "replies": {
        "hmvck94": {
          "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmvck94/",
          "text": "This is what I hope I've done, I really like working with electronics and building things but I hate the maths so I just do it for a hobby. Taking new media studies for the degree and it's like the other big thing I do with my time.",
          "author": "Erosion139",
          "created": 1638406289,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmy75bd": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hmy75bd/",
      "text": "How does. C or c- mean take again",
      "author": "NoAd5564",
      "created": 1638463398,
      "upvotes": 1,
      "replies": {
        "hn1a5mz": {
          "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hn1a5mz/",
          "text": "In my school you can’t get a C- on certain classes.",
          "author": "tiger_wristwatch",
          "created": 1638510322,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hn02c7w": {
      "link": "/r/CollegeRant/comments/r6lwd9/i_just_dont_have_the_endurance_for_this/hn02c7w/",
      "text": "This is what people mean when they say \"burnout\".  You're a human being not a robot.  Be kind to yourself.",
      "author": "ohnosorryhaha",
      "created": 1638489727,
      "upvotes": 1,
      "replies": {}
    }
  }
}