{
  "sid": "r6btpf",
  "link": "/r/CollegeRant/comments/r6btpf/if_youre_struggling_its_worth_talking_to_your/",
  "title:": "If you're struggling, it's worth talking to your school...",
  "text": "... it's probably given me the first glimpse of hope in about 2 months. This post is less of a rant, and more of sharing a learning experience for both myself and for others to learn from.\n\n\\---\n\nBack in mid-October, my pet bearded dragon I've kept for 8.5 years became suddenly ill during mid-terms week. Without warning, he started showing signs of being ill and I rushed him to the emergency vet. Long story short, he had a problem that at best could be treated with experimental care, and at worst not help him and be incredibly expensive. I chose to have him euthanized, believing it was the most ethical option. In less than 24 hours, I went through a vet scare that escalated into grief and loss.\n\nTwo of my classes had mid-terms, the other 2 did not because the course was not designed with them in mind. I only completed 1 of my mid-terms. The other, I discussed with my professor about and while he couldn't give me an extension (I talked to him about this after it was due), he expressed that he would be happy to work with me if I let him know. I needed to reach out next time, but I should pass the class given I've done well in it and continue to do well. He's a professor that has a lot of classes within my major so I'll probably be seeing a lot of him in the future.\n\nI left that meeting saying to myself \"I'm going to open up about this stuff more.\" Instead, I kept walking into one of my 4 classes, having no idea what's going on because the stress of losing my pet suddenly did something weird to my brain- it is like I forgot everything I learned and I blanked on assignments. I'm an adult with the cursed gift of being \"the gifted child,\" where I can break through the stuff I find easy until I hit a wall. As a result, I'm a good test taker that doesn't know how to study. So I just kinda sit down and get frustrated. Even though I asked my professor how I can understand the topic, I would get it until I would make the 15 minute drive and be totally lost. When I get frustrated, I put the thing frustrating me aside and work on something else. \n\nAnd so began this cycle of \"I don't get it, this is Greek to me, I'm working on something else.\" For the past. Month. And a half. \n\nHaving this failure on my mind has really brought me down. Even though I've kept up with my other classes, I have not kept up with this class. My pet was kind of my rubber ducky- a term used by us tech folks to help us in troubleshooting our own problems by breaking concepts down to the level an inanimate object with no brain can understand. I have a new rubber ducky now and he's adjusting well, but it was hard for me to break things down for this class. \n\nI started to get really demotivated. I had things due last week I just couldn't really do beyond the bare minimum because I felt frustrated in my failure to understand something I previously got. It was overwhelming. I am reviewing stuff from earlier in the semester because the class builds on top of itself. \n\nYesterday, I sought out a general advisor after being pressured into it. I cannot drop this class, but I was made aware that my college is offering class extensions to help students going through difficult times. I'm fortunate that my college offers this opportunity and that it won't negatively affect my completion rate. Even if I had no choice but to fail the class out and try again in spring, I'm fortunate I kept my GPA up that a fail wouldn't destroy my GPA.\n\nI let my negative feelings stew. The mistakes I made were to not speak to student services sooner.",
  "author": "Shohdef",
  "created": 1638354630,
  "updated": 1638480997,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hmtml7h": {
      "link": "/r/CollegeRant/comments/r6btpf/if_youre_struggling_its_worth_talking_to_your/hmtml7h/",
      "text": "College is hard. Grief is even harder. These two things combined will never be easy. Don’t beat yourself up over your substandard performance right now. The worst that could happen is you decide to take the class again. The best thing that could happen is you get a passing grade and move on with your degree.\n\nI’m sorry for you loss. I went through pretty much the exact same thing with my cat in mid October. Noticed she was thinner than usual, and four days later had to make the decision.\n\nGood luck with finals. I hope you do well. Tc.",
      "author": "Crochitting",
      "created": 1638381525,
      "upvotes": 4,
      "replies": {
        "hmwifm7": {
          "link": "/r/CollegeRant/comments/r6btpf/if_youre_struggling_its_worth_talking_to_your/hmwifm7/",
          "text": "X2\n\n“College is hard. Grief is even harder.” And both are worse to deal with during this pandemic.\n\nThanks for sharing your story and best of luck to you.",
          "author": "cajunsoul",
          "created": 1638426687,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}