{
  "sid": "qzfm1m",
  "link": "/r/CollegeRant/comments/qzfm1m/tired_and_lost/",
  "title:": "Tired and lost",
  "text": "I (19M) am currently a second year college student (Commuting and living with parents) and I'm completely burned out from the last 2 years. As of now, I'm currently friendless, with no goal or dreams and it seems like I'm living my life on a constant repeat. I barely leave the house, with the only exceptions being work or the gym. Although I have no goal or idea as to what I want to do, I still continue to go to college due to guilt of my mother paying for my tuition. I still do well and don't let these thoughts affect my academics, but I've slowly been pushing towards having suicidal thoughts for the past few months or so. I've told my mother about how I felt (avoided the suicidal aspect), but she essentially ignored my plead for help and I can't seem to find the energy to help myself (Nor do I know how too). I get even more miserable about myself when seeing my siblings go out and about, as they seem to have some sort of goal or friends to keep pushing on. At this point, I play some sort of fictional role of being a goofy happy person, or lie about having friends to cope with feeling empty.",
  "author": "burner3oclock",
  "created": 1637564901,
  "updated": 1637689645,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.86,
  "comments": {
    "hlnwlea": {
      "link": "/r/CollegeRant/comments/qzfm1m/tired_and_lost/hlnwlea/",
      "text": "Hello! I’m in literally the same exact boat and I know to the T how you feel. It’s a dark spot especially when it comes to the whole topic of college I feel like in certain types of family dynamics (I’m assuming here feel free to correct me if I’m wrong) a lot of people will hear you’re in college and instantly think “oh good this kid isn’t going to be a loser” even if you might be incredibly depressed and lonely and drained. Here’s the thing - is a college a good thing? Sure it is. But it stops being a good thing when it starts to drain the life out of you. Everyone goes through burnouts and ruts and I’m currently in one. And it’s awesome you don’t let it affect your academics you’re already a step ahead of most people like myself who do unfortunately let it affect their academics. You’re practically pleading for an out and you’re the key to that. I know it’s hard and may not feel like a good decision cause you’re scared you might fall back or what not. But you should really consider taking a break for however long you need to. Take care of yourself first always because if you don’t you won’t be able to take on all the tasks of life to the best of your ability. The body you’re in right now is all you got in this life time so take care of yourself. That body is your ship and it’s gonna take you everywhere you’re gonna go in life. It’s okay to put yourself first right now despite your mother’s input. This is your education, your well being, and it’s starting to come down to being a threat to your own life if the stress of it all is making you consider taking it. \n\nI want you to know so you don’t feel alone that I’m in the same spot - I’m thinking of taking a break - and yeah my mom is pretty upset and disappointed too but you know what? I think our moms might prefer us alive taking a break rather than dead doing what they wanted us to do. \n\nAs for your siblings, again same spot. I know it’s a hell of a lot easier said than done but try not to compare yourself to them. Whether they’re older or younger they’re your blood and y’all share the same home environment but you’re different people. And who knows? You mentioned you’re good at being the goofy happy person on the outside maybe they’re good at pretending to cope to? Point is - you’re the most important person in your lifetime and you’re the center of your own universe. If you don’t take care of yourself nothing else is going to work the way you want it to. I know it’s hard OP but put yourself first in this situation. You matter a shit ton and losing your life to the stresses and depression of college life isn’t worth it. You’re worth a whole lot more than that and I support you whoever you are. \n\nYou got this!",
      "author": "kindahungryrn08",
      "created": 1637603475,
      "upvotes": 1,
      "replies": {}
    }
  }
}