{
  "sid": "r0unrq",
  "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/",
  "title:": "Community colleges rant",
  "text": "I see so many people say things like \"don't ever go to uni when you could go to community college and save so much money instead of doing everything at uni!\" I used to agree with this, but the longer I've been at uni vs. community college, the less I agree. (I'll be referring to community college as CC from now on as it's a bit of a mouthful. Also long post ahead lol)\n\nFirst thing, I wasted a lot of time, and more importantly money, at CC. I started at my local CC at 17 after getting my GED, I couldn't at that time go directly to a university with only a GED and I was not ready to move out even after turning 18, so CC was a good option. However, you're talking about me, and indecisive 17 year old who didn't think they'd ever be going to college due to poor academic performance/chronic illness, and now I'm in college, and I get \"free\" money from the government every term for sitting in a couple classes every day. It was so cool to me, and I didn't realize until this year that due to this time faffing about in CC, I'm out of direct loans because I wasted like 20,000 worth of them at CC. I got the standard \"be responsible with your loans!!!\" thing but it was in one ear and out the other. Like I said, I was 17 and I got \"free\" money for sitting in a couple classes every day, it was awesome! Not. Another fun tidbit is that my uni's courses are mostly 3 credits while my CC's courses are mostly 4 credits, meaning I didn't even save that much money.\n\nI also didn't ever get my transfer degree either because I needed 9 more elective classes to get it. I also needed to do some other requirements, but I decided to just take my credits I had gotten at that point and leave instead of spending 3 more terms of 3 classes at my CC. Plus, I had a lot of bad instructors at CC. My advisor also was very adamant against me transferring early, I ended up having to just not talk to her my last term because it seemed like she was trying to keep me from going. Why would I stay at CC and take 3 terms of lower division electives instead of transferring and being able to start classes my CC didn't offer that I needed for my desired major, or upper division classes?\n\nAnother thing is this point an instructor at my community college brought up. He told us all in class, \"CC gives you a better education because people with experience are teaching you, not grad students!\" At the time, as an unexperienced 18-ish year old, I remember thinking \"Wow, I can't believe they'd make grad students teach us, they don't know anywhere near as much as professors do!\" until later when I realized most CC instructors have a master's degree and GTAs have... well... also a master's degree. And are usually working towards a PhD. Now that I've been to uni, I can say that the overwhelming majority of my classes have been taught by faculty and not GTAs, so I guess other unis must be better, or the people saying that just pulled it out of nowhere. \n\nMy last point is just how unprofessional a lot of the faculty and staff were at CC. I had instructors who were just straight up bad at teaching, bad at classroom management, or would argue with students who disagreed with them in class. The same instructor who said what I discussed in the above paragraph also made me feel stupid for asking questions many times, and he went through a bit of a political change post-2016 elections and started arguing with people in class. A communications instructor I had would let students have arguments in class, wasting our time while she was supposed to be explaining our speech assignment, and also got into arguments with students. I don't know if this is common in other people's experience, but I've never seen this happen at my uni, I've always had calm discussions in classes even if we disagreed on things. Staff were also openly rude to students at times, especially the financial aid office. As I mentioned before as well, my advisor was openly against me leaving (as if she had a say in me leaving community college), and was rude to me at times for being indecisive about what I want to do with my life.\n\nI know that this might just be my own negative experience, but due to these things I just can't really recommend CC to people. If you just want to go to get a transfer degree or an associates so you have some kind of college experience, then it's fine, but I really wish I could have just gone straight to uni. I would have been able to figure out what I wanted to do with my life and would have been able to take classes required for my major from the beginning instead of transferring over with a bunch of transfer credits and no major credits as a \"sophomore\". My advice if you do want to go to a CC is to know what uni you want to go to, know what your major requirements are, know the course equivalencies between your CC and your desired uni, and just go to take classes that will count towards your uni gen eds and not the nebulous transfer degree requirements, and once you have them done, get to your uni so you can actually start taking major classes. That's just my opinion though, I'm not an advisor or anything but I feel like I can speak from experience.",
  "author": "okeanios",
  "created": 1637722847,
  "updated": 1638207547,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.88,
  "comments": {
    "hlv6b4w": {
      "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hlv6b4w/",
      "text": "Not all CC’s are equal. I went to one in St. Louis. Oh. My. God. The transfer process was such a nightmare I have undiagnosed PTSD from the social destruction, isolation, financial abuse, and near failure of getting into a 4 year. I am now at my university, NOTHING could have prepared me for the business school here. I am severely behind my peers academically and socially. Students my age know how to navigate the system here and have networked their way into dominance hierarchies and internships. People instinctively can tell I am new and treat me differently because of it. I am years behind in school now and have to spend the money I would have saved at CC if the transfer process wasn’t an outright lie. The advantages of starting in your degree program freshman year are astounding. Freshman here are learning accounting principles I am being rigorously tested on as a Junior that my CC did not AT ALL provide. I can’t sleep at night after learning the reality.",
      "author": "Anon_Light622n3",
      "created": 1637730825,
      "upvotes": 5,
      "replies": {
        "hlvd4pz": {
          "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hlvd4pz/",
          "text": "Exactly, this is what people don't talk about with community college. I guess they expect people to go straight to uni for rigorous programs like business, engineering, or sciences, but I know my CC is like \"you can start your engineering degree here and transfer to state uni as a junior!\" and I just don't believe it. The rigor is completely different, no CC has all the same classes as a uni does so you're never going to truly be a sophomore/junior when you transfer due to missing classes, and you're most likely going to miss out on making a connection with your cohort like you said in your comment.",
          "author": "okeanios",
          "created": 1637734927,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlvhfyg": {
      "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hlvhfyg/",
      "text": "lectures at big universities are given by professors anyway, so I don't see the difference. r/college people will insist they want professors over TAs for their intro classes, yet at the same time they say you dont need big university professor to explain calculus. but the reason why they say their classes are al\n\nthe reason why advisors do not like you transferring early is because there is no tracked metric for \"student transferred in less than 2 years,\" it's all rolled under 2 or 3 or 4 or 6 year transfer. So they (the college) don't get extra funding from government for it. Students transferring in 1 semester are effectively the same as 2 years, for federal grant/metrics purposes.",
      "author": "wobbletelescope",
      "created": 1637737801,
      "upvotes": 4,
      "replies": {
        "hlvowda": {
          "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hlvowda/",
          "text": "Oh yeah, I was under the impression that at uni I'd be in a class with 700 people and there would be a TA lecturing to us, compared to the 20-30 people and an instructor at CC. CCs, colleges, and universities really like to emphasize small class sizes, but when it comes down to it, I prefer the huge lectures honestly.\n\nI figured it was something with funding, I just assumed it was them wanting to keep my federal aid going to them.",
          "author": "okeanios",
          "created": 1637743446,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlwwn7t": {
      "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hlwwn7t/",
      "text": "Honestly the type of community college can make or break your academics to an extent. It sounds like yours set you up for failure.\n\nMy community college is in one of those states where if you earned an associates it has this guaranteed transfer of all the credits. I even took organic chemistry 1/2 and both labs and now im a new transfer taking biochem at a local uni with junior standing. My orgo professor had a PH.D in organic chemistry actually and is writing me a recommendation for pharmacy school. Students from other universities took organic chemistry at our school over the summer because their own professors were shit at teaching it.\n\nI think the only downside about my cc is that it doesn't have as much rigor and the professors are looser. So at my university I have to put twice or thrice as much effort to earn the same grades. \n\nI completely agree with your last portion about doing research about which classes to take a transfer so you can do your business efficiently without wasting any money tho. Honestly if my cc wasn't decent I would have been in the exact same situation, especially in this pandemic.",
      "author": "TheRapidTrailblazer",
      "created": 1637769681,
      "upvotes": 2,
      "replies": {
        "hlz40gh": {
          "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hlz40gh/",
          "text": ">Students from other universities took organic chemistry at our school over the summer because their own professors were shit at teaching it.\n\nthis is common, but because those students either want easier grading (less rigor) for professional/grad school (they are incredibly mistaken), or to more easily declare a major at their university. you will find this happening at virtually every community college located near a big university.\n\ni know this because i attended a community college near a big university.",
          "author": "wobbletelescope",
          "created": 1637801972,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlxg9v7": {
      "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hlxg9v7/",
      "text": "I’m currently enrolled in CC. I plan on getting my transfer degree but I’m very fortunate that the universities here in my state offer dual partnership programs. Basically means you apply and take classes at the CC and Uni at the same time and they both work together for getting your credits. So essentially if I had a transfer credit that’s available at CC I can take it at the CC and then also take classes at the Uni at the same time. They don’t offer this at some university’s here but they offer it at the one I plan on going to. After you reach 24 credits out of 80 its recommended to apply so you’re not wasting classes. I just need to build up more of a resume and get those 24 credits before I apply for the program so I have a higher chance of getting in. I feel like they should offer this program at all university’s where the CC and university work together before you transfer completely over to Uni.",
      "author": "hillsorvalleys",
      "created": 1637777399,
      "upvotes": 2,
      "replies": {
        "hm98x1s": {
          "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hm98x1s/",
          "text": "Ya, reading this post makes me realize that maybe I just got crazy, crazy lucky with my CC experience..  We had dual enrollment agreements with at least a dozen 4-years, and other forms of articulation agreements with many other colleges.\n\nNot to mention the opportunities I had for socializing and all the different programs I participated in and got paid for..  Plus, I won at least 4-5 scholarships while I was there.",
          "author": "ThereIsNo14thStreet",
          "created": 1638004005,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlz5kit": {
      "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hlz5kit/",
      "text": "I love my cc",
      "author": "TragicalKingdom",
      "created": 1637802671,
      "upvotes": 2,
      "replies": {}
    },
    "hm4jvy0": {
      "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hm4jvy0/",
      "text": "My CC is based.",
      "author": "seattleinfall",
      "created": 1637906959,
      "upvotes": 2,
      "replies": {}
    },
    "hlvy7vl": {
      "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hlvy7vl/",
      "text": "I've taken 1 year at CC and 1 year at my 4 year.  It's easy to spot the transfers because they're worried about classes and are not getting advisor support because they haven't been here long enough.  While I still love CC it's not very good for networking and getting internship opportunities.  I had Ph.D instructors at CC and 4 year and the 4 year always seem to have industry experience as well.",
      "author": "emmmaleighme",
      "created": 1637751214,
      "upvotes": 1,
      "replies": {}
    },
    "hm990ue": {
      "link": "/r/CollegeRant/comments/r0unrq/community_colleges_rant/hm990ue/",
      "text": "Damn, I'm sorry it worked out that way for you = (\n\nAt least I hope you are flourishing now at your 4-year school.",
      "author": "ThereIsNo14thStreet",
      "created": 1638004096,
      "upvotes": 1,
      "replies": {}
    }
  }
}