{
  "sid": "ptguna",
  "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/",
  "title:": "What is the point of general ed classes????",
  "text": "I know people are going to say they're there so you can become a wElL rOuNdEd PeRsON or whatever, but isn't that what the past 12 years of school was for???? I think that general ed classes are good for people who still aren't 100% sure what they want to do yet and want to keep exploring, but WHY are they required for everyone regardless of their major???\n\nI am a music performance major. I am 100% sure I will not change my mind on going into a music career. I've known for years that this is what I want to do and I do not see myself doing anything else. So WHY do I need to take algebra or history to get my MUSIC degree???? I feel like I'm not really learning anything in those classes tbh, rather just going through the motions to pass them so I can, you know, graduate in time.\n\nSo far the three general ed courses I've taken are algebra, writing, and US history. I did manage to pass these classes, but that's not really the point. It's that I feel like these are just wasted energy that could go towards my major instead. Last year when I took algebra, I remember spending HOURS doing the homework on ConnectMath, only to end up with a low score. And I'm not even bad at math. I've done well in math in the past. The class was just very difficult. Why did I need to spend that amount of time and energy into a class that had nothing to do with my major whatsoever???? When all that time could've gone towards practicing orchestra music or my jury repertoire???? But nooo, I HAD to study for that algebra test because I HAD to take the class in case all that stress would make me love it so much that I'd want to switch my major to it. (I don't hate math, by the way, I actually like it when it's not so stressful, just not so much that I want to major in it.)\n\nAnd my writing class, that's another class that required too much of my time. (I also have to take another semester of it sometime in the next 2 1/2 years because I'm required to take it for 2 semesters, yayyy 🙃) We had 5 papers assigned to us throughout the semester. I drained so much of my energy on each one. Why the heck do I have to know APA or MLA format or whatever???? When is this ever going to be important for my future career in performance????\n\nAnd let me rant about US history. No matter what, I cannot get interested in history. I know history majors are probably going to downvote for me for this, but it's just personally not my cup of tea. And it never has been. Even if I wasn't 100% sure I'd stay in music, I know that I'd never go into history. It's just not my thing. Yet, I NEED to take that class in order to graduate. I feel like I spent way too much time and energy on each of the assignments (they each took a couple hours on average) but I had to because that's the only way I could pass. And frankly I'm not here to do history, I'm here to do music.\n\nI know the reasons for these classes is to expand our horizons, but why require them??? Honestly, taking a class that has nothing to do with my major just because I have to will only make me more apathetic to it. I feel like these classes should be available to anyone who wants to take it out of interest, or to explore ideas of what they want to do. I shouldn't HAVE to take a US history class to graduate with a degree in something that has zilch to do with history whatsoever.\n\nTL;DR: General ed courses are in my opinion a waste of time and energy that could instead go into honing my craft and focusing on my major.",
  "author": "DanielaThePialinist",
  "created": 1632348064,
  "over_18": false,
  "upvotes": 108,
  "upvote_ratio": 0.8,
  "comments": {
    "heia1cf": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/heia1cf/",
      "text": "Gen ed classes are there to milk you for more cash, as colleges are businesses. College English won't teach you anything that you didn't already fucking know from 4 years of highschool English classes. \n\nThe people saying that general education classes have a purpose have fallen for the trap, and that's most college students unfortunately. It doesn't help to be bitter and angry about how fucked up college is, but I can't help it.",
      "author": "Fuck-College",
      "created": 1632771562,
      "upvotes": 1,
      "replies": {}
    },
    "hef5uap": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hef5uap/",
      "text": "I definitely feel the same way from time to time but something I realized is that a *lot* of people don't get a career in the same field they majored in. So, if nothing else, gen ed classes might help prepare you for other potential career paths.\n\nDoesn't make them feel like less of a waste of time, but hey, at least we're learning. If only college wasn't so expensive.",
      "author": "subversiveradiohost",
      "created": 1632706196,
      "upvotes": 1,
      "replies": {}
    },
    "he5pb9c": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/he5pb9c/",
      "text": "Writing courses teach you to think critically, analytically, and to express yourself clearly. You will ostensibly need to do this for the rest of your life if you want to apply for jobs, communicate effectively with others, and be able to, as I stated, think critically. If those aren’t goals for you, then 🤷‍♀️",
      "author": "luckystrike131",
      "created": 1632528423,
      "upvotes": 1,
      "replies": {}
    },
    "he1iw0w": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/he1iw0w/",
      "text": "It’s a *hard* pill to swallow, but the vast majority of music majors (I’m a junior composition major at a pseudo-conservatory who’s going to pursue a masters’ in a separate field so I have vaguely steady income) aren’t going to have any semblance of a successful career in music. The field is so oversaturated with extremely skilled musicians to the point that traditional jobs requiring specialization (orchestral career, chamber musician, soloist) are effectively impossible to acquire. If you aren’t capable of basic communication and arithmetic - two things VITAL for a freelancer - then career prospects are even more grim. You’ve got to have more than just “play music good” under your belt for successful networking. \n\nIf high schools weren’t so bad at successfully educating their students, then I could understand the desire for specialization. Unfortunately, a significant amount of undergrad students aren’t even able to write basic essay or perform even the most simple of critical thought.\n\nGen eds are also a respite from the constant bombardment of classical music that gets thrown at a typical BM. Each semester, I’m usually in 6-7 classes and 5-6 ensembles; there absolutely needed to be moments throughout the week when I could focus on something other than those things - otherwise, burnout or injury would be imminent.",
      "author": "dsch_bach",
      "created": 1632449627,
      "upvotes": 1,
      "replies": {}
    },
    "he025kr": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/he025kr/",
      "text": "I was a comp sci major and hated some of my gen eds but loved a lot of others. It's definitely to make you more well rounded but I think also to help give you a little break from your more difficult major classes. The gen ed teachers that made their classes low effort were my favorite, I still learned a lot but wasn't wasting time on an assignment that might not help me in the future.",
      "author": "tuna634",
      "created": 1632425394,
      "upvotes": 1,
      "replies": {}
    },
    "hdzm60u": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzm60u/",
      "text": "I was told it's to make sure you have the skills you need to do all of the things in your career that aren't directly related to your major. For example, you're probably going to have to write something during your career, whether it's a cover letter, or one of those weird little blurbs that go in the back of a score that tell you how much the composer loves their dogs, or letters to clients asking for payment, or small claims court, etc etc",
      "author": "BecomingCass",
      "created": 1632418745,
      "upvotes": 1,
      "replies": {}
    },
    "hdzgv8o": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzgv8o/",
      "text": "To make you a well rounded student. Or in other words, to pay more tuition money. \n\nI know a lot of people like their gen eds but not everyone does. Some people are busy or just don’t care for it. If you are interested in learning something then great, go sign on to take those classes, but I don’t think forcing them on students who don’t want to does any good. Another thing about them is that I would say they have prevented a lot of students from going to college because they do not have the time or money, which to me is a shame.",
      "author": "115machine",
      "created": 1632416574,
      "upvotes": 3,
      "replies": {}
    },
    "hdzfkh3": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzfkh3/",
      "text": "In theory it makes sense but in practice not so much",
      "author": "More_Coffees",
      "created": 1632416048,
      "upvotes": 1,
      "replies": {}
    },
    "hdzengb": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzengb/",
      "text": "Hey friend, I'm a music major too.  I TOTALLY GET IT.  I hated gen eds.  I took three humanities classes (musicology, sociology, and archaeology) and three English/speech classes.  I had general psychology, political science, computer science, and ensemble from community college.\n\nI also work on campus with incoming freshmen.  These general education classes are often required by public institutions so that they can secure federal (and state?) funding.  I attend a state school and I know that's why we require it.  The state's constitution states (haha) that every college student attending a public institution must have a class on either the US or state constitution.  That's why we're required to take history classes (I took poli sci).  \n\nThat said, I understand.  It is so frustrating!",
      "author": "distressed_amygdala",
      "created": 1632415679,
      "upvotes": 2,
      "replies": {}
    },
    "hdyvxpu": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdyvxpu/",
      "text": "Gen Ed courses are extremely important. The purpose of college is to give you a wider outlook on life and give you an education. I want to say that probably the most important general education classes are your mathematics and writing classes. They are intense because they need to be. You need the rigorous background for not only the subject matter that will help you in future classes and life in general, but for the experience they give you in taking difficult classes. \n\nIn the algebra class I teach, many of the problems are taken from real-world scenarios like which phone plan should you choose to save money and how much materials do you need to buy in order to properly complete some sort of common project. It’s really, really important for students to know these things for the real world and if it’s their only math class, it has to cover many things to prepare them for basically any major. Yes, you will use mathematics in music (I used to be a musician too.) not only actually playing music but in the background of things (sorting out bills, budgeting, etc.)\n\nYou might think that K12 prepares you for this, and assuming you’re from the US (given by US History), you are sadly mistaken. It’s lucky that your K12 experience prepared you for the collegiate level but we vastly underfund our K12 schools and overwork our amazing K12 teachers. It’s to the point that many, many students were not given the privilege of being prepared to study at the university level. These Gen Ed classes not only help them get a bit up to speed but also truly give them an environment where they can decide what they want to pursue. It’s very helpful for them.\n\nFinally, I wanted to say that if you are in your first or second year, you most likely will change your major. Statistically, most students change their major I think it was 3-4 times before sticking with one? I know I had changed my major 2 times in undergrad before landing on mathematics and most of my friends ended up doing something way different than they thought they would. It’s extremely important to be exposed to tons of different subjects at specifically the university level to *really* understand what they are about. \n\nI hope this helps and good luck on your university journey!",
      "author": "lesbianpearls",
      "created": 1632407836,
      "upvotes": 3,
      "replies": {}
    },
    "hdyo3q7": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdyo3q7/",
      "text": "If I wasn’t taking Gen Ed I’d still be sad in Psycholohy. Some college grad plans suck and include useless requirements and Gen Ed’s for majors but I have not experienced that. All my Gen Ed’s were relevant to my learning.",
      "author": "Visual-Hold233",
      "created": 1632404397,
      "upvotes": 1,
      "replies": {}
    },
    "hdy1hwo": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdy1hwo/",
      "text": "Truth is that college today is more like what high school used to be 60 years ago. Once upon a time you would have been able to get a decent low level job with just a hs diploma and enter the middle class with the ability to maintain a small house and family. That is no longe",
      "author": "nopenonahno",
      "created": 1632389892,
      "upvotes": 1,
      "replies": {}
    },
    "hdxu5s7": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxu5s7/",
      "text": "I’m a school teacher.  I could have started on the path to that field with _any_ undergraduate degree.  \n\nA bachelors degree implies a major in a particular field but also college level course work across a broad range of disciplines.   \n\nIf you only want to study a particular field, you can do that with an apprenticeship, by finding a mentor, by embarking on your own course of study.  But that’s not a BA.\n\nI don’t know that much about music, but I’m sure many people practice music without getting a degree.",
      "author": "jdith123",
      "created": 1632382998,
      "upvotes": 4,
      "replies": {}
    },
    "hdxt0pw": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxt0pw/",
      "text": "Various reasons...\n\nIf you are aiming for specific degree like nursing you need to have basics understanding of anatomy, biology etc to progress further in the career. \nLike for you and music degree you might wanna learn physics to understand how waves and sound work so you can perform better and create better. \n\nLike someone else said, HS is really the basics. College is a higher level of the basics. More in-depth knowledge. This is to ensure also that you are on the same level Like everyone else. HS was easy, many people graduate without barely doing much. In college nobody hold your hand and you will have consequences if you don't do something - this is to prepare you as a good employee (most people i worked with who only finished HS were not as reliable as those who had college level education). \n\nCollege if for people who want to learn. Who choose that they wanna learn specific stuff. For adults not whining babies who cry over the fact that they have to do homework. College is informed decision. \n\nIf you really do not want to do GED I recommend you find a trade school and that way you will mostly learn what is needed for the trade.",
      "author": "Professional_Mine2",
      "created": 1632381977,
      "upvotes": 1,
      "replies": {}
    },
    "hdxm1uq": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxm1uq/",
      "text": "Yes!!! Honestly yes! \n\nI feel like those gen Ed classes should just be an option. \n\nFor example, I like Art and photography, but I don’t want major in that (I have my major already) and I’d rather take those classes just for fun, to get a break from my own classes associated with my major. \n\nBut I’m really annoyed that I have to take a language course for at least 2 years (I think) even though it has nothing to do with my major and I’d rather learn a language on my own time. \n\nI have no time for that.",
      "author": "DumbHuman53",
      "created": 1632376381,
      "upvotes": 2,
      "replies": {}
    },
    "hdxk8kc": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxk8kc/",
      "text": "The point is nothing more than to get more money by making students pay for more classes. I’m a Music Ed major and at my school I had to take “enjoyment of music” as my music gen ed. I’m majoring in it, I have to enjoy it!! There’s no reason to make me take that class other than to get more money out of me. I’m just glad I only have a lit class left to take and then I’m just left with my music and education classes",
      "author": "kviiiie",
      "created": 1632375065,
      "upvotes": 1,
      "replies": {}
    },
    "hdxiflh": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxiflh/",
      "text": "The Gen Ed requirements def get annoying at times but in my opinion it helps break up the hard stuff. When I want a mental break or go on auto pilot for a little while doing my computer applications( PowerPoint, Word, etc) stuff sounds much better than calc 1 homework. They also help with cushion the gpa a bit.",
      "author": "Initial-Worry-2291",
      "created": 1632373799,
      "upvotes": 4,
      "replies": {}
    },
    "hdxh4bh": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxh4bh/",
      "text": "i wish that grade school (especially highschool) classes were actually worth a damn so when we get to college we dont have to spend more time relearning the same stuff we learned the first 18 years of our lives over and over again.\n\ni dislike gen eds, they can be tedious at times but they’re usually easy which  i desperately need to boost my gpa cause my eligibility to keep one of my scholarships is slowly slipping off a cliff rn \n\ni personally think they exist to get as much money as possible out of you, but “to create well rounded students” sounds better lol",
      "author": "RainbowChocolate_",
      "created": 1632372913,
      "upvotes": 5,
      "replies": {}
    },
    "hdxh351": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxh351/",
      "text": "algebra - every adult does finances. compound interest and annuities automatically come to mind which can get tricky to keep track of. of course, we have computers to evaluate this shit for us but knowing the underlying principles goes a long way.\n\nhistory - pretty relevant if you plan on participating in US politics. also more people knowing history increases the chances we don't get another era of slavery or another trail of tears, red scare, Japanese concentration camps, watergate bullshit, etc. like take China for example. I bet a lot of people there dont know about US history. Watching the shit that's happening to the Uighurs, Tibetans, Mongolians, etc. right now is like watching the recent anime adaptation of the native americans saga in the US history book manga. Han Chinese people are like the new white people.\n\nenglish - well as much as I hated writing those essays, creative writing goes a long way in expressing yourself. Like maybe if I took the time right now, I can use my creative writing skills from college to give you a vividly detailed short childrens story of how spongebob clapped sandys thick furry cheeks with his porous yellow vascular cock glazed with gary's viscous slime. Now isnt it quite handy to express yourself like so? Communication is important in a healthy relationship.",
      "author": "lguy4",
      "created": 1632372892,
      "upvotes": 1,
      "replies": {}
    },
    "hdxe047": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxe047/",
      "text": "To get funding to departments who would not be able to attract students without GE classes.\n\nAt my campus, every department gets to have a GE course because \"it's not fair!\" when one department gets guaranteed enrollment and others don't. It's about the money.",
      "author": "TheJaycobA",
      "created": 1632370927,
      "upvotes": 2,
      "replies": {}
    },
    "hdxcy22": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxcy22/",
      "text": "I think some schools take it too far (why do I need THREE natural science courses???), but I can see some benefit to it within reason. You’re likely going to need a basic understanding of math and how to write well just to be an adult living in society. Classes like science and history give you a basic understanding of the world around you and how to think critically about it.",
      "author": "miscellaneousbean",
      "created": 1632370288,
      "upvotes": 2,
      "replies": {
        "hdxd2uv": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxd2uv/",
          "text": "I understand that we need a basic level of understanding, but again that’s what the last 12 years of school was for.",
          "author": "DanielaThePialinist",
          "created": 1632370369,
          "upvotes": 1,
          "replies": {
            "hdxls9f": {
              "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxls9f/",
              "text": "> I understand that we need a basic level of understanding, but again that’s what the last 12 years of school was for.\n\nHonestly, if you think that a high school education provided an adequate level of general education, then I think that's far more of an indictment of your base of general knowledge rather than an indictment of the gen ed requirements at your university.",
              "author": "BarackTrudeau",
              "created": 1632376185,
              "upvotes": 7,
              "replies": {}
            },
            "hdygdw3": {
              "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdygdw3/",
              "text": "Yeah when I got to college I had plenty of peers who were simply not prepared at all. Didn’t know how to write solid essays, etc. Not everyone goes to an amazing high school.",
              "author": "miscellaneousbean",
              "created": 1632400526,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hdx972v": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx972v/",
      "text": "[deleted]",
      "author": null,
      "created": 1632368163,
      "upvotes": 7,
      "replies": {
        "hdxmeor": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxmeor/",
          "text": "It would be more understandable if my college gen eds went more in depth than my high school classes did. But the only classes I learned something in were ones that I hadn’t already taken in high school. History, biology, and English didn’t teach me anything I didn’t already learn in high school. I’d argue that I’d function just fine with my high school education and what I’m learning from the classes specific to my major in college.",
          "author": "kviiiie",
          "created": 1632376652,
          "upvotes": 4,
          "replies": {
            "hdxx7p2": {
              "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxx7p2/",
              "text": "Thing is, a lot of people don't learn them in highschool. I teach college composition, among other humanities. Many freshman don't have basic writing skills, and if I make the class too challenging, those students are left behind because they never learned it the first time. Plus, no one reads and few people are comfortable with argumentation, so making a writing course more challenging turns out to be difficult. There's a remedial element sure, because colleges want know that students have at least the basic skill set.",
              "author": "carmencita23",
              "created": 1632385843,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hdx8iry": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx8iry/",
      "text": "I think general Ed classes are good because they give people who want to switch their major a good chance to do so. Limits the amount of excess classes you’d have to take.",
      "author": "ntrecker",
      "created": 1632367800,
      "upvotes": 3,
      "replies": {}
    },
    "hdx8aud": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx8aud/",
      "text": "My partner is a Doctor of Music and Symphony cellist, all of her degrees in music performance. She runs a youth orchestra and teaches Suzuki to make ends meet. \n\nI would say she is preforming...5% of her time? And from my understanding, that lifestyle is pretty common for gigging musicians. \n\nGen Ed's also expose you to different faculty, students, paradigms, and ways of thinking. \n\nIt gets you out of the echo chamber of your niche field. \n\nIf you want to learn a specific skill with no \"irrelevant material\", learn a trade. General education courses have always been around and are a foundational component of higher education. \n\nGo back and re-read the classic philosophers and see what they say about exposing yourself to new people and ideas.",
      "author": "middledeck",
      "created": 1632367684,
      "upvotes": 33,
      "replies": {}
    },
    "hdx7ycx": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx7ycx/",
      "text": "See it as it reminds you that you are not the only person in the world. Remember a better educated society is a better society as a whole",
      "author": "itz-Y33ZY",
      "created": 1632367495,
      "upvotes": 15,
      "replies": {}
    },
    "hdx6rob": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx6rob/",
      "text": "No offense: but the statistics say that you are not going to make a career out of performing music for money.\nColleges and universities force fine arts students/actors/dancers/and musicians to take general studies so that they can ultimately function in the real world while trying to land \"gigs.\"",
      "author": "katCEO",
      "created": 1632366860,
      "upvotes": 0,
      "replies": {}
    },
    "hdx33um": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx33um/",
      "text": "Hey OP, former graduated performance music major here. Your points are all valid. And the frustration is real with how much time general ed classes take away from focusing on practicing and being a music major, especially performance. There are simply not enough hours in a day to do it all at times. Rant about it, get the frustration out! \n\nHere’s some helpful hints:\n\nThe writing classes, and all the writing do will have practical applications. You will have to learn APA or MLA for later classes, and while it’s a pain yo write so many papers now, hopefully it will make the process easier when you have to write papers for your music classes you care about. \n\nHistory — got nothing other than it’s a class to help practice time management. \n\nMath — same as above.\n\nAs for all these classes, if you ever plan to go yo grad school for a another or different degree, these general es courses will help count toward meeting qualifications.\n\nThe tough thing about these courses, no one can make you like them. They exist just to check some boxes, and as a result, are not always inspiring for students. But, as a performance major, use these classes as practice for the real world, where you will have to balance music with some other job, other life demands, etc. that’s the best I got for you. Keep ranting when you need to. The good news is the gen Ed classes do end, so hang in there.",
      "author": "acapro21",
      "created": 1632364952,
      "upvotes": 3,
      "replies": {}
    },
    "hdx1k6x": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx1k6x/",
      "text": "Right?? I'm a senior now, but I spent my 2 first years wondering the same. I have always known that I wanted to be a bio major. I really love science and can't see myself doing anything else.\nAnd still had to go through those unnecessary classes (for my major at least) like drama, music, US history, journalism, literature, etc.....\nJust a way to get our money, that's what it is. Two years of my life that I wish I had spent taking more bio classes instead of those classes that I know I'll never use and only took because I had too lol what a jk",
      "author": "WilieFern",
      "created": 1632364168,
      "upvotes": 1,
      "replies": {}
    },
    "hdwydzm": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwydzm/",
      "text": "I might get a little hate on this one. I liked my gen-ed classes. I'm an engineering major and honestly, it was nice to take a break from heavy STEM stuff and do something else. I took Spanish and Dance because well, I like them both but not enough to major in them. They also help me increase my GPA. English was a pain in the ass but I also realized the high school English classes were b\\*llshit (unless you took AP), a lot of people in my class didn't know jack-sh\\*t about writing a proper article and some even don't have basic grammar nor formatting down. \n\nI get what you're saying. I feel the same with some economics classes I was required to take. I didn't understand why I had to take them. Oftentimes, it is and was a waste of time. There were moments I wished I could've spent more time in my major-related workload than memorize different types of dances or how to tell the time in Spanish. I'd still rather do Math than write another journal about a book I barely read. They make good stories tho and it was nice to meet other people from other majors.",
      "author": "throwaway_122919",
      "created": 1632362600,
      "upvotes": 91,
      "replies": {
        "hdx5p3x": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx5p3x/",
          "text": "I’m an engineering major and felt the same way! Loved my humanities, english, and my art history class.",
          "author": "ttyltyler",
          "created": 1632366298,
          "upvotes": 28,
          "replies": {
            "hdyp1fl": {
              "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdyp1fl/",
              "text": "As a physics major, the best class I ever took was introduction to philosophy. It taught me how to think logically, which helped enormously in every other class.",
              "author": "Aler123",
              "created": 1632404826,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hdx80vm": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx80vm/",
          "text": "Same. And for the same reasons. I do feel a lot more well-rounded as well.",
          "author": "unholymanserpent",
          "created": 1632367532,
          "upvotes": 10,
          "replies": {}
        },
        "hdzfjuf": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzfjuf/",
          "text": "I was a chemistry major. Gen ed classes were a chance to take a break for the hard stuff and maybe learn something fun on the way. Took classes in subjects I knew little about like Native American Religions and Women's literature.",
          "author": "hdorsettcase",
          "created": 1632416041,
          "upvotes": 3,
          "replies": {
            "hdzi0k0": {
              "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzi0k0/",
              "text": "I feel like STEM majors in general like their gen-ed classes because we see it as a break from all the in-major classes that we all have to do. They're also some things we like or find interesting but not enough to build a career in. I feel like art majors (or just my brother and best friend) see gen-ed as a waste of time because well, they are in a sense, especially if you finally escape Math, any science class, or English classes from high school. Engineering majors at least prefer most of those classes (except English, I do like writing but nope). \n\nI am a little confused tho. I was able to choose my gen-ed classes (we're given a category and we can choose whatever within it). English is a required course for all freshmen. Economics is also a required course for Mechanical Engineering, but other than that- I chose the rest. (I also got to avoid taking history classes because of AP credits but if I didn't have that, I'd grab a history class about the mafia or vampires (my friends did)).",
              "author": "throwaway_122919",
              "created": 1632417042,
              "upvotes": 1,
              "replies": {
                "hdzlxic": {
                  "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzlxic/",
                  "text": "My program had very structured electives requirements. For example you had to earn 9 credits in English including a 100, 200, and 300 class, so basically 3 3 hour courses. Exactly what those courses were was up to the student. As you got higher up the catalogue classes became smaller and more diverse. There were only one or two 100 level courses so they were almost always 100 person or more. There were tons of 300 Level courses with only around 10-20 people in class.",
                  "author": "hdorsettcase",
                  "created": 1632418650,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hdz09xz": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdz09xz/",
          "text": "Yeah I get that and it could just be where people's interests lie. I am a studio art major and am not a fan of taking my GURs. I've enjoyed exploring more of the humanities, like philosophy, music, and theatre. But as someone with a learning disability and just straight up struggles with school and the education system I've almost lost my ability to do what came to school for. I've nearly gotten kicked out because I struggle with taking GURs. But yeah it is nice to shake up classes, I couldn't just do just art classes all the time, but still I wish they were more forgiving when it comes to their university requirements. \nAlso the feeling that is less of them wanting us to more \"well-rounded\" and more they just want to hold us longer and steal them monies.",
          "author": "mddanielsmith",
          "created": 1632409680,
          "upvotes": 2,
          "replies": {}
        },
        "hdzmc5g": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzmc5g/",
          "text": "At my school CS students don't really have a good humanities/ethics foundation, and our diversity requirements were terrible, so I used my gen eds and extra space in my schedule to make my own",
          "author": "BecomingCass",
          "created": 1632418814,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdwu915": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwu915/",
      "text": "The point of gen ed classes is to make sure that students are well rounded at a college level. Highschool was a joke. Most of us made it through just showing up to class and barely cracked a textbook. College requires a higher level of effort.\n\nColleges want to ensure that when they give you your degree as a stamp of approval, you are at the same level as all other college students. It means along with mastering your specific field in upper level courses, they want to make sure that you have basic lower level critical thinking, reading, writing, math, and science skills over a broad variety of subjects. Employers and grad school programs count on that as well. Otherwise you just study music on your own with private instructors, online courses, and it would mean the same thing. You could be just as great a musician. But if you want the degree, you have to do the basic work a degree requires.",
      "author": "acrylicvigilante_",
      "created": 1632360606,
      "upvotes": 71,
      "replies": {
        "hdxy71o": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxy71o/",
          "text": "Unless you play sports at a big university lol",
          "author": "hottytoddy_sko",
          "created": 1632386777,
          "upvotes": 1,
          "replies": {
            "hdz40wo": {
              "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdz40wo/",
              "text": "Yeah because in that case the university is milking you for everything they can for the few good years you have. You're a pawn, financially and political for them wrapped in the illusion of free education. But you're not being paid for school, you're being paid to work. If you're not a star player who \"makes it\" they toss you out. I really don't envy university players.",
              "author": "acrylicvigilante_",
              "created": 1632411259,
              "upvotes": 3,
              "replies": {
                "hdzjyt4": {
                  "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzjyt4/",
                  "text": "I don’t either, I was just saying they don’t really have to do much work academically to get a degree. \n\nAlthough, a free education isn’t anything to scoff at. If football doesn’t work out they still have a diploma, which a lot of them wouldn’t have been able to get without sports",
                  "author": "hottytoddy_sko",
                  "created": 1632417846,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hdwqpcd": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwqpcd/",
      "text": "Gen Ed classes are there to weed out people who shouldn’t be in college in the first place. \n\nIn other times you would have joined a big band and earned a living wage. Now days you’ll be $60,000 in debt wondering how you got into a teaching profession.",
      "author": "L4dyGr4y",
      "created": 1632358906,
      "upvotes": 10,
      "replies": {}
    },
    "hdwjqv3": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwjqv3/",
      "text": "I couldn't fucking tell you. Seems like a way to artificially waste your god damn time on stupid dogshit stuff like narrative essays about \"important events from your childhood or past\" like I'm remotely comfortable with that. I can't remember what I had to eat for lunch yesterday, let alone a positive experience from my childhood.\n\n4 classes and not a single one of them doesn't feel like a HS class that nobody is paying attention in. Fuck them I'm not applying come next semester. What a load of crap.\n\nAnd they wonder why their enrolment rates haven't bounced back LOL",
      "author": "Ratmole13",
      "created": 1632355586,
      "upvotes": 16,
      "replies": {
        "hdzbrs4": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzbrs4/",
          "text": "You hit the nail on the head. That is exactly what it is- stupid shit to waste your time. Now granted some classes like freshman comp are useful, but everything else not related to your major is a waste of time and money. The American higher education system is a shitshow- who's only goal is to squeeze money out. So, only take what's necessary for your major and get out as soon as possible.",
          "author": "Rich-Cryptographer-7",
          "created": 1632414497,
          "upvotes": 2,
          "replies": {}
        },
        "hdy0lhv": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdy0lhv/",
          "text": "Someone so angry shouldn’t be posting online about guns. Reported.",
          "author": "snoboy8999",
          "created": 1632389060,
          "upvotes": 0,
          "replies": {
            "hdzfk7s": {
              "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdzfk7s/",
              "text": "Yep I’m just a terrible totally awffulllll person!\n\nI’m slightly annoyed by my college’s policies rn and vented, the fact that it bothers you enough to be a condescending ass and rip on other peoples hobbies while injecting your lazy preconceived notions is annoying and rude.\n\nYou come into this subreddit and leave bitchy condescending comments directed towards others all the time, actually that seems to be all you do on any subreddit.",
              "author": "Ratmole13",
              "created": 1632416045,
              "upvotes": 0,
              "replies": {
                "he5chng": {
                  "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/he5chng/",
                  "text": "I’m not worried about your opinion. You seem to be pressed about mine though. 😂",
                  "author": "snoboy8999",
                  "created": 1632522595,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hdwgc25": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwgc25/",
      "text": "It’s mostly to steal your money",
      "author": "Frenchdu",
      "created": 1632353960,
      "upvotes": 11,
      "replies": {}
    },
    "hdwgbnz": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwgbnz/",
      "text": "As a music performance major, theres more to music than just playing it I would think? One would assume might want to be able to write music; music theory involves math. Want to find a room to play in where it sounds good? Hope you can do some physics, because thats involved.\n\nWant music to mean something to people? Theres usually some kind of history involved that people connect to beyond \"I thought it sounded good\".\n\nIf you don't understand why those gen ed classes are relevant to your major, go talk to your music faculty.",
      "author": "SuyenVo",
      "created": 1632353955,
      "upvotes": 32,
      "replies": {
        "hdxlf3y": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxlf3y/",
          "text": "None of what you said lines you with mine or any other music major’s experience that I’ve heard. You’re never going to need algebra for music theory. To find the best room to practice or perform in I’m going to sing in it and decide if it sounds good, not do some kind of physics calculation. Also, relearning what happened during the revolutionary war doesn’t do anything for me, so my history class was useless to my major. If I want people to connect music to a specific event I’ll do my own research that doesn’t involve uninspired class discussion boards written by hungover freshmen. I only have one gen ed course left to take and not once have I used the information I learned in those classes in my music career.\n\nEdit: didnt register that you weren’t calling yourself a music major, oops",
          "author": "kviiiie",
          "created": 1632375915,
          "upvotes": 4,
          "replies": {}
        },
        "hdwkqu9": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwkqu9/",
          "text": "[deleted]",
          "author": null,
          "created": 1632356067,
          "upvotes": 2,
          "replies": {
            "hdwpjis": {
              "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwpjis/",
              "text": "I'm sorry, you're an aspiring philosophy professor who can't understand the general applicability of gen ed classes? You might want to do some soul searching; philosophy classes make enrollment in part because they are gen ed.\n\nBeyond that, your arguments as so narrow and persumptuous. Example, all art (music included) is political or historical by nature. It is a story. Just because you don't learn it in a music history class dosn't mean it does not exist. In fact, a music major limiting their scope of knowledge to only music history is an injustice to literally every story and culture that professor could not cover in a 15 week course.\n\nYes, there are professionals who can make sure a room is speced right for sound. Better hope you can trust them though if you have zero understanding of how their field works. That kind of ignorance is just waiting to be scammed.\n\nAlso, limiting your knowledge to a simple mathmatical formula is disabling your ability to think critically and solve problems for yourself the moment reality throws a situation your way you wren't given a formula for.\n\nCan one pass muster by taking only courses for their major? Sure. Will that be what helps them become a master at what they do? Not at all. To do that you need to be able to adapt, which requires experiece in multiple disciplines.",
              "author": "SuyenVo",
              "created": 1632358349,
              "upvotes": 24,
              "replies": {
                "hdxxeuz": {
                  "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxxeuz/",
                  "text": "Yeah, gen ed keeps a lot of philosophy departments afloat. If you as an aspiring professor want a job, better hope that philosophy and critical thinking stay in the curriculum.",
                  "author": "carmencita23",
                  "created": 1632386033,
                  "upvotes": 9,
                  "replies": {}
                },
                "hdwqo13": {
                  "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwqo13/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1632358888,
                  "upvotes": -1,
                  "replies": {
                    "hdwtwhx": {
                      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwtwhx/",
                      "text": "GEs are here to broaden your mind and introduce you to new things. They help students develop a multitude of skills and knowledge so they are ready and prepared to enter society with more wisdom and ability to contribute, influence, and better our communities. They help facilitate critical thinking and understanding of the world and how it and others in it operate. \n\nThat is the difference between a trade school and college. College is more then learning about the one subject you are majoring/interested in as it is giving you the tool kit for life and living in a society, not just your job. Trade school is there to gain the skill and experience of one particular talent/skill someone has. It's to prepare you to do that one job. \n\nAdditionally, GEs are a good way for new students to learn what they want to major in. Many students enter college not knowing what they want to do or what major they wanted. It was thanks to GEs that I discovered my interest in Communication. \n\nPlus, GEs allow you to learn, period. College is a place for learning. Why not learn more!\n\nEdit: spelling, grammer",
                      "author": "CommStu_5959",
                      "created": 1632360436,
                      "upvotes": 7,
                      "replies": {
                        "hdx09zc": {
                          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx09zc/",
                          "text": "I will upvote your comment because I agree - I never said GE's don't help people grow. I clearly agree that college is for learning. But like I've repeatedly said - \"if GE's weren't graded (or only based on participation) that would make the most sense. People stressing out about GE's is ridiculous because it's just supposed to supplement one's actual interest...\"  \nI would go so far to say that forcing these GE's (graded of course) causes a lot of **resentment** towards the course subjects.",
                          "author": "Different-Stress6041",
                          "created": 1632363527,
                          "upvotes": 4,
                          "replies": {
                            "hdx1xos": {
                              "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx1xos/",
                              "text": "You have a point here. So I don't totally disagree with you. However, based off if my personal experience most students want the easiest quickest way to a degree. Making GEs just participation means that many if not most will likely not take it seriously and therefore would make them pointless and a waste of time, not to mention defeats the purpose completely. I feel like there could be a way to let it not affect you overall GPA and that would be beneficial and help lower the stress. However, it would likely come at a cost, maybe it means more work (assignments) in the end to ensure adequate deserving participation credit. Nothing in life is free or easy and college is no exception by design as it is there to set you up for lifes shenanigans.",
                              "author": "CommStu_5959",
                              "created": 1632364361,
                              "upvotes": 4,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hdwv18x": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwv18x/",
          "text": "OP here. The only math involved in music theory is knowing Roman numerals 1 through 7  (because that’s how we label chords). And I guess math is used when subdividing notes, but that’s really nothing more than basic division.",
          "author": "DanielaThePialinist",
          "created": 1632360983,
          "upvotes": -9,
          "replies": {
            "hdx6e73": {
              "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdx6e73/",
              "text": "This is absolutely incorrect.",
              "author": "renebeca",
              "created": 1632366663,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hdwdxfv": {
      "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdwdxfv/",
      "text": "i think it’s a money grab. why only pay for 2 years of schooling when they can make you pay for 4 ?",
      "author": "crazyhow",
      "created": 1632352807,
      "upvotes": 18,
      "replies": {
        "hdxe9d1": {
          "link": "/r/CollegeRant/comments/ptguna/what_is_the_point_of_general_ed_classes/hdxe9d1/",
          "text": "Close. It's not about the number of years, it's about the number of classes. The math department gets funding based on the headcount of its classes. Same for the communications department, same for history department. etc. \n\nThose departments need to guarantee they'll have thousands of students so they can get more money, so they make their class mandatory for everyone. You could take all the GE in one semester if you had no life, the school wouldn't care just so long as you enroll in the \"correct\" classes.",
          "author": "TheJaycobA",
          "created": 1632371084,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634063891
}