{
  "sid": "omdgo6",
  "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/",
  "title:": "Online classes make me want to light myself on fire.",
  "text": "I pay money to listen to experts on a topic explain things to me. I then get those explanations and use them to help my own studying until I can create my own unique ideas about a topic.\n\nWhy is this so hard to do? Why does every institution seem to think that some text on a screen equates to a proper lecture with adequate professor-student interaction? I cannot learn this way. If I could teach myself these things, I wouldn't be in college. I would just get textbook PDFs and study all day. So why the hell do these people think its ok to effectively throw textbooks at me and expect me to learn?\n\nFuck this. Fuck online education. The most infuriating thing I have ever experienced is having to email some professor that doesn't even live in my state to help with an assignment, only for them to respond days later. I'm sure the professors hate this too. This is lazy education, plain and simple. The minor benefits that online education offers are SEVERELY outweighed by the problems is creates. I feel so fucking alone and isolated with these classes, I cannot properly learn when I'm just alone in my house. It's suffocating.\n\nTo every college administrator, stop encouraging these classes. I don't care about the few thosands of people benefit from them; millions of others are getting a lackluster education because someone thinks that MathXL or an online coding class are just as good as an in-person one. Fuck people that think that.",
  "author": "SomeNumbers98",
  "created": 1626558291,
  "over_18": false,
  "upvotes": 37,
  "upvote_ratio": 0.93,
  "comments": {
    "h5mthp6": {
      "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5mthp6/",
      "text": "When you email, send something short and easy to reply to and try to start your work early if you expect you might have trouble.\n\nNot saying it doesn’t suck rn, but those tips might help a lot. Online classes used to be great (I did an entire degree online) but that was when it was a specialty for entry level adjuncts (willing to grind to teach the basics) not when it was forced on tenure-track professors (who honestly have better things to do than read content to undergrads, they should have more TA support).",
      "author": "Allusionator",
      "created": 1626618381,
      "upvotes": 1,
      "replies": {}
    },
    "h5mm1x9": {
      "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5mm1x9/",
      "text": "A big part of that is the infrastructure for online classes just isn't there. Most profs haven't had any pedagogy training as it is, so throwing tech and timing on top of that just leads to more problems. I think some classes are ok online, but it's less the class itself and more how the class itself is done, which relies heavily on a teacher that has time to do it right. Most don't have that, so here we are.\n\nI'd say start including previous dates in emails. Most departments have a required response to student time for emails, so if they're being weird about it just send the chain up to the chair. We're all under pressure, but if you're doing the work and the thing holding you back is an instructor not responding, make noise. \n\nIn fact, if they've done that to other students, get other students to send email/call/visit chair as well. Make noise. When I was teaching years ago, I thought I'd be a 'in person only' prof and just didn't check email, and got a rude awakening from a group of students and the chair. Thankful that happened, so I could be a better teacher.\n\nThe natural caveat to this is start early on assignments if you can. Instructors are people too, trying to survive a pandemic and thrown into a new form of classroom instruction that is wildly tricky. In love classes, I used to expect an email or two the night assignments were due. Now....it can be a lot, and if each question takes 10 min for me to check the problem and type a solution, it only takes 5 students in a class of 40+ to extend a long day by almost an hour. Instructors are burnt out too. Help yourself by helping them. \n\nBut yea, online classes stink without good resources. Sorry it's been tough.",
      "author": "physgm",
      "created": 1626614610,
      "upvotes": 2,
      "replies": {
        "h5mnotk": {
          "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5mnotk/",
          "text": "I can empathize with your points.\n\nThanks for the response.",
          "author": "SomeNumbers98",
          "created": 1626615520,
          "upvotes": 1,
          "replies": {
            "h5myts8": {
              "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5myts8/",
              "text": "Back at you. It's ridiculous that students are forced to pay full tuition for subpar access to education. Especially when a class ends up causing more stress than actual learning.",
              "author": "physgm",
              "created": 1626620786,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h5ld24z": {
      "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5ld24z/",
      "text": "I think it also really depends on the professor, and more importantly, what the college is willing to enforce as a standard. My professor for a summer class has gone out of their way to make lecture videos for each chapter/segment, she sends group emails at least once a week to check in on everybody, and holds zoom meetings for questions and to talk about projects. Someone else I know (at the same college for a summer class) is dealing with a professor who just poorly photocopied and uploaded a bunch of PDFs with almost no communication.",
      "author": "SemicircularCactus",
      "created": 1626581168,
      "upvotes": 7,
      "replies": {
        "h5lkt12": {
          "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5lkt12/",
          "text": "I’m ranting mostly about “asynchronous classes”. If my current comp sci professor had zoom meetings every few days, that would be wonderful.",
          "author": "SomeNumbers98",
          "created": 1626586010,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h5kxqzu": {
      "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5kxqzu/",
      "text": "I totally agree with u; the only classes u can really benefit from r studio art classes bc u don't have to be stuck in a cold studio for 3 hrs or be constantly pressured to work all the time in those 3 hrs. It sucks that they took away the pass or fail option like wtf?? some of us rely on that bc we were forced into a format that is very inefficient.",
      "author": "Sleepy_Lingerie_Art",
      "created": 1626573158,
      "upvotes": 2,
      "replies": {}
    },
    "h5kvucs": {
      "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5kvucs/",
      "text": "Something I've discovered is if you can find a good text to speech app for your computer it can help a little with text books.",
      "author": "Wildlife_biology_",
      "created": 1626572198,
      "upvotes": 3,
      "replies": {}
    },
    "h5kv7j3": {
      "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5kv7j3/",
      "text": "Yeah nothing sucks as much as having a problem, contacting the proof and getting a response two days after the assignment was due and the response saying keep me informed and after responding what happened and that the problem has been solved but you need an extension to complete the assignment then getting no response then two weeks later getting told to complete your assignments and that your grade is horrible (of course your response goes no where). Oh and what was the problem not been able to access your tests and due to lack of completion your garden goes from an 86% to 42%.",
      "author": "Wildlife_biology_",
      "created": 1626571884,
      "upvotes": 2,
      "replies": {}
    },
    "h5kuqjy": {
      "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5kuqjy/",
      "text": "Yesss say it, online education isn't even educational wtf",
      "author": "IASturgeon42",
      "created": 1626571647,
      "upvotes": 8,
      "replies": {}
    },
    "h5k8plt": {
      "link": "/r/CollegeRant/comments/omdgo6/online_classes_make_me_want_to_light_myself_on/h5k8plt/",
      "text": "🙌",
      "author": "Analyst_Unlucky",
      "created": 1626559966,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634062303
}