{
  "sid": "q8pcie",
  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/",
  "title:": "I’m a freshman and I just got COVID-19! How tf will I make up for the time lost?",
  "text": "God, I was working so fucking hard every single day, and the more days I spend without working the more snowed under I feel. Like crazy snowed under.\nAnyone with a similar story? Were professors understanding?",
  "author": "Individual_Coast8114",
  "created": 1634307297,
  "updated": 1634597241,
  "over_18": false,
  "upvotes": 42,
  "upvote_ratio": 1.0,
  "comments": {
    "hgqwlh7": {
      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqwlh7/",
      "text": "Are you by any chance from the Philippines?",
      "author": "gunpowdergelatineee",
      "created": 1634310689,
      "upvotes": 2,
      "replies": {
        "hgqwmxy": {
          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqwmxy/",
          "text": "I am from Hungary",
          "author": "Individual_Coast8114",
          "created": 1634310706,
          "upvotes": 1,
          "replies": {
            "hgqwutj": {
              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqwutj/",
              "text": "I see. I had a school mate who had covid in the beginning of our school year. The professors were understanding, and give him ample time to get back on track. I hope you feel better soon. Your health matters more.",
              "author": "gunpowdergelatineee",
              "created": 1634310799,
              "upvotes": 4,
              "replies": {
                "hgqyvok": {
                  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqyvok/",
                  "text": "Thank you!! Really glad to hear this",
                  "author": "Individual_Coast8114",
                  "created": 1634311645,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hgqsqgm": {
      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqsqgm/",
      "text": "I don’t understand why colleges are open still? I would have kept schools closed atleast until this blew over. Keep the kids, the future, safe.",
      "author": "Salvationzzzz",
      "created": 1634309060,
      "upvotes": 7,
      "replies": {
        "hgqv2rc": {
          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqv2rc/",
          "text": "Well, because closing schools is terrible to mental health, I guess. Anyways, we were dealing with this with hybrid education - most of my classes were online, and I still got it.",
          "author": "Individual_Coast8114",
          "created": 1634310049,
          "upvotes": 7,
          "replies": {
            "hgqwirx": {
              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqwirx/",
              "text": "I really liked online courses cause of how efficiently I could use my time. I could wake up like 10 minutes before my first class and still make it and understand everything whilst eating breakfast (since cameras didn’t need to be on for my first class) but for me it just felt right since I’m a CS major",
              "author": "Salvationzzzz",
              "created": 1634310658,
              "upvotes": 3,
              "replies": {
                "hgr90zj": {
                  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgr90zj/",
                  "text": "I liked virtual classes because I was able to work more, but man it hit my mental health hard not being able to interact with other students. I got involved as much as I could this year and have been trying new things and joining new organizations every month. I probably wouldn't be alive right now if my school didn't go back in person..\n\n&#x200B;\n\nEdit: also my degree is interactive design so I'm adjacent to the CS majors and spend a lot of time hanging out with them. I think all of the CS students I know agree that in person is better. But we also do a lot of hands on projects like with robotics and we run several on campus organizations, so missing out on all of that over the past year wasn't fun for any of them.",
                  "author": "cabbage-soup",
                  "created": 1634315800,
                  "upvotes": 2,
                  "replies": {
                    "hgrfppw": {
                      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgrfppw/",
                      "text": "We haven’t really started the more hands on stuff yet just learning all those programming language basics which I already knew which is kinda the reason why I would much prefer just staying at home. It’s mostly just me being lazy lol",
                      "author": "Salvationzzzz",
                      "created": 1634318532,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hgqvm41": {
          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqvm41/",
          "text": "The quality of my education decreased significantly when my school was closed. If it was still closed now I would’ve dropped out by now. Online learning is not feasible for a lot of subjects, especially when the learning needs to be hands-on for best delivery of information.",
          "author": "ms-tangled",
          "created": 1634310277,
          "upvotes": 7,
          "replies": {
            "hgqvwbf": {
              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqvwbf/",
              "text": "I just don’t really understand why computer science majors need to come to class tho. I was learning much more when I was in my CS classes on my own computer. Also the online classes thing was sudden and very new for many people so yea the beginning would be kinda bumpy but in my experience it got WAY better by each semester. But yea I understand why many courses would need in person.",
              "author": "Salvationzzzz",
              "created": 1634310396,
              "upvotes": -1,
              "replies": {
                "hgqwb5q": {
                  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqwb5q/",
                  "text": "Never said I was a CS major bud.",
                  "author": "ms-tangled",
                  "created": 1634310570,
                  "upvotes": 1,
                  "replies": {
                    "hgqwuo9": {
                      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgqwuo9/",
                      "text": "Never said you were a CS major bud",
                      "author": "Salvationzzzz",
                      "created": 1634310797,
                      "upvotes": 0,
                      "replies": {
                        "hgrao2t": {
                          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgrao2t/",
                          "text": "Ah, your comment read in a way that seemed like you saying that, since you were talking about CS majors lol.",
                          "author": "ms-tangled",
                          "created": 1634316468,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hgr22m0": {
          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgr22m0/",
          "text": "The truth is the vast majority of us who get covid will be fine… and at this point keeping schools shut down, which would be basically stopping the education of millions, is definitely more harmful for the future than all of us going back to learning and some getting covid. It is HORRIBLE that students can spread covid in classes but I still think that’s better than learning nothing through online school",
          "author": "false__positive",
          "created": 1634312945,
          "upvotes": 1,
          "replies": {}
        },
        "hgrh0g1": {
          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgrh0g1/",
          "text": "I also feel I should add that only 4 students in my entire university (9,500+ students) have reported currently having Covid-19, while only 20% of the students are vaccinated. This info is released to teachers in a weekly situation report but not students, but I have a professor who is tenured and doesn’t mind spilling the beans. The current climate of covid at universities doesn’t warrant closing them.",
          "author": "ms-tangled",
          "created": 1634319065,
          "upvotes": 1,
          "replies": {
            "hgrv0c3": {
              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgrv0c3/",
              "text": "In which country?",
              "author": "Individual_Coast8114",
              "created": 1634324813,
              "upvotes": 1,
              "replies": {
                "hgrvq20": {
                  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgrvq20/",
                  "text": "United States, in the south actually believe it or not",
                  "author": "ms-tangled",
                  "created": 1634325112,
                  "upvotes": 1,
                  "replies": {
                    "hgsh87k": {
                      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgsh87k/",
                      "text": "I am guessing Texas right? I would not be surprised if it were after all of the crazy things happening over there lately. So glad I am no longer living there and decided to go to school elsewhere. Glad to say that I also have not got covid still and proudly vaccinated! Hoping the pandemic ends soon!",
                      "author": "Brandon_partain",
                      "created": 1634334562,
                      "upvotes": 0,
                      "replies": {
                        "hgsyw7f": {
                          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgsyw7f/",
                          "text": "Nope, Alabama. Less than 1% of the school has covid while 20% are vaccinated so… can’t complain since the chances of me getting covid at school are slim to none. We do have a mask mandate though.",
                          "author": "ms-tangled",
                          "created": 1634343306,
                          "upvotes": 1,
                          "replies": {
                            "hgudgup": {
                              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgudgup/",
                              "text": "[this you saying you tested positive?](https://www.reddit.com/r/COVID19positive/comments/l1pckw/i_would_sell_my_soul_to_get_rid_of_this_headache/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
                              "author": "Oplatki",
                              "created": 1634377274,
                              "upvotes": 0,
                              "replies": {
                                "hgv06gj": {
                                  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv06gj/",
                                  "text": "That was at the beginning of this year and I wasn’t even going to school in person then.. but ok. Good try at making a point. That doesn’t change the fact that if only 4 out of 9500+ people at my university have covid now, despite vaccination rates, my chances of getting covid at school are slim to none. Move on. Sorry that my school’s stats don’t fit the narrative you’re trying to push.",
                                  "author": "ms-tangled",
                                  "created": 1634392859,
                                  "upvotes": 0,
                                  "replies": {
                                    "hgv2jfq": {
                                      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv2jfq/",
                                      "text": "Let's look at the easily found \"facts\" 9500+ people at your university means you go to University of Alabama Huntsville. \nHuntsville, for some reason, is reporting 0 new cases in the last week. [\\(SOURCE\\)](https://weather.com/coronavirus/l/Huntsville+AL?canonicalCityId=a69a6e1e58d85f3374d14eccc0009a0ded9eb8d078f860e1830ef05eb7ebc856)\nYet 88.65% of ICU beds are in use. \nAnd then we have where Alabama is ranked in education, so forgive me if I don't think I'd even order a burger from your counter.",
                                      "author": "Oplatki",
                                      "created": 1634394090,
                                      "upvotes": 1,
                                      "replies": {
                                        "hgv3bbk": {
                                          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv3bbk/",
                                          "text": "Still not where I go. I’d appreciate if you didn’t try to doxx me. What do ICU beds have to do with my school? I’m not going to get covid at school anytime soon if less than 1% of students have covid. Give it up and be happy that people can go to school without having to worry about infection.\n\nEDIT: to add, I like how you just don’t believe the no new cases added?? If a more liberal, progressive city in another state reported that I’m sure you’d shit your pants in awe of their tactics for eliminating covid. The K-12 cases for the entire state have dropped by almost 800 this week versus last week. I don’t really mind what you think about education in my state given that the program I’m in has the same accreditation as the ones at Harvard. That statement is extremely classist.",
                                          "author": "ms-tangled",
                                          "created": 1634394478,
                                          "upvotes": 0,
                                          "replies": {
                                            "hgv3w6m": {
                                              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv3w6m/",
                                              "text": "So you mentioned that you go to a University in Alabama that has 9500+ people. Dumbass, you doxxed yourself. They really are as smart as they say.",
                                              "author": "Oplatki",
                                              "created": 1634394767,
                                              "upvotes": 0,
                                              "replies": {
                                                "hgv5ppy": {
                                                  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv5ppy/",
                                                  "text": "Well, believe it or not, there’s more than 1 or 2 schools in Alabama that have over 9,500 students! Crazy right? That leaves a lot of options for where I go to school! But when you specifically name them, that narrows it down it quite a bit! \n\nImplying that people in Alabama are too dumb to serve you a McDonald’s hamburger is classist, point blank. There are stupid people everywhere. \n\nForgive me, but what point are you trying to make exactly? Why are you arguing with me over the climate of coronavirus at my university? Why do you seem mad that we have it under control despite having low vaccination rates? Please explain.\n\nBetter educated parts of the “country world”? Lol.",
                                                  "author": "ms-tangled",
                                                  "created": 1634395648,
                                                  "upvotes": 0,
                                                  "replies": {
                                                    "hgv70u0": {
                                                      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv70u0/",
                                                      "text": "Also, let's all take COVID advice from an Alabaman who caught COVID instead of the medical professionals.",
                                                      "author": "Oplatki",
                                                      "created": 1634396273,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "hgv766e": {
                                                          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv766e/",
                                                          "text": "*Alabamian.",
                                                          "author": "ms-tangled",
                                                          "created": 1634396343,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "hgv82oj": {
                                                              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv82oj/",
                                                              "text": "Both are acceptable. Not that I would expect someone from Alabama to be educated enough to know that.",
                                                              "author": "Oplatki",
                                                              "created": 1634396771,
                                                              "upvotes": 2,
                                                              "replies": {
                                                                "hgv8hzw": {
                                                                  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv8hzw/",
                                                                  "text": "Yeah, no one here says that. No one. My bad 🤷‍♀️ thanks for educating me on more ways to spell that! For someone who seems to hate Alabama so much, you sure do seem to know a lot about it. That is very impressive!",
                                                                  "author": "ms-tangled",
                                                                  "created": 1634396975,
                                                                  "upvotes": 0,
                                                                  "replies": {
                                                                    "hgva311": {
                                                                      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgva311/",
                                                                      "text": "Turns out you can learn things.  Next time maybe you won’t get Covid.",
                                                                      "author": "Oplatki",
                                                                      "created": 1634397732,
                                                                      "upvotes": 0,
                                                                      "replies": {
                                                                        "hgvaqox": {
                                                                          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgvaqox/",
                                                                          "text": "Again, I didn’t get covid at school as I wasn’t even going in person then. This post was about covid and universities. I probably contracted it at work, where I wore a mask and came into contact with lots of people. I took all the necessary precautions.  But yeah, I’ll keep that in mind.",
                                                                          "author": "ms-tangled",
                                                                          "created": 1634398040,
                                                                          "upvotes": 0,
                                                                          "replies": {
                                                                            "hgvbkit": {
                                                                              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgvbkit/",
                                                                              "text": "No one said you got COVID at school. You're not great at reading, are you?",
                                                                              "author": "Oplatki",
                                                                              "created": 1634398428,
                                                                              "upvotes": 0,
                                                                              "replies": {
                                                                                "hgvep6j": {
                                                                                  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgvep6j/",
                                                                                  "text": "This is a post about covid and universities. What does me having covid 10 months ago have to do with this? I don’t understand why you’re using it as a talking point here.",
                                                                                  "author": "ms-tangled",
                                                                                  "created": 1634399805,
                                                                                  "upvotes": 0,
                                                                                  "replies": {
                                                                                    "hgvffv0": {
                                                                                      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgvffv0/",
                                                                                      "text": "And you never will.",
                                                                                      "author": "Oplatki",
                                                                                      "created": 1634400122,
                                                                                      "upvotes": 1,
                                                                                      "replies": {
                                                                                        "hgvfopf": {
                                                                                          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgvfopf/",
                                                                                          "text": "Maybe explain.",
                                                                                          "author": "ms-tangled",
                                                                                          "created": 1634400230,
                                                                                          "upvotes": 1,
                                                                                          "replies": {}
                                                                                        },
                                                                                        "hgvfqn8": {
                                                                                          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgvfqn8/",
                                                                                          "text": "I may not understand but I know I’ll never be as miserable as you. Thank God.",
                                                                                          "author": "ms-tangled",
                                                                                          "created": 1634400253,
                                                                                          "upvotes": 1,
                                                                                          "replies": {}
                                                                                        }
                                                                                      }
                                                                                    }
                                                                                  }
                                                                                }
                                                                              }
                                                                            }
                                                                          }
                                                                        }
                                                                      }
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        },
                                                        "hgv79pl": {
                                                          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv79pl/",
                                                          "text": "What advice have I given? I simply stated my university’s statistics regarding covid.",
                                                          "author": "ms-tangled",
                                                          "created": 1634396389,
                                                          "upvotes": 0,
                                                          "replies": {
                                                            "hgv7n3s": {
                                                              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv7n3s/",
                                                              "text": "This you? \n>Nope, Alabama. Less than 1% of the school has covid while 20% are vaccinated so… can’t complain since the chances of me getting covid at school are slim to none.",
                                                              "author": "Oplatki",
                                                              "created": 1634396566,
                                                              "upvotes": 1,
                                                              "replies": {
                                                                "hgv85uz": {
                                                                  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv85uz/",
                                                                  "text": "There’s no advice given in that. I didn’t say “don’t get vaccinated”. I simply stated the stats. I can’t complain, can I? Less than 1% of my school has covid despite low vaccination. Presumably, the 4 students who have reported having covid are quarantining, so I shouldn’t come into contact with them. So again, I likely will not get covid at school at this point in time. When I say that, I’m not referring to any other semester or in the future. But RIGHT NOW, TODAY, my chances of contracting the virus at school are incredibly low. Maybe if more people were vaccinated, no one would have it? Who am I to say? I’m no professional. \n\nSo yes, that is me.",
                                                                  "author": "ms-tangled",
                                                                  "created": 1634396814,
                                                                  "upvotes": 0,
                                                                  "replies": {
                                                                    "hgv9zqn": {
                                                                      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv9zqn/",
                                                                      "text": "Go fuck your ignorance and your claims otherwise.  Seriously.  You’re a piece of shit for implying that it’s not a problem.",
                                                                      "author": "Oplatki",
                                                                      "created": 1634397689,
                                                                      "upvotes": 0,
                                                                      "replies": {
                                                                        "hgvad6v": {
                                                                          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgvad6v/",
                                                                          "text": "❤️ \nI haven’t implied anything. Only stated cold hard facts relating to my university, not the state as a whole!",
                                                                          "author": "ms-tangled",
                                                                          "created": 1634397865,
                                                                          "upvotes": 0,
                                                                          "replies": {
                                                                            "hgvbid3": {
                                                                              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgvbid3/",
                                                                              "text": "You selectively chose \"cold hard facts\" without citation. LOL. I hope you never have to apply for a job outside of Alabama.",
                                                                              "author": "Oplatki",
                                                                              "created": 1634398401,
                                                                              "upvotes": 1,
                                                                              "replies": {
                                                                                "hgvfnoi": {
                                                                                  "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgvfnoi/",
                                                                                  "text": "Yeah, it’s hard to cite statistics that aren’t released to the public and were given to me by word of mouth. I stated where I got the information from to begin with. I still have yet to figure out why you’re so pressed about this. I’ve already had offers for opportunities in other states, but thanks.",
                                                                                  "author": "ms-tangled",
                                                                                  "created": 1634400217,
                                                                                  "upvotes": 1,
                                                                                  "replies": {
                                                                                    "hgviiim": {
                                                                                      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgviiim/",
                                                                                      "text": "Sure.  That’s how colleges announce Covid statistics: word of mouth.",
                                                                                      "author": "Oplatki",
                                                                                      "created": 1634401485,
                                                                                      "upvotes": 0,
                                                                                      "replies": {}
                                                                                    }
                                                                                  }
                                                                                }
                                                                              }
                                                                            }
                                                                          }
                                                                        }
                                                                      }
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    },
                                                    "hgv6wuu": {
                                                      "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv6wuu/",
                                                      "text": "No one said McDonald's. That's you. You also weren't able to explain your classist remark either, you racist.",
                                                      "author": "Oplatki",
                                                      "created": 1634396220,
                                                      "upvotes": 0,
                                                      "replies": {
                                                        "hgv72pr": {
                                                          "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv72pr/",
                                                          "text": "I hope you realize I think your replies are actually comical. Have a good day!",
                                                          "author": "ms-tangled",
                                                          "created": 1634396298,
                                                          "upvotes": 1,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            },
                                            "hgv43a1": {
                                              "link": "/r/CollegeRant/comments/q8pcie/im_a_freshman_and_i_just_got_covid19_how_tf_will/hgv43a1/",
                                              "text": "Also, please explain to the world how that's \"classist\". Use college words that other colleges in better educated parts of the country would use.",
                                              "author": "Oplatki",
                                              "created": 1634394863,
                                              "upvotes": 0,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}