{
  "sid": "o0kn79",
  "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/",
  "title:": "I don't understand why there are majors that only prepare you for grad school and nothing else",
  "text": "By this, I mean very specific majors that are only intended for further education (ex. pre-med as a major, any pre-professional degree). I understand that some people might know exactly what they want to do, so getting a degree in, let's say, exercise science, might be a great path to grad school for PT. However, colleges do not make it clear enough that it puts you at a disadvantage if you decide not to go that route. They say, \"oh, it's versatile! you can get any job!\" Sure, but it'll be more difficult than someone who studied IT or business. People say that college is to prepare you for a job, but then others say it's to learn, grow, and explore your interests. Which is it, then?! If it's the latter, any degree would be fine...but then, jobs shouldn't require specific degrees if they're just going to teach you everything on the job, anyways.\n\nI'm not knocking the importance of the subjects. Every college major is important and worthy of being studied, in my opinion. But it frustrates me that professors and faculty do not properly guide students within pre-professional majors. I wish that these fields of study were offered only as leveling courses or as 3 year grad programs (if needed) so that people wouldn't get stuck with a degree that is intended as a stepping-stone and have no other option but to fight like hell for a job or go to grad school.\n\n\\*speaking from personal experience of people I know who are stuck in limbo due to not getting into grad school or changing their mind and feeling regretful. ",
  "author": "itllwashaway",
  "created": 1623780460,
  "over_18": false,
  "upvotes": 36,
  "upvote_ratio": 0.93,
  "comments": {
    "h1wd52h": {
      "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1wd52h/",
      "text": "Colleges are for profit businesses. they will find any way possible to squeeze as much money out of you as they can.",
      "author": "2valve",
      "created": 1623794016,
      "upvotes": 2,
      "replies": {}
    },
    "h1vrb8n": {
      "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1vrb8n/",
      "text": "Meeting \"Consumer demand\" pretty much. There's a certain type of student who only gives a shit about getting into med school or law school or what have you, and has no interest in actually studying a real undergrad degree. \n\n> However, colleges do not make it clear enough that it puts you at a disadvantage if you decide not to go that route. They say, \"oh, it's versatile! you can get any job!\"\n\nDo they really say that? I mean, sure they may want to play up the other fields you can go into to assuage doubt, but face it, if you're studying something that only covers the prereqs for something else, and you don't get into that something else, expecting what you did for an undergrad degree to be all that useful is just foolish.\n\nPersonally, I think this is a problem created by the law schools and the medical schools admissions processes. They should be more highly rating people who took actual degrees than those who did these fake pre-req degrees.",
      "author": "BarackTrudeau",
      "created": 1623784352,
      "upvotes": 6,
      "replies": {
        "h1wtmbr": {
          "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1wtmbr/",
          "text": "A lot of what you are calling \"fake pre-req degrees\" are challenging programs that just don't open up a lot of opportunities at the BS level. Biology, for instance, is the chief culprit here, as are to a slightly lesser extent Physics, Psychology, Chemistry, and Biochemistry. Basically, any degree in the pure sciences requires at least an MS to really become useful on the job market.",
          "author": "TheProfessorsCat",
          "created": 1623802417,
          "upvotes": 8,
          "replies": {
            "h1x2mmc": {
              "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1x2mmc/",
              "text": "I'm not calling those fake pre-req degrees. I'm calling a pre-med degree or program a fake pre-req degree.",
              "author": "BarackTrudeau",
              "created": 1623807087,
              "upvotes": 2,
              "replies": {
                "h1x4muw": {
                  "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1x4muw/",
                  "text": "In that case, I agree with you. Pre-med and pre-law are not disciplines and should not have degrees. \n\nI prefer it when institutions don't have these programs set up for students and instead advise them that getting into med school is tough, and that they should have a back-up plan, and that that back up should be related to their declared major. A lot of students don't get into med school until completing their BS anyway, so it might as well be a real program\n\nHowever, a lot of students are bad at keeping track of which courses they need to succeed in to make a compelling application to med school. Parents are also uneasy with the idea that their kid might not get in. Creating these checklist programs for \"pre-med\" keeps the students organized and puts the parent's minds at ease. At least, for 90% of parents, their minds are at ease until their child fails to gain admittance into the desired programs and they are left without a degree.",
                  "author": "TheProfessorsCat",
                  "created": 1623808127,
                  "upvotes": 3,
                  "replies": {
                    "h1x6sdh": {
                      "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1x6sdh/",
                      "text": "> However, a lot of students are bad at keeping track of which courses they need to succeed in to make a compelling application to med school. \n\nI mean, I'll be completely frank here, I feel that society would be better served if students who can't figure that out don't get into medical school. \n\n> Parents are also uneasy with the idea that their kid might not get in. \n\nWhile we're at it, I also think society as a whole would be better off if we stopped caring about what the parents of young adults think about what those young adults are doing. \n\nI suppose I can understand why some parents might pressure their offspring to go into such programs if they exist, but that doesn't justify the existence of the program in the first place.",
                      "author": "BarackTrudeau",
                      "created": 1623809257,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h1vtpu5": {
          "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1vtpu5/",
          "text": "Agreed, and my colleges have said that, at least. The curriculum for pre-professional programs state that they’re intended for graduate school but also “set students up for a variety of careers…” not mentioning you need further education for those. They also encourage you to declare them vehemently, for some reason. I had one short zoom call about one of the majors and the professor pretty much told me to switch into it right away. \n\nNever thought to call them “pre-req” degrees but that’s the perfect name. Also, I wonder why grad schools created this problem? or contributed to it? what do they get out of it? Its more $$$ if you have to complete leveling courses or pre-reqs outside of an undergrad degree. Is it so people get stuck and keep applying bc they have a specific degree for grad school??",
          "author": "itllwashaway",
          "created": 1623785443,
          "upvotes": 3,
          "replies": {
            "h1vuky4": {
              "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1vuky4/",
              "text": "> The curriculum for pre-professional programs state that they’re intended for graduate school but also “set students up for a variety of careers…” not mentioning you need further education for those. \n\nI wouldn't say that's wholly inaccurate. There's a number of careers that have a degree as a prereq. Any degree, doesn't matter what. \n\n> Also, I wonder why grad schools created this problem? or contributed to it? \n\nThey articulated what it is that they expect students applying to their programs to have, and undergrad programs popped up in order to meet those requirements and basically only those requirements. \n\n> Is it so people get stuck and keep applying bc they have a specific degree for grad school??\n\nDoubt it. There's no shortage of people applying for medical and law schools. They're still able to be picky about who they let in.",
              "author": "BarackTrudeau",
              "created": 1623785831,
              "upvotes": 3,
              "replies": {
                "h1vz6ar": {
                  "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1vz6ar/",
                  "text": "Yeah, I also don’t have an issue with programs that guarantee admissions into the grad program if you maintain a certain GPA. Those are perfect for ppl who have a set plan & it prevents people from spending the time & money on the undergrad degree and not being able to get into their grad program of choice.\n\nMaybe the schools I’ve had experience with just market them kind of badly. Or the professors, at least.",
                  "author": "itllwashaway",
                  "created": 1623787812,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634063140
}