{
  "sid": "qhdp8d",
  "link": "/r/CollegeRant/comments/qhdp8d/i_googled_a_question_during_a_proctored_exam_how/",
  "title:": "I googled a question during a proctored exam how fucked am I?",
  "text": "So I took an exam monitored by Proctorio I used google once for a question because it said Proctorio only monitors your webcam. Also we were allowed to use our online textbook for the exam but I used google to help me find the answer to one question. How fucked am I and does Proctorio always monitor your screen?",
  "author": "carrotverse",
  "created": 1635391053,
  "updated": 1635457489,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hicayvk": {
      "link": "/r/CollegeRant/comments/qhdp8d/i_googled_a_question_during_a_proctored_exam_how/hicayvk/",
      "text": "Why didn’t you just do what everyone else does and put a tablet or phone up to the computer screen to look up answers.",
      "author": "Spicybooiii",
      "created": 1635394315,
      "upvotes": 1,
      "replies": {
        "hicem21": {
          "link": "/r/CollegeRant/comments/qhdp8d/i_googled_a_question_during_a_proctored_exam_how/hicem21/",
          "text": "Right",
          "author": "Forever_ForLove",
          "created": 1635396417,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hic9re4": {
      "link": "/r/CollegeRant/comments/qhdp8d/i_googled_a_question_during_a_proctored_exam_how/hic9re4/",
      "text": "They usually monitor what you do on your lab top during the exam. I had to use it for my biology exam last semester. It was still open notes but idk about you but my professor monitor what we was all doing and ect. Of few ppl cheated and got caught. Which they received an F. He told us this at the beginning about no cheating but ppl are hard headed.",
      "author": "Forever_ForLove",
      "created": 1635393664,
      "upvotes": 1,
      "replies": {
        "hicba9p": {
          "link": "/r/CollegeRant/comments/qhdp8d/i_googled_a_question_during_a_proctored_exam_how/hicba9p/",
          "text": "Yeah my only thought is that because we are allowed to use the online textbook my professor won’t be notified for switching tabs and stuff. I wasn’t even thinking and when I turned on Proctorio it only said they were monitoring my webcam as opposed to other proctoring soft that explicitly said they were recording my screen.",
          "author": "carrotverse",
          "created": 1635394495,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}