{
  "sid": "l5j3do",
  "link": "/r/CollegeRant/comments/l5j3do/this_my_last_semester_and_i_am_burnt_out/",
  "title:": "This my last semester and I am burnt out. Professors that think their class is the center of the universe are killing me.",
  "text": "I am over all this. I took a Winter course so didn't have time to really relax. Then I start this semester with elective professors that think their class is the most important class of your life.  These professors are already assigning multiple chapters in the first week. \n\nIt doesn't help that their online class structure is atrocious with the pettiest of requirements.  Navigating these classes requires its own handbook. One would think that professors would have it together after two semesters online.",
  "author": "SwiftCEO",
  "created": 1611682895,
  "over_18": false,
  "upvotes": 60,
  "upvote_ratio": 0.95,
  "comments": {
    "gkvw6ok": {
      "link": "/r/CollegeRant/comments/l5j3do/this_my_last_semester_and_i_am_burnt_out/gkvw6ok/",
      "text": "Sameeeee",
      "author": null,
      "created": 1611704479,
      "upvotes": 1,
      "replies": {}
    },
    "gkv899x": {
      "link": "/r/CollegeRant/comments/l5j3do/this_my_last_semester_and_i_am_burnt_out/gkv899x/",
      "text": "Agreed! I have been taking online classes for three years now, and this is the first semester where all four professors think that the student’s lives should revolve around their one class. I have never had so many issues with navigating canvas than I do with all four of these people because they are all using it completely differently and some of them are making us do every step within canvas. Some of the professors that are not savvy with technology or making my life extremely hard. 😑 One of them even had an assignment due the second day back from class. I hadn’t even looked at it before he sent an email to some of us that hadn’t even touched it yet. Then he created a video that he required the entire class to watch that showed all of us that hadn’t done his first assignment yet.",
      "author": "Latter_Log_6162",
      "created": 1611694088,
      "upvotes": 11,
      "replies": {
        "gkwe8ww": {
          "link": "/r/CollegeRant/comments/l5j3do/this_my_last_semester_and_i_am_burnt_out/gkwe8ww/",
          "text": "So he showed students info to the class?\nLike went to each assignment and pulled up a list of who didn't do it? I don't think revealing this to students is allowed and should be reported to the department and dean of students.",
          "author": "elocinkrob",
          "created": 1611713297,
          "upvotes": 3,
          "replies": {
            "gkwfz2s": {
              "link": "/r/CollegeRant/comments/l5j3do/this_my_last_semester_and_i_am_burnt_out/gkwfz2s/",
              "text": "He sure did! He scrolled through the list of names that showed who has and hasn’t completed that assignment.",
              "author": "Latter_Log_6162",
              "created": 1611714147,
              "upvotes": 2,
              "replies": {
                "gkwgrcb": {
                  "link": "/r/CollegeRant/comments/l5j3do/this_my_last_semester_and_i_am_burnt_out/gkwgrcb/",
                  "text": "Yeah I would save that video and send it up the chain of command. Especially since this wasn't an accident like some do during zoom sharing. He made a specific video to show the grade book side that specifically tells students who did or didn't click the assignment or do the work. \n\n\nReport him!\n\n\n\nI had to report my teacher on Monday for saying she would only give student who show up to class on campus extra credit. Basically telling us zoom student that were not eligible. \n\n\nI said it's unfair to require that during a pandemic and for my situation my husband tested positive so I reported it to my school and they wants me to either quartine for 20 days or try to get my own positive result so they can do 10 days from that date... So stupid. \n\n\nAlso the zoom attendance today was 32 students out of 55 students in the entire class. That's not including the students that don't show up during lecture time at all",
                  "author": "elocinkrob",
                  "created": 1611714533,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634061980
}