{
  "sid": "qlvh63",
  "link": "/r/CollegeRant/comments/qlvh63/my_school_doesnt_have_enough_seats_for_a_class/",
  "title:": "My school doesn’t have enough seats for a class that I need to graduate.",
  "text": "I have to take cell bio this semester, and if I don’t it’ll set me back a semester in my classes. My school had two sections available with 20 seats each. There are probably almost a hundred if not more students that need to take cell bio this semester. This school doesn’t give a shit about its students and I hate it.",
  "author": "FriendThin3492",
  "created": 1635949112,
  "updated": 1636137996,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.89,
  "comments": {
    "hj64smp": {
      "link": "/r/CollegeRant/comments/qlvh63/my_school_doesnt_have_enough_seats_for_a_class/hj64smp/",
      "text": "Maybe talk to the department head who is usually the one who can change the class cap or see if you can cross-register at another nearby school. College students need to unionize. All these systems suck and administrators do not give a shit about us.",
      "author": "cbdinfusedcocaine",
      "created": 1635958798,
      "upvotes": 11,
      "replies": {}
    },
    "hj7lfo3": {
      "link": "/r/CollegeRant/comments/qlvh63/my_school_doesnt_have_enough_seats_for_a_class/hj7lfo3/",
      "text": "I was very annoyed when I saw the classes I need for my major are all filled up but I can only imagine how you feel needing that class to **graduate**",
      "author": "wet_joy",
      "created": 1635979219,
      "upvotes": 3,
      "replies": {
        "hj7lme3": {
          "link": "/r/CollegeRant/comments/qlvh63/my_school_doesnt_have_enough_seats_for_a_class/hj7lme3/",
          "text": "Yeah it sucks T-T but I think a bunch of us complained to the department head bc they added new sections",
          "author": "FriendThin3492",
          "created": 1635979297,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hj8tzb7": {
      "link": "/r/CollegeRant/comments/qlvh63/my_school_doesnt_have_enough_seats_for_a_class/hj8tzb7/",
      "text": "What major are you? Did you have to apply into a program for your major? Usually junior and senior courses should have fewer students competing for the course cuz you have the same amount of students from the start (and even less competition the students drop out) or maybe it’s just for the health science majors at my school. \n\nBut seniors should have better registration priority, no?",
      "author": "FluffyStuffInDaHouz",
      "created": 1636000237,
      "upvotes": 2,
      "replies": {}
    }
  }
}