{
  "sid": "mp4eol",
  "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/",
  "title:": "How do people not contribute in group projects??",
  "text": "If you are someone that does this...how??? How do people just let others do all the work? Ignore attempts at communication? What goes through their mind? Maybe they’re busy but everyone is. Maybe they see someone taking the lead and doing the work and think ehh they’ll take care of it.\n\nI genuinely wish to know. I’m always worried I’m not contributing enough and so I make sure to do my part and usually more than I even need to. So I have no idea how some ppl can just do absolutely nothing or the bare minimum while others have to cover their slack on top of their own strenuous work load.\n\nAh..why can’t I just work on things by myself. People always say you have to work with others in the workplace but I feel like at that point most people would at least put in a bit of effort for the sake of their job. Some ppl just don’t care about school but it hurts the rest of the group and the people that do. I hate it, I’m so stressed",
  "author": null,
  "created": 1618192359,
  "over_18": false,
  "upvotes": 69,
  "upvote_ratio": 0.98,
  "comments": {
    "guaqyn4": {
      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/guaqyn4/",
      "text": "Yeah I'm glad I haven't had to do any group projects so far. I hate working people.",
      "author": "dank666420",
      "created": 1618261108,
      "upvotes": 1,
      "replies": {}
    },
    "gu9mdjk": {
      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu9mdjk/",
      "text": "Just finished a project and we divided ourselves into the presenters and those writing the paper. The presenters were more keen and I was so frustrated. Our presentation was done first at the middle of the sem and the paper was due a couple weeks ago. We all had our sections assigned and I finished my part. 2 never showed up to our meetings or contributed to the paper. I had to edit their sections and write the intro and conclusion while the presenters just criticized the whole paper. I didn't mind criticism, but some were ridiculous like just a spelling error. I or someone probably didn't notice some spelling errors that anyone could correct if we didn't notice it. They could have fixed the minor mistakes and made more points regarding what was unclear. I kept opening the document the days before the paper was due and it was just criticism after criticism and I felt angry cause 2 were unreachable and the other kept saying she was going to help but only ended up focusing on her part. So glad I'm done with that.",
      "author": "xSooIntense",
      "created": 1618243214,
      "upvotes": 1,
      "replies": {}
    },
    "gu910cq": {
      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu910cq/",
      "text": "I've had few group projects in my time at university so far, but one of my friends is at a different uni and about 60% of his total grade is based on group assignments. If I had to do that I would quit. Seriously. No. \n\nI hope you can get through this, and definitely tell your professor. They might not do anything about it but at least they'll know when it comes to marking. Wishing you all the best.",
      "author": "AMedievalSilverCat",
      "created": 1618233056,
      "upvotes": 1,
      "replies": {}
    },
    "gu8h437": {
      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu8h437/",
      "text": "I know some people enrol in college classes to technically still count as a student to delay paying back loans, but may have found a job or something already so just trying to stall when they already have a degree. So basically no intention of actually doing classes and is just fake enrolled willing to get an F because theres no consequences",
      "author": null,
      "created": 1618217111,
      "upvotes": 1,
      "replies": {}
    },
    "gu8g2q9": {
      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu8g2q9/",
      "text": "Yeah I know it really sucks. You have to do all the work and turn it in. But I usually just let the teacher know what’s going on, not so they can take action but just so they know. \n\nKeep in mind I “rat out” my team only after I’ve pleaded with them and compelled them that they should help. But they don’t. So then I have no choice. \n\nSometimes there have been situations where I didn’t know the content in the project so communicated with the leader and asked for help, I got it done with help and learned about the topic. \n\nI’ve never not communicated with team even if I didn’t know what to do at all. \n\nThese people who choose to opt out are usually the good looking well-to-do folks who don’t really need school to be financially secure in the future, they just see it as a source of fun. It’s sad. But they waste time of us who’re there to learn",
      "author": "elpresidentdeusa",
      "created": 1618216024,
      "upvotes": 3,
      "replies": {}
    },
    "gu8bh4q": {
      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu8bh4q/",
      "text": "It's a case of social loafing, they think they can get by with slacking off and unloading their responsibilities onto everyone else because they are in a group",
      "author": "toofeduptocare",
      "created": 1618211347,
      "upvotes": 1,
      "replies": {}
    },
    "gu850u2": {
      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu850u2/",
      "text": "I recently had a project where rather than split the work up my group members wanted to meet every week and work on it together question by question . If this was a normal year where we have in person class then maybe things would’ve been different but me personally I didn’t like the approach they took. First of all there was 5 of us so working on it on zoom together was pointless. Why would I put in effort when there’s 4 other people who are there too. There was 5 questions all together and 5 of us so all we had to do was do one question each. Had we approached it this way I would of made sure to do my one question to the best of my ability. But meeting on zoom after a long day to do work we should have just split up just seemed like a waste of time. So I’d go to meetings but kinda just sit there, I’d contribute every now and then but almost 0 real effort.",
      "author": "Johnboy1330",
      "created": 1618205630,
      "upvotes": 3,
      "replies": {
        "gu8cmr3": {
          "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu8cmr3/",
          "text": "Yeah but just because you would've done your assigned question to your best ability doesn't mean everyone else would've. \n\nI actually like that approach because it ensures that everybody in the group puts in work and no question is left blank or unfinished",
          "author": "toofeduptocare",
          "created": 1618212480,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gu808c9": {
      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu808c9/",
      "text": "When classmates get lumped into a group for projects by the professor, usually they already know to “mix” the group by assigning high achievers with slackers to balance all groups in the class out. They figure people who do the work care enough to “manage the slackers “ and get them to perform. It’s an exercise in getting group members to hold each other accountable—it is always a disaster since slackers ignore anyone trying to get them to be productive and count on the fact that many students will not hold them accountable and just do all the work on their own—no matter how stressful! \n\nNot ME. If you happen to be in my group, I directly ask who wants to do what? We divide up the work then look at due dates and make deadlines—I ask everyone to speak up or get stuck with shit they don’t want to do. I also say that Everyone has tons of shit to do, so do it by group deadline BEFORE due date. \n\nWe all exchange info and if anyone needs clarity send a text, message or email to group members. No micro managing—BUT if that shit is not in by deadline be prepared because I will not hesitate to make it crystal clear WHO the half-ass was that did not perform, to the professor AND the rest of the group by project end. It will be outlined in detail on individual member evaluations and turned in. Barring an egregious emergency or death—shit should be turned in by Deadline—proof read, edited, succinct and follow all rubric specs.\n\nI’ve literally asked one half ass that ignored work in my group In front of the entire class to explain to our classmates a certain section of the presentation, to his complete and utter a shock and silence, he literally walked out of the classroom! This was after offering help, sending resources, having meetings etc. so yo all you half asses out there 🔥🔥🔥🔥🔥BUCK UP or \n\nB🔥U🔥R🔥N!",
      "author": "RomanLion29",
      "created": 1618201908,
      "upvotes": 11,
      "replies": {
        "gu8arm6": {
          "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu8arm6/",
          "text": "I’m gonna use this next time 😂",
          "author": "tatertot-59",
          "created": 1618210664,
          "upvotes": 2,
          "replies": {}
        },
        "gu80s95": {
          "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu80s95/",
          "text": "Damn seems like you have this down lol. Can I ask you for some advice on my situation right now? I could use it and seems like you know how to deal with these things",
          "author": null,
          "created": 1618202313,
          "upvotes": 1,
          "replies": {
            "gu81ndk": {
              "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu81ndk/",
              "text": "Sure PM me...",
              "author": "RomanLion29",
              "created": 1618202960,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gu8bxis": {
          "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu8bxis/",
          "text": "What if people fight over which portion they want to do?",
          "author": "toofeduptocare",
          "created": 1618211796,
          "upvotes": 1,
          "replies": {
            "gu8c39l": {
              "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu8c39l/",
              "text": "Flip a coin—50/50 chance each. Equal chance. Neutral person tosses coin. Each calls it—winner takes topic they want.",
              "author": "RomanLion29",
              "created": 1618211954,
              "upvotes": 1,
              "replies": {
                "gu8cs2b": {
                  "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu8cs2b/",
                  "text": "That's genius, I don't know why I didn't think of that! I hope your good leadership skills take you  to great places in life!",
                  "author": "toofeduptocare",
                  "created": 1618212628,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gu806fj": {
      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu806fj/",
      "text": "preach... it seems like some people quite honestly just don’t care about their grades AT ALL. Obviously I don’t expect everyone to be obsessed with their studies, but if you simply do not care at all... why the heck are you here??",
      "author": "morrisonsblues",
      "created": 1618201869,
      "upvotes": 10,
      "replies": {
        "gu8ao1w": {
          "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu8ao1w/",
          "text": "These are my exact thoughts!",
          "author": "tatertot-59",
          "created": 1618210570,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gu7m8x1": {
      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu7m8x1/",
      "text": "I had a project last semester where literally everyone else in my group supposedly got rona the day before the project was due. It was a semester long project! When the professor asked for proof I had frantic phone calls and texts trying to get something to do. It blows my mind how lazy my classmates can be! I had two projects this semester and I elected to do those solo.",
      "author": "ScubaLevi20",
      "created": 1618193383,
      "upvotes": 31,
      "replies": {
        "gu7ptew": {
          "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu7ptew/",
          "text": "I know it’s crazy :/ I’m still holding out hope since a couple of them have actually started responding to my messages..still have yet to do the actual work but here’s to hoping",
          "author": null,
          "created": 1618195324,
          "upvotes": 5,
          "replies": {
            "gu7qrlh": {
              "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu7qrlh/",
              "text": "I'd suggest having it done just in case. It's better to have it ready and incorporate your lazy classmates' information as possible, instead of waiting for them to do stuff and getting screwed just before it's due.",
              "author": "ScubaLevi20",
              "created": 1618195848,
              "upvotes": 1,
              "replies": {
                "gu7sqd9": {
                  "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu7sqd9/",
                  "text": "Yeah I know if I need to I’ll be able to finish it up quickly since I actually know the material. Also this is part 1 of the whole project...tbh I’m planning on straight up saying guys I did most of part 1 for part 2 we’re gonna have to section it out more evenly and if they have any objections I’ll just go to the professor. I’m not gonna let myself carry the team again cuz they’ll just take it as a sign that I will do everything if they slack off",
                  "author": null,
                  "created": 1618196997,
                  "upvotes": 4,
                  "replies": {
                    "gu7t74k": {
                      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu7t74k/",
                      "text": "My project included having to interview a non-profit, write large paper, make a presentation, and then present it to the class. I ended up doing everything and I got many angry emails when everyone failed since the presentation was great. They didn't seem to realize that the professor could tell I had done it all since I have a very particular way of writing that did not match anyone else in the group. I kept her informed, but she said that she could tell it was a one man show when I did literally all the talking. It was a mess. 😬",
                      "author": "ScubaLevi20",
                      "created": 1618197274,
                      "upvotes": 6,
                      "replies": {
                        "gu7w2eg": {
                          "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu7w2eg/",
                          "text": "Wow I feel bad you had to do all that work by yourself :/ at least in the end you got a good mark and your professor was very understanding. Still it would be so much easier if people just...did what they were supposed to lol",
                          "author": null,
                          "created": 1618199060,
                          "upvotes": 3,
                          "replies": {
                            "gu7wf4u": {
                              "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu7wf4u/",
                              "text": "I'm headed into my junior year and the biggest lesson I've taken away from the last two years is to not count on my classmates. I'm trying to get into a specific master's degree program and I have to be responsible for making sure I get the grades I need to do that. Hopefully your classmates will help out, but prepare like they're not going to!",
                              "author": "ScubaLevi20",
                              "created": 1618199293,
                              "upvotes": 5,
                              "replies": {
                                "gu7wzi0": {
                                  "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu7wzi0/",
                                  "text": "That stresses me out lol, the second part of the project is 40 pages long...there’s no way I’m gonna be able to do that on top of the classwork from my other 4 classes :(",
                                  "author": null,
                                  "created": 1618199667,
                                  "upvotes": 1,
                                  "replies": {
                                    "gu7xg2z": {
                                      "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu7xg2z/",
                                      "text": "Keep communication open with the group and go talk to your professor if you need to. Level with the folks in your group and let them know that you will not do it on your own. I generally have plenty of extra time to get stuff done because I have a very strict schedule that I stay on. I build in time to take up the slack in group projects, but that's not possible for everyone. You're going to have to be very firm with them if they start slacking off.",
                                      "author": "ScubaLevi20",
                                      "created": 1618199969,
                                      "upvotes": 1,
                                      "replies": {
                                        "gu7znz5": {
                                          "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/gu7znz5/",
                                          "text": "Yep I’m gonna send a message tomorrow communicating my concerns with them. I really hate confrontation or people having a bad impression of me but I’d rather that than feeling as stressed as I am now",
                                          "author": null,
                                          "created": 1618201496,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hnkdj7c": {
                  "link": "/r/CollegeRant/comments/mp4eol/how_do_people_not_contribute_in_group_projects/hnkdj7c/",
                  "text": "Just had this. I did it all and chose not to incorporate. I turned in my work next to a screenshot of the GitHub contributions. One guy had a whopping 2 lines.",
                  "author": "wolferdoodle",
                  "created": 1638859389,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1639870122
}