{
  "sid": "r06d41",
  "link": "/r/CollegeRant/comments/r06d41/have_i_messed_up_my_life/",
  "title:": "Have i messed up my life?",
  "text": "I am a high school junior right now. Im in a program where i get to go to a college and take actual college courses there. It is a lot more challenging than i thiught it would be and now im getting low Bs in those classes. I have a 3.5 gpa in my high school but i dont even know if thats good. One of my college classes dropped to a 76 because of my participation and its so hard to talk in that class because i cant even voice an original thought. I try to get close with all my teachers for connection and letters but i dont even think they like me because they dont try to get close with me. I envy the kids who can do that so effortlessly. I feel like my college gpa is going to tank in this first semester. I think i can maintain a 3.5 gpa in high school but im scared for my college gpa. Im scared that i wont be able to do good enough to get recognized in good colleges. I wish i could get help in my college classes but in that class no one will talk to me. The only time i talk to people is in my group but im mostly left out of the conversation and it sucks. Im so scared theat my college gpa is gonna be the reason i cant do what i want. I want to become a nuerosurgein but i cant think of any reason any college would like me. Sorry this turned into a rant but im hoping one of yall can awnser the question.",
  "author": "FinaleSuperbe",
  "created": 1637647013,
  "updated": 1639868884,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlvq6ku": {
      "link": "/r/CollegeRant/comments/r06d41/have_i_messed_up_my_life/hlvq6ku/",
      "text": "Hi friend, in short - nope! You haven't messed up your life, nor your chances at colleges or even at being a neurosurgeon. It's great that you're getting college experience already, but I would really try and focus on what you can get out of that now, to know what to expect later on. In college you have to be much more self-disciplined and self-taught, and unfortunately, yes you do have to put yourself out there. It is a different learning environment, so don't beat yourself up about not transitioning easily right away, in fact, its pretty usual for most first-year college students to have their grades drop before they acclimate to the learning style and environment.\n\nHonestly, once you're in college and gain experience high school doesn't really matter anymore. I'm a Junior at my university and transferred after completing my Associates at a community college; when applying for internships/research positions etc. my advisor and career consultant both told me that I didn't need to include any high school info in my resume since I had college experience already. Don't worry about high school grades or even first few college courses following you around forever.\n\nI'm also premed, so I understand the grade and general performance anxiety. 3.5 GPA is at the 90th percentile and will get you into great colleges! Do your best to maintain that for now, and remember college gives you a clean slate. One more thing you should know that if you are able to trend upward from your first year, that speaks much more about your strength as a student than individual grades per course. I hope this helps a bit, and please feel free to pm me if you want to talk/vent more :)",
      "author": "Inevitable_Account_",
      "created": 1637744499,
      "upvotes": 1,
      "replies": {}
    },
    "hlvwy2a": {
      "link": "/r/CollegeRant/comments/r06d41/have_i_messed_up_my_life/hlvwy2a/",
      "text": "I don't know your country, but there are great universities in America that will accept anyone who can sign a loan. I'm lucky I don't have to worry about GPA except for scholarships, but you should have plenty of time to up your GPA during undergrad years before applying for med school. Don't worry, just finish as strong as you can & start fresh next semester.",
      "author": "Gamerz1818",
      "created": 1637750186,
      "upvotes": 1,
      "replies": {}
    }
  }
}