{
  "sid": "qpavfz",
  "link": "/r/CollegeRant/comments/qpavfz/i_have_to_choose_between_two_great_colleges_and_i/",
  "title:": "I have to choose between two great colleges, and I CAN't FRICKIN DECIDE",
  "text": "Hello everyone! I'm 18F from India. Just graduated from high school with the following subjects: Economics, Pol Sci, Maths, History, and English. Lemme give you some background about the Indian Uni system for the Humanities.\n\nMost of the reputed and hence 'good' colleges are government institutes, that were established long ago. Private Universities generally tend to be an option for those who didn't get accepted into government universities. Admission to these government institutes is based purely on the aggregate percentage you've got in your final 12th-grade exam, and you have to decide before beginning uni what your major is. The norm is rote learning and traditional pen and paper exams. The professors are very similar to your average high school teacher, maybe a little better than that. There is really not much difference between the kind of education being offered at government institutes and most private universities. This was until some 6-7 years ago, a private liberal arts university was established in India. The university got some very hotshot academics to join them. The admission process is extremely holistic, and is very similar to the US, as it's based on three essays, LORs, and a panel interview. It's the first of its kind here and is slowly gaining a lot of traction. Its emergence has also led to more liberal arts institutes springing up in India.\n\n**Now,** I'm faced with a very difficult choice. I've gotten into the top (government) college in India for Economics (Hons), and I've also gotten into the above-mentioned liberal arts university. I'm a confused soul, so I'm not sure whether I want to do Economics or not. There is a possibility that I might end up doing it even if I go to the liberal arts college, but this could also just be my underconfident self's assumption.\n\nI'll list out the qualities of both the colleges:\n\n|COLLEGE 1 (Government)|COLLEGE 2 (Private Liberal Arts)|\n|:-|:-|\n|Old established institute, has a legacy|New, doesn't have a legacy|\n|Women's institute|Co-educational Institute|\n|Predecided major, will have to do Econ|Can decide major till the end of 3rd sem|\n|Extremely traditional pedagogy, no options to do minors/concentration in other disciplines|Can do minors/ concentration/electives in other disciplines|\n|Average Faculty|Stellar faculty|\n|Extremely selective|Not as selective|\n|3-year bachelors|4-year bachelors|\n|Very economical, INR 60,000 for the entire degree|Very expensive, INR 4,000,000 for the entire degree|\n|Academically lax|Academically rigorous|\n|Established alumni network|The Alumni network is almost nonexistent as the university is new|\n|Very limited research opportunities|Abundant research opportunities|\n|Rote learning, traditional question/answer exams|Assessment based on writing assignments, and paper submissions|\n|Better internships and jobs (at least in the corporate sector)|Job and internships opportunities are okay but not as great as the other uni|\n|Irregular classes|Very regular classes|\n|Great clubs and societies|Average clubs and societies|\n|Students are more focused on ECs|Students are more focused on academics|\n\nI've already attended 2 months of classes at the Pvt uni, and the faculty and courses really are amazing. But as soon as I got into this govt uni a couple of days ago, I've become very confused. **My heart is telling me to go to the liberal arts college, but my brain is telling me to go to the govt one. What do you think is the better option?**\n\n**TL;DR** \\- Got into a cheap well-established government uni with rigid and mediocre academic experience but easy job placements, and into an expensive new liberal arts uni with stellar academic experience but slightly unclear job prospects. What do I do?",
  "author": "Cinnabonbutterfly03",
  "created": 1636367557,
  "updated": 1636656362,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.72,
  "comments": {
    "hjtr958": {
      "link": "/r/CollegeRant/comments/qpavfz/i_have_to_choose_between_two_great_colleges_and_i/hjtr958/",
      "text": "Lmao you got into LSR didn't you?\n\n\nRegardless, does the private one provide refund?",
      "author": "pretentiousviv",
      "created": 1636392306,
      "upvotes": 2,
      "replies": {
        "hjx0ctv": {
          "link": "/r/CollegeRant/comments/qpavfz/i_have_to_choose_between_two_great_colleges_and_i/hjx0ctv/",
          "text": "Yeah, it's LSR vs Ashoka Uni. This year Ashoka does provide full refunds till 31st December.",
          "author": "Cinnabonbutterfly03",
          "created": 1636449121,
          "upvotes": 2,
          "replies": {
            "hk0x0kn": {
              "link": "/r/CollegeRant/comments/qpavfz/i_have_to_choose_between_two_great_colleges_and_i/hk0x0kn/",
              "text": "Tbh both are really good choices but looking via\n-access mostly (LSR is in North campus and ashoka in sonepat which is kinda in the middle of -)\n-fee structure and what it would fend like you could get better with the DU tag \n-what goes best for you as in the freedom of placement and/or research\n\nAlso, Economics Hons from DU is much more fruitful",
              "author": "pretentiousviv",
              "created": 1636515099,
              "upvotes": 1,
              "replies": {
                "hk2p0ez": {
                  "link": "/r/CollegeRant/comments/qpavfz/i_have_to_choose_between_two_great_colleges_and_i/hk2p0ez/",
                  "text": "I agree. Had I been sure about Economics, I would've gone to DU without much thought. But I'm not sure, hence the confusion. A little correction there tho, LSR is not in north campus. It's an off-campus college, and is nearer to south campus. But yeah I get your point, it's much more centrally located than Ashoka.",
                  "author": "Cinnabonbutterfly03",
                  "created": 1636556433,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}