{
  "sid": "pci5bv",
  "link": "/r/CollegeRant/comments/pci5bv/my_college_wont_allow_me_to_take_one_last_class/",
  "title:": "My college won’t allow me to take one last class to finish my second major",
  "text": "By the time of graduation next May, I will have 6 credits left to complete in order to meet my credit requirement. Luckily, I am able to walk with my class because my university offers early participation in commencement; however, I am only permitted to participate in graduation if there are no more than 8 credit hours remaining.\n\nBecause I am only 6 credits behind, I will earn my degree after taking the 8 credits. The issue is, I need 12 credits in order to complete my second major. This leaves one class that will keep me from finishing my second major. Do colleges make exceptions for these situations? If not, is it possible for me to finish my second major after I receive my degree? \n\nMost importantly, is it worth continuing classes in my second major if I can’t complete it? Or should I pick up a second minor instead? Thank you for your help, I am stressed to no end.\n\nTL;DR I will be one class short of completing my second major when I receive my degree.",
  "author": "kat3rt0t",
  "created": 1630047262,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hamogt8": {
      "link": "/r/CollegeRant/comments/pci5bv/my_college_wont_allow_me_to_take_one_last_class/hamogt8/",
      "text": "Can you clarify something?  Are you saying that when May comes, you'll have the 6 outstanding credits to complete for your primary major, **as well as** the 12 necessary for your second major?",
      "author": "DeskRider",
      "created": 1630113124,
      "upvotes": 2,
      "replies": {
        "hamsixr": {
          "link": "/r/CollegeRant/comments/pci5bv/my_college_wont_allow_me_to_take_one_last_class/hamsixr/",
          "text": "Poor wording on my part! I will have 12 credits left total to complete both majors.",
          "author": "kat3rt0t",
          "created": 1630115136,
          "upvotes": 1,
          "replies": {
            "hamue9n": {
              "link": "/r/CollegeRant/comments/pci5bv/my_college_wont_allow_me_to_take_one_last_class/hamue9n/",
              "text": "Okay; now it makes sense.    Thanks.",
              "author": "DeskRider",
              "created": 1630116085,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "halqm1n": {
      "link": "/r/CollegeRant/comments/pci5bv/my_college_wont_allow_me_to_take_one_last_class/halqm1n/",
      "text": "My school has the same rule!",
      "author": "renebeca",
      "created": 1630097261,
      "upvotes": 2,
      "replies": {
        "halquax": {
          "link": "/r/CollegeRant/comments/pci5bv/my_college_wont_allow_me_to_take_one_last_class/halquax/",
          "text": "See if you can graduate end of the summer. You might not be able to walk but you will have a second degree and that’s probably worth it. By the way 12 units is a full semester; that’s why they won’t let you take 12 units over the summer. At that point, you’re basically just graduating a semester late.",
          "author": "renebeca",
          "created": 1630097360,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "halp62x": {
      "link": "/r/CollegeRant/comments/pci5bv/my_college_wont_allow_me_to_take_one_last_class/halp62x/",
      "text": "If you receive federal aid it will only pay for what’s needed. That could be why they have that policy.",
      "author": "Longjumping-Touch-96",
      "created": 1630096648,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634061514
}