{
  "sid": "q2w0ka",
  "link": "/r/CollegeRant/comments/q2w0ka/im_a_computer_engineering_major_thats_failing/",
  "title:": "I’m a Computer Engineering major that’s failing Calc 1 and I’m worried. Any advice?",
  "text": "I’m a Computer Engineering major and I’m usually alright when it comes to math. It’s just that my calc 1 class is an 8am class on every day except Wednesday’s and sometimes I don’t understand the professor, because of his Asian accent and I just get lost in his class.\n\nI got a 46/100 on exam 1 and a 24/100 on the midterm which is exam 2 and I’m worried about the fact that I’m gonna have to take calc 1 again next semester, and how my parents would think about this F I have in the class.\n\nMy backup plan was to just take a virtual calc 1 class in the spring semester and make up calc 2 in the summer so that I can catch up and not be behind a semester in math. \n\nI also thought about just dropping this class and switching to another professor, and making up any missed assignments that I didn’t catch because I wasn’t in the new class, but the semester is already half way done, so I don’t know if that’s a good idea.\n\nI can’t drop the class and not replace it with something else because in my school, calc 1 is worth 4 credit hours and I’m taking 14 credits this semester, so i would not be a full time student anymore because the minimum credits you need to be a full time student are 12.\n\nI’ve never really had any Fs or Ds in middle school and high school and usually had a very high GPA so this would be my first class that I got an F on and I’m concerned.\n\nMy mom told me that it’s ok to fail in life as long as you try your hardest and that no one on this planet has succeeded in life without failure.\n\nI’m just worried about my class and wanted to vent to Reddit about what’s going on. Any suggestions??",
  "author": "measter02",
  "created": 1633562304,
  "updated": 1634093845,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hfnyg8s": {
      "link": "/r/CollegeRant/comments/q2w0ka/im_a_computer_engineering_major_thats_failing/hfnyg8s/",
      "text": "Retake the class. Sometime, you can do a lot better with a different professor.",
      "author": "beywill19",
      "created": 1633562624,
      "upvotes": 1,
      "replies": {}
    }
  }
}