{
  "sid": "kqa48a",
  "link": "/r/CollegeRant/comments/kqa48a/looking_to_speak_to_college_students_who_have/",
  "title:": "Looking to speak to college students who have experienced mental health issues",
  "text": "Hello all,\n\nMy name is Nour and I'm a psychology graduate from Columbia University. I am working on a research initiative to better understand mental health on college campuses. We are currently speaking to college students who are struggling or have struggled with a mental health related matter at some point during college. Our goal is to learn about your experiences to understand the needs of college students and better inform future services to meet those needs.\n\nWould you be open to speaking to us briefly for about 20 mins in the next few weeks? I would so appreciate your perspective, wisdom, and experience to help guide our efforts.\n\nIf you are willing to help us please let me know what times work with you via DM or you can directly schedule a call here: [**https://calendly.com/greblernoam/mental-health-in-college-campuses**](https://calendly.com/greblernoam/mental-health-in-college-campuses)\n\nI hope everyone is having a restful holiday and looking forward to meeting and speaking with you.\n\nKindly,",
  "author": "researchmentalhealth",
  "created": 1609771707,
  "over_18": false,
  "upvotes": 81,
  "upvote_ratio": 0.97,
  "comments": {
    "gi4py7m": {
      "link": "/r/CollegeRant/comments/kqa48a/looking_to_speak_to_college_students_who_have/gi4py7m/",
      "text": "This is pretty cool, DM’d!",
      "author": null,
      "created": 1609809232,
      "upvotes": 1,
      "replies": {}
    },
    "gi2pgjf": {
      "link": "/r/CollegeRant/comments/kqa48a/looking_to_speak_to_college_students_who_have/gi2pgjf/",
      "text": "To clarify, do you mean mental health in general or mental health directly associated with college? As in someone with a long term mental health issue, such as bipolar that isn't linked to college but can be affected by college, or something that is directly caused by college?",
      "author": null,
      "created": 1609774245,
      "upvotes": 37,
      "replies": {
        "gi6mr0z": {
          "link": "/r/CollegeRant/comments/kqa48a/looking_to_speak_to_college_students_who_have/gi6mr0z/",
          "text": "Both are okay! It doesn't have to be a mental health issue caused by college",
          "author": "researchmentalhealth",
          "created": 1609858398,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634061959
}