{
  "sid": "rbhet0",
  "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/",
  "title:": "All of my teachers assigned group projects and I’m the only one working on all of them. I can’t fucking do this all. No one is taking it seriously and my grades are suffering, my teachers don’t care and I’m just lost here.",
  "text": "I genuinely am considering dropping out. This is fucking surreal. I’ve brought these issues up and I’m getting brushed off.",
  "author": "AverageGuy16",
  "created": 1638933885,
  "updated": 1639517940,
  "over_18": false,
  "upvotes": 67,
  "upvote_ratio": 1.0,
  "comments": {
    "hnosbju": {
      "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnosbju/",
      "text": "Shit I have 4 projects due this week, 3 exams, and 4 separate courses that need to be completed. One of them was due 63 minutes ago and I have been working on it for 13 hours straight. \n\n&#x200B;\n\nSome of my professors are assholes, but others are just a bogged down with work as I am. I hate college with a passion. No sleep for me tonight, or tomorro, or the day after that come to think of it. \n\n&#x200B;\n\nyay",
      "author": "Careful-Relation-322",
      "created": 1638943480,
      "upvotes": 17,
      "replies": {}
    },
    "hnoxuhs": {
      "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnoxuhs/",
      "text": "I feel your pain man I haaaate group projects. My freshman and sophomore years I actually took a couple of my university’s research labs which are classes solely based on a culminating group project and the groups I got stuck with made it the worst experience ever lol. The first time I took one of these labs I got left with pretty much all of the work and creative planning, and then on the very last day when we were supposed to present the project “we” had been working on all semester (to the whole class as well as higher ups at the university AND community partners/sponsors) I was the only one in my group who showed. And I had to present it all myself lol, while everyone else had their groups. Needless to say I filled the fuck out of the peer evaluation forms. And got an A on our project. \n\nAll this to say don’t drop out! Maybe take a semester off if you need<3 you’re doing great and you can get through this!!",
      "author": "westcoastjade",
      "created": 1638947769,
      "upvotes": 10,
      "replies": {}
    },
    "hnp2qqm": {
      "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnp2qqm/",
      "text": "Why in the actual fuck are they assigning group project with the semester ends next week??",
      "author": "DumbHuman53",
      "created": 1638951888,
      "upvotes": 9,
      "replies": {
        "hnq1wvj": {
          "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnq1wvj/",
          "text": "I have finals this week and on Friday last week we were given a surprise group project due the day before our final. I don't fucking get it.",
          "author": "cabbage-soup",
          "created": 1638975464,
          "upvotes": 5,
          "replies": {
            "hnqq5v9": {
              "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnqq5v9/",
              "text": "Oh c’mon! That’s insane",
              "author": "DumbHuman53",
              "created": 1638985161,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hnq1wdt": {
          "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnq1wdt/",
          "text": "Idk if this is the reason but at my university, certain majors are required to have field experience or a group project each semester. And since professors are too lazy to coordinate field experience they just tack on last minute group projects so they don’t violate the policy. Really annoying and frustrating",
          "author": "junocereal",
          "created": 1638975459,
          "upvotes": 3,
          "replies": {
            "hnqpwty": {
              "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnqpwty/",
              "text": "Woooow, that’s shitty of them.",
              "author": "DumbHuman53",
              "created": 1638985063,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnplm6d": {
      "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnplm6d/",
      "text": "Some Ideas: \n\n* If it is not too late and you are overwhelmed apply for an extension\n* communicate with your group members through email being specific about what you are doing to contribute to the project.  Even if you see them in class email after a conversation and say \"just to confirm our conversation, I have done x,y,z and as of today you have not completed any part of this project or you were supposed to do a,b,c,\" whatever the case is.  You want to have paper trails for all of this.\n* Once you have emails, also try contacting your professors again and say I am receiving no cooperation from group members.   You can attach your emails from your group members.\n* If your professors are still not willing to be of assistance, you can go over their head to the deans (however be mindful if you will ever need to take a class with them again)  \n\nI would do the best I could, maintain all this evidence and a contact log for group members and professors and then use this as evidence if I was unhappy with my grade in the end.  \n\nThis obsession with group work is ridiculous and is bandied about as \"something you will have to do in the real world\"  In reality, only certain careers have project type work that you all have to work on the same thing and turn it in together AND  you are paid to put up with other people's bullshit at work, instead of in college you are paying to be there.   I am old (almost 60) and I have never had to work on a group project in a work environment that functions (or doesn't) in any way shape or form the way academic classes set them up.  \n\nWe all know why this is being done and it has nothing to do with preparing you for work life.",
      "author": "janeandprudence",
      "created": 1638967173,
      "upvotes": 5,
      "replies": {}
    },
    "hnpyk50": {
      "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnpyk50/",
      "text": "Since it is too late to drop the class, I recommend you do the following:\n\n1. Contact the professor regarding the specific issues. Document them dispassionately and professionally. Save a copy of the email and their responses. \n2. Contact your group members every day via email. Work with the ones who respond. Note the ones that don't and how often you contacted them.\n3. Do the fraction of the project you were required to. That is, if it is a group of three, do a third of the assessment, and turn in, along with your assessment, the documentation to the prof and to the other gorup members. \n\nif they refuse tomark you as an individual, then go through the formal grade appeal process, and keep appealing, using the emails as evidence. At the very least they should re-mark or open the assessments back up for you. \n\nYou may also wish to go to the Dean of student, the student union and the discipline dean to ask advice on moving forward.",
      "author": "ourldyofnoassumption",
      "created": 1638973973,
      "upvotes": 4,
      "replies": {}
    },
    "hnp578k": {
      "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnp578k/",
      "text": "I miss my high school life. People sitting in small rooms and learning new stuff. College?? 200 sitting in a hall and gain nothing close to a 15 minute video on youtube.",
      "author": "Ok_Scientist_691",
      "created": 1638954058,
      "upvotes": 7,
      "replies": {}
    },
    "hnpstv9": {
      "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnpstv9/",
      "text": "Just hang in there, think of the reward",
      "author": "TheJazmineRose",
      "created": 1638971191,
      "upvotes": 1,
      "replies": {}
    },
    "hnscssm": {
      "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnscssm/",
      "text": "It’s not your profs responsibility to ease the burden of work. They should give you extensions tho",
      "author": "cbdinfusedcocaine",
      "created": 1639008250,
      "upvotes": 1,
      "replies": {
        "hnxohxq": {
          "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/hnxohxq/",
          "text": "Isn't that easing the burden slightly?",
          "author": "lkmk",
          "created": 1639103318,
          "upvotes": 1,
          "replies": {
            "ho1gcm1": {
              "link": "/r/CollegeRant/comments/rbhet0/all_of_my_teachers_assigned_group_projects_and_im/ho1gcm1/",
              "text": "Like teachers aren’t responsible for divvying up the work within groups",
              "author": "cbdinfusedcocaine",
              "created": 1639172705,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}