{
  "sid": "nfqamn",
  "link": "/r/CollegeRant/comments/nfqamn/i_hate_community_college/",
  "title:": "I hate community college.",
  "text": "Academic wise it's going great but holy crap I hate living at home. My parents treat me like a fucking child at 21 years of age.\n\n*  I can't go out\n* And if I do go out they ask me if i'm hanging out with girls\n* They yell from across the other side of the house (we live in a small house, there is no need for yelling at all)\n* They come into my room whenever they want and they don't even knock on the door.\n* My mom overreacts to the littlest of things. \n\n The usual over protective parent bull shit. Like wtf.\n\nI also feel like i've been missing out on the whole college experience. The past 3 years of my time in community college i've been living with parents doing the same routine. I graduated high school in 2018. Since then, I've been seeing all my friends live in the dorms, partying, going on adventures, meeting new people etc....while i'm stuck at home. I thought this feeling of FOMO would have gone away by now (currently in my third year of CC) but it's still here lingering. \n\nNot only that but even when I go on college tours or look up college related things on youtube it seems like it's just filled with freshman.  I feel like there is barely information out there for transfer students. \n\nI applied for the fall 2021 term and I recently got wait listed to my dream school, ucsd. I'm thinking about spending another semester at community college, but the thought of spending more time living with my parents irk me. Not only that but if I spend another year at CC, then by the time I transfer I'll be 22 years old. I'll see all my friends from high school already graduate while I'm just getting started. Not only that but would I even be able to join a frat at 22? Will it be weird if all my friends are 18? I feel as if I would a freshman all over again from the excitement of living at the dorms and all that stuff. \n\nBut at the same time I already got accepted to ucsc and i'm thinking about going just so I can move out. I hate the campus and I don't like the major that I got accepted to but maybe it's worth it so I can move out of my parents house. I'm not sure if I should just bite the bullet and transfer to ucsc even though I would not like it there.",
  "author": "tha_oz",
  "created": 1621382382,
  "over_18": false,
  "upvotes": 36,
  "upvote_ratio": 0.96,
  "comments": {
    "gyq7ipt": {
      "link": "/r/CollegeRant/comments/nfqamn/i_hate_community_college/gyq7ipt/",
      "text": "Man at least u got a room I sleep on the couch in the living room ^^",
      "author": "End_My_Existence_Pls",
      "created": 1621449101,
      "upvotes": 1,
      "replies": {}
    },
    "gyogwo8": {
      "link": "/r/CollegeRant/comments/nfqamn/i_hate_community_college/gyogwo8/",
      "text": "Okay...lemme share some of my experience to hopefully make you feel less alone.\n\nI went to college at 18 like everyone else. It was a small, liberal arts college. I made friends quickly and felt happier than I'd ever been. Granted, I was also extremely stressed with the workload. Within three months, I went from having a handful of wonderful friends to having none. Everyone at that school partied (& I mean that's the main thing they cared about). They were cliquey and gossiped like it was high school all over again. There was hazing (surprise, surprise). I had no privacy and ended up having a falling-out with my roommate. My suitemates bullied me on social media (& were rude to me IRL). I was left in the top floor dorm room during a small fire and the faculty just shrugged when they found out. No one woke me up.\n\nSo I left after a semester. Do I regret it? Well, yeah. I really do. But only because I have some idealized version in my head. I know the FOMO is real. I'm transferring at 22, almost 23, back to a 4-year college and have watched everyone my age thrive in their social and academic lives. They're all graduating next year and I'm only going to be a junior *IFFFFFFF* I can jam in enough credits without overdoing it. I have hated living at home and feel similarly to you, but college is not the heavenly environment that it's made out to be. You will be glad that you spent those extra years at home saving money with CC and maturing before going off on your own. And fuck anyone one says it's \"weird\" to be older in college. It's not. Not everyone has the same timeline in life. At my small LAC, I had a two 50-60 year olds in my class. Guess what? My classmates loved them. No one judged them at all. They were the only older people I met but you certainly would meet more non-traditional and older students if you went to a bigger school (which I recommend for many reasons).\n\n>I hate the campus and I don't like the major that I got accepted to but maybe it's worth it so I can move out of my parents house.\n\nDon't do this. You hate the campus and the major. Don't go. Just wait. A year sounds like a long time but it's not. I've been saying every year that I'd go to a college I don't like just to move out and I haven't. It hasn't been that bad and I've actually worked a lot on maturity and overall health during that time. A year is not worth spending 2-4 (however long you have left) years at a campus you don't like in a major your hate.\n\n&#x200B;\n\nETA: Plus, CC classes are easier in most cases. My classes at a four-year were 10x more overwhelming and tedious. I have loved my classes at CC and, again, they're much cheaper. Plus, the people you meet are from all walks of life. Don't rush your college experience. & just because you don't have the typical one, it doesn't mean you're missing out. Trust me...living in a moldy old dorm where the AC rarely worked and there was BLACK MOLD in the shower that my suitemates refused to clean was not enjoyable. There were funny times in there for sure but it wasn't worth it.\n\nPM me if you need anything or have any concerns about CC, transferring, the \"college experience,\" etc. I was only at a four-year for a semester but it felt like years. Been at CC for >3. Was going to transfer this fall to get away from home. Now decided to wait a year to go to a different college.",
      "author": "roseyelephant33",
      "created": 1621419705,
      "upvotes": 3,
      "replies": {}
    },
    "gynoixb": {
      "link": "/r/CollegeRant/comments/nfqamn/i_hate_community_college/gynoixb/",
      "text": "Saw a post on facebook of someone who was 50 who joined a frat because he wanted to fit in when he decided to get his degree at such a late age. They accepted him and he seemed to have made some good friends (and memories)",
      "author": "cabbage-soup",
      "created": 1621397231,
      "upvotes": 2,
      "replies": {}
    },
    "gyn1cnl": {
      "link": "/r/CollegeRant/comments/nfqamn/i_hate_community_college/gyn1cnl/",
      "text": "\nI’m really sorry you’re going through this, and I can only imagine how exhausted you must be, trust me I know the feeling. \n\n\nDon’t worry about missing out on parties, and all the college experience. Don’t look at your age as a factor, it does not matter. \n\nYou might be a little older to join a frat, I know some frats are 18-22 or 23. It really depends. \n\nDon’t worry, you’re not missing out on much. \n\nI know exactly how you’re feeling. I graduated high school in 2016 and instead of going to a university because I got waitlisted, I decided to apply for a community college. \n\nSure I hated it a little, but I made so many amazing friends who I still talk to this day. \n\nI finally graduated from that community in May 2020, and I also got accepted into the University that I wanted to go. I already completed one year here. \n\nI lived with my mother all those years in community college, it was exhausting. She yells a lot, we’re always fighting about everything, she treats me like a child and wouldn’t let me go out. \n\nShe even started tracking me ever since she found out about “find my iPhone”. \n\nOnce I got into university, I moved into an apartment owned by the school. I fucking love it! Having my own room and bathroom, no annoying siblings to fight with. No mother to yell at me. \n\n\nThe college you got accepted into, don’t go just to get away from your parents. You already said you hated the campus and the major, by the time you start there it’s gonna make your college experience shit. \n\nTry applying for another university you might be interested in.\n\nI really do hope you get into your dream school. \n\nIn the meantime, have you thought about getting your own place or looking to move in with people? If you have the money for it.",
      "author": "JkLion1998",
      "created": 1621385438,
      "upvotes": 13,
      "replies": {
        "gynamqs": {
          "link": "/r/CollegeRant/comments/nfqamn/i_hate_community_college/gynamqs/",
          "text": "Hmmm yeah I feel your pain lol. \n\nI think it's in my best interest to go to a school that i'll be happy at and for the major that I want. I think it will be worth staying at home, plus my parents aren't that bad ALL the time. Still slightly annoyed though. All in all, i'll be alright lol. There's kids in worse situations than I am in.",
          "author": "tha_oz",
          "created": 1621390037,
          "upvotes": 5,
          "replies": {
            "gync6e7": {
              "link": "/r/CollegeRant/comments/nfqamn/i_hate_community_college/gync6e7/",
              "text": "Ok good, well I wish you good luck with everything!!",
              "author": "JkLion1998",
              "created": 1621390809,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gyn13pp": {
      "link": "/r/CollegeRant/comments/nfqamn/i_hate_community_college/gyn13pp/",
      "text": "hi, just checking in from the last thread\n\nidk if staying at home will be beneficial if your gonna be facing this stacked FOMO.\n\nlike with places opening up your just gonna be seeing it all again for another year.\n\nit sounds like UCSC may be a saving grace, and you can change your major when you get there if needed :)",
      "author": "TheDovahkin",
      "created": 1621385318,
      "upvotes": 2,
      "replies": {}
    },
    "gymvfmq": {
      "link": "/r/CollegeRant/comments/nfqamn/i_hate_community_college/gymvfmq/",
      "text": "You just need to move out now, no matter what. Go be an adult.",
      "author": "MaiaOnReddit",
      "created": 1621382490,
      "upvotes": 11,
      "replies": {
        "gynghhw": {
          "link": "/r/CollegeRant/comments/nfqamn/i_hate_community_college/gynghhw/",
          "text": "See I need to do that too. I’m too worried about compulsively saving money. I’m not even in school.",
          "author": "2valve",
          "created": 1621392965,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634062666
}