{"sid": "m6fos1", "link": "/r/CollegeRant/comments/m6fos1/why_are_there_tour_groups_going_through_rooms/", "title:": "Why are there tour groups going through rooms where people are taking exams?!", "text": "I don’t think I’ve ever been this livid at my school before. COVID shut down most of our library so there’s two rooms. One, the normal study area where people can talk in and the two, the quiet room where people use the school computers to take exams.\n\nFor whatever reason my school had the bright idea to send tours through this room and have them stop for 3-5 minutes and loudly talk about how this is, “the quiet area where many people who don’t have computers at home can take exams.” Seriously? I get that the tours are scripted, but how can you say this and not realize that you’re disturbing a room of 30 people trying to pass their midterms?\n\nI probably failed my midterm because I ran out of time waiting for them to leave fml\n\nEDIT: I contacted the library and my professor  and explained the issue to them. Hope things change. For clarification about 8-10 tour groups came through the room and there was no warning whatsoever that it was going to happen.", "author": "Substantial-Method93", "created": 1615919028, "retrieved": 1632950247, "over_18": false, "upvotes": 276, "upvote_ratio": 0.99, "comments": {"gr7ilrm": {"link": "/r/CollegeRant/comments/m6fos1/why_are_there_tour_groups_going_through_rooms/gr7ilrm/", "text": "I would’ve got up and said get out. I’m a full ass grown adult who pays money for this? Nah ur gonna hear it from me. And I have done it before. I hope more students speak out when it happens too.", "author": "Hawkbiitt", "created": 1615958622, "upvotes": 5}, "gr7evbs": {"link": "/r/CollegeRant/comments/m6fos1/why_are_there_tour_groups_going_through_rooms/gr7evbs/", "text": "Tell the Dean, the admissions dept and the provost. That’s ridiculous for them to still make a tour out of students actually trying to concentrate on a timed exam.", "author": "AXXII_wreckless", "created": 1615955872, "upvotes": 3}, "gr6rodt": {"link": "/r/CollegeRant/comments/m6fos1/why_are_there_tour_groups_going_through_rooms/gr6rodt/", "text": "This sounds like something the office of accomodative services or a student success center would like to hear.", "author": "gracefulspork", "created": 1615942521, "upvotes": 13}, "gr6qe4j": {"link": "/r/CollegeRant/comments/m6fos1/why_are_there_tour_groups_going_through_rooms/gr6qe4j/", "text": "You definitely should talk to someone about this. It definitely can be rectified", "author": "TheNorthernQueen", "created": 1615941846, "upvotes": 14}, "gr5scv8": {"link": "/r/CollegeRant/comments/m6fos1/why_are_there_tour_groups_going_through_rooms/gr5scv8/", "text": "I'm not at my college campus this semester so IDK if that happens there. However, that was very disrespectful of your college's tour guides to do that. They could've maybe only showed the entrance to the study area instead of going inside and bothering students. I would speak with your professor to tell him/her to give you an extension in your exam and maybe talk to the ppl in charge of those tours like a dean or something. Good luck.", "author": "Oro-Lavanda", "created": 1615925167, "upvotes": 59}, "gr5qvfd": {"link": "/r/CollegeRant/comments/m6fos1/why_are_there_tour_groups_going_through_rooms/gr5qvfd/", "text": "Tell your professor what happened, and speak to one of the librarians about it. Whoever organizes these tours needs to know that tour guides are doing this and ensure that it doesn’t happen again.\n\nDon’t go straight to any dean about this because this issue is below the level that deans usually address.", "author": "PhDapper", "created": 1615924484, "upvotes": 107}, "gr5ppc4": {"link": "/r/CollegeRant/comments/m6fos1/why_are_there_tour_groups_going_through_rooms/gr5ppc4/", "text": "Bring this to the Dean", "author": "you90000", "created": 1615923952, "upvotes": 27}}}