{
  "sid": "pr1ibf",
  "link": "/r/CollegeRant/comments/pr1ibf/why_is_it_so_hard_to_find_people_of_the_same/",
  "title:": "why is it so hard to find people of the same major as mine?! calling all secondary education majors. 😭",
  "text": "tl;dr: i’m having trouble finding people with the same major as mine. i really wanted to start a discord or something! pls, it’s so hard finding them at my school, i just wanted to create a small community of my major because we shouldn’t be so tiny. comment if you share the same major as me, so i know y’all exist 🥲 honestly just seeing any kind of grade level major is enough for me because i’m so alone ugh.\n\nokay, long story short, i am majoring in secondary education mathematics.  basically means i’m trying to become a high school teacher in mathematics.\n\nwhen i tell you it is extremely hard finding people with the same major at my uni. which is bizarre because my uni is supposedly known for having the “one of the best teaching programs.” well then where are all of your applicants?? 😭\n\nplease i wanted to make friends with the same major. at this point i’ve resorted to elementary school majors, which i don’t see as a problem, but i also feel it’s just not the same. similar but not the same.\n\nmy uni does this thing where you can choose the dorm building that most people of your major lives. nope that didn’t work, i’m not even dormed with elementary school majors - they’re clumped in another building. my entire hallway and below is some sort of nursing/animal science/pre-vet mixture and there is literally no education major on my hallway besides me.\n\nplease do y’all exist? 😭",
  "author": "boredbbqribs",
  "created": 1632026796,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hdr17r4": {
      "link": "/r/CollegeRant/comments/pr1ibf/why_is_it_so_hard_to_find_people_of_the_same/hdr17r4/",
      "text": "Me as a former ecology major 💀🤚",
      "author": "Sincere_Chair",
      "created": 1632250042,
      "upvotes": 1,
      "replies": {}
    },
    "hdlitle": {
      "link": "/r/CollegeRant/comments/pr1ibf/why_is_it_so_hard_to_find_people_of_the_same/hdlitle/",
      "text": "I'm a secondary education major with a focus in biology! I definitely feel you, I don't think I've ever met someone with a similar major at my campus.",
      "author": "chloeaugustine",
      "created": 1632149864,
      "upvotes": 2,
      "replies": {
        "hdnrygv": {
          "link": "/r/CollegeRant/comments/pr1ibf/why_is_it_so_hard_to_find_people_of_the_same/hdnrygv/",
          "text": "would you be interested in joining a discord of mine? i was under the impression of finding my major easily and made a server but i was wrong 😭 that’s if you’re into things like anime and stuff, but i’ve created a study session area and other sections",
          "author": "boredbbqribs",
          "created": 1632184507,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hdid4lz": {
      "link": "/r/CollegeRant/comments/pr1ibf/why_is_it_so_hard_to_find_people_of_the_same/hdid4lz/",
      "text": "Probably because Secondary Ed is most likely not as popular?",
      "author": "genericusername_____",
      "created": 1632084593,
      "upvotes": 5,
      "replies": {
        "hdj38kf": {
          "link": "/r/CollegeRant/comments/pr1ibf/why_is_it_so_hard_to_find_people_of_the_same/hdj38kf/",
          "text": "i know that 😭 that’s why i’m ranting. it just sucks. 😔",
          "author": "boredbbqribs",
          "created": 1632096185,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfrolz7": {
      "link": "/r/CollegeRant/comments/pr1ibf/why_is_it_so_hard_to_find_people_of_the_same/hfrolz7/",
      "text": "Secondary Ed Major-English here! I am fortunate enough to go to a school that has an extremely large percentage of Ed Majors. It was definitely hard to find other people with this major at the last campus I attended, but once you do some searching, you will have some super close friends.\n\nI was also looking for a discord server for education majors. No such luck! Someone should start that.",
      "author": "philtato01",
      "created": 1633636458,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634061885
}