{"sid": "ni6nau", "link": "/r/CollegeRant/comments/ni6nau/i_failed_myself/", "title:": "I failed myself.", "text": "Ever since I took Biochemistry 1 last summer I've been in love with the subject. It would take most of my time. I'd write a lot of notes, make my own flashcards. Study online exams. These are all stuff I've never done for any other subject. I loved Biochemistry and I even had plans to study Masters and maybe even PhD! \n\nMidterm comes around. I'm very confident. I understand the material, I have memorized what needs memorizing\n\nThe exam was quite harder than I've anticipated but it's fine! I was still positive about getting a 25/30 at least which is not that bad\n\nGrades come out and well.. I got 14/30 \nThat hurt me so goddamn hard.\nIt sucked \n\nI feel like I've failed myself, something that I've really loved and gave my best was one of my worst grades ever.. maybe I'm just not good enough for college \n\nTL;DR : Got 14/30 on my Biochemistry midterm and I need to reconstruct my whole life plan", "author": "Wibtb", "created": 1621642801, "retrieved": 1632842338, "over_18": false, "upvotes": 44, "upvote_ratio": 1.0, "comments": {"gz06747": {"link": "/r/CollegeRant/comments/ni6nau/i_failed_myself/gz06747/", "text": "Thank you u/Wibtb for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1621642801, "upvotes": 1}, "gz26odm": {"link": "/r/CollegeRant/comments/ni6nau/i_failed_myself/gz26odm/", "text": "I'm in the same boat I can understand and do the classwork without much issue but when it comes to these tests/quizzes i fail them and then my entire grade for the class drops", "author": "mingxingai", "created": 1621695122, "upvotes": 2}, "gz0n3k9": {"link": "/r/CollegeRant/comments/ni6nau/i_failed_myself/gz0n3k9/", "text": "You failed an exam, you didn't fail yourself. There's no reason to go nuclear and flip your life upside down. If you love biochem then learn from what you did wrong, see what you can do better next time, and keep going. One bad exam isn't the end of the world. I've messed up plenty of times and failed my fair share of assignments. Still graduated. Still got into graduate school. Still study what I love. \n\nAs long as you learn from what went wrong and do better, you aren't failing yourself. If you give up something you love because you screwed up this one time, that's failing yourself.", "author": "BrainsOnFire1617", "created": 1621652424, "upvotes": 8}, "gz0jtqs": {"link": "/r/CollegeRant/comments/ni6nau/i_failed_myself/gz0jtqs/", "text": "I’m a biochemistry major and I got a D biochemistry my first time. It honestly broke me because I loved the subject as well and I had a good grade before the midterm. It unfortunately put me back a whole year due to some classes only being offered in the fall and biochem being a prerequisite. I’m taking it again in the fall and I’m nervous but I also took a different upper level chemistry class this past semester and got a B. Looking back I wasn’t prepared for the class but I’m ready to try again and make a much better grade. \n\nI also had plans for grad school but after a bad semester my gpa is a bit lower than what it should be and it made me reconsider my future. Think about whether it is something you would really enjoy. Speak with professors and throw yourself into a research lab if you can to see if it is really something you love doing. Getting one or a couple low grades is okay and shouldn’t mess up everything! Keep your head up and goals in mind. \n\nBest of luck!", "author": "holaranas", "created": 1621650500, "upvotes": 7}, "gz0jk7i": {"link": "/r/CollegeRant/comments/ni6nau/i_failed_myself/gz0jk7i/", "text": "It is only natural to feel the emotions that you have. If Biochemistry is something you are passionate about, this is not a failure. We are going to have roadblocks in life and it might feel like you will hit a dead end, but don't give up. Don't be afraid to fail. Recognize and accept your emotions, never make it personal, and use this situation as a way to improve. You got this!", "author": "Natural_Process_2011", "created": 1621650346, "upvotes": 5}, "gz0aaq2": {"link": "/r/CollegeRant/comments/ni6nau/i_failed_myself/gz0aaq2/", "text": "I love philosophy. I could read about philosophical theories all day. But when it comes to explaining my understanding to professors…they politely tell me I don’t understand at all, lol. Also, try to reach out to your professor if possible. Being passionate about something means you’re willing to work through your struggles, I think.", "author": null, "created": 1621645061, "upvotes": 26}}}