{"sid": "ns7q9r", "link": "/r/CollegeRant/comments/ns7q9r/international_student_rant_fall_21/", "title:": "International Student Rant | Fall 21", "text": "I'm tired. There's just so much going on. Being an international student going to a #200ish ranked school for their undergrad in business, I've so much to deal with. First, the VISAs. Only two embassies are open in my country with severe backlogs. I'm scared that I won't get my VISA in time to attend uni this fall. One good thing is that, my uni has agreed to keep my scholarships intact and given me an option to defer my enrollment to the spring semester.\n\nThe amount of anxiety the VISA process is giving me is just the tip of the iceberg. I was a foolish optimist when I started the admission process. I had good grades (Stats: 93.6% in my 10th grade a.k.a Sophomore year and 95.6% in my 12th grade a.k.a Senior year), along with good ECs (I was a part of the National Cadet Corps that's similar to the Junior R.OT.C program in the US, and I was awarded the best cadet nationally one of the years. I was also passionate about social justice, was the president of the student government, won many debate competitions, and even was the sole representative of the country in a conference hosted by a foreign govt). \n\nI genuinely thought with my ECs, grades and my essays(SOP on how I tried helping a friend fight child marriage) could make me a competitive applicant to top schools. There began my college search. Coming from a modest socio-economic background where my family's combined annual income is around $10,000, severely limited the schools I could apply to. The schools which gave generous aid to international students where need aware and extremely competitive. I applied to Harvard, Princeton, Yale, Brown, NYU and a couple of others with hope. However, I got rejected by all these schools and got into 3 Schools. 2 of these schools gave me partial aid which still made the education above my means. \n\nI've finally committed to a school that gave me a generous full tuition scholarship along with a partial scholarship on room and board. All of this combined with on campus employment for 20h/week would make my education affordable. The school seems great, I had a lovely time talking to the admissions officers, the professors and even some of the students! They all seem to care a lot. However, I'm still a little sad that school isn't ranked as high as what schools I'd normally aimed for. \n\nI'm a little scared of fitting in socially and culturally. There is an office for international students that give them support and there is also a small diverse international student body, although almost very few from my nation (or so I think). What if I find trouble in making friends? What if I don't fit in? I've opted to dorm in college, and would be assigned a roommate in a couple of weeks. I'm anxious about getting to know him and the local student body as well. \n\nAll of this is last minute jitters and cold feet, I hope. When I was in the process of applying, I was sure that studying in the US is what I want and would help in my personal and professional growth. But now, so much of self doubt has crept in. I've even started worrying about prospective employment and the VISA restrictions (I've work authorisation for a year before I need to get an H1B). I've been super low. Super anxious.\n\nAfter all, I'm just a 19 year old that's travelling half way around the world to pursue his dreams. In the end of this tunnel, that I'm currently traversing with great perseverance, I hope there's some light. Some light that would guide me and mould me into the best version of myself. \n\nEnd of rant.", "author": "Caffeinated_Dreamer2", "created": 1622820271, "retrieved": 1632949748, "over_18": false, "upvotes": 15, "upvote_ratio": 0.95, "comments": {"h0tfjvp": {"link": "/r/CollegeRant/comments/ns7q9r/international_student_rant_fall_21/h0tfjvp/", "text": "Which college are you in? And sab theek ho jayega you've got a great offer overthink mat karo", "author": "gambhirmamla", "created": 1623002020, "upvotes": 2}, "h0lxx10": {"link": "/r/CollegeRant/comments/ns7q9r/international_student_rant_fall_21/h0lxx10/", "text": "You wont be able to find a job majoring in business.", "author": "allgone6996", "created": 1622838133, "upvotes": 1}, "h0l19rh": {"link": "/r/CollegeRant/comments/ns7q9r/international_student_rant_fall_21/h0l19rh/", "text": "I got into Stanford and Im still so fucking anxious about getting H1B after graduation. The whole system is so broken", "author": "Nice_Dimension5454", "created": 1622824204, "upvotes": 5}}}