{"sid": "i947e4", "link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/", "title:": "My school is requiring Web Cam and Browser Anti-Cheat Program", "text": "I don’t mind the anti-cheat program, but I don’t like the idea of being stared at directly or listening to me while I do a test. \n\nPlus my computer is a Desk Top with no web cam, so I’ll have to buy one. \n\nAlso not too keen having a camera in my room that can be activated without me knowing. Just bothers me down to my core. \n\nDoes it bother others? I’d like y’alls input as I’m considering dropping out for a few semesters until people can return to classrooms. In the meantime I can go work and begin paying my loans.", "author": "fucuasshole2", "created": 1597339677, "retrieved": 1632842940, "over_18": false, "upvotes": 127, "upvote_ratio": 1.0, "comments": {"g2fkfnd": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g2fkfnd/", "text": "Welp. This semester I don't have a windows laptop because it got damaged. I really hope my professors don't make me use Lockdown. So far at least one professor said all we need is a phone and a calculator which seems overly generous. Wonder how the rest of them will play out.", "author": "AzrielK", "created": 1598083069, "upvotes": 2}, "g1w2822": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1w2822/", "text": "Transfer all your files into an external hard disk if you're worried about a virus.", "author": null, "created": 1597688517, "upvotes": 1}, "g1w22ez": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1w22ez/", "text": "Well, it does make sense to have a camera on while taking an online test. That's how I wrote my finals last semester from home. \nIt's alright. If you're worried anyone can switch your camera on, just cover it with tape and take it off only when you're writing the test!", "author": null, "created": 1597688442, "upvotes": 1}, "g1gix7d": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1gix7d/", "text": "My school’s switching to a different platform to implement anti-cheat measures. The deeply petty side of me just wants to make it as uncomfortable as possible. You’re recording me? Well I make weird faces and sing horribly while I take online tests. Oops, accidentally rubbed cooking oil into my webcam and now all recordings of me look like a fever dream.\n\nI know it won’t actually do anything but the temptation is there.", "author": "sans_serif_size12", "created": 1597423763, "upvotes": 2}, "g1g3bp7": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1g3bp7/", "text": "I wonder if you could just take the test and run the program inside a virtual machine. Then the program could only see the files on the virtual machine and you could easily delete it when you were done", "author": null, "created": 1597416637, "upvotes": 2}, "g1foo70": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1foo70/", "text": "As far as it being activated without you knowing, you can always unplug it unless you’re testing. I wouldn’t be too worried about it. If someone wants to watch you, they will through any technology you already have , but most likely they don’t want to.", "author": "cmcgee19", "created": 1597408554, "upvotes": 1}, "g1eyqs0": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1eyqs0/", "text": "I had to use Proctorio for the summer semester and it was utter garbage. It kicked me out literally every single test because the stupid room scan always froze up.", "author": "WashiBurr", "created": 1597385365, "upvotes": 1}, "g1evspz": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1evspz/", "text": "This is more proof that college is a scam.", "author": null, "created": 1597383016, "upvotes": 3}, "g1e8puq": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1e8puq/", "text": "I hate this so much, it takes the fun out of learning ( which i have completely lost) and now I am beimg violated by an instution ( as if this didnt happen enough) really considering getting a crappy laptop for school instead of my new one. Dont want more malware on my pc.", "author": "chicityhopper", "created": 1597369021, "upvotes": 11}, "g1e4ic2": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1e4ic2/", "text": "Our school is doing same thing. Some classes are in person and one online while I’m on campus. For the desktops, helps having a USB webcam. Use it during class. Once class is over, unplug it and it won’t work till plugged back in. Also Ik at my university, they’re giving students cameras that can’t afford one.", "author": "Shmiginnis", "created": 1597366648, "upvotes": 4}, "g1e3xja": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1e3xja/", "text": "That's super creepy, makes me glad I graduated last year.\n\nIn general though, I really think colleges have gotten too obsessed with cheating even before coronavirus. If they focused on measuring learning and competencies instead of using high stakes testing that measures basically nothing it would make cheating less of a concern.", "author": "squirrel8296", "created": 1597366329, "upvotes": 10}, "g1da8sn": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1da8sn/", "text": "It sounds like they are having you use external webcams. Is it connected wirelessly or do you have to plug it into a power source for it to work? Edit: I have a kind of shitty resolution webcam that only l works if it’s plugged Into my computer. So as soon as class is over I disconnect it", "author": "loopyarms", "created": 1597351464, "upvotes": 5}, "g1d5kfm": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1d5kfm/", "text": "Never had an Honorlock test? My college has done this for a while for online classes", "author": "warrior15678", "created": 1597349268, "upvotes": 7}, "g1d3ay8": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1d3ay8/", "text": "Honestly the most irritating thing for me is that the majority of my professors are older and generally very technologically iliterate.  This makes any online process so much more tedious, and being constantly surveiled doesn't help at all.  Plus, like you said, it's a huge privacy violation that we're expected to just accept.  \n\nI know people will hate me for this, but I think probably one of the best ways to combat cheating is just make the tests harder.  One of the reasons cheating is so easy is because hundreds of thousands of exam questions are in a database somewhere, and professors often don't have much part in writing their own questions.  They just choose questions from a database and then are flabbergasted when students find the answers online.  I think if institutions really want to prevent cheating, writing very difficult exams is a way to do so.  I understand that students would be upset, but it's easy to curve a grade.  I had one class last semester like this.  The exams were extremely difficult, and most of us were struggling to get barely above 60% on exams, with many of us barely scraping by with 50%.  But with the curve at the end, 50% was the minimum passing grade, so it all evened out.  To me, this makes the most sense.  Having a test that's a little \"too hard\" for most average students is still ok.  You can still use it as an indicator of progress, just with a different scale (the curve).  Also, this class was pretty hard to cheat in and the homework was hard to complete, even with full internet access.  I have seen lots of students complaining about stuff like this, and I don't think the complaints are warranted unless there is not a curve (in which case designing an incredibly difficult test is probably a bit unfair).", "author": "intoxicatedMobyDick", "created": 1597348208, "upvotes": 10}, "g1cyj8w": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1cyj8w/", "text": "If you have an Android phone, there's an app called DroidCam that will let you use your phone as a webcam so you don't have to buy one. I don't know if anything similar exists for Apple because I don't have one.", "author": "therealhardscoper", "created": 1597346070, "upvotes": 10}, "g1cu98y": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1cu98y/", "text": "Sammmme we use proctorio that literally scans and tracks eye movement and forced us to show our whole room etc. if u don’t have a webcam and can not get one u get advised to drop the class.", "author": "sgoolsby", "created": 1597344138, "upvotes": 9}, "g1csja0": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1csja0/", "text": "Honestly the anti-cheating program bothers me more. They have complete access to all of your information stored on your personal computer. It always continues to have access to all of the websites you visit even after exams. Procter U takes control over your device while you compete your exam and has access to everything. Webcams can he unplugged as soon as your done with your exam or covered with a small piece of paper. I always have to completely scan my computer after exams to make sure all their software has been deleted and doesn't have access anymore.", "author": "peaches6060", "created": 1597343363, "upvotes": 35}, "g1cngaz": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1cngaz/", "text": "Some ideas:\n\n1) Email professors, advisors, etc citing your privacy concerns and explaining your situation (financial hardship, attaching a url to an Amazon webcam since theyre gonna get scalped to $50+). I had to take classes in my shared bedroom in a tiny apartment so there was no place to be without someone else in the background, and I didnt want to violate their consent by recording them without permission (which is technically illegal in some places, its an argument you could try to make, not sure if its much of a strong argument though)\n\n2) Get a webcam privacy cover/electric tape, put it over the webcam. \"Sorry I don't know why its not working\". Everyone will do this and it will likely be unsuccessful, but playing ignorant can help.\n\n3) Look for the worlds shittiest, blurriest webcam at like 480p or less. Alternatively smear some fucking Vaseline in the lens to blur it up but go easy so its not so obvious.\n\n4) Gather up as many angry students as you can and start a petition or social media page trying to go after the school for privacy violations. Push most of the (well deserved) blame of online school cheating to be on course+test design flaws (answer banks, objectively true memorization problems, access to open book will be available in real life, etc)", "author": "YourFlyingCow", "created": 1597341090, "upvotes": 38}, "g1closj": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1closj/", "text": "i think what kills me the most is that they expect us to pay out of pocket for extra tech accessories as if that’s not expensive", "author": "theshekelmaster", "created": 1597340340, "upvotes": 103}, "g1cliv1": {"link": "/r/CollegeRant/comments/i947e4/my_school_is_requiring_web_cam_and_browser/g1cliv1/", "text": "Same. Having to use a lockdown browser and webcam and it makes me super uncomfortable. Thought about waiting to go back for a semester or two, but idk when this virus stuff is going to clear up so I’m just sticking through it. Good luck to you though, m8", "author": "bakersydney01", "created": 1597340268, "upvotes": 29}}}