{"sid": "jt7rui", "link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/", "title:": "I need to say it somewhere...", "text": "I need to say it somewhere to someone...I hate college.\n\nIt  feels so good to finally say it.  I'm in PTA school, it's hard as fuck  and I feel like I've been dipped headfirst into hell.  I want to drop  out and be an author (I'm working on publishing my third book in a  series).  I can't market my book series like I should be, why?  I'm  always studying.  I am overloaded with so much homework I can barely  function.  I'm having panic attacks, can't sleep, sleep too much, or  feel like I want to die at least three to four times a week.  I can't  say this to anyone else.  My husband is counting on me to graduate to  help him out financially.  I've been a stay at home mother of three for  the past few years.  So, I'm trying to juggle raising kids, keeping  house (which I do a horrible job at), homeschooling my oldest, and  homework.  Where do I have time to do the things I want?  Nowhere,  that's where.  I know my husband works hard, and I'm trying to match his  effort and not complain because he's such an awesome man.  I just feel  like I'm drowning.  I haven't written anything in weeks and I'm slowly  dying inside.  I just needed to tell someone...", "author": "CollegeFlunkie", "created": 1605230611, "retrieved": 1632842941, "over_18": false, "upvotes": 127, "upvote_ratio": 1.0, "comments": {"gccurcd": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gccurcd/", "text": "I can not tell you how much I want to do this too. \n\nBut we both know that this will never happen. =,<", "author": "BecuzMDsaid", "created": 1605424664, "upvotes": 2}, "gc8ujgg": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gc8ujgg/", "text": "I'm married myself and I would feel horrible if my wife was keeping all of these feelings bottled up. Please talk to your husband, this is important.", "author": null, "created": 1605354005, "upvotes": 3}, "gc68isj": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gc68isj/", "text": "Stay strong. I am 35 and in college. I am working on my computer science AS. My family, which includes my wife and my daughter, live with me at my parents home. I went through a very difficult time , but that's another story. It's still very difficult for me but take it day by day. I focus what little time I have into my academic success. Don't give up because that'll make you feel worse. Your life will get better.", "author": "xSUPAHx", "created": 1605290282, "upvotes": 1}, "gc5de35": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gc5de35/", "text": "You need to talk to your husband about how you’re feeling. He needs to know.", "author": "Snoo81604", "created": 1605272404, "upvotes": 3}, "gc56bva": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gc56bva/", "text": "Good God, I am not a mum and have got nothing else going on, and I am still struggling with university! Like others have mentioned, you could consider changing your major if not dropping out entirely. Perhaps you also need to discuss things again with your husband and adjust your plans.\n\nI really wish you all the best and hope that you pull through these stupid tough times!", "author": "SleepyPrat", "created": 1605265773, "upvotes": 5}, "gc5544f": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gc5544f/", "text": "i'm here to tell you that i think you're doing an amazing job, just as you are right now. i'm in college too, a senior, and i feel your struggle. life is hectic for me and i can't imagine how college is for people who are both married AND raising kids too. you are a superhuman to me, i don't know how you do it! \n\ngo easy on yourself. take a whole day (or even half a day) just to yourself where you don't have to worry about housework, your kids, or school. if you don't take care of yourself first, then you won't be able to take care of the other demands in your life. \n\nsee if your school has therapy services. 2 of my colleges did and they did teletherapy via Zoom. it was really nice to just talk to someone about my problems without feeling like i was bothering any of my friends. good luck my friend, i believe in you!", "author": "iridescent_skiess", "created": 1605264446, "upvotes": 3}, "gc4sahb": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gc4sahb/", "text": "I feel the exact same. At least you took the first step in saying it and accepting it. Be easy on yourself!", "author": "wodeyxx", "created": 1605251081, "upvotes": 10}, "gc4g2wv": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gc4g2wv/", "text": "Look, I feel you. I’m almost 30 with two kids trying to get into optometry school and I’m only a junior in college. This whole year has been utter shit and last year was bad even without covid. It’s exhausting for all of us who are in it. I just tell myself, if anyone else can do this and get through it, so can I. It may mean sacrificing my own happiness for 8 fucking years but if that benefits the next 60 of mine and my kids’ lives, it’ll be hella worth it.", "author": "huna-lildahk", "created": 1605241584, "upvotes": 23}, "gc4cc2p": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gc4cc2p/", "text": "If you can, please reach out to get some help. whether it’s through a hotline, a therapist, or a psychiatrist. I suggest you also make an appointment with an academic advisor sometime soon, but your mental health is most important. you got this ❤️", "author": "ashleybcrowder", "created": 1605239327, "upvotes": 6}, "gc4aynq": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gc4aynq/", "text": "I think maybe you should drop out or change your major into something simple. You’re a mom and a wife and student! Your husband should understand how hard it is and should support your decision if you want to drop our", "author": "Cherrii_babe", "created": 1605238514, "upvotes": 19}, "gc3x4fs": {"link": "/r/CollegeRant/comments/jt7rui/i_need_to_say_it_somewhere/gc3x4fs/", "text": "\nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nhttps://suicidepreventionlifeline.org", "author": "hotlinehelpbot", "created": 1605230624, "upvotes": 25}}}