{
  "sid": "qhnx3c",
  "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/",
  "title:": "Does anyone feel like people who complain about weeder classes don’t know what they are talking about?",
  "text": "I am not saying they don’t exist because they do. The fact reality is that most of your weeder classes are still easy compared to your upper docs. When you get to your third or fourth year, you will be begging to take weeder classes again. Believe it or not, it does get worse after those classes",
  "author": "throwawayRanter500",
  "created": 1635430226,
  "updated": 1635457277,
  "over_18": false,
  "upvotes": 40,
  "upvote_ratio": 0.77,
  "comments": {
    "hidzh0e": {
      "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hidzh0e/",
      "text": "That really depends on how you define 'harder.' In my experience, weed-out courses are hard not so much from the material, but due to the fact they are courses with less hand-holding and more expectation for self-study. After I passed my weed-out courses I found upper level courses easier because through the weed out courses I learned better self-study methods.",
      "author": "hdorsettcase",
      "created": 1635433218,
      "upvotes": 46,
      "replies": {
        "hie5gun": {
          "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hie5gun/",
          "text": "So the later courses were not easier, got it",
          "author": "throwawayRanter500",
          "created": 1635435649,
          "upvotes": -28,
          "replies": {
            "hiekc0x": {
              "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hiekc0x/",
              "text": "Oh look, Snooroar reads a comment and makes a nonresponsive reply that has nothing to do with what he just read. Maybe his complete lack of reading comprehension has something to do with why he is struggling academically and socially at UCLA in the engineering program.",
              "author": "readytogybe",
              "created": 1635441463,
              "upvotes": 22,
              "replies": {
                "hieplkx": {
                  "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hieplkx/",
                  "text": "Guess he's just looking for anything that will match his confirmation bias",
                  "author": "ENDofZERO",
                  "created": 1635443481,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "hiexypp": {
              "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hiexypp/",
              "text": "they were easier",
              "author": "Waffles38",
              "created": 1635446750,
              "upvotes": 3,
              "replies": {
                "hifb2ys": {
                  "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hifb2ys/",
                  "text": "Then why do people say your later years are harder?",
                  "author": "throwawayRanter500",
                  "created": 1635451988,
                  "upvotes": -2,
                  "replies": {
                    "hifbloc": {
                      "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hifbloc/",
                      "text": "Varies significantly by major and course requirements. Also changes based on other commitments you have in later years, the professors you can take, if you've found a study method that works for you, etc...",
                      "author": "sanath112",
                      "created": 1635452196,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hififp6": {
                      "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hififp6/",
                      "text": "Because when you ask the same question hundreds of times using your +200 ban-evading alt accounts, you will get every possible permutation of answer. So why do you keep posting this shit over and over and over, SNOOROAR? Getting real sick of your shit.",
                      "author": "readytogybe",
                      "created": 1635454942,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hidx3s6": {
      "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hidx3s6/",
      "text": "Yeah I'm glad I have weeder classes right now. Made me realize this is not what I want to/ can do. Better this happened now than me screwing myself over in 3rd year. Gotta test the aptitude lol",
      "author": "newstudentwhatsthat",
      "created": 1635432248,
      "upvotes": 24,
      "replies": {}
    },
    "hiejhpp": {
      "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hiejhpp/",
      "text": "Why are you bitching about weedout classes AGAIN, Snooroar? Many redditors addressed your misunderstandings in the previous 20 times you have made this exact same dumbass post.\n\nJust shut the fuck up about it already.",
      "author": "readytogybe",
      "created": 1635441132,
      "upvotes": 18,
      "replies": {}
    },
    "hie05zl": {
      "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hie05zl/",
      "text": "Hey Dave/Snoo - sort of ironic that you would post this, but I guess maybe that shows some growth or maturity over the past month. Unless you're just changing sides on a whim again in one of your vents or rants. Hopefully it's the former than latter.",
      "author": "ENDofZERO",
      "created": 1635433503,
      "upvotes": 18,
      "replies": {
        "hiehxsl": {
          "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hiehxsl/",
          "text": "/r/snooroartracker",
          "author": "BakingSota",
          "created": 1635440527,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hieehrh": {
      "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hieehrh/",
      "text": "It all comes down to the professors really. I had good professors at my community college for tough subjects like calculus and diff eq. Having professors who actually taught and explained the subjects helped the students pushed through the class. Most of us passed and the professors didnt even curve grades.\n\nIn engineering school there was this professor who is a complete jerk to students. He keeps saying that in the real world no one helps you, and in jobs you are all alone. It is ironic he is saying that because he has been in academia his whole life. His class is definitely a weeder class because he is a jerk. In this university math professors have a bad rep. They love to fail students.",
      "author": "RainyFL",
      "created": 1635439195,
      "upvotes": 5,
      "replies": {}
    },
    "hiefy5l": {
      "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hiefy5l/",
      "text": "In my experience, that has not been the case. I’m in my fourth year of engineering and to this day, none of my classes have been harder than Physics 1, at my university. Countless hours of studying and even had three decent professors “rotate” and teach the topics throughout the semester and I barely passed. Now, my classes are so much more interesting and there has only been maybe 1 or 2 classes that I have struggled with but still not nearly as much as that weed out class.",
      "author": "reginaldtheIII",
      "created": 1635439757,
      "upvotes": 3,
      "replies": {}
    },
    "hifjmy7": {
      "link": "/r/CollegeRant/comments/qhnx3c/does_anyone_feel_like_people_who_complain_about/hifjmy7/",
      "text": "Leave David",
      "author": "GreyStomp",
      "created": 1635455435,
      "upvotes": 1,
      "replies": {}
    }
  }
}