{"sid": "icfy1s", "link": "/r/CollegeRant/comments/icfy1s/second_day_of_college_and_i_want_to_cry/", "title:": "Second day of college and I want to cry", "text": "My university is in person. I’m trying to be safe but it feels impossible. Balancing being social, attending class and being safe feels like an impossible jigsaw puzzle. \n\nI checked my temperature ten times in a row because my anxiety and panic got so bad. \n\nI just don’t want to worry every time I enter a lecture hall or take a bus. \n\nI got an information overload from all my in person classes. Twitter keeps showing me how all these other universities across the country are shitshows.\n\nI’m stressed and filled with anxiety. It’s only the second day.", "author": null, "created": 1597807046, "retrieved": 1632950384, "over_18": false, "upvotes": 179, "upvote_ratio": 0.98, "comments": {"g261seb": {"link": "/r/CollegeRant/comments/icfy1s/second_day_of_college_and_i_want_to_cry/g261seb/", "text": "I ended up deferring for this semester as I have an autoimmune disease and can’t get sick... My anxiety/OCD just wouldn’t be able to take it either😭", "author": "closetcat564", "created": 1597887065, "upvotes": 1}, "g24y5cv": {"link": "/r/CollegeRant/comments/icfy1s/second_day_of_college_and_i_want_to_cry/g24y5cv/", "text": "r/MSU (that is, Michigan State University, the other MSU) just announced that we are calling off in-person classes for our entire undergraduate student body for the semester. I hope your MSU follows suit. It's unfair for you to deal with this as a student, and the millions of students these poor decisions fall onto, across the nation. You're doing the best you can. Expect and prepare to be sent home very soon, which I hope for you will be a relief if and when that moment comes. I know it would be a relief for me. Online courses aren't good and full tuition for them is even worse but, compared to that I possible jigsaw puzzle, I know it must be miles better. Hope you get that kind of relief and I hope it doesn't require an on-campus outbreak for your college to make the call.", "author": "ConnorCarbon", "created": 1597866664, "upvotes": 2}, "g24rbbg": {"link": "/r/CollegeRant/comments/icfy1s/second_day_of_college_and_i_want_to_cry/g24rbbg/", "text": "When I first started college, I found something that helped me was doing journal entries, obviously that was two years ago before anyone had really heard of covid, but I would keep an either physical or virtual journal, physical might feel better to write in.\n\n And just keep track of how your feeling day in day out, and maybe get a second one that you keep a record of your temps, and maybe close interactions. I dont know you so I have no idea if that'd help, but personally being able to see data and see a trend if there is one, and see where it originated from.\n\nThe world is scary right now, my university is only like 8% in person and there are no wait lists on classes so people can't move through majors as easily. Its scary, anxiety inducing, and it sucks. The best thing you can do for yourself is listen to what precautions you have to take, do your best to distance yourself, and keep and eye on yourself, focus on today.\n\nIts like splitting up a big task into smaller ones to help simulate more progress. Don't think \"i have to get through this semester,\" think, \"I just gotta get through this month, but first, this week, and before that, just today. I just gotta get through today.\" You don't have to deal with tomorrow until it happens (unless of course you have to plan for something but you can get what i mean) and yesterday already happened, best not to dwell on it too much. \n\nYou can get through this, I'm sure there are people you can talk to, stay safe, care for your self and well being, and take it easy.", "author": "Skoboviik", "created": 1597863590, "upvotes": 2}, "g2420vf": {"link": "/r/CollegeRant/comments/icfy1s/second_day_of_college_and_i_want_to_cry/g2420vf/", "text": "Wear a mask (or two!), carry hand sanitizer and disinfecting wipes! don’t feel bad for wiping down a seat before sitting if that’s what makes you feel best. When you go home, change your clothes and immediately take a shower. do what you can to make you feel safest! ❤️", "author": "alyssaamarieeex", "created": 1597851844, "upvotes": 1}, "g240gyv": {"link": "/r/CollegeRant/comments/icfy1s/second_day_of_college_and_i_want_to_cry/g240gyv/", "text": "Don’t worry, it’s a weird and anxiety-filled time for everybody because these are strange times. But, it’s important to remember that if something were to happen, it doesn’t have to be worst thing.. so don’t let your mind go there.  \n\nHonestly, taking statistics into consideration are very important. There is misleading information about the actual numbers, but there are people who do contract the rona. although, NOT EVERYONE IS DESTINED TO DIE. :)\n\nJust stay safe, wash your hands, and don’t share personal items.", "author": "Ether_of_Joti", "created": 1597851118, "upvotes": 5}, "g23rn5h": {"link": "/r/CollegeRant/comments/icfy1s/second_day_of_college_and_i_want_to_cry/g23rn5h/", "text": "Would it be possible for you to switch to an online format if you desire to? It would certainly make you feel safer.", "author": null, "created": 1597846844, "upvotes": 5}, "g23duzt": {"link": "/r/CollegeRant/comments/icfy1s/second_day_of_college_and_i_want_to_cry/g23duzt/", "text": "I work at a school where faculty and students are given choice. Attendance is not mandatory even for zoom classes. Unless you are at your dream school, consider a safer online choice.", "author": "ThatProfessor3301", "created": 1597839823, "upvotes": 3}, "g22nfrs": {"link": "/r/CollegeRant/comments/icfy1s/second_day_of_college_and_i_want_to_cry/g22nfrs/", "text": "You definitely have the right mindset in terms of wanting to be successful & caring about others (while watching your own safety as well), so don’t blame yourself too much!\n\nI will say this: the first few days of college are usually always how you described - Covid or not. Don’t worry about it too much. I know it may seem like an overwhelming amount of information being thrown at you at once, but hang in there! I had the exact same feeling(s) when I called my mom & dad basically going through my list of anxieties, but it *will* get better. You will get used to the lifestyle & things should calm down after you’ve gone through the “orientation” of everything in the first couple of days.", "author": null, "created": 1597814621, "upvotes": 13}, "g22dapu": {"link": "/r/CollegeRant/comments/icfy1s/second_day_of_college_and_i_want_to_cry/g22dapu/", "text": "Just hang in there and continue being safe. I can relate to your stress. Even though I haven't started yet, I fear for how this semester can turn out. Hope for the best, but prepare for the worst. \n\nContinue doing what makes you feel safer in that environment. Screw all those retards who don't care about others and don't mask up. Just do your best in staying safe. Best of luck:)", "author": null, "created": 1597807961, "upvotes": 33}}}