{
  "sid": "geul5m",
  "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/",
  "title:": "Everything feels like a waste of time.",
  "text": "Relaxing is a waste of time. Doing hobbies is a waste of time. Playing with my dog is a waste of time. Sleeping is a waste of time. Bathing is a waste of time. Homework is a waste of time. College is a waste of time.\n\nIf I'm being unproductive, I of course feel like I'm wasting my time, but I feel paralyzed and unable to do anything. If I'm being productive towards hobbies, self care, personal projects, job hunting, etc. it feels like a waste of time because I *should* be doing schoolwork. If I do schoolwork, I still feel like I'm wasting my time because there's so much I want to do that would be productive and fulfilling if I didn't have academic responsibilities. I want to search for a job and take steps towards a career, I want to use my skills and abilities and develop them through field experience, I want to create content and get out into the world as a journalist or photographer or designer or artist. I just have to get a piece of paper first.\n\nI'm not allowed to choose what my priorities are. It's school. It's always school. Even though its so difficult for me to get things done with the systems that are currently in place, and I could be a much more fulfilled and productive individual if I were doing something else, I am to be a student. Anything I do that isn't part of my career as a student is an objective waste of time.",
  "author": "anon-honeybee",
  "created": 1588805727,
  "over_18": false,
  "upvotes": 176,
  "upvote_ratio": 1.0,
  "comments": {
    "g17wzru": {
      "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/g17wzru/",
      "text": "There is no such thing as wasted time",
      "author": "TheStickyBandit69",
      "created": 1597244396,
      "upvotes": 1,
      "replies": {}
    },
    "fwm61uo": {
      "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fwm61uo/",
      "text": "I felt this to the very center of my soul",
      "author": "JellyfishButterfly",
      "created": 1593631642,
      "upvotes": 1,
      "replies": {}
    },
    "fundzbi": {
      "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fundzbi/",
      "text": "Commenting to save this",
      "author": "personofinterest540",
      "created": 1592002915,
      "upvotes": 1,
      "replies": {
        "fune1n5": {
          "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fune1n5/",
          "text": "You can save posts on Reddit, like bookmarks kinda",
          "author": "anon-honeybee",
          "created": 1592002950,
          "upvotes": 1,
          "replies": {
            "funmg1r": {
              "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/funmg1r/",
              "text": "lol thanks for letting me know!",
              "author": "personofinterest540",
              "created": 1592007782,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fspsyxt": {
      "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fspsyxt/",
      "text": "This may seem obvious, but I would try to flip this around: every time you think “this is a waste of time” tell yourself what you are gaining. Relaxing is not a waste of time because it is essential for your mental health. Homework is not a waste of time because it is necessary to do well in a course. College is not a waste of time because it will enable you to get a job you love. Bathing is not a waste of time because self-care is important (and we want to smell good).",
      "author": "ihateumbridge",
      "created": 1591161092,
      "upvotes": 1,
      "replies": {}
    },
    "fq5az73": {
      "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fq5az73/",
      "text": "It’s called depression",
      "author": "urlbluntstomyirlface",
      "created": 1589098571,
      "upvotes": 3,
      "replies": {}
    },
    "fpqmo4n": {
      "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fpqmo4n/",
      "text": "I have felt this so hard... \n\nI don’t know if this is because of my background or if we share a similar one. Part of my study was focused on economics and I kind of became obsessed with efficiency and opportunity costs. But it’s dumb. There are a lot of logical fallacies and psychologically, only following logic is a pretty solid way to fuck yourself. \n\nI’m still trying to unfuck myself more now — some of the hobbies I’ve created and thought processes are legitimately helpful, others cause this kind of Catch-22 everything is a waste of time kind of thinking that still really messes with me. \n\nCheck out this [video](https://youtu.be/JcDXJxpB8UQ) — it definitely kinda helped me but even though it changed my mindset a little, let’s be real, one video by itself probably won’t be enough. Start talking to your friends more about this stuff even though it can seem hard or like a waste of time — I honestly think talking and journaling are two of the best ways out of this",
      "author": "gnewman888",
      "created": 1588826455,
      "upvotes": 4,
      "replies": {}
    },
    "fpq5yzy": {
      "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fpq5yzy/",
      "text": "I feel you on this. My grandmother just passed away and I'm unable to travel for the funeral. I'm too sad to get any work done, nonetheless get out of bed. Prior to this, I was struggling just because my school is doing pass/fail and I didn't need to put in much effort to receive my \"pass.\"",
      "author": "mollykdemarco",
      "created": 1588815839,
      "upvotes": 6,
      "replies": {}
    },
    "fppudwu": {
      "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fppudwu/",
      "text": "I graduated this past fall so I feel like I can offer you some advice.\n\nnumber one, calm down and take a breather. of course school should be your first priority, college is expensive! however, don’t freak out so badly about wasting time doing something or nothing that later in time you regret not doing the things that you wanted to do. my last year and a half at university I didn’t allow myself to have fun because I felt that I needed to focus on school and preparing for life after college. now I sit here still mourning my first two years because I had an absolute BLAST. \n\nit’s all about prioritizing and planning correctly. finish your work and then have fun, or if you’re too overwhelmed take a break and have fun. as long as you can allocate time to finish your assignments, don’t ever feel bad for going out or hanging out with friends. those are the honestly best parts of college and I don’t want you to miss out. \n\nso there’s a few different ways you can go about this:\n\n1. dedicate one entire day to finishing your assignments for the next few days or the next week. that way you have all the free time to have fun. \n\n2. if you have an assignment due today or tomorrow, just get it done and over with, then have fun.\n\n3. it’s inevitable that we’re going to stress out from our schoolwork, so if it isn’t due soon and you can afford to put it off until the next day, take a break and have fun. \n\nit’s honestly all about discipline and keeping yourself sane at the same time. it’s difficult but not impossible. you got this!\n\nEdit: I wanted to add a few more things\n\n4. don’t ever feel bad for relaxing. if you need it you need it. listen to your body and your mind. I always knew I needed a break when I legit just couldn’t focus on my work anymore and I needed a breather.\n\n5. if you need an entire day to yourself, take it. don’t do it so often that you don’t get anything done anymore, but if your head is not in the right space you’re not going to want to do anything.\n\n6. if you want to get a job and gain field experience, GO FOR IT! you will want to gain that sooner rather than later because after you graduate employers will ask about your experience in your field",
      "author": "sdossantos97",
      "created": 1588809343,
      "upvotes": 23,
      "replies": {
        "fppumkx": {
          "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fppumkx/",
          "text": "The thing is, I’m unable to self discipline or get things done, at least consistently. Been this way my whole life. I have weeks worth of missing and late assignments this term. My prescriber thinks I have an attention disorder and recommends I seek educational therapy because I lack the ability to focus and sit down and get work done.",
          "author": "anon-honeybee",
          "created": 1588809479,
          "upvotes": 15,
          "replies": {
            "fpq61fp": {
              "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fpq61fp/",
              "text": "do you have a planner? or you can even use excel to plan out each hour of your day. I personally use the app Forest, you see a timer for how long you want to focus and you have to put your phone down, and when the timer is over you plant a tree! if you try and leave the app then it’ll die.",
              "author": "sdossantos97",
              "created": 1588815880,
              "upvotes": 2,
              "replies": {
                "fpqqsfc": {
                  "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fpqqsfc/",
                  "text": "highly recommend forest—i have it too, and it’s helped me keep away from my phone for long stretches of time (during which i study). the tree that grows is like a manifestation of my hard work, and it makes me feel really productive!",
                  "author": "loversdesire",
                  "created": 1588829577,
                  "upvotes": 3,
                  "replies": {}
                },
                "fpq8hbv": {
                  "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fpq8hbv/",
                  "text": "Interesting, I’ll look into forest. Though I have a history of those types of things not working for me. I currently use Asana to keep track of my assignments and classes, it helps with organization and a little with motivation but not much",
                  "author": "anon-honeybee",
                  "created": 1588817297,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "fspsqae": {
              "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fspsqae/",
              "text": "Have you tried the Pomodoro technique?",
              "author": "ihateumbridge",
              "created": 1591160922,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fppt2k5": {
      "link": "/r/CollegeRant/comments/geul5m/everything_feels_like_a_waste_of_time/fppt2k5/",
      "text": "Netflix:\nMidnight gospel \nEpisode 6 \n17:29",
      "author": null,
      "created": 1588808601,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634063883
}