{"sid": "orw7yn", "link": "/r/CollegeRant/comments/orw7yn/just_a_rant_from_a_burnt_out_student/", "title:": "Just a rant from a burnt out student.", "text": "Tldr: 8 hr classes, no down time between previous sem finals and starting of new semester, incompetent profs.\n\nWanna preface this by saying that this is all just a rant at the end, I can't do much about my situation.\n\n1. My class schedule isn't up to me. It's 8 hrs of classes every day for 6 days barring 2nd & 4th Saturdays. 8:30 AM to 4 PM. There's no scope of taking a part-time job or an internship because colleges don't give their students time. The student job scene in my country is still in its infancy because everyone is forced to be ONLY a student. (lg there are colleges who don't swallow a student's life whole, but not my college. I have friends who have been luckier). 4th sem finals were over two days ago and 5th sem is starting the day after tomorrow. No downtime.\n2. The workload is so much for me. 5 subjects in a semester, each class ends up giving around 10-30 documents with 20-60 pages each. All huge walls of text, page after page. Every formula, every term, every minute textbook detail, we're required to remember. Every single word from every single page like computers bc they can ask anything from anywhere. We hardly get any MCQ tests. It's all subjective-type questions. Wrote my finals paper of 4000 words in 2 hours for English last week, for a total of 50 marks. Now that I'm entering my final year, it's 6 classes per sem.\n3. We aren't given books and aren't assigned anything else to read. All we have are the notes that professors give out. But in order to make us pay attention in class they hand out notes 2-3 weeks (dangerously close to internal exams) after the relevant topic is over, but their notes always contain 50% additional info that isn't taught in class. PLUS I doubt anyone can effectively take notes when these Profs finish whole 50 slide PPTs in a 40 min class. Are we supposed to take notes at the speed of light or understand/listen to the lecture?\n4. This semester, 2 days before we had her End Sem final Paper, this one professor emails us saying that SHE COMPLETELY FORGOT to teach us 50% of her portions but they'll still be in the exams so she sent us notes!! To self-learn in 2 days! Another professor's assignment was to find a stranger who is above 60 and convince them to get vaccinated and present their certificate as proof. When the entire country was under lockdown! Fuck students who're stranded, aren't locals, and have zero connections ig. They hold special meetings to threaten us into giving them high scores in evaluation forms. The professors in my college deserve a whole other post.\n\nThe fact that I'm a triple major student with Chem, Botany and Microbiology and haven't done a single practical myself in a year is eating me out. My college is autonomous so they have the option to make their own syllabus more coherent/structured, but instead, they choose to copy-paste different things from around the internet into a single document and call it a day. I'm scared I'll be underqualified by the time I graduate.", "author": "riiyoreo", "created": 1627296340, "retrieved": 1632841713, "over_18": false, "upvotes": 10, "upvote_ratio": 0.87, "comments": {"h6kmye0": {"link": "/r/CollegeRant/comments/orw7yn/just_a_rant_from_a_burnt_out_student/h6kmye0/", "text": "Thank you u/riiyoreo for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1627296395, "upvotes": 1}, "h6ogcw8": {"link": "/r/CollegeRant/comments/orw7yn/just_a_rant_from_a_burnt_out_student/h6ogcw8/", "text": "Triple major?!", "author": "Purple_Twist6381", "created": 1627367122, "upvotes": 2}}}