{
  "sid": "pko9qt",
  "link": "/r/CollegeRant/comments/pko9qt/i_eat_healthier_than_most_people_and_it_gets_me/",
  "title:": "I eat healthier than most people and it gets me nowhere",
  "text": "At any table I sit at for lunch or dinner, I'm usually the only person who doesn't get dessert, fries, red meat, and/or soda. I don't have any of that from the cafeteria; I fill up my plate with as much of everything besides those- and eat all 5 food groups at every meal- and I only drink water and coffee with skim milk. I'm 5'11\" 135 lbs so it's not like I'm a fat person trying to lose weight. Yet I'm always the least popular person at the table. Guys who get desserts with every meal and rarely eat vegetables are somehow getting more attention. I'm not going to stop eating healthy, it's just annoying that the cliche of \"you need to take care of your body for people to like you\" is not reality.",
  "author": "bonobo-no",
  "created": 1631152660,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.14,
  "comments": {
    "hce5c62": {
      "link": "/r/CollegeRant/comments/pko9qt/i_eat_healthier_than_most_people_and_it_gets_me/hce5c62/",
      "text": "It's good that you eat healthy. Your healthy diet will pay off in the future; that said, there is no connection between eating healthy and being popular. \n\nWhat you eat does not affect your ability to make friends. You need to work on your social skills to expand your peer group.",
      "author": "TheProfessorsCat",
      "created": 1631328946,
      "upvotes": 2,
      "replies": {}
    },
    "hc6k4qx": {
      "link": "/r/CollegeRant/comments/pko9qt/i_eat_healthier_than_most_people_and_it_gets_me/hc6k4qx/",
      "text": "Maybe you need to put on muscle. The idea that “weight loss = better looks” isn’t always true, even for women but especially for men.\n\nKeep eating healthy but in a calorie surplus and start lifting. Follow a beginner program like Starting Strength.",
      "author": "armchairwarrior13579",
      "created": 1631195918,
      "upvotes": 1,
      "replies": {}
    },
    "hc4u7om": {
      "link": "/r/CollegeRant/comments/pko9qt/i_eat_healthier_than_most_people_and_it_gets_me/hc4u7om/",
      "text": "It seems like you have the food thing under control. Maybe the issue has nothing to do with diet or even looks. What else do the guys getting attention do? Maybe that's the key?",
      "author": "CuriousVehicle",
      "created": 1631152815,
      "upvotes": 6,
      "replies": {
        "hc4vexj": {
          "link": "/r/CollegeRant/comments/pko9qt/i_eat_healthier_than_most_people_and_it_gets_me/hc4vexj/",
          "text": "They're more extroverted. I'm autistic so I'm introverted. I know that's not an excuse, but it does make things hard. Also I'm not really complaining about attention from girls, but just acknowledgement and people talking to me, which rarely happens, even if I initiate.",
          "author": "bonobo-no",
          "created": 1631153411,
          "upvotes": 1,
          "replies": {
            "hc4vwop": {
              "link": "/r/CollegeRant/comments/pko9qt/i_eat_healthier_than_most_people_and_it_gets_me/hc4vwop/",
              "text": "Ahh i gotcha. That's a bummer. Are they new friends, or people you've known for a while? \n\nI am not autistic, but I am very introverted, so I sort of understand what it's like to be an audience member at a table full of friends.",
              "author": "CuriousVehicle",
              "created": 1631153658,
              "upvotes": 1,
              "replies": {
                "hc57z8h": {
                  "link": "/r/CollegeRant/comments/pko9qt/i_eat_healthier_than_most_people_and_it_gets_me/hc57z8h/",
                  "text": "People I met this year.",
                  "author": "bonobo-no",
                  "created": 1631160277,
                  "upvotes": 1,
                  "replies": {
                    "hc58g3v": {
                      "link": "/r/CollegeRant/comments/pko9qt/i_eat_healthier_than_most_people_and_it_gets_me/hc58g3v/",
                      "text": "Well idk if you're looking for advice, of if this will even help buuuuut:\n\nI try to keep in mind that there is a lot of value in being kind and participating, even if you don't get the spotlight often. A lot of times I am the fly on the wall for months with people before we start communicating more and getting closer. I used to be worried about it, but as I've gotten older I've just accepted it. Hope it works out well for you!",
                      "author": "CuriousVehicle",
                      "created": 1631160584,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634062777
}