{
  "sid": "mrp5yw",
  "link": "/r/CollegeRant/comments/mrp5yw/no_schoollife_separation_is_killing_me/",
  "title:": "No school/life separation is killing me",
  "text": "God I'm so exhausted.\n\nSince I started back at school during COVID, I have no school/life separation. I never get to leave my house. My bedroom is where I sleep and work, since I have nowhere else to go. From the moment I wake up to the moment I fall asleep, there's always more to be done.\n\nPre-COVID, I was failing online classes because I could never get the separation of meeting in person, doing the work, and having any semblance of existence outside trying to keep up with the class on my own. Now it's just magnified. My dad constantly expects me to do everything around the house when my homework reading and classes take up more hours than his actual, out of the house job.\n\nI haven't slept properly in weeks because I have nothing to separate me from this little room I'm trapped in.\n\nI'm dying.\n\nI don't know if I can get through this.\n\nTl;dr my entire life is in a single room now and it's killing me",
  "author": "AngerAndAgony",
  "created": 1618523929,
  "over_18": false,
  "upvotes": 36,
  "upvote_ratio": 0.95,
  "comments": {
    "guoesq4": {
      "link": "/r/CollegeRant/comments/mrp5yw/no_schoollife_separation_is_killing_me/guoesq4/",
      "text": "I’m so sorry you’re feeling this, I know it’s been hard. Is there no way you can drive to a cafe and use their wifi to do work? I did that when things were tough at home and it was refreshing to get out of the house to do work. If not you can hit up a public library and use their computers too.",
      "author": "iceddlattte",
      "created": 1618538520,
      "upvotes": 6,
      "replies": {
        "guohatj": {
          "link": "/r/CollegeRant/comments/mrp5yw/no_schoollife_separation_is_killing_me/guohatj/",
          "text": "I can't drive, sadly :( And the nearest public library that's actually open is over an hour and a half away. I live in a very rural small town in the mountains currently so it's super isolating.",
          "author": "AngerAndAgony",
          "created": 1618539853,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634062186
}