{
  "sid": "lygmcc",
  "link": "/r/CollegeRant/comments/lygmcc/i_broke_this_morning/",
  "title:": "I broke this morning",
  "text": "I woke up early this morning at 6 am to get a handle on the many assignments I have that are due this weekend.\n\nTurned on my computer, opened blackboard, and now 5 hours have passed. Still haven’t done a thing except have a panic attack and cry.\n\nThe weird part is I was doing so well up until a week ago and now it’s like I can’t get myself to do anything. Idk what’s wrong with me.",
  "author": "darkerthanthenight",
  "created": 1614964387,
  "over_18": false,
  "upvotes": 113,
  "upvote_ratio": 1.0,
  "comments": {
    "gpusygh": {
      "link": "/r/CollegeRant/comments/lygmcc/i_broke_this_morning/gpusygh/",
      "text": "Often times you'll face a mountain. As you begin the dreaded climb, you come to find out you're really just stepping on a curb.",
      "author": "Wackey-Tobackey",
      "created": 1614999623,
      "upvotes": 11,
      "replies": {}
    },
    "gptj79k": {
      "link": "/r/CollegeRant/comments/lygmcc/i_broke_this_morning/gptj79k/",
      "text": "I've had something similar happen to me recently, maybe not to the same extent, but I certainly wasn't doing well. \n\nFor one of my history classes, I had my midterm paper due this past Monday, but my professor gave me an extension for March 8th. The paper has to be at least 5 pages and I still have nothing written. I used to be so good at creative writing (although I'm an engineering student), but it's been so long since my last humanities course and I just can't gather my ideas well. And having school from home and dealing with ADD doesn't help, either. \n\nHopefully, we can both get back on track. Good luck to you!",
      "author": "The_Lantern11",
      "created": 1614980267,
      "upvotes": 8,
      "replies": {
        "gptm5u7": {
          "link": "/r/CollegeRant/comments/lygmcc/i_broke_this_morning/gptm5u7/",
          "text": "I’m also an engineering student and I’m taking calculus 3 and I was getting As on every assignment until I got a little behind and made three Fs in a row. Now I’m climbing uphill and I’ve got about 5 assignments for that class due tomorrow. Only half way done with two of them",
          "author": "darkerthanthenight",
          "created": 1614981712,
          "upvotes": 4,
          "replies": {
            "gptmgj8": {
              "link": "/r/CollegeRant/comments/lygmcc/i_broke_this_morning/gptmgj8/",
              "text": "That sounds rough, pal.",
              "author": "The_Lantern11",
              "created": 1614981862,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gpsmpdc": {
      "link": "/r/CollegeRant/comments/lygmcc/i_broke_this_morning/gpsmpdc/",
      "text": "Thats pretty much how I work but the other way around. I have those one or two days out of the week im productive and then I can't even do anything for the rest of the week",
      "author": "TheRapidTrailblazer",
      "created": 1614965604,
      "upvotes": 35,
      "replies": {
        "gpsojka": {
          "link": "/r/CollegeRant/comments/lygmcc/i_broke_this_morning/gpsojka/",
          "text": "That’s how I’ve been feeling too as of lately. Motivation and drive is in the negatives",
          "author": "darkerthanthenight",
          "created": 1614966388,
          "upvotes": 12,
          "replies": {
            "gpstoau": {
              "link": "/r/CollegeRant/comments/lygmcc/i_broke_this_morning/gpstoau/",
              "text": "the only thing driving me to do work is the fact that I have spring break coming up and im trying to see if I can complete my essay today so I have the weekends off",
              "author": "TheRapidTrailblazer",
              "created": 1614968617,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062155
}