{
  "sid": "q51koz",
  "link": "/r/CollegeRant/comments/q51koz/late_night_rant/",
  "title:": "Late night rant",
  "text": "Enrolled into college this September, been living here at the dorm for a while now. Even though I have friends, none of them are perticularly close, people I know here are not the types to hangout at all. COVID shut down almost every event other than those on discord. It seems like Everytime I try to meet new people they don't want to get out of their room and just want to stay by themselves. Even my roommate lock himself in his room and does not want to talk. I miss the times before COVID, and I miss having a physical connection with people from  school. college for me right now is alot different from what I've imagined it to be. Through social media I see my highschool friends making close connections in their new school already. Gotta be honest, I am... Jealous. It's hard to not feel lonely sometimes. Hopefully things will turn around and hopefully COVID will end soon, or maybe I am just complaining like a little bitch. \n\n\n\nThank you for listening(reading) to my rant lol",
  "author": "fuccboi-den",
  "created": 1633842335,
  "updated": 1634093808,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.74,
  "comments": {
    "hg3xhmd": {
      "link": "/r/CollegeRant/comments/q51koz/late_night_rant/hg3xhmd/",
      "text": "There seems to be a dilemma with college students right now. I think a lot of us developed social anxiety or the need to be isolated because of the pandemic. Before covid I was pretty social, but now I get socially tired being at a party for more then an hour. Covid really messed up a lot of people socially, and it’ll take a while for things to feel normal.",
      "author": "ttyltyler",
      "created": 1633877343,
      "upvotes": 3,
      "replies": {
        "hgd8ihf": {
          "link": "/r/CollegeRant/comments/q51koz/late_night_rant/hgd8ihf/",
          "text": "Omg so I'm. not the only one. lol",
          "author": "Limp_Brick5860",
          "created": 1634054088,
          "upvotes": 1,
          "replies": {}
        },
        "hgf2cau": {
          "link": "/r/CollegeRant/comments/q51koz/late_night_rant/hgf2cau/",
          "text": "For me it’s more of just not wanting to get COVID and spread it to my family. Trying to have a semblance of a social life while being safe is… hard.",
          "author": "teatahshsjjwke",
          "created": 1634081569,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}