{
  "sid": "mjfdnt",
  "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/",
  "title:": "Online courses are horrible",
  "text": "I have never felt more alone or stuck than in the online learning environment. I feel that every college needs to offer a full refund as I would have NEVER signed up for college if I knew the campus would be shut down. It is actually more expensive now and support is non-existent.",
  "author": "good4nothingnobody",
  "created": 1617478010,
  "over_18": false,
  "upvotes": 138,
  "upvote_ratio": 0.93,
  "comments": {
    "gtcaoo9": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtcaoo9/",
      "text": "It’s not horrible unless all the work is in MyMathLab and the test the freaking test which is 60% of the grade is hand written",
      "author": "MrOmar909",
      "created": 1617539321,
      "upvotes": 3,
      "replies": {
        "gtcl8rd": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtcl8rd/",
          "text": "That’s exactly what my math class was this semester that I ended up dropping",
          "author": "lostveggie",
          "created": 1617546267,
          "upvotes": 2,
          "replies": {}
        },
        "gtd20i2": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtd20i2/",
          "text": "I had a couple math classes that were 100% in ALEKS, it was horrible lol I feel your pain.",
          "author": "good4nothingnobody",
          "created": 1617555071,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gtbst2p": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbst2p/",
      "text": "i literary haven't learned anything this year aside form my programming class. Its even harder when the prof. does not know how to use technology or send class announcements.",
      "author": "The-3rd-Party",
      "created": 1617522139,
      "upvotes": 3,
      "replies": {}
    },
    "gtbraie": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbraie/",
      "text": "I get anxiety everytime I get an outlook email notification",
      "author": "BootyJuice11",
      "created": 1617520646,
      "upvotes": 7,
      "replies": {
        "gtbt58m": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbt58m/",
          "text": "same only for outlook, not my gmail account.",
          "author": "The-3rd-Party",
          "created": 1617522475,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gtbjhws": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbjhws/",
      "text": "Forever thankful I decided to take a gap year. Couldn’t agree more",
      "author": "CasanovaFormosa",
      "created": 1617513617,
      "upvotes": 7,
      "replies": {
        "gtbz1t7": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbz1t7/",
          "text": "[removed]",
          "author": null,
          "created": 1617528528,
          "upvotes": -5,
          "replies": {
            "gtcly0u": {
              "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtcly0u/",
              "text": "Um I have a job. Why the attitude?",
              "author": "CasanovaFormosa",
              "created": 1617546666,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "gtbf5ia": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbf5ia/",
      "text": "Thought I was used to it until this semester of my second year. The teachers slack harder than the students for communication and it's as if I'm relying on a brick wall for my grades and feedback. \n\nI hope I can't get through this last month. I'm so tired.",
      "author": "Map-leaf",
      "created": 1617510245,
      "upvotes": 14,
      "replies": {
        "gtbt00p": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbt00p/",
          "text": "Exactly, i had to drop a course last semester because i missed my Midterm exam that was on a different day from the syllabus and the professor sent no email, course message, announcement, or marked the date on my colleges online calendar feature.",
          "author": "The-3rd-Party",
          "created": 1617522333,
          "upvotes": 7,
          "replies": {}
        },
        "gtbg5n2": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbg5n2/",
          "text": "Same",
          "author": "good4nothingnobody",
          "created": 1617510982,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gtb89jh": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb89jh/",
      "text": "i feel you. people essentially saying “deal with it” in the comments are seeming to me like they’re not in fucking college lol. it absolutely blows. you’re not alone in that.",
      "author": "georgeyellow",
      "created": 1617505632,
      "upvotes": 20,
      "replies": {
        "gtb8kye": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb8kye/",
          "text": "lol I know, right?! It's certainly rough but thanks for reminding me that I'm not alone (even though it feels like it).",
          "author": "good4nothingnobody",
          "created": 1617505830,
          "upvotes": 4,
          "replies": {}
        },
        "gtb9evr": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb9evr/",
          "text": "I’ve gotten into fights with my relatives over this, with some saying why does it matter if people have been doing college online for years? Or why do you need a spring break if you’re online? I have absolutely no motivation. I have an 800 word essay due tonight and it just feels like busy work. I don’t think I’m gonna hand it in on time and I’ve never had a late paper before. I just have no motivation to do it.",
          "author": "CapriciousSalmon",
          "created": 1617506331,
          "upvotes": 8,
          "replies": {
            "gtbthg1": {
              "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbthg1/",
              "text": "\"people have been doing college online for years\" Okaaaay but now the professors who NEVER wanted to do that, had no intention of teaching online, and don't have the skills/resources to do it are online professors. The sentiment is so bullshit because everyone was forced into it. No one has agency (professors or students) unless we all just...quit?\n\nI'm especially heated rn because one of my professors doesn't bother to the point where all the links he posts to \"teach\" us are BROKEN or use flash. He literally said \"make sure you can use flash player\" when browsers don't support it anymore. I think he made his online classes years ago and never checked to see if his shit still works. That PLUS at-home labs with hardly any instruction.... screams into the void endlessly",
              "author": "333_444_777",
              "created": 1617522819,
              "upvotes": 4,
              "replies": {
                "gtbwfmh": {
                  "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbwfmh/",
                  "text": "Well just stick it out for a little longer, it’ll be back on campus this fall just like the good ole days :)",
                  "author": "yeTaughtMe2",
                  "created": 1617525818,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gtbbs8n": {
              "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbbs8n/",
              "text": "christ i feel this. have carried a 4.0 (now 3.9) for my entire college career (i’m a junior), but this semester has REALLY been testing me. i handed in a mindless bibliography assignment at literally 11:59 on the due date the other night. i have exams in two classes to take that i haven’t seen a single lecture for in a month. \n\nto imply that there’s hardly a difference or that “people have been doing it online for years” is absurd. there’s a reason only some people do it online — the reason being some (many) people absolutely hate learning online, and find it near impossible. now take that and extend it over the last 3 semesters, and add a dash of isolation, dread, and the complete implosion of life as you knew it. \n\ni’m seeing a *very* significant yet hidden decline in student mental health. it feels so isolating and alone until you check reddit and realize you aren’t the only person barely holding it together (or not holding it together at all, quite frankly). this is the only place i really see anyone being open about it. \n\ni hear you. it’s brutal. \n\nfor what it’s worth, i know you can knock out 800 words if you try. worst case, email your prof and ask for an extension, with apologies for being so last minute. if they say no, you tried. but i really think you can do it, although it fucking sucks. and i’m sorry. \n\nlately instead of, “i can’t be finished until it’s perfect”, i’ve been telling myself: *“finished is perfect”.* saw it on reddit somewhere. is true. \n\nbest of luck friend. here if you ever want to commiserate.",
              "author": "georgeyellow",
              "created": 1617507875,
              "upvotes": 9,
              "replies": {
                "gtbebsi": {
                  "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbebsi/",
                  "text": "I have also carried a 4.0 and it's crazy how much I can relate to your post! It's so much different online (and not in a good way). I completely agree with you. And thank you, same to you! I have plenty we can commiserate about together haha",
                  "author": "good4nothingnobody",
                  "created": 1617509650,
                  "upvotes": 3,
                  "replies": {
                    "gtbl6hu": {
                      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbl6hu/",
                      "text": "Likewise. The added pressure of maintaining that 4.0 has been torturous this semester. I’m so burned out, and trying so desperately to hold it together...",
                      "author": "IKnowNotWhy",
                      "created": 1617515027,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "gtbwdzu": {
                  "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbwdzu/",
                  "text": "“Finished is perfect” tell that to my ex girlfriend :/",
                  "author": "yeTaughtMe2",
                  "created": 1617525771,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gtb7ouy": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb7ouy/",
      "text": "If there’s whatsapp group chats you can join for your courses, or any kind of group chat for your course I highly recommend you join, it’s really helped me with remote learning",
      "author": "Cold_Volume9518",
      "created": 1617505270,
      "upvotes": 9,
      "replies": {
        "gtb7yhc": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb7yhc/",
          "text": "That's great advice. We actually used Microsoft Teams in previous courses to collaborate but unfortunately, these last few credits don't have anything to join that I'm aware of :/ Again though, that's awesome that it's helping you!",
          "author": "good4nothingnobody",
          "created": 1617505437,
          "upvotes": 4,
          "replies": {
            "gtc1l3n": {
              "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtc1l3n/",
              "text": "Don’t recommend doing full on groups because of the Karens and the cliques. I would see if you click with any classmates, and reach out to them. Small groups are better than entire classes. Trust me. #FuckCohorts #Imnot14butthisisstilldeep",
              "author": "sanfortunado",
              "created": 1617531137,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gtb2ku2": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb2ku2/",
      "text": "That’s not how transactions work. You also going to give up your earned credits too?",
      "author": "snoboy8999",
      "created": 1617502133,
      "upvotes": -1,
      "replies": {
        "gtb2vn0": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb2vn0/",
          "text": "So when you dine at a fancy restaurant and order a filet mignon for $70 and you receive a hamburger from McDonald's you just shrug your shoulders and say \"welp, that's how transactions work\"?",
          "author": "good4nothingnobody",
          "created": 1617502319,
          "upvotes": 5,
          "replies": {
            "gtb3fyd": {
              "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb3fyd/",
              "text": "I don’t ask for a full refund when I would have probably eaten the burger. Also you chose to pay for something knowing what you were getting into. It was obvious that filet mignon wasn’t on the menu.",
              "author": "snoboy8999",
              "created": 1617502662,
              "upvotes": 1,
              "replies": {
                "gtb3wcj": {
                  "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb3wcj/",
                  "text": "LOL! Ok buddy, sure. Someone has to eat a s\\*\\*\\* sandwich so it might as well be you.",
                  "author": "good4nothingnobody",
                  "created": 1617502936,
                  "upvotes": 2,
                  "replies": {
                    "gtb93m3": {
                      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb93m3/",
                      "text": "...you’re mad because I have two separate points. Go file a chargeback on your card if you’re so dissatisfied but you have your credits don’t you?",
                      "author": "snoboy8999",
                      "created": 1617506139,
                      "upvotes": -2,
                      "replies": {
                        "gtb9i2j": {
                          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb9i2j/",
                          "text": "I didn't charge my tuition to a credit card...I took out student loans, which as we all know can't be charged back. You haven't made a point except that you are willing to accept less at premium prices. By the way, the Tesla I just sold you for $80k is actually a Prius...but you already paid me in full so that's just \"how transactions work\".",
                          "author": "good4nothingnobody",
                          "created": 1617506385,
                          "upvotes": 1,
                          "replies": {
                            "gtc47u8": {
                              "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtc47u8/",
                              "text": "You’re being intentionally obtuse. You aren’t getting a percentage of a credit so why should you pay a percentage of the cost? Online classes also have more overhead too.\n\nHands down, you chose to pay for this experience. You don’t get anything back nor do you deserve anything back.",
                              "author": "snoboy8999",
                              "created": 1617533731,
                              "upvotes": 0,
                              "replies": {
                                "gtea4c1": {
                                  "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtea4c1/",
                                  "text": "You should have read the other comments that explained the full situation. You're just someone who is going to disagree with anyone no matter what they say because you get off on being negative so this will be my last reply to the likes of you, Mr. Boy. Have a nice virtual life ;)",
                                  "author": "good4nothingnobody",
                                  "created": 1617578203,
                                  "upvotes": 4,
                                  "replies": {
                                    "gtf1uj1": {
                                      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtf1uj1/",
                                      "text": "You’re disgustingly condescending and aren’t entitled to shit dude. Pay up or don’t get your degree.",
                                      "author": "snoboy8999",
                                      "created": 1617594364,
                                      "upvotes": -2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gtb1nn1": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtb1nn1/",
      "text": "Yes, it’s very lonely and I’ve been getting a lot less actual instruction. Like for one class, we’re supposed to meet Mondays and Wednesdays for a couple hours of lecture and then an extra couple hours on Wednesdays for lab. What happened: We would meet for 30min on Mondays for lecture because my instructor “did not have a Zoom license” (Zoom kicks you out after so much time if you don’t pay for services apparently) and every other week for 1-2 hours for lab.",
      "author": "jendominates",
      "created": 1617501572,
      "upvotes": 5,
      "replies": {}
    },
    "gtajawt": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtajawt/",
      "text": "To me the hardest part of it non academically is the mental toll. I’ve reached the point so much as even typing “canvas.colorado.edu” into my search bar gives me severe anxiety.",
      "author": "TheBryanScout",
      "created": 1617490545,
      "upvotes": 63,
      "replies": {
        "gtbhkne": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbhkne/",
          "text": "I graduate in 4 weeks and haven’t started my thesis because every time I even think about it I get exhausted. you’re so not alone",
          "author": "joywynter",
          "created": 1617512071,
          "upvotes": 13,
          "replies": {
            "gtbif7t": {
              "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbif7t/",
              "text": "Holy shit dude, best of luck!",
              "author": "TheBryanScout",
              "created": 1617512736,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "gtajpcm": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtajpcm/",
          "text": "I know the feeling! Sorry to hear that you are struggling with it too.",
          "author": "good4nothingnobody",
          "created": 1617490777,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gta0jk6": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gta0jk6/",
      "text": " Do you really think that Universities had a choice or your Professors. They either obeyed state laws or go out of business. Then what you have of your degree will be worthless.\n\nI realize you feel slighted by this whole thing but its just part of this covid thing.. It will get better soon and you'll be back to being on campus.\n\nMost Universities are freaking out over students not wearing masks not regarding safety measures and OFC getting sick and then they sue the school for having in person classes..",
      "author": "electricdom",
      "created": 1617480192,
      "upvotes": 0,
      "replies": {}
    },
    "gt9xfci": {
      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gt9xfci/",
      "text": "This is like the 3rd semester campuses have been shut down...",
      "author": "coraline_button_",
      "created": 1617478624,
      "upvotes": 7,
      "replies": {
        "gt9xo7o": {
          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gt9xo7o/",
          "text": "What's your point? I was already in too deep (made too many sacrifices, came too far, and spent WAY too much money) when they shut down.",
          "author": "good4nothingnobody",
          "created": 1617478741,
          "upvotes": 17,
          "replies": {
            "gtab9pp": {
              "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtab9pp/",
              "text": "ahhh gotcha, i got the vibe you were like a freshman or something! my bad!! sorry!! i shouldn’t have assumed. i feel ya though. online school sucks i’m so excited that my classes are in person in the fall",
              "author": "coraline_button_",
              "created": 1617486007,
              "upvotes": 5,
              "replies": {
                "gtak1kl": {
                  "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtak1kl/",
                  "text": "Nope, this is my last semester so I'll be able to put academia behind me in a few weeks. I was hoping to get a master's degree or higher but I will never step foot in another academic institution after this experience. That is awesome that your classes will be in-person in the fall though.",
                  "author": "good4nothingnobody",
                  "created": 1617490975,
                  "upvotes": 9,
                  "replies": {
                    "gtbclrq": {
                      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbclrq/",
                      "text": "i feel this too lmao. was so set on grad school before and now i’m debating even doing my last year of undergrad.",
                      "author": "georgeyellow",
                      "created": 1617508439,
                      "upvotes": 2,
                      "replies": {
                        "gtbe1j1": {
                          "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtbe1j1/",
                          "text": "I mean, I'd definitely try finishing lol. But I def wouldn't blame you if you decided not to finish! But for what it's worth.... you can do it!!",
                          "author": "good4nothingnobody",
                          "created": 1617509444,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "gtaurw3": {
                      "link": "/r/CollegeRant/comments/mjfdnt/online_courses_are_horrible/gtaurw3/",
                      "text": "ughhhhhh well an early congrats that you’re graduating!! so exciting !!!! it really does suck that this really ruined your view on school!",
                      "author": "coraline_button_",
                      "created": 1617497408,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634062658
}