{
  "sid": "pou9da",
  "link": "/r/CollegeRant/comments/pou9da/the_most_disorganized_lab_ever/",
  "title:": "the most disorganized lab ever",
  "text": "this semester i’m taking organic chemistry lab. we’re 4 weeks into the semester yet today was the first day we’ve actually done an experiment. the professors are extremely unorganized and just now got the lab set up. our class usually starts at 9 am but last class the professor told us to be there at 8 am in the classroom today so we could watch a lab safety video. the entire class was there in the classroom at 8 am waiting for the professor. we waited. and waited. and waited. almost AN HOUR later, the professor comes in YELLING at us that we should always be in the lab by 9 am. we reminded him that he told us to meet him in the classroom at 8 am last class and he said “WELL YOU SHOULD BE IN THE LAB. THE TV HASNT BEEN SET UP YET”. how were we supposed to magically know that?? why is your disorganization something to yell at us over?? why have you been here for an HOUR and are just now saying something?? once we got to the lab, he very vaguely explained the experiment and what supplies we’d need then said “ok get started”. we had to tell him that he had given us no supplies or told us where to find them. it took ANOTHER HOUR for everyone to get the necessary supplies because half of them were missing or broken. then when we went to get the samples we needed (cyclohexane and toluene), the professor realized they didn’t have them. at all. so we literally used vitamin water for the lab that the professor made a student get from the vending machine. the fact that i have to pay an extra lab fee in my tuition and buy a lab coat, safety googles, padlock, textbook, and composition notebook for this bullshit pisses me off. i have never seen a more disorganized class in my life.",
  "author": "trinitypisarsky",
  "created": 1631725449,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "hd1gwmd": {
      "link": "/r/CollegeRant/comments/pou9da/the_most_disorganized_lab_ever/hd1gwmd/",
      "text": "WTF. This is the worst case of disorganized prof I've ever heard.",
      "author": "Quiet-Use989",
      "created": 1631765550,
      "upvotes": 2,
      "replies": {}
    },
    "hczmpog": {
      "link": "/r/CollegeRant/comments/pou9da/the_most_disorganized_lab_ever/hczmpog/",
      "text": "That’s some serious bullshit. Sorry you had to deal with that.",
      "author": "Crochitting",
      "created": 1631734993,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634062354
}