{
  "sid": "pewkau",
  "link": "/r/CollegeRant/comments/pewkau/one_bad_semester_ruined_me/",
  "title:": "One bad semester ruined me",
  "text": "I always heard from advisors, professors, and other students that one bad semester is okay, and you’ll recover. After having the worst mental health of my life last semester and not getting any grades above a C- I just feel like the rest of my college experience (three semesters) is ruined.\n\nMy GPA dropped seven points. I was next in line for a leadership position in an organization and was passed up because I’m “not reliable”. I was ousted from another organization. I was kicked out of the honors program. My invitation for a prestigious networking event was rescinded. I lost a scholarship. I had to drop my minor because I wouldn’t finish in time after needing to retake a class for my major. My friends stopped inviting me places because I was always such a downer and don’t care to see me now that we’re back on campus. I lost everything I had to lose and I’m not sure what to do next, because everything I spent the first half of my college career working towards is now gone and I can’t get it back. I just wish I could have a do-over.\n\n\nTL;DR I was removed from all of my extracurriculars and lost most of my friends because my mental health faltered for four months.",
  "author": "ThrowAway_BadSem",
  "created": 1630375752,
  "over_18": false,
  "upvotes": 25,
  "upvote_ratio": 0.94,
  "comments": {
    "hb34xgp": {
      "link": "/r/CollegeRant/comments/pewkau/one_bad_semester_ruined_me/hb34xgp/",
      "text": "Thats unfortunate what happened to you, but at least you still have a shot on graduation, the only reason you went to uni is to get that degree, so finish strong and take mental health breaks if needed. I wish you the best and you've got this!",
      "author": "Turtleisim",
      "created": 1630433599,
      "upvotes": 4,
      "replies": {
        "hb560k6": {
          "link": "/r/CollegeRant/comments/pewkau/one_bad_semester_ruined_me/hb560k6/",
          "text": "This was actually super helpful and made me feel a lot better. Thank you kind stranger :)",
          "author": "ThrowAway_BadSem",
          "created": 1630466011,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hb1kphg": {
      "link": "/r/CollegeRant/comments/pewkau/one_bad_semester_ruined_me/hb1kphg/",
      "text": "The next time you recover, enroll in a different school for a new start",
      "author": "TheRapidTrailblazer",
      "created": 1630408341,
      "upvotes": 2,
      "replies": {
        "hb1vb80": {
          "link": "/r/CollegeRant/comments/pewkau/one_bad_semester_ruined_me/hb1vb80/",
          "text": "I’m three semesters away from graduating one of the top programs in the country in my field. I’m not transferring.",
          "author": "ThrowAway_BadSem",
          "created": 1630414523,
          "upvotes": 5,
          "replies": {
            "hb1zvaf": {
              "link": "/r/CollegeRant/comments/pewkau/one_bad_semester_ruined_me/hb1zvaf/",
              "text": "Understandable",
              "author": "TheRapidTrailblazer",
              "created": 1630416742,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hb0vtl5": {
      "link": "/r/CollegeRant/comments/pewkau/one_bad_semester_ruined_me/hb0vtl5/",
      "text": "Most of those things are recoverable. No shame in retaking classes, im doing that right now",
      "author": "taybay462",
      "created": 1630387903,
      "upvotes": 10,
      "replies": {
        "hb1vgb1": {
          "link": "/r/CollegeRant/comments/pewkau/one_bad_semester_ruined_me/hb1vgb1/",
          "text": "Yeah you’re right. I don’t mind retaking the classes but I’m so upset I had to drop my minor just to retake my major classes.",
          "author": "ThrowAway_BadSem",
          "created": 1630414596,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hb0eqd1": {
      "link": "/r/CollegeRant/comments/pewkau/one_bad_semester_ruined_me/hb0eqd1/",
      "text": "Maybe losing these things wasn’t such a bad thing. It frees you up to rest and recoup while focusing on the classes you need in order to finish your major.",
      "author": "Crochitting",
      "created": 1630378055,
      "upvotes": 14,
      "replies": {}
    }
  },
  "updated": 1634061507
}