{
  "sid": "mp3dyl",
  "link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/",
  "title:": "School warns us about a rise in cases, making us think its OUR fault, yet they're allowing tours in the dorms... #logic",
  "text": "TL;DR: school is prioritizing new freshmen over the existing student population and their health\n\nWe've been getting emails warning us about a rise in cases and the school is saying it's because we're letting non-resident guests in and going off-campus. Meanwhile, every Saturday we see giant tours going on - they aren't social distancing and they're even coming in to see our dorms! My dad can't come in to use the bathroom but yeah sure let's allow a bunch of strangers in. I'm so glad I'm graduating in June, this is ridiculous... we get tested at least once a week! We aren't doing anything wrong! I have to fill out a form to leave campus for groceries!",
  "author": "cr1ss-b",
  "created": 1618188637,
  "over_18": false,
  "upvotes": 37,
  "upvote_ratio": 0.95,
  "comments": {
    "gu9lim8": {
      "link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/gu9lim8/",
      "text": "It's always deflection with these people. But hey, the admin people on top need their yearly bonus checks, stat!",
      "author": "KaiserWilhelmDaThird",
      "created": 1618242836,
      "upvotes": 2,
      "replies": {
        "gu9tmi5": {
          "link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/gu9tmi5/",
          "text": "Of course, and the schools president just got a giant bonus! That money has to come from somewhere!",
          "author": "cr1ss-b",
          "created": 1618246383,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gu7obbt": {
      "link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/gu7obbt/",
      "text": "[deleted]",
      "author": null,
      "created": 1618194509,
      "upvotes": -6,
      "replies": {
        "gu7wnrb": {
          "link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/gu7wnrb/",
          "text": "Just out of curiosity, how is it our fault? I personally haven’t had a guest in my room since... January? I don’t know about other residents and what they’ve done but we’ve been given a lot of rules to follow - we get frequent testing, temperature checks every time we enter our dorm building. Like, do you see something in my post that places the blame on us students?",
          "author": "cr1ss-b",
          "created": 1618199455,
          "upvotes": 6,
          "replies": {
            "gu9subs": {
              "link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/gu9subs/",
              "text": "[deleted]",
              "author": null,
              "created": 1618246045,
              "upvotes": 1,
              "replies": {
                "gu9thqk": {
                  "link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/gu9thqk/",
                  "text": "Our school isn’t big on parties since it’s mostly commuters but I’m sure there are secret parties going on, yeah. Back when we were allowed to have guests in the room we were encouraged to report hearing more than the allowed amount of people in neighboring rooms (in my hall the maximum amount of people per dorm I THINK was 4). I honestly forgot parties were a thing though, my bad 😅",
                  "author": "cr1ss-b",
                  "created": 1618246325,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "guavfbz": {
          "link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/guavfbz/",
          "text": "Yes. Both are at fault. I stay in my dorm almost all the time with the exception of class and work. There's too many morons here going out and partying. Last Halloween, they threw a Halloween party and surprise surprise, some morons caught it. The college didn't punish them which is the most infuriating part.",
          "author": "dank666420",
          "created": 1618263174,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634061503
}