{"sid": "igewan", "link": "/r/CollegeRant/comments/igewan/just_found_out_all_my_classes_can_be_completed/", "title:": "Just found out all my classes can be completed remotely...after I moved in.", "text": "I have to say that I’m not surprised as I was expecting something like this would turn out when my college announced we’d be resuming in person classes. Now I have to deal with the stress of obtaining any kind of housing/ meal plan refund and the possibility of moving out of the dorm. All this comes to light after they have my money...convenient to say the least.", "author": "Realisticfiction18", "created": 1598371021, "retrieved": 1632950825, "over_18": false, "upvotes": 120, "upvote_ratio": 0.99, "comments": {"g2x1ch3": {"link": "/r/CollegeRant/comments/igewan/just_found_out_all_my_classes_can_be_completed/g2x1ch3/", "text": "The school cut back my financial aid after canceleling 2 of my classes and saying they had NONE open to replace them.... so im halftime, it screwed my graduation date and aid... i feel ya man, they want the money honey.", "author": "ComputeBeepBeep", "created": 1598454915, "upvotes": 1}, "g2ueiaj": {"link": "/r/CollegeRant/comments/igewan/just_found_out_all_my_classes_can_be_completed/g2ueiaj/", "text": "I’m in the same situation except I signed the lease for my apt then found out that I could just stay at home and do zoom instead. I mean I was kinda hope that I could attend “in person” classes for this fall but now it’s just not worth it anymore. I don’t know if I should just sublet this apt then go home or keep this place for the next semester if thing will be back to normal then?", "author": "babatom", "created": 1598390468, "upvotes": 3}, "g2u3am5": {"link": "/r/CollegeRant/comments/igewan/just_found_out_all_my_classes_can_be_completed/g2u3am5/", "text": "Yeah, that's each college for you. My college did that with a week and a half notice, that even the professors didn't expect. I went from supposed to be studying abroad to now doing class at home, as they decided to give only half the student body singles rooms.", "author": "ChewingSeok", "created": 1598384972, "upvotes": 4}, "g2tonzy": {"link": "/r/CollegeRant/comments/igewan/just_found_out_all_my_classes_can_be_completed/g2tonzy/", "text": "To everyone saying all colleges are doing this... my school actually gave us $1500 to not live on campus, and gave us a refund for housing, meal plan, and parking", "author": "gotthatsushi", "created": 1598377996, "upvotes": 23}, "g2tnvqo": {"link": "/r/CollegeRant/comments/igewan/just_found_out_all_my_classes_can_be_completed/g2tnvqo/", "text": "This is why I decided long ago that I would be doing remote classes even if they offered in person classes... in person isn’t gonna last more than 3 weeks (my guess).", "author": "KojaCola", "created": 1598377623, "upvotes": 26}, "g2tmput": {"link": "/r/CollegeRant/comments/igewan/just_found_out_all_my_classes_can_be_completed/g2tmput/", "text": "This was every college’s plan. Get the money for housing and then do the right thing", "author": "perfectbarrel", "created": 1598377073, "upvotes": 73}}}