{"sid": "ngb3hq", "link": "/r/CollegeRant/comments/ngb3hq/i_got_a_d_in_my_class_because_of_one_assignment/", "title:": "I got a D in my class because of one assignment.", "text": "I was doing really well this semester too and I turned it on my assignments and did good on my final too. I thought that I was going to get a good grade for this class at the end of semester. However, there was this group project that I did and I thought that only one person had to turn it in the group, but I was wrong and got a zero. I feel so numb and disappointed in myself. I emailed the teacher about this and he said, \"The team member who does not submit the documents by the due date will receive a ZERO grade.\" My school this semester is doing a pass/fail this semester (thankfully). Meaning that my credit will be counted, but my GPA will not be affected. I think what got me is that the hard work I just put in and this one assignment just duked it. I just needed to rant. That's for hearing my story.", "author": "Djgogi059", "created": 1621443601, "retrieved": 1632842347, "over_18": false, "upvotes": 293, "upvote_ratio": 0.98, "comments": {"gypu97q": {"link": "/r/CollegeRant/comments/ngb3hq/i_got_a_d_in_my_class_because_of_one_assignment/gypu97q/", "text": "Thank you u/Djgogi059 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1621443602, "upvotes": 1}, "gyudut5": {"link": "/r/CollegeRant/comments/ngb3hq/i_got_a_d_in_my_class_because_of_one_assignment/gyudut5/", "text": "I completed but forgot to turn in one 500 word assignment (did it on work computer) and it nuked my grade from a 98 to a 78", "author": "ElonMusksColonoscopy", "created": 1621530465, "upvotes": 3}, "gysy8nr": {"link": "/r/CollegeRant/comments/ngb3hq/i_got_a_d_in_my_class_because_of_one_assignment/gysy8nr/", "text": "My dumbass read it as the smile (:D) instead of the alphabet", "author": "Uchia_Soske", "created": 1621503851, "upvotes": 3}, "gyr8p4o": {"link": "/r/CollegeRant/comments/ngb3hq/i_got_a_d_in_my_class_because_of_one_assignment/gyr8p4o/", "text": "I have to ask, did it explicitly state on the syllabus or group project guidelines that only one person turns in stuff?", "author": "pistachiopanda4", "created": 1621465083, "upvotes": 29}, "gyqt9fx": {"link": "/r/CollegeRant/comments/ngb3hq/i_got_a_d_in_my_class_because_of_one_assignment/gyqt9fx/", "text": "Some schools only give P or S grades if you get at least a C or C-, so that's something you should consider. You're lucky they're doing P/F this semester. Mine only did it first quarter of the pandemic.", "author": "khgsst", "created": 1621458140, "upvotes": 29}, "gyqqb9d": {"link": "/r/CollegeRant/comments/ngb3hq/i_got_a_d_in_my_class_because_of_one_assignment/gyqqb9d/", "text": "I was holding a B all semester but ended up with an F. Professor didn’t accept my late submission for final paper. Shit suckss but its not the end of the world!!", "author": "backonthemoon", "created": 1621457113, "upvotes": 24}, "gyqd7ef": {"link": "/r/CollegeRant/comments/ngb3hq/i_got_a_d_in_my_class_because_of_one_assignment/gyqd7ef/", "text": "I feel like you should push back on this. It seems like such an odd technicality to take away FULL points from your hard work. Can you explain that you completed the project (and what parts you did) and that you feel it is unfair to receive a 0 on an assignment where you worked equally as hard as other students? You could also say that other students on the project could vouch for you. I could understand a minor deduction in points for not reviewing the submission policy but this just seems mean and overly punitive.", "author": "Appropriate_Froyo", "created": 1621451504, "upvotes": 117}}}