{"sid": "nn2rri", "link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/", "title:": "I feel so unprepared and I'm terrified of failure. I don't know what to do.", "text": "Apologies in advance - this may seem a little all over the place.\n\nFor context, I (21F) graduated high school in 2018. I did really well in school and always wanted to go to college, but my family is poor and always has been, so I wasn't sure if college was in the cards for me.\n\nThe plan at the time of my graduation was to take a gap year or two so I could learn how to drive and get a full-time job. That is... until I realized how debilitating my anxiety is. \n\nI hadn't learned how to drive yet because, for some reason, even *thinking* about being behind the wheel would cause me to panic. But the longer I waited, the worse it got, and the harder it was to even schedule driving lessons. So, long story short, now I'm 21 and still can't drive.\n\nAnd, super conveniently, I have a similar fear with working. I've had a couple different jobs, but have ultimately left all of them because of the toll they had on my mental health. We're talking sobbing, hyperventilating, and full-on panic attacks before work every. single. day. \n\nEvery second I spent outside of work, I was worrying about having to go back into work. I'd panic as the minutes passed by, my free time slipping away second by second.\n\nSo now I'm 21, don't have a job, don't drive, and my whole life consists of my fiance, my mom, my brother, and my therapist.\n\nWith the encouragement of said therapist, and after a year of unsuccessfully trying to manage my anxiety around driving and work, I finally decided to go to college. I've known I wanted to go, and it would provide me with a way to step outside my comfort zone and grow while still doing something that I'm passionate about (learning). Maybe it could even give me the needed push to finally learn how to drive, or provide an opportunity for employment that I don't hate.\n\nI've applied to my local community college, I've filled out the FAFSA, and I know financial aid is supposed to cover my costs 100% for my first two years... but I'm stuck.\n\nI can't drive right now. I can't work right now. What if I never can? How do I navigate that? \n\nOr what if I CAN work, but it has to be the exact right fit - how do I find that perfect fit when I quite literally cannot afford to figure it out by trial and error?\n\nDon't get me wrong, I know my interests. They're just not usually profitable unless you go for a Master's or higher - and I'm not even interested in most of the suggested career paths in these areas, at least not right now, although I realize that's subject to change.\n\nI know a lot of people might think that maybe college just isn't good choice for me, but learning truly is my passion. The classroom tends to be where I'm most comfortable. It's the only way I can see out of my current stagnation. The thought of going back to school finally has me excited about my future!\n\nBut the weight of the possibility of failure is heavy on my mind. I don't doubt I'll do well in school, I just worry about how to pay for schooling after my first two years... and all the stuff that comes after I graduate.\n\nI don't even know how to properly prepare for my future. Advisors want you to pick a career and work backwards to figure out your course map. Students and teachers tell you not to worry too much about it because you'll figure it out as you go.\n\nBut truly, how do you navigate a situation where you don't know what your end goal is AND you don't have the resources required to be able to figure that out organically?\n\nTL;DR: I'm 21 and starting college late as a low-income student with severe anxiety. I know my interests, I know what I want to learn, I just don't know if I can pay for school or even make it in the traditional workforce. I'm lost and overwhelmed and don't know what to do.\n\nI don't quite know what I'm looking for here. Maybe just a sense that things will turn out okay? Or confirmation that I'm not the only one who feels overwhelmed by this whole system? Resources? Anything, really.\n\nIf you made it all the way to the end, thank you.", "author": "celestialcynic", "created": 1622222424, "retrieved": 1632950388, "over_18": false, "upvotes": 175, "upvote_ratio": 1.0, "comments": {"gzwy1pl": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzwy1pl/", "text": "If you're most comfortable with a school environment, perhaps you should consider a career in teaching.", "author": "SadWolverine24", "created": 1622325754, "upvotes": 1}, "gzw0dtu": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzw0dtu/", "text": "It might help to switch your question from “What do I want to *be*?” to “What do I want to *do*?” Lots of people work jobs in fields they aren’t super passionate about, but they love their job because they’re well-suited to their *job role and responsibilities*. Keep your eyes and mind open to what this might mean for you. When you’re working, consider what parts of the jobs you love and don’t care for. Build skills and tailor course work in the parts that you love.\n\nYou might just have to trust that it’s okay not to know where you’ll be 5 years in the future. When you have bad anxiety, one of your go-to coping mechanisms is to plan ahead, so I realize this is a *big* ask for you. Open your mind and your eyes to opportunities that open around you. Almost no one goes into college knowing their life plan. If along the way, you consider practicality in your decision-making, as well as following what interests you, you can avoid a lot of college financial pitfalls. If you can work *anywhere* during school, even if it means going to school part-time, to gain experience and confidence (at least once your anxiety is managed) while also staying afloat financially, that might be an ideal combination.", "author": "FakinItAndMakinIt", "created": 1622308620, "upvotes": 1}, "gzv0ywp": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzv0ywp/", "text": "I could've written a big chunk of this myself. I'm also 21 and was terrified of driving and working. Tried working and my anxiety was way too severe. Learned to drive at 18 and I love it now. Went to a four-year for a semester and left to go back to community college. CC was terrifying at first but I feel much more comfortable there now. It's not as bad as your mind is making it out to be! Also, you're mentioning a lot of worries about the future. Well, you won't know how that'll turn out until you just continue to live your life and time passes on. So, might as well just try something! You said you know what you like...you can look up possible careers based on those areas and just keep them in the back of your mind. Maybe shadow/volunteer instead of working while doing classes or during breaks. It's okay not to know what you want to do. People sometimes never know what they want to do and just work a bunch of different jobs. That's okay. You'll be okay.\n\nI also feel failure...it's one of my biggest fears. But I fear the regret of not trying more. Even if you \"fail,\" you can at least say you tried, and that's worth a whole lot IMO.", "author": "roseyelephant33", "created": 1622287470, "upvotes": 2}, "gzusme9": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzusme9/", "text": "I was and am still in the same boat as you. I hated every job I started, nothing in college interested me (thanks depression!) And I still haven’t learned how to drive at 21. Honestly, I say start slow. Take a class or two that interests you, maybe look into possible career paths, etc. you can do this. If you need to commiserate or anything, just message me. we got this!", "author": "Consistent_Spring", "created": 1622279331, "upvotes": 1}, "gzu2qmz": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzu2qmz/", "text": "Just because you couldn't clear you driver's license test has no correlation with how you'll do in college. About to be 23 and I still cannot drive. I am doing my masters at the moment.\n\nFor thinking about that you'll fail. I believe it's one fear almost everyone goes through. One amazing thing is that you know what you want to do. You know your interests and you need to realise how great that is. I still am so unsure of what I actually want. Also, you need to realise failure isn't the end of the world and failing in one thing doesn't mean you'll fail in everything.\nUnless you are Amy Santiago, I don't think anyone actually knows what they want to do in the future.\n\nWork on your anxiety in therapy. Hopefully you'll be able to learn how to manage it. All the best!!", "author": "android0698", "created": 1622258404, "upvotes": 1}, "gzu2g4u": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzu2g4u/", "text": "Maybe you could just do what I did. I became a college professor. I feel most comfortable in the classroom, always have, young people make me angry, so college seemed to be the only place I wanted to be to work. \n\nNow, I don’t have crippling anxiety. Quote the opposite, in fact. My wife is jealous of how chill I am in nearly every situation (however I am known to rant and get irritated from time to time). But, anxiety never affects my day to day. I never worry that things won’t just always be okay.\n\nHowever, I could tell that I wouldn’t be happy doing any job I thought about. I have worked many jobs on the way to teaching college. Most of them I worked in the understanding that they were stepping stones that would take me there. Mowing lawns, working at a bookstore, waiting tables, working at a distribution center, etc. I didn’t like any of these jobs, but I knew they were temporary. Now, I’m where I want to be.\n\nCurrently, I am off of work. Have been for three weeks. I have about 17 weeks of intense work in the fall and spring, one or two easy classes to teach in the two summer semesters, and the rest of the time off. I make my own classes, lessons, syllabus...I teach them what I think is most important to learn in each subject.\n\nLike you, I always loved school. I never wanted to leave. College professor is a great way to make that happen.", "author": "chrisrayn", "created": 1622258230, "upvotes": 7}, "gzturqp": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzturqp/", "text": "I used to be really scared of driving, but now I can’t imagine not being able to drive or have a car. Being able to drive yourself wherever you want to go without having to rely on someone else or wait on others is a whole new level of freedom.\n\nAlso, internships are a great and important way to prepare for a career. Not only does it look good to employers, but it’s an opportunity for you to learn new skills, push you outside of your comfort zone, and explore a potential career path. It’s easier to go from college to internship to job than college to a full time job. I would definitely recommend getting an internship before you graduate! I didn’t because I floated between majors and graduated too fast but I sure as hell wish I did.", "author": "irisapfel", "created": 1622253843, "upvotes": 3}, "gztojgn": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gztojgn/", "text": "Hi OP,\n\nI’m usually a silent reader and don’t comment much, but when I saw your post on the main page, I knew I had to respond. \n\nI had some parallel experiences with the circumstances you’ve described (also family situation) and I just want to tell you that I understand and I can relate.\n\nI got my license with 21 as well (while all of my relatives and friends had it with 18) and trust me, there’s nothing wrong or worrying about getting it „later“. I do think that it’s also often time peer pressure which is forcing us somehow to finish things super-fast while in reality we do have enough time to complete them.\n\nI’ve also struggled my whole life with social anxiety and mental health, but when I saw other girls in my age working perfectly fine (even though they had their issues or worse) I somehow swapped my mindset and live by the motto „the only way out is through“. I do have to admit that this kind of mindset implementation doesn’t work overnight - you just have to do you. Time won’t stop and as you grow older, you will find that there is no use sometimes to worry about something, as life is life and you can’t avoid every confrontation and uncomfortable settings.\n\nLife’s pretty short so I’m happy you’re seeing a therapist and really hope you’ll get on track by feeling less overwhelmed and more yourself. You’ll get through these blockades (if I may call them so), and continue living.\n\nWish you all the best 🍀", "author": "DunDipus", "created": 1622250287, "upvotes": 6}, "gztk4ok": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gztk4ok/", "text": "Prioritize your challenges and then solve them 1 by 1.  Don't look at things in totality.  It will over-whelm you.", "author": "-Economist-", "created": 1622247706, "upvotes": 1}, "gztjy9p": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gztjy9p/", "text": "Even in college, one of my jobs was one I’d worked since I was 16. Don’t be afraid to go back to working the jobs you did as a teenager to help build your confidence in showing up to places on time, problem solving, and dealing with the public. Better yet, go back to whichever job you worked at 15... I’m thinking of the summer I turned 15 and worked at the ball park. They’d probably make you a manager and being surrounded by immature teenagers will help you realize you truly are capable of working a ‘grown-up’ job.\n\nEdit: Not sure why I’m being downvoted. I worked my ‘teenager’ job through my early 20s and I don’t see it as anything to be ashamed of. It helped me pay for school and get extra job experience while I figured things out. I don’t think there should be pressure to get a ‘career’ job so early on.", "author": "FakinItAndMakinIt", "created": 1622247609, "upvotes": 1}, "gzt2ju3": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzt2ju3/", "text": "Try Magnesium supplements for driving (and general) anxiety, it worked wonders for me. And I didn't learn to drive til later as well. You're young af, don't count yourself out before you start.", "author": "cymonesunshine", "created": 1622238136, "upvotes": -1}, "gzt1hau": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzt1hau/", "text": "As someome with bad anxiety my first month of CC was horrific, I ended up being alright in the end though. \n\nAdvice from my experience: If times start to get rough just try to hang in there and NEVER feel afraid to take a day off. You'll eventually adjust, it will soon feel routine and even enjoyable at times.", "author": "toofeduptocare", "created": 1622237610, "upvotes": 4}, "gzsx8eg": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzsx8eg/", "text": "I personally feel a lot more anxious to have other people driving me anywhere. At least when you’re behind the wheel, you’re the one in control.", "author": "gloriarunsthis", "created": 1622235506, "upvotes": 13}, "gzssw9u": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzssw9u/", "text": "[deleted]", "author": null, "created": 1622233412, "upvotes": 5}, "gzslwnz": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzslwnz/", "text": "Still don’t have my license at 22. Much too anxious and terrified. That has no relationship with how successful you’ll be in college, I promise. 💕", "author": "olivep224", "created": 1622230154, "upvotes": 26}, "gzsivav": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzsivav/", "text": "do u know what you’d like to study yet? you seem very passionate about education, so id suggest that. and u could maybe even ask ur professors if ur school is hiring or maybe if they’re hiring a TA, maybe your anxiety wouldn’t be so bad with a job in the environment that u already love and r comfortable in. even if long term working in a school isn’t ur goal, maybe starting ur first job in a school would be good for u? just to get comfortable with working?", "author": "peenisbeenis", "created": 1622228748, "upvotes": 7}, "gzsgj81": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzsgj81/", "text": "Good luck you can make it I believe in you it won't be easy especially with your anxiety but if you want to make it happen I'm sure you can.", "author": "bald_butte", "created": 1622227677, "upvotes": 3}, "gzsf3r0": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzsf3r0/", "text": "I went to college at 24 as an independent because my parents were horrible people who couldn't even be bothered to let me see their taxes to fill out the fafsa so I had to wait. It was hard at first but you can do it! My professors really helped me out my first year, don't be discouraged you can do it.", "author": "Scorosin", "created": 1622227109, "upvotes": 31}, "gzscgea": {"link": "/r/CollegeRant/comments/nn2rri/i_feel_so_unprepared_and_im_terrified_of_failure/gzscgea/", "text": "Driving is terrifying, I totally agree. I didn’t get my license until age 20 and failed my test once, and my stepmom didn’t get hers until she moved to the US as an adult. There’s a lot of pressure in this country to learn to drive young, (I assume you’re in the US) but if you live in a place with good public transit it really isn’t necessary. I’ve ended up driving a lot due to Covid, but otherwise I’d be totally fine just taking the bus everywhere for most of college. In any case, it’s not the end of the world if you can’t drive yet.\n\nOnce you do get behind the wheel, it is super scary at first that such a huge vehicle is in your control but eventually you realize that everything is designed to make you as safe and in control as possible, and the only real difficult parts of driving all happen in the parking lot, where the stakes are lowest.\n\nAs for jobs, I am in the same boat; this summer is going to be my first real job ever and I’m super anxious about it. There are so many forms to fill out and application steps to go through, it can almost seem like it’s not worth it at first, but given time I’m sure you will find a job that does not cause you too much anxiety. I’m currently working as a paid mentor through my university, which has worked really nicely for me since I want to teach when I graduate, although it’s only a couple hours a week which is why I don’t call it a real job. If your college has any opportunities like that, or a work-study program they might be great, less stressful options for you, since college jobs often are easier to apply to than others.\n\nAnyway, hope everything works out for you soon! This pandemic has put a wrench in the lives of everybody, especially those our age, so no reason to feel bad about “falling behind” in life.", "author": "Quantum-Bot", "created": 1622225944, "upvotes": 10}}}