{"sid": "d1xuhk", "link": "/r/CollegeRant/comments/d1xuhk/my_first_semester_was_in_fall_2014_as_of_now/", "title:": "My first semester was in Fall 2014. As of now, September 2019, I have a mere 43 credits and my gpa is a 1.9.", "text": "Anytime you get discouraged, just remember that you aren't anywhere near as much of a fuck-up like me, a dude who fell into crippling depression, checked out in his 5th semester (I only signed up for three classes and flunked two of them and got a D in the other one), and haven't registered for a single one since that one (Fall 2016).\n\nI couldn't even register for this one if I wanted to. The system wouldn't even let me.\n\nI've been bumming it at my parents (I live down the road from them) and just have been lying to them that I've been going, except my dad has had enough of my caginess and tonight wants me to explain everything, so I'm just like, absolutely fucked. Might even get kicked out. All I've done is play video games, argue on the internet, watch porn, and despair at how my life is circling the drain and how even the most desperate gas station wouldn't fucking hire me. I don't even buy video games that much anymore since I get like 40 bucks every second Wednesday from my parents and that's it. The only other income I have is from writing porn for people, because writing is my only goddamn skill and I'm halfway decent at writing porn.\n\nI should just make it official and formally withdraw, but I'm too much of a bitch to actually go through with it.\n\nJust remember throughout this current semester, and all your following ones: no matter how hard the coursework seems, no matter how behind on homework you are, no matter how scared you are about exams, you're still fighting and doing something with your life. Me, I don't fucking know what I'm doing. My major is Modern Language Studies, but my fascination with languages and linguistics hasn't really panned out to any kind of actual talent in that field. I'm not smart enough for STEM--I had to take that shitty \"Math for Non Math Majors\" class in my first semester (College Algebra w/Applications) and I got a fucking D in it, because it turns out being halfway-decent at middle and early high school math doesn't mean shit when it comes actually have any talent in that stuff--it was just fucking easy as hell because it was ya know, middle school. I'm not a STEM Master Race person, and I respect the soft sciences majors, but they aren't anything for me either. My sole artistic skill is writing. I can't even take a fucking art major that will cost me a shitload only to end up as some barista! What the fuck kind of major can I even fucking take, jesus christ. I can't do anything. I'm some fucked-up depressed ADHD person who can barely focus without pills with zero social skills who couldn't even work a goddamn cashier. I can barely talk to people irl without stumbling over my words and my hygiene sucks because I'm too depressed and too scatterbrained to actually shower. You probably don't have to guess that I'm a loveless virgin who has never gone out with anyone, much less had a girlfriend or boyfriend.\n\nJust please don't fuck up like I did. The world doesn't need another deadbeat neet chugging mexican sodas down their gullet while watching Counter-Strike tournaments and shitposting on the internet. I love my college, it's an amazing school, and I love my hometown (outside of the fact that you need a car to get goddamn anywhere. There are thousands of people going there. Pretty sure I'm just a statistic. I remember hearing that if you can just get past the first two years of college you're statistically very likely to finish all four years. Well, with 43 credits I barely got past my first fucking year, goddamn.\n\nThis is super long because I took my adhd medication and it makes me ramble like crazy. It also gives me horrid insomnia too which is why I stopped taking it two years ago which coincidentally happened to coincide with my academic performance plummeting off a cliff with a supermagnet at the bottom while covered in ten tons of iron filings.\n\nI haven't even mentioned that I took out loans for these awful semesters and being out of school for so long means they defaulted because of course I couldn't tell my parents (who would have had trouble paying for them anyway) and I didn't have a job so now I owe like 14K, which yes, I know, is peanuts compared to a lot of people in the US but like fuck, how would I even pay for this shit. Even that little would be tough on my parents.\n\nIn a little under three hours my dad will get back from his shitty job at Geico that he hates, and whose paycheck I've been squandering. I don't expect a pity party for this, I understand this is just all my shitty decisions in life coming to roost. It's just I was able to hide them from my parents until now. Assuming he isn't so exhausted he just delays the Talk(TM) like he's been doing for the past two weeks I'll have to come clean and then I dunno, I may not have a computer anymore or I may get kicked out, and I don't have any local friends or family with a couch to sleep on. My life of just fucking off and delaying the consequences is about to end and welp, it's really mostly my fault in the end. This + a boomer dad who is the definition of a reaganite \"just get a good job, you lazy fucking millennial\" and demands nothing but excellence from his son with little emotional support + a completely insane narcissist conspiratorial Karen of a mom who's been emotionally torturing me for the past half-decade (probably longer, I was just too young and unable to realize it yet) = a toxic fucking mess. I don't even expect most people to read this. Feel free to call me a fuck-up, a shitty example of every liberal male millennial stereotype, or just a lazy fucking moocher piece of shit asshole. I admit it. I am one.\n\nGotta get that percent of useless college dropouts from somewhere I guess. We can't all be winners who graduate with a good job and Make It.", "author": "Frostav", "created": 1568066315, "retrieved": 1632951641, "over_18": false, "upvotes": 31, "upvote_ratio": 0.97, "comments": {"ezuqytg": {"link": "/r/CollegeRant/comments/d1xuhk/my_first_semester_was_in_fall_2014_as_of_now/ezuqytg/", "text": "I just sent you my email. Email me anything, anytime. I will always respond, ok. I'm 26 and have had a hard time with college too.", "author": "throwawway61", "created": 1568159097, "upvotes": 2}, "ezsqgxf": {"link": "/r/CollegeRant/comments/d1xuhk/my_first_semester_was_in_fall_2014_as_of_now/ezsqgxf/", "text": "We become different people with different goals, different talents, and different objectives as the years go by. In my teens I got out of high school with a third grade math level. When I was in my 20s I hid away from a worthwhile degree and wasted loan cash on a shoddy writing degree. As one would expect that didn't pay itself off. In this newish decade I am back in school (for my MS)*, within the hell that is the STEM field. Feeling stupid af for every colossal Master Race STEM attempt I take. I have gotten a hell of a lot further than I knew I could. In my 20s I am sure I wouldn't have made it but in this decade, I am a different person with different talents, priorities, and a more developed and functional self hatred. You're not a waste. You are a person going through life and this is a point you don't like the best. That's all. It can and will change.", "author": "DTLAgirl", "created": 1568103805, "upvotes": 1}, "ezsfw0u": {"link": "/r/CollegeRant/comments/d1xuhk/my_first_semester_was_in_fall_2014_as_of_now/ezsfw0u/", "text": "I don't know the history between you and your parents, but I wish you'd be a little less bitter than your dad, who still works a shitty job he hates to support his now 23 (?) year old son. That aside, if your ADHD makes education unbearable, I'd say that in the long term, you should look towards trade school or an apprenticeship. Becoming a plumber or electrician can actually be quite lucrative for you. I wouldn't recommend going back to college - from what it sounds like, it's really not a good fit for you, and you can't teach a fish how to fly.\n\nI hope your talk with your dad went well!", "author": "ripprinceandrey", "created": 1568090234, "upvotes": 5}, "ezs5lue": {"link": "/r/CollegeRant/comments/d1xuhk/my_first_semester_was_in_fall_2014_as_of_now/ezs5lue/", "text": "OOOf, the paths I could be on, this made me feel strangely good about simply taking longer to graduate.", "author": "SmytheOrdo", "created": 1568083187, "upvotes": 2}, "ezrr0wk": {"link": "/r/CollegeRant/comments/d1xuhk/my_first_semester_was_in_fall_2014_as_of_now/ezrr0wk/", "text": "Realize, develope, overcome.\n\nYou have a problem - now fix it.\nYou feel defeated - work towards winning. \nObstacles are set against you - break through them. \n\nIt's not as simple as it sounds, but it all starts with getting up from your bed and moving towards a better future.\n\nTomorrow is a new day. You can either wallow in your self-pity or become the person you had once envisioned yourself as. Come up with a plan to get your life moving forward and attack it straight on.\n\nI believe in you.", "author": "RanierMT", "created": 1568077596, "upvotes": 12}}}