{"sid": "jd5oc0", "link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/", "title:": "Those without friends - how are you guys doing?", "text": "Like many others, I'm a friendless freshman stuck at home. The loneliness and isolation are getting to me. I've been trying to reach out to people, but they're all phone calls or behind a screen. It's getting harder and harder to keep my spirits up. I know I sound whiny and overdramatic, but I feel like I'm never going to have friends or a relationship again. It's pessimistic and I'm trying to enjoy the alone time at home, but I miss having people my age around so much.\n\nFor those in a similar situation, how are you? How are you getting through this?", "author": null, "created": 1602977824, "retrieved": 1632843511, "over_18": false, "upvotes": 37, "upvote_ratio": 0.96, "comments": {"g9ls70m": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g9ls70m/", "text": "I've been getting along fine. I haven't really had friends for a few years, so online classes at home hasn't been too much different. My main coping strategy for not feeling down is to always have something to look forward too, alone or with others. It can be as simple as planning a long walk on the weekend or pursuing a hobby. Having something to look forward to helps me keep positive and motivated.", "author": "CorgiDoom1881", "created": 1603330511, "upvotes": 2}, "g9jo5rc": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g9jo5rc/", "text": "I moved to a new country. I don’t know anyone and tbh it’s getting to me. My flatmates have also been hanging out without me (they had a movie night? Why wasn’t I invited bro?) and bc everything is online I don’t know anyone on my course. I hate it and I’m not really having a good time :/", "author": null, "created": 1603292241, "upvotes": 2}, "g9b3s7d": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g9b3s7d/", "text": "I’m also in the same boat. I haven’t had friends for awhile now... maybe like 2.5 years. But I’m focused on school. I have this theory that I’ll meet all my friends once I start working in the real world.", "author": "CamoChild", "created": 1603099430, "upvotes": 3}, "g9a895p": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g9a895p/", "text": "I’ve been in this same boat. Right now it’s hard because everything is online but try to make connections with those you go to zoom class with! Ask if anyone wants to make a group chat for school. My siblings are all older and have moved out, so I visit their house when I want to escape my parents. Just remember that people come and and people go. Especially friends from high school.", "author": "urbosasabs", "created": 1603072646, "upvotes": 2}, "g99lnxv": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g99lnxv/", "text": "Not the best. I’m feeling burned out from school and the few friends I have from high school don’t know how to pick up the damn phone. I’m really quiet and shy so making friends is not easy but I was looking forward to the on campus experience. \n\nI’m even more worried now cause I’m a junior that just graduated from a community college with practically no campus life; so I was looking forward to breaking out of my shell and hopefully meeting people 😭🥺guess not\n\nEdit: I even made a post in my college subreddit and a couple people got unnecessarily rude. One dude was like most people already have their set friends and just focus on getting your sheet of paper. Like no shit Sherlock, that’s why I’m in college. What’s wrong with wanting to make a friend from college?", "author": "skioo8", "created": 1603059524, "upvotes": 3}, "g9876rk": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g9876rk/", "text": "I really feel you, this has been hard on us college freshmen. Personally my friends up until the end of high school were the type to just come and go, so I became accustomed to not really having anyone to hang out with back then. \n\nAfter that, to try to move on from my past, I chose a college where virtually no one from my high school attends, but now I’m starting to wonder if it really was a good decision at all because my current classmates seem reserved and quiet for the most part. Also, since at least half of them come from the same high school, it makes me feel all the more left out since most of them only interact with their peers from last year. We’re in group chats together and I try to socialize as much as I can, but they don’t return that to me and leave my messages on read. I keep asking myself if I’m forcing myself too much or if they really are that rude (yes, I take that personally...)\n\nSorry for dumping all this on you, but clearly we’re all struggling during this pandemic, especially those who have always been socially awkward (lol). I wish everyone well and I hope we’re able to resume our normal lives as quickly as possible.", "author": "naaooonnnngh", "created": 1603033784, "upvotes": 5}, "g96xv1u": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g96xv1u/", "text": "Yeah, I don't talk to my friends from high school as much any more because they're all busy with their own shit in their own colleges and I don't have any new friends either. It sucks… I'm just trying to finish this semester with good grades now. If I'm not able to be on-campus next semester I'm going to take a leave.", "author": null, "created": 1603005567, "upvotes": 6}, "g96vdrq": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g96vdrq/", "text": "I feel this. We don‘t have on-campus dorms here, so i‘ve been stuck in my studio apartment since march. Can‘t go home bec we don‘t get along well, there is literally no person that i have a face-to-face communication with. Even my therapy is online and i hate it.", "author": "mary_or", "created": 1603003718, "upvotes": 3}, "g968ia4": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g968ia4/", "text": "I’m in the same boat. My school closed campus, and I’m at home. I just keep telling myself that once covid is over and we return to campus, everyone will be open to making new friends. Thinking of hope for the future is what keeps me going.", "author": "PhysicalPen4", "created": 1602989353, "upvotes": 3}, "g95tha7": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g95tha7/", "text": "I really feel this. It doesn’t help that I’m at a whole new school this semester where I know nobody and I don’t get to see my friends from my other college regularly anymore", "author": "Songibal", "created": 1602981460, "upvotes": 6}, "g95rwe5": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g95rwe5/", "text": "Kinda wanted a girlfriend but instead i ordered a sleeve lmao", "author": "xsonixx9", "created": 1602980657, "upvotes": 5}, "g95omkx": {"link": "/r/CollegeRant/comments/jd5oc0/those_without_friends_how_are_you_guys_doing/g95omkx/", "text": "Missing friends. Most of mine are online :(", "author": "rose-wilson", "created": 1602979004, "upvotes": 3}}}