{
  "sid": "loqrnr",
  "link": "/r/CollegeRant/comments/loqrnr/really_hate_that_math_profs_give_the_most/",
  "title:": "really hate that math profs. give the most DIFFICULT form of the problem possible",
  "text": "the example questions are like \"integrate 1x + 2\\^2\"  and i'm like \"okay, easy\". then i get the test and it's like INTEGRATE 12\\^4lneXabc#sdf3/3cos-143%64353",
  "author": "Uuuhime",
  "created": 1613888501,
  "over_18": false,
  "upvotes": 32,
  "upvote_ratio": 0.9,
  "comments": {
    "go90g63": {
      "link": "/r/CollegeRant/comments/loqrnr/really_hate_that_math_profs_give_the_most/go90g63/",
      "text": "It is very annoying, but I asked about this recently and the whole point of them doing it is because they don't have time to show complex examples of the theory in class. Their goal is to introduce you to the theory in a basic sense and hope that you drill problems on the homework and attend office hours outside of class.",
      "author": "NoChannel1",
      "created": 1613931915,
      "upvotes": 5,
      "replies": {}
    },
    "go7eqya": {
      "link": "/r/CollegeRant/comments/loqrnr/really_hate_that_math_profs_give_the_most/go7eqya/",
      "text": "Math is a bunch of building blocks. Your prof probably expects you to be fine with it because the trivial examples provided are just meant to prove the theorems, so no need to do them in class.  \n\nIn tests, professor expect you to have solid understanding of theorem plus whatever algebraic terms they put to create a strategically difficult problem.",
      "author": "Ghoulhub",
      "created": 1613891562,
      "upvotes": 6,
      "replies": {
        "go8vpsn": {
          "link": "/r/CollegeRant/comments/loqrnr/really_hate_that_math_profs_give_the_most/go8vpsn/",
          "text": "That confuses me; I understand that “math is a bunch of building blocks” but many times I fail to understand concepts without seeing how they work together as a whole. In majority of my math classes we only practiced individual parts and don’t focus on connecting equations on concepts together",
          "author": "CantuTwists",
          "created": 1613929757,
          "upvotes": 10,
          "replies": {
            "go8ycc2": {
              "link": "/r/CollegeRant/comments/loqrnr/really_hate_that_math_profs_give_the_most/go8ycc2/",
              "text": "this too honestly. it's like, to solve one concept, i also have to solve five more (before i can even get to the one i'm being tested on). why can't you just focus on what You're Teaching and not layer the answer i have to give you beneath stuff from courses i took two years ago.",
              "author": "Uuuhime",
              "created": 1613930998,
              "upvotes": 4,
              "replies": {}
            },
            "go8zszs": {
              "link": "/r/CollegeRant/comments/loqrnr/really_hate_that_math_profs_give_the_most/go8zszs/",
              "text": "Well, what courses have you taken? I would say I def started experiencing this in classes after those initial classes after calc 1/2: multi variable, LinAlg, diffeq, and and more proof writing discrete class. \n\nLike my first real statistic course was a bunch of multi variable statistics, or my biostatistics course being a ton of linear algebra. If that makes sense?",
              "author": "Ghoulhub",
              "created": 1613931638,
              "upvotes": 1,
              "replies": {
                "go9et4l": {
                  "link": "/r/CollegeRant/comments/loqrnr/really_hate_that_math_profs_give_the_most/go9et4l/",
                  "text": "I haven’t taken any courses like the ones you’ve taken that’s for sure. I changed my major after pre calculus when I got a C: my professor said if we couldn’t get an A or B we probably wouldn’t make it. \n\nLike I said before, I understand that those courses are built on previous concepts, it’s just that many of the professors I’ve had never connected how some of those simple concepts combine together. Like how one math concept can be combined with others to solve a complex problem. We mainly focused on individual parts so I could not tell which ones should be used together for different situations. The other thing that killed was how unclear some math problems are worded, math really is a different language. \n\nAnother issue I’ve found is that sometimes we don’t even know the meaning of certain math symbols or tools (for example, I don’t know what SIN or CO-SIGN is, just that it’s something used in math). I could solve one of those problems but I did not know what the answer means. I did not understand what I was doing, just that I got an answer from following the steps of an equation. Maybe I just had a horrible math foundation from day one, I have no idea.",
                  "author": "CantuTwists",
                  "created": 1613937881,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "go8nsl8": {
          "link": "/r/CollegeRant/comments/loqrnr/really_hate_that_math_profs_give_the_most/go8nsl8/",
          "text": "i mean yeah, i know, sure, but this is r/collegerant and i came here to vent about something that's been frustrating me.",
          "author": "Uuuhime",
          "created": 1613925909,
          "upvotes": 6,
          "replies": {
            "go8r1cx": {
              "link": "/r/CollegeRant/comments/loqrnr/really_hate_that_math_profs_give_the_most/go8r1cx/",
              "text": "Get that. Just explaining your profs POV",
              "author": "Ghoulhub",
              "created": 1613927504,
              "upvotes": 2,
              "replies": {
                "go8wbw7": {
                  "link": "/r/CollegeRant/comments/loqrnr/really_hate_that_math_profs_give_the_most/go8wbw7/",
                  "text": "yes i understood his pov before i posted, but that doesn't make it any less annoying",
                  "author": "Uuuhime",
                  "created": 1613930045,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634062689
}