{
  "sid": "qbps1t",
  "link": "/r/CollegeRant/comments/qbps1t/fed_up/",
  "title:": "Fed up",
  "text": " Long story short, my roommate has been getting on my fucking nerves and I just wanted to let it all out. I'm a very quiet and non-confrontational person, so I'm not one to immediately jump on feelings of annoyance or a fleeting moment of anger. However, this shit has been sitting with me since early September and it has been irking me to no end. to be fair, I am trying to make sure that I don't let how I feel ruin my day, and for the most part, I am happy besides when I have to deal with my roommate. When she and I first started talking, she told me she was super organized, clean, not a fan of loudness, and overall seemed to want to have a set schedule like I already did from my 3 years of being on a club sports team that required a huge chunk of my time. I thought that what she said would hold true, but apparently not. I have learned in the past 3 months of being in a dorm room with her that people lie about who they are. Not only is she a slob, but she is also lazy as fuck and has no respect for anyone around her. She fails to clean the dorm room at all unless her mommy is coming to visit which is basically once every 2 or 3 months, doesn't clean off the microwave when she gets shit all over it, never empties the vacuum we both share, and when she vacuums on the rare occasion she slams my fucking vacuum into any object that is in its path that is obviously moveable (mind you, I paid for the fucking vacuum and we share it). She never takes out the trash despite the fact that she fills it up with her hair (yes, her hair). She also comes back into the dorm at 11:30-12:30 at night, slams the fucking door no matter what time of day it is, and turns her desk light on to full brightness despite the fact that she knows I am sleeping. (Note: I get up at 530 am to workout because that's the only time it fits into my schedule, she gets up at 830-900). She also talks with the people across the hall at 11:30-12:30 at night, and she doesn't even have the fucking decency to shut the dorm door so that everyone else in our hall can go to sleep instead of having to hear whatever the hell they're talking about. More than anything else, it pisses me off that I was lied to because I was under the assumption that she would at least carry her own weight. Now I find myself cleaning the dorm room once a week and looking at her clothes strung on her chairs and her shit strung all over the floor. And no, I'm not going to start protesting cleaning because I don't want to stoop to her level. Just needed to get it off my chest.",
  "author": "elephantofwisdomm",
  "created": 1634692901,
  "updated": 1634750634,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "hhb3moo": {
      "link": "/r/CollegeRant/comments/qbps1t/fed_up/hhb3moo/",
      "text": "> Long story short, my roommate has been getting on my fucking nerves and I just wanted to let it all out. I'm a very quiet and non-confrontational person, so I'm not one to immediately jump on feelings of annoyance or a fleeting moment of anger. However, this shit has been sitting with me since early September and it has been irking me to no end. to be fair, I am trying to make sure that I don't let how I feel ruin my day, and for the most part, I am happy besides when I have to deal with my roommate. When she and I first started talking, she told me she was super organized, clean, not a fan of loudness, and overall seemed to want to have a set schedule like I already did from my 3 years of being on a club sports team that required a huge chunk of my time.\n\n&nbsp;\n\n>I thought that what she said would hold true, but apparently not. I have learned in the past 3 months of being in a dorm room with her that people lie about who they are. Not only is she a slob, but she is also lazy as fuck and has no respect for anyone around her. She fails to clean the dorm room at all unless her mommy is coming to visit which is basically once every 2 or 3 months, doesn't clean off the microwave when she gets shit all over it, never empties the vacuum we both share, and when she vacuums on the rare occasion she slams my fucking vacuum into any object that is in its path that is obviously moveable (mind you, I paid for the fucking vacuum and we share it).\n\n&nbsp;\n\n>She never takes out the trash despite the fact that she fills it up with her hair (yes, her hair). She also comes back into the dorm at 11:30-12:30 at night, slams the fucking door no matter what time of day it is, and turns her desk light on to full brightness despite the fact that she knows I am sleeping. (Note: I get up at 530 am to workout because that's the only time it fits into my schedule, she gets up at 830-900).\n\n&nbsp;\n\n>She also talks with the people across the hall at 11:30-12:30 at night, and she doesn't even have the fucking decency to shut the dorm door so that everyone else in our hall can go to sleep instead of having to hear whatever the hell they're talking about. More than anything else, it pisses me off that I was lied to because I was under the assumption that she would at least carry her own weight. Now I find myself cleaning the dorm room once a week and looking at her clothes strung on her chairs and her shit strung all over the floor. And no, I'm not going to start protesting cleaning because I don't want to stoop to her level.\n\n&nbsp;\n\n>Just needed to get it off my chest.\n\n&nbsp;\n\nHey /u/elephantofwisdomm, it looks like you posted a wall of text. I have separated it into paragraphs for you!\n\n\n\n_Send a private message with title **'opt out'** to prevent this bot from seeing your posts in the future._\n\nr/CollegeRant has contributed 0.02% of all walls of text analyzed so far!",
      "author": "linebreaker-bot",
      "created": 1634692987,
      "upvotes": 3,
      "replies": {}
    },
    "hhd9pi4": {
      "link": "/r/CollegeRant/comments/qbps1t/fed_up/hhd9pi4/",
      "text": "I’m in a similar situation, but it’s not my roommate I have a problem with, it’s the entire damn floor. You’re roommate sounds similar to almost everyone I’ve seen in my nearby dorms.",
      "author": "PikaDicc",
      "created": 1634741853,
      "upvotes": 1,
      "replies": {}
    }
  }
}