{"sid": "mhgf22", "link": "/r/CollegeRant/comments/mhgf22/i_graduate_in_may_and_it_feels_so_unfulfilling/", "title:": "I graduate in May and it feels so unfulfilling.", "text": "I’m a senior graduating in May and I feel so unfulfilled. I feel like COVID ruined my college experience. \n\nMy first year of college, I was pretty lonely as all my high school friends went off to different universities. My second year, I started stepping out of my shell and making new friends. My third year, I really found my stride, made some really good friends, started going to social activities, enjoyed my classes, and boom COVID hit. Now I’ve spent the last year of my life in Zoom university. \n\nIt feels like my brain can’t retain any information anymore. I’ve lost all motivation, because why study when everything is open book and open internet? Why be proactive in class when the professor is just reading off of slides that will be posted online later on? I’m kind of just cruising to the finish line at this point. \n\nGraduating college used to be my biggest dream, and I couldn’t wait to walk across the stage and receive my diploma with all my friends and family enjoying the day with me but they’ve even cancelled the commencement ceremony. I feel no sense of fulfillment at this point. It’s all kinda just ehhh. \n\nI really miss being around people my age. I know post graduation depression is real, but I’m feeling it now. To make matters even worse, the job market is so scarce right now as the economy recovers. \n\nIt feels like I’m in purgatory. Just wanted to vent to any peeps that might be feeling the same as me.", "author": "DreamChaserDoedie", "created": 1617226720, "retrieved": 1632951380, "over_18": false, "upvotes": 50, "upvote_ratio": 0.95, "comments": {"gtgad0w": {"link": "/r/CollegeRant/comments/mhgf22/i_graduate_in_may_and_it_feels_so_unfulfilling/gtgad0w/", "text": "Even my friends who didn't graduate during covid feel the same. Especially now, college is just the thing you go to for job opertunities.", "author": "Red234234", "created": 1617629781, "upvotes": 1}, "gt0blke": {"link": "/r/CollegeRant/comments/mhgf22/i_graduate_in_may_and_it_feels_so_unfulfilling/gt0blke/", "text": "I feel this. I’ve been through hell and back to get this degree and my dream was to walk the stage with my family and friends there and it’s cancelled. It also sucks knowing so many other universities have their commencement ceremonies in-person. It’s really frustrating.", "author": "undercovergrl42", "created": 1617265213, "upvotes": 3}, "gszmpff": {"link": "/r/CollegeRant/comments/mhgf22/i_graduate_in_may_and_it_feels_so_unfulfilling/gszmpff/", "text": "Dude same. I was at the best place I’ve ever been in life right before COVID. Ever since then it’s been up and down and I’ve never seen that peak since. I graduate in 2 months yet I feel nothing but emptiness.", "author": "sabnastuh", "created": 1617245920, "upvotes": 4}}}