{"sid": "mm45iz", "link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/", "title:": "I feel like i haven't learned anything", "text": "I will finish in December with a degree in journalism and I feel so unprepared. I'm not well disciplined to take classes at home and trying to pay attention is so hard. And then sometimes these professors want you to teach yourself. it's frustrating. I feel like a failure, I feel angry and sad and lost. I don't even like my degree anymore. And i feel like an idiot because I'm not as good in my classes or investigation as my classmates. \n\nAnyone else feel this way?", "author": "Inevitable-Tomato-81", "created": 1617807976, "retrieved": 1632842843, "over_18": false, "upvotes": 200, "upvote_ratio": 0.99, "comments": {"gtp1p2d": {"link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/gtp1p2d/", "text": "Thank you u/Inevitable-Tomato-81 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1617807977, "upvotes": 1}, "gu0pg8r": {"link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/gu0pg8r/", "text": "I will finish my degree this December as well after the remaining of my final major courses and honestly for the past year of remote learning (3 semesters) It was a waste of money and time tbh. I’ve never felt so much disconnection in college, gotten my associates 3 years ago and was highly motivated and loved my major but now absolutely not. Also my life have changed in the last 3 months, I’ve lost my mother and that just threw my off the wagon with life such as my health, school and managing how I’m get through it when my biggest supporter isn’t here anymore. She used to motivate me so much and was so understanding of life. I didn’t even finish out the fall semester cause my mother got ill shortly after midterms and spent months in the hospital and never came home. These professors have been somewhat understanding but not 100% of my situation and now I’m at the point idc anymore if I even pass or fail cause my life will never be the same anymore.", "author": "twalton18", "created": 1618036369, "upvotes": 1}, "gtrcegj": {"link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/gtrcegj/", "text": "I bet you didn't lmao I mean come on journalism?/s\n\nIn all seriousness you're being to hard on yourself. You'll realize how much you know when you put it to use", "author": "DarkAssassinXb1", "created": 1617845748, "upvotes": 2}, "gtra3w2": {"link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/gtra3w2/", "text": "Bro are you me? Or am I you?", "author": "EmpyrealMarch", "created": 1617844589, "upvotes": 2}, "gtqv29d": {"link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/gtqv29d/", "text": "You will feel this way until you break into your own independent studies/projects.", "author": null, "created": 1617836875, "upvotes": 3}, "gtqm7ln": {"link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/gtqm7ln/", "text": "Go for stories people don't want to cover and you'll make a name for yourself... eventually.", "author": "The-3rd-Party", "created": 1617832505, "upvotes": 5}, "gtqj7me": {"link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/gtqj7me/", "text": "I feel the exact same as an English major bro, you’re not alone", "author": "wqmbat", "created": 1617831118, "upvotes": 3}, "gtp7ies": {"link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/gtp7ies/", "text": "Honestly, I think you are being a bit too harsh on yourself. I think even if you were taking courses on campus you would still feel this way. This is just my anecdotal experience, but I feel like many can agree with me, it's kind of like a meme at this point where people say like \"I graduated but I know nothing\" or something of that sort. \n\n&#x200B;\n\nI think when you REALLY start to learn is whenever you go into the work force, you'll start getting first hand experience at that point.", "author": "Sovyyy", "created": 1617810528, "upvotes": 28}, "gtp3xrp": {"link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/gtp3xrp/", "text": "Yes at times I feel this way with my integrated media degree.... scary but you’re not alone", "author": "pizzahutisokay", "created": 1617808974, "upvotes": 11}, "gtp38ga": {"link": "/r/CollegeRant/comments/mm45iz/i_feel_like_i_havent_learned_anything/gtp38ga/", "text": "This happens at the end of your classes you feel lost because you're going out into the field.. and there is so much competition. Try to find a niche your good at in journalism and don't expect to make like 100k a year to start just build up to to it, and do the best you can.", "author": "electricdom", "created": 1617808666, "upvotes": 55}}}