{
  "sid": "qvqa62",
  "link": "/r/CollegeRant/comments/qvqa62/while_a_95_percent_of_my_class_got_put_in_random/",
  "title:": "While a 95 percent of my class got put in random groups, I got stuck with 2 other group mates who are friends and honestly trying to get any work done with them is giving me straight up anxiety attacks.",
  "text": "I feel like an awkward third wheel man. One kid doesn't know what he's doing while the other just magically figured it out and anytime i tried to ask what was going on or figure out what we were doing it pretty much got brushed off. The whole time these kids are talking to eachother and one of the kids girlfriend was there casually talking the whole time. \n\nI can't fucking do this man. I work in sale's outside of this and I have no issues in social interactions but I can't help but shake the feeling that my professor honestly didn't realize that this could potentially happen when she did it. Majority of this class is working with eachother in random groups and I've had completely great experiences working with them up until this happened. I don't even know how I could bring this up to my teacher without sounding crazy.  \n\nAdditionally, I've aced this class so far with the tests, participations, homeworks etc and honestly go above and beyond but right now I dont even feel good going to my next class. \n\nThis project is a simulation thats 40 percent of my final grade too. \n\nCan't ever catch a break. I'm 6 classes short of graduating and i just want to drop out man.",
  "author": "AverageGuy16",
  "created": 1637121056,
  "updated": 1637182171,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.86,
  "comments": {
    "hl108mt": {
      "link": "/r/CollegeRant/comments/qvqa62/while_a_95_percent_of_my_class_got_put_in_random/hl108mt/",
      "text": "Anytime I had a group project in college  I had people in them who did absolutely nothing. \n\nMy solution? Report them immediately to the professor through email. Let them know that they’re not pulling their weight and if they’d consider lowering their grades on it so it doesn’t effect your presentation. I did this everytime people thought I’d pull all the weight",
      "author": "Stater_155",
      "created": 1637178550,
      "upvotes": 1,
      "replies": {}
    }
  }
}