{"sid": "nc2brx", "link": "/r/CollegeRant/comments/nc2brx/we_have_a_changing_schedule_every_week_but_yet/", "title:": "We have a changing schedule every week but yet attending all classes is mandatory!", "text": "Hello!\n\n\nI'm in France. I'm in higher education (I'd say college but whatever it's the same, although there's different types of higher education, AT LEAST THIS ONE IS FOR 2 YWARS ONLY) and it's very annoying! I was struggling with depression and lack of money for 4 years and so I didn't start any extracurricular activity like sports, seeing a therapist, music etc during high school, unfortunately. But now I want to start them, especially since I'm so bored. But yet it's very hard!\n\n\nIf it was in high school, it wouldn't be such a problem. Although attending classes is mandatory, you have the same schedule for most of the year. You can play whatever you want. But now that's not the case! For some reason we have schedules that change every week, and on top of that, because of corona, some classes are online, some classes are in person, and often I have to study, commute, and then study again! Out teachers made our schedules like it's better for them, absolutely not caring about how it's better for us for the most part!\n\n\nAnd my schedules always change! Although they always start minimum at 8:30 and end maximum at 18:00, because of the commuting it's 7:30 and 19:00,and what activity can I do before 7:30 and after 19:00? Nothing!  Although on average I have 35 hours, since it's always changing I can't plan anything!\n Maybe I could do an activity on Saturday but not all activities are in place in the Saturday! And if there's such a changing schedule, why not make that attending classes isn't mandatory, especially since we can study most of those things on our own anyway and that often I don't follow classes (especially online classes) anyway! 😠\n\n\n\nWhy the fuck most of my year should even be only studying anyway??? I can't live my life outside of it?\n\nTLDR : classes are with changing schedules yet mandatory, it's impossible to do any activities", "author": "Loud-Development-692", "created": 1620975053, "retrieved": 1632842395, "over_18": false, "upvotes": 16, "upvote_ratio": 1.0, "comments": {"gy2mkm2": {"link": "/r/CollegeRant/comments/nc2brx/we_have_a_changing_schedule_every_week_but_yet/gy2mkm2/", "text": "Thank you u/Loud-Development-692 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1620975053, "upvotes": 1}}}