{"sid": "fvrm8g", "link": "/r/CollegeRant/comments/fvrm8g/anybody_else_so_overwhelmed_theyre_just_not_doing/", "title:": "Anybody else so overwhelmed they’re just not doing anything?", "text": "My undergraduate senior thesis first draft is due Thursday and I haven’t done the analysis. Lit review is done, so there’s that, and I have my data collected, but I don’t know what the fuck I’m doing beyond that. I haven’t had stats in 4 years.\n\nYou know you’re fucked when you post for homework help and you don’t even understand the follow-up questions someone asks you.\n\nI’m worried I won’t graduate. I have 4 more days and I’ve spent every day trying to work on it, crying, and then wasting the rest of the day anxiously. That’s not including the 30 hours a week I work as a pizza delivery driver to pay my rent and worrying about my elderly grandparents and all this shit in general.\n\nSorry for the rant. I just don’t know how the fuck I’m supposed to get anything done right now.", "author": "xpl0ring", "created": 1586144938, "retrieved": 1632950826, "over_18": false, "upvotes": 117, "upvote_ratio": 1.0, "comments": {"g1w2lnb": {"link": "/r/CollegeRant/comments/fvrm8g/anybody_else_so_overwhelmed_theyre_just_not_doing/g1w2lnb/", "text": "I had planned on doing so much doing this summer. Write, take courses, get it shape....all of those plans flushed out the toilet once I received an email stating that my college wanted me to go back to campus for the next semester. \nI want to stay home, but the college is forcing me to fly back to attend classes that start next month. I haven't been able to think of anything else except how I can change the management's decision for the past 2 weeks. \nI haven't slept properly, watched YouTube or done anything on my checklist. All I do is write emails to people, tweet authorities and hope for things to change.", "author": null, "created": 1597688697, "upvotes": 1}, "fmrjpkn": {"link": "/r/CollegeRant/comments/fvrm8g/anybody_else_so_overwhelmed_theyre_just_not_doing/fmrjpkn/", "text": "Got a paper due in a few hours, and honestly in the same boat for being overwhelmed. Sometimes, we just have to push ourselves to do the task. It sucks, but sadly that's the norm. Especially with the current COVID-19 pandemic compressing our education.\n\nHave you emailed your professor for help on understanding concepts? While it seems embarrassing, it is one of the options for us students. Looking up some videos about your topic is also great. Any information gathered will eventually create a path.\n\nProcrastination right now is common, so is fear. You will pull through this. Keep looking into things you don't understand, and put your own twist to it.", "author": "okthrowaway11111", "created": 1586325292, "upvotes": 2}, "fmluro1": {"link": "/r/CollegeRant/comments/fvrm8g/anybody_else_so_overwhelmed_theyre_just_not_doing/fmluro1/", "text": "I just barely finished my semester. (I have a weird school schedule)  My professor about drug me through the last part, and even then I almost gave up. The stress of all of this hit me hard. My advice is just try to get words on paper and turn in something. Even if you don't get the best grade at least you tried. Also be honest with your professors, email them and let them know what is going on. My turned out to be super nice and helpful. You are not alone in feeling this way.", "author": "Unicornrescue", "created": 1586193603, "upvotes": 3}, "fmle8l5": {"link": "/r/CollegeRant/comments/fvrm8g/anybody_else_so_overwhelmed_theyre_just_not_doing/fmle8l5/", "text": "I'm in basically the same boat; I did my first two thesis drafts last semester, but now that the final edits are due I have basically nothing done. I have some paragraphs I can add in somewhere, but I have no idea if I'll have to restructure the entire thing and I just don't even care at this point. I've spent the last three weeks in bed watching YouTube and pretending to study; my family thinks I've been getting things done.", "author": "Calligraphee", "created": 1586184643, "upvotes": 6}, "fmknut6": {"link": "/r/CollegeRant/comments/fvrm8g/anybody_else_so_overwhelmed_theyre_just_not_doing/fmknut6/", "text": "Me. In my case I'm just gonna do the final projects. I dont care much for the drafts and all that", "author": "Gryphon234", "created": 1586161679, "upvotes": 4}, "fmklnoh": {"link": "/r/CollegeRant/comments/fvrm8g/anybody_else_so_overwhelmed_theyre_just_not_doing/fmklnoh/", "text": "I blinked and I'd missed a week of classes. It's been weird.", "author": "toukaaa", "created": 1586159304, "upvotes": 18}, "fmka2ea": {"link": "/r/CollegeRant/comments/fvrm8g/anybody_else_so_overwhelmed_theyre_just_not_doing/fmka2ea/", "text": "I am so sorry u/xpl0ring. You are going through A LOT. No wonder you're feeling burnt out. It's hard enough to be working in the service industry and caring for an elderly loved one on a normal day. You're doing this through the worst time in our history. Cut yourself some slack and take this day by day. And do not let any one of these days be a measure for what you are capable of. We are all being tested beyond our capabilities right now. These are not good times to judge our abilities other than to just take it day by day. Feel free to message me if you just need someone to talk to. You're going through a lot. It's OK.", "author": "DTLAgirl", "created": 1586148529, "upvotes": 13}, "fmk8j1v": {"link": "/r/CollegeRant/comments/fvrm8g/anybody_else_so_overwhelmed_theyre_just_not_doing/fmk8j1v/", "text": "I’m in the same boat, sorta (no draft, just writing period). Hate this shit", "author": "pseudoname123", "created": 1586147334, "upvotes": 9}}}