{
  "sid": "pnxk1y",
  "link": "/r/CollegeRant/comments/pnxk1y/college_and_depression_rant/",
  "title:": "College and depression rant",
  "text": "Sorry guys I just need the space to rant. I probably won't be reading the comments. Idk if I can take someone being an asshole to me on here today. CW: depression and suicidal thoughts.\n\nI've never considered killing myself more than in college. The constant pressure and feeling of being evaluated just gets to me. I'm so tired of it. The sheer amount of people and work too. So often I feel like I'm not strong enough to live in this world. Sometimes I think about if I were to kill myself, would my professors remember me? Would they care? \n\nLast semester I had an oral final with my ethics professor. I started talking to her about the idea of the 'good life' in different figures. I choked up thinking about Plato's Phaedo and how he says every pain or pleasure rivets the body to the soul. One of the reasons I love the Phaedo is because whenever I read that it soothes my anxiety and depression for a moment. I wish I could place myself above the pains that I feel but I'm so weak. I try so hard but I constantly fail. I am so embarrassed but I can't say these things to anyone else.\n\nOkay that is enough word vomit. If you read this and want to leave an encouraging comment, then bless your soul. If you read this and want to leave an asshole comment, then fuck off.",
  "author": "ajgarcia57",
  "created": 1631601809,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.87,
  "comments": {
    "hd1ladm": {
      "link": "/r/CollegeRant/comments/pnxk1y/college_and_depression_rant/hd1ladm/",
      "text": "This isn’t appropriate for this sub. Including your last sentence.",
      "author": "snoboy8999",
      "created": 1631768288,
      "upvotes": 1,
      "replies": {}
    },
    "hd0eq5o": {
      "link": "/r/CollegeRant/comments/pnxk1y/college_and_depression_rant/hd0eq5o/",
      "text": "It’s ok to feel like your at the bottom or that ur stuck. But please if u find yourself with a plan to go through with it, get help. There r so many recourses available to u, and you deserve to have help through this. You are not a burden on anyone for saying these things to people. I used to b suicidal a few years back, and it gets better. It gets so much better and life starts to become worth it again. You can do this. Even if u don’t feel it, you r more than capable and deserving of all the good the good things life will offer u in the near future. Pls stay safe, much love",
      "author": "Tight_Watercress7028",
      "created": 1631746791,
      "upvotes": 1,
      "replies": {}
    },
    "hct0kle": {
      "link": "/r/CollegeRant/comments/pnxk1y/college_and_depression_rant/hct0kle/",
      "text": "Please talk to someone https://suicidepreventionlifeline.org/",
      "author": "Wearamask0912",
      "created": 1631617320,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634062456
}