{"sid": "lbknam", "link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/", "title:": "Can professors just begin putting ALL the assignments in a clear, easy to find, spot????", "text": "This is probably childish and all, but I'm ready to be downvoted and I'll understand it if it'll happen.\n\nSo, last night a friend with whom I'm sharing X class sent me a text asking me if I had a moment to edit her paper. We've been doing this for about a year and a half, and with my help she has been getting better grades in her essays, so, even if I was doing an assignment for another class, I put everything on pause and begin editing her essay.\n\nIt doesn't take much, maybe half an hour, before I announce that I'm done. I'm about to pick back up the assignment I had left on pause with the intention of finishing it and going to bed, when my friend sends me another text asking me if I had already finished the assignment for X class.\n\n*Panic*.\n\nI look *everywhere* and this assignment doesn't even seem to exist. Not on the Canvas calendar, not on the syllabus, not in the announcement the professor has posted during the weekend to remind us that we're still going to do classes remotely during this week because of the snowstorm. I went through the syllabus about twenty times, going through the essays and tests section to make sure that I wasn't maybe skipping a line of instructions or two, but there was absolutely nothing there! Only the descriptions of the mid-term and the final.\n\nYou know where it was? In the files section, which was hidden into the modules one!\n\nWhat the fuck???? And apparently the only reason my friend knew about it was because she had printed the syllabus before the professor could pull it off of Canvas and upload a *second*, *different* version.\n\nJUST WHY.\n\n&#x200B;\n\nTL;DR: professor put assignment in a hidden spot on Canvas, didn't do it, so now I'm panicking.", "author": "screamingracoon", "created": 1612347654, "retrieved": 1632842576, "over_18": false, "upvotes": 434, "upvote_ratio": 1.0, "comments": {"gluhr6x": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/gluhr6x/", "text": "Thank you u/screamingracoon for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1612347654, "upvotes": 1}, "glxyh66": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glxyh66/", "text": "I totally missed an assignment yesterday because the professor somehow hid it in a module but it didn’t show up on my timeline or to do list. Ugh", "author": "1warrioroflight", "created": 1612406941, "upvotes": 1}, "glxkiex": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glxkiex/", "text": "totally relatable, i have a communication professor rn who doesn’t even have time to organize the modules and it took her two days just to unlock it, and she said she “forgot”.", "author": "gl0wful", "created": 1612400084, "upvotes": 1}, "glxj7uk": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glxj7uk/", "text": "FUCKING FACTS!!\n\nEvery single day I check every link there is on blackboard for each of my courses to find assignments. Literally hidden like they’re Easter eggs", "author": "maddymckay", "created": 1612399442, "upvotes": 2}, "glx2yjh": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glx2yjh/", "text": "I really hate when the assignments for a class are on an independent website and they don't even show up as due in canvas.", "author": "Mkg102216", "created": 1612391707, "upvotes": 3}, "glx2khf": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glx2khf/", "text": "Last semester I had multiple professors post all assignments in announcements or emails so they wouldn’t show up on the Canvas calendar because the calendar only recognizes assignments that have been put in the assignment category. Literally who does this benefit", "author": null, "created": 1612391530, "upvotes": 1}, "glwvqxt": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glwvqxt/", "text": "Sounds like you go to Northeastern with me.", "author": "Pasquanch", "created": 1612388576, "upvotes": 1}, "glw5va7": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glw5va7/", "text": "I have a professor that's literally exclusively using his personal, chaotic OneDrive to run the class instead of canvas, and if you think I can find ANYTHING on there you'd be mistaken", "author": "skelechel", "created": 1612378026, "upvotes": 3}, "glw1m34": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glw1m34/", "text": "First day of class I always check the syllabus and the drop box due dates to make sure things are aligned", "author": "crystalliite", "created": 1612376344, "upvotes": 1}, "glvf6hs": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glvf6hs/", "text": "YES why can’t professor understand the idea of having an organized canvas page?????", "author": "marissp", "created": 1612367363, "upvotes": 1}, "glveutx": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glveutx/", "text": "I feel your pain. My university even created website in Moodle for centralised hub for course info, quizzes, tests, forums and assignments. It works great, but it would be better if professors were using it. Because having this kind of spot is just one step, another is using", "author": "poloscraft", "created": 1612367227, "upvotes": 6}, "glvcthp": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glvcthp/", "text": "You’re not alone. My profs do the same thing! I hate searching and searching for an assignment. I waste so much time that I could have used doing the assignment. Then by the time I find the assignment I’m mentally exhausted and frustrated!", "author": "Midnighttonigght", "created": 1612366375, "upvotes": 2}, "glvcdeo": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glvcdeo/", "text": "i really appreciate professors with complete and organized assignments in canvas.", "author": "bananasprites", "created": 1612366187, "upvotes": 30}, "glv7s8v": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glv7s8v/", "text": "I’m an instructor. I agree with you.\n\nMy course Start Page in Blackboard: \nSyllabus (PDF)\nCalendar (PDF)\nWeekly Course Content\nAll Course Assignments\nYouTube Link to Lesson Video Playlist\nGrades\n\nIn the All Course Assignments folder, there are various folders:\nMiscellaneous (5%)\nQuizzes (5%)\nLaunchpad (15%)\nEssays (70%)\nFinal Exam (5%)\n\nThe Weekly Course Content folder has a folder for each week so you can approach assignments chronologically if you want.\n\nMy Calendar PDF has all lessons and due dates for all assignments.\n\nAlso, I color code the folders by assignment type, and color the assignments within the weekly folders, so you know at a glance when essays are due, quizzes, etc, just like you can on the calendar PDF, and I literally used the same hex color code so the colors matched up perfectly with the ones I used in Word.\n\nI do NOT add assignments to my class once the semester has started. They aren’t all available immediately, but the expectations of what will be due and when never change. I also don’t have late deductions for any assignments. We’re in a pandemic. Counting off for lateness serves no real purpose either. It doesn’t measure ability, and only seems to serve to stroke the professor’s ego by wanting to be obeyed. What the fuck does it matter if my student got called in for a late shift and can’t get the assignment in on time? My response? “Okay. I understand. Just get it to me when you can!” I don’t know why every instructor doesn’t do this. Punctuality is not proof of ability or knowledge. We aren’t an employer...we are teachers.", "author": "chrisrayn", "created": 1612364244, "upvotes": 27}, "glv6vie": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glv6vie/", "text": "[deleted]", "author": null, "created": 1612363850, "upvotes": 6}, "glv6szd": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glv6szd/", "text": "Sometimes what saves me is my gradebook because it provides a link to the asssignment and even provides a due date. \n\nSchool has been hectic because I signed up for two hybrid/in person classes but im in my fourth week of school and I only gotten been to campus for class ONCE. So pretty much im taking four classes online. If it wasn't for the fact that I have a job I wouldn't even be leaving my house", "author": "TheRapidTrailblazer", "created": 1612363820, "upvotes": 6}, "glv6lq9": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glv6lq9/", "text": "My professor did this with a discussion. There were two discussions for the same assignment. I didn’t know and posted to the wrong one. I had a zero but thankfully she still gave me full credit after I sent her an email about it.", "author": "catpropproblems", "created": 1612363733, "upvotes": 6}, "gluuar3": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/gluuar3/", "text": "Omg I almost missed a quiz and Assignment this week because my professor changed the module to add Assignments to it out of NOWHERE and I got no notifications and she said nothing about it. She just added it. If I hadn't checked again I would've missed a week's worth of work. She doesn't have assignments listed separately in the syllabus either. She just has what topics we'll be covering. In class she said we'd have Assignments due every Tuesday and quizzes due every Thursday, but the site said that both were due yesterday. I emailed her saying I thought quizzes were due Thursdays. She said \"sometimes\" like what??", "author": "vness1213", "created": 1612357447, "upvotes": 42}, "glus3f4": {"link": "/r/CollegeRant/comments/lbknam/can_professors_just_begin_putting_all_the/glus3f4/", "text": "Suffering from the same problem in multiple classes. Everything to be done is so messy. The only thing saving me is the grade breakdown which allows me to see specifically if assignments are the only homework, and luckily, yes they are.", "author": "BLUTeamTriumphs", "created": 1612356030, "upvotes": 80}}}