{
  "sid": "pples9",
  "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/",
  "title:": "I have no clue how to study",
  "text": "My prof just announced that we have our first exam coming up this week so I took that announcement as my call to start studying.  But as soon as I sat down at the library to study I have no clue what I'm doing. I have no clue how to study. It's my first year in college and I just realized now I don't know how to study because I never did in High School! Like I have notes...do I just re-read them? like what am I supposed to do?",
  "author": "SmellyTaterTot8",
  "created": 1631824150,
  "over_18": false,
  "upvotes": 26,
  "upvote_ratio": 0.92,
  "comments": {
    "hd5nvru": {
      "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd5nvru/",
      "text": "Reorganize and rewrite your notes in a graphic way, with different highlight colors for specific types of info. Different people study different ways, but that works great for me. Handwriting the info is good for memory, and spatially organizing it helped me so I could later visualize where certain info was on the study page. \n\nQuiz yourself. From your notes, make a separate list of terms/concepts. Go down that list and mentally explain what one means, then re-read your notes or the book section to see what you missed. You'll remember it a lot better from the little bit of pressure you're under when you quiz yourself. \n\nBasically the key is being actively engaged. Passive activity like re-reading notes does very little to help you remember. Any method where you're writing, speaking, or trying to remember the info is better.",
      "author": "spallanzanii",
      "created": 1631843946,
      "upvotes": 3,
      "replies": {
        "hdapn1k": {
          "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hdapn1k/",
          "text": "I'm a PhD student in biology and this is exactly how I have studied for just about every biology exam I've ever taken. One thing on top of all of this that helps me is that several days before the exam I go over my notes/the PowerPoint slides from class and write my own exam. I look at the PowerPoint slides or the sections of my notes and ask \"if I was writing an exam what would I ask about?\" I generate my own questions from the information, and then a day or two before the real exam, I take my exam. If there are any questions I can't answer, that's what I spend my time going over. I have also found that taking a \"practice\" test of the material beforehand helps relieve test anxiety a little bit,, too.",
          "author": "BrainsOnFire1617",
          "created": 1631940934,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hd5csi0": {
      "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd5csi0/",
      "text": "MAKE QUIZLETS AND PLAY THE MATCHING GAMES. it helped me so much in psych",
      "author": "planettmarrs",
      "created": 1631838721,
      "upvotes": 4,
      "replies": {}
    },
    "hd5akij": {
      "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd5akij/",
      "text": "this is what I do, lets assume the exam is in 1 week\n\nday 1: all I do is go through my notes make sure everything is there and organize all important chapters on textbooks/academic journals/etc. then I divide everything into however many days I have left to study instead of doing everything at once. I like to do my studying in advance so I do little by little every day. I’ll make up quizes and test myself. I even record myself studying via voice notes so I can go back and listen to it. that is what works best for me.",
      "author": "kdramapeach",
      "created": 1631837634,
      "upvotes": 2,
      "replies": {}
    },
    "hd56uan": {
      "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd56uan/",
      "text": "Quizlet is a HUGE help. There's also an app to study on the go with your phone\n\nI use it for almost every exam and it's study and learn sections are completely free.",
      "author": "Tycoon_2000",
      "created": 1631835817,
      "upvotes": 2,
      "replies": {}
    },
    "hd55abu": {
      "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd55abu/",
      "text": "Past tests are a great way to study: They give you a heads up on what's going to be covered, and are also good problems to work through in general",
      "author": "StarvinPig",
      "created": 1631835060,
      "upvotes": 2,
      "replies": {}
    },
    "hd4uyf9": {
      "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd4uyf9/",
      "text": "Make yourself quizzes.",
      "author": "ChickendantZZZ",
      "created": 1631830159,
      "upvotes": 3,
      "replies": {}
    },
    "hd4onn4": {
      "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd4onn4/",
      "text": "It's class dependent, tell me the class and I can throw suggestions out. \n\nDo you use any kind of online software for your classes? \n\nPearson's dynamic study modules, mc graw hills smartbook, Macmillan's learning curve, ALEKS, etc are all super helpful.\n\nIf you don't know what to do, read the chapter slow enough so that you understand it. At the end of the chapter, there should be practice exercises or questions. \n\nWhen you can answer those practice exercises without using your book, you should be good.",
      "author": "SkeezySkeeter",
      "created": 1631827388,
      "upvotes": 5,
      "replies": {
        "hd8b3uh": {
          "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd8b3uh/",
          "text": "For resources all we have is the textbook and notes that I took.  and the class is Biology 1",
          "author": "SmellyTaterTot8",
          "created": 1631899451,
          "upvotes": 1,
          "replies": {
            "hd8lqg5": {
              "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd8lqg5/",
              "text": "If I were you, I'd thoroughly read the chapter, and connect your notes to the chapter so everything makes sense / is tied together.\n\nSeriously, read the chapter verbatim. Add in anything you deem important to your notes.\n\nIf there's an end of chapter summary go over that thoroughly. If there are practice questions, do them. If you get them wrong, *understand why you got them wrong.*\n\nI haven't taken my biology yet even though I'm a sophomore lol, so I do not know anything about it.",
              "author": "SkeezySkeeter",
              "created": 1631903949,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hd4mau8": {
      "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd4mau8/",
      "text": "Yes you reread your notes, but you should do more than that. It really depends which course it is, if you tell me I can give more detailed help",
      "author": "taybay462",
      "created": 1631826377,
      "upvotes": 5,
      "replies": {
        "hd8b5k9": {
          "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd8b5k9/",
          "text": "Biology",
          "author": "SmellyTaterTot8",
          "created": 1631899471,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hd4ilwd": {
      "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd4ilwd/",
      "text": "You need to break it up into increments within sessions. What’s the class?",
      "author": "Sxlaty",
      "created": 1631824844,
      "upvotes": 2,
      "replies": {
        "hd7ubxs": {
          "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd7ubxs/",
          "text": "well like a lil studying then break then back at it? Also the class is biology 1",
          "author": "SmellyTaterTot8",
          "created": 1631892449,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hd4i2eo": {
      "link": "/r/CollegeRant/comments/pples9/i_have_no_clue_how_to_study/hd4i2eo/",
      "text": "It depends on what class it is. You can always look up practice problems and go over homework. Some professors will give out a practice exam. Anything you need to do to make sure you understand the content of the class.",
      "author": "Scran_Dad",
      "created": 1631824622,
      "upvotes": 9,
      "replies": {}
    }
  },
  "updated": 1634063895
}