{"sid": "nrtjc4", "link": "/r/CollegeRant/comments/nrtjc4/prof_just_gave_me_a_d_in_a_class_where_i_earned_a/", "title:": "Prof. just gave me a D in a class where I earned a C", "text": "Overall, this professor is a good enough teacher. I understand it is online and it's sort of hard to teach in this environment. I certainly did a lot worse than normal this semester due to everything going on and ended class with a C. I checked on canvas and it was a C.  I've been okay with this grade as she literally has 0 A's in the whole class.\n\nI was paying for my classes on the school website and she already put my grade in as a D and I took the final yesterday and got a passing grade, and my overall grade was even higher than it was earlier. I emailed her, and she hasn't responded for roughly 6 hours. I went through the syllabus too, and I found the issue.\n\nThere is a tiny sentence in the middle of the syllabus that says \"you must pass more than half the tests to pass the class\". I didn't know this, and my grades for the 4 tests we took were 59%, 69%, 74%, and 75% for the final.\n\nI know I didn't do good on the first 2 tests, but I think that especially because it's online, only by 1%, nearly her whole entire class is failing, no one is excelling in the class, AND I HAVE A C I deserve to at least get a C!!\n\nI would be less pissed off too if she just told me all the way back in April that it was impossible to pass the class so I can at least drop it, but now not only is my GPA murdered, but my entire degree is pushed back nearly a year because I'm trying to do a 3-year course in 2 years and I can only transfer in the fall semester. I've been taking extra classes and 17 unit semesters and keeping a 3.6 and it all is probably gonna get ruined by 1 point for a policy that I didn't even know about.\n\n&#x200B;\n\nTL;DR My teacher gave me a D in a class I got a C in because I barely failed a single test from April.", "author": "frmanfr", "created": 1622770629, "retrieved": 1632842281, "over_18": false, "upvotes": 2, "upvote_ratio": 0.6, "comments": {"h0iilsg": {"link": "/r/CollegeRant/comments/nrtjc4/prof_just_gave_me_a_d_in_a_class_where_i_earned_a/h0iilsg/", "text": "Thank you u/frmanfr for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1622770630, "upvotes": 1}, "h0jnqjy": {"link": "/r/CollegeRant/comments/nrtjc4/prof_just_gave_me_a_d_in_a_class_where_i_earned_a/h0jnqjy/", "text": "Wait, so you actually do deserve the D? You just didn't read the syllabus? That's on you. The syllabus is the most important reading in any class.", "author": "TheProfessorsCat", "created": 1622796448, "upvotes": 13}, "h0iw2au": {"link": "/r/CollegeRant/comments/nrtjc4/prof_just_gave_me_a_d_in_a_class_where_i_earned_a/h0iw2au/", "text": "It seems like you didn't read the syllabus, the professor probably should have mentioned it but if its in the syllabus then it is on you to read it.", "author": "RenegadeBevo", "created": 1622777212, "upvotes": 14}, "h0ire1b": {"link": "/r/CollegeRant/comments/nrtjc4/prof_just_gave_me_a_d_in_a_class_where_i_earned_a/h0ire1b/", "text": "If you earned a higher grade, protest it.", "author": "thedarkwillcomeagain", "created": 1622774868, "upvotes": 5}, "h0ij24i": {"link": "/r/CollegeRant/comments/nrtjc4/prof_just_gave_me_a_d_in_a_class_where_i_earned_a/h0ij24i/", "text": "Also, I already registered for all my classes and my summer class starts in a few weeks, so hopefully she's even willing to respond to my email.", "author": "frmanfr", "created": 1622770859, "upvotes": 2}}}