{"sid": "mipk82", "link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/", "title:": "I’m terrified of getting cut off", "text": "My family told me that if I don’t get at least B+ in all my classes this semester, they’ll cut me off. My GPA is shit so I don’t qualify for scholarships, and my parents refuse to co-sign a loan because they think I’ll fuck up their credit score. My father’s stock portfolio exploded overnight too so FAFSA won’t give me anything-my expected family contribution is $150K. At this point I’m terrified my only option to pay for college is going to be drop out and enlist in the military for a few years, which means I’ll have to keep my mental health under wraps for the duration of my enlistment. I’m fucking terrified.", "author": "TheBryanScout", "created": 1617385893, "retrieved": 1632842881, "over_18": false, "upvotes": 171, "upvote_ratio": 0.97, "comments": {"gt5v1ka": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt5v1ka/", "text": "Thank you u/TheBryanScout for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1617385894, "upvotes": 1}, "gtga11a": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gtga11a/", "text": "I feel ya. The financial aid in my states a joke so I only get one scholarship a year. In going 40k in debt. Tbh I hate college and I'd drop out if a bachlors wasn't a requirement to make minimum wage. I'd have definitely joined the military by now but I have asthma. Idk hopefully I get lucky later down the road.", "author": "Red234234", "created": 1617629599, "upvotes": 1}, "gt8254k": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt8254k/", "text": "Have you told your advisor this? They might be able to pull some strings.", "author": "jempai", "created": 1617432808, "upvotes": 1}, "gt7yeh2": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt7yeh2/", "text": "-is paying for college and working full time. \n\nIt's possible, you just can't have a social life. Think of it like this, you get two out of three,  work, college, friends. Choose two", "author": "CyberAceWare", "created": 1617429416, "upvotes": 1}, "gt7ufb2": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt7ufb2/", "text": "When you say “for a few years” does that imply until 23? Because by then FAFASA defines you as an independent student and won’t need family contribution. You’ll get more aid this way.", "author": "AXXII_wreckless", "created": 1617426135, "upvotes": 2}, "gt7qdp6": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt7qdp6/", "text": "so instead of just getting a job, taking out a loan, talking to the financial aid office, figuring out what you may need to get your grades up, or applying for scholarships you feel your only  option is to... join the military?\n\nedit: oh. goes to cu boulder. this makes a LOOTT more sense; you’ll be good. Just moved away from boulder (thank god) and know so many people with these arrangements it makes my head spin", "author": "whatwhatchickenbutt_", "created": 1617423145, "upvotes": 2}, "gt7p6ma": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt7p6ma/", "text": "McDonald's is hiring Swing Managers.", "author": "tsmithfi", "created": 1617422327, "upvotes": 1}, "gt7oq33": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt7oq33/", "text": "Damn your parents help you..", "author": "crystalliite", "created": 1617422018, "upvotes": 1}, "gt7oo1e": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt7oo1e/", "text": "I'm in the reserves rn itll pay for community college but not a 4 year if you want to go to a 4 year and get a bachelor's go active duty", "author": "bald_butte", "created": 1617421980, "upvotes": 1}, "gt7o2sl": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt7o2sl/", "text": "It doesn’t sound like the military would be your only other option. Many of my friends have a job to support themselves through school. They work hard, but don’t live austerely by any means. Have you considered talking to the financial office at your school too? Sometimes there will be niche scholarships based on ethnicity (investigate if you have Huguenot ancestry, for example) or other things you don’t have to put a ton of effort into.\n\nFederal work study might not be an option based on your parents’ income, but an on-campus job certainly may be of some help too!", "author": "GeeseEnPointe", "created": 1617421594, "upvotes": 2}, "gt7mqot": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt7mqot/", "text": "My friend Sallie Mae would like a word", "author": "nadehlaaay", "created": 1617420743, "upvotes": 1}, "gt7g3pw": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt7g3pw/", "text": "If you’re interested in military instead of dropping out, does your school have an ROTC option? Some even have a joint with another location. Maybe look into that!", "author": "peachyypeachh", "created": 1617416634, "upvotes": 1}, "gt71c9u": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt71c9u/", "text": "take out a student loan", "author": "yeahmorgs", "created": 1617407944, "upvotes": 2}, "gt70m15": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt70m15/", "text": "Oof that’s really rough. If you want more advice than what you’ve gotten here, I suggest r/advice; they may be able to give more help", "author": "Emotional-Shirt7901", "created": 1617407530, "upvotes": 1}, "gt6vvvt": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt6vvvt/", "text": "If u have to join the military join the national guard!!! I hope it doesn’t come to that though.", "author": "kermitnik-", "created": 1617404897, "upvotes": 1}, "gt6qld3": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt6qld3/", "text": "Time to grow up and make something of yourself. Most people don't do anything unless they are forced too. Pull your big girl panties up. Life owes you nothing.", "author": "Nurrock", "created": 1617401986, "upvotes": -3}, "gt6q8e7": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt6q8e7/", "text": "Take out a loan like the rest of us", "author": "Kind_Concert_6300", "created": 1617401793, "upvotes": 4}, "gt6mmoh": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt6mmoh/", "text": "Someone said speak to financial aid at your school and that’s actually a great idea. They can give you an idea of what your options are. If you need to take time off to work that’s okay, you can always come back to school. Good luck!", "author": "AStruggling8", "created": 1617399885, "upvotes": 13}, "gt6kl54": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt6kl54/", "text": "I’m gonna be brutally honest in the hopes that this makes sense. I’d also like to point out that I’m actually in the exact same spot and this is kinda how I’ve dealt with it. A lot of people are going to blame you parents and any alternative points of subjectivity are probably going to be downvoted.\n\nIt’s actually a luxury for your parents to be paying for your college. It’s not a right. There’s no law stating that they must pay for you. Actually, after 18 in the US, they can cut you off completely and that’s how it be sometimes. \n\nUnfortunately, you shouldn’t be doing well in school simply because your parents threatened you with whatever bs this is. You should be doing well because, you see value in it yourself.\n\nIf your GPA sucks, you should probably be looking into why because, even though I’m not you, I have always been a shitty student and somehow pulled myself up to a 4.0 GPA just by focusing and managing my time.\n\nSometimes, college isn’t for everyone and that’s perfectly fine. Just find something that you see value in and pursue it. There’s no point in fighting with your parents. It’s just an uphill battle and you’re better off using that time and energy elsewhere.", "author": "majoroofboys", "created": 1617398820, "upvotes": 19}, "gt6jc23": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt6jc23/", "text": "If it helps, there’s this thing in college called FERPA where unless you give them permission, they can’t look at your grades.", "author": "CapriciousSalmon", "created": 1617398161, "upvotes": 5}, "gt6i8w6": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt6i8w6/", "text": "Damn, I’m sorry. That is truly fucked up, no parent should do that. \n\nApply for scholarships, and someone below mentioned merit based ones. \n\nUnless you become independent by getting married or something. \n\nYou could also try community college, cheaper. I did community college for 2 years, saved a lot of money before I transferred to university last semester. \n\nBut damn, you’re parents cannot do that (I think). That isn’t fair. \n\nYou could also try and speak to the financial aid office, explain your situation.", "author": "DumbHuman53", "created": 1617397587, "upvotes": 12}, "gt6gsad": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt6gsad/", "text": "Get married to someone in the same situation and you will be independent on the fafsa and no longer need to list their income. Or you could threaten your parents that you are going to do that to scare them. Or you could scare them with the idea you are going to marry someone you just met so you can stop being considered their dependent. They will probably freak out.", "author": "TriviaSidekick", "created": 1617396825, "upvotes": -1}, "gt6deuv": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt6deuv/", "text": "You could always work in the trades making great money. Save up and see if you want to go back to school! Life isn't always linear for sure", "author": "Map-leaf", "created": 1617395101, "upvotes": 14}, "gt6bt60": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt6bt60/", "text": "dam no offense but im never complaining about my parents again", "author": "Magentahood", "created": 1617394301, "upvotes": 57}, "gt68vfz": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt68vfz/", "text": "Don’t join the military for benefits. They will eat you up. BUT. If you do end up going the military route and succeeding there, the benefits are amazing. School is paid for on top of getting money for housing, vet preference hiring and you’ll have 4 years of work history. I make close to 6 figures and I’m only 27.", "author": "Spicybooiii", "created": 1617392817, "upvotes": 91}, "gt68mc9": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt68mc9/", "text": "Im not sure what year you are in, but if you're in your first year or second year, maybe you could do community college classes for a little bit. If you're at a university already, maybe you could do what my friend did where she would work one full semester without classes and take classes the semester after. Just some ideas.", "author": "Brian2017wshs", "created": 1617392689, "upvotes": 27}, "gt66axb": {"link": "/r/CollegeRant/comments/mipk82/im_terrified_of_getting_cut_off/gt66axb/", "text": "Apply for every scholarship you can, specifically the merit based ones", "author": "kylieb209", "created": 1617391541, "upvotes": 106}}}