{
  "sid": "qihhk3",
  "link": "/r/CollegeRant/comments/qihhk3/i_am_getting_a_c_this_semester_and_my_parents_are/",
  "title:": "I am getting a C this semester- and my parents are not helping",
  "text": "Hi there,\n\nI am a younger student who rushed school who is now suffering because of it. I was homeschooled until I dual enrolled at 15- got my A.A. at 17. Missed out on extra curriculars and high school all together. My parents were amazed at my progress and urged me to keep going- keep pushing. I was on a \"high.\" \n\nNow, I am in my first online semester on Accounting and I am going to get a C in all four classes (probably, maybe a B in one of them). So about a 2-2.2 GPA. I am out of motivation, I hardly have any hobbies (I draw and play tennis, but not daily). I feel lazy and tired and NOW my parents are telling me to take a break. Well bitches I can't now because I am locked to a school where I think I might just take the spring off and work. I work in IT and I do enjoy it so I might pursue some certifications next year. I feel awful and my parents don't help- they make me feel dumb without ever saying it. I have rushed and now have nothing. \n\nI have a bf who has hobbies (loves to build, put stuff together, etc.) and I feel bad for not being in a similar position as him. I feel like I have let my parents down. Now I have about 5.5 weeks until the semester ends and I am burned out. I'm not getting any encouragement. Hell, I got a B on a marketing exam and my mom said that maybe I just need to stop. That makes me mad. It was my parent's idea to go into Accounting so now I feel stuck. I don't think I am mature enough for it yet. \n\nWhat do I do? Can anyone relate?",
  "author": "Pandora_sus",
  "created": 1635527247,
  "updated": 1635780286,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hin26e1": {
      "link": "/r/CollegeRant/comments/qihhk3/i_am_getting_a_c_this_semester_and_my_parents_are/hin26e1/",
      "text": "I think that’s part of your problem. You’re trying way too hard to prove your worth to other people that you completely forgot about your own mental health. Highschool and college are completely different. Classes are harder and have a level of difficulty. You can’t just “do it all” in a matter of months. It takes a lot of time and effort. Some require ridiculous time to even pass. \n\nTake this as a learning lesson and don’t make the same mistake twice.",
      "author": "majoroofboys",
      "created": 1635600236,
      "upvotes": 3,
      "replies": {}
    }
  }
}