{"sid": "o0z0yg", "link": "/r/CollegeRant/comments/o0z0yg/i_hate_overthinking/", "title:": "I hate overthinking", "text": "I have this issue where I over analyze and overthink everything. I’m an insane planner, if I can’t time my day right I feel like a failure. Although this has helped me in college GPA wise, it drives me insane when I’m not in school. I literally overthank about a stupid little interview with my advisor for a tutoring job a teacher recommended me for, butchered everything word due to the crippling social anxiety I have and looked red as fuck. I just hate having this mindset, and people say well your GPA is good! I’d literally reread emails to professors I sent months ago, thinking wow I sound stupid asking that etc.", "author": "ttyltyler", "created": 1623827493, "retrieved": 1632950991, "over_18": false, "upvotes": 68, "upvote_ratio": 1.0, "comments": {"h1yqfll": {"link": "/r/CollegeRant/comments/o0z0yg/i_hate_overthinking/h1yqfll/", "text": "I feel this. My GPA isn’t as good as I want it to be so I can’t relate there. But the planning your day out hits home. I need to plan every second of every day or else I end up doing nothing and feel like a failure. When I have nothing to do, everything goes to shit. It’s wonderful really.", "author": "Objective-Tea-2158", "created": 1623849296, "upvotes": 5}, "h1y14ho": {"link": "/r/CollegeRant/comments/o0z0yg/i_hate_overthinking/h1y14ho/", "text": "This is one of the issues I deal with as well. In college classes, I would re-read assignments over and over again and try to find ways to make them perfect. I would even rehearse what I was going to say to professors before going to office hours. Literally anything that I do I overthink about. What if it’s not good enough?, what if I mess up?, etc. Even after I do things, I realize ways I could have done it better and then I beat myself up for not thinking of these ideas initially. I totally get you.", "author": "gonebonkerz", "created": 1623829488, "upvotes": 18}}}