{
  "sid": "qs1gzo",
  "link": "/r/CollegeRant/comments/qs1gzo/english_professor_slammed_my_writing_skills/",
  "title:": "English professor slammed my writing skills",
  "text": "I am in a 338 level English class this semester as one of my electives. Horrible mistake. \n\nWhile I was on a Zoom meeting with my English professor, she insulted my writing skills for fifteen minutes straight. She said that I write so stiffly that I sound like I'm from the 19th century. She said that it's been a really long time since she's read language like mine, and asked what I possibly could have done to formulate writing skills like that. She even asked if I went to a Catholic school, my writing was that stiff. \n\nThen she went on to talk about how dispassionate I sounded. She said I have no personality in my writing and that she's worried about the \"flexibility\" of my skills. \n\nThe point of this meeting was not supposed to be about my essay, I just wanted to ask questions about the rest of the semester. Truth is, I really didn't care about the subject of that essay. I am so busy with the other classes that I barely have time to focus on hers. \n\nI am a social welfare major in a sea of English majors, so maybe that's why my writing seemed so horrible. I don't know. I didn't think I was *that* bad. I really thought I was kind of good, but now my confidence in my writing skills is completely shot and I have two 15 page papers for my major due in a couple of weeks. I was already feeling really sad, but now I feel so much worse.\n\nShe still gave me a 9/10 though. like, wtf?",
  "author": "jidsuperfan",
  "created": 1636684892,
  "updated": 1636745869,
  "over_18": false,
  "upvotes": 85,
  "upvote_ratio": 0.93,
  "comments": {
    "hkbun9q": {
      "link": "/r/CollegeRant/comments/qs1gzo/english_professor_slammed_my_writing_skills/hkbun9q/",
      "text": "Critiques aren’t always useful or helpful. Her job is to teach you not to be so dispassionate. Your entire career is banking on you not to be emotionally involved. \n\nYour writing style is probably good for the technical writing the other professors are looking for. Obviously you are coming to an impasse with a creative writing assignment.  It isn’t her style.",
      "author": "L4dyGr4y",
      "created": 1636723053,
      "upvotes": 23,
      "replies": {}
    },
    "hkab27v": {
      "link": "/r/CollegeRant/comments/qs1gzo/english_professor_slammed_my_writing_skills/hkab27v/",
      "text": "She talk down on your writing while in a zoom meeting with other students and thought it was cool and for 15 mins. Oh you a good one cuz if they do save the zoom meetings videos I would've sent it to the dean and let them know. My college doesn't allow teacher to discredit students writing abilities down and ask for professors to guide students instead of discouraging them.",
      "author": "Forever_ForLove",
      "created": 1636685905,
      "upvotes": 34,
      "replies": {
        "hkabja1": {
          "link": "/r/CollegeRant/comments/qs1gzo/english_professor_slammed_my_writing_skills/hkabja1/",
          "text": "she’s seriously the shittiest professor ive ever had",
          "author": "jidsuperfan",
          "created": 1636686133,
          "upvotes": 25,
          "replies": {}
        }
      }
    },
    "hkc9pu1": {
      "link": "/r/CollegeRant/comments/qs1gzo/english_professor_slammed_my_writing_skills/hkc9pu1/",
      "text": "English major and writing tutor here. Seems like you NEED to write stiff for your field, right? You need to keep an extremely professional voice at all times. English professors and the entire field as a whole appreciates flexibility and a strong personal voice, but since you’re not an English major, you shouldn’t be worrying about your overall writing skills since this is one English class. Plus, this professor seems just downright rude.\n\nMy freshmen year, I took a required US history class and while I enjoyed the topics, I dreaded those papers. I just could not write the way that Professor wanted us to, and it was a complete mystery to me. He was much nicer about giving feedback in that he didn’t insult me like your professor did, but he also could not explain what exactly I wasn’t doing right. I just had to survive the class. \n\nDon’t worry about your paper. I mean, if you got a 9/10 from English anyways, your actual grammar and comprehension skills are probably totally fine, right? It’s hard to have writing confidence after a bad experience like that, but do your best to build yourself back up. Go to your professors in your major and ask them to take a look at a few pages or a first draft of that final paper you need to write. Go soon but ask them over email first. And don’t worry about that English class—just like I had to deal with in my history class, sometimes it’s “C’s get degrees.”",
      "author": "EwItsLindsey",
      "created": 1636730148,
      "upvotes": 9,
      "replies": {}
    },
    "hkc2pdm": {
      "link": "/r/CollegeRant/comments/qs1gzo/english_professor_slammed_my_writing_skills/hkc2pdm/",
      "text": "You are training to write dispassionately in the social sciences and you simultaneously took some sort of creative writing class. Once my brain trained out all the “fluff” in my writing as an IT person who wrote reports and analysis results, I found I couldn’t fire up the creativity as well. She may or may not be right about your writing, but there’s a chance your writing is perfectly suited for your actual field of work. Dispassionate is exactly what you need as a professional in your future field. \n\nI really think the professor made a terrible error in speaking to you this way. I wish she had encouraged and guided you instead. Please don’t let it get you down. Press on!",
      "author": "Apprehensive_teapot",
      "created": 1636727035,
      "upvotes": 6,
      "replies": {}
    },
    "hkcswje": {
      "link": "/r/CollegeRant/comments/qs1gzo/english_professor_slammed_my_writing_skills/hkcswje/",
      "text": "I was an English major in undergrad. \n\nThat isn’t constructive criticism. She is just being an ass. Your writing is probably fine, just not her cup of tea. She needs to be specific when she gives you critiques, and not just shaming you to shame you.",
      "author": "nonconformistnugget",
      "created": 1636737956,
      "upvotes": 1,
      "replies": {}
    },
    "hkcdu4i": {
      "link": "/r/CollegeRant/comments/qs1gzo/english_professor_slammed_my_writing_skills/hkcdu4i/",
      "text": "Honestly I wouldn't pay any attention to her input at all. If she gave you 9/10 then screw it, you're doing it right and you'll come out with a good grade. What I would do at this point is go talk to professors for the classes within your major that you're writing papers for and ask for their opinions, I think that's of much more value to you and might give you a boost after this last encounter. As a lot of others here have said, the style for your field is supposed to be dispassionate and your English professor is trying to teach the opposite.",
      "author": "upupupigo",
      "created": 1636731865,
      "upvotes": 0,
      "replies": {}
    }
  }
}