{
  "sid": "q7o0o5",
  "link": "/r/CollegeRant/comments/q7o0o5/rip_my_sanity_i_have_issues_ugh/",
  "title:": "rip my sanity....... i have issues ugh",
  "text": "I am so stressed out for no reason\n\nA little background: I have aNxiETy and I know I'm just making this a bigger deal than it has to be, but I'm really scared to go to my one of my classes tomorrow.\n\nI am so behind in this class (it's literally ENG-101, I know most people find that so easy) but the last time I went, my professor scolded me in front of the other students because I didn't know the answer to one of his questions. (he said I better \"figure it out\" because we have a test on it soon)\n\nSomething about me is that I am always super intimidated by authority figures and I always try to do the right thing to avoid getting in trouble, but I thought once I started college it wouldn't be as bad since like, you're PAYING for the classes and stuff...\n\nI missed my last class because the professor told us specifically not to come unprepared-- I have been trying to get caught up and idk why I can't--- I feel like internally it's because I feel incompetent and I feel like I don't have the brain capacity to be successful in the class. I know that sounds idiotic but it's just soooo hard to make myself do the work without feeling stupid.\n\nThis is probably making no sense but  just ugh\n\nI want to pass but I'm afraid of being stupid\n\nugh",
  "author": "EmotionalINFP",
  "created": 1634169933,
  "updated": 1634252317,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hgjxzem": {
      "link": "/r/CollegeRant/comments/q7o0o5/rip_my_sanity_i_have_issues_ugh/hgjxzem/",
      "text": "Honey, take a deep breath. English 101 is NOT always easy for everyone. If I remember correctly, there is a lot of literary analysis going on there. What your professor did was hopefully unintentional, I know a lot of professors who joke around with their students and pick fun of them on a non-personal level, but regardless, if you don't feel like he understands your predicament I HIGHLY suggest to get help online.  \n\n\nNo, that doesn't mean tutoring because that shit is expensive. I mean joining some sort of  study group, chat, or even looking up story summaries to help you better understand the material. English 101 moves fast and the only way to keep up is to stay on top of your assignments. Every day you need to do the work assigned. Even if you don't complete it, you need to touch everything every day. \n\nDon't be afraid to reach out for help!",
      "author": "Cup_O_Tea_For_Two",
      "created": 1634171763,
      "upvotes": 2,
      "replies": {}
    }
  }
}