{
  "sid": "qhc04k",
  "link": "/r/CollegeRant/comments/qhc04k/should_i_attend_my_graduation_ceremony_does_it/",
  "title:": "Should I Attend my Graduation Ceremony, Does it really matter??",
  "text": "I’m 21F and in two months I’m done with college degree but my ceremony is held in May. I’m grateful for it but I just don’t care about the ceremony part. The Uni experience wasn’t the best for me, I basically made no friends and I  was dealing with medical problems most of the time and I just wanted to finish as soon as possible. However my parents would like to go, should I go or do I sound selfish ??",
  "author": "RachelJ57",
  "created": 1635385486,
  "updated": 1635457398,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.8,
  "comments": {
    "hibtbau": {
      "link": "/r/CollegeRant/comments/qhc04k/should_i_attend_my_graduation_ceremony_does_it/hibtbau/",
      "text": "i think you should go just to officially close that door in this chapter of ur life. more good to go in my opinion.",
      "author": "Guilty_Ad_8470",
      "created": 1635385738,
      "upvotes": 20,
      "replies": {}
    },
    "hid82ts": {
      "link": "/r/CollegeRant/comments/qhc04k/should_i_attend_my_graduation_ceremony_does_it/hid82ts/",
      "text": "You'll never regret going, but you might regret not going in the future (Not saying you will necessarily). I'd go",
      "author": "StarvinPig",
      "created": 1635419552,
      "upvotes": 5,
      "replies": {}
    },
    "hibuek0": {
      "link": "/r/CollegeRant/comments/qhc04k/should_i_attend_my_graduation_ceremony_does_it/hibuek0/",
      "text": "If your parents helped pay for anything and they want to go, then I’d go.  Hopefully your school has a bunch of smaller graduations if it’s a large one.",
      "author": "dalej42",
      "created": 1635386213,
      "upvotes": 13,
      "replies": {}
    },
    "hid8g51": {
      "link": "/r/CollegeRant/comments/qhc04k/should_i_attend_my_graduation_ceremony_does_it/hid8g51/",
      "text": "I would go just to celebrate you going through a tough time throughout college, yet you still got a degree and made it. That’s worth celebrating.",
      "author": "sushe0001",
      "created": 1635419802,
      "upvotes": 3,
      "replies": {}
    },
    "hie4nu1": {
      "link": "/r/CollegeRant/comments/qhc04k/should_i_attend_my_graduation_ceremony_does_it/hie4nu1/",
      "text": "While your actual diploma gets mailed to your house a couple weeks after the ceremony, I’d just go to it anyways. Kind of just to symbolize “hey I made it and persisted despite my medical problems”, even if you didn’t make any friends graduating college is a huge accomplishment. So I’d just go anyways, especially if your family paid for any of your tuition, it would be for them too.",
      "author": "InfluenceNatural4149",
      "created": 1635435328,
      "upvotes": 2,
      "replies": {}
    }
  }
}