{"sid": "m58fra", "link": "/r/CollegeRant/comments/m58fra/feel_like_i_wasted_4_years_of_my_life/", "title:": "Feel like I wasted 4 years of my life", "text": "I know everyone's experience is different but Has anyone else had this feeling where you wanted to major in something and you thought it would be good for you like everyone says but then you just get exhausted of it and depressed and the one thing you loved to do everyday, now you cant wait for it to just end because of all the deadlines, expectations and assignments being thrown at you from like 7 different people every week and all you get is a grade for it. Maybe just me.", "author": null, "created": 1615768233, "retrieved": 1632843517, "over_18": false, "upvotes": 36, "upvote_ratio": 0.98, "comments": {"gqyot5t": {"link": "/r/CollegeRant/comments/m58fra/feel_like_i_wasted_4_years_of_my_life/gqyot5t/", "text": "Thank you u/National_Volume_2628 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1615768234, "upvotes": 1}, "gr08dwa": {"link": "/r/CollegeRant/comments/m58fra/feel_like_i_wasted_4_years_of_my_life/gr08dwa/", "text": "[deleted]", "author": null, "created": 1615811818, "upvotes": 8}, "gqzepvx": {"link": "/r/CollegeRant/comments/m58fra/feel_like_i_wasted_4_years_of_my_life/gqzepvx/", "text": "What's your endgame?\n\nIf you went to college just to go to college, then at the end of four years it's not uncommon to feel kind of hollowed out.", "author": "tuck229", "created": 1615784482, "upvotes": 1}, "gqyr43l": {"link": "/r/CollegeRant/comments/m58fra/feel_like_i_wasted_4_years_of_my_life/gqyr43l/", "text": "My understanding is that it does leave you into a depressed life. I've been in a similar situation, but you really need to work at it while also enjoying something you love. The trouble is how can I get to that? If you ever saw that film  Spider-Man 2 extended cut there's a scene where Peter visits the doctor asking him if there's anything wrong with him? And doctor responds that he visits his shrink, and tells him \"Strong focus on what I want.\"", "author": "Halomast123", "created": 1615769565, "upvotes": 3}}}