{
  "sid": "n20c3f",
  "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/",
  "title:": "Professors, stop being so power hungry",
  "text": "Honestly, it's so unnecessary.\n\n- Locking students out of classrooms \n- Only responding to emails where the student refers to you as Professor vs Dr. even though it's no where in your syllabus. By this I mean they either want to be called Professor OR Dr. which is fine, but they get very upset if you call them the other one they don't like. For example, they want to be called professor, and get upset when you call them Dr. \n- Telling students what tech they can and can not use (as long as it isn't disrupting others)\n- Telling students they can't talk before or after class (What the fuck?)\n- Not allowing students into your zoom call because... Fuck if I know\n- Requiring a doctor's note. Classist. \n- Making attendence mandatory (aside from the classes the require certain hours for certification etc.) \n- Not putting your powerpoint up on [insert online learning platform]\n\nEdit: typos and clarification",
  "author": "maybehun",
  "created": 1619807789,
  "over_18": false,
  "upvotes": 425,
  "upvote_ratio": 0.96,
  "comments": {
    "gwkn369": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwkn369/",
      "text": "I am professor.  \n\n* I don't lock students out of classrooms.  Well, sort of.  We have to keep the doors shut and locked because of school shooter security protocols, but if someone comes to the door, I say to open it.\n* I don't care how students refer to me.  The only name I won't accept is my first name.  I'll even accept my last name spelled incorrectly, though.\n* I'm considering doing this in the future.  This semester, students have been in the room clearly working on assignments for other classes and not mine.  I've had a student ask \"what is this annotated bibliography we have to do?  what is that supposed to be about?\" and it was the subject of the entire lesson, and the words \"annotated bibliography\" were up on the projector.  That student has now wasted class time of others by asking a question they wouldn't have asked if they were paying attention.  I didn't used to care about technology use, but since attendance has no bearing on grade in my class, I don't see why they're showing up if they have no interest in the lesson.\n* I encourage students to talk both before and after class.  That's ridiculous.\n* I haven't used Zoom during the pandemic.  I don't feel like it's fair to expect students to show up for a live discussion when they are having trouble getting access to an appropriate learning environment.  I've recorded all lessons, though.\n* I don't require doctor's notes.  I don't even necessarily care why students have to miss.\n* I already covered that attendance is not mandatory and not tied to grade.  That's why I hate when students come who clearly have no interest.\n* I forget to put my PowerPoints up, but I put all videos of my class up.  The PowerPoints are basically useless, since they only exist as a way of letting me remember what I'm supposed to talk about.  I do put about half of them up, though.\n\nYou don't cover this, but for about half of instructors right now, this is the first time they are teaching online and after this they never plan on teaching online again.  They are just trying to ride this out.  They haven't been provided any technology or compensation for this incredibly-advanced skill they've suddenly had to learn, which isn't really fair to both instructors and students.  \n\nBut, like 90% of the things you mention here I also disagree with.",
      "author": "chrisrayn",
      "created": 1619895570,
      "upvotes": 2,
      "replies": {}
    },
    "gwi6mni": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi6mni/",
      "text": "So I agree with some of this. However, proper  communication is important so you should refer to them as Professor or Doctor if they are one. I teach middle school and when I get emails with the subject \"Read\" and the body \"I turned that missing thing in\" all I respond back with it a form email that basically says try again using proper communication. \n\nAs for talking before or after class, it depends. If your their before, why not. If you have free time after, why not. However, sometimes you need to get from one room to another on a schedule.",
      "author": "mhscout",
      "created": 1619839984,
      "upvotes": 3,
      "replies": {
        "gwuw76e": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwuw76e/",
          "text": "* \"If you're there before\"",
          "author": "pcfreak4",
          "created": 1620093225,
          "upvotes": 3,
          "replies": {
            "gwuwaze": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwuwaze/",
              "text": "You got me",
              "author": "mhscout",
              "created": 1620093277,
              "upvotes": 2,
              "replies": {
                "gwuwf5p": {
                  "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwuwf5p/",
                  "text": "Just checking lol, at least you admitted defeat; you go teach'!",
                  "author": "pcfreak4",
                  "created": 1620093335,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gwi5emc": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi5emc/",
      "text": "Had a prof this semester that didn't respond to me or many other students for over 2 months over email.\n\nOnly responded to one person after he was reported to his department head. \n\nHis response? Not even related to the question. Only a \"I can't believe you have so little respect for me you'd go above me to try and get me in trouble.\"\n\nHow hard is it to respond to someone. Come on, at least have office hours. Shitty.",
      "author": "Map-leaf",
      "created": 1619839226,
      "upvotes": 25,
      "replies": {}
    },
    "gwi4hoy": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi4hoy/",
      "text": "My advisor doesn't answer her emails at all. I made an appointment to meet with her next week and she better freaking be there. It's been over two weeks since I sent a follow up and nothing.....thanks for wasting my time by having to drive an hour to campus to probably not even be seen by her.",
      "author": "torileighxvl",
      "created": 1619838671,
      "upvotes": 10,
      "replies": {
        "gwilujl": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwilujl/",
          "text": "Same. I eventually managed to meet with her and whoo boy. A mess. She kept telling me info that was contradictory to what was posted on my college’s website *and* the website of the university I’m intending to transfer into. In addition to that she was just so unhelpful about every single one of my issues. \n\nI changed advisors. So, so glad I did. She confirmed everything that I *knew* was correct, offered solutions to all of my problems, and helped me come up with a plan so I’d be able to graduate on time. \n\nMy original advisor was legit just going to have me graduate a semester late because of *one class* when there was a perfectly viable solution (I had the class waived). Like seriously.",
          "author": "reinakun",
          "created": 1619851362,
          "upvotes": 5,
          "replies": {
            "gwmcrw0": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwmcrw0/",
              "text": "Mine does the same, except at a university, and shes over that part of her department. Not looking forward to meeting with her this week.",
              "author": "torileighxvl",
              "created": 1619926491,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gwi084e": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi084e/",
      "text": "Here's a list of reasons I do most of these things:\n\n1.) If students are disruptive or spamming memes in chat. \n\n2.) I respond to all e-mails, but I sometimes just direct students to office hours or to the syllabus. This is more a problem of e-mail volume than how I'm addressed. \n\nIf I'm addressed incorrectly, I will gently correct it.\n\n3.) This isn't something I can relate to unless it's unauthorized recording.\n\n4.) Talking before and after class is fine. Talking during class is not. Often students are not good at making this distinction, which means I have to mute all.\n\n5.) I don't allow access to the zoom call if students are not using their university affiliated e-mail accounts. This prevents zoom-bombing. \n\n6.) I don't require a doctor's note but the disability office usually does, and I require documentation from them. In the U.S., this is inequitable because the health care system is fucked. Unfortunately, we have to have some standards of documentation for making academic accommodations and exemptions. \n\n7 and 8.) This is an interesting problem. If I make attendance mandatory and don't post powerpoints, then students actually come to class. Students learn far better in class than they do on their own, and the class average and outcomes are always better. This system is harder on working students, however. \n\nIf I don't make attendance mandatory and I post the slides, then it makes the lives of very busy students a bit easier. However, most of the students stop coming and they don't learn well on their own. The class average drops and more students fail.",
      "author": "TheProfessorsCat",
      "created": 1619836213,
      "upvotes": 7,
      "replies": {
        "gwi4t6x": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi4t6x/",
          "text": "You sound fun.",
          "author": "jayswaz",
          "created": 1619838864,
          "upvotes": 6,
          "replies": {
            "gwi6wgd": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi6wgd/",
              "text": "And I get more fun with each passing year.",
              "author": "TheProfessorsCat",
              "created": 1619840149,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "gwilusg": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwilusg/",
          "text": "Thanks for posting. I too had the idea that there may not have been enough context. Then again, this is a place to rant.",
          "author": "Marky_Marky_Mark",
          "created": 1619851368,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gwhadg8": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhadg8/",
      "text": "As someone with a Phd, I am yet to understand what is the big deal about being called Dr.. like just because you have a degree you can no longer be called Mr / Ms? I heard a story where a PhD holder in the humanities wanted their medical doc to call them as Dr and the medical doc was like \"in this clinic, I am the doctor here, you are not my professional equal\". The patient must have been really insistent if the Doc was that direct.",
      "author": "Formal-Nectarine-296",
      "created": 1619822627,
      "upvotes": 44,
      "replies": {
        "gwillq5": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwillq5/",
          "text": "I understand insisting on titles if the professor is a woman. The discrepancy in respect white men get compared to women and minorities is mindbogling. Stuff like e-mails that start with \"Dear dr [Man] and ms [Woman]\" when both hold a PhD.  \n  \nWhite men simply get a lot of authority thrown their way that others may need to fight to get.",
          "author": "Marky_Marky_Mark",
          "created": 1619851148,
          "upvotes": 22,
          "replies": {
            "gwp673f": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwp673f/",
              "text": "[deleted]",
              "author": null,
              "created": 1619982483,
              "upvotes": -2,
              "replies": {
                "gws87y6": {
                  "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gws87y6/",
                  "text": "Mrpiggerz ur a degenerate gfys",
                  "author": "AdroitMan",
                  "created": 1620050466,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gwha13n": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwha13n/",
      "text": "I’ve got one that changes due dates weekly. Not planned changes, but arbitrarily emails us that in 20 minutes she’s doing a random zoom call and we better be there if we want to know the new due date. I’m fucking boggled. This is the worst semester yet because of this one instructor.",
      "author": "mother_of_nerd",
      "created": 1619822456,
      "upvotes": 51,
      "replies": {
        "gwhn1p9": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhn1p9/",
          "text": "I think I’d be going over her head to the department head.  Not everyone can literally drop everything to do a random zoom call.  Not cool.  Not called for.  Total BS",
          "author": "tmvance2",
          "created": 1619829137,
          "upvotes": 25,
          "replies": {}
        }
      }
    },
    "gwh3j3g": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwh3j3g/",
      "text": "Not allowing eating at a class that meets during dinner time for some fucking reason",
      "author": "Gerardo1917",
      "created": 1619819289,
      "upvotes": 65,
      "replies": {
        "gwhjr4n": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhjr4n/",
          "text": "Set your Zoom image to just a picture of you sitting at your computer. Then turn the camera off. They'll be none the wiser.",
          "author": "Comprehensive-Ad3963",
          "created": 1619827452,
          "upvotes": 18,
          "replies": {
            "gwht8bm": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwht8bm/",
              "text": "You’d think",
              "author": "wqmbat",
              "created": 1619832381,
              "upvotes": 8,
              "replies": {}
            },
            "gwkh8em": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwkh8em/",
              "text": "set your zoom virtual background to a video of you sitting in front of the camera with occasional movement and blinking, then just cover the camera with tape. It's much more effective, especially if the video has your mouth covered and they can't tell if you are talking or not.",
              "author": "vsujeesh",
              "created": 1619893015,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gwh2pcr": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwh2pcr/",
      "text": "I’ve been waiting all day to talk to a professor, and that’s not an exaggeration. I came to his office at 11am, but he told me to come back in 30 minutes. So I waited and came back in 30 min. There were a few students he was talking to so I had to wait. Two hours pass and it’s 1pm now. I have to get home for my online class since I don’t have a laptop and all my work is on my PC at home  (which is a 1 hour commute back). So I email him on my phone letting him know I have to go home but I’ll comeback since i didn’t want to interrupt. No response.\n\nIt’s 4:30pm and I just got back to campus after another one hour commute. I get to his office and he’s not there. I eventually find him critiquing freshman projects (I’m an architecture major) so now I’m waiting on a bench outside until he’s done with that which won’t be until 5:30pm. \n\nFor some reason this can’t be taken care of over email so I have to meet him in person. I’ve driven over 70 miles, with another 26 miles to go since I have to drive back home, and I am so done. I literally can’t right now. I don’t understand why he can’t just give me a time to see him. He told me to just “drop by” but so far every time I have, he’s been busy and I’ve had to wait. And he won’t even answer my emails. Im done with college.",
      "author": "NRevenge",
      "created": 1619818890,
      "upvotes": 162,
      "replies": {
        "gwh4iir": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwh4iir/",
          "text": "I hate it. Ive had profs do this to me before too.\n\n After long ass day of classes, I get to your office, at a time *you* said was convenient to *you*. Only to find the prof doing some other bullshit, shooting the breeze. Its unprofessional as fuck. I dont have infinite free, wtf.\n\nAnd then they just go \"ill be done soon! Just wait outside\". And before you know it, 2 hours have passed. And now they wanna reschedule shit....literally unprofessional fuck shit.\n\nYou have it so much worse tho. I wouldnt blame you if you dropped all your shit and fought that prof right there.",
          "author": "Throwaaawaayyy123456",
          "created": 1619819757,
          "upvotes": 69,
          "replies": {}
        }
      }
    },
    "gwh2e5l": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwh2e5l/",
      "text": " \n\n>Not putting your powerpoint up on insert \\[online learning platform\\]\n\nWhat is insert? A new platform?\n\n \n\n>Requiring a doctor's note. Classist.\n\nWhy is this even classist?",
      "author": "-boredMotherFucker",
      "created": 1619818740,
      "upvotes": -34,
      "replies": {
        "gwh4hne": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwh4hne/",
          "text": "Millions of Americans do not have access to affordable healthcare.",
          "author": "kittenembryo",
          "created": 1619819745,
          "upvotes": 36,
          "replies": {
            "gwhexy2": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhexy2/",
              "text": "That is their problem. They've got to  find a way.\n\nedit: you, reader, upvote this comment.",
              "author": "-boredMotherFucker",
              "created": 1619824996,
              "upvotes": -41,
              "replies": {
                "gwhfgex": {
                  "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhfgex/",
                  "text": "Most living humans do not have access to affordable healthcare",
                  "author": "kittenembryo",
                  "created": 1619825259,
                  "upvotes": 19,
                  "replies": {
                    "gwhsgo0": {
                      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhsgo0/",
                      "text": "> Most living humans do not have access to affordable healthcare \n\n That is their problem. They've got to find a way.",
                      "author": "-boredMotherFucker",
                      "created": 1619831969,
                      "upvotes": -23,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gwh68vx": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwh68vx/",
          "text": "Because there are like 6. The second can be answered by a Google search.",
          "author": "maybehun",
          "created": 1619820585,
          "upvotes": 13,
          "replies": {
            "gwhevi0": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhevi0/",
              "text": "Naaah, yo too lazy to tell me.  Shut the fuck up if you're not gonna tell me",
              "author": "-boredMotherFucker",
              "created": 1619824960,
              "upvotes": -14,
              "replies": {
                "hd093xt": {
                  "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/hd093xt/",
                  "text": "Ironic",
                  "author": "xRaijin",
                  "created": 1631744231,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gwhnvkj": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhnvkj/",
          "text": "My school uses Blackboard.  Put the damn PowerPoint on Blackboard for students to download or view at their convenience.  \n\nRequiring a note from a physician saying I was sick is totally classist.  Is it not a discriminatory attitude based on social class??  It’s the professor saying hey buddy, you missed the class that you are paying for because you thought you were sick.  Well, I don’t think you were, and as I’m the professor, I’m going to bed you to prove the reason you missed the class I am teaching to 30 of your classmates (which I might add are also paying for me to teach this class) was really because you felt you might be sick.",
          "author": "tmvance2",
          "created": 1619829566,
          "upvotes": 12,
          "replies": {
            "gwht0jg": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwht0jg/",
              "text": "You're the student. He is the prof. Prof>student. You must obey. Otherwise, he might not make you pass. I bet you want to pass.",
              "author": "-boredMotherFucker",
              "created": 1619832266,
              "upvotes": -7,
              "replies": {
                "gwi0gur": {
                  "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi0gur/",
                  "text": "you rlly are a bored motherfucker",
                  "author": "hentdie",
                  "created": 1619836348,
                  "upvotes": 16,
                  "replies": {
                    "gwi5eze": {
                      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi5eze/",
                      "text": "Your mother was not bored after all... she was so sweaty.",
                      "author": "-boredMotherFucker",
                      "created": 1619839232,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                },
                "gwhx369": {
                  "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhx369/",
                  "text": "weirdo",
                  "author": "eilig",
                  "created": 1619834456,
                  "upvotes": 13,
                  "replies": {
                    "gwi57on": {
                      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi57on/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1619839111,
                      "upvotes": -2,
                      "replies": {
                        "gwi58j2": {
                          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi58j2/",
                          "text": "weirdo",
                          "author": "eilig",
                          "created": 1619839125,
                          "upvotes": 11,
                          "replies": {
                            "gwkp03w": {
                              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwkp03w/",
                              "text": "[removed]",
                              "author": null,
                              "created": 1619896431,
                              "upvotes": 0,
                              "replies": {
                                "gwkqcsu": {
                                  "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwkqcsu/",
                                  "text": "yes, it is a perfectly reasonable deduction on your part to assume i will have a normal conversation with you, on your terms, after multiple insults. weirdo.",
                                  "author": "eilig",
                                  "created": 1619897038,
                                  "upvotes": 5,
                                  "replies": {
                                    "gwksduj": {
                                      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwksduj/",
                                      "text": "[removed]",
                                      "author": null,
                                      "created": 1619897963,
                                      "upvotes": 0,
                                      "replies": {
                                        "gwksib3": {
                                          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwksib3/",
                                          "text": "i’d rather waste your time",
                                          "author": "eilig",
                                          "created": 1619898020,
                                          "upvotes": 1,
                                          "replies": {
                                            "gwkx8ls": {
                                              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwkx8ls/",
                                              "text": "Thank you for being so considerate. \n\nHave a fucking great day.",
                                              "author": "-boredMotherFucker",
                                              "created": 1619900197,
                                              "upvotes": 0,
                                              "replies": {
                                                "gwkzncx": {
                                                  "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwkzncx/",
                                                  "text": "no u :*",
                                                  "author": "eilig",
                                                  "created": 1619901211,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gwh15i5": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwh15i5/",
      "text": "As a professor, I agree with every point.",
      "author": "jayswaz",
      "created": 1619818147,
      "upvotes": 81,
      "replies": {
        "gwh2i5t": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwh2i5t/",
          "text": "As a student, I don't know what to say",
          "author": "-boredMotherFucker",
          "created": 1619818794,
          "upvotes": 38,
          "replies": {}
        },
        "gwhepxx": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhepxx/",
          "text": "My turn.  \n\nStudents, please make an effort.\n\nYou've all had that boring teacher who just stands in the front of the room and reads powerpoints in a monotone voice all class.  It's brutal, right?  Well, guess what, we have classes like that.  I try to bring energy and enthusiasm to every class.  Can you please do the same?",
          "author": "jayswaz",
          "created": 1619824880,
          "upvotes": 29,
          "replies": {
            "gwhkr66": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhkr66/",
              "text": "I try to do my part and ask questions if the room seems dead.",
              "author": "TDragon_21",
              "created": 1619827960,
              "upvotes": 20,
              "replies": {
                "gwhqrzk": {
                  "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwhqrzk/",
                  "text": "It's greatly appreciated.",
                  "author": "jayswaz",
                  "created": 1619831076,
                  "upvotes": 13,
                  "replies": {
                    "gwi81xk": {
                      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwi81xk/",
                      "text": "I’ll second that.",
                      "author": "wildgunman",
                      "created": 1619840878,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gwj1nli": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwj1nli/",
              "text": "See, you bring enthusiasm and energy to every class. Most do not. Most sit there and read that boring PowerPoint and if you ask a question, an answer isn’t actually given. When you go to email, the person doesn’t respond. When you ask the question again in the next section, the person decides to call you out. You enter this mindless banter over what is right and what is wrong. Why both of our lives suck and why college sucks the life out of us. All which could’ve been avoided entirely if the question was answered properly the first time. If a student is asking a question, answer the damn question. I am writing this as it’s happening to me right now, sitting in a room with a professor who can’t show me any sort of courtesy or time of day. Hard to give that back if it’s a one way street.\n\nAnyways, hopefully you’re not like this. If you aren’t, thank you so much for being great. It helps when we’re broke, stressed and burnt the fuck out.",
              "author": "majoroofboys",
              "created": 1619866550,
              "upvotes": 7,
              "replies": {}
            },
            "gwj8e5c": {
              "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwj8e5c/",
              "text": "Sometimes students may not want to show enthusiam unless at least one other student does the same.",
              "author": "TheRapidTrailblazer",
              "created": 1619871992,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "gwgkq7d": {
      "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwgkq7d/",
      "text": "Some of these policies could be mandated by the department or university, sometimes professors don't have control over attendance/grading/requiring doctor's notes.",
      "author": "jomyers_online",
      "created": 1619810397,
      "upvotes": 44,
      "replies": {
        "gwglp7h": {
          "link": "/r/CollegeRant/comments/n20c3f/professors_stop_being_so_power_hungry/gwglp7h/",
          "text": "All accurate! None of these are my university's policies though.",
          "author": "maybehun",
          "created": 1619810852,
          "upvotes": 30,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634061541
}