{"sid": "ozo4nc", "link": "/r/CollegeRant/comments/ozo4nc/state_school_problems/", "title:": "State school problems.", "text": "Anyone else frustrated by how their state school really can't enforce covid guidelines by the CDC. The only thing my school is actually doing is requiring us to test negative for covid before moving in the dorms.", "author": "historicallyWTF", "created": 1628317475, "retrieved": 1632841662, "over_18": false, "upvotes": 17, "upvote_ratio": 0.8, "comments": {"h811oaq": {"link": "/r/CollegeRant/comments/ozo4nc/state_school_problems/h811oaq/", "text": "Thank you u/historicallyWTF for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1628317475, "upvotes": 1}, "h84mxsf": {"link": "/r/CollegeRant/comments/ozo4nc/state_school_problems/h84mxsf/", "text": "Even worse when your state school is housed in the same state as CDC Headquarters!", "author": "noexqses", "created": 1628391613, "upvotes": 3}, "h83lmj5": {"link": "/r/CollegeRant/comments/ozo4nc/state_school_problems/h83lmj5/", "text": "My state school just went back to requiring masks indoors. I know a lot of people are going to be little bitches about it though, including my own friends, and I'm not looking forward to it. Hopefully some savage professors will call the anti-maskers out tho.", "author": "uplink2", "created": 1628371747, "upvotes": 4}, "h835quq": {"link": "/r/CollegeRant/comments/ozo4nc/state_school_problems/h835quq/", "text": "Many of the schools in my state are actually requiring vaccines sooo", "author": "Concerned-23", "created": 1628363964, "upvotes": 2}, "h82xjz1": {"link": "/r/CollegeRant/comments/ozo4nc/state_school_problems/h82xjz1/", "text": "My school is doing nothing lmao so at least that’s something. It’s bullshit though and I’m not happy about it", "author": "AStruggling8", "created": 1628360078, "upvotes": 3}, "h81d9ep": {"link": "/r/CollegeRant/comments/ozo4nc/state_school_problems/h81d9ep/", "text": "I’m a bit frustrated with mine as well. There’s no mask requirement and if you submit proof of vaccination you don’t need to be tested at all. Especially with the new variants going around, the last thing I want to do is sit in a small room surrounded by people no longer wearing masks and having zero testing to ensure they aren’t spreading it. I’m having to plan on getting a test done myself before I can go home on weekends because I have a parent who’s immunocompromised and I can’t risk bringing something home. This is setting up to be a huge mess when everyone gathers together right away with basically zero rules set in place. If nothing else, I don’t want the “common cold” or “flu” that’s going around to be reduced symptom covid and not know it until it’s too late.. Really hoping they freak out and give an option for remote so I can just stay home and avoid the chaos.", "author": "XxNHLxX", "created": 1628327339, "upvotes": 13}, "h81auqu": {"link": "/r/CollegeRant/comments/ozo4nc/state_school_problems/h81auqu/", "text": "Wow, the government can’t tell us what to do? The horror!", "author": "BigRedGeorge", "created": 1628325187, "upvotes": -10}}}