{"sid": "nnzw3q", "link": "/r/CollegeRant/comments/nnzw3q/why_would_homework_not_increase_grade_but_bring/", "title:": "Why would homework not increase grade but bring it down if you don't do it??", "text": "I'm taking liberal arts math and have been doing great but got a B+ on my first test and my grade is at an 88.56 and i was like great! No problem! I can totally bring it up with chapter 5' homework except i did a couple homeworks (all were 100%) and it didn't budge my grade AT ALL\n\nI know homework isn't weighted that heavily in my class it's 14% but if it doesn't impact my grade with 100% then why do zeros impact my grade??\n\nI changed the scores on canvas just to see if it would affect my grade at all if i just didn't do the homework and yeah it brought my grade down like 3points and ???\n\nIt doesn't make sense why would some assignments absolutely not change my grade at all if i got perfect scores on them but impact me heavily if i don't do them.\n\nThat just makes me not want to do the homework if it won't even positively affect my grade lmfao 🤠🔫", "author": "Fickle-Management", "created": 1622334907, "retrieved": 1632949775, "over_18": false, "upvotes": 22, "upvote_ratio": 0.89, "comments": {"gzyfbx2": {"link": "/r/CollegeRant/comments/nnzw3q/why_would_homework_not_increase_grade_but_bring/gzyfbx2/", "text": "When you add an assignment to a total course grade, your course grade will change more when the new assignment is farther away from the course grade. For example, if you have an 80% overall and get a 90% on the HW that's only 10% away so it's not much of a move. But if you have 80% overall and get a 0% that's 80% different and will move your grade lower by more. \n\nThe higher your course grade is, the harder it is to move it up more.\n\nsource: I'm a math professor....", "author": "TheJaycobA", "created": 1622361879, "upvotes": 21}, "gzyaraq": {"link": "/r/CollegeRant/comments/nnzw3q/why_would_homework_not_increase_grade_but_bring/gzyaraq/", "text": "Because of how math works.", "author": "TheProfessorsCat", "created": 1622357615, "upvotes": 4}, "gzxeiuu": {"link": "/r/CollegeRant/comments/nnzw3q/why_would_homework_not_increase_grade_but_bring/gzxeiuu/", "text": "I’ll just say that if you choose not to do your homework, expect your test grade to go down because you haven’t practiced. That’s why homework is assigned so that you practice the things you will be assessed on. It also allows you to see where you have problems with your learning so you can correct them before the exam when mistakes really lower your grade. So, even if you choose not to turn in your homework, you should absolutely do it. However, if you are going to the trouble of doing it, you should turn it in. It is frustrating though.", "author": "Hazelstone37", "created": 1622335270, "upvotes": 9}}}