{"sid": "o43p1k", "link": "/r/CollegeRant/comments/o43p1k/professors_if_any_of_you_see_this_please_stop/", "title:": "Professors, if any of you see this, PLEASE stop removing autocaptions on recorded lectures.", "text": "I have ADHD and they're the only way I can watch lectures. They're automatically there, so why remove them? I don't think a single person is harmed by the option being there. Sorry if I sound like an entitled brat, it's not my intention.", "author": "blabbedybloobla", "created": 1624188825, "retrieved": 1632842193, "over_18": false, "upvotes": 32, "upvote_ratio": 1.0, "comments": {"h2f35bp": {"link": "/r/CollegeRant/comments/o43p1k/professors_if_any_of_you_see_this_please_stop/h2f35bp/", "text": "Thank you u/blabbedybloobla for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1624188825, "upvotes": 1}, "h2gz3uj": {"link": "/r/CollegeRant/comments/o43p1k/professors_if_any_of_you_see_this_please_stop/h2gz3uj/", "text": "YouTube refuses to auto caption some of my lecture videos because the first 4 seconds of the videos are silent, which apparently messes with their algorithms.\n\nI doubt your professors are actively removing auto captions.", "author": "plumpvirgin", "created": 1624225150, "upvotes": 9}, "h2fwg47": {"link": "/r/CollegeRant/comments/o43p1k/professors_if_any_of_you_see_this_please_stop/h2fwg47/", "text": "I have to choose to add the Closed Captioning to my videos.  It is a 3 step process.  I do this as I believe it will help students. \n\nI do not know which tool(s) your professor is using so it may indeed be as you say they are removing them but none of the recording systems I have used asked me if I wanted to remove the CC, I had to make an active choice to include them.  There is old adage to never attribute something to malice when it is more likely to be ignorance.\n\nIf you need the Closed Captioning then contact your disability office as they can ensure this is done to meet ADA requirements.", "author": "SlightScholar1", "created": 1624206000, "upvotes": 19}, "h2fhu1p": {"link": "/r/CollegeRant/comments/o43p1k/professors_if_any_of_you_see_this_please_stop/h2fhu1p/", "text": "They can sometimes misinterpret words (with potentially funny or disastrous results, depending on how you look at it), so maybe that’s why they’re being removed? I don’t know - I don’t remove them because they’re helpful, and even if they weren’t, we aren’t allowed to remove them for accessibility reasons. They probably shouldn’t be removing them, actually, if they have offices similar to ours who oversee accessibility.", "author": "PhDapper", "created": 1624198394, "upvotes": 3}}}