{"sid": "pjqvc7", "link": "/r/CollegeRant/comments/pjqvc7/making_inperson_classes_do_online_introduction_is/", "title:": "Making in-person classes do online introduction is just weird..", "text": "I can’t be the only one who thinks it’s weird that in-person classes are continuing to do online discussions. I’m a junior and before the pandemic I never had to do introductions. Even my in-person 300 level stats course wants us to upload a picture of ourselves and describes ourselves. It’s kind of strange to me especially since there’s 200 people in this class and it’s not my major. Maybe the professor actually cares and wants to get to know us but it’s strange to me because the last time I was in person my professors did not care at all. \n\n\nAlso, I hope they don’t continue with online discussions because it was never helpful; it was not a real discussion. It’s just a waste of time IMO.", "author": "denver_rose", "created": 1631033240, "retrieved": 1632841134, "over_18": false, "upvotes": 7, "upvote_ratio": 0.83, "comments": {"hby7vu8": {"link": "/r/CollegeRant/comments/pjqvc7/making_inperson_classes_do_online_introduction_is/hby7vu8/", "text": "Thank you u/denver_rose for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1631033241, "upvotes": 1}, "hc9vxnb": {"link": "/r/CollegeRant/comments/pjqvc7/making_inperson_classes_do_online_introduction_is/hc9vxnb/", "text": "Also what’s with having us do weekly online discussions when before we could just hmm idk TALK IN FUCKING CLASS", "author": "AyyyLmao117", "created": 1631248288, "upvotes": 3}, "hc0v6gg": {"link": "/r/CollegeRant/comments/pjqvc7/making_inperson_classes_do_online_introduction_is/hc0v6gg/", "text": "If I only knew then what I know now, I would have made a generic template for each class.", "author": "fractaldesigner", "created": 1631076673, "upvotes": 5}}}