{"sid": "nrap6j", "link": "/r/CollegeRant/comments/nrap6j/i_dont_want_to_retake_my_math_class_with_the_same/", "title:": "I don’t want to retake my math class with the same professor again.", "text": "I’m (F20) going to be a junior this fall and this semester is my first semester that I failed 2 classes.\n\nI was taking a math course since it is required. I took it with a professor that I had my first year. She was pretty calm and understanding so I decided to take this class with her again. Everything was going okish for her class until finals came.\n\nI was sort of struggling in her class since the tests were completely different from the homework assignments. So when it was finals, we had to create a video explaining on how to do a problem.\n\nThis part was my fault since I did not read the rubric and I just read her description that said I had to create a video with a time limit between 8-12 minutes. So I did that and my dumbass thought it was simple that I kind of left it until the last 2 days to do it since I had other exams to do too. \n\nAnyways I started recording the day before it was due and the next day I was planning to edit it and send it. Well that did not go as plan since I had an English class that didn’t tell me when I had an exam for that class. The day that the video was due well my English professor gave us an email that we had to do the exam for her class which lasted 2 hours.\n\nOkay so the English exam started at 11am and ended until 1:30pm. My math video was due at 2pm. When I noticed that I emailed my math professor if I can have an extra hour or 2 to finish editing my video and she replied saying yes and she gave me until 5pm. That was a kind thing for her to do.\n\nAgain as I said earlier this was my fault which I didn’t read the rubrics. In the rubrics it said I needed to show my face, talk slow, be understanding, 8-12 length, and show examples.  Well once I sent the video I read the rubrics and noticed I didn’t have all that since all I had was 10 minute video with half cut audio since I realized I didn’t calculate my time correctly. From that moment I realized that I was going to get a poor grade and I was okay with that.\n\nHere comes the reason why Im ranting.\n\nOnce I sent it, she later commented that I need to follow the instructions on uploading the video. As I didn’t read the rubrics I didn’t see that. So I apologized to her. That was my first time uploading a video too so I was confused. The instructions told me to make a one drive, upload my video there and share it with the email that was showing me. I did all that but she messaged me again saying she didn’t received anything even though I did that twice.  I ended up sending a link to her through the comments.  She ending up telling me that she was frustrated telling me what to do and that I wasn’t listening to her. She also sent me my grade with that too.\n\nThe only problem I have now is that I passed that class with a D+ but I realized that I need a C+ or higher in order to take the next class after that.  So now I’m sure I have to retake that class again with her this upcoming fall since she is the only one teaching that class. And I don’t want to deal with what happened again. Sigh\n\nTL;DR\nMy math professor got frustrated that I didn’t send the final video when I did sent it to her. I barely passed that class but I need to retake her class in order to enroll to the next class. I don’t want to take that class again with her because I don’t want to deal with that again.", "author": "Lytzy", "created": 1622718098, "retrieved": 1632949759, "over_18": false, "upvotes": 7, "upvote_ratio": 0.89, "comments": {}}