{"sid": "huwpov", "link": "/r/CollegeRant/comments/huwpov/tell_me_again_whats_the_point_of_life/", "title:": "Tell me again, what’s the point of life?", "text": "I was quite a nobody growing up, no one expected anything of me, no one thought anything about me. But I refused to treat myself the same way, stubbornly expecting more from myself than others did, way more. And I dreamed of going to a top uni because I equated it with success in life in general. After all, most of the successful people have gone to these universities, right? So, I achieved my dream. I got into a top uni on a 100% scholarship. \n\nBut I soon discovered that I didn’t have any ambition for afterwards. Sure, I wanted to climb the social mobility ladder and change the world. But how? What should I do with my life to achieve this and how do I do it in a manner that everybody remembers me after I’m gone? So I know that I am significant or was significant, not just a small deluded speck in the universe, of which there are a trillion more. \n\nI don’t know what I want to do. But I do know that it’s not a cushy job at a big firm. It might be what I have to do but never what I want to do. \n\nI have been depressed for the majority of my first year at uni. Outwardly, I have all the markers of success. And don’t get me wrong, I am grateful. But inwardly, I have let everything go. I don’t care anymore. It’s like I want myself to fail, so I can save myself. But I don’t have a dream anymore. And life without a dream is turning out to be scarier than I thought. I don’t want to be a nobody. Not again. I want to change the world. I just don’t know how or why even. What is the point of this life, again?", "author": "Whatever964", "created": 1595288999, "retrieved": 1632951501, "over_18": false, "upvotes": 39, "upvote_ratio": 0.95, "comments": {"fzfd4zy": {"link": "/r/CollegeRant/comments/huwpov/tell_me_again_whats_the_point_of_life/fzfd4zy/", "text": "Sometimes you have to take a dagger to the chest to stay alive in this world. That's what sucks. But... you can use that money to support something you actually want to do. Buy a cheap apartment. Live in that, live like a poor person, save 50% of what you earn. Straight to savings it goes. If you can put 5000 into a ROTH IRA every year.  I put 1000 into it 3 years ago. In 20 years that simple 1000 grows to 27000 dollars. I hate it but even if you made 50,000 grand a year, you'd make 250,000 in savings in 10 years. Not bad. You can now use the interest here or there. But only the interest. Do that for another 10 to 15 and you're good. As soon as you get to wherever you want. You're long term goal (600K -900K) is made then you quit. No excuses. Just do what you want from that point forward. That's the rough draft anyway. You refine as time flies forward.   \n\n\nThe goal however is never to break a million. If you break a million you will get taxed into oblivion. Best keep it around 600K or more if you can and live off the interest. Remember life isn't about material possessions. It's about the experience.", "author": "ZenithCrests", "created": 1595872567, "upvotes": 1}, "fz6x6tk": {"link": "/r/CollegeRant/comments/huwpov/tell_me_again_whats_the_point_of_life/fz6x6tk/", "text": "Life has no point. We have prescribed that it is required to have a point. That being said, having a sense of progression or community is key to human existence being fulfilling.\n\nEven someone fairly robotic as me has friends. You are supposed to ask yourself big philosophical questions about your life while also staying grounded in why you are doing it. \n\nYou are stuck in a transitionary period in your life where you haven't actually realized what you want next. The constant of the human mind is suffering, because we will need to eat eventually and we will need to find out next goal eventually.\n\n Think big, but think grounded and one step at a time. You're only one person, and some of us are trying to change thr world too. You could sign up for undergraduate research experience, mix in some clubs (yes, especially if introverted since fuck parties), or maybe an internship.\n\nWant to change it with life-changing research? There's no guarantee that your work specifically changes the world. Each piece is a building block towards greater change, better methods, better products, and more research papers.\n\nWant to change the world in a radical way? Become a millionaire/billionaire and donate to your local community and in causes you believe in. Not everyone even gets a chance to go to school. Kids are at home bored out of their minds playing sticks OR walk a lot of miles to go to school because *life is boring*.\n\nWant to change world policy, become a politician. You might not make a difference at all, but at least you tried.\n\nWant people to remember you? That's just ego. Other people's opinions in the past, present, or future should not affect you positively or negatively. Just do something that matters, even if it is helping out someone with a better plan (in many cases, the \"no plan\" plan).\n\nTry to look at your life from the outside. Is my depression logical? Does it serves my higher goals? How do I handle it? Okay no higher goal. Need to at least survive. How do I survive?\n\nDepression is a strange cycle if NOT being in a proper mental state to get yourself out of a shit mental state. Best plan is physical exercise. Do pushups, lift weights, watch YouTube, get in shape. If you're afraid of stares, focus on improving. Your brain and body are NOT separate. Health is all health, and physical and mental have a lot of overlap.\n\nA dream is a fallible construct  Have many, and have many options. Best way is to simply rule out things you don't want to do. Google is a pretty cushy firm, but they sure as hell changed the world. Reevaluate faulty beliefs.\n\nYou seem to be concerned about being forgotten, so perhaps consult a campus psychologist or a therapist if you can. Perhaps there are some strange, err, childhood quirks that can be sorted out so that you are happier, healthier, and don't self-sabotage yourself. Plus, you literally can't self-sabotage, you'll just get C's and potentially lose scholarshio. Debt is NOT a good way to self-destruct. Not glorious, just slow and sad. Also another potential attention issue but hey, I'm not a therapist.\n\nDo some deep thinking about why you care so damn much about being remembered. The way you narrate it seems unhealthy. It sounds like a very unhealthy relationship of doing something grandiose and being remembered. The shrink \"describe your childhood\" trick works. Except it's not a trick, it's the fundamental of human programming. Your parents, school, social media, and other environment programmed you. What programmed you to want to be remembered? People who are remembered were creative, and craving attention makes you less creative.\n\nSo this is me trying to be helpful using logic, let me know if it was helpful, unhelpful, or unclear.", "author": "cudgeon_kurosaki", "created": 1595681239, "upvotes": 1}, "fz1jzza": {"link": "/r/CollegeRant/comments/huwpov/tell_me_again_whats_the_point_of_life/fz1jzza/", "text": "You shouldn’t be doing anything for other people, it should be for yourself. Drop the mindset of wanting to change the world because it will only ever make you feel like you’re not doing enough. \n\nMy main goals have nothing to do with whatever my career is going to be, but I know that my career will help me live and achieve my goals", "author": "damsus121", "created": 1595552934, "upvotes": 1}, "fytkzz2": {"link": "/r/CollegeRant/comments/huwpov/tell_me_again_whats_the_point_of_life/fytkzz2/", "text": "Honestly, just do what makes you happy. Only a handful of people will change the world and fewer will be remembered by history. Have you heard the story of ozymandias?", "author": "digbickjimmy69", "created": 1595376348, "upvotes": 1}, "fyq9an1": {"link": "/r/CollegeRant/comments/huwpov/tell_me_again_whats_the_point_of_life/fyq9an1/", "text": "Now you have to focus on yourself. Find something you love and do it...that’s where you’ll find happiness... you seem like type of person that can do anything.", "author": null, "created": 1595300828, "upvotes": 4}, "fyq1h9k": {"link": "/r/CollegeRant/comments/huwpov/tell_me_again_whats_the_point_of_life/fyq1h9k/", "text": "This may not amount to anything but here is my two cent. For now if you haven’t figured out what your dream, it’s okay. Life isn’t carved out by one path. My recommendation is to focus changing the world one small step at a time. Focus on what you can do currently for anyone or for a community.", "author": "Vicious201", "created": 1595296171, "upvotes": 8}, "fypscuj": {"link": "/r/CollegeRant/comments/huwpov/tell_me_again_whats_the_point_of_life/fypscuj/", "text": "I think you need to figure out how you want to save the world. I have gone back and forth with what I want to do. I’m 26 and I’ll be 27 when I graduate in the fall. I have felt for a long time that it took me too long to get here. I can’t knock myself for it! I finally figured out I want to be a counselor. I’m applying to grad school and that shit is scary. What if I’m not good enough? Take a breath, realize life isn’t going anywhere and figure it out. I believe in you dude! If I can figure it out (with time) so can you!\n\nEdit: I have struggled with anxiety and depression. I am on meds and am going back to counseling. I recommend to anyone to see a counselor. Good luck!!", "author": "ifnothingbecomes", "created": 1595290865, "upvotes": 9}}}