{
  "sid": "qlicgu",
  "link": "/r/CollegeRant/comments/qlicgu/how_i_learned_to_manage_my_time/",
  "title:": "How I Learned to Manage My Time!",
  "text": "Hi everyone, it feels like it took me a long time to figure out how to effectively manage my time in college. I wanted to share my experiences of pretty much burning out and then learning how to manage my time because it might help other people too.\n\nSome background: I used to be the type of person who would say yes to every new activity, club, or opportunity. I signed up for some many different things! I also had two part time jobs at one point, and then later I had three volunteer jobs. Anyways, I got really burned out and overwhelmed with everything, and it really affected my mental health. I barely had a social life and neglected my physical health too (not eating enough, not sleeping enough, not doing much exercise). Because I was focusing on so many different activities, I felt like I never had enough time and I was always stressed out.\n\nOne day I kind of realized that I was spending my time doing activities that I felt like I had to do (to improve my resume, because I made a commitment, or because I had been doing them for so long that it became part of my routine). I kind of took a step back and realized that I already had a great resume, I had fulfilled my time commitment by a long time, and I didn't have to continue to do so many activities.\n\nAt some point I also learned that there simply isn't enough time in the day for everything and I needed to figure out what were my priorities in life. I heard this quote, \"if everything is important then nothing is important\" which really stuck with me. I think figuring out my priorities was probably one of the most impactful things to help me with my time management. I left some of the jobs and activities, and tried to find balance in my daily life.\n\nI also learned that it was okay to say no to new opportunities and activities. I think it's great to get involved in new things, meet new people, and develop our resumes, but we can also say no when it's an opportunity that we are not that interested in or that we don't have time for. This is something that is a real struggle for me because I don't like disappointing others or missing out, but I think it's very important and necessary for managing time.\n\nAnyways, I hope this can be helpful for you if you're also struggling with time management! I also made a video about time management strategies if anyone is interested: [**https://youtu.be/QhQcaC6pjN4**](https://youtu.be/QhQcaC6pjN4)\n\nTL;DR learn to manage time to avoid stress by setting priorities and saying no to some activities",
  "author": "lindaedith",
  "created": 1635899089,
  "updated": 1636138004,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {}
}