{"sid": "ih40by", "link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/", "title:": "The way that entry-level math courses are taught is frustrating and disappointing", "text": "Every university-level math class I’ve taken (College Algebra, Physics, & Trig) has been taught with the teacher heavily relying on online programs like ALEKS. Other times they straight up copy the textbook readings, put it on a slide, and read it off to class during lecture without adding much else to spice it up. Math is a beautiful subject and deserves to be treated that way by those who teach it, especially if I’m paying  them hundreds of dollars to take a required math course! Don’t just feed me boring textbook passages, show me why I should care about math! Even if it’s lightly sprinkled throughout the course, learning about the history and philosophy of mathematical thought should be a required part of all math classes, ESPECIALLY entry-level ones.\n\nTL;DR college math is soulless", "author": "vernacorinne", "created": 1598465344, "retrieved": 1632950799, "over_18": false, "upvotes": 127, "upvote_ratio": 0.99, "comments": {"g8mn1vx": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g8mn1vx/", "text": "ALEKS is fine and all, I’ve learned a lot off it in these last few weeks. My main problem is the teachers do NOTHING TO HELP. All they do is sit there and tell you to do the assignment. I miss my high school math teacher.", "author": "Avek01", "created": 1602536338, "upvotes": 2}, "g31dh0c": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g31dh0c/", "text": "this was one of my biggest struggles on my first attempt at college. \n\nThe class i was put in was actually a bunch of smaller classes thrown together in a computer lab with a librarian proctoring- someone who didn't actually know the subject matter and was just there to handle technical problems and make sure we weren't cheating. My advisor didn't get why I \"couldn't pass a simple math class\" even though i had documented learning disorders and had reached out about not being able to learn in that environment.", "author": "bootylikepoww", "created": 1598546396, "upvotes": 3}, "g2zxvnc": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g2zxvnc/", "text": "I feel for you. I’m from the generation when online course management systems were new and my homework’s were all still submitted on paper and graded. Automatic homework systems are a horrible idea - good for economic efficiency and time savings for instructors overloaded with large classes, bad for learning.", "author": null, "created": 1598510256, "upvotes": 3}, "g2zlaej": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g2zlaej/", "text": "Agreed.", "author": "Ohhiitsmeyagirl", "created": 1598500791, "upvotes": 2}, "g2z4dos": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g2z4dos/", "text": "You know for Calc 1 I had a teacher that did an amazing job and I loved doing math with her, she also made sure to help solidify the basics like better ways to move equations around or heck even nitpicking that I should keep my equal sign in the right place so it's easier to go over my math when looking back or having others look at it. Unfortunately I botched the first test and ended up getting just low enough that I withdrew a week before finals so my grade was a W instead of an F and I couldn't take her again because she hasn't been giving classes for Calc 1 the next semester so I took it with a teacher who had a similar teaching style but she was more mellow and didn't point out the good stuff that really helped and to be honest just the lack of energy/positivity she had for it made a huge change but I knew all the stuff so I passed the class (she's a good teacher and lots of people prefer her because of her being more mellow and let's you use a cheat sheet and doesn't expect as much from you, which only hurts you in later classes) but now I can't find classes taught by the first teacher anymore and I'll be switching to metro after this semester so idk if I'll be able to take classes with her anymore which sucks because she made it easier to stay engaged and study and all that stuff. I may have gotten off track but point is if you find a good teacher appreciate them and try to stick with them but they are rare.", "author": "Pacman042", "created": 1598491067, "upvotes": 3}, "g2z07rf": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g2z07rf/", "text": "My school relies on ALEKS and it's worthless garbage. The textbooks aren't written well either. I actually went behind the professor's back and bought a better textbook on Amazon that has better visuals and examples. Honestly, I think they just want you to fail...", "author": "NoChannel1", "created": 1598488837, "upvotes": 3}, "g2yx9v5": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g2yx9v5/", "text": "All I have to say is fuck ALEKS", "author": "logan-8787", "created": 1598487292, "upvotes": 6}, "g2yn328": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g2yn328/", "text": "Piggybacking off of that, I feel like honors math in high school is as soulless and gives off the “you’re taking an honors math class therefore you should remember everything from previous years.” Math could be way more fun if it was taught better.", "author": "cynical_root24", "created": 1598481864, "upvotes": 7}, "g2ya2h7": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g2ya2h7/", "text": "The reality is that the foundation for all of these courses take so much more than just a two or three month semester. It takes years to build a solid mathematical foundation and if you don't have it, you will struggle in those courses regardless of what online tools you have. \n\nI highly recommend that if you are taking these courses for the first time you got the syllabus in advance and then review material before the course even starts so you don't fall behind quickly.", "author": "awesomeguy123123123", "created": 1598475537, "upvotes": 7}, "g2xz0or": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g2xz0or/", "text": "Imagine paying per credit and paying 5000$ to take an online Math Course on ALEKS.", "author": "DetectiveTacoX", "created": 1598470517, "upvotes": 40}, "g2xtb81": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g2xtb81/", "text": "He's never been in a college math class, cool stick him into quantitative statistics....", "author": "ComputeBeepBeep", "created": 1598467903, "upvotes": 12}, "g2xnn8y": {"link": "/r/CollegeRant/comments/ih40by/the_way_that_entrylevel_math_courses_are_taught/g2xnn8y/", "text": "Sorry if this doesn’t help but my higher level quantum physics, thermodynamics and calculus courses are literally the same. \n\nSeems to be inescapable", "author": "goatboat_", "created": 1598465412, "upvotes": 13}}}