{
  "sid": "q0wf69",
  "link": "/r/CollegeRant/comments/q0wf69/does_it_get_better_after_graduation/",
  "title:": "Does it get better after graduation?",
  "text": "College student here (Senior), I'm getting closer to graduation (Hopefully next year), and my mental health has really been shot. Especially since transferring to a new college during the pandemic with no friends. I still have no idea how I made it this far. I also have really bad anxiety, especially over my grades because I keep feeling like a failure whenever I get a B or lower than a 90%. I feel lifeless during Zoom classes, and it feels so fake. Especially after my mother's lies about how the expectations are that you will meet your best friends forever in college.\n\nI've been on this hamster wheel ever since Fall of 2017 (Without even a gap year after high school. Just Summer break, then booted to Community College). I'm just tired of everything, especially how powerless I feel (Controlling parents doesn't help either). That my perfectionism has been trying to chew my head off because I got a 13/15 on a stupid paper. I've been promising myself that after I graduate, I'll take a long nap and just rest for once before I think about getting a job. For those who did graduate, did it get better? Did your mental health finally improve after graduation and no longer thinking about grades, papers, exams?",
  "author": "ThisisUnicorn996",
  "created": 1633314494,
  "updated": 1634093888,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.92,
  "comments": {
    "hfbghhd": {
      "link": "/r/CollegeRant/comments/q0wf69/does_it_get_better_after_graduation/hfbghhd/",
      "text": "Since I graduated a few months ago, I would now look back at those college years and go:\n\n“Man, I didn’t learn jack sh*t and no one stood by my side except my family.”\n\nBut! I’m happy it’s over, and yes you will feel better when you graduate, since it’ll finally be just you and the real world. I also had no friends in college, especially at the midway point, but I have online friends outside of college that are a lot better and have kept me company over the years. If you actually study and get a grade less than what you thought you’d get, simply acknowledge that you did make the effort and move on to the next thing. College is the embodiment of bullshit so don’t be surprised if things don’t happen like you think it will. Also exercise helps for mental stress too.)",
      "author": "VeilOfTheZealot",
      "created": 1633324005,
      "upvotes": 9,
      "replies": {}
    },
    "hfb4306": {
      "link": "/r/CollegeRant/comments/q0wf69/does_it_get_better_after_graduation/hfb4306/",
      "text": "Omg I could have written this myself, I totally hear you! I also started college in 2017 and transferred to a 4 year from a CC (last fall) and spent a whole year plus last summer semester in online classes due to covid. I honestly don't know how I made it this far either and I'm feeling the most burnt out I ever have, I just can't bring myself to care anymore and I'm also sick of my major and hate my classes. Since the pandemic, it seems like nothing even matters anymore. Only thing keeping me going is that this is my last semester so I'll (hopefully) be graduating in December. Unfortunately this is probably the busiest semester i've had. I have a required internship, senior thesis, plus three other classes left for my major and first time back in in-person classes since March 2020. It's been tough for me too so far. I get A's and B's so I know from experience perfectionism makes it really hard to do your assignments, I have just been trying to tell myself lately just do the bare  minimum and at least turn it in and get some points for it. I'm planning on taking a major break after all this, hopefully I will see some improvement in my mental health and I can find out what I really want in life without all the college bullshit in the way. The problem for me right now is just reaching the end of it.",
      "author": "Extra-Ad-3043",
      "created": 1633316695,
      "upvotes": 4,
      "replies": {}
    },
    "hfd3hbs": {
      "link": "/r/CollegeRant/comments/q0wf69/does_it_get_better_after_graduation/hfd3hbs/",
      "text": "I'm a senior too that went straight to my four year after hs with very controlling parents and my own extra high expectations due to my anxiety. I had a complete breakdown over a B- on a paper I expected to do well on on top of other huge failings. I'm so burn out and running on fumes. I completely sympathize. I don't even know how I'll last for the rest of the year. I just wish that I can survive so I can graduate and take a break. And not feel guilty for not taking a break",
      "author": "peaachlyy",
      "created": 1633363048,
      "upvotes": 2,
      "replies": {}
    }
  }
}