{
  "sid": "pz7mt9",
  "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/",
  "title:": "Ungraded “homework” completion mandatory to unlock the weekly exam, are you kidding me???",
  "text": "Taking an online algebra class and I’ve about had it with this bs. First we must watch the recorded lessons entirely, which move at a painful snails pace to unlock the lesson quiz, then after watching all of the 6-8 lessons and taking the quizzes for the week we must complete a 20-30 problem workbook with a passing score to unlock the weekly exam. This would be fine if I received a grade for the workbook, but nooooo it’s outlined in the syllabus that the workbook is ungraded and therefore optional. How the f**k is it optional when I have to complete it to even open the exam for the week worth 50% of my final grade?? This workbook depending the unit takes a significant amount of time to complete, and I really don’t appreciate being forced into doing work that I receive no credit for in a class I’m paying for…. Seriously it’s worse than the bs we all dealt with in high school, at least there we received grades for completed homework. Is this normal for an online math class or is my professor just an extra special ass?",
  "author": "LissaLee26",
  "created": 1633093664,
  "updated": 1634093903,
  "over_18": false,
  "upvotes": 74,
  "upvote_ratio": 0.87,
  "comments": {
    "hezvfjk": {
      "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hezvfjk/",
      "text": "I’m guessing that your algebra course is four credits, so you should be spending 4 hours a week watching lectures and reviewing weekly instructions. Also, spending 2-3 hours per credit every week studying and doing homework is recommended. I took College Algebra online during the summer-20 semester, which worked out great because it was an 8-week course instead of a 16-week course.",
      "author": "Mindless-Theme-7266",
      "created": 1633108199,
      "upvotes": 12,
      "replies": {
        "hezyma4": {
          "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hezyma4/",
          "text": "It is a 3 credit 8 week course and it definitely takes all the recommended time and then some just to get through everything I have to do.",
          "author": "LissaLee26",
          "created": 1633109586,
          "upvotes": 6,
          "replies": {
            "hf01n45": {
              "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hf01n45/",
              "text": "I get your frustration. I've taken many courses that didn't correspond to the syllabus.",
              "author": "Mindless-Theme-7266",
              "created": 1633110897,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hez8yhs": {
      "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hez8yhs/",
      "text": "Because enough students in the past didn’t do the practice, bombed the exam, and took it out on the professor, most likely. Or, this was mandated by the department, and instructors of the course have no choice but to use this method.\n\nNot everything you should or will have to do will be graded or rewarded, and by extension, doing the practice should lead to a better score on the exam for the folks who need it.\n\nIf it really bothers you that much to be asked to do 20-30 problems to unlock an exam and to not get any points for it, are you able to just answer them all wrong just to mark it completed?",
      "author": "PhDapper",
      "created": 1633098491,
      "upvotes": 59,
      "replies": {
        "hezyy44": {
          "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hezyy44/",
          "text": "No, we have to receive a passing score of at least 70% on the workbook to unlock the exam. Your reasoning makes sense, not an less frustrating but at least understandable.",
          "author": "LissaLee26",
          "created": 1633109729,
          "upvotes": 17,
          "replies": {
            "hf044rr": {
              "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hf044rr/",
              "text": "There could also be other confounding issues like some accrediting bodies require that the learning outcomes be measured outside of tests and quizzes.  It means we have to assign more work (that even we don't think is useful) just to tick a box for the organization.  \n\nI promise though, every assignment in every course is there for a reason.  Your professors have to spend time to make, program, grade, and review these.  We don't do it for fun and we aren't going to make more work for ourselves just to make you miserable.  \n\nAlso, the best way to learn math is to do math, the only side effect of this method is that you should get a higher grade.  It sucks, as it’s a lot of work, but it really will help.",
              "author": "DrBearFloofs",
              "created": 1633111984,
              "upvotes": 15,
              "replies": {}
            }
          }
        }
      }
    },
    "hez1kxs": {
      "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hez1kxs/",
      "text": "They’re just really crappy",
      "author": "TheMtndewdude",
      "created": 1633095054,
      "upvotes": 2,
      "replies": {}
    },
    "hf9ccxh": {
      "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hf9ccxh/",
      "text": "No, this type of frustration is par for the course online. Attempts at \"digital hand-holding\" like these are designed to (supposedly) help lower-performing students, but they're just seen as frustrating to students who already know the material and would like to simply prove it in less time, keeping them slowed down and held back. \n\nColleges are notorious for disrespecting students' time, as if time is something we can and should just give away to them for free. As a working mom, I wholeheartedly disagree with that and feel disrespected by that attitude. If a person already knows the material well enough to prove it by test or demonstration, let them. To do anything else is to intentionally hold that person back, disrespecting their family, career, and personal time.\n\nAnyway, if you already know the material from previous schooling or are well self-taught, consider testing out of classes like this (such as by taking a CLEP exam) if you can. Otherwise, prepare to have people repeatedly waste your time with no regard or consideration for how it affects you.",
      "author": "such-a-zero",
      "created": 1633287912,
      "upvotes": 1,
      "replies": {
        "hfbtkv7": {
          "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hfbtkv7/",
          "text": "None of what you say is a professors problem. Your mastery of the subject is.",
          "author": "snoboy8999",
          "created": 1633334571,
          "upvotes": 2,
          "replies": {
            "hfcq1pg": {
              "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hfcq1pg/",
              "text": "That statement does not conflict with anything I've already written. Refer to sentence 2 (addresses the fact that this digital hand-holding is an attempt to help lower performing students master the subject material). Nowhere did I say that it isn't within a professor's right to be an asshole and hold faster students back, I simply said to test out of the class with a CLEP exam if possible (refer to paragraph 3). Given that I was replying to a student here and not a professor, clearly I'm trying to empathize with and address things that are the **student's problem** (clearly their time is valuable to them). You're just making a lazy attempt at snark here, you're not actually addressing any concerns brought up by the OP. \n\nThis sub is literally called \"CollegeRant\", I don't know what you hope to gain by coming here and NOT offering students empathy or solutions (while lazily attempting to discourage others from doing so.)",
              "author": "such-a-zero",
              "created": 1633357184,
              "upvotes": 0,
              "replies": {
                "hfe5fqi": {
                  "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hfe5fqi/",
                  "text": "Very well-put 👏🏻",
                  "author": "Izzetinefis",
                  "created": 1633377253,
                  "upvotes": 1,
                  "replies": {}
                },
                "hfe6kxc": {
                  "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hfe6kxc/",
                  "text": "Also, can’t professors just initially require students to solve, say 10 questions at 80% accuracy, and then require those who miss the mark to keep completing questions until they eventually also reach 80%?",
                  "author": "Izzetinefis",
                  "created": 1633377664,
                  "upvotes": 1,
                  "replies": {}
                },
                "hfl3rt2": {
                  "link": "/r/CollegeRant/comments/pz7mt9/ungraded_homework_completion_mandatory_to_unlock/hfl3rt2/",
                  "text": "I don’t need to offer you anything except maybe a strong mood stabilizer. 😂",
                  "author": "snoboy8999",
                  "created": 1633513809,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}