{"sid": "nwcm5k", "link": "/r/CollegeRant/comments/nwcm5k/what_conditions_can_a_university_subject_you_to/", "title:": "What conditions can a university subject you to while taking a test?", "text": "I have several complaints about how the testing center is at my university. The desks used are elementary school sized. I am slightly overweight and my leg is larger than the space provided. Then it's too hot in the room. I snuck in a thermometer to test the temperature and humidity. You'll never guess what the temperature was, 83 degrees and 75 percent humidity. This is in Idaho. It's not even 83 outside. \n\nIs this bull crap?", "author": "Upbeat-Ad-5678", "created": 1623291393, "retrieved": 1632842250, "over_18": false, "upvotes": 9, "upvote_ratio": 0.86, "comments": {"h18dvmw": {"link": "/r/CollegeRant/comments/nwcm5k/what_conditions_can_a_university_subject_you_to/h18dvmw/", "text": "Thank you u/Upbeat-Ad-5678 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1623291394, "upvotes": 1}, "h1a5bna": {"link": "/r/CollegeRant/comments/nwcm5k/what_conditions_can_a_university_subject_you_to/h1a5bna/", "text": "It sounds very uncomfortable, but unless it’s unsafe or causing undue stress during exams, there really isn’t anything to be done. Hopefully, the people directing the center are pushing for more money from the budget, but given how terrible funding has been for public higher ed, upgrades are unlikely unless they’re deemed necessary. :(", "author": "PhDapper", "created": 1623334208, "upvotes": 3}, "h18p7tc": {"link": "/r/CollegeRant/comments/nwcm5k/what_conditions_can_a_university_subject_you_to/h18p7tc/", "text": "Sounds like they don't know how to budget.", "author": "drowned_anus", "created": 1623297401, "upvotes": 8}}}