{"sid": "p3j5m1", "link": "/r/CollegeRant/comments/p3j5m1/i_wish_i_chose_a_different_college_to_attend/", "title:": "I wish I chose a different college to attend", "text": "I'm going to a local community college close to where I live so for the sake of privacy I won't name any of the colleges.\n\nThe CC I go to is absolute shit. We're doing everything online, which sucks, but I can understand why due to the current conditions. What I am mad about however is the fact that they basically made themselves less available to people who were unfortunate enough to not know what the fuck was going on.\n\nFor context, their in-person offices were closed, so when I say everything is online I really mean everything is online and the campus is basically still down.\n\nI had some issues with trying to apply to a language arts class and a writing class. Turns out I kept trying to apply to the wrong ones, but at the same time, no one told me how to navigate it. It was never in the orientation or the instructional video - they just told you to apply to classes with \"Q\" which, as an incoming freshman makes no sense. \n\nThe college website was confusing as hell to navigate and I ended up emailing the English counselor instead of the general outreach counselors because I was so confused and didn't know they even existed until I straight up asked my cousin who went to my CC a few years ago what is happening, which my cousin responded they didn't know because my CC apparently changed the GenEd requirements this year. Apparently the general outreach counselors were talked about in a different website separate to the list of counselors page. \n\nEmailing them only led them to say that they cannot help me via email. Because of the influx of students contacting for help, they couldn't do appointments and we had to just drop-ins during a 3 hour time span of 4 days and hope today's not a busy day, which took about a week of waiting before I was finally able to get a spot. By the time that happened, all but one class was full and apparently that professor is reported to make students feel like absolute shit and stupid for their writing. (I did contact another professor to be put on a waitlist for his class, and hoping the amount of work he expects from students puts some off to drop out). \n\nI feel like if they just had planned appointments instead of drop ins, or their stupid website actually organized their pages, or if they didn't even rely on their website and had a more convenient way to access support, or I don't know, actually teach us how to schedule classes before giving us a bunch of letters and numbers none of us have seen before in our lives. You'll think after a year of online learning they'll know what to do by now but either I'm just really dumb and bitching about things I could have prevented if I just thought through it, or my CC just didn't care to change anything to make things easier for us\n\nThere was another CC I wanted to go, but couldn't because I felt too unprepared to move 5 hours away from my home. (Still don't know how bills work hahahha.... I'm fucked-) It had good reviews, a program that relates to the major I want to get into (plus the major I want and a variety of majors I can see myself taking. My college doesn't even have environmental studies which is what I was originally going for, closest thing I can get to that is biology), free admission to several in-state hard-to-get-into universities as long as you meet enough requirements, and apparently keeps sending emails about events and surveys about what students would like to see be implemented or changed. If it wasn't for fucking location I would have been able to go there and not have to go through the BS of a CC that doesn't even have environmental studies.", "author": "Monthly_Vent", "created": 1628842302, "retrieved": 1632949114, "over_18": false, "upvotes": 9, "upvote_ratio": 1.0, "comments": {"h8v8mye": {"link": "/r/CollegeRant/comments/p3j5m1/i_wish_i_chose_a_different_college_to_attend/h8v8mye/", "text": "Never mind about online classes, check out this sub and your college life will be joyful. r/Essay_Writers_Hub", "author": "EssayWritersHub", "created": 1628910184, "upvotes": -1}}}