{
  "sid": "psyvwm",
  "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/",
  "title:": "first generation guilt",
  "text": "do any first gen kids of immigrants feel any guilt for getting into college? both my parents didn’t go to a four year university but my dad dropped out of UH because he went broke. i feel so guilty that my college is paid for when he could’ve used that money to finish his degree.\n\ndon’t get me wrong, i am more than ecstatic to get into my first choice school. not to mention that i get the biggest privilege of having it paid for and having my main focus on my studies. i know i earned my spot at this school and i am proud of myself.\n\nthe thing is, my dad worked harder than i ever will in my entire life. i mean, when i told him i got in he was at work covered in oil (he’s a mechanic). and seeing him cry from my accomplishments made me cry, but that was because he made it possible for me. \n\nin all honesty though i just feel snobby. and guilty for feeling guilty. like my dad works 7 days a week 9-5 just so i can move 1,000 miles away to chase my dreams. while he still has to work his ass off for another 2 years. i literally asked him how long he’s been saving up for me and he said once he found out my mom was pregnant. i cried on the spot\n\nall in all, grateful is an understatement, i am more than thankful. i deserve the spot at my university because i worked hard but i feel guilty that my dad worked harder.",
  "author": "gbcmaile",
  "created": 1632281028,
  "over_18": false,
  "upvotes": 75,
  "upvote_ratio": 0.96,
  "comments": {
    "hdwpzcj": {
      "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdwpzcj/",
      "text": "I dont have experience with this type of thing but i do know that had my parents been your parents, they would have done the exact same thing. You getting your degree will give your dad way more happiness than him finishing his own degree. One day when youre successful, help your dad go back to school or help him in some other way",
      "author": "taybay462",
      "created": 1632358561,
      "upvotes": 1,
      "replies": {}
    },
    "hdv73im": {
      "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdv73im/",
      "text": "I am so touched by this, I am crying right now.",
      "author": "ThereIsNo14thStreet",
      "created": 1632330671,
      "upvotes": 2,
      "replies": {
        "hdw7qex": {
          "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdw7qex/",
          "text": "don’t cry don’t cry don’t cry don’t cry",
          "author": "gbcmaile",
          "created": 1632350004,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdtjig5": {
      "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdtjig5/",
      "text": "[deleted]",
      "author": null,
      "created": 1632297041,
      "upvotes": 5,
      "replies": {
        "hdw7o1z": {
          "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdw7o1z/",
          "text": "it looks like we’re almost on the same page here! i have a lot cousins who made bad decisions on my moms side (not pregnancy but like drugs and alcohol etc) and they’ve literally blatantly told me that i think i’m better than everyone just because i’m going to higher education \n\nlike girl excuse me- you had your opportunity. we were both given more than enough to fulfill our goals i just so happened to use it to my fullest potential and they didn’t. \n\nand i totally feel you on how rare it is in my family to go to college. the highest anyone has gotten in my family is an associates degree or certificate. i’m just really happy i get to be the first one and make my parents proud",
          "author": "gbcmaile",
          "created": 1632349976,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdtc9f3": {
      "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdtc9f3/",
      "text": "As a mom, this is all we hope for. I’m almost 32 going back to college to hope I can make enough money that I can put away savings for my kids to do so much more. \n\nAs parents all we want is to see our children have less of a struggle than we had. To see them blossom and flourish. In your eyes he may have “missed out” but I’d be willing to bet every ounce of work he’s ever put in was to see you do good and he’s just thrilled! Don’t stress it!",
      "author": "LandlockedManatee",
      "created": 1632290858,
      "upvotes": 3,
      "replies": {}
    },
    "hdtas96": {
      "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdtas96/",
      "text": "The goal of every good parent is to set up their kids to have a better life than they did. Your parents have been striving towards that goal since before you were born. \n\nYou shouldn't feel guilty for availing yourself of the opportunity they're providing you. You should only feel guilty if you squander it needlessly. Go on, work hard, do well, and make your parents proud. That's a far greater gift that you could give them than the monetary value of the money spent on your tuition.",
      "author": "BarackTrudeau",
      "created": 1632289755,
      "upvotes": 4,
      "replies": {}
    },
    "hdt0nmf": {
      "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdt0nmf/",
      "text": "I'm a dad and I would much rather my son pursue his dreams over me pursuing mine. I had my chance, he's young and has his whole life ahead of him. He's only 3, but I can't imagine feeling any different about this when he's 18. I'm also saving for his future, but I'm not the kind of parent that will force him to go to college, just so long as he has a plan. If he wants to be a plumber and he's passionate about it, fine, go be an apprentice and do it. If he wants to be a doctor and go through a decade of school, also fine. I'll support him either way.\n\nI suspect your parents feel similarly about you. They're just happy you have opportunities that they didn't get. Every parent wants their kids to have a better life than they do. If your dad works 7 days a week, he's going to be thrilled at the end of your senior year when you tell him you have a good paying job with a salary that is 9-5 and M-F.",
      "author": "TheJaycobA",
      "created": 1632283055,
      "upvotes": 12,
      "replies": {
        "hdt16wa": {
          "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdt16wa/",
          "text": "i spoke about this with my guidance counselor today and she told me her POV from a parent and both had similar answers. parents just have this amazing quality where they will do anything possible for their kid to have opportunities that they didn’t. parents like you make me so happy",
          "author": "gbcmaile",
          "created": 1632283373,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hdsy0k7": {
      "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdsy0k7/",
      "text": "from what i can tell your father is beyond proud of you! as a first gen i completely understand this guilt and the only thing that keeps the guilt from overpowering me is to know that when i make it, i’ll pay them back for every sacrifice they made for me. whether that’s money for medical expenses, vacations, whatever it is i can do to show my gratitude.",
      "author": "Objective_Ring9961",
      "created": 1632281555,
      "upvotes": 26,
      "replies": {
        "hdt0wix": {
          "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdt0wix/",
          "text": "totally feel you. i cant wait to give my dad an MG midget he had to sell when we lost our house. what are you pursuing?",
          "author": "gbcmaile",
          "created": 1632283201,
          "upvotes": 6,
          "replies": {
            "hdvov83": {
              "link": "/r/CollegeRant/comments/psyvwm/first_generation_guilt/hdvov83/",
              "text": "i want to be a physician! hopefully OBGYN but things could change as time goes on and i experience different things. definitely the medical field though",
              "author": "Objective_Ring9961",
              "created": 1632337844,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062577
}