{"sid": "hquin8", "link": "/r/CollegeRant/comments/hquin8/lost_motivation_and_feel_like_i_wasted_money_this/", "title:": "Lost motivation and feel like I wasted money this semester.", "text": "So when schools got canceled and had to go online, I lost motivation for this and didn't intend on doing summer classes, and then my dad pressured me to do summer classes, which I had almost little-to-no motivation and I paid for this semester. So I am pissed off that I basically didn't do well and shell-out some money for nothing. And they're going to be mad that they wasted \"their\" money, when in fact I paid for the classes, so it's gonna be a lot of back and forth problems.", "author": "aspiringwanderer03", "created": 1594699371, "retrieved": 1632951631, "over_18": false, "upvotes": 31, "upvote_ratio": 0.96, "comments": {"fy3wfpm": {"link": "/r/CollegeRant/comments/hquin8/lost_motivation_and_feel_like_i_wasted_money_this/fy3wfpm/", "text": "Hey, don’t worry. There’s still time to do well. There’s still next semester. Seriously, don’t dwell on it. It’ll pass and you won’t even think about in a couple of years. \n\nI remember when I was in second year of undergrad, I got an A (yeah, an A) in the first part of organic chem and I thought that was the end of the line for me because all of the other pre-meds got A+’s. I thought I’d never get into medical school and that I’d amount to nothing. I swear to god I thought about committing suicide (yeah, I needed to chill). Well, I retook the course and got that A+ and today, I’m happy to say that I’m an MS1 (first-year med student). Suffice it to say, I don’t think about that little failure of mine anymore. I learned from it and moved on.", "author": "a-streetcar-desire", "created": 1594783200, "upvotes": 4}, "fy2qkyr": {"link": "/r/CollegeRant/comments/hquin8/lost_motivation_and_feel_like_i_wasted_money_this/fy2qkyr/", "text": "Oof, that just sucks. It’s such a messed up situation for schools & students & the world is literally f$cked up right now. As a parent & as a former college student, I feel horrible for you.\n\nMy suggestion is to yank the band aide off - but have A PLAN. Figure out how to get your degree & move on; especially if you’re the one mainly footing the bill. \n\nI had 4 years to get a bachelors-after that, no more money. My step father was an asshole & when I failed one of my classes I dreaded having to tell my parents. But I went to them with my tail between my legs, told them the truth & that I had learned my lesson - blah blah. \n\nMy stepfather raged, yelled, acted like I had just murdered someone & now the entire family was going to jail. I let him scream, and in my head said eff you effer. I told them my plan to make up the class the following semester & to pay for it myself.\n\nI learned what my weaknesses were, that I had to knuckle down for a few weeks & was more motivated to get it done & on my own. \n\nPlease know you are normal, you are not alone in feeling unmotivated, you are a good person, and you can do this.", "author": "Karenena", "created": 1594759874, "upvotes": 9}}}