{"sid": "lzpmp7", "link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/", "title:": "Is it normal for students to not... \"think\" in group assignments?", "text": "I find myself time and time again in situations where people will do something and just not question the results. I end up having to \"assign\" tasks to my own team mates because if I don't, nothing will get done, and when someone actually *does* do something, it's like they're a robot executing a task with no thought. I have to question them, point out what doesn't make sense, and then think further for them, like I'm their manager/teacher/supervisor. I *do not* like this. I like to discuss results equally, like if I do something, I want people to ask questions if they don't understand why I did something, point out when my reasoning is flawed, because I do not know everything I am doing.\n\nFor example, I have to do a group master's thesis right now (sucks, really sucks) using raw data we have to extract meaning from and build a predictive model. Obviously, it takes a lot to actually understand the data and I myself am continuously noticing new things. But when something obviously doesn't add up, they don't even try to think further than the surface layer of \"filter on this and then clock out\".\n\nIs this normal? Like is everyone acting like this and I'm just overdoing things? I just don't understand. Every person I've been in an assignment is like this. Do I just have bad luck?\n\nThis is a master's thesis, we shouldn't have to wait for our supervisor to tell us exactly what to do. Like there's no curiosity whatsoever beyond them doing as told when we're supposed to do the thinking! My supervisors get so exasperated and I feel for them, because this doesn't seem acceptable at all.\n\nAnd we aren't in the US, so there's no concept of \"getting into grad school\". We graduated from a bachelor and just signed on for a master's degree that is accessible with our bachelor, don't have to prove anything.\n\n&#x200B;\n\ntldr; Find myself working with people who don't question anything they do or are told to do when it's obviously wrong, wondering if this is normal or I just have a huge trail of misfortune in partners.", "author": "gilgameshen", "created": 1615119685, "retrieved": 1632950585, "over_18": false, "upvotes": 162, "upvote_ratio": 0.99, "comments": {"gq640fv": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq640fv/", "text": "So, you're the Jeff Winger of your study group; the natural leader. Get ready for a whole life of situations like this; it's much better if you realize and accept it now and learn how to lead right. Maybe take a leadership course?", "author": "hoorparkraat", "created": 1615171320, "upvotes": 1}, "gq5y4ow": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq5y4ow/", "text": "It’s pretty simple some people are born leaders or gain that skill in their life before college and some are people that think they need to be told what to do. Unfortunately the latter are the majority in college nowadays", "author": "nemo1261", "created": 1615168044, "upvotes": 1}, "gq58381": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq58381/", "text": "The only time I'm actually motivated is when I'm doing a one person assignment, or I'm actually interested in the class.", "author": "Mkg102216", "created": 1615154504, "upvotes": 1}, "gq51azo": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq51azo/", "text": "I feel this quite heavily. It discourages me from even trying because I basically brace for disappointment and sometimes it makes me seem closed off because I become self-conscious of my hungry curiosity.", "author": "050692", "created": 1615151646, "upvotes": 1}, "gq4hpr5": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq4hpr5/", "text": "I've never got an A on a group project (except for one that was like really easy) for this exact reason. I feel like I have to monitor everything but I just do not have the time. When the due date comes i just proofread everything is there and make sure my part is perfect. Ofcourse this won't get us an A because I'm not really changing any information or stuff that don't make sense - but for the sake of my mental health i can't deal with all the classmates who do not want to think. Maybe it because of COVID, but everytime there is a group for ANYTHING I dread it so much because literally no one thinks and even forget class material exists to help us.", "author": null, "created": 1615143508, "upvotes": 3}, "gq4fel8": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq4fel8/", "text": "Not to be the pessimist, but my experience in the working world was similar. I had a career for 15 years, and quit to go back to school full time to persue a different field. Many of the folks that worked I around had the same 'don't care', 'clock in clock out' attitude. Fortunately, the few that did think, care, and showed leadership potential were moved into positions with more responsibility (and more $$$). \n\nWhile it doesn't get 100% better after college, it does get a lot better.", "author": "white_rabbit85", "created": 1615142564, "upvotes": 1}, "gq4b8hx": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq4b8hx/", "text": "I personally don't care if my group mates contribute at all, and I actively seek out the leadership role in group projects. I don't like relying on someone else for my grade. I do involved them as much as they would like to be involved, but I tend to control the bulk of the decision making and the final submission.\n\nThis might be because I'm in my 30's and I've been the only contributor in countless group projects, but it doesn't even bother me anymore if they mooch off my work and get a good grade.", "author": "TheGreigh", "created": 1615140887, "upvotes": 6}, "gq46ws4": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq46ws4/", "text": "Super common, outstandingly common even...and it sucks, doesn't it? \n\nI remember being in a similar scenario and the lack of care people gave was shocking, I knew from the moment the group was assigned, a group of 5 actually depended on the actions of myself and another chap \n\nThis is crappy because it basically means that in my friend's actions and mine,  we're determining the grades of those who do not contribute \n\nYou go to the teacher in charge an tell them, but they tell you to take care of yourself and stuff will be done about the others\n\nBut of course, the mark is for the group and not individual \n\nIt's a huge issue in universities, I can empathise with those who are unconfident and want to learn but for those who do not care and come across as apathetic...what can I say \n\nSo in short, I'd say it's common! \n\nMy advice on top of all that, take evidence all along the way of what you do and be specific about it, though this may not help as much as we'd hope, i think it's at least something to say 'my group is not pulling their weight'", "author": "PutSimply1", "created": 1615139113, "upvotes": 4}, "gq40c7z": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq40c7z/", "text": "I feel you....I just have an oral presentation project and they selected me as the leader.  More than a leader I feel like a teacher/professor assigning task, sections, what to say, how to say it....it's frustating.", "author": "curlymarketer", "created": 1615135824, "upvotes": 8}, "gq3tdmb": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq3tdmb/", "text": "This is considered [social loafing](https://www.google.com/search?q=social+loafing&rlz=1CDGOYI_enUS825US825&oq=social+loa&aqs=chrome.0.0i433j0l2j69i57j0l2.2523j1j4&hl=en-US&sourceid=chrome-mobile&ie=UTF-8), and it usually happens when one student unconsciously takes on the responsibility of being the productive one. It really sucks, and I’ve definitely been there. I hope they get their act together eventually, and **you** get a good grade! Worst case, you speak to the prof about it. ):", "author": "Ambitious-Sun", "created": 1615132228, "upvotes": 43}, "gq3jy23": {"link": "/r/CollegeRant/comments/lzpmp7/is_it_normal_for_students_to_not_think_in_group/gq3jy23/", "text": "I’m doing my senior project in the US and it’s exactly the same shit. The project would be so easy if everyone took their time to figure it out in their own way and then discuss our findings, but no one wants to engage the content in their own way and our group meetings just turns into me explaining what I discovered while they sit there cluelessly. If I werent in the group I highly doubt things would go anywhere.", "author": "Safety_Rock", "created": 1615126692, "upvotes": 60}}}