{"sid": "pjw9ws", "link": "/r/CollegeRant/comments/pjw9ws/major_decision_need_help/", "title:": "“Major” Decision (Need Help)", "text": "\nI’m attending my first semester at a university after transferring from a community college I’ve studied for 3 years. My current major is marketing, but I’m thinking of changing my major into another one like sociology or hospitality because dealing with business may not be for me. During community college, I was always a general major because I never knew what career path I should take. I chose marketing because it will include the basics I need to learn about business as well as being innovative in my future job. Also my asian parents (only mom because my dad passed away) wanted me to get a degree that is worth my future (job, money, education etc.). Even though the classes of marketing/business helped me learn more; I don’t know if the business industry would be my number one passion. \n\nI had my first talk with my new advisor, and he recommended me to talk with a sociology professional on my campus because he’s afraid that changing majors would be hard for me and require more time at the university in order to get my bachelor’s. Personally, I just don’t want to waste time to be on campus taking classes I don’t like, and regretting my major decision making. My sister had changed her major and she had issues deciding as well. \n\nI don’t have any future goals after I graduate from the university; I have ideas, but they’re not set nor realistic. I just don’t feel motivated in where I am right now and I don’t know what to do next. Even though I need to struggle in the college life to learn my lessons, I’m just scared of further consequences in making my decisions moving foward. \n\nIf you guys can, please give me some advice so that I can have an idea of what to do next without regretting my decison. \n\nThanks!", "author": "APGalore21", "created": 1631049688, "retrieved": 1632948672, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"hc1so4x": {"link": "/r/CollegeRant/comments/pjw9ws/major_decision_need_help/hc1so4x/", "text": "Like another user suggested, I'd figure out a career path you want to pursue and work backwards to figure out what majors would get you there. I'd also like to mention, you don't have to be passionate about your major or your career. I'm not saying do something you'll hate but don't feel like you have to love your major or job. Also look into future career prospects of any majors you're interested in.", "author": "just-doing-a-job", "created": 1631103152, "upvotes": 1}, "hc0rbye": {"link": "/r/CollegeRant/comments/pjw9ws/major_decision_need_help/hc0rbye/", "text": "hi, why sociology? seems oddly specific. have you taken sociology classes before and feel passionate about them more than business?", "author": "kaytherine", "created": 1631074370, "upvotes": 1}, "hc001g2": {"link": "/r/CollegeRant/comments/pjw9ws/major_decision_need_help/hc001g2/", "text": "As a marketing professor, I feel compelled to be sure that you know that you don’t have to work for a for-profit if you don’t want. Marketing is really about strategic decision making using information and understanding to create, communicate, deliver, and exchange value. For-profit business don’t own the concept of value - value is the ratio of benefits vs costs, and it’s highly subjective. It’s also a universal concept, and you can apply what you learn to non-profit organizations and other areas outside of straight-up “business.”\n\nWhat draws you to sociology? And more broadly, what do you really want to do in life? What are you really passionate about?\n\nHope this helps!", "author": "PhDapper", "created": 1631060811, "upvotes": 1}, "hbzcoep": {"link": "/r/CollegeRant/comments/pjw9ws/major_decision_need_help/hbzcoep/", "text": "Work backwards from what career you want.\n\nHow will sociology or business help you get it?", "author": "FoxWyrd", "created": 1631050055, "upvotes": 3}}}