{
  "sid": "q499co",
  "link": "/r/CollegeRant/comments/q499co/classic_rant_about_teammates_that_dont_mind_to/",
  "title:": "Classic rant about teammates that don't mind to help out",
  "text": "Okay so I'm Mexican and I share all my classes with the same people, so I only have one team for my 9 classes, and I'm sorry to say it, but they kinda suck. And not because I consider them dumb, but because they are lazy and inconsiderate. I like to take the leader role if I feel like I have an opportunity to do so, and I didn't see one with them because I saw a need. I really be reminding them about our projects, choosing the topics, explaining the development, and correcting everything because if I don't say a thing they don't actually care, trust me. I tried early on the semester to say nothing and let another girl remind us all because I thought “well, maybe I am the problem” turns out I wasn't, nobody said a thing until I appeared, and we were only like 3 weeks on the semester.\n\nAnd this is new for me, yes, I usually take the leader role, but people know how to work and are interested on their grades in college, like, I have never been this stressed out about my team homework because I always trusted my teams would make things work out. Yes, maybe I fucked up by not changing teams earlier and now the semester is almost over (for me) and now I only can rant over here about it. But what really eats my brain outis that I feel like my teammates don't like me AT ALL because I bother them so much, which sucks because during online school I made friends on my teams because I'm shy, but how wouldn't I bother on the group chat in this situation? I do feel guilty and embarrassed for being the one who is always talking, but someone needs to, like I worry about my grades and like to do things right. I wouldn't mind just a little bit of help, but I know that atp I won't get it. I just would like to trust myself more and don't let their attitude towards me affect me so much. \n\nEdit: I guess it bothers me that they don't like me because my whole university experience has been online and I have not made a lot of friends so the people at school that I interact the MOST with kinda suck and make me feel overwhelmed.\n\nTL;DR: I have a crappy team which stress me out a ton and somehow it bothers me that they find me annoying because I pressure them a lot, but how couldn't I if they are next thing to lazy? Yes, I should have changed teams but I didn't, the semester is almost done, and I can only rant.",
  "author": "agridulcedulce",
  "created": 1633734921,
  "updated": 1634093821,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hfyzm67": {
      "link": "/r/CollegeRant/comments/q499co/classic_rant_about_teammates_that_dont_mind_to/hfyzm67/",
      "text": "same, i care about my grades for scholarship and they dont. Im always the leader because everyone stays silence until someone agree to be it. They dont reply my message, left me at “read”, refuse to help the team or just simply write something(even its wrong) and gave it to me. In the end, i always do everything myself and carry them. I HATE THEM.",
      "author": "Catanddogg",
      "created": 1633779897,
      "upvotes": 2,
      "replies": {
        "hg0k2ot": {
          "link": "/r/CollegeRant/comments/q499co/classic_rant_about_teammates_that_dont_mind_to/hg0k2ot/",
          "text": "Damn that's awful to hear :( I personally don't do their part of the work because I pressure them a lot, but I do have to correct it myself and it's so annoying. Honestly I will just stop caring about how they feel about me, it's not my fault they are lazy and I like doing my projects the right way, our major isn't even that complicated they can find enough time.",
          "author": "agridulcedulce",
          "created": 1633807367,
          "upvotes": 1,
          "replies": {
            "hg2p8xt": {
              "link": "/r/CollegeRant/comments/q499co/classic_rant_about_teammates_that_dont_mind_to/hg2p8xt/",
              "text": "Tbh, its no use pressuring them for me. They either dont do and i do everything correct OR they do because i force them and do everything wrong(because they didnt even do research/read books, they just simply write something)",
              "author": "Catanddogg",
              "created": 1633846641,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}