{"sid": "g1f95t", "link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/", "title:": "College is (mostly) a scam.", "text": "Is it just me or does anyone else think it's ridiculous that universities make you take sports & recreation classes?\n\nI'm a kinesiology major so it's not like I'm crying cause I don't like to exercise, but we're adults basically being forced to take upscale gym class. Not to mention all the other non-major related electives.\n\nDo they just want 4 full years of tuition out of us..most of which can't afford it and will be paying off student loans till we're 60? \n\nRant over. Back to online learning.....🙄", "author": "Toast_face_killa", "created": 1586902897, "retrieved": 1632843380, "over_18": false, "upvotes": 62, "upvote_ratio": 0.96, "comments": {"fqbceyj": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fqbceyj/", "text": "Wow some of these replies are toxic. To the original point, yes, I agree that a PE req in college is pretty ridiculous; and I'm glad my school (seemingly along with many) don't have such a req. I also agree that college is a scam in that no degree is ever gonna really be \"worth\" $100k+; but because of this, the next best option is to try and milk its advantages (whatever those may be in one's particular school or field) as much as possible in the meantime. Administrative bloat is usually the biggest culprit of this.\n\nBut to the point of gen eds: hardly any academic subjects exist in isolation. There's so much that can be learned from areas outside of your major. That's why it's called an education. If you want job training only, go to a trade school (which is a perfectly good option too and one I think more people should tend to go with). Why do STEM majors need at least some humanities, arts, and social sciences? B/c you learn to analyze rhetoric, form and support arguments, and deconstruct others' arguments, in addition to a plethora of content which may make you a more responsible and aware global citizen. Pretty much the same could be said in vice versa in terms of filling in informational gaps. And each different field of study introduces & utilizes different approaches to problem solving, which can prove helpful in many other situations. Being \"well-rounded\" isn't just a throw-around phrase. Narrow mindsets are why many college educated people still seem ignorant to what should be basic knowledge (e.g. climate change is real, a plethora of political issues that I won't go into detail on, etc.)\n\nYes, some courses can be a wash. But if you choose your gen eds wisely (there's usually a variety of classes that fulfill any given req) instead of passively letting your advisor randomly pick them, you might find a bit more meaning in those courses.", "author": "bucs2013", "created": 1589234428, "upvotes": 1}, "fp9by2p": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fp9by2p/", "text": "So true man. My major is aerospace i have to take PE, philosophy, Marketing, Economics, social communication. PE i don't mind because students don't get enough physical activity anyway, but the rest is utter crap and they are not easy to pass either.", "author": "SnappyRice", "created": 1588421763, "upvotes": 1}, "fnhkabv": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnhkabv/", "text": "My school never required it.", "author": "arlomilano", "created": 1586963968, "upvotes": 2}, "fng066f": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fng066f/", "text": "Totally agree.  I still believe that education is paramount, and those who are more educated tend to succeed more often.  However, I think the big, massive, ugly lie is that college is the only place to get an education.  It's not.  It's not even the best place to actually learn.  All college teaches you to do is be a subordinate, follow mundane directions, and kiss ass with professors to pass.  Oh and all those worthless electives they try to tell you are to make sure you're well rounded?  Bullshit.  They'd lose an extra year of your money if you didn't take the classes, that's all.", "author": "intoxicatedMobyDick", "created": 1586919269, "upvotes": 5}, "fnfuuk9": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnfuuk9/", "text": "I’d love to pit myself against my college colleagues physically. I’d actually most certainly beat them in something for once.", "author": "Zealomon", "created": 1586915948, "upvotes": 2}, "fnft85v": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnft85v/", "text": "I think it’s ridiculous that you have to take any electives not having to do with your major. If I wanted knowledge on something other than what I came to school for, I would just go watch YouTube or read a book.", "author": null, "created": 1586914969, "upvotes": 9}, "fnfszrz": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnfszrz/", "text": "I'm not trying to shower between classes. I'm trying to go, meet with friends and do extracurriculars, and then go back home.", "author": "internally", "created": 1586914829, "upvotes": 3}, "fnfstm0": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnfstm0/", "text": "[deleted]", "author": null, "created": 1586914726, "upvotes": 8}, "fnfsb7s": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnfsb7s/", "text": "My college doesnt have the gym requirement. \n\nAlthough I'd be happy to take yoga or swimming in college at this point. \n\nBut imagine yoga or swimming online", "author": "gandreeva18", "created": 1586914423, "upvotes": 13}, "fnfr8xm": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnfr8xm/", "text": "Totally agree.", "author": "Unicornrescue", "created": 1586913796, "upvotes": 1}, "fnfqfe2": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnfqfe2/", "text": "My school doesn't require any PE classes at all; I don't even think any are offered. It's all dependent on the college you chose to attend.", "author": "Calligraphee", "created": 1586913310, "upvotes": 1}, "fnfm42h": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnfm42h/", "text": "Y’all have to take PE classes? Lol that is a joke. My school doesn’t require it", "author": "rogertaylorkillme", "created": 1586910781, "upvotes": 37}, "fnfix7y": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnfix7y/", "text": "Yes. College is a scam. At my college, if I removed all the Gen. Eds from my degree I would only have three years instead of four. For me, personally, that’s ~$8,000 in savings. That, multiplied by ~25,000 students equals $200,000/year for my college. That’s a lot of money they would lose if they got rid of all the useless crap. I am a finance major and you’re telling me I have to take a my sixth ever English class that just spits out the same basic shit each year??\n\nEdit: my shitty math", "author": "RileyG00", "created": 1586908932, "upvotes": 20}, "fnfegvo": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnfegvo/", "text": "Outdated? sure. Can your get from A to B quicker with internet? Yep. Is brilliance, ingenuity common place in 2020? Almost.\n\nThe systems that put college into place, and the systems that college invokes in your brain, were developed by Individuals who wanted to create a society that we are approaching shortly. \n\nThey looked closely at how the brain benefits from the curriculum. There were far fewer distractions to do so, and information was not as easily accessible.\n\nBut, like verbal abuse, the pros and cons of what occurs in the brain aren’t recognized just like a physician doubting a victim of verbal assault. Where physical results are easily seen, such as a bruise, a dollar, or a final degree.\n\nBut if we had a scanner that mapped out your synapses, and your new systems store in the basil ganglia, the level of intuitiveness. Tuition would double and be more valuable than oil.", "author": null, "created": 1586906504, "upvotes": 0}, "fnfabcf": {"link": "/r/CollegeRant/comments/g1f95t/college_is_mostly_a_scam/fnfabcf/", "text": "I mean all majors have electives and gen-ed classes so it's very normal. I personally don't think it's ridiculous as college is meant to give you a well rounded education. However, the PE classes are kinda ridiculous.", "author": "chenthehen", "created": 1586904321, "upvotes": 15}}}