{
  "sid": "qeirna",
  "link": "/r/CollegeRant/comments/qeirna/i_think_i_fell_for_someoneand_he_is_intrested_in/",
  "title:": "I think I fell for someone….and he is intrested in a friend of mine. (I don’t know how I feel)",
  "text": "Ok at this point, I (20/M/Bisexual) just don't know where to put my thoughts out. I need to but like I just had to. So I work for the Dean staff at my dorm and I got to get close with one of the RA's in particular because he is actually my friend's best friend. I met him during the summer and it so happened that we got to get the same dorm to work in. So I am a desk worker but I am in the process to work his floor as he is the only one and they need a second one soon as he be gets into the Nursing program. \n\n&#x200B;\n\nHe is a good-looking guy and he is the type that can get any girl he wants and he actually isn't a jerk. I've gotten to know him pretty well as most of the weeks have passed by. The reality is that i think i am starting to like him. I told him i was bi and he's been hella chill about it. The thing is is that he technically fits my type of guy and he makes me feel good. The thing is is that my other close friend and him are actually getting to know each other and stuff is happening......fast.....too fast. They are part of my friend group and I had a past friend group who had the same thing happen and.....lets just say we all crashed and burned because of the relationship. I don't want to relive that trauma that still affects me today about it even though I never was part of any romance in the old friend group. \n\n&#x200B;\n\nI see my friends hanging out and just vibing and then there's me knowing that either its gonna go good or bad. Sure, i think I do have my feelings in the way whenever I see them together but I value my friendships and it is a work in progress to work on my feelings and eventually be able to appreciate him as a friend and a SUPER CLOSE BEST FRIEND. And then I get thrown back to thinking that maybe I do like him in that way and it makes my whole mind go freaking crazy about how I feel. I see him vibing with this girl who I’m super close to and I find weird feelings met. It’s like I’m want him to be happy but I want him still around if that makes sense. I don’t want to be a jerk either and so I don’t know what to do. \n\nTLTR: I’m a bi male who was able to connect with someone in a very platonic way and now he’s intreated in one of my friends and somehow I feel weird about it. I don’t want to be a jerk about it either so I don’t know what to do. .",
  "author": "iiolympicnerd",
  "created": 1635041334,
  "updated": 1635185211,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hhtxz7y": {
      "link": "/r/CollegeRant/comments/qeirna/i_think_i_fell_for_someoneand_he_is_intrested_in/hhtxz7y/",
      "text": "19/M/gay here. I think it might be best to move on. Assuming he's straight, there's no possibility of you two being together. Even if he's not, you'd still (for a lack of better words), be competing with your friend over a guy and driving a wedge in your friendship. And based off of what you said, they've already fallen for eachother, so it would be an uphill battle.\n\nIt sucks, but I think distancing yourself from him and talking to new people might help. It's easier said than done, but talking to new people and going out might help to focus your attention away from him.\n\n Alternatively, you could accept that you have feelings for him, make peace with it, and take the friendship for what it is.\n\nAlso, you should post this to one of the lgbt subreddits, specifically r/askgaybros or r/askgaymen since they're more equipped to answer questions like this.\n\nYou're not alone in feeling the way you do. It's difficult having crushes when you're not straight, but I promise there's more people out there. It feels terrible now but I know you'll get through this. Take care of yourself.",
      "author": "thesunisexpanding",
      "created": 1635054731,
      "upvotes": 2,
      "replies": {
        "hhuejuf": {
          "link": "/r/CollegeRant/comments/qeirna/i_think_i_fell_for_someoneand_he_is_intrested_in/hhuejuf/",
          "text": "Thanks! I think it’s a thing of like I’m deconstructing my feelings because I do want him around my life. So I’m just making sure I’m taking time and just not making it obvious either lol",
          "author": "iiolympicnerd",
          "created": 1635068302,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}