{"sid": "iyn36y", "link": "/r/CollegeRant/comments/iyn36y/is_suffering_while_youre_young_really_worth_it/", "title:": "Is suffering while you’re young really worth it?", "text": "I’ve been on a streak of about 16 days of being extremely productive (12-16 hours of doing actual work, both curricular and extracurricular) to be able to try to apply to a Top 25 school for transfer in the Spring. \n\nMy GPA’s all there, but I’m really just trying to give my applications the extra edge over the competition. I know if I get accepted, it’ll be worth it, but they have a Spring Transfer Admission rate of around 3.5%. (0-5 of the 35-70 applicants each year).\n\nAll the work I put in ups those odds, but all I need is for some guy who’s been putting in this kind of work since they were a Freshman to come in to take my spot. \n\nI don’t know if this kind of work is worth it. It’s awful. I go from doing one classes’ homework to another, then to Udemy, then to reading some book. I get like a hour or two of free time each day, which I spend stressing out over if this is even worth it. \n\nMy advisor who said they’d help has been very busy all month, so I can’t even get much info from them on my odds. I know they have good info, I just can’t get into contact with them. I’ve been slightly pushy (an email each week), and they said they’d get around to it when they weren’t busy, but each day is another day of stressing over this.\n\nWorst thing about it is, my “backup school” is still the best school in my state. I’d be completely fine in the future, but I’ve put this pressure on myself to get accepted into this particular school, so it’s very likely I’ll be attending that backup school disappointed in myself. \n\nThis whole thing is killing me. It’s definitely a rant/vent, but I can’t keep this up unless I get some kind of motivation.", "author": "neck_crow", "created": 1600909621, "retrieved": 1632842996, "over_18": false, "upvotes": 98, "upvote_ratio": 1.0, "comments": {"g82ykx5": {"link": "/r/CollegeRant/comments/iyn36y/is_suffering_while_youre_young_really_worth_it/g82ykx5/", "text": "Returning to finish undergrad at 24 (now 26 with another year to go) has personally lead to much heavier suffering. Still young though I guess? I feel like I'm an ancient man child.", "author": "hyperfocusedcat", "created": 1602133518, "upvotes": 1}, "g6owy61": {"link": "/r/CollegeRant/comments/iyn36y/is_suffering_while_youre_young_really_worth_it/g6owy61/", "text": "What I'd be doing in that situation is working through that feeling of disappointment. Absolutely no reason to feel disappointed about going to the best school in your state.", "author": "johnstewart37", "created": 1601134182, "upvotes": 1}, "g6g4vln": {"link": "/r/CollegeRant/comments/iyn36y/is_suffering_while_youre_young_really_worth_it/g6g4vln/", "text": "No its not worth it. \n\nPretty much everyone who doesn't come from money and grow up getting connections to decent jobs because of their parents is pretty screwed after they graduate. I know many people with supposedly in demand degrees (like engineering, computer science, and medical-related degrees) from highly ranked schools with selective admissions who can't get a job related to their degree, or even a job that requires a college degree.\n\nOn the other hand I went to a satellite campus of a flagship public university in the midwest and graduated with no debt (state schools typically have really awesome scholarships and grants and significantly lower tuition) and have several graduate programs who are trying to recruit me right. Even though hiring in my field was completely decimated by COVID, I am less screwed and can somewhat take a lower paying job temporarily while I figure out what my next steps are.\n\nTo compare it to two other managers at my current job, one went to the best respected engineering program in our area (which is also one of the most difficult in the country) and hasn't been able to find an engineering-related job since he graduated a few years ago. A second manager went to a very expensive private school in our area, majored in some academic major that's in demand (I don't remember what, but it was something in STEM), and now has significant college debt. Guess what? All three of us are basically in the same place right now even thought on paper both of them should be much better off than I am based on where they went to school and what they studied.\n\n**tl;dr:** its not worth it to kill yourself over anything college related because jobs are gotten through who you know not what you know. So you can go to the best and most expensive schools however, if you don't already have those connections before you even start college you will basically end up in the same place as an arts-related major who went to a cheap public school.", "author": "squirrel8296", "created": 1600970384, "upvotes": 1}, "g6fywv3": {"link": "/r/CollegeRant/comments/iyn36y/is_suffering_while_youre_young_really_worth_it/g6fywv3/", "text": "First thing you should realize is that it isn't necessarily about you getting what you want but the school getting what it is looking for.  The standards are set by the school and the professors; so, even with all of this hard work, when you do your application, they still may not want what you have to offer AND THAT IS OKAY, I promise. It just means that you were not fit for THEIR particular program. The hard work pays off when you find the school that wants your particular talents.  I have a perfect GPA, I have tons of extra talents, tutoring, publishable research, etc and they can still pick someone over me because I don't fit what the program director is looking for.    The goal should be to always work hard and do your best because when you find the program/school that wants you, you will be ready to take the opportunity and will excel not just take classes. Professors love students that go above and beyond.  You will get opportunities that other students don't. It does pay off!!", "author": "GradResearchAsst52", "created": 1600967489, "upvotes": 1}, "g6dmc5u": {"link": "/r/CollegeRant/comments/iyn36y/is_suffering_while_youre_young_really_worth_it/g6dmc5u/", "text": "Yes, because college is hard to get into period. \nAnd we should all strive to do well. \n\nNo, because we should create time to enjoy ourselves and total suffering for monetary gain is not worth a lost youth.", "author": "vr1252", "created": 1600912356, "upvotes": 8}, "g6dlzez": {"link": "/r/CollegeRant/comments/iyn36y/is_suffering_while_youre_young_really_worth_it/g6dlzez/", "text": "I feel for you I’m in a very similar boat\n\nMy Highschool gpa was fucked because I had one really bad semester due to a traumatic event. I can’t even talk about that event legally. All my other grades were good.\n\nI’m attending a state school in my hometown to save money during covid but I desperately want to leave once covid is over. I don’t imagine myself here. Sometimes I cry thinking about having to stay here another year (not to be dramatic).\n\nI’ve been in a good productivity streak too. My dream is to transfer to Columbia, but I think what has really helped me out is just having a backup school in case. Like for me, if I don’t get into Columbia, I’ll attempt to transfer to University of Washington. \n\nMaybe Your situation doesn’t exactly parallel mine, but as my dad says: “just keep pushing. At the end of the day, somebody will want you for what you are. Don’t give up because you’re afraid of failure.” He also says all the time to expect the worst in life, so your expectations won’t be diminished\n\nIdk I hope this helps !!", "author": "Betullul", "created": 1600912158, "upvotes": 17}, "g6dknq9": {"link": "/r/CollegeRant/comments/iyn36y/is_suffering_while_youre_young_really_worth_it/g6dknq9/", "text": "Suffering while your young is worth it if you are suffering for the right thing. If your suffering for an art degree, not worth it. If you are saving every penny and working 18 hours a day on a business, very very worth it.", "author": "feetkisser69", "created": 1600911421, "upvotes": 7}, "g6dj7ku": {"link": "/r/CollegeRant/comments/iyn36y/is_suffering_while_youre_young_really_worth_it/g6dj7ku/", "text": "Best thing you could look into both financially and for a situation like this is find a local in state school and get your gen eds out of the way. My school told me they only took credits from 4 year schools, turns out that wasnt true. It ended up being a 20,000 dollar lie and waste of time. Dont sweat about getting into the best of the best as much as where you ultimately want to end up, both career and financially. Best piece of advice I can give as the top of my class who gets 0 in scholarships.", "author": "ComputeBeepBeep", "created": 1600910617, "upvotes": 9}}}