{
  "sid": "i8nf5r",
  "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/",
  "title:": "Why do some professors not respond to emails?",
  "text": "I do not understand why some professors don't respond to any student emails. Especially during COVID where we didn't have any face to face time. Why become a professor/teach students if you're not willing to talk/respond to them? Don't they have to check their emails incase their colleagues or bosses email them? I don't see why they ignore student emails and answer other emails.",
  "author": "anothersadsister",
  "created": 1597270173,
  "over_18": false,
  "upvotes": 58,
  "upvote_ratio": 0.92,
  "comments": {
    "g1c4kki": {
      "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1c4kki/",
      "text": "They probably have an influx of emails.",
      "author": "Ether_of_Joti",
      "created": 1597332707,
      "upvotes": 1,
      "replies": {
        "g1ebuko": {
          "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1ebuko/",
          "text": "This professor never responded even before COVID/everything transitioned online.",
          "author": "anothersadsister",
          "created": 1597370749,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g1c2dyc": {
      "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1c2dyc/",
      "text": "The only times I feel the urge to not respond to a student is \n\n(1) when they ask something that is answered on the syllabus or other class materials\n\n(2) when they make a statement and I don't know what the question is\n\nBut I still reply ... maybe with a little snark but I reply.",
      "author": "ThatProfessor3301",
      "created": 1597331710,
      "upvotes": 2,
      "replies": {}
    },
    "g1bfvey": {
      "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1bfvey/",
      "text": "They've got a  lot of other priorities. If you think about it, many colleges/unis are research and publishing firms with classes as a side gig.",
      "author": null,
      "created": 1597318289,
      "upvotes": 2,
      "replies": {
        "g1bqhrc": {
          "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1bqhrc/",
          "text": "That's a good point. It's still a little frustrating though that we're paying thousands of dollars and the students still aren't the main priority, but that's more of a problem with the university system rather than professors in general. I wish that weren't the case. But thank you for the insight!",
          "author": "anothersadsister",
          "created": 1597325439,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "g1bc19o": {
      "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1bc19o/",
      "text": "What’s even more frustrating is when they specifically ask you to email them with any questions- and then you do- and they don’t answer",
      "author": "ASacOFluffyPups",
      "created": 1597315013,
      "upvotes": 3,
      "replies": {}
    },
    "g1bbnks": {
      "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1bbnks/",
      "text": "As a professor and as a former student who emailed professors, you’ve just asked the Magic question. If I was going to give benefit of the doubt, I’d say it’s because they get so so many and sometimes emails just get lost in the pile. Happens to me every once in a while. But honestly there’s no excuse. Some professors are bums about it and don’t prioritize students. My wife had a professor that only cared about one school club and nothing else do students would put that club in the subject line to get him to actually open their emails. It’s a shame but it’s good experience for cold calling and persistence in the real world I suppose. If you’re having a ton of trouble, just go straight to the chair and say you can’t get a hold of the professor. If that doesn’t work, email the dean. Don’t come off as emotionally charged. Just say you’re having trouble reaching the person and they haven’t responded to x number of emails in x number of days.",
      "author": "collegehacked",
      "created": 1597314653,
      "upvotes": 20,
      "replies": {
        "g1bchr7": {
          "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1bchr7/",
          "text": "My professor never responded to a single student's emails for the first three and a half months of class! I ended up emailing my advisor about it who forwarded it to the chair. My professor did end up replying to my emails, but no one else's in my class until after the final where he responded to one person asking about how the assignments will be graded due COVID. Thank you for the insight, and I'm glad a professor also sees how frustrating this is! I wish you the best this year!",
          "author": "anothersadsister",
          "created": 1597315436,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g1b02re": {
      "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1b02re/",
      "text": "Well, from their perspective, they're hugely interested in their own work, and thus went to graduate school to get a PhD to continue publishing research. While teaching undergraduates is one of their responsibilities, it's not their only responsibility, and it's likely not their primary interests. Had they wanted to teach kids/young adults, they likely would've gone into teaching high schoolers.\n\nThis is assuming that you're at a university where professors do research. If you're at a community college, then this likely isn't case and I don't know what's up with your professors.",
      "author": "CoffeeVector",
      "created": 1597303262,
      "upvotes": 8,
      "replies": {
        "g1bqzxs": {
          "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1bqzxs/",
          "text": "That's a good point. I wish it weren't the case that they were mainly teaching classes to get by with/fund their research so the students could have a better learning environment, but that's more of a problem with the university system rather than the professors. It's just a little frustrating that students have to pay thousands of dollars to not be the professors' priority, but given what you said, it makes sense. Thank you for the insight!",
          "author": "anothersadsister",
          "created": 1597325737,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g19ukyd": {
      "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g19ukyd/",
      "text": "[deleted]",
      "author": null,
      "created": 1597276806,
      "upvotes": 0,
      "replies": {
        "g1aqjdk": {
          "link": "/r/CollegeRant/comments/i8nf5r/why_do_some_professors_not_respond_to_emails/g1aqjdk/",
          "text": "10/10. Informative. Yet somehow elusive. Might I even say...daring?",
          "author": "muffinfight",
          "created": 1597295283,
          "upvotes": -5,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064332
}