{"sid": "pou5yo", "link": "/r/CollegeRant/comments/pou5yo/i_need_advice_im_just_sitting_here_crying/", "title:": "I need advice im just sitting here crying", "text": "I hate my major in animation so much. It takes so much of my time and money and idk how long I can take this bullshit. My card declined today while getting food because I had to spend money getting supplies for these different classes. I started crying while drawing in this required sketchbook (I have no choice, I have to draw 100 pages) I fucking hate art so much and I lost my fucking passion for it years ago when I realized im a terrible artist and this is a terrible career path. And art professors are so stingy, they grade based on talent more than effort. All the competition, the money, the time, all this to graduate with debt and a minimum wage job and a shitty fine arts degree. \n\nI would drop out but I'm almost done anyways like a year or 2 left. Typing this is always therapeutic but after graduation I hope I never draw anything ever again. Some advice from anyone who relates would be nice. I keep crying and I wish I could punch 18 year old me in the face.", "author": "Turtleisim", "created": 1631725191, "retrieved": 1632948525, "over_18": false, "upvotes": 23, "upvote_ratio": 0.93, "comments": {"hd8xysh": {"link": "/r/CollegeRant/comments/pou5yo/i_need_advice_im_just_sitting_here_crying/hd8xysh/", "text": "SAME IM AN ART STUDENT I FUCKING HATE IT OMG I WROTE A REALLY LONG VENT ON THIS and how artist people LOSE THEIR FUCKING PASSION WHEN THEYRE IN ART SCHOOLS because it's just not fucking it school is the fucking curse. It's not on Reddit but ya I totally relate I wanna drop out so fucking badly, materials are ridiculously expensive with the amount of money we're paying why can't we get a least a subsidy 🙄🙄", "author": "okbokchoy", "created": 1631909164, "upvotes": 1}, "hd1kztf": {"link": "/r/CollegeRant/comments/pou5yo/i_need_advice_im_just_sitting_here_crying/hd1kztf/", "text": "> And art professors are so stingy, they grade based on talent more than effort. \n\nI'd just like to address this point. Every field grades based upon measurable outcomes, and not effort. I teach engineering; I mark based upon whether or not they got the answer right, and communicate their work in a logical straightforward fashion, following the various conventions in the field.\n\nThis is easier for some students than others. Some students really struggle with it. I might commiserate with those students, but that's about all. \n\nThe point of studying, of practicing is to hone your skills and talent. But at the end of the day, it's what you get down on the page that gets assessed, not how you got there. No matter what field you're in.", "author": "BarackTrudeau", "created": 1631768094, "upvotes": 3}, "hczhauk": {"link": "/r/CollegeRant/comments/pou5yo/i_need_advice_im_just_sitting_here_crying/hczhauk/", "text": "I would recommend changing majors if you hate this one! Is there something else you would like to study/do with your life?", "author": "SHCrazyCatLady", "created": 1631732819, "upvotes": 5}}}