{
  "sid": "q0iih0",
  "link": "/r/CollegeRant/comments/q0iih0/the_midterm_review_at_my_university_was_so/",
  "title:": "The midterm review at my university was so disorganized I feel like I wasted my time.",
  "text": "So, I know as students we are supposed to study and learn on our own time for the majority of the semester BUT I am going to take advantage of all resources possible to help me with that.\n\nWe had a mock midterm last Sunday and it was from 7-9pm. We had no idea where to even go for it, we were just told it’s “In that building and someone will tell you” umm ok? \n\nSo, I get there and we got to a room and waited. They did not have enough copies to pass out the practice midterm, but after about 10 minutes they gave everyone one.\n\n….We sat there for another 10 minutes and all of a sudden the grad students(not math department) were like “Oh btw, you all can start!” Wtf? \n\nSo, about 30-45 minutes into, they later say “Ok you can work with your friends now to solve the problems!” ….then 5 minutes after that they just show the answers on the screen.\n\nLastly, in the other room the math department students actually wrote the correct answers on the board and stood around willingly to explain why the question was right.\n\nI expected something better from a 4 year state university.",
  "author": "Romano16",
  "created": 1633270282,
  "updated": 1634093890,
  "over_18": false,
  "upvotes": 48,
  "upvote_ratio": 0.88,
  "comments": {
    "hf9iank": {
      "link": "/r/CollegeRant/comments/q0iih0/the_midterm_review_at_my_university_was_so/hf9iank/",
      "text": "> I expected something better from a 4 year state university.\n\nI wouldn't-- this is not a typical thing any school I know of does (although I'm sure some do; I just haven't seen it). Realistically, the review probably involved a bunch of people volunteering their time, since it's not like something like a tutoring center which is paid for with your tuition dollars. This means that it's low on the organizer's priority list and was probably more or less just meant to be an impromptu thing to help you guys out.\n\nWould it have been nice if they did a better job? Sure. But again, it sounds like busy grad students doing something that they don't actually have the time for and probably aren't paid to do just so that they can be nice to you guys or at the very least just because your professor told them to and they have no leverage to say no. Give the poor grad students a break.",
      "author": "HumanDrinkingTea",
      "created": 1633290246,
      "upvotes": 15,
      "replies": {
        "hfan7o9": {
          "link": "/r/CollegeRant/comments/q0iih0/the_midterm_review_at_my_university_was_so/hfan7o9/",
          "text": "No good deed goes unpunished. I used to set up special study sessions after hours for my students, but I got more complaints than thank yous. I would rather spend time with my wife and kids.",
          "author": "metal_bulb",
          "created": 1633308347,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}