{"sid": "jum3bs", "link": "/r/CollegeRant/comments/jum3bs/weird_meme_about_my_thoughts_for_completely/", "title:": "Weird meme about my thoughts for completely asynchronous online learning", "text": "As soon as COVID-19 hit the country for my 1st year of college lots of people told me that online classes for my 1st semester would be easy. But as soon as classes started I knew it would be bad. Too many long papers and essays to do (most feel unnecessary and excessive). Too many modules and reading materials. Requirements that need us to go out and risk getting infected. Little to no clarifications and explanations for modules. Clarifications with professors are difficult. A very unengaging and buggy online management system for learning. The anxiety of not seeing a requirement in the learning system. The anxiety of seeing all your requirements at once. Honestly, I am not sure if what I feel is valid. Maybe college really has this much requirements and readings with almost no breathing room. Maybe I am just irresponsible enough to miss some announcements and deadlines. This is also my first time dealing with online classes and I just made this weird meme to let out my thoughts (the format is odd and kinda ugly).\n\n&#x200B;\n\nTL:DR - My online class experience is bad\n\nhttps://preview.redd.it/iljrq2jlrez51.png?width=3750&format=png&auto=webp&s=c73e3af5757663bf89447da22f8a2e7d7236673a", "author": "kerotOG", "created": 1605447956, "retrieved": 1632843204, "over_18": false, "upvotes": 81, "upvote_ratio": 0.99, "comments": {"gcg0nfm": {"link": "/r/CollegeRant/comments/jum3bs/weird_meme_about_my_thoughts_for_completely/gcg0nfm/", "text": "I wish cheating was possible but its difficult to message people in class and ask if they can help me pass the class without the fear of being weird or getting ratted on, fuck online school", "author": null, "created": 1605486935, "upvotes": 3}, "gceo97j": {"link": "/r/CollegeRant/comments/jum3bs/weird_meme_about_my_thoughts_for_completely/gceo97j/", "text": "Online classes were easier when they were formatted well to be online. Now we have classes where teachers are trying to treat it like in person class as well as online", "author": "vness1213", "created": 1605462021, "upvotes": 31}, "gcekqnc": {"link": "/r/CollegeRant/comments/jum3bs/weird_meme_about_my_thoughts_for_completely/gcekqnc/", "text": "Same after last semester, I thought it’ll be for the worst repeating a requirement class I needed to pass after withdrawing because of the online switch. \n\nI had lost my state aid before start of Fall2020 because my GPA dropped from my 2 classes I failed/ withdrew and 1 class I passed with a C+ and another class I forget.\n\nWhen going into September, I thought the same cycle would happen but pretty much I was doing better than last semester! \n\nI think it depends on type of classes you have and the professor teaching style and amount of work you get assigned. \n\nThis time I dropped a introduction class for a major I might not even be interested in and stuck with 3 classes for the semester. It worked better for my situation.👍🏽💫\n\nNext semester I am planning to just do mainly Monday and Wednesday classes and I  have Friday’s off. One of my classes are only Wednesday’s so I like my schedule🙌🏽", "author": "Mya19", "created": 1605460096, "upvotes": 6}}}