{
  "sid": "qxn00f",
  "link": "/r/CollegeRant/comments/qxn00f/why_i_dropped_out_of_college/",
  "title:": "Why I dropped out of College",
  "text": "I was in a tech school that's off campus from the main college and let me tell you, it fucking sucked. I was in welding for a hot minute before I jumped out of that pile of trash only to jump into a damn dumpster full of used condoms and needles. \n\n\nHad two welding teachers, one was good but had to make up for the other ones slack so it still was lacking a lot. The other teacher in welding couldn't fucking weld if he had to and was a prick about anything and spent all his time with the older students he knew. I left that class because the only thing I'd been taught was how to weld in a straight line and my bad teacher, which was my main one wouldn't check our welds or even tell us how to set up the welding rig. So I left that class for mechatronics hoping it's be better, it had to be right?\n\nNope, mechatronics was just as bad as welding. Actually mechatronics was worst because in my welding class I did learn a new skill, welding. It ain't great or pretty but I can weld and can do it good if it's the type that runs the wire through the hose, and yeah I don't know what kind that's called. Anyways though I didn't learn anything in mechatronics, literally anything. My teacher would talk about his time in the service and he'd describe how in one instance his squadmate used a plastic more spoon to kill an ambusher. Sure it's cool and I enjoyed his stories, especially the graphic ones, but I was there to learn about mechatronics not about his kills and theft from the military and his family. Seriously I can tell you more about his military career and family than I could mechatronics, which I couldn't tell you anything about mechatronics.\n\nTLDR: My tech school sucks and if I had to go back for anything it'd be Mechanics because my buddies are in there and they're having a kick ass time, plus the teacher looks like santa.\n\nI know nobody gives a shit but I did fully drop out and am working on finding a job from home so I can work however much I want/need to pay for my next college experience. My next college experience is gonna be fully online in programming or coding, I plan on doing history eventually but not yet cause it's hard to find a job that'll hire a history major.\n\nThanks for reading and I hope all of yah have a wonderful weekend.",
  "author": "-SomeFatDude-",
  "created": 1637348372,
  "updated": 1637408957,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlanlv3": {
      "link": "/r/CollegeRant/comments/qxn00f/why_i_dropped_out_of_college/hlanlv3/",
      "text": "Never go to a tech school. Always apply for apprenticeships.",
      "author": "Spicybooiii",
      "created": 1637351398,
      "upvotes": 1,
      "replies": {
        "hlchz8z": {
          "link": "/r/CollegeRant/comments/qxn00f/why_i_dropped_out_of_college/hlchz8z/",
          "text": "Agreed.",
          "author": "-SomeFatDude-",
          "created": 1637380473,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlcgv63": {
      "link": "/r/CollegeRant/comments/qxn00f/why_i_dropped_out_of_college/hlcgv63/",
      "text": "I hate how ppl say go to tech school or go here. Like what's better to go",
      "author": "Forever_ForLove",
      "created": 1637379871,
      "upvotes": 2,
      "replies": {}
    }
  }
}