{"sid": "phjh7s", "link": "/r/CollegeRant/comments/phjh7s/please_help_college_wont_let_me_graduate_despite/", "title:": "PLEASE HELP- College won't let me graduate despite having completed all credits", "text": "Hi everyone,\n\nI was supposed to graduate this summer after passing two more classes for my final six credits. One of these classes was through a school in Argentina (think of it like an online exchange program). Anyways, the school in Argentina took too long transferring the credits and now my school is saying I can't graduate until the fall. Does anyone have and idea what I can do about this? My job requires me to be a college graduate so now my livelihood is at stake because of a clerical error that was frankly out of my control. \n\nThank you for taking the time to read this.", "author": "sexhaver2006", "created": 1630724053, "retrieved": 1632841167, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"hbixyaw": {"link": "/r/CollegeRant/comments/phjh7s/please_help_college_wont_let_me_graduate_despite/hbixyaw/", "text": "Thank you u/sexhaver2006 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1630724053, "upvotes": 1}, "hbot222": {"link": "/r/CollegeRant/comments/phjh7s/please_help_college_wont_let_me_graduate_despite/hbot222/", "text": "I would have your regular school provide something in writing stating it was a clerical error and that you have taken all the courses needed to obtain your degree. Then provide this to your employer and explain the situation to them, I’m sure they would be understanding.", "author": "mokshmoon", "created": 1630851312, "upvotes": 2}, "hbk2zpg": {"link": "/r/CollegeRant/comments/phjh7s/please_help_college_wont_let_me_graduate_despite/hbk2zpg/", "text": "No one here can help.", "author": "snoboy8999", "created": 1630754956, "upvotes": 3}, "hbiy85h": {"link": "/r/CollegeRant/comments/phjh7s/please_help_college_wont_let_me_graduate_despite/hbiy85h/", "text": "Well, first, speak to the employer to let them know what’s up; they should be understanding. You can also speak to the Registrar and see if they will certify that you’ve completed everything for your degree but that graduation dates are fixed on a schedule.", "author": "PhDapper", "created": 1630724203, "upvotes": 7}}}