{"sid": "ovxp1r", "link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/", "title:": "I want to write a book about the college experience during COVID", "text": "I'm a reporter for my college newspaper, and I also really love reading creative nonfiction. Ever since last year I've been thinking that it would be cool to write a nonfiction book about what U.S. college was/is like during the pandemic. I want to hear the stories of students all across the country and tell them. I want to convey exactly how painful and confusing being in college is right now, and I want to hold colleges and the government accountable for their mistakes. There's been books written about COVID already (obviously), but no books about COVID + college. \n\nMy questions for this subreddit are: \n\n1) Does this book idea sound interesting or compelling to you? Why or why not?\n\n2) Would you be willing to share your own personal 'college during the pandemic' story with me, or the story of your college as a whole (i.e. how your college struggled financially, questionable decisions/changes they made, etc.)?", "author": "shirbert6540", "created": 1627843251, "retrieved": 1632841687, "over_18": false, "upvotes": 97, "upvote_ratio": 0.95, "comments": {"h7cb1c9": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7cb1c9/", "text": "Thank you u/shirbert6540 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1627843251, "upvotes": 1}, "h9jnbf4": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h9jnbf4/", "text": "I’m a bit late but I think that’s a great idea, my story so far has been pretty depressing when on campus and I just got back yesterday, already really struggling", "author": "octoberpanda", "created": 1629388070, "upvotes": 2}, "h7ifafw": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7ifafw/", "text": "I would wholeheartedly share my experiences from this past year with you. I hope you write this book, it's been a hell of a time and our experiences deserve to be heard.", "author": "i_do_the_kokomo", "created": 1627961262, "upvotes": 2}, "h7hmldx": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7hmldx/", "text": "Please do this. College students during COVID will be able to resonate and feel more supported. Also, college students who are going to enter college get some preview of what they could expect and how to prepare. Lastly, the book will give students in the far future an understanding of the COVID college experience.   \n\n\nI would not mind sharing my story for your book. Please DM me.", "author": "irisy211", "created": 1627947199, "upvotes": 2}, "h7ejucr": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7ejucr/", "text": "It sounds extremely interesting & absolutely! I was extremely affected by covid.", "author": "jennie033", "created": 1627888089, "upvotes": 2}, "h7eiiqc": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7eiiqc/", "text": "Write it! If not for students who need to know they aren’t alone with how they felt during this crappy year but for future students who will want to know how did they do that! It doesn’t matter how many books there are in the bookstore about everyday people and their lives experiences, we are all unique and have a different story to tell. People are fascinating no matter how much people try to disregard others for whatever reason. Plus any trip down the bread aisle at the grocery story should encourage future writers to write the book.", "author": "ColBoundDTermination", "created": 1627886946, "upvotes": 2}, "h7dwyhk": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7dwyhk/", "text": "1. Yes, I think this is a huge turning point in enforcing a new learning environment since the concept of classroom teaching was introduced centuries ago. It'd be interesting to see what makes this different than what we're used to and what can we learn from this experience from teachers, students, and education officers in the governments' POV. \n2. Sure, DM if there's further follow-up questions or discussion topic", "author": "LucQ571", "created": 1627872569, "upvotes": 1}, "h7dpc94": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7dpc94/", "text": "Do it. I'm going to culinary school during the pandemic, it's made things crazy.", "author": "EdenFinley", "created": 1627868516, "upvotes": 2}, "h7dmk6a": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7dmk6a/", "text": "1. Yes. I’m not a big reader, but I would read this. \n2. Yes, DM me.", "author": "CollinMarshall908", "created": 1627867052, "upvotes": 3}, "h7dc6fp": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7dc6fp/", "text": "I'd be interested in it, and in sharing my story. I've had a rough go of it.", "author": "It_is_Katy", "created": 1627861477, "upvotes": 4}, "h7d7by8": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7d7by8/", "text": "That will be one helluva book! I'd love to share my experiences. Most people older than 40 are almost incapable of comprehending how 3 semesters of nearly interruption-free isolation and loneliness during online lessons at home in a dead-ass town feel like. \"Are you kidding me with your 'I want to see my friends again' bullshit? You have food and shelter, now stay at home, study, and start working as fast as you can and make your own money! You're not actually lonely, don't believe otherwise!\"\n\nFuck my life.", "author": "themo98", "created": 1627858936, "upvotes": 7}, "h7d67xq": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7d67xq/", "text": "I would be very interested in this, and I’d be happy to share my story. I had to give up many exciting opportunities and with the way things are headed, it seems I may have to give up more.", "author": "jellysqueaks", "created": 1627858367, "upvotes": 1}, "h7d1rba": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7d1rba/", "text": "Oddly enough, I was thinking about writing a book of my experience working the ambulance throughout the pandemic.", "author": "SmalltownFam0us", "created": 1627856124, "upvotes": 4}, "h7cutto": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7cutto/", "text": "If you really dug in and did an ethnography, I think it would be pretty interesting. The key is getting a broad range of experiences, particularly as they relate to socioeconomic status. One major issue you may encounter is that there will be a glut of books about COVID coming out for the next year or so.", "author": "Youhadmeatomlettebar", "created": 1627852712, "upvotes": 3}, "h7cujd9": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7cujd9/", "text": "I don't think it's something you'll find much support for. It just doesn't seem interesting and I'm not sure what exactly you'd discuss specifically that would make me want to turn to the next page. Everyone is sick and tired of Covid and I'm not sure you'll find people that want to read about it after having lived through all the bullshit the past year and a half.", "author": "orangeblackteal", "created": 1627852575, "upvotes": 1}, "h7cscmg": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7cscmg/", "text": "Write it!!!!\n\nI’m transferring to a university that is insisting on being in person with double occupancy dorms with rising delta variant rates in the area, so that should be interesting. My transfer school is requiring vaccinations but I know damned well there’s gonna be a student or 3 who manages to skirt the requirements.", "author": "dogandcats424242", "created": 1627851506, "upvotes": 8}, "h7cpuse": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7cpuse/", "text": "1. Yes \n2. Absolutely, after taking college during covid it shaped my perspective on so many things. Like I cant express how I changed academically and financially!", "author": "Turtleisim", "created": 1627850321, "upvotes": 12}, "h7clnn8": {"link": "/r/CollegeRant/comments/ovxp1r/i_want_to_write_a_book_about_the_college/h7clnn8/", "text": "I’m sure this would be interesting to some people but it wouldn’t appeal to everyone. Maybe try focusing on government/colleges (social institutions) mistakes & making them take accountability + basically what covid was/is like in general. I could see that being a book k-12 schools require children to read. I’m in college & also work at a hospital as a nursing assistant. IMO (it’s a biased one, sorry) what I saw in the hospital could never compare to hardships in college where ppl felt like they had FOMO or creating relationships, etc. I don’t want to invalidate anyone’s feelings because I also share similar ones, but the main problem and what will always stick with me comes from the actual symptoms & outcomes of people who I cared for. It seems selfish to me to focus on first world problems (like hardships with college + covid) when millions have died and lack adequate healthcare.", "author": "arinspeaks", "created": 1627848332, "upvotes": 9}}}