{
  "sid": "qcg3y1",
  "link": "/r/CollegeRant/comments/qcg3y1/sent_in_my_complaint_tonight/",
  "title:": "Sent in my complaint tonight...",
  "text": "\"I've taken several English classes at \\[NAME REDACTED\\], and all the teachers I've had are kind and amazing people who work very hard. I appreciate them immensely. There's a \"but\" coming though, and though it does not invalidate my prior statement, I have noticed a reoccurring theme in every English class I've taken in that we are constantly—constantly—reviewing fundamental writing mechanics that should have been learned and internalized years ago.\n\nPart of the learning process is repetition, I understand, but for most of us coming from public schooling, we're introduced to and taught the mechanics behind academic essay writing from around fifth grade and up, if not sooner. In ENG 111 I can understand and sympathize with the need to review concepts and catch everyone up to the same level of writing proficiency, such as those who were homeschooled, or had other special circumstances, but what I do not understand is the need for it to continue in higher level English classes. Using valuable class time to go over things like the mechanics behind writing a proper paragraph, or what an effective thesis statement is, to put it frankly, is a waste.\n\nDuring the Corona Pandemic, things have slowly started spiraling out of control for those in the workforce—especially for those of us in the service industry, many of whom, like me, are college students here at \\[NAME REDACTED\\]—and everywhere is short-staffed. As for myself, my hours have been forcibly bumped up from the twenty I signed up for to pushing forty every week, and I am physically and mentally exhausted. I requested for my hours to be reduced weeks ago, (only to go into effect as of today, if my manager is to be believed, and just between you and me, she is not) and I've done everything else I can to move my focus towards school, but if there's anything time management has taught me, it's that every second counts. And at the risk of sounding arrogant, I do not understand why I'm investing my time and money into classes that are teaching me things I already know--things I believe, (unless I am deeply mistaken, and if so, I apologize profusely for wasting the time of whosever job it is to read this) that everyone else taking the class should know as well.\n\nTo conclude this longwinded rant, and at the risk of sounding like an ignorant, entitled hypocrite, I think there is a time where the kid gloves and training wheels must come off, and anyone left wobbling wildly and wiping out on the pavement must be left to fend for themselves. These are college level English classes. My time is limited. I spent the time I should have been writing a discussion board on \"gaining a better understanding of what it takes to write a really good paragraph\" writing this complaint instead because I am simply so frustrated and burnt out that I can't bring myself to do it. It's like that time in elementary school where I walked up to my gym teacher and calmly told him I would not be doing the chicken dance each year anymore because it was demeaning, and made me feel stupid. Everyone needs to grow up sometime.\n\nPlease remove the training wheels from the higher level English classes. That is all.\n\nThank you for reading this, and to those for whom it may concern, I also apologize for any unintended rudeness or offense,\n\n\\[NAME REDACTED\\]\"\n\nI'm terrified. Please tell me I did the right thing.\n\nEdit: TL;DR: Please remove the training wheels from the higher level English classes. That is all.",
  "author": "TSOHG-A-MA-I",
  "created": 1634779279,
  "updated": 1634849397,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.65,
  "comments": {
    "hhg5bqc": {
      "link": "/r/CollegeRant/comments/qcg3y1/sent_in_my_complaint_tonight/hhg5bqc/",
      "text": ">Please remove the training wheels from the higher level English classes. That is all.\n\nBelieve me when I say that most (if not all) professors who teach cores (not just English) would *love* to do this, but the fact of the matter is students (in the US), on average, for the past decade or so have been coming into higher education without having mastered the necessary prerequisites. The pandemic freshman/sophomores are especially bad (through no fault of their own) when it comes to this because the sick joke that is American high school education has only been exacerbated with half-assed virtual education.\n\nSadly, this probably won't change for a long time (if ever), because of how capitalized education works. Institutions needs tuition to keep facilities running, so administration \"encourages\" lowering the bar as much as possible to keep otherwise underprepared students paying tuition. It's been a long-lamented issue among those who work in higher education and it will, likely, continue to be so for the years to come.",
      "author": "Sezbeth",
      "created": 1634785864,
      "upvotes": 7,
      "replies": {
        "hhg6bcm": {
          "link": "/r/CollegeRant/comments/qcg3y1/sent_in_my_complaint_tonight/hhg6bcm/",
          "text": "It’s just soul crushing tbh. I’m tired. They keep it up and unprepared students aren’t going to be the tuition payers they need to worry about losing…",
          "author": "TSOHG-A-MA-I",
          "created": 1634786367,
          "upvotes": 1,
          "replies": {
            "hhg7a14": {
              "link": "/r/CollegeRant/comments/qcg3y1/sent_in_my_complaint_tonight/hhg7a14/",
              "text": "I understand and, to some extent, I agree, but the students that actually make it are the least of the concerns when it comes to retention. For students who feel that they want to move faster, it's always encouraged to seek enrichment (honor's courses, extracurricular research, etc.) and they most often do. \n\nWhile students of all levels are typically bundled up into one cohort for the core classes, they are eventually separated through things like \"weed-out courses\" once their junior years come around. The underprepared students are usually funneled into \"alternative concentrations\" or \"easier\" majors. \n\nThink of your cores as a way to smooth out some foundations. It gets annoying and tedious at first, but you can spice things up a bit if you want. Either way, it gets more interesting down the line once you start moving into your desired field.",
              "author": "Sezbeth",
              "created": 1634786863,
              "upvotes": 1,
              "replies": {
                "hhg9sjt": {
                  "link": "/r/CollegeRant/comments/qcg3y1/sent_in_my_complaint_tonight/hhg9sjt/",
                  "text": "Unfortunately, I’m at a very basic community college for most of my classes at the moment. There’s little in the way of “enrichment.” I’m in the process of transferring to a 4 year university, but yeah… God, I just wish something could be done about the education issue. I feel bad. I’m an older student, so I guess my perspective is a little warped. But obviously I have a lot of younger friends, and I thought it was so strange how so many of them were losing their sh*t with essays… why is this *happening*?",
                  "author": "TSOHG-A-MA-I",
                  "created": 1634788225,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}