{"sid": "l5fy1e", "link": "/r/CollegeRant/comments/l5fy1e/i_cant_believe_im_spending_the_entirety_of_my_1st/", "title:": "i can’t believe i’m spending the entirety of my 1st year experience ONLINE", "text": "I’m so sick of this setting. Never got to walk on graduation day, never attended prom, never had my first year college experience and never made meaningful college friendships this year. I FEEL ROBBED. Now 2nd sem just started for us yesterday and up until now I never had to attend any of my classes since our school’s online portals have not been finalized even though they have officially announce when school starts months ago. I feel robbed emotionally, spiritually and financially this year ✋🥲", "author": "xLeviosa", "created": 1611674012, "retrieved": 1632843410, "over_18": false, "upvotes": 55, "upvote_ratio": 0.94, "comments": {"gktwe1l": {"link": "/r/CollegeRant/comments/l5fy1e/i_cant_believe_im_spending_the_entirety_of_my_1st/gktwe1l/", "text": "Thank you u/xLeviosa for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1611674013, "upvotes": 1}, "gkv06jz": {"link": "/r/CollegeRant/comments/l5fy1e/i_cant_believe_im_spending_the_entirety_of_my_1st/gkv06jz/", "text": "Could be worse, my freshman year I had 15 cops come to my room and 2 roommate changes and 3 of my 7 other suite mates dropped out", "author": "fox-foodz", "created": 1611690888, "upvotes": 0}, "gkullon": {"link": "/r/CollegeRant/comments/l5fy1e/i_cant_believe_im_spending_the_entirety_of_my_1st/gkullon/", "text": "you’re not alone, i feel the exact same, i was robbed as well of the ending of my senior year of high school, got an online graduation, no prom/end of year celebrations or parties, and I’m also a first year college student, all the best we can do is roll with it until situations improve, hang in there 😔", "author": null, "created": 1611684923, "upvotes": 5}, "gku2ecf": {"link": "/r/CollegeRant/comments/l5fy1e/i_cant_believe_im_spending_the_entirety_of_my_1st/gku2ecf/", "text": "Sameeeee(◞‸◟)", "author": null, "created": 1611676721, "upvotes": 7}, "gktx5so": {"link": "/r/CollegeRant/comments/l5fy1e/i_cant_believe_im_spending_the_entirety_of_my_1st/gktx5so/", "text": "Our daughter constantly feels the same way.\n\nNo banquet, awards ceremony, graduation event, freshman orientation, college sporting event outings.\n\nHer unused prom dress STILL hangs on the outside of her closet door, unused, still in the David's Bridal bag, because of how much this virus has ruined this year's experiences.", "author": "Lostarchitorture", "created": 1611674372, "upvotes": 6}}}