{
  "sid": "k5j0cv",
  "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/",
  "title:": "Does anyone else get nervous when it takes professors a while to grade?",
  "text": "I have a couple of assignments for different classes that haven't been graded and it's making me a little anxious.\n\nI have an essay that we submitted about a month ago worth 10% that hasn't been graded yet, but smaller assignments for the class have been. Usually the turn around for essays is quicker so I'm like, \"Oh no something is wrong\".\n\nI have a programming assignment that was submitted almost two weeks ago and I haven't gotten a grade back yet, also worth a lot, but a smaller project got graded within an hour of submitting it.\n\nI know with the thanksgiving break and professors trying to tie up loose ends etc. theres probably a massive backlog but I just wanted to check in and see if anyone else has a similar experience.",
  "author": "designingwoman",
  "created": 1606944924,
  "over_18": false,
  "upvotes": 39,
  "upvote_ratio": 0.97,
  "comments": {
    "gekrf33": {
      "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gekrf33/",
      "text": "One of my classes we get the test marks back but not assignments. I'm so nervous for the final because I have so little to go on, I don't know where I stand. Usually I calculate it beforehand like, I need 73.6% on this final to get the minimum grade I went for the class, or something like that. But I can't do that. This entire semester, I've only gotten marks back for 25% of the course, and going into a final worth 30%. That other 45% is going to make a significant difference but I have no idea what it is.",
      "author": "FirestFox",
      "created": 1607070294,
      "upvotes": 2,
      "replies": {}
    },
    "gei2bw0": {
      "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gei2bw0/",
      "text": "Ikr how are you suppose to know if you want to withdraw or not",
      "author": "fruithat123",
      "created": 1607014528,
      "upvotes": 3,
      "replies": {}
    },
    "gegmoe1": {
      "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gegmoe1/",
      "text": "Dude I’ve turned in like 4 papers since the start of the semester and still no grade. I’m set to graduate this semester so I hope this professor doesn’t try to pull a fast one.",
      "author": "BlkGirl181",
      "created": 1606975409,
      "upvotes": 3,
      "replies": {
        "gehmmw8": {
          "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gehmmw8/",
          "text": ":O I would be freaking out, damn. I wish you the best of luck and early congrats on graduating :)",
          "author": "designingwoman",
          "created": 1607006705,
          "upvotes": 2,
          "replies": {
            "gelj5e2": {
              "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gelj5e2/",
              "text": "Thank you! I’m trying not to worry; he has a lot to grade. My fellow classmates said they’ve wrote like 10+ page reports so he’s probably very overwhelmed rn.",
              "author": "BlkGirl181",
              "created": 1607092102,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gegc6bc": {
      "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gegc6bc/",
      "text": "Yep. One class I have stuff from months ago not graded and it’s driving me nuts",
      "author": "PhoenixAzalea19",
      "created": 1606968245,
      "upvotes": 3,
      "replies": {}
    },
    "geg86m6": {
      "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/geg86m6/",
      "text": "I’ve had similar experiences.   \nI submitted an assignment on September 6. My professor still hasn’t graded it.    \nIn another class (taught by a different professor), I submitted a quiz on November 1. My professor hasn’t graded this quiz.    \nIt sucks because I’ve waited 3 months for one assignment to be graded, and 1 month for a quiz to be graded. I submitted the test and quiz before the due date. It’s disappointing when I have to wait a long time to receive my grades.",
      "author": "Fleur498",
      "created": 1606965882,
      "upvotes": 3,
      "replies": {}
    },
    "geg2ydm": {
      "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/geg2ydm/",
      "text": "You echoed my current thoughts exactly. I handed something in awhile ago that I got an extension for (so it's only my paper she has to mark cause everyone else's is long since finished) and I haven't heard anything. Now the paranoia is setting in: did I do SO bad that the prof is trying to figure out how to break the news to me? Are my cited sources super shady and she has to do an extensive check? Did I somehow send in the wrong document? God help us all",
      "author": "snowytigers",
      "created": 1606962944,
      "upvotes": 3,
      "replies": {}
    },
    "gefndyy": {
      "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gefndyy/",
      "text": "I don't know any of the grades for any of my classes yet the school is administering their grading option (it either affects your GPA or is listed as pass fail). I wanna input my choice but I wanna know what I got in the courses before making the decision",
      "author": "vness1213",
      "created": 1606954904,
      "upvotes": 3,
      "replies": {}
    },
    "gef841m": {
      "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gef841m/",
      "text": "Yes! I have one class I don’t know my grade in, and we are in finals right now and I have everything done for the class. I need it for licensure (a C or better). Yikes!",
      "author": "torileighxvl",
      "created": 1606947587,
      "upvotes": 3,
      "replies": {}
    },
    "gef60sh": {
      "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gef60sh/",
      "text": "I feel the exact same way. I submitted a big report last month (which counts for 25% of our grade). The final exam is next week and we still haven't gotten it back. So that's stressful :)",
      "author": null,
      "created": 1606946622,
      "upvotes": 4,
      "replies": {
        "gef6uqn": {
          "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gef6uqn/",
          "text": "I would be stressed out too! yikes! My final paper is worth 30% so I'd kind of like to know where I'm at now with everything because we submit the final paper on the very last day of school.",
          "author": "designingwoman",
          "created": 1606947002,
          "upvotes": 3,
          "replies": {
            "gef7kna": {
              "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gef7kna/",
              "text": "Same here lol. I know that some professors have TA's mark assignments, so I wonder if they TA's are a bit behind. Either way, it sucks big time. I hope you did well on your assignments and good luck on the final paper! I'm sure you'll do great :)",
              "author": null,
              "created": 1606947340,
              "upvotes": 1,
              "replies": {
                "gef7xi3": {
                  "link": "/r/CollegeRant/comments/k5j0cv/does_anyone_else_get_nervous_when_it_takes/gef7xi3/",
                  "text": "Thank you, best of luck to you too! :)",
                  "author": "designingwoman",
                  "created": 1606947501,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634063333
}