{
  "sid": "i8dxt2",
  "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/",
  "title:": "Who in the hell makes final and midterm projects due in the middle of the day in summer?",
  "text": "Like, I get making finals due at a certain time during a proper designated finals week with a designated time. I get making midterms due in the middle of the day if you’re in person or synchronous online. But who in the fuck makes a final essay – which is supposed to be a minimum of 8 fucking pages – due in the middle of the day in *summer*???? People are still traveling because it’s summer and they can’t control what their family wants!!! People have jobs so that they can’t work on essays during the day, and by night, they’re too exhausted to do both our *normal* assignment *and* our final essay. It’s almost impossible to keep up because he wants so much and it’s like, dude, just fucking make it due at midnight, and you’ll get papers that reflect what we’ve learned, not something that we haphazardly threw together because of your fucking demands. Like, seriously!!! It’s one thing to make it due at midnight, I don’t care about that, and it’s one thing to make a test due at class time when there *is* a set class time, but when it’s a work at your own pace???? The fuck???? Why can’t it be due at midnight, or 11 pm, or hell, **9** pm????\n\nAnd what makes it even more infuriating is I have two professors this summer semester, and one of them is doing great. In fact, I’d almost say his assignments are harder, and they certainly are time-wise, but far more manageable. Our final and midterm essays were clearly outlined by him, and he said that he only wanted 5-6 paragraphs and made the papers be due at midnight. It’s workable. But this other prof, who has the *audacity* to request a minimum of *8 pages* gives us less than enough time to actually write it and makes it due in the middle of the day!!!! It’s not even a class for majors only, so idk what the hell he’s trying to do, make people not want to major in this subject????\n\nAND besides that, he either never responds to emails or he takes ten years to respond and by the time he’s responded to your time-sensitive email, you’ve already worked around it and threw something haphazard together. What a fucking asshole, and I have to take him again in the fall (I didn’t fail this class, I just have to take another major requirement which he teaches). And!!!! It’s the same situation!!!! Online, work at your own pace, finals and midterms due at 2 fucking pm",
  "author": null,
  "created": 1597239682,
  "over_18": false,
  "upvotes": 52,
  "upvote_ratio": 0.82,
  "comments": {
    "g1hkg1f": {
      "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1hkg1f/",
      "text": "Some professors have weird deadlines. I understand that professors can set deadlines for whenever they want, as long as the deadline is after the class starts and before the class ends. For example, if I took a fall semester class (August-December), a March deadline for an assignment would make no sense.   \nI have a bachelor’s degree. In college, I had a professor with some strange deadlines, and I had to plan for her deadlines. The class was an education class on Tuesdays/Thursdays from 9:30-10:45. Some of her assignments were due on Wednesdays at 9:30 AM, even though we didn’t have class on Wednesdays. Some other assignments were due at 9:30 AM on Tuesdays or Thursdays, but she wouldn’t grade them before they were due (regardless of how early we submitted them), and we never used any of the assignments in class activities or class discussions. I never understood what the point was of having assignments due before class if she wasn’t going to read the assignments before class or incorporate the assignments into her instructional materials for the day.",
      "author": "Fleur498",
      "created": 1597440558,
      "upvotes": 3,
      "replies": {
        "g1j8fl9": {
          "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1j8fl9/",
          "text": "Thank you. I’m not bad with most essays that I’ve had (before I changed my major, I was an English major so I had a lot of essays to write) and it was easy to keep up with and easy for me to turn in, and for all but one of my essay professors before this guy, they kept up with their grading with ease and got our grades back to us at a reasonable time. His was just really hard to plan for because it sounded like he wanted everything we covered, and he didn’t want an outline or anything, just 8-12 pages. I got it done and I did well, I was just very frustrated because it seemed so weird to me to have a 2 pm deadline which caused some students to receive incompletes instead of just making the deadline a little later in the day",
          "author": null,
          "created": 1597470868,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "g1gwa22": {
      "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1gwa22/",
      "text": "are you.... writing the essay the day it’s due? moving up the deadline a couple hours wouldn’t be a problem if you started working on it earlier- aka how you are supposed to write an essay",
      "author": "archilochus4875",
      "created": 1597429614,
      "upvotes": 2,
      "replies": {
        "g1gxxqr": {
          "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1gxxqr/",
          "text": "I’ve done it before and gotten As, but also, I spent two days traveling and when I wasn’t traveling, I was working on the other essay I had to do. Y’all act like I’m not allowed to rant, I literally just wanted to complain about my professor",
          "author": null,
          "created": 1597430302,
          "upvotes": 0,
          "replies": {
            "g1h9mkl": {
              "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1h9mkl/",
              "text": "you posted your rant, congratulations, no one stopped you. we aren’t allowed to comment anything other than “oh you poor thing, what a monster this prof must be”??\n\noh and also- “the audacity to assign an 8 page paper”? you mean how dare your professor have completely reasonable requirements for their college class? it’s not daycare.",
              "author": "archilochus4875",
              "created": 1597435497,
              "upvotes": 1,
              "replies": {
                "g1hsgl4": {
                  "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1hsgl4/",
                  "text": "I’m getting lectures that I got from my parents, I really fucking don’t want to hear it again from random ass strangers.\n\nAnd also the audacity thing is because the fucking asshole couldn’t keep up with grading. It’s not a reasonable assignment if he can’t keep up with grading his class’s normal assignments that don’t have a time limit for him to turn in. It’s a reasonable assignment for a professor who grades the assignments immediately and has shown themselves to be on top of their job, not for a professor who lets all the grading pile up. Completely reasonable for that kind of professor is not an 8 page essay, it’s a short essay or a multiple choice exam",
                  "author": null,
                  "created": 1597444598,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g1ale3h": {
      "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1ale3h/",
      "text": "Wait didn’t you choose to take a summer class?",
      "author": "picklepepper1",
      "created": 1597291701,
      "upvotes": 3,
      "replies": {
        "g1an3bh": {
          "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1an3bh/",
          "text": "I changed my major back in the spring and was behind on major requirements, so if I wanted to graduate on time, I needed to take these courses this summer",
          "author": null,
          "created": 1597292838,
          "upvotes": 0,
          "replies": {
            "g1cw9k0": {
              "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1cw9k0/",
              "text": "If you willingly chose to take these classes for a major, the professor is allowed to do whatever they would like. They could make it due at 9am for all I care.",
              "author": "picklepepper1",
              "created": 1597345049,
              "upvotes": 3,
              "replies": {
                "g1gyn4o": {
                  "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1gyn4o/",
                  "text": "They were required classes, I legitimately could not opt out of these courses, and the professor I’m complaining about is the only one who teaches that class and the class that follows it. I literally had no choice, despite what you may think",
                  "author": null,
                  "created": 1597430595,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g19vr6l": {
      "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g19vr6l/",
      "text": "So you’d rather the professor work around your schedule is what your saying. Like I get it being in the middle of the day is annoying but is it really any different to having it done later on that day. It should be done regardless and not done at the last minute. Family vacations and what not aren’t important to that professor and it’s your responsibility to have the work in. You signed up for the summer semester.",
      "author": "spoiled_sandi",
      "created": 1597277404,
      "upvotes": 5,
      "replies": {
        "g1a1ppr": {
          "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1a1ppr/",
          "text": "How difficult is it to make an assignment due at midnight or 11 pm instead of the middle of the day? It makes no sense to do it in the middle of the day, and if we’re keeping up with other assignments, we can’t do the essay. I did the work, but I’m allowed to be mad about it",
          "author": null,
          "created": 1597280531,
          "upvotes": 3,
          "replies": {
            "g1aathr": {
              "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1aathr/",
              "text": "Well, what if the professor wants to grade that afternoon/evening because of his own schedule?",
              "author": "Calligraphee",
              "created": 1597285431,
              "upvotes": 4,
              "replies": {
                "g1afv55": {
                  "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1afv55/",
                  "text": "He could make the essays shorter so that we can manage it better and actually accomplish that with significantly less difficulty",
                  "author": null,
                  "created": 1597288274,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g1ag05l": {
              "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1ag05l/",
              "text": "Well turn it in the day before not the day of the due date. I would think the professor gave it two weeks in advance or a week in advance and you won’t have to worry about it being due in the middle of the day. Get a schedule together and get your priorities in order. Seeing as you claim people have summer vacation and stuff like that. This is college, they’re not gonna baby you because you wanna wait till the last minute to turn in an essay It’s that simple.",
              "author": "spoiled_sandi",
              "created": 1597288357,
              "upvotes": 4,
              "replies": {
                "g1anxrh": {
                  "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1anxrh/",
                  "text": "Am I literally not allowed to rant on r/collegerant??? Is that not allowed??? I’ve had great time management with both classes except for a fucking 8 page paper with descriptive examples, and I know for a fact this prof is terrible with time management, so it makes no sense that we have to write an 8 page paper if he can’t keep up with our discussions. Just because I rant doesn’t mean that I didn’t do the thing, it means that I’m tired and annoyed and stressed so I’m complaining because I have a right to complain. I would gladly have taken a different prof but he’s the only one, and he sucks. Other people with my major say so. I had someone recommend someone other than him but there is no one else. He sucks. He has worse time management than all of us. And did you not see the part where he has to issue more than one incomplete grade because he didn’t make a manageable due date time.\n\nOh also, forgot to mention the part where, even if someone had finished their assignment early and wanted to turn it in to help him get ahead in grading, he made the due date last year until he changed it last night. It’s on him, I don’t want lectures, I just want to rant",
                  "author": null,
                  "created": 1597293426,
                  "upvotes": -1,
                  "replies": {
                    "g1avhtz": {
                      "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g1avhtz/",
                      "text": "First of all from what I saw from the original was that you didn’t wanna do it because it was to difficult and because according to you, “people are traveling because it’s summer and have jobs.” There are people out here that do ten pages for final exams and midterms. Have a full time job and so full time schooling. Yea it’s a bitch but you signed up for college so it is what it is. It can be done you just have to put in the time and have good time management. Second of all nobody said you couldn’t rant but we’re allowed to put our opinions and experience to because it may help someone. Now because you don’t wanna hear what we have to say that’s on you. Third of all if you had good time management you wouldn’t have made the post for an 8 page essay bruh. This is coming from someone whose written 45+ pages in one semester and doesn’t have great time management skills but made it through my freshman year of college.",
                      "author": "spoiled_sandi",
                      "created": 1597299235,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g19pz41": {
      "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g19pz41/",
      "text": "So would you prefer if the professor made them due at midnight the day before?",
      "author": "danielfletcher",
      "created": 1597274440,
      "upvotes": 3,
      "replies": {
        "g19rx56": {
          "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g19rx56/",
          "text": "No, I’d rather him either shorten the assignment or make it due later in the day. Literally just read the rant, I mentioned that several times, and this prof has to issue a lot of incomplete grades because he didn’t take travel into account and people can’t finish on time",
          "author": null,
          "created": 1597275441,
          "upvotes": 1,
          "replies": {
            "g19s0np": {
              "link": "/r/CollegeRant/comments/i8dxt2/who_in_the_hell_makes_final_and_midterm_projects/g19s0np/",
              "text": "k",
              "author": "danielfletcher",
              "created": 1597275491,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062057
}