{
  "sid": "ptaqu0",
  "link": "/r/CollegeRant/comments/ptaqu0/engineering_students_brag_about_having_it_harder/",
  "title:": "Engineering students brag about having it harder because it actually is harder for them",
  "text": "Engineering has a higher drop out rate than most other majors, and it isn’t because engineering students are more lazy. In most schools, the engineering school is separate and student who get in are better than average yet switch majors at a higher rate. Engineering majors literally have to take more classes than any other major. Pretending engineering isn’t harder is just ignorant.",
  "author": "ja79732723",
  "created": 1632326806,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.24,
  "comments": {
    "hdvf4hc": {
      "link": "/r/CollegeRant/comments/ptaqu0/engineering_students_brag_about_having_it_harder/hdvf4hc/",
      "text": "Snoo, your parents paid a lot of extra money so you could live in the dorms. I assume you wanted to move out because you thought it would be easier to make friends living in the dorms, which probably is true. But you need to spend your time interacting with people in real life. \n\nReddit is like your security blanket or your teddy bear. It’s OK to do a couple of these bullshit spam posts each day but you need to prioritize socializing in the real world. You can and you will make friends if you put in the effort. Did you contact the counseling center about the socialization group? I really think you should.\n\nNow get out there and fucking talk to someone and don’t come back here until you have spoken to five real live people. NOW GO DO IT.",
      "author": "readytogybe",
      "created": 1632333908,
      "upvotes": 6,
      "replies": {}
    },
    "hdv9m5u": {
      "link": "/r/CollegeRant/comments/ptaqu0/engineering_students_brag_about_having_it_harder/hdv9m5u/",
      "text": "Snooroar, this is INTELLECTUAL SMALL DICK ENERGY.\n\nFucking stop spamming your intellectual insecurity all over Reddit.",
      "author": "readytogybe",
      "created": 1632331692,
      "upvotes": 7,
      "replies": {}
    },
    "hduz09h": {
      "link": "/r/CollegeRant/comments/ptaqu0/engineering_students_brag_about_having_it_harder/hduz09h/",
      "text": "Not this again, David. Didn't sourdough show you that fewer students change from engineering than from other courses?",
      "author": "SultanofShit",
      "created": 1632327392,
      "upvotes": 14,
      "replies": {
        "hdv14bi": {
          "link": "/r/CollegeRant/comments/ptaqu0/engineering_students_brag_about_having_it_harder/hdv14bi/",
          "text": "LOL what is the context behind this comment",
          "author": "fruitninja777",
          "created": 1632328248,
          "upvotes": 6,
          "replies": {
            "hdv1k8j": {
              "link": "/r/CollegeRant/comments/ptaqu0/engineering_students_brag_about_having_it_harder/hdv1k8j/",
              "text": "OP is a relentless spammer who has been sitewide banned on over 150 accounts and keeps making new alts.\n\nLast academic year he was doing online and spammed reddit 16 hours a day instead of studying, for some reason he's finding his classes difficult now.",
              "author": "SultanofShit",
              "created": 1632328429,
              "upvotes": 13,
              "replies": {}
            },
            "hdvjmsg": {
              "link": "/r/CollegeRant/comments/ptaqu0/engineering_students_brag_about_having_it_harder/hdvjmsg/",
              "text": "OP keeps spamming with his made up stats and I’ve corrected him countless times, but it falls on deaf ears. He’s also confused about changing majors vs. flunking out and calls it all flunking out or dropping out. He has a narrative he’s pushing for some reason. Like “engineering majors literally have to take more classes than any other major” isn’t true if all students need the same number of credits to graduate. It’s just not true!!\n\nHere’s an article with some stats about changing majors - most students do! It’s more normal to change than it is to stick with what you start with at age 18. It’s a few years old but I don’t imagine this years batch of new students is any different than a few years ago. \n\nhttps://borderzine.com/2013/03/college-students-tend-to-change-majors-when-they-find-the-one-they-really-love/",
              "author": "sourdoughobsessed",
              "created": 1632335735,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634063884
}