{"sid": "m06gtc", "link": "/r/CollegeRant/comments/m06gtc/online_school_may_be_the_final_boss_of_my_college/", "title:": "Online school may be the final boss of my college career.", "text": "This semester I’m taking c++ programming, bio 112 and calculus while working. How am I supposed to litterally teach myself 80% of what I need to know and not have massive holes? So far my grades are okay, I think around the low A mark, but I don’t think I am understanding anything. I’m just waiting for a test to come around and totally end my whole semester. This is almost the end of my associates degree and I have absolutely 0 idea what I’m gonna do. I think I’m a little bit smart, but I feel like I’m not smart enough to do anything I want to do. I’m a hard worker, but sitting down and doing any homework with any fervency is really really hard for me. I’m so discouraged and depressed I have no idea what I’m gonna do... maybe I’ll close my eyes and pick something random... \n\nTL;DR online college is leaving me with a crappy education and no hope for the future.", "author": "blazikenxoxo", "created": 1615173150, "retrieved": 1632842831, "over_18": false, "upvotes": 210, "upvote_ratio": 0.99, "comments": {"gq679u1": {"link": "/r/CollegeRant/comments/m06gtc/online_school_may_be_the_final_boss_of_my_college/gq679u1/", "text": "Thank you u/blazikenxoxo for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1615173150, "upvotes": 1}, "gq8xibi": {"link": "/r/CollegeRant/comments/m06gtc/online_school_may_be_the_final_boss_of_my_college/gq8xibi/", "text": "I feel the same in a way, before pre-Covid I fell into a hardcore depression which lasted about a full yr and a half, before that it was medium depression (I’m doing a bit better now), but everything has just been so crazy along with the world moving quickly. I personally think most students should have just taken a break from school during this time because I was forced to take classes during COVID and that made my depression worse along the side of 3 people I knew passing away 3 months in a row, shit was hard. I don’t like school and I try to find a way to make myself happy when I learn. I just didn’t have that experience at all and was always drowned in school work and anxieties from quizzes and tests. Honestly fuck school. But hey I’m almost finished graduating and now I’m being forced to stay 3 more semesters because of an opportunity in teaching. I don’t want to teach or become a teacher assistant and I probably won’t. Sometimes it’s just so god dam hard when ur stuck with parents during the pandemic", "author": "Your_Royal_Highness1", "created": 1615233307, "upvotes": 1}, "gq8327q": {"link": "/r/CollegeRant/comments/m06gtc/online_school_may_be_the_final_boss_of_my_college/gq8327q/", "text": "Dude I had to take a break from online school. It started with me being on the Dean’s list to me failing a class. I had to take a break from screens and recuperate. I’m starting back for summer semester but holy shit I hope I have a Covid vaccine so I can be in person because I can’t take online anymore", "author": "WhyY_196", "created": 1615220441, "upvotes": 4}, "gq6uaya": {"link": "/r/CollegeRant/comments/m06gtc/online_school_may_be_the_final_boss_of_my_college/gq6uaya/", "text": "I feel you so had. I haven't been able to focus more than an ounce since week 2 of the quarter, so like January? It is inconceivably stupid that people can actually expect anything academically out of students at the moment.\n\nIf I somehow magically dont fail this quarter, I'm saying fuck it and waiting it out till we're back in person.\n\nYou're not alone in your utter confusion and lack of ambition.", "author": "Floppy_Onion", "created": 1615189746, "upvotes": 3}, "gq6mdal": {"link": "/r/CollegeRant/comments/m06gtc/online_school_may_be_the_final_boss_of_my_college/gq6mdal/", "text": "I feel you man. You definitely aren't the only one feeling this way. I am a first year college student and also taking C++ programming (along with several other courses). Doing not too bad *so far,* but I breakdown almost weekly thinking about the amount of work I have to do - at least 2 quizzes, a three-hour lab, and at least 6 assignments due every week - not to mention I have almost zero motivation and have to self-teach. You mentioned that you were thinking about a CS minor and as a CS major myself, I am struggling with C++. My midterm for it is in 2 days as well and I am just waiting for it to all crash down on me. I really respect you for even exploring a bit in a field that differs vastly from your intended major. I can't give you an exact solution for your predicament but so far what has helped me (temporarily) is just finding a quiet place and listening to music (especially ones I haven't listened to before) while doing my work. It's really important to take breaks when you need and hydrate yourself! Good luck man.\n\nAlso since you are just thinking about a minor in CS or learn to code a bit, I'd suggest to not torture yourself with college CS courses and just learn coding in your own time. There's a lot of Youtube videos with pretty good coding tutorials (you'll have a lot more freedom in what you create!) and covers a lot of the basic to intermediate-level CS concepts (which I'd believe are the same level covered by CS minor).", "author": "Familiar-Course-6737", "created": 1615182893, "upvotes": 3}, "gq6helv": {"link": "/r/CollegeRant/comments/m06gtc/online_school_may_be_the_final_boss_of_my_college/gq6helv/", "text": "Keep your head up! This is exactly how I felt my last semester of community college, and I've been out of high school since 94. Bravo Zulu to you and others that dare take on advanced math and science courses, it's not easy by any means!", "author": "orangeblackteal", "created": 1615179303, "upvotes": 7}, "gq6f45c": {"link": "/r/CollegeRant/comments/m06gtc/online_school_may_be_the_final_boss_of_my_college/gq6f45c/", "text": "Yea I know how you feel. Before COVID I was totally fine with my classes, even though they were somewhat difficult. \n\nBut the kicker is that when COVID started I was taking 2nd year courses and now I’m taking 4th year courses. I feel like I have to teach myself about 90% of the coursework and the professors are just like “here’s your assignment: I included a list of links you can use to help complete it. Let me know if you need help via email or office hours. It’s due next week. Bye”", "author": "QuickCoyote097", "created": 1615177837, "upvotes": 31}, "gq69cf9": {"link": "/r/CollegeRant/comments/m06gtc/online_school_may_be_the_final_boss_of_my_college/gq69cf9/", "text": "C++ and bio? What the hell are you studying?", "author": "-boredMotherFucker", "created": 1615174357, "upvotes": 46}}}