{"sid": "o5dj2y", "link": "/r/CollegeRant/comments/o5dj2y/anybody_else_have_a_class_where_the_tests_dont/", "title:": "Anybody else have a class where the tests don't match the test content?", "text": "I chose a 3000 level course thinking it'd be the easiest one out of all my classes, considering they're 4000+. It turns out it's an absolute nightmare.\n\nWe have 3 assignments per week. That's not bad at all. One is a discussion board worth 8 points, one is a McGraw-Hill assignment where you answer like 50 questions (you get a 100 if you turn it in by the due date) worth 10 points, the last is a test worth over 100 points. \n\nI just finished the 2nd test and got a 79, on the first test I got an 80. On the test, 90% of the material have no connection with the McGraw-Hill content, and the lectures the teacher provides are generalized, so they're quick with not a lot of information. I literally studied more for this last test than the first one, I even re-read the two chapters covered multiple times AND did an outline, all of which I did not do the first test, and performed *worse*.\n\nRate my professor has students complaining about this exact same issue, even going years back. \n\nAnybody else relate to this?", "author": "Livelordx_lol", "created": 1624333503, "retrieved": 1632949659, "over_18": false, "upvotes": 20, "upvote_ratio": 1.0, "comments": {"h2p350b": {"link": "/r/CollegeRant/comments/o5dj2y/anybody_else_have_a_class_where_the_tests_dont/h2p350b/", "text": "Yes, my biology professor last semester had some random tidbits thrown in on his tests. Even one of my math profs did this where some homework assignments had questions that were part of the next chapter - I think in this case the prof was trying to see if we could work it out to test our problem solving skills.", "author": "Crochitting", "created": 1624396469, "upvotes": 3}, "h2mjsfi": {"link": "/r/CollegeRant/comments/o5dj2y/anybody_else_have_a_class_where_the_tests_dont/h2mjsfi/", "text": "I’m convinced that it’s some “gotcha” type shit that every professor pulls out of their asses as some sort of sick comical relief.\n\nThey be pulling this shit with only two tests and every year, you have the three people who are panicking in the GC crying for mercy. The rest are either dead, dying or dropped. Those who made it past a D are welcomed into the halls of Valhalla. The rest are sent to the deepest pits of hell wagering their grade appeal and pleading for a chance to be heard by the people who spend college tuitions on private islands and expensive cruises while you go broke. \n\nThis shit is like do or die. I hate it. Subscription services have saved me. **Collegeboard is a fucking scam. They owe me my AP credits that my college doesn’t fucking accept. Fucking hell. Passing an AP class isn’t enough. Gotta pass a dumb test. Even if you pass that, you still don’t get credit and if you do, it’s under electives?? WTF.** I’d elect myself to ass whoop whoever thought that was a good idea. You owe me money damn it.\n\nI relate.", "author": "majoroofboys", "created": 1624344148, "upvotes": 11}}}