{"sid": "np74f2", "link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/", "title:": "I'm scared of my internship", "text": "I'll have to move for it and that scares me because I've been living with my parents for the past year after suffering horrible anxiety and depression and now, I got to live alone again in another state and drive a car and everything. I'm scared that I'll mess up and do everything wrong or that I'll get to work late or stuff because it's like a 30-minute drive and anything can happen. Plus, what if I get my internship wrong and that just invalidates it? I already spoke to my professor and he says it's cool but I'm still scared as heck that I might mess up the procedure. It shouldn't be too hard but if college has taught me anything, it's that a lot of things are stupidly designed.\n\nI'm sorry, I just needed a place to vent. College has left me with horrible anxiety about life in general and I'm already in my final year so I can't exactly back out. I also mess things up a lot and am forgetful and being socially awkward has not made anything easier. Again, I'm sorry.", "author": "HJSDGCE", "created": 1622477886, "retrieved": 1632950365, "over_18": false, "upvotes": 185, "upvote_ratio": 0.97, "comments": {"h04uood": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h04uood/", "text": "You worry too much. Wake up and leave early, pay attention and do your job, it isn't difficult.", "author": "orangeblackteal", "created": 1622503803, "upvotes": 1}, "h04u7nv": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h04u7nv/", "text": "You got this, I believe in you ❤️❤️", "author": "jolsone", "created": 1622503542, "upvotes": 3}, "h04p4a3": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h04p4a3/", "text": "If waking up is an issue get an app called alarmy.  It is loud as fuck and you can set it to make you do math, or shake your phone, or scan a bar code, or take a picture of something to turn off.", "author": "Alistair_TheAlvarian", "created": 1622500718, "upvotes": 2}, "h04dtje": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h04dtje/", "text": "I suffer from anxiety too and I start mine soon and it’s an hour away and I feel the same way <3", "author": "snickergoldendoodles", "created": 1622494771, "upvotes": 3}, "h04ahzq": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h04ahzq/", "text": "Here's what you do: \nBreak it all down, every step, and add \"if, then\" statements wherever something can go wrong. As for driving 30 minutes, Google maps from a desktop view will show you the range of time it takes to get somewhere at a given time. If the drive is 30 minutes typically at the time you leave, allowing 40 minutes should be plenty of time most days. Allow an extra 20 minutes your first week.    \n  \nGas up the car the day before.  \nCheck oil level and tire air the week before.   \n  \nIf you did what you could to prevent automotive problems, and something pops up on the road, you might just have to let your employer know you'll be delayed. That's part of the if/then plan.  \n\nBreak down any part where you feel anxiety. Practice scenarios aloud at home if needed.  \n  \nYou got this! A whole slew of changes at once it's always nerve wracking!", "author": "RoveCove", "created": 1622493075, "upvotes": 5}, "h03te3o": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h03te3o/", "text": "I suffer from anxiety as well and let me just tell you, you’re gonna be fine! It’s an internship for a reason, they don’t expect you to know EVERYTHING. You’re there to learn and help but a big emphasis on learning. When I was the new guy at work at the last firm, I was scared I would screw things up (and I kinda did LOL) but what mattered is that I asked questions. If I didn’t know something I would tell them but I would also attempt things on my own and give it a good attempt. As long as you’re being a hardworking member of the team, you’re gonna be fine.", "author": "NRevenge", "created": 1622484555, "upvotes": 6}, "h03s0nn": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h03s0nn/", "text": "Dude, I’m with you! I accepted an internship at a pretty cool company in the NW US (I’m from the SW),i felt freaking terrified when I arrived here. I miss my home, but I know that I will learn new things about myself. If this is making you scared, take that as a good thing!", "author": "DonMurray1", "created": 1622483883, "upvotes": 8}, "h03qd9p": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h03qd9p/", "text": "Do not apologize for being you.  You can do this! Even if you do make a mistake, life lessons come from those. It wouldn't be the end of the world. When you worry like this, you punish yourself needlessly ahead of time and then punish yourself again if something does go wrong. Stop punishing yourself!  Failure doesn't make you a failure. It makes you human.❤", "author": "CurioserandCurioser0", "created": 1622483086, "upvotes": 9}, "h03ptbk": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h03ptbk/", "text": "I don't know if this will help at all... but most students feel this way. Life is terrifying, but we're all just trying to pretend it's all OK. Try to breathe, use some calming techniques if you know of any.\n\nThe whole point of an internship is to learn. You will mess up. And that's ok. Your professor expects it. In fact, they may even encourage it (unless it's in a lab... then please don't forget your gloves or closed toe shoes and make sure you clean up your spills)! Definitely ask questions if you think you're doing things wrong, but also know it’s not the end of the world if things don't go as planned. \n\nGood luck!", "author": "OnlyMarsupial", "created": 1622482813, "upvotes": 27}, "h03plyo": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h03plyo/", "text": "Internships are much, much, much less stressful than the shit show that is current college education. If you are scared of forgetting, set up a lot of alarms. Give yourself plenty of time to prepare for the day and the drive before work, even if that means waking up 2 hours before work starts.\n\nRemember that the company that took you in already knows that you basically have no idea how to perform the job. You are there to learn and all the workers know that. You will know very little about the work performed. Someone will be training you and teaching you how things are done.\n\nYou have a great opportunity before you because it is the time to ask questions. Dont be shy or scared to ask questions. You wont know what the heck is going on and it will be expected that the intern will ask questions. If you ask questions then people in the company will see that you are interested in the task at hand and will see you as a good potential candidate.\n\nGood luck and congrats on obtaining an internship!!", "author": "RainyFL", "created": 1622482712, "upvotes": 61}, "h03p0cd": {"link": "/r/CollegeRant/comments/np74f2/im_scared_of_my_internship/h03p0cd/", "text": "As someone with anxiety I think I can understand a little bit of how you're feeling. Don't worry though, I'm sure you'll do well! Good luck!", "author": "ElementaryEloquence", "created": 1622482421, "upvotes": 17}}}