{"sid": "mvus09", "link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/", "title:": "Message to all professors lurking", "text": "\n1.\nIf you are the type to grade papers by just marking point deductions without an explanation of the error made\n\n2.\nIf you can’t manage to grade an assignment within three weeks of it being turned in\n\n3.\nIf the mean grade on the final project you assign is 43.1\n\n4.\nIf a student comes to you for help more than three days prior to a test, and you respond after said test\n\n5.\nIf you do not provide materials other than the book to study, or if you do, you make them irrelevant to tests and assignments\n\n6.\nIf you assign 20+ hours of homework a week\n\nGo fuck yourself, you spittoon-flavored excuse for a sandy dickhole. You are the reason degrees aren’t worth shit anymore. You are the reason college students lose interest in their passions. You are the reason there is a national push for education reform.", "author": "Good-Ol-Moses", "created": 1619056420, "retrieved": 1632950168, "over_18": false, "upvotes": 510, "upvote_ratio": 0.97, "comments": {"gyr0zcx": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gyr0zcx/", "text": "Had a professor who didn't grade anything for 2 months, I submitted 2 essays with no feedback and was freaking out while writing the 3rd because I had no idea if I was doing anything right. Sent her an email 3 or 4 days before it was due asking whether my sources were okay, replied to the email 2 days after the due date to tell me they were. Thank you, really helped me out there.", "author": "upupupigo", "created": 1621461345, "upvotes": 2}, "gwbwac1": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gwbwac1/", "text": "Message to all students: \n\n1.) If you don't read feedback on Canvas or Speedgrader...\n\n2.) If you don't submit work on time...\n\n3.) If you complete your work at the last minute, without revision, and expect a decent score...\n\n4.) If you don't make use of scheduled office hours but expect individualized attention by e-mail...\n\n5.) If you don't use the university writing center, library, or tutors... \n\n6.) If you don't commit the standard 12-15 hours to each of your classes every week as defined by Carnegie units...\n\nDon't cry to me about your grade.", "author": "TheProfessorsCat", "created": 1619722230, "upvotes": -2}, "gvtssbm": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvtssbm/", "text": "Or the professors who constantly say “I want you to succeed in my class” and “this class is easy if you work for the A.” but then proceed to pile the work,  tests and POP QUIZZES through the roof. Not to mention they’re probably very aware you’re taking 4-5 other classes that give around the same amount of work or more...", "author": "Veterinari4n", "created": 1619365500, "upvotes": 3}, "gvibj6f": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvibj6f/", "text": "7 if the only way to contact you is through a fax machine fuck you", "author": "deathworld123", "created": 1619136133, "upvotes": 5}, "gvi9qyi": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvi9qyi/", "text": "This would get so downvoted on r/college and it's sad. Every excuse is the world for faculty, but never the students.", "author": null, "created": 1619135224, "upvotes": 6}, "gvi0825": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvi0825/", "text": "If you do pop quizzes in university, fuck you. If you take attendence (a few exceptions for things like medical classes etc), fuck you.", "author": "maybehun", "created": 1619130624, "upvotes": 4}, "gvhqxe9": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvhqxe9/", "text": "I have a professor who would rather tweet about how unfair this world is than answer my emails.", "author": "ericgol7", "created": 1619126445, "upvotes": 1}, "gvh8csa": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvh8csa/", "text": "I really don’t understand what happens to all these ‘professors.’ It’s like their motivation isn’t teaching but instead creating more (unreasonable) obstacles for students to attain their education. It’s like they don’t see how they individually take part in impacting the economic divide we see today. The focus should be on teaching, growing, correcting errors, & students gaining expertise from them for future roles. Instead they chose to treat students as a monolith of lazy, no-good, cheaters. I could go on... but you all know. It sucks & it sucks more that they think our struggle is like a toddler whining, when these are legitimate issues.", "author": "Big_Lab_883", "created": 1619118434, "upvotes": 7}, "gvgvuc1": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvgvuc1/", "text": "This is why GPA shouldn't be taken seriously anymore.", "author": "NoChannel1", "created": 1619113210, "upvotes": 9}, "gvgt4ra": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvgt4ra/", "text": "I had a lit professor be proud than only 1 or 2 people got an A on each essay. He was absolutely the type of lit professor who thinks his opinions about a book are right. He also had his favorites in the class and it showed", "author": "jennybean2442", "created": 1619112103, "upvotes": 8}, "gvgloav": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvgloav/", "text": "Agreed!", "author": "DaddysPrincesss26", "created": 1619109012, "upvotes": 3}, "gvgdvdd": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvgdvdd/", "text": "My current professor in semiconductors he's an amazing guy nice guy but my god he's a horrible prof he believes giving a study guide/review for the test is academically dishonest bullshit, at this point we need our hand held cause we been suffering for too damn long.", "author": "edlightenme", "created": 1619105746, "upvotes": 4}, "gvgb1hk": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvgb1hk/", "text": "This semester I had a prof who refuses to answer emails at all. When I asked them during class (online) how to get ahold of them because emailing wasn’t working, they told me to set up a meeting during office hours. \n\nNo office hours are listed. Guess how you set up a meeting time? That’s right, email. I had questions about the final exam and assignment. It’s been a week and I still haven’t received a response. \n\nIn another class this semester, the professor posted PowerPoint slides with zero lectures. The class material they provided were: YouTube videos from other content creators not affiliated with the school in any way, said PowerPoint with no explanation accompanying the slides, zero lectures, zero meeting times to have questions answered, and a smattering of handouts posted online. \n\nHow. How is this acceptable?", "author": "tiny_sweaters", "created": 1619104560, "upvotes": 14}, "gvg61jk": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvg61jk/", "text": "I love this post", "author": "Throwaaawaayyy123456", "created": 1619102416, "upvotes": 3}, "gvg4wij": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvg4wij/", "text": "I had a physics instructor for the basic physical science class who purposefully made his exams 10x harder than what they needed to be by asking the most vague question possible and then providing 4 answers that barely made any sense unless you were basically majoring in that field of science... His exams were basically like riddles and you were screwed if you were bad at riddles... Spent basically 3 hours in his office a week just to try and understand the lecture and he got joy out of watching you struggle basically... He would talk down to you and make you feel stupid. He would just constantly repeating himself and hope you got it by the 10th time and only after you stared at him for a good minute in silence  he would try a different way. Me and another student tagged team his work and cried many of times. I had mental breakdowns every week because of him. Hated going to his class so much but stuck through it. Felt completely dumb and incapable of even continuing college.", "author": "ReGr19", "created": 1619101911, "upvotes": 8}, "gvg2rb7": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvg2rb7/", "text": ">1. If you are the type to grade papers by just marking point deductions without an explanation of the error made\n\nI'll have to go fuck myself, it seems. I typically do this because most students only care about their grade and it's a huge waste of time for me to leave detailed comments for everyone. I do supply detailed comments on request and usually about 1 in 20 does so.  \n  \nYour reasons for telling professors to go fuck themselves seems pretty legit otherwise.", "author": "Marky_Marky_Mark", "created": 1619100963, "upvotes": 1}, "gvg04bz": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvg04bz/", "text": "The 20+ hours of work.... we have lives too. I can’t focus all my energy in school and still pay my bills on time. 🙄", "author": "ZachTF", "created": 1619099733, "upvotes": 17}, "gvfhhsx": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvfhhsx/", "text": "I dont why but I have a strong feeling this whole \"3 days w/o a response\" sounds to much of a Friday afternoon email.", "author": "DashNair", "created": 1619088304, "upvotes": 7}, "gvffm9w": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvffm9w/", "text": "This semester alone, I had a professor who:\n\n- Gave us Powerpoints with no information on them, and we had to fill stuff in based on what *he said*\n\n- Except he never recorded anything, he told us things in his own words and the material was rarely in the textbook. And because his words were in his own words Google was no help \n\n- homework, quizzes, and tests were based on this information \n\n- Most of us were failing them, and yet were all blamed for our terrible grades UNTIL some students complained.\n\n- He now recorded his lectures after the complaint (and after a very entertaining Zoom lecture because he and this student got into a back and forth after she accused him of insulting her appearance)\n\n- Only he now claims that he gives us all of the information we need, but he doesn't\n\n- I've literally watched some lectures 3 times over and over to find an answer for a test and nothing\n\nFuck them indeed", "author": "NoodleEmpress", "created": 1619086671, "upvotes": 29}, "gvfdy60": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvfdy60/", "text": "Professor here — I am opposite of the type you explain, I help students maybe too much and make it as easy for them as possible because I feel learning the material is the main thing you are paying for.\n\nBut, I feel I may be doing my students some what of a disservice by spoon feeding them and making it too easy. My students are not  developing an independent motivation and work ethic. Those are important for survival and success in the Jungle that is the modern world.", "author": "erice3r", "created": 1619085085, "upvotes": 20}, "gvf5foc": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvf5foc/", "text": "If you make the notes you made in class unavailable until days later at best, or difficult to understand even _during_ a lecture, you’re an asshole. What’s the point of the notes and your teaching of I don’t understand what the lesson is and am unable to learn it on my own later? I’m essentially teaching myself the course and I don’t even have all the pieces, and I spent _money_ on this. Hell no.", "author": "Slight-Pound", "created": 1619076763, "upvotes": 43}, "gvf2fcn": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvf2fcn/", "text": "I know a professor who makes physics test SO HARD and says \" I don't want any person to get more than 50%\" \n\nHe purposely does it to FAIL students.\nStudents should leave his class and then we'll see if he is employed. The heck is wrong with professors?!?!", "author": "celpri", "created": 1619074060, "upvotes": 85}, "gvf1tcp": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvf1tcp/", "text": "True that", "author": "Fitznfaith", "created": 1619073525, "upvotes": 3}, "gvf118q": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvf118q/", "text": "> 5\\. If you do not provide materials other than the book to study, or if you do, you make them irrelevant to tests and assignments\n\nIt always boggles my mind how some people seem to have such a visceral aversion to actually using their textbook. Like, that's the study material that you need to be provided. It's literally all there.", "author": "BarackTrudeau", "created": 1619072866, "upvotes": -2}, "gvezz75": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvezz75/", "text": "Amen, and profs who keep assigning group projects when they know how hard it is to even contact people due to different time zones, plain laziness, and most are too busy trying to get their sanity in tact to even respond.", "author": "CrimeAt5Dollars", "created": 1619071978, "upvotes": 117}, "gvewmkd": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvewmkd/", "text": "I had a professor who told us that he was proud that no student had ever received anything higher than a B in his class. Fuck that guy. I dropped his class, took it over the summer at a community college, and got a 94%. \n\nHow are you proud about being a teacher who sucks at teaching?", "author": "MiddleweightMuffin", "created": 1619069319, "upvotes": 224}, "gvett3w": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvett3w/", "text": "So I’ve been exposed to both sides of it at this point. I’m a grad student who has been through 6 years of undergrad and now 2 years into grad school, with one year of being a TA.\n\nI agree with you, and I’d like to give my perspective. \n\nI don’t think homework should be an option in our higher level learning; studying should be. Homework just to be homework is bullshit. We should be in a class to learn, requirement, elective, or core class, it doesn’t matter. Yes we need to be evaluated and I think purposeful exams do just that. But they have to be purposeful exams and/or assignments depending on the field. Not busy work, not half-assed exam multiple choice questions, but real exams that test your knowledge, and more importantly, critical thinking skills in the field over the course of the class. In grad school, that starts to appear, but it’s still not enough. \n\nI’ve been asked as a TA to email students over and over again who haven’t been up to par in terms of grading and I finally refused. We are all adults, we should all be expected to learn as adults, and I’m sick and tired of the babysitting from all sides. This includes the busy homework, and the countless emails and reminders. I don’t want to receive them and I don’t want to have to send them out. The point of higher education should be to learn, no matter what, and I feel that it’s been lost under tenure, societal pressure, and capitalism. \n\nDon’t get me wrong, emailing a professor or TA 3 days before an exam and not receiving an answer on time is unacceptable, I would never do that to one of my students. However, this highlights the main issue: the people in charge in this scenario don’t care. They don’t care about you, your learning, or the people that work for them (TAs). They are only here for a job, and that’s not fair to everyone involved. \n\nThat being said, most professors, and TAs for that matter, have to develop a way to filter out the bullshit they receive. When you care as an educator, you will be taken advantage of by students, and you have to learn how to navigate though that. It’s a very hard thing to balance. \n\nAnyways, I just wanted to give my thoughts on this subject because it’s a wild experience being in the middle of both sides right now.", "author": "lep187", "created": 1619067190, "upvotes": 35}, "gvetaxo": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gvetaxo/", "text": "can't even argue with this one lol", "author": "Puzzleheaded_Can_750", "created": 1619066823, "upvotes": 7}, "gveswpi": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gveswpi/", "text": "Honesty yeah. Fuck them. It’s like they take joy in making people do bad and fail", "author": "Past_Gas", "created": 1619066543, "upvotes": 5}, "gverx8a": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gverx8a/", "text": "Whenever I meet or have a conversation with a shitty person I just assume they’re a professor lmao I hate them so much at this point they’re all so evil", "author": "satlovernot", "created": 1619065865, "upvotes": -14}, "gverejy": {"link": "/r/CollegeRant/comments/mvus09/message_to_all_professors_lurking/gverejy/", "text": "Fucc yea", "author": "974239", "created": 1619065521, "upvotes": 5}}}