{
  "sid": "mlc1y4",
  "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/",
  "title:": "I accidentally missed my midterm.",
  "text": "I accidentally missed my midterm\n\nThis is a little bit of a vent. \n\ntl;dr: I made a really petty, but stupid bonehead mistake and missed my mid-term. I got the times mixed up.\n\nSo I essentially got the midterm times mixed up. The exam times was broken up into 2 sections. The first section had to take there exams at 9:00 and the second section had to take their exam at 11:00am. I was in section 1. I actually ended up waking up early at like 7:00am, but miss-understood an email and thought that I had until 12:00pm to submit it. I went back to sleep and actually woke up around 9.\n\nI hopped on a discord where students were going over some practice questions for the exam (and some were even going over the exam) and the discord didn’t end until like 10. I check back at the announcement board and come to find out my exam time ENDS AT 10:05 am. A lot of people’s heart would have dropped, but mine didn’t anymore. \n\nI was simply just..angry. I was extremely pissed at myself for making such a very stupid mistake. There was an email that was send out a little after the first email saying that “while the last email made it seem like all the exams close at 12:00pm, this is NOT the case. You must take you sectioned exam at your designated time.”\n\nI was so pissed. If I would have just checked the second email, and announcements while I was in the discord, I would have been fine to take it.\n\nUnfortunately emailing my professor was a no go because the answers were listed after the 2nd section exam.\n\nNow I’m gonna have to retake this comp-sci class AGAIN, hopefully in the summer. \n\nI’m getting extremely pissed thinking about it and I can’t believe I made such a stupid mistake.",
  "author": "TallSwaggOVO",
  "created": 1617716894,
  "over_18": false,
  "upvotes": 207,
  "upvote_ratio": 1.0,
  "comments": {
    "gtnnv0x": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtnnv0x/",
      "text": "Literally the same thing happened to me with my bio test and crim midterm. I was just really angry too, I wasn't even anxious about it like I used to be.",
      "author": "potatoIIofrussia",
      "created": 1617772515,
      "upvotes": 1,
      "replies": {}
    },
    "gtn4axp": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtn4axp/",
      "text": "i feel you. did the same exact thing last semester with a final and i just accepted it, didn’t even email my professor about it even though i was so mad at myself and embarrassed and sad. i just felt so stupid",
      "author": "baeksong",
      "created": 1617760557,
      "upvotes": 1,
      "replies": {}
    },
    "gtmnvqx": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtmnvqx/",
      "text": "What did you learn?",
      "author": "orangeblackteal",
      "created": 1617752178,
      "upvotes": -1,
      "replies": {}
    },
    "gtm6wmt": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtm6wmt/",
      "text": "Can you explain to your Prof and perhaps if there is a Mid term Make up exam, you could write that? I had to do this with one of my courses.",
      "author": "DaddysPrincesss26",
      "created": 1617743805,
      "upvotes": 1,
      "replies": {}
    },
    "gtm0olv": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtm0olv/",
      "text": "The same thing pretty much happened to me last semester. Professor told us a time we had to take an exam but they were not good at communicating and explaining what time we had to take it. I missed the exam and was freaking out and even cried. They wouldn’t let me have another chance to take the exam either and I was so disappointed in myself. Brought my grade down to a D and it wrecked my GPA. Don’t be too hard on yourself, though! These last two semesters have been awful and it is unreal how much work we all have to do since schools are online/majority of classes are online. Students definitely have way too much to handle right now and things like this are going to happen. Just sucks that professors are expecting so much from us. Fortunately, it’s not the end of the world and I actually find summer classes to be a lot better or easier than Fall/Spring classes despite the shorter time frame. You are definitely not alone in this. Wishing you the best.",
      "author": "BetNarrow77",
      "created": 1617741047,
      "upvotes": 6,
      "replies": {}
    },
    "gtlsetz": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtlsetz/",
      "text": "I have to retake my last math class before I can get my degree. Irritating.",
      "author": "weediamonds",
      "created": 1617737504,
      "upvotes": 3,
      "replies": {}
    },
    "gtlo76h": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtlo76h/",
      "text": "YES! The same thing happened to me last semester with a final. I cried for an hour and then got extremely salty about it. My prof didn’t help either and was actually quite rude. I understand your pain! It dropped me from a 94% to an 84% :)",
      "author": "jidsuperfan",
      "created": 1617735651,
      "upvotes": 1,
      "replies": {}
    },
    "gtlckjn": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtlckjn/",
      "text": "Hey! I did the same shit and my professor has yet to respond to my email from the day after the midterm :) it was 2 weeks ago lol",
      "author": "dancin_disco_daddy",
      "created": 1617730552,
      "upvotes": 4,
      "replies": {}
    },
    "gtl897u": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtl897u/",
      "text": "Oh man, that fucking sucks, so sorry. I 100% understand this. \n\nTalk to your professor, explain what happened and just maybe your professor might be understanding and give you a make up exam. I doubt you would want to go through this class again. \n\n2 semesters ago, I missed one of my midterms cause I over slept. Luckily my professor was extremely nice and understanding that he let me do a make up exam cause I was doing really well in the class anyways. Passed the exam and didn’t have to retake the course. \n\nHopefully you’re professor will try and come up with something for you so you don’t have to retake the class. \n\nGood luck OP, update us if you can on how it went.",
      "author": "JkLion1998",
      "created": 1617728675,
      "upvotes": 16,
      "replies": {}
    },
    "gtl70jf": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtl70jf/",
      "text": "Communication with your professor is really critical. You need to explain your situation more clearly and honestly.",
      "author": "neypa",
      "created": 1617728139,
      "upvotes": 6,
      "replies": {}
    },
    "gtl6t2k": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtl6t2k/",
      "text": "Don’t be too hard on yourself, everyone makes mistakes. Look at it as an opportunity to get an even better grade on the retake since you will already know the material & routine. Plus you’ll know about the whole exam setup and to be extra clear with the professor on when the exam is! Give yourself some time to cool down as well ✌🏼",
      "author": "Big_Lab_883",
      "created": 1617728051,
      "upvotes": 7,
      "replies": {}
    },
    "gtl5tko": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtl5tko/",
      "text": "I missed a few quizzes this semester too. There was just so many overlapping homework assignments and projects due that I forgot to take it but I emailed my professors to acknowledge my mistakes and they reopened the quizzes for me. You should try to email your professor as soon as possible.",
      "author": "FMG_99",
      "created": 1617727634,
      "upvotes": 30,
      "replies": {}
    },
    "gtkttm3": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtkttm3/",
      "text": "I’m not sure if you emailed your professor, but if you didn’t, you should definitely try. Professors are usually very understanding, and they might already have a make-up test day planned, with a different test. I know this from experience. \n\nI feel your pain. I hope something gets worked out.",
      "author": "The_Rhyne",
      "created": 1617722375,
      "upvotes": 114,
      "replies": {
        "gtmycsy": {
          "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtmycsy/",
          "text": "I second this. I messed up big time early in my college career. Combination of a bad break up, terrible job with long hours, and a bad flu made me miss all my finals for a semester. I was really embarrassed and didn’t reach out. I already missed a bunch of days for “no good reason” (mental health). I just let myself dissociate from it all.\n\nI failed the semester which made everything much worse for much longer. My professors reached out and said they would have been happy to work with me if I communicated with them. One even gave me a D even though missing the final should have made me fail outright.\n\nReach out and be honest. It can only help.",
          "author": "EverydayQuestions-",
          "created": 1617757543,
          "upvotes": 8,
          "replies": {}
        },
        "gtn9xnf": {
          "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtn9xnf/",
          "text": "i agree. today i accidentally slept past the class i was supposed to have an exam in. i woke up 50 minutes past the start time and the exam had already been taken down. i emailed my professor and he’s letting me take it friday. so not only am i not getting a 0 but i also get a couple extra days to study.",
          "author": "trinitypisarsky",
          "created": 1617763591,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gtklqsw": {
      "link": "/r/CollegeRant/comments/mlc1y4/i_accidentally_missed_my_midterm/gtklqsw/",
      "text": "Well from pain comes growth..",
      "author": "electricdom",
      "created": 1617718745,
      "upvotes": 4,
      "replies": {}
    }
  },
  "updated": 1634063045
}