{"sid": "igq5r1", "link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/", "title:": "I hate it when professors act like it is never their fault when students do badly in a test.", "text": "I get that there are students who put zero effort in their studies and try to blame the professor for their own shortcomings, but I think these students are a minority. Most students actually want to try their best but get professors that just do the bare minimum in their teaching (eg. reading off from the slides, never making sure that their handwriting is readable, rarely replying to student emails). And I hate it when they say that students should go study in the library themselves if they're struggling so much. What are we paying them for then?", "author": null, "created": 1598407560, "retrieved": 1632950363, "over_18": false, "upvotes": 188, "upvote_ratio": 0.98, "comments": {"g3fs3aj": {"link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/g3fs3aj/", "text": "My zoology professor gave us our first quiz that ended up being essay questions, 10 questions, 10 minutes. (Thats fine but it was the first quiz and I had no idea what to expect from his quizes/exams) then after 10 minutes he picked them all up, Very quickly went over the quiz skipping half the questions. Then said That that should have only taken 3 minutes then the following class put us down (and continues to every class since) about how no one did well on that quiz and how we need to study harder.", "author": "SpaggettiBill", "created": 1598851092, "upvotes": 1}, "g32ze2n": {"link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/g32ze2n/", "text": "I had this one prof whos test were extraordinarily difficult and homework was even harder(Calc III) but they noticed the class wasn't doing well and worked with the class to help the class learn the material better. The test were still fricken difficult though", "author": "19Riften99", "created": 1598573918, "upvotes": 1}, "g2ylnp6": {"link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/g2ylnp6/", "text": "I had a prof my freshman year brag about how most people would only get a C- , mind you we all needed at least C+ to pass, but then would make his exams only 30 questions on super hella specific stuff that he either mentioned once or didn't mention at all. I loved his lectures because he was cool and entertaining but I hated his exams", "author": "tiredcollegekid2", "created": 1598481134, "upvotes": 1}, "g2xm9ew": {"link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/g2xm9ew/", "text": "This was my dynamics class. Told us most\nof us would fail. Class average on the first test was a 27%, Prof spent the whole next class yelling at the full auditorium how we need to study more. I feel like if the average for a class of 100+ people is that low you have a bigger problem than students not studying enough", "author": "ragegold86", "created": 1598464771, "upvotes": 7}, "g2x0ff5": {"link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/g2x0ff5/", "text": "I feel like professors only join this sub to defend themselves when there is a post complaining about teachers 😂", "author": "morfoodie", "created": 1598454471, "upvotes": 8}, "g2ws1mb": {"link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/g2ws1mb/", "text": "Hahahaha——over 1/3 of my students never logged in to our online class until the last week of term.   There is no way to learn 16 weeks of material in one week!  They didn’t do the reading or watch the lecture videos, and tried to bullshit their way through the exam.\n\nI have a very hard time believing that the vast majority of students are putting in the work they need to in order to succeed.  I’d say it’s about 60-40.", "author": "AntiquePangolin", "created": 1598450320, "upvotes": -2}, "g2wp6o8": {"link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/g2wp6o8/", "text": "Professors who ignore/don't check for questions during class time are the bane of my existence.", "author": "anothersadsister", "created": 1598448685, "upvotes": 3}, "g2wkhqq": {"link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/g2wkhqq/", "text": "The problem is not your college professor. The problem is that in the US, you are given pre-digested information as late as high school. Most of you have no idea how to learn on your own even as adults.\n\nAsk a Chinese, Russian or Indian student at what grade they were expected to learn the material on their own. I guarantee you by middle school most of them were not relying on the teacher. I went to school in Mexico, for us it was 7th grade. The math teacher may demonstrate an easy problem, then he'd give us harder ones for homework and a super hard one for the exam. Our literature teacher would expect us to be prepared so she could cold call us to answer questions about the assigned readings. I moved to the US for high school. I didn't even speak English but everything was a review to me and we were treated like babies so I had straight As while barely trying. \n\nWhat are you paying for? For a credential that says that you are capable of learning.", "author": "ThatProfessor3301", "created": 1598445665, "upvotes": 0}, "g2vshuu": {"link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/g2vshuu/", "text": "God bro, I had an absolute cunt of a professor that made an easy subject far harder than anything else, and would sneak in on our class' groupme chat and subtly bitch about how \"People are talking badly behind my back\" whenever she gives horrible homework combined with her horrendous attitude. I'm a type of guy that complains about a lot of things, but this is one of the few people I want to bash into a wall.\n\n&#x200B;\n\nI'm sure you've had assignments where you had to upload to [turnitin.com](https://turnitin.com) or whatever you use to upload online and stuff. Not this crazy woman. Her procedures of 'turning things in' is\n\n1:Upload online. Easy and simple, right?\n\n2:Print a hardcopy of her 20+ page homework and turn it in class.\n\n3: Oh wait, I forgot to mention that some pages are supposed to be printed out and handwritten on to solve some problems. Did I mention that handwriting your answers that aren't explicitly mentioned to be handwritten on loses you points? It does. \n\nThere's much more bullshit that goes on in that class but it's not even relevant to how incompetent and annoying that one professor was since that was the ONLY 'professor' that taught the course for the semester and it was a core class... College is a damn joke.", "author": "Alextherude_Senpai", "created": 1598419198, "upvotes": 22}, "g2vawof": {"link": "/r/CollegeRant/comments/igq5r1/i_hate_it_when_professors_act_like_it_is_never/g2vawof/", "text": "My favorite is when they brag about the fact that most people fail their class", "author": "Gabbyy007", "created": 1598408036, "upvotes": 88}}}