{"sid": "p1eyw4", "link": "/r/CollegeRant/comments/p1eyw4/i_feel_like_ill_never_have_the_true_college/", "title:": "I feel like I'll never have the \"true college experience\"", "text": "This will be long, so I apologize in advance.  I am 19 and entering my sophomore year of college.  I currently live with my parents and commute to school (about a 25-minute drive).  For a bit more context on my university: the university I attend is in the middle of a city and has a lot of commuters, so a lot of people pretty much just go to class and leave.  They have on-campus events, clubs, and things of the like, but the student body is not as tight-knit as other 4-year colleges.  For a bit about myself: I am an education major and have a pretty high GPA right now.  I love my major and am passionate about teaching and the subject I plan to teach, so I'm not worried about anything academic-related.\n\nPretty much everyone can agree that this past school year sucked due to COVID, whether you lived on or off-campus.  This past year was not great for me, to say the least.  Everyone hypes up freshman year of college, but because of COVID, it was a bust.  Sure, I joined the college chorus, which helped a little, but I haven't really made any close connections with the people there.  Most of my classes were online, so I was also only on campus 3 days a week for 2-3 hours in the fall.  It was better in the spring, and I was on campus 3 days a week for about 6ish hours.  I dislike online classes and need to be around people, even though I don't talk to them.  The presence of others just helps, if that makes any sense.\n\nMy uni was really strict about masks.  You had to wear them all the time, even outdoors.  They were originally going to not require masks this year, but they recently sent an email that said everyone has to do so inside regardless of vaccination status but vaccinated people can take them off outside.  I got vaccinated near the end of the year and officially became immune the day after finals ended.  I've always been really good about wearing masks and all that.  I don't like wearing them all the time, but it's necessary and you just gotta do it.  I wear them at my summer job, even when I was the only worker wearing one and I was getting harassed by customers for it.  I'm just so sick of the politicization about COVID and all the anti-maskers, but that's a rant for another time lol.\n\nBasically, I just feel like this pandemic is gonna last my entire college career.  I'll never be able to go maskless inside or just talk to people without the fear of spreading this virus.  It feels like college will be overshadowed by the pandemic and I'll never have a \"normal\" college experience.  For many different reasons, my high school experience was very traumatic and I just wanted to start anew in college, but it's really hard to do that with COVID.  The only person from high school I regularly keep in touch with is my best friend, who is a year younger than me and is going to college out-of-state.  My parents are generally understanding, but sometimes they can just be overprotective of me.  To add to all this, I have a lot of mental health problems (anxiety, depression, possibly OCD?, but I'm not formally diagnosed with anything) and it just makes everything harder.  I don't want to hear any of the \"you just gotta get out there and make friends quit throwing yourself a pity party\" BS because frankly, I know that it's all my fault that I'm in this position.  I'm not asking for a whole lot out of my college experience.  I just want to find some friends to make good memories with, but it just doesn't seem feasible.\n\ntl;dr: I'm afraid of not having a normal college life in the social sense because of COVID and mental health problems.", "author": "dandelioncommittee", "created": 1628558043, "retrieved": 1632841652, "over_18": false, "upvotes": 15, "upvote_ratio": 0.91, "comments": {"h8cv6nx": {"link": "/r/CollegeRant/comments/p1eyw4/i_feel_like_ill_never_have_the_true_college/h8cv6nx/", "text": "Thank you u/dandelioncommittee for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1628558043, "upvotes": 1}, "h8evgvw": {"link": "/r/CollegeRant/comments/p1eyw4/i_feel_like_ill_never_have_the_true_college/h8evgvw/", "text": "ha, i’m in a very similar situation. 19 going into sophomore year. vaccinated but still gonna wear a mask at school. To top it off I’m in fuckin Florida where our governor banned mask mandates and covid cases are soaring right now.\n\nYour worries are very warranted. People don’t realize that in the past, pandemics have lasted decades. Generations even. There have been viruses that existed for several centuries until we all got vaccinated. But for whatever goddamn reason large scale vaccination is impossible here. I really wouldn’t be surprised if we come out of college with an overall lack luster experience, still having to deal with covid for a loooong time afterwards…\n\nRegardless, we have to make the most of it. I’m hella shy & anxious so putting myself out there to make friends has been so hard. I’ve made a few study buddies and I have four roommates which I actually get along with well. These roommates have also met lots of other people which I’m hoping are potential future friends. I also need to make an effort to reach out to professors more, they can be awesome people. \n\nAnd Big universities tend to offer short-term therapy for free to students, so definitely look into that if you don’t currently have a therapist. \n\nI know saying stuff like “just put yourself out there!” is easier said than done. Don’t get me wrong I haven’t really made any new *true* friends either. :(\n\nI guess my point is you’re not alone. This worrying and these feelings aren’t your fault - Covid is definitely not your fault. But realistically it *will* last a long time. I agree the politicization is stupid. I don’t really know what we can do but you got my support man", "author": "soupysyrup", "created": 1628605207, "upvotes": 2}, "h8dc6hk": {"link": "/r/CollegeRant/comments/p1eyw4/i_feel_like_ill_never_have_the_true_college/h8dc6hk/", "text": "First of all, don't ruminate on freshman year. Plenty of people including me struggled to make friends pre-Covid. You'll have the opportunity this year.\n\nSecond while I am cautiously checking the news, I doubt covid will mess up social interactions anything like last semester. My college also requires masks but everything is still planned in-person. As long as you interact with vaccinated people you're not really going to be spreading the virus, because as of now vaccines are still effective at preventing serious illness.\n\nYou need to put yourself out there. Other people are going to want to hang out and make friends too. This is some advice which you've probably heard before but it's true: join clubs, try doing things in-person. You still have opportunities for some sort of \"true college experience\"", "author": "armchairwarrior13579", "created": 1628566663, "upvotes": 7}}}