{"sid": "noeq0h", "link": "/r/CollegeRant/comments/noeq0h/i_just_had_a_really_bad_proctoru_experience_and/", "title:": "I just had a really bad ProctorU experience and did really bad on my test.", "text": "Honestly this seems so stupid but I find ProctorU so stressful to begin with this just exasperated the hell out of me. It was my second final exam of the day so I was already tired, and when the invigilator signed on I could just tell that she was going to be nitpicky about everything. She made a big deal about my ID not being good enough despite it being government issued ID, that I have used for every exam and had even used earlier that day with ProctorU. She kept saying my photo on my ID was \"too blurry\" so she couldn't use it. She was like text me a picture of your ID- I told her I definitely wasn't going to do that. She finally accepted my ID (that I never had a problem with in 15+ other ProctorU exams). Then she made me get up and show her my phone on the counter behind me twice. Then when she scanned my room she told me I couldn't have drinks but I always have a drink with my exams because they're up to three hours. I tried to argue with her and held my drink up to the webcam so she could see it was real and there wasn't writing on it or anything  but she wouldn't give and I was so exasperated I finally got up and put my drink on the counter and I said the word \"shit\" as I did it- it just kind of slipped out lol. Like I know I shouldn't have swore but it just kind of happened, I wasn't really cognizant of it, I was frustrated and tired and made a whoopsie. Then she shut down my test check-in and flagged me for using abusive and foul language and I was like I didn't even say it to you, I'm sorry I cussed, can I please just take my test? She started it back up but made me re-do the test check in and check my room all over again. Then after I finally started my test she stopped me six different times. Two times for putting my hand over my mouth, once for covering my ear with my sweater hood even though they already checked my ears for earbuds, and then two times because I guess clouds went over the sun and a shadow came through the window. It was so distracting. Every time she stopped me I lost my train of thought and I honestly felt so anxious during the whole process. Just knowing that she was staring me in the face and could stop me any second made it so hard to concentrate. I ended up getting 67% on it and 65% is a pass. It's the worst exam grade I've ever gotten but I'm not going to appeal and retake it over this because the thought of dealing with that again is more stressful than a bad grade. One more test to go and I have myself an undergrad degree, though!\n\nEdited to add that I am in Canada and there aren't any invigilation options other than Proctor U through my university due to covid right now. ", "author": "xaxathkamu", "created": 1622392055, "retrieved": 1632842301, "over_18": false, "upvotes": 126, "upvote_ratio": 0.99, "comments": {"gzzkvyg": {"link": "/r/CollegeRant/comments/noeq0h/i_just_had_a_really_bad_proctoru_experience_and/gzzkvyg/", "text": "Thank you u/xaxathkamu for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1622392055, "upvotes": 1}, "h036zoe": {"link": "/r/CollegeRant/comments/noeq0h/i_just_had_a_really_bad_proctoru_experience_and/h036zoe/", "text": "Gads!  Can’t they just open up a testing center, would make everything so much easier", "author": "Analyst_Unlucky", "created": 1622473527, "upvotes": 1}, "h01hndw": {"link": "/r/CollegeRant/comments/noeq0h/i_just_had_a_really_bad_proctoru_experience_and/h01hndw/", "text": "Ever hear of paragraphs? 🤮 It would be easier to read your complaint if you broke this nonsense down a bit.", "author": "orangeblackteal", "created": 1622428506, "upvotes": -22}, "h00o9ma": {"link": "/r/CollegeRant/comments/noeq0h/i_just_had_a_really_bad_proctoru_experience_and/h00o9ma/", "text": "Christ! I don't make my students use that proctor software and now I'm glad I don't. I didn't realize how absurd they are about everything. \n\nMy university has a policy that students can opt out of Proctorio (that's the one we use) and if they opt out, we have to provide an alternate testing method. I just make my finals more like a project and I personalize each one to each student. Then they can work on it for 2 weeks and work in groups for all I care.", "author": "TheJaycobA", "created": 1622411915, "upvotes": 47}, "h008w04": {"link": "/r/CollegeRant/comments/noeq0h/i_just_had_a_really_bad_proctoru_experience_and/h008w04/", "text": "I wouldn't necessary appeal and retake it but I absolutely would let the college know about that. That ain't right. And a complaint coming from the college will be a lot more likely to get attention from proctorU", "author": "jessamina", "created": 1622404078, "upvotes": 54}}}