{
  "sid": "qatnbz",
  "link": "/r/CollegeRant/comments/qatnbz/too_busy_at_work_fucking_up_in_college_need_to/",
  "title:": "Too busy at work, fucking up in college. Need to vent.",
  "text": "Hey guys, I need to vent a bit.\n\nFirst off a bit of a backstory. I'm in the Netherlands where most people attent institutional college (aka go to a school building fulltime). I did that for HR not once, but twice. The first time I got a burn out and depression after a real nasty break up, so I had to drop out. I tried again since I felt confident in handling college (it's not super hard but I do need more time than average college students probably). The second time it went pretty well, until the pandemic hit and I couldn't continue my internship. I had to redo a couple of tests because of a minor program I attended where I got screwed over by a research group I was in at the time.\n\nAfter all this, my college advisor gave me the advice to wind down a little, focus on my job and look into parttime college later. Which I did. I was excited to finally finish college, albeit a bit late.\n\nI'm in a Associates Degree program, which basically is college in 2 years instead of 4. I barely passed my first test which according to the professors was one of the harder courses of the entire program. I didn't fret about it since it wasn't a big deal since it's about entrepreneurship and I am more inclined to HR, not my own business. Since I work as a courier, I don't have a workplace in HR to do the program in duality form. To clarify, you can either finish the course in duality form where you already work in the field, or take the parttime form where you do a 6 month internship. I'm fine with either although I am going to look for work in the HR field while I'm in college to hopefully find a starting position.\n\nHOWEVER (here is the part that the title leads to), I feel like a mess, messing it up already. I have to do a research which I planned out for this week. It got postponed 3 times already because I couldn't find the time with my fulltime job. Luckily the final date is November 11th so even IF I don't finish it this week I still have some time left. So this isn't a major problem. My second paper is less of a research but I need information from HR where I currently work. So far, HR of the company I work for now is rather slow, so I'm kinda jittery about this becoming a problem. The due date for this paper however is December 16th. Again, enough time to work on. I just logged into my account and noticed the due date for submitting my internship information: October 1st. Yes, it's October 18th now. I fucked up. How did I not pay attention to this? I also never received a reminder, nor did I get a coach assigned to me after my first one left the program. Hopefully I can contact the school soon and find out in how much of a mess I am, because while I like the course and would love to graduate college FINALLY after this program and after all those years, I feel like this could be a big screw up even though I'm only working on the 3th module out of 20. Pray for me Reddit lol. Reminder: work on time management and working on college more.\n\nSheesh.\n\nTLDR: I couldnt find the time to work on college work and find a suitable internship and now im overdue and feel fucked.\n\n&#x200B;\n\nEdit 1: I'm at the point where I made a tick-off list that contains one, maybe just two objectives, whereas I used to be able to just do a whole section for something. I feel like it's my safegate to not fall into a burn out anymore, but it makes me feel incompetent as well. Even though at any workplace I have ever been I get into the routine of work fairly quickly and do my job well in short time. It's just that with college there is so much to take care of all at once. I know I can take on college, it's just this pile thats in my way for now.",
  "author": null,
  "created": 1634584228,
  "updated": 1634654976,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hh569ex": {
      "link": "/r/CollegeRant/comments/qatnbz/too_busy_at_work_fucking_up_in_college_need_to/hh569ex/",
      "text": "Also to add to the story: I know from my own personal experiences that once I worked through the pile that's on my desk now and I have a workplace / internship, I will be able to focus a lot more on my college work since I don't have to backtrack anything. The modules aren't all in one, but seperated by a couple of weeks, some even months, sine the program is made for people who have to combine work with college. It's just that right now I feel like I'm in a negative spiral where I don't feel motivated but I HAVE to be to fix this shit while I still can...",
      "author": null,
      "created": 1634584367,
      "upvotes": 1,
      "replies": {}
    }
  }
}