{"sid": "lky7uw", "link": "/r/CollegeRant/comments/lky7uw/now_im_gonna_get_a_zero_thanks/", "title:": "Now I'm gonna get a zero THANKS", "text": "Update2: Landlady isn't mad. Lots of family and friends are practically throwing new furniture at us. We should be able to go home in a few weeks. Gofundme from friends and family has been able to replace important things like bedding and the like. Made a 100% on this doodoo assignment. Thanks everyone.\n\nUpdate: I totally argued with myself on my own points and everything, nailed it.\n\nMy group in a mandatory arts class (why do they call it an elective then) had an assignment to post a writing assignment on a Canvas discussion, then reply to two other students on their writing. It's due at 8 AM, in seven hours.\nDesktop Canvas has been down for us all day, but mobile works fine.\nI busted my ASS to write the ENTIRE thing on mobile, source links off my computer and all.\nAnd no one else replied. I have no other two students to reply to.\nHalf of my apartment just burned down last night and both of my cats died and I STILL did my assignment. Where the frick is everyone else? Am I gonna reply to myself?! I might do that if I don't see anything by 2 AM. I need to sleep though. Everything hurts physically emotionally and mentally and I have a lot of running around tomorrow to replace the basics I lost in the fire, plus my son's online schooling, plus whatever the fuck hellfire and brimstone my landlady is gonna rain down on me for the damage to the apartment.\nJust... Do your damn work. Stop making it hard for everyone else. Jfc.", "author": "sugarJackal", "created": 1613458486, "retrieved": 1632842977, "over_18": false, "upvotes": 108, "upvote_ratio": 0.97, "comments": {"gpm4quk": {"link": "/r/CollegeRant/comments/lky7uw/now_im_gonna_get_a_zero_thanks/gpm4quk/", "text": "Thank you u/sugarJackal for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1614828800, "upvotes": 1}, "gnqivnw": {"link": "/r/CollegeRant/comments/lky7uw/now_im_gonna_get_a_zero_thanks/gnqivnw/", "text": "Wow I am so sorry for the losses do your two cats and your apartment. And then this whole situation of top of it all. Wow. Very impressive that you did the post despite it all. Replying to yourself was a good idea. I hope you can take some time to take care of things and yourself and get some rest <3", "author": "Emotional-Shirt7901", "created": 1613540836, "upvotes": 3}, "gnni7dx": {"link": "/r/CollegeRant/comments/lky7uw/now_im_gonna_get_a_zero_thanks/gnni7dx/", "text": "Is it still required if desktop canvas is down though? Like did you ask your professor, and did they even know canvas was down? There's a good chance they would give an extension because of the inconvenience, so everyone else just didn't do it expecting the professor to forgive it.", "author": "deltagardevoir", "created": 1613488146, "upvotes": 6}, "gnnccr9": {"link": "/r/CollegeRant/comments/lky7uw/now_im_gonna_get_a_zero_thanks/gnnccr9/", "text": "Hate that replies are required in the first place, they never add anything. Also, we do weekly posts, first week, 25 threads, next week 4, this week, none yet. I don’t know where everyone went, but I’m sure your professor will understand.\n\nHang in there, and don’t be afraid to ask for help", "author": "Emily588", "created": 1613485169, "upvotes": 19}, "gnmwqhq": {"link": "/r/CollegeRant/comments/lky7uw/now_im_gonna_get_a_zero_thanks/gnmwqhq/", "text": "Ask your professor for an extension. It doesn't mean you're any less of a student or you're defeated. Take care of yourself.", "author": null, "created": 1613474413, "upvotes": 39}, "gnmmi51": {"link": "/r/CollegeRant/comments/lky7uw/now_im_gonna_get_a_zero_thanks/gnmmi51/", "text": "I understand that this may have occurred to you, or that you already know the professor will say no... but I'd honestly ask for an extension. You're in some really difficult circumstances right now and school work can wait. You shouldn't have to \"still do your assignment\". Take a break to figure things out.", "author": "IcarusRyder", "created": 1613464669, "upvotes": 59}, "gnmffjm": {"link": "/r/CollegeRant/comments/lky7uw/now_im_gonna_get_a_zero_thanks/gnmffjm/", "text": "Thank you u/sugarJackal for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1613458486, "upvotes": 3}}}