{
  "sid": "pyf5s4",
  "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/",
  "title:": "roomie help PLEASE",
  "text": "guys i am at my wit’s END! i’m a freshman living in a dorm, and i’m sick and tired of my roommate. she doesn’t help clean, and she isn’t respectful to my sleep schedule and will continue to use the entire room light instead of a desk lamp when she stays up for homework (every night). i’ve been able to try to ignore that, but the last three weeks, something has been happening that is going way too far and idk what to do.\n\nevery. single. night. like clockwork, i wake up at 1 am and can’t fall back asleep because my roommate masturbates VERY loud. she moans, talks to herself, and the act itself is very noisy and uncomfortable. to make it worse, i have misophonia (sound disorder where specific sounds make me incredibly upset), and the wet noises that happen when she gets off trigger my misophonia.\n\ni can’t wear headphones because i have un-healed piercings that are too close to my ear canal, and i don’t know how to tell her to stop. i try making it very clear that i’m awake (i’ve even walked out multiple times for half an hour, only to come back to her still doing it).\n\nwhat do i do?? please, please help\n\nEDIT: talked to her yesterday morning and last night was a lot better!",
  "author": "No-Fan299",
  "created": 1632988624,
  "updated": 1634093912,
  "over_18": true,
  "upvotes": 71,
  "upvote_ratio": 1.0,
  "comments": {
    "heuhgjc": {
      "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/heuhgjc/",
      "text": "Honestly I hated my roommate too. I went to the head of my dorm and told them my mental health was suffering and asked if I could move, to any single room if possible. They gave me a double all to myself and were very responsive",
      "author": "RillaBam",
      "created": 1633007634,
      "upvotes": 58,
      "replies": {
        "heuwnob": {
          "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/heuwnob/",
          "text": "good for your school! i think the craziest part is that we picked each other to be roommates 🙃",
          "author": "No-Fan299",
          "created": 1633014378,
          "upvotes": 19,
          "replies": {
            "hev2hzc": {
              "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hev2hzc/",
              "text": "My school sucks and the head of the dorm was fired for sleeping with his students that came to him with problems the semester after this happened. But I like to think persistence helps! That’s crazy though, people surprise you",
              "author": "RillaBam",
              "created": 1633016828,
              "upvotes": 11,
              "replies": {
                "hevf388": {
                  "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hevf388/",
                  "text": "OOP wow",
                  "author": "No-Fan299",
                  "created": 1633022006,
                  "upvotes": 6,
                  "replies": {
                    "hevl2dv": {
                      "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hevl2dv/",
                      "text": "Higher education is dope 🧢",
                      "author": "RillaBam",
                      "created": 1633024460,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "heugekh": {
      "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/heugekh/",
      "text": "Wtf? How can people be so unaware of themselves? Is she not even embarrassed...Anyways you definitely have to tell her all these things are bothering you and set some boundaries.\n\n- For the light thing you can get a sleeping mask btw that helped me a whole lot when I had a roommate. But set a lights out time or desk lamp only time with her. \n\n- For the cleaning thing try not to use language that is blaming her of the issue. Offer to help her clean as well. Maybe make a to do type of checklist to make sure it's clean. \n\n- And for the mastubation thing... She might be embarrassed because I'm assuming she thinks you didn't hear her all those nights, so take that into account when approaching her. Just ask her to please do that when you're not in the room. Have a knock first system in place so you don't walk in on her.\n\n- While the topic is being discussed also ask her if you do anything that bothers her. She will feel like you're not accusing her. \n\nIf the communication isn't working yeah you should tell the RA and make a report because that's ridiculous.",
      "author": "genericusername_____",
      "created": 1633007106,
      "upvotes": 33,
      "replies": {
        "heuxfvw": {
          "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/heuxfvw/",
          "text": "thank you for all the advice. i have a sleeping mask,  its always uncomfy for me so i’m trying to work out my options. honestly, that and the cleaning are just more petty and i’m willing to work it out after this masturbation convo because i don’t want her to feel like i’m throwing a million things on her. i tried to be as gentle as possible approaching her this morning, but i have such a hard time believing she doesn’t know she’s that loud because she will actually moan and talk louder than her normal level.. just very uncomfortable situation",
          "author": "No-Fan299",
          "created": 1633014707,
          "upvotes": 8,
          "replies": {
            "hfag2bp": {
              "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hfag2bp/",
              "text": "I wouldn’t tolerate her bullshit. Hope you can find a good solution.",
              "author": "dogandcats424242",
              "created": 1633304795,
              "upvotes": 1,
              "replies": {}
            },
            "hfalhrn": {
              "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hfalhrn/",
              "text": "I wouldn’t be gentle. I’d be stern and tell her she’s wasting your money. You have to pay to live in this nonsense (the dorms) so you have to do something about it. Who cares if she feels uncomfortable she’s making you uncomfortable. And of course you would be, who masturbates in front of someone who’s not a lover? It’s just gross.",
              "author": "dogandcats424242",
              "created": 1633307509,
              "upvotes": 1,
              "replies": {
                "hfe7c81": {
                  "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hfe7c81/",
                  "text": "I completely agree 👏🏻",
                  "author": "Izzetinefis",
                  "created": 1633377941,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hfafs5v": {
          "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hfafs5v/",
          "text": "Ikr? the girl that I have to share my bathroom with in my dorm has left it unsanitary on a weekly basis, I dread going in there to see what I’ll find next. This morning she’s left menstrual blood drips everywhere. So gross. I complained to the RA and they did nothing.",
          "author": "dogandcats424242",
          "created": 1633304653,
          "upvotes": 2,
          "replies": {
            "hfai0kl": {
              "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hfai0kl/",
              "text": "Omg have you talked to her about it? I know it's not likely but there's a chance she didn't realize that happened. Either way though that's pretty ridiculous and she needs to stop.",
              "author": "genericusername_____",
              "created": 1633305775,
              "upvotes": 2,
              "replies": {
                "hfakjnl": {
                  "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hfakjnl/",
                  "text": "The drips are all over the floor so she had to have seen them. She’s generally dirty anyways but… \n\nI don’t usually see her in person (just her leavings, lol.) but maybe it’s time for a passive aggressive note?",
                  "author": "dogandcats424242",
                  "created": 1633307032,
                  "upvotes": 1,
                  "replies": {
                    "hfam2ry": {
                      "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hfam2ry/",
                      "text": "Yeah I think a sticky note would be good too. If you can catch her in person it might be better as she can get a sense of your tone and body language and you can further the conversation. I hope you can get that sorted though.",
                      "author": "genericusername_____",
                      "created": 1633307795,
                      "upvotes": 1,
                      "replies": {
                        "hfamvk7": {
                          "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hfamvk7/",
                          "text": "I tend to get very angry with idiots like her in person so that’s why I didn’t want to personally confront her. To me it’s logical to clean up after oneself, I guess to her it isn’t and that infuriates me. My tone wouldn’t be very nice.",
                          "author": "dogandcats424242",
                          "created": 1633308184,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "heuwbgf": {
      "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/heuwbgf/",
      "text": "That’s disgusting, honestly I wouldn’t even bother talking to her about it. Just go to the dorms main office or the people that run it. I forget what they are called and tell them everything. That’s what I did and she helped me leave immediately.",
      "author": "Thin-Tennis-365",
      "created": 1633014240,
      "upvotes": 20,
      "replies": {
        "heuxuju": {
          "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/heuxuju/",
          "text": "i’m def gonna talk to my RA if this doesn’t change after a convo",
          "author": "No-Fan299",
          "created": 1633014879,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hev5bsi": {
      "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hev5bsi/",
      "text": "Go to your RA now",
      "author": "GoldRequest",
      "created": 1633017990,
      "upvotes": 10,
      "replies": {}
    },
    "hettvq9": {
      "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hettvq9/",
      "text": "The best way to do it is to just be up front about it. Unless some administrative action is taken, y’all are stuck with each other for the coming year so it’s in both of your best interests to work this out as soon as possible, even though that’s awkward as hell and totally not your average roommate quarrel.\n\nJust tell her you need to talk and that you need to establish some ground rules for the room; a “code of living” if you will. If you really can’t bring yourself to tell her directly you can always consult your RA. Part of their job is to help mediate situations like this. If your roommate is unreceptive to talking or continues to disregard your needs after you discuss it with her, that may be a case where it’s time to request to be moved to a new room, because nobody wants to live with someone like that.\n\nBest of luck, that’s a wild first impression of college life.",
      "author": "Quantum-Bot",
      "created": 1632990684,
      "upvotes": 5,
      "replies": {
        "hetugvo": {
          "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hetugvo/",
          "text": "thank you, losing my gd mind. i have seriously been considering sleeping elsewhere and the second i started thinking that, i remembered that this is my home too and i pay WAY too much for this",
          "author": "No-Fan299",
          "created": 1632991249,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hez1vme": {
      "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hez1vme/",
      "text": "Saaaaame!!!!! My suggestion would be to get some earplugs or if it gets worse, talk to an RA or floor leader to sort out new plans of living. It does suck having to move but then again, you’ll have peace of mind",
      "author": "TheMtndewdude",
      "created": 1633095202,
      "upvotes": 3,
      "replies": {
        "hezctd2": {
          "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hezctd2/",
          "text": "i can’t wear earplugs, but i think we got it sorted out for the most part",
          "author": "No-Fan299",
          "created": 1633100209,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hey7aez": {
      "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hey7aez/",
      "text": "Go directly right now to the schools office that deals with housing issues or to the RA (that is if the RA isn't an idiot also there are a lot of dumbfk RA's at my school lol) and ask to get a new roommate or be moved. Don't let people like this ruin your life I'm dead serious",
      "author": "seantaylornation21",
      "created": 1633072647,
      "upvotes": 1,
      "replies": {
        "hezcm9q": {
          "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hezcm9q/",
          "text": "if you read the edit at the end, everything is working better now. we had a convo about it",
          "author": "No-Fan299",
          "created": 1633100124,
          "upvotes": 2,
          "replies": {
            "hezpi9p": {
              "link": "/r/CollegeRant/comments/pyf5s4/roomie_help_please/hezpi9p/",
              "text": "Ok glad to hear that, didn't see the edit lol",
              "author": "seantaylornation21",
              "created": 1633105686,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}