{
  "sid": "k2hxy7",
  "link": "/r/CollegeRant/comments/k2hxy7/is_it_okay_to_not_mind_transferring_to_less/",
  "title:": "is it okay to not mind transferring to less prestigious and less selective schools if i don’t get accepted to a more prestigious school?",
  "text": "not posting this in the main college sub because better to be safe than sorry with rules + throwaway and a few vague details for privacy\n\nso i’m a transfer student at CC applying to transfer to a university and i honestly feel kinda bad right now i’m applying to a variety of somewhat prestigious schools but also have a few safety schools that aren’t as selective and are less prestigious as backup. i mentioned to a friend that i was applying to these schools and they basically tried to make me feel bad? i definitely have the stats and meet the requirements for the prestigious schools and have a decent shot at getting accepted so these aren’t insane reaches but really dont mind going to a school that isn’t as prestigious. i get people valuing prestigious schools because of their ability to network and their insanely good reputation but honestly i don’t care so much about transferring to a less prestigious one. to be honest i would *like* to be accepted to these prestigious schools but i just want to get a decent education in the end? ultimately it’s the same degree so i really don’t care and it doesn’t make much of a difference in the end. the less prestigious ones have a decent reputation, aren’t horrible schools, i like what they have to offer in terms of programs, and i like the feeling and vibe i get from those schools so if i don’t get accepted to a prestigious school i’m not going to be upset about it...is it okay to be all right with not minding transferring to a less prestigious school? i just want some reassurance because i feel bad about this....\n\nedit: just wanted to say thank you all for your responses 😢 it means a lot!! i definitely feel better about things and come admissions decisions time i’ll be happy enough going to one of my safeties! i’m not letting lack of prestige stopping me from being happy with the school i’m going to!",
  "author": "transferthrowaway701",
  "created": 1606540843,
  "over_18": false,
  "upvotes": 60,
  "upvote_ratio": 0.98,
  "comments": {
    "gdwgk56": {
      "link": "/r/CollegeRant/comments/k2hxy7/is_it_okay_to_not_mind_transferring_to_less/gdwgk56/",
      "text": "Today’s “less prestigious” school is tomorrow’s “top 50”. Prestigious is all about age, marketing and supply & demand. Go where you feel like you’ll get the best education & outcomes. Perfect example, in Florida we have quite a few schools with law schools...two you’d say are “prestigious” one public, one private...the school with the highest bar pass rate isn’t either of those two.",
      "author": "wearamask912",
      "created": 1606587483,
      "upvotes": 3,
      "replies": {}
    },
    "gdvzpbm": {
      "link": "/r/CollegeRant/comments/k2hxy7/is_it_okay_to_not_mind_transferring_to_less/gdvzpbm/",
      "text": "Prestigious schools don’t matter unless they offer a major program you need. Its way more money for not much extra.",
      "author": "deprimada",
      "created": 1606581238,
      "upvotes": 2,
      "replies": {}
    },
    "gdvm7b9": {
      "link": "/r/CollegeRant/comments/k2hxy7/is_it_okay_to_not_mind_transferring_to_less/gdvm7b9/",
      "text": "Yes it's absolutely okay! Some degrees like engineering have a standard of the curriculum taught. So you will get the same education whether you go to a prestigious school or a small school.",
      "author": "RainyFL",
      "created": 1606575775,
      "upvotes": 3,
      "replies": {}
    },
    "gdv2m57": {
      "link": "/r/CollegeRant/comments/k2hxy7/is_it_okay_to_not_mind_transferring_to_less/gdv2m57/",
      "text": "Totally fine! Lots of successful people did not attend prestigious colleges.",
      "author": "nonconformistnugget",
      "created": 1606565394,
      "upvotes": 6,
      "replies": {}
    },
    "gduoglu": {
      "link": "/r/CollegeRant/comments/k2hxy7/is_it_okay_to_not_mind_transferring_to_less/gduoglu/",
      "text": "Not American but where I am we do have kind of the same thing, top unis and the rest. I was so influenced by what everyone thought, they believed only in the top unis and look down on the rest. This caused to me to choose whatever major just to say I attended the top unis. What I mean by whatever is...here we use point systems depending on our secondary school grades(final exam) and I chose the easiest to get into(lowest point requirement) the top unis just to be like my peers. There is nothing I regret more! I hate the course lol and honestly would preferred a smaller uni. \n\nSo I agree with you, at the end of the day it depends on what makes you happy and I bet the other ones are just as good.",
      "author": "blakppuch",
      "created": 1606555368,
      "upvotes": 4,
      "replies": {}
    },
    "gdujnh6": {
      "link": "/r/CollegeRant/comments/k2hxy7/is_it_okay_to_not_mind_transferring_to_less/gdujnh6/",
      "text": "ABSOLUTELY. For the first one/two years at the less prestigious and selective school, you’ll likely get more financial aid and end up paying less. Usually it’s a minimum of 3.0 college GPA for transfers at better schools, but you may want to shoot as high as you can (it’ll help both admittance and merit scholarships).\n\nJust try to align credits for your intended program (if you have decided) with those in the program in the school you intend to transfer to. Local technical schools usually know which courses you should take to transfer to a nearby university.",
      "author": "TrickTrot",
      "created": 1606551399,
      "upvotes": 7,
      "replies": {}
    },
    "gduehu5": {
      "link": "/r/CollegeRant/comments/k2hxy7/is_it_okay_to_not_mind_transferring_to_less/gduehu5/",
      "text": "I currently go to a “prestigious” school, and I hate to say this, but the cleanliness of the interior of your sleeping arrangements, don’t always match up with the prestige associated with the college. That being said, there are tons of schools that are great that aren’t considered prestigious, as long as where you’re applying has programs for you that you feel will be a value and that you will like the location or you like the vibes, then I would definitely say go for it. Don’t let your friend make you feel bad about it, because at the end of the day this is your decision, and you know what is best for you. I hope you get into a school that you love!",
      "author": "hereforwhatevr",
      "created": 1606546321,
      "upvotes": 14,
      "replies": {}
    },
    "gdubzit": {
      "link": "/r/CollegeRant/comments/k2hxy7/is_it_okay_to_not_mind_transferring_to_less/gdubzit/",
      "text": "It’s what you learn there that matters :) and the experiences you have.",
      "author": "tinydustball",
      "created": 1606544107,
      "upvotes": 7,
      "replies": {}
    },
    "gdu8iiz": {
      "link": "/r/CollegeRant/comments/k2hxy7/is_it_okay_to_not_mind_transferring_to_less/gdu8iiz/",
      "text": "yes of course! at the end it’s your education and whichever school you choose will be what you want. as you stated, the degree will be the same. it sucks your friend tried to make you feel bad about that though.",
      "author": "cadesha12",
      "created": 1606541283,
      "upvotes": 25,
      "replies": {}
    }
  },
  "updated": 1634062104
}