{
  "sid": "qmnnv1",
  "link": "/r/CollegeRant/comments/qmnnv1/how_do_people_make_groups_of_friends/",
  "title:": "How do people make groups of friends?",
  "text": "I see everyone with groups of friends and just wonder how do they even make them? What could I be doing wrong? I’ve joined a club and that has only gave me 2 friends but we aren’t close or anything. I talk to people in my class. I’m pretty introverted too so that could be why. The semester is about to end but I just want a group of close/best friends for next semester to go to parties with (even though I don’t party I just want the experience for once) and to just have fun like I see everyone else doing. How did you find your people in college and could anyone give me some advice because I’m tired of being lonely and don’t bond with other people well to become best friends.",
  "author": "jcks234",
  "created": 1636041285,
  "updated": 1636137989,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.9,
  "comments": {
    "hjb7w4u": {
      "link": "/r/CollegeRant/comments/qmnnv1/how_do_people_make_groups_of_friends/hjb7w4u/",
      "text": "You find your people by chance. Theres really no magic method or anything. My freshmen year my people lived on the same floor as me and had a lot of the same classes, that developed naturally. I took some time off and Im back in school now and I met a girl in one of my classes and she asked if I wanted to have lunch with her and her friends and now I hang out with them regularly. I guess the easiest way is to make friends witu someone who has an established group and then just join them often",
      "author": "taybay462",
      "created": 1636049093,
      "upvotes": 8,
      "replies": {}
    },
    "hjcdlhy": {
      "link": "/r/CollegeRant/comments/qmnnv1/how_do_people_make_groups_of_friends/hjcdlhy/",
      "text": "Honestly I'm in my junior year and this is the first semester I've made some friends. The guy in one of my classes started talking to me first and then the other class I joined a study group",
      "author": "Waddlewaddle1015",
      "created": 1636065689,
      "upvotes": 6,
      "replies": {}
    },
    "hjcgtz3": {
      "link": "/r/CollegeRant/comments/qmnnv1/how_do_people_make_groups_of_friends/hjcgtz3/",
      "text": "You meet one person and that person introduces you to other people there friends with that’s how I usually feel it goes",
      "author": "Yo_dog-",
      "created": 1636067049,
      "upvotes": 5,
      "replies": {}
    },
    "hjcvon2": {
      "link": "/r/CollegeRant/comments/qmnnv1/how_do_people_make_groups_of_friends/hjcvon2/",
      "text": "No joke, by pure luck.",
      "author": "virgin_dog",
      "created": 1636073479,
      "upvotes": 3,
      "replies": {}
    }
  }
}