{"sid": "oexiul", "link": "/r/CollegeRant/comments/oexiul/life_isnt_a_race_but_i_sure_am_losing/", "title:": "Life isn't a race but I sure am losing", "text": "This rant probably won't make sense but I need a place to put all of the thoughts that have been plaguing my mind lately. \n\nI haven't been doing the most during my undergraduate career. I'm expected to graduate in the upcoming fall semester and I have done nothing. I'm almost 21 years old and I've never had a job. I know that's a very great privilege and it might make me sound like a \"lazy\" person. I also know that no one in the job market wants me because I don't have any experience. I am depressed and I think I have autism. These aren't excuses but they're more explanations, I think. I also have an inferiority complex whereby I'm terrified that I'm never good enough or that I'm incompetent. I've applied to a few jobs but I haven't heard anything back. I'm nearly finished with my undergraduate studies and I've done nothing noteworthy. I'm certain that it's because of my depression that I have no motivation, no drive, no passion in life. I feel pathetic. Meanwhile my friend is doing the most. For instance, she spent the last year studying for the LSAT all on her own. She's looking to apply to the Fulbright Scholarship, she's interning at a court house and she's looking at law schools (although it might be worth mentioning that she is neurotypical). I feel so worthless because I've accomplished nothing with my life. I'm upset with myself for not having the same drive that other people do. I know I shouldn't compare myself to my friend or anyone else but I can't help it. I also don't know what career I want, I need to look at graduate schools, and I have no sense of direction whatsoever. The idea of grad school scares me because I can't help but think that I'm not smart enough and that I don't have it in me to get my master's (let alone get accepted to grad school). Also, since I'm not set on a career path, what good is a master's if I don't know what I want to do with it?\n\nI know that a lot of that sounds like self-pity but I don't feel sorry for myself, nor do I necessarily want sympathy. I take care of my elderly parents and my mental health has been unstable to say the least so I know that with my situation I am doing my best (kind of). Thank you to anyone who read all of my nonsense.", "author": "CluelessCapybara2421", "created": 1625586194, "retrieved": 1632842045, "over_18": false, "upvotes": 10, "upvote_ratio": 1.0, "comments": {"h48xny8": {"link": "/r/CollegeRant/comments/oexiul/life_isnt_a_race_but_i_sure_am_losing/h48xny8/", "text": "Thank you u/CluelessCapybara2421 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1625586195, "upvotes": 1}, "h4apeaf": {"link": "/r/CollegeRant/comments/oexiul/life_isnt_a_race_but_i_sure_am_losing/h4apeaf/", "text": "i have met many people with masters, some of them werent smart. being smart has nothing go do with college.  college has only one purpose, so u can get a job.", "author": "ghostmode342", "created": 1625615646, "upvotes": 3}, "h490l62": {"link": "/r/CollegeRant/comments/oexiul/life_isnt_a_race_but_i_sure_am_losing/h490l62/", "text": "I did many casual gigs to full in the time. From beekeeping to factory work. It was a long hard grind but it payed the bills. So there is that. \n\nI must say though that just becuase you have not had a job does not make you a failure. There is always time to start", "author": "Impressive-Name5129", "created": 1625587512, "upvotes": 3}}}