{
  "sid": "otfn29",
  "link": "/r/CollegeRant/comments/otfn29/as_a_former_student_dont_go_to_mount_st_marys/",
  "title:": "As a former student, don't go to Mount St. Mary's University (USA)",
  "text": "TL;DR at bottom\n\nI came to \"the Mount\" because I wanted a small campus that didn't require a car to get to all my classes. Also wanted to live on campus all four years and not worry about renting an apartment off campus. Plus, I'm Catholic, and it's a Catholic university, so I figured why not go to a college that supports my faith. Also, they gave me a full-ride.\n\nBefore I get into the bad stuff, here's a list of good aspects of the school:\n\n1. Don't have to pay for parking\n2. Don't have to pay for laundry\n3. (Usually) small class sizes\n4. Decent sports program\n5. Okay food\n6. Nice-looking campus\n7. Good amount of stuff to do on campus\n8. Nice study spaces\n9. Mostly nice staff and administrators\n\nI was gonna try and go for ten, but I ran out of reasonably good qualities the campus has. So now, I'm going to explain the bad side of campus.\n\n**1. Racism (and politics)!**\n\nOkay, you probably read that and are expecting some story about how the school contributes to systemic racism. For the most part, the school does a decent job when dealing with racial issues (it's hit or miss a lot of the time, but we'll get to that). The big problem is the location of the school.\n\nIt's in the middle of nowhere (Maryland), and let's just say the people in that area are... less than accepting of minorities. Trump flags and maga hats galore (even after the election)! A few people coming from a Trump rally tried to run over a few students one time!\n\nAs if that weren't enough, if you go into Frederick MD, aka the nearest town with a Walmart, you'll run into even more people like that. One of my friends, who is black, is constantly harrassed by random people on the street when he leaves campus. At best, they call him the n-word and move on. At worst, they try to surround him, threaten him, and tell him \"his kind\" isn't welcome in their town. Did I mention that there used to be a restaurant that served as a meeting place for local KKK members?\n\nAnd if you think you can stay on campus all year instead of going into town, you're greatly mistaken. But it's not like Mount St. Mary's is a safe haven from that stuff either.\n\nWhile the campus is very diverse and is mostly pretty accepting, you'll get a bit of spillover from the outside towns. Right before COVID hit, a Freshman (who for legal purposes, I'm going to say, \"allegedly\" did this) allegedly spraypainted the n-word on a bathroom mirror. The school took pretty quick action and expelled the student and began an anti-racism campaign beginning with an assembly, and a bunch of signs on campus that said, \"You belong here. Racism does not.\"\n\nThen, the dumbassery started. First, they unexpelled the student who spraypainted the n-word (allegedly). Yep. He's back on campus. Then the school decided, \"These anti-racism signs probably send the wrong messages to students touring the campus. Let's take them down.\" So they took down the anti-racism signs to look better for high school students and parents on tour (at least, that's the working theory of why. Nothing was wrong with the signs that warranted taking all of them down)\n\nPoint being, a lot of their anti-racism actions don't seem entirely genuine. Plus, the university seems to have a double standard with this sort of thing. One student made some pretty bad comments about BLM and got suspended. Meanwhile, one of the faculty wrote an article defending his role as one of the protestors on January 6th. He didn't personally participate in the storming of the Capitol, but he defended those who did. As far as I know, he didn't get punished at all. \n\nNow, you could argue that this is just an example of the freedom of speech allowed to faculty. The problem is that the article he wrote was linked on Mount St. Mary's official website. After some students called the university out on this, the administrators basically said \"we don't condone  what this professor says,\" but they still put it on the website, which most students felt like was less than appropriate. AND, the university doesn't even seem to care about the faculty's free speech when it comes to other matters. Take for instance the time a professor got fired after criticizing the former university president who compared failing students to bunnies that should be drowned and have a glock put to their heads ([https://www.fredericknewspost.com/news/education/schools/higher\\_ed/mount\\_saint\\_marys/mount-st-marys-university-offers-to-take-back-two-fired-faculty-members-one-declines/article\\_3912c4c1-4f96-53ef-ab3a-98957f62b981.html](https://www.fredericknewspost.com/news/education/schools/higher_ed/mount_saint_marys/mount-st-marys-university-offers-to-take-back-two-fired-faculty-members-one-declines/article_3912c4c1-4f96-53ef-ab3a-98957f62b981.html))\n\n**2. Dumb decisions (and not listening to students)**\n\nThe Mount makes a lot of dumb decisions. Some of them have reasons. Some don't. This isn't going to be as long of a section (nor as heavy as the first), but I feel like it's important to understand the incompetence of this university.\n\n1. There are no trash cans on campus. They took them all away. There used to be enough in the dorm buildings and around campus to handle all the trash the students create. Now the only trash cans that I have been able to find are in the cafeteria, outside the cafe, and by the bookstore. But last I checked, the one by the bookstore had tape over it to indicate that you weren't supposed to use it. There are dumpsters outside of the dorm buildings you're supposed to use, but if they're full (which they sometimes are), you can't leave your trash next to it or you'll receive a fine. Instead, you're supposed to just hold onto your trash until the dumpster is empty again. Also, the campus doesn't recycle. There is one recycling bin in the cafeteria, but I'm pretty sure it's just for show.\n2. The students wanted a new pool table. We asked for one. The university said they'd buy a new one if we could get 100 signatures on a petition. We got the signatures. Then they said, \"Hey, listen. We're not getting a new pool table. But how about a big, flat-screen TV in a location where nobody will actually use it?\" We all said \"no\". They took it as a \"yes.\" THEN they moved the pool table from that location, where anyone could use it at any time, to a dorm building where only residents could use it and only until around 8pm (otherwise it may disturb students trying to sleep). Now it sits abandoned and forgotten\n3. Before COVID was even in existence, the university made the really weird decision to spend a lot of money and put soap dispensers by the elevators. Not hand sanitizer. Soap. It doesn't rub into your hands. You basically have to go to a sink to wash it off.\n4. This one's just a personal one, but the university keeps accepting more and more new students every year and, in my senior year, they informed me that they didn't have enough rooms for me to get one. I ended up in an underclassmen dorm as a senior.\n5. Some of the apartments on campus don't have lights in the rooms. I had to bring my own lamps from home.\n\n**3. Lack of security**\n\nThis one is debatable. They have nice public safety officers and a lot of those blue-button things that let you make emergency calls. However, you'll notice one constant trend: a lack of security in the dorms. As far as I've seen, only one dorm building had a security camera in the stairwell. This can lead to a few problems, including but not limited to:\n\n1. When a few Freshmen decided to start pulling exit signs from the ceiling in one of the dorm buildings, they couldn't figure out who did it and every resident had to pay thirteen dollars at the end of the year for the damages.\n2. A lot of students kept breaking the elevators in the only fully wheelchair-accessible dorm building. As far as I know, they weren't caught.\n3. One of my friends had a stalker that she met on Tinder. He showed up to campus, got into her building, walked around trying to find her and asking people where she lived, etc. Because of a lack of security cameras, there was no evidence that he had been there, and the University took zero action. They didn't even ban him from campus.\n\n**4. There are cockroaches in the dorms**\n\n**5. Bad medical care**\n\nI feel like this is a universal constant when it comes to universities, but you can't visit the health clinic after 5pm or on weekends, and the care that they give there isn't very good. One time, I went there because of a really bad cough, and they told me to wait in the waiting room as there would be maybe a twenty minute wait before I could see anyone. No big deal. i sit down. Then, another student rushes in clutching his face. He explains (very painfully) that he has a broken jaw. They just tell him to fill out a form and they'll see him when it's his turn.\n\nThis wouldn't be such a problem if the hospitals weren't so far away either. I can't tell you how many times I had to drive my friends to hospitals in the area, and each time, it was a long, painful, and winding ride to get medical care.\n\n**Final words:**\n\nWell, that's all I gotta say for now. I will probably end up thinking of something else later and adding it in an edit.\n\nTL;DR: The campus isn't in a great location for minority students and doesn't seem to care very much about any racial issues that arise on campus. There is also an abundance of soap dispensers, a lack of trash cans, and an insufficient number of security cameras. Also, don't get sick or injured on campus.",
  "author": "aThrowaway4this1",
  "created": 1627496203,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.85,
  "comments": {
    "h74z1zm": {
      "link": "/r/CollegeRant/comments/otfn29/as_a_former_student_dont_go_to_mount_st_marys/h74z1zm/",
      "text": "Those incidents of racism are terrible, and it shocks me that there used to be a KKK meeting place there, but remember that being a Trump supporter does not make someone racist. I’m not a Trump supporter but I know that just because someone waves a Trump flag, they’re not necessarily racist. That’s like saying just because someone waves a Biden flag that they’re a communist.",
      "author": "ImrusAero",
      "created": 1627683986,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634062563
}