{"sid": "j81oki", "link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/", "title:": "After I emailed the dean. My professor told the class that students can't read, follow directions and should get their facts straight before opening your mouth.", "text": "I posted this on college but it's definitely a rant so I should post it here as well.\n\n\nSo my professor requires a video on or a picture for his class. I immediately added my picture during lecture. \n\nDuring the next lecture my picture wasn't showing up. The professor took a snapshot of the class and said everyone who did not  have a video or picture on would loose points. \n\nI remember during my other classes my picture was showing up. Throughout the next week my picture would sowmtimes come up and sometimes not. I emailed IT for my school and they responded they were aware of the issue and that logging in and out would sometimes help. \n\nDuring the next lecture when my picture didn't show up I tried logging in and out. It took about 15 minutes for my picture to show. \n\nI emailed IT how long it took and they said it looked like the problem was resolved. I replied that constantly logging in or out wasn't really a resolution and they replied they were looking into it. However I got a ticket that the case was closed. \n\nI forwarded the email chain to my professor to hopefully regain my points. He told me I could have turned out on my camera to gain the points and I should have it figured it out my next class. \n\nI thought maybe it was my device so I switched to Zoom on my phone. My picture always came up, same as when on my tablet. So I figured it was only my laptop that had the issue. So for the next class that required my photo I used my tablet. Only issue I was having trouble seeing what was on the screen. I have a visual impairment so I usually use a larger screen to see. I even bought a 24in second monitor to use with my laptop. I also have accommodations as I'm with services to students with disabilities. The professor is aware and even scheduled a meeting with me at the beginning to discuss my accommodations. My professor announced he would be locking the zoom lecture after 5 mins. I didn't want to risk getting locked out of the lecture and missing pop quizzes so now I always use my tablet. \n\nI forwarded the department chair the email chain and told him my concerns about having issue with getting the picture to show up and the professor locking the zoom after 5 minutes. I waited a week and I never got a response. In that same time another student emailed him about professor concerns and got a response so I was sure he saw my email. \n\nI then emailed the associate dean of the department and he emailed me back immediately saying he would speak to the professor. The associate dean emailed me back the professor didn't require a video but did require a photo , which was allowed. He never answered if he was allowed to not let students in class. \n\nI emailed him back and said I know I'm just having issues with zoom on my laptop and the time restraint. The dean emailed me back to try talking to my professor again to explain my situation.  I felt that was okay but was a little nervous as I didn't really want him to know I went above him.\n\nIn class today the professor started the lecture stating someone emailed the dean. He said that he told the department chair and the associate dean that students can't read and can't follow directions as he posted an annocument on canvas about his requirements. He ended by saying students need to get their facts straight before they open their mouth. \n\nI was immediately pissed. I was about to unmute my mic but didn't and took a few deep breathes and got some water. I emailed the dean and informed him of my professors comments and he scheduled a zoom meeting for today. \n\nA little added context:\n\nSSWD hasn't responded to my book request from the beginning of the semester and  after multiple emails with administration assistants my sswd counselor still hasn't gotten back to me. I probably should email them to get involved but I don't have much faith. \n\n\nI kinda feel like nothing is going to  happen. I still feel pissed that I was insulted. I may be wasting my time with meeting with the dean as there isn't really anything that they will do. I feel that I handled everything the way I should by going through the chain of command.\n\n\nTldr: professor requires video or picture for zoom. There's an issue IT is aware of with pictures not showing up. After no resolution with emailing professor I emailed the department chair and associate dean of the department. In lecture the professor said students can't read or follow directions and should get their facts straight before opening their mouths.", "author": "nickthatknack", "created": 1602259342, "retrieved": 1632842902, "over_18": false, "upvotes": 155, "upvote_ratio": 0.99, "comments": {"g8dgnck": {"link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/g8dgnck/", "text": "The responses on r/college is fucking insane. Whats wrong with those people?", "author": "deprimada", "created": 1602364952, "upvotes": 2}, "g8c2501": {"link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/g8c2501/", "text": "I just assume all these petty professors are the types of people who think COVID is just making our lives easier and are blind to everything else other than “taking classes at home”", "author": null, "created": 1602346187, "upvotes": 3}, "g8bz5pv": {"link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/g8bz5pv/", "text": "Even if it's just to have the full documentation that they are failing you, definitely email SSWD.", "author": "Auld_Folks_at_Home", "created": 1602344621, "upvotes": 2}, "g8aht1e": {"link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/g8aht1e/", "text": "[deleted]", "author": null, "created": 1602308476, "upvotes": 2}, "g8a8xaw": {"link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/g8a8xaw/", "text": "Can you call your office of student accessibility regarding your textbook? I work for the office at my school, that's what I would recommend to you if you were a student I work with.", "author": "Ranger_Hardass", "created": 1602301434, "upvotes": 3}, "g8a0c3g": {"link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/g8a0c3g/", "text": "I’ve had like 1 or 2 bad professors, and a ton of good ones, I’m sorry to hear you got stuck with one of the few bad ones because this whole situation sucks.  Take the advice of the other people here and save this story in your head so you can tell it over drinks to your friends.", "author": "WillTD_8", "created": 1602296004, "upvotes": 6}, "g895n17": {"link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/g895n17/", "text": "It'd kinda funny how this post has different receptions on the r/college  page.", "author": "nickthatknack", "created": 1602277477, "upvotes": 13}, "g8927i4": {"link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/g8927i4/", "text": "I’m sorry you knew that there was an issue with the picture showing up properly, but you still tried many times hoping that it’d miraculously work instead of turning on your camera?", "author": "infinitecitationx", "created": 1602275573, "upvotes": 4}, "g88tfeo": {"link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/g88tfeo/", "text": "I would recommend bringing the info from IT into the meeting with the dean as well. \n\nAlso, that teacher is into truly petty bullshit. And the dept chair is useless. \n\nKeep copies of everything. Document everything. If stupid shit like this keeps happening, escalate politely with facts. Check to see if there’s an ombudsman. Ask an advisor for further advice if needed. \n\nIn the meeting, be clear on what your preferred outcome is, or it’ll default to what’s easiest for them. Be polite but firm. Have proof on hand. \n\nSource: am dept chair & teacher", "author": "witeduins", "created": 1602270767, "upvotes": 82}, "g88o5qt": {"link": "/r/CollegeRant/comments/j81oki/after_i_emailed_the_dean_my_professor_told_the/g88o5qt/", "text": "Lmao this is so annoying. I cannot believe this is even allowed to be a requirement for a grade. \n\nI know for a fact that you can only add an image if you download the Zoom app to your computer, which I refuse to do for privacy reasons. It’s spyware. I continue to attend classes in the browser version of zoom, but it doesn’t have the full functionality of the app. \nAs a paying customer of the university you attend, you shouldn’t have been treated with the disrespect your professor displayed on the call. \n\nYou were right for emailing the dean and it sucks that the dean didn’t take your side and encourage the professor to modify his expectations. I’m sure your professor lashed out because he didn’t appreciate you going over his head, but you weren’t wrong to do so.", "author": "fcknvibedestroya", "created": 1602267934, "upvotes": 47}}}