{
  "sid": "qi59il",
  "link": "/r/CollegeRant/comments/qi59il/liberal_arts_college_i_go_to_basically_requires/",
  "title:": "Liberal arts college i go to basically requires students to have a major +2 minors in unrelated fields",
  "text": "TL;DR my strange lib-arts school doesn't let students focus on an area of study to the point that they have to have their minors each be in a different 'meta-area', if you will. This is pitched as an improvement over the norm, but has been frustrating for me, given that I'm at this school more for reasons related to money and location, rather than to have a uniquely academically restrictive liberal-arts open-marriage polygamist situation. I found the school's sales pitch for the program and it pissed me off.\n\n\\*\\*\\*\n\n&#x200B;\n\nBefore i go off with my rant, I am a aware that I should have looked into this and other colleges before going here. The reasons I did come here weren't great and i was just overwhelmed by the whole process, and so distanced myself from it as much as possible. I started feeling more intense frustration by the time i was basically in too deep, and so basically decided to ride it so i could at least have a degree.\n\nAnyways.So my college is unique from most liberal arts colleges, in that, while the typical liberal arts college has required courses, mine basically restricts which *minors* one can take. The \"Lens Program\" works like this: The options for majors and minors are categorized 3 \"Lenses\": humanities, social sciences, hard sciences+math. Once one has chosen a major(s) from \"Lens\" x, they must choose 1 minor from each of the other \"Lenses\". For example, if one choose to major in a humanities field---say, Music---, one's hard science options could be math, \\[ones that are basically for medical students, bio and chem\\], psych, or environmental sci; and the social sciences you pick a business-related minor, poli sci & sociology, sports, or education.\n\nAs one could imagine, psychology minors are very popular. In fact, I heard last semester that the school was gonna hire an additional professor, since, since the beginning of the program 5-6yrs ago, the number of psych minors has skyrocketed. If i had to guess, it is probably now second place to business administration.\n\nNow, dear hypothetical musician student, your minors are psych and marketing. The classes are ok for the first couple of years, but by year 3 you get tired of learning about the different parts of the brain in every one of the 5-or-so psych courses you've taken and you at times struggle with the rather sterile nature of the way the subject is taught 3/5ths of the time. (Side note: Anyone who claims psych is not a science is lying or hasn't had to spend hours studying all the **4 billion** different subdivisions of sleep phases for midterms). You want to drop it and just finish with courses concerning your BA? Sorry, not an option. AND you still got 2-3 courses on that minor more to go!\n\nFor a while, whenever i asked people around me what they thought of this program, I got positive answers. I felt alone in this little hell until a few months ago, when the school had a virtual meeting about it or something, in which students got to talk about their experiences with it. A friend of mine watched it and told me that a significant number of students recounted their personal frustration with the program, feeling that the were unreasonably committed to a subject which may have only somewhat interested them initially.\n\nAs for why i am typing about this, I was looking up the program's pitch on the school website and read their sales pitch, which angered me to the point where I decided to create a an account to rant about it. It basically says that they believed that the traditional required-courses didn't give people academic freedom, deriding it as \"a list of mandatory classes.\" It then says that its program is like \"having a side hustle.\" I would also like to note the misleading verb in this  \" After you’ve landed on a major, you can also choose a minor within each remaining area of study,\" since one can*not* not have a minor---let alone be allowed to lack **2 of them**.\n\n&#x200B;\n\nI'm not really sure how to end this post. It's late and I should get to working on my essay for my class.",
  "author": "pissedenoughtopost",
  "created": 1635484059,
  "updated": 1635780325,
  "over_18": false,
  "upvotes": 19,
  "upvote_ratio": 1.0,
  "comments": {
    "hihr68d": {
      "link": "/r/CollegeRant/comments/qi59il/liberal_arts_college_i_go_to_basically_requires/hihr68d/",
      "text": "Sounds like you’re just not looking up with the school you chose to go to is about. It wasn’t a secret. It’s on the website.",
      "author": "AloneWithFriends",
      "created": 1635500230,
      "upvotes": 5,
      "replies": {}
    },
    "hiivpz6": {
      "link": "/r/CollegeRant/comments/qi59il/liberal_arts_college_i_go_to_basically_requires/hiivpz6/",
      "text": "Do you happen to go to BYU Hawaii?",
      "author": "No_School1299",
      "created": 1635521732,
      "upvotes": 1,
      "replies": {}
    }
  }
}