{"sid": "js1fjc", "link": "/r/CollegeRant/comments/js1fjc/over_this_semester/", "title:": "Over this semester", "text": "I’m at the point in the semester where I really don’t care anymore. I made a 33 on a quiz and was like dang that’s unfortunate and went on with my life. Anyone else feel this way?", "author": "kenpen09", "created": 1605069207, "retrieved": 1632950254, "over_18": false, "upvotes": 269, "upvote_ratio": 1.0, "comments": {"gbzs85x": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbzs85x/", "text": "I can feel your pain. I just discovered this Subreddit and I came here to post a question. It seems that I am not the only one having trouble with courses. \n\nIf it makes you feel better, I have not passed any of my three exams in a single course. It's a financial accounting course, and it's the most difficult course I've come across. If you're curious on my grades of these three exams...\n\nExam 1: 48%. Exam 2: 35%. Exam 3: 49%. Exam 3 just happened yesterday and I studied so damn hard on that one, just to have it flop like that.\n\nI won't lie, I kinda entered a depressed state upon receiving my grade. This may be the first time I may fail a course. And it hurts. A lot. Especially since I spent so much time on Exam 3.", "author": "Fun-Detective-6089", "created": 1605144011, "upvotes": 3}, "gbz93il": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbz93il/", "text": "This!! I was obsessed with having all A’s but now I don’t care as long as my gpa is good enough to keep my scholarship.", "author": "tiffytiff101", "created": 1605133923, "upvotes": 4}, "gbyveo1": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbyveo1/", "text": "I don’t study anymore. It’s hard to find the motivation and energy to study.", "author": "yeahmorgs", "created": 1605125422, "upvotes": 9}, "gbyl9qk": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbyl9qk/", "text": "I've had this mentality since the beginning of October. Honestly I'm just ready to be done with it all so I can put it behind me. My classes aren't too bad since all I have to do is submit assignments, but I have ZERO motivation to even do the simplest homework. My procrastination isn't even the issue 😒", "author": "smurffeet", "created": 1605120395, "upvotes": 5}, "gbycjbp": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbycjbp/", "text": "This whole thing feels like a strange, never-ending fever dream.", "author": "camilahorchata", "created": 1605116080, "upvotes": 5}, "gbya6jk": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbya6jk/", "text": "I got a 33 on an exam, way below average, but since my uni allows P/F, Ionly need a 20-30 on the final to pass and that is all I care about. And yesterday I did the math to find if I get at least a 20/100 average on the remaining assaignments, I can get away with getting around 40 on the final to pass. I have very low standards this semester.", "author": "fgweuyifh89y48", "created": 1605114918, "upvotes": 8}, "gby3vtw": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gby3vtw/", "text": "Definitely, and it’s put me through a loop. Any bad grade I got back used to affect me so much that I’d cry and stress a lot wondering where I went wrong. Of course I always picked myself up and strived to improve and learned more in the process.\n\nNow though, any grade back doesn’t seem realistic anymore, like at all. Honestly nothing is feeling very meaningful or substantial this semester and it’s crazy. So no, you’re definitely not the only one!", "author": "Myztemy", "created": 1605111815, "upvotes": 2}, "gby2b1y": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gby2b1y/", "text": "I’m over it. I’m done. Idgaf anymore. This is all too much", "author": null, "created": 1605111029, "upvotes": 3}, "gbxxb2l": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbxxb2l/", "text": "in one of my classes i got 50s on both the crucial exams but i’m not even motivated to try harder or anything. i currently have a 76 somehow so that’s all that i care about. my prof isn’t even understanding about how hard this semester is. i’m so over it", "author": "SaffronCat13", "created": 1605108461, "upvotes": 2}, "gbxrobo": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbxrobo/", "text": "I don't get why they won't allow you to see your current grade. Surely they don't want students asking what their grade is and have to calculate it. Especially at the end of the semester", "author": "vness1213", "created": 1605105393, "upvotes": 9}, "gbxpl60": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbxpl60/", "text": "I'm over professors making some homework assignments super detrimental to your grade if you forget something, then not tell you how much it's going to impact your grade. Literally could make the difference between and A and a B (like 6% difference for one assignment that was definitely busywork and took all of 10 mins).\n\nI really need to get accommodations at this point.", "author": "SweetTeaBags", "created": 1605104148, "upvotes": 2}, "gbxhqvm": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbxhqvm/", "text": "Same. I’m ready for thanksgiving break just so I don’t have to do any of this busy work for a week", "author": "SpicyL3mons", "created": 1605098760, "upvotes": 7}, "gbxdzrd": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbxdzrd/", "text": "I honestly have been feeling that since before covid started lol. I’ve been getting decent grades but the only thing I care about now is getting my degree and gettin the hell outta college", "author": "CantuTwists", "created": 1605095435, "upvotes": 8}, "gbx4f2g": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbx4f2g/", "text": "This is me right now. Everyday I feel awful", "author": "Pmx-yu", "created": 1605085042, "upvotes": 3}, "gbx2k1z": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbx2k1z/", "text": "Honestly me too. I think Covid is the root of it all. Since Covid hit I didn’t even care about my grades I got in senior year of high school. I still don’t, to an extent. I have 0 motivation and half ass every assignment pretty much", "author": "kenzieeeeeeee", "created": 1605083041, "upvotes": 23}, "gbx19zz": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbx19zz/", "text": "I feel the same way. I gave up putting up effort in my assignments. I actually ok with getting Cs this semester. So much is going on in my personal life that I just do not care anymore much about my \"future\". I'm tired.", "author": "iamsojellyofu", "created": 1605081746, "upvotes": 50}, "gbx0rmx": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbx0rmx/", "text": "I used to get so unbelievably mad at myself when I got below like an 85 on an exam. Got a 45 on an exam awhile back and was like meh. Fuck this shit, online is the worst. Id rather risk death by in person classes than continue life like this.", "author": "wherearetheturtlles", "created": 1605081245, "upvotes": 62}, "gbwwfbc": {"link": "/r/CollegeRant/comments/js1fjc/over_this_semester/gbwwfbc/", "text": "I feel the exact same way, where I'm to the point where if I pass that's all that matters. Idc about a failed grade here and there.", "author": "purplechaiselounge", "created": 1605077143, "upvotes": 75}}}