{"sid": "nj0gwi", "link": "/r/CollegeRant/comments/nj0gwi/so_disappointed_in_myself/", "title:": "So disappointed in myself", "text": "In high school I struggled a lot with math I gave up a lot mainly Bc of crazy stuff going on with my life I slacked off a lot my sophomore and junior year. \nFast forward and I’m done with my freshman year and I’m so behind in math.\nI had to take a pre req to be eligible for the pre req to the pre req to the pre req for the class I actually need to take. I still need to take two more classes before I can take the class I was supposed to be done with by first semester. Bc I can’t take that class yet I’m not eligible for the Chem  class I need to take so I’m behind on that too. I have so many classes I need to take still and will have to do summer school this summer and the summer after next school year. \n\nI’m gonna have to take at least 5-6 classes each term if I want to take my 3rd year on time. Idk if that’s a lot but I also have to work 30-39 hours a week. \n\nBasically I just feel so upset that I’m not gonna be “on time” or at the same pace as everyone else and that the next year of my life is gonna be hell. I just wished I had realized sooner how much impact my academic choices in high school would have on me now.", "author": "Cooch_2119", "created": 1621746039, "retrieved": 1632842333, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"gz4qw9f": {"link": "/r/CollegeRant/comments/nj0gwi/so_disappointed_in_myself/gz4qw9f/", "text": "Thank you u/Cooch_2119 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1621746040, "upvotes": 1}, "gzgh92p": {"link": "/r/CollegeRant/comments/nj0gwi/so_disappointed_in_myself/gzgh92p/", "text": "Idk if employers are strict with \"being on time\" when they really look at you as a whole. If they like you as a person, worker, learner, skill sets, experience and education.\n\nif you're able to fulfill their specific roles then you would be able to get the job unless someone better comes. Not that you didn't qualify, rather they found someone with more which is how the market works I'm guessing.", "author": "executordestroyer", "created": 1621989455, "upvotes": 1}, "gz67ii5": {"link": "/r/CollegeRant/comments/nj0gwi/so_disappointed_in_myself/gz67ii5/", "text": "I’m in the exact same boat as you. I’m taking elementary and intermediate algebra rn, then in the second part of summer I’m going to take intermediate so I can take college algebra in the fall in order to take the chem class that requires it as a cocurrent class.\n\nIt’s a pain I feel you. I have to take that fall chem class to get into chem 101 so I can finally take bio classes. I’m not sure if I’ll graduate in three years, but I’ll try.\n\nThe way I look at it, in ten years, it won’t seem so bad. Right now we can only see the beginning and it seems like too much. Just take it one day at a time, we’ll both get there in the end.", "author": "Crochitting", "created": 1621785268, "upvotes": 1}}}