{"sid": "mwhtah", "link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/", "title:": "Parents don’t get what college is really like", "text": "I just got into a little argument with my parents at dinner because I was trying to explain how I envy just having to work as opposed to being in school because the stress is entirely different. Of course work is stressful. But being able to A) earn money from it and B) come home and ... that’s it and C) in their case at least having a real sense of stability. I tried to make the comparison— imagine the most stressful thing you have to do at work, where you feel so confused and in over your head, you have to do that every day and then after that you go home and have to do it for 4-6 more hours. I will add that my dad never went to college and now has a really good job (which could never happen now) and that my mom went to cosmetology school part time. So neither of them have a real grasp of what it’s like to be in my shoes. So right now I’m broke, exhausted, and have literally no idea what I’m doing with my life— and somehow they think that our situations are equal because they’re different. I don’t want to minimize the stress they feel but I just don’t even know how it could compare. I’d take a mistake at work or interpersonal relationship stress any-day over trying to study for 7 hours for my economics exam that looks like it’s in a different language to me and makes me feel like my brain is turning on itself and then u get to the point of ur brain just blocking your ability to do anything. School just makes me feel like shit all the time. Burnout is so real... okay thank you rant over.", "author": "comradekisses", "created": 1619134086, "retrieved": 1632951410, "over_18": false, "upvotes": 46, "upvote_ratio": 0.98, "comments": {"gw5nha3": {"link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/gw5nha3/", "text": "I worked for a decade before going back to school and I can say that hands down, school is way more of a grind for exactly the reason you state...you never get to mentally walk away from it. If you want to do well, it feels like you’re not living in any other way besides eating and breathing schoolwork. \n\nThat’s not to say there aren’t jobs that involve a lot of after hours time, but generally speaking it’s nowhere near as stressful.", "author": "alonebadfriendgood", "created": 1619605679, "upvotes": 2}, "gvxqvlh": {"link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/gvxqvlh/", "text": "The difference between school and work is huge. My entire friend group doesn’t go to college like me. Although they are very understanding and supportive which is wonderful.\n\nThey leave for work and come home to do whatever they want.\n\nI leave for school and come home to a mountain of school work OR leave for my part time job. \n\nSo no, sorry guys, I won’t be hoping on Xbox tonight either. I’ll be crying with my textbook.\n\nGood luck to you.", "author": "Morning_Frost_", "created": 1619449720, "upvotes": 2}, "gvk0r88": {"link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/gvk0r88/", "text": "COME HOME AND THAT'S IT is underrateddd", "author": "feiruzian", "created": 1619178306, "upvotes": 2}, "gvjx80i": {"link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/gvjx80i/", "text": "I can understand where you are coming from. I work part time as a pharmacy technician and at one point during winter break it felt exhilarating to only have to worry about work. I almost wanted to just work full time, quit school and enjoy my life\n\nBut ill just wait until after pharmacy school....", "author": "TheRapidTrailblazer", "created": 1619175664, "upvotes": 2}, "gvjt9i6": {"link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/gvjt9i6/", "text": "Depends on the job, your boss and the people you’re working with. If everything is good, you enjoy what you do and your boss isn’t crazy, life is great. \n\nSchool is the same way. Depends on the professor, the students in your course, any group projects (?), etc. \n\nComparing the two is basically a long winded conversation of who is enduring the most suffering at that point in time. Everyone is dead inside. Used and confused. Waiting for the lights to finally burn out.", "author": "majoroofboys", "created": 1619172253, "upvotes": 1}, "gvjc1u8": {"link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/gvjc1u8/", "text": "[deleted]", "author": null, "created": 1619156873, "upvotes": 2}, "gvjac2b": {"link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/gvjac2b/", "text": "I’m 30 years old and have had many jobs before coming to college. I tell my younger classmates all the time to never let anyone tell you that you’ve got it easy. College is more difficult than most 8-6 jobs 10 fold.", "author": "thnx4thememeories", "created": 1619155568, "upvotes": 14}, "gvj2tf5": {"link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/gvj2tf5/", "text": "Wow I just had this convo with my parents a few weeks ago.\n\nBut yea, I feel the same way you do. I envy my family that go to work, get paid, and then come home and chill. They literally get paid!....and their work doesn't follow them into the night and following days.\n\nIn college, I'm literally broke all the damn time. I'm forced to spend hours and days, pouring blood sweat and tears into homework and other academic shit. It follows me after the classes are over. I cant just come home chill. And I make zero money from this shit. I literally hate it.\n\nAnd they act like I have it easy. At least they can save up money and buy shit they want. At least they have free time after 5pm to do whatever the fuck they feel like doing. I constantly have to turn down participating in family activities cus \"ive got homework to do\". I can't buy things I've wanted for years cus you dont make money in college. \n\nLike...id easily trade places with them. Id love to come home from the office or whatever, and relax knowing I'll get a paycheck come Friday.", "author": "Throwaaawaayyy123456", "created": 1619150445, "upvotes": 6}, "gvilqw0": {"link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/gvilqw0/", "text": "As someone who works full time and goes to school, work is wayyyyy worse. However this doesn’t mean your feelings are invalid. Instead of trying to compare the two in terms of differences, explain it to your parents in ways that they are alike. “Ex: Going to school is like having multiple projects due on a strict deadline and you have no co workers to help. “ if you explain it like that, your parents might be able to understand better because they’ve been in situations like that.", "author": "jessicaa-iv", "created": 1619141296, "upvotes": -4}, "gviawbz": {"link": "/r/CollegeRant/comments/mwhtah/parents_dont_get_what_college_is_really_like/gviawbz/", "text": "They don't they just want you to go and still somehow do everything else.", "author": null, "created": 1619135808, "upvotes": 12}}}