{"sid": "j6zz2z", "link": "/r/CollegeRant/comments/j6zz2z/i_cant_keep_up/", "title:": "I can’t keep up.", "text": "I am having a really hard time keeping up with everything this semester. I feel like there’s not enough time in my day, no matter how early I start or how I study. I am a lecture behind my anatomy class, my neuroanatomy class I am 7 lectures behind and I have a midterm in 2 day, my psychology class I am like 4 units behind. The only class that I’m not behind on is organic chemistry but I probably just failed the exam because I didn’t study enough despite thinking I knew it. It seems I am also playing catch between anatomy and organic, and I am neglecting my other 2 classes. I am overwhelmed.", "author": "denver_rose", "created": 1602106558, "retrieved": 1632950920, "over_18": false, "upvotes": 82, "upvote_ratio": 0.99, "comments": {"g84hymx": {"link": "/r/CollegeRant/comments/j6zz2z/i_cant_keep_up/g84hymx/", "text": "I switched to a different major and being in college during this pandemic, my concentration, motivation, and drive to succeed have basically dwindled. Some professors need to realize that this is a horrible time for everyone, both academically but also financially for many. Fortunately I’m not in a bad financial situation, but many are, like many students at my university are having a difficult time finding ways to fund their education. \n\nIt also sucks because doing any schoolwork at home doesn’t feel like working for many people including myself, it’s like a mixture of an eternal siesta and a fever dream. It’s difficult to follow lectures and stay motivated, and it’s also difficult for me to do all of the practice problems they throw when I have 4-5 other classes to worry about. Like I’m already overwhelmed enough, lol.", "author": "camilahorchata", "created": 1602176128, "upvotes": 3}, "g82r69j": {"link": "/r/CollegeRant/comments/j6zz2z/i_cant_keep_up/g82r69j/", "text": "Take less classes per semester and find a good balance.", "author": "qwasy_", "created": 1602128263, "upvotes": -5}, "g82nsco": {"link": "/r/CollegeRant/comments/j6zz2z/i_cant_keep_up/g82nsco/", "text": "the trick to college is; never having to play catch-up. just stay up", "author": "43theintern", "created": 1602126150, "upvotes": -4}, "g82l9k4": {"link": "/r/CollegeRant/comments/j6zz2z/i_cant_keep_up/g82l9k4/", "text": "This is how I feel about my courses right now. I’m legit struggling to meet deadlines and though I’m giving effort, and for the first time in my life, I’m worried about failing my classes. My teachers aren’t exactly grading easy either.", "author": "Honest_Man_76", "created": 1602124695, "upvotes": 8}, "g82kg6y": {"link": "/r/CollegeRant/comments/j6zz2z/i_cant_keep_up/g82kg6y/", "text": "Glad to know it isn't just me experiencing this! This semester just feels like a constant game of catch-up.", "author": "KittyKatzB", "created": 1602124259, "upvotes": 4}, "g81oby8": {"link": "/r/CollegeRant/comments/j6zz2z/i_cant_keep_up/g81oby8/", "text": "Same. I constantly feel like I'm drowning. I've never been this overwhelmed.", "author": "khanstantaly", "created": 1602107155, "upvotes": 49}}}