{"sid": "nqruqy", "link": "/r/CollegeRant/comments/nqruqy/dropped_my_summer_distance_education_classes/", "title:": "Dropped my Summer \"Distance Education\" Classes, Academic Advisor Talking to Me Like I'm a Halfwit", "text": "So I dropped my summer classes because I learn better in a classroom with other students, especially having a ND (neurodivergent) brain. I assumed online courses were going to be live zoom classes, but alas it is not. I am basically teaching myself, so I sit here wondering, why am I even paying for these classes? So if I drop these classes, I at least get a 75% refund before tomorrow, because tomorrow it drops to 50%.. anyways, I would also like to spend this time studying to take my Accuplacer test so I won't have to take as many General classes. \n\nSo I emailed this to my academic advisor last night, and he gets back to me talking to me like I'm some simpleton, this was the beginning of his email: \n\n \"The Distance Education courses do not meet via zoom; the courses you are thinking of are \"virtual\" courses.\n\nI do not encourage you to drop these courses and would love if you would stick them out and put in the time necessary to successfully complete them. You just need to put aside time nearly each day, whether you feel like it or not, and devote that time interrupted to your classes.\"\n\nIt rubs me the wrong way, first off, that I wrote him a well worded email stating why I mentally cannot teach myself these things. I also stated I'd like to get back on medicine even to help me through these courses when in person classes start as well, so I can be better prepared. The fact he put in \"whether you feel like it or not\" rubs me the wrong way, it's not a matter if I feel like it, it's a matter that this is absolutely not my learning style. Maybe I'm looking to deep into it, maybe I'm PMSing and getting touchy, but I'd expect him to understand that this Distance Education isn't for everyone. Also, wouldn't it be easy to think that Distance Education would include virtual courses? I suppose it's my bad for assuming live Zoom Classes would be included and not asking. \n\nI already feel like a failure for dropping these classes and when he said \"whether you feel like it or not\" stung because I want to get my education, I feel like getting my education, I want to do something better with my life, it's just simply not my learning style to teach myself, which is what is happening here. Also, why am I paying regular price for classes when it IS up to me to teach myself? \n\nAnyways I hope I posted this in the right place, I'm new to Reddit.\n\n&#x200B;\n\nTLDR; Dropped summer courses because it's not my style of learning, email academic advisor sent me rubs me the wrong way.", "author": "pastatuite", "created": 1622656508, "retrieved": 1632842287, "over_18": false, "upvotes": 40, "upvote_ratio": 0.92, "comments": {"h0c9cjs": {"link": "/r/CollegeRant/comments/nqruqy/dropped_my_summer_distance_education_classes/h0c9cjs/", "text": "Thank you u/pastatuite for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1622656509, "upvotes": 1}, "h0zx5ep": {"link": "/r/CollegeRant/comments/nqruqy/dropped_my_summer_distance_education_classes/h0zx5ep/", "text": "I'm also a student with ADHD who struggled with online classes. It took me a bit to figure the whole online school thing out, but this is what worked for me: every day I scheduled time to dedicate to each class like it was regular class that I had to go to. I checked the class schedule every day for every class and made a myself a checklist of what was due and what I needed to work on. For assignments, if I had a lot of reading, I would break it down into chunks and then stop after I hit a major idea and I literally talked it out loud to myself and then wrote short summaries or made vocabulary lists. Quizlet is a really awesome tool for that because you can make them into games on your phone. If it was material that I wasn't particularly excited about, I would set goals for the amount of work that my brain could actually handle at one time and then find something that I enjoy to do for like a 15-20 minute span to reward my brain.\n\nHonestly, once I started figuring out what worked for me, I actually started to like online learning. Because you have the freedom to learn the material using strategies that work for you. If you have a formal diagnosis, reach out to your school's disability services. They are the professionals that are there to help you figure out some of the learning strategies and accommodations you might need to get going. You're still entitled to those services even taking an online course.\n\nYou're also definitely reading too much into what your advisor said. He not so eloquently was saying that you need to motivate yourself to build a routine and you will succeed just fine. That's what was meant by \"whether you feel like it or not.\" It is probably worded as \"set a routine for yourself and try your best to stick to it, even on the hard days where motivation is fleeting.\" And honestly it isn't horrible advice. For a lot of people who are neurodivergent structure is everything. \n\nLastly, self guided learning from provided materials is not \"teaching yourself\" it is literally just studying and doing assignments without the step of it being lectured to you. And as I said above, you just need to figure out what works best for you to get the information into your brain. That takes work and a lot of trial and error.  Personally I took some time to research studying and learning strategies for people with ADHD and tried a whole bunch\nOf things until I felt comfortable.", "author": "BrainsOnFire1617", "created": 1623127626, "upvotes": 1}, "h0lwpub": {"link": "/r/CollegeRant/comments/nqruqy/dropped_my_summer_distance_education_classes/h0lwpub/", "text": "1.) You aren't \"teaching yourself\" if the instructor has provided the materials. Just because you have to read doesn't mean you are teaching yourself either.\n\n2.) There is no such thing as \"learning styles.\" This was a pedagogical buzzword a decade ago but there is no evidence that students only learn one way. In fact, challenging yourself with different approaches to content is the biggest opportunity for growth.\n\n3.) This is also true for AD/ADHD, autism, and other neurodivergencies. \n\n\nYou are not helping yourself by avoiding a certain kind of class. What you are doing is making excuses for not wanting to work hard. If you want to avoid hard work or have more free time that's fine, but be honest with yourself about it, instead of concocting these halfbaked excuses.", "author": "TheProfessorsCat", "created": 1622837604, "upvotes": 1}, "h0dppdm": {"link": "/r/CollegeRant/comments/nqruqy/dropped_my_summer_distance_education_classes/h0dppdm/", "text": "[deleted]", "author": null, "created": 1622679783, "upvotes": 12}, "h0dpgx3": {"link": "/r/CollegeRant/comments/nqruqy/dropped_my_summer_distance_education_classes/h0dpgx3/", "text": "Just ignore the AA and go on with your day.   \n\n\nAnd just so folks (generally know): most colleges make a huge amount of money off the break (summer/winter) session classes - generally any tuition/fees paid for these are largely profit for any school, so there is going to be a huge push for students to take them and stay in them.  (this may explain some of the push back)   \n\n\nAnd yeah - many residential colleges have different terminology used to explain async classes (such as what you describing - distance education is commonly used)  and \"live\" zoomed classes - which is what everyone got used to during the pandemic.   It is always a good idea to double check and be clear before registration -- especially now since there will be a bigger push towards \"normality\"", "author": "minilibrarian", "created": 1622679669, "upvotes": 3}, "h0d44cl": {"link": "/r/CollegeRant/comments/nqruqy/dropped_my_summer_distance_education_classes/h0d44cl/", "text": "Eww he's a dick for talking to you like that. Just because we are students doesn't mean you should be treated like a child.", "author": "kimlovescc", "created": 1622669418, "upvotes": 10}, "h0d3hiz": {"link": "/r/CollegeRant/comments/nqruqy/dropped_my_summer_distance_education_classes/h0d3hiz/", "text": "1.) if you’re paying you can do whatever the fuck you want! 2.) this dude is an asshole. oh my god. this is so patronizing. i hate this. 3.) you are amazing, smart, and you absolutely made the right decision to prioritize your education by only doing it when you can actually learn. 4.) WHY WOULD YOU PAY TO TEACH YOURSELF that is what drives me insane", "author": "radghostgirl", "created": 1622669141, "upvotes": 11}, "h0cqwye": {"link": "/r/CollegeRant/comments/nqruqy/dropped_my_summer_distance_education_classes/h0cqwye/", "text": "You are always the expert in yourself.  Don’t apologize for knowing what you need and not settling for less.", "author": "momlv", "created": 1622663849, "upvotes": 26}}}