{"sid": "k3ozyc", "link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/", "title:": "7-10 page research paper draft for English class due in 3 and a half hours and i have written just the introduction :) i also have a presentation to do tomorrow for my communications class", "text": "before you tell me that i should be working on my essay rather than posting on reddit: i know :) i’m stupid and procrastinated on this a bit too much and now. im so lost on what to do\n\ni feel really paralyzed. i can’t work on this stupid essay i’ve been desperately looking for research from my school’s library database to cite and mold to my thesis but i just can’t. research is way too hard and frustrating and i feel like giving up and at this point i’m just sitting watching the hours tick away till the deadline. i feel so incredibly paralyzed and hopeless i know it’s just a draft but i need to finish as much as i can for adequate feedback from my prof that i can use for the final draft just god someone please help me i just needed to get my feelings out there i feel like i’m drowning in so much work and i can’t do anything about it i know it’s just a draft but my perfectionism is hurting me to the point where i just can’t write and i feel like what i put out is not going to be good at all\n\nEDIT: okay wow i didn’t expect this post to get the traction it did?? anyway though i feel relieved to hear that many of you are in the same boat!! and for those wondering i did manage to turn in the essay draft. it’s not complete, but more complete than i thought it would be! and i also did my presentation today and managed to do something half decent at least.\n\ni’m pretty sure the final draft isn’t due till next week, but i plan to work on it this week so i won’t panic when it comes time to turn it in. this is the last real assignment that i need to do, so after i’m done with this i’m done with this english class.\n\nthank you all for your support and advice!! and for those of you that are struggling like i was with the draft, we’ll get through this. the semester is almost over; we just need to stay strong and work as hard as we can! 💪", "author": "Vivid-Outcome8291", "created": 1606711491, "retrieved": 1632842891, "over_18": false, "upvotes": 160, "upvote_ratio": 0.98, "comments": {"ge5xi9u": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge5xi9u/", "text": "[removed]", "author": null, "created": 1606756183, "upvotes": 1}, "ge5wizj": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge5wizj/", "text": "Apparently listening to like coconut mall or other Mario kart music is supposed to help some ppl lol. Good luck!!", "author": "FunkyLittleAlien", "created": 1606755705, "upvotes": 1}, "ge5sgkv": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge5sgkv/", "text": "if it makes you feel better ive done this twice in my politics class this semester and got a 94% and 90%", "author": "Snoo_90736", "created": 1606753724, "upvotes": 1}, "ge5prdb": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge5prdb/", "text": "Geez, for anyone else I can offer some help for getting a long essay done fast!\n\nDo speech-to-text and then edit in a grammar checker. You'd be surprised how much our speech is when it translates to text!", "author": null, "created": 1606752388, "upvotes": 1}, "ge5mgz3": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge5mgz3/", "text": "Hey, I'm in my first semester of grad school so I've been through the whole undergrad torture AND I'm also a big procrastinator due to anxiety and perfectionism and I wanna help you a little bit with some sites that honestly have saved my ass time and time again when it comes to research.\n\n1. Use google scholar. It gives you the widest array of research. However you also should use your library database as well for a more nuanced look at what you're looking for. I noticed that you're searching for something about happiness and family time (?) so type in society AND family time or happiness AND family or something like that, not your entire thesis statement. Look at every article that's title seems to be something about what you're working on!\n2. If you come across an article that you can't access and your school doesn't have access, DO NOT PAY FOR IT!! Read the abstract, see if it has some type of similarity with what you're studying. If it does use this website\n\n[https://sci-hub.se/](https://sci-hub.se/)\n\nIt removes all of the barriers for the article and most likely has the article you need in a full PDF! I've been using it forever and it has not failed me yet. Just make sure to type in the DOI because that usually gives me better results over just the article title.\n\n3) Great you have the article in full but there's no way you can read this many articles in this short amount of time, that's were this website comes in.\n\n[https://www.skimcast.com/](https://www.skimcast.com/)\n\nThis website highlights the most important points of an academic article. IT MAY miss some things so it is not 100% perfect. If you're really trying to be smart and have time, read one article in it's entirety and then read it with a 30% skim and see how much it misses to see how much skim it takes you to \"get\" the gist of the article. I feel comfortable around 35% because some of the tertiary points get missed with just 30%. Read the highlighted stuff and see if the gist of the article makes sense, cite it and BAM! By no time you'll have enough research to feel comfortable talking about it in your paper!\n\nGood luck happy researching !", "author": "Jumpy-Comfort", "created": 1606750745, "upvotes": 1}, "ge5lqp3": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge5lqp3/", "text": "At least it’s a draft, I feel that. So many assignments I’ve submitted at 11:59 pm. Like others have said, at least you’ve tried and done something instead of nothing", "author": "CantuTwists", "created": 1606750368, "upvotes": 1}, "ge5gvlu": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge5gvlu/", "text": "I don't blame you, it's not impossible but I did do 2 very mediocre 8 page papers in one day.... Procrastination is a horrible habit", "author": "Kasenom", "created": 1606747720, "upvotes": 1}, "ge5ch37": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge5ch37/", "text": "I have a baaaaad feeling this is gonna be me in a few weeks because I keep telling myself to catch up/do something and I don't :)))) I've handed in most of my work late this semester too, which is whack because it's all online and \"more accessible\". I just have no motivation and no space to think.\n\nEdit: spelling", "author": "pancakebirdpowder74", "created": 1606745021, "upvotes": 1}, "ge5blwm": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge5blwm/", "text": "If this makes you feel any better I didn’t know I had a project in my intro to film class when I was a freshman so my professor kindly let me try to pull something together in the hallway and I got an 80. I received a B for the whole class. And if you’re wondering if the assignment was due when I walked into the lecture... you are correct. 🥴", "author": "oliviasad", "created": 1606744442, "upvotes": 3}, "ge5b4p5": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge5b4p5/", "text": "You’re not the only one I have a 10 page paper due Tom morning and I’m only at page 5 I have carpel tunnel and major depression so I’ve just been working and focusing on other assignments that were due first now today I have to get this shit done and good luck !!\n\nEdit: the only good part about procrastinating is feeling alive afterwards and proud of yourself when you turn it in", "author": null, "created": 1606744119, "upvotes": 3}, "ge4usan": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4usan/", "text": "In the words of my college English professor, \"It's supposed to be hard.\" \n\nYou just have to do it despite it being hard. There is no trick at this point other than forcing yourself through it. It's not realistic to write 7-10 pages in only 3 and a half hours, so just write as much as you can, and use it as a lesson for next time.", "author": "SquigglyHamster", "created": 1606728645, "upvotes": 1}, "ge4siul": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4siul/", "text": "[deleted]", "author": null, "created": 1606726232, "upvotes": 5}, "ge4r3go": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4r3go/", "text": "im gonna play stupid and just say I didn't understand it, see it how it all goes, im not gonna go through all this stress when i know very damn well this degree is worth jack shit", "author": null, "created": 1606724774, "upvotes": 0}, "ge4q98f": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4q98f/", "text": "I need to know if you ended up getting it done", "author": "jjthejetplane42", "created": 1606723948, "upvotes": 1}, "ge4ncis": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4ncis/", "text": "I'm a screenwriting minor and have been bullshitting and missing deadlines all semester. This was supposed to be the week when I finally get it together, and I just want to cry. I'm supposed to turn in another 15 pages tomorrow (that I'm behind on) and the whole second act of a feature script by Wednesday. I've had all week and have barely written a page. \n\nI completely relate to that feeling of being paralyzed. It takes me days to complete essays and assignments that should only take hours. This semester sucks.", "author": "discodolphin1", "created": 1606721248, "upvotes": 10}, "ge4il1r": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4il1r/", "text": "Oh my gosh I literally just experienced the same thing, if I can be of help let me know.", "author": "ZenfulRelic", "created": 1606717086, "upvotes": 2}, "ge4g4gf": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4g4gf/", "text": "experiencing the exact same thing with a 12 page psychology literature review & a 10 page cognitive science research paper. it’s exhausting and i totally understand how you feel. i actually just posted a rant about this similar topic, i feel like hiring someone to write it for me so i can try to redeem my mental health. its definitely exhausting but you are doing good. just keep pushing, the semester is almost over. take care friend", "author": "maddiegazzelle8", "created": 1606715098, "upvotes": 2}, "ge4eea6": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4eea6/", "text": "Just use google scholar", "author": "meow2515", "created": 1606713793, "upvotes": 2}, "ge4drhs": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4drhs/", "text": "Tbh I feel the same way when working on an essay too. My professor told us to find sources in the library database which I don't like using because some sources are available but some do not. My best recommendation is to just try to do it and it's okay to procrastinate because I did it too. You can do this!", "author": "hanakoyo", "created": 1606713323, "upvotes": 1}, "ge4dbg7": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4dbg7/", "text": "It’s going to be okay, everything will work itself out. It’s better to turn something in rather than nothing at all. You’re beating yourself up for only writing the thesis, but in my eyes that’s a solid couple of steps away from earning a zero. And also it’s only a draft! Reach out to your professor and express how you’re having a really hard time with research, maybe they can help give you pointers, and turning in a thesis will at least help them know what direction you want go in. As long as you’re putting in effort no one can be mad at you. I believe in you :)", "author": "weeaboogirl", "created": 1606712998, "upvotes": 8}, "ge4d709": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4d709/", "text": "Also procrastinating work rn. Struggling to motivate myself rip good luck", "author": "fcknvibedestroya", "created": 1606712910, "upvotes": 2}, "ge4cxlq": {"link": "/r/CollegeRant/comments/k3ozyc/710_page_research_paper_draft_for_english_class/ge4cxlq/", "text": "If it makes you feel any better, you’re not the only “stupid” one here. I just submitted the final draft of my research paper at 11:52 PM, just 7 minutes before it’s due. I procrastinated one whole week only to write it under extreme pressure in just 2 hours. This is not even the worst part. The worst part is me staring at a blank document for the whole day, just to start writing it 2 hours before it’s due. At this point, I’m asking myself, why do I even bother?\n\nSorry I got a little carried away. It’s just that your post hit too close to home. \n\nBut anyways, this damned semester is coming to an end pretty soon. I wish you all the best! We got this!", "author": "Chingchingpotato", "created": 1606712722, "upvotes": 70}}}