{
  "sid": "qlmzz9",
  "link": "/r/CollegeRant/comments/qlmzz9/my_journey_through_education/",
  "title:": "My journey through education",
  "text": "My senior year of highschool 2014, I thought finally I would learn real world skills and attend major specific classes... oh how wrong I was... Instead of my hopes and dreams out of highshool... they just re-hash more of the same shit in a more glorified way.... fucken pisses me off...\n\nI am the kind of person that does not like doing the same job twice, but these fuckers are making students across america pay for the same shit that we have learned in highschool.... Tax dollars totally wasted...\n\nI have now been through 3 universities to find the least scummy school... currently I am attending fully online with the college being in Michigan. I say, this school leans more to the real world than the bullshit. Still, however... a student can't escape the re-hashing...\n\nI guess the saying, \"3 times the charm\" is the golden rule... the education system needs to teach students practical skills either in highschool or strip \"core curriculum\" out of universities.  \n\n\n* We know how America was established, we don't need more history.\n* Math? We know enough to live. PEMDAS, SOH CAH TOA and all that. All the acronyms.\n* Science? We know, we have been taught.\n* English? Again already have been taught.\n\nUniversities have majors for these specific \"core curriculum\". Stop forcing this shit onto each and every student. We don't care. Stop sending our damn tax dollars into the ether.",
  "author": "Odd_Drummer9815",
  "created": 1635914796,
  "updated": 1636138008,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hj47dhe": {
      "link": "/r/CollegeRant/comments/qlmzz9/my_journey_through_education/hj47dhe/",
      "text": "You assume a lot about how much other students have retained. I see a lot of students who can barely follow PEMDAS, don’t know how many years the Civil War lasted, and have had to ask what words like “synonymous” mean. It’s had to be made easier because the standards at so many high schools are so low and because many institutions are more concerned about enrollment than academic rigor.",
      "author": "PhDapper",
      "created": 1635919350,
      "upvotes": 2,
      "replies": {}
    },
    "hj4u702": {
      "link": "/r/CollegeRant/comments/qlmzz9/my_journey_through_education/hj4u702/",
      "text": "Sooo...you want to go to a trade school? Then do that.",
      "author": "hdorsettcase",
      "created": 1635938096,
      "upvotes": 1,
      "replies": {
        "hj5opb9": {
          "link": "/r/CollegeRant/comments/qlmzz9/my_journey_through_education/hj5opb9/",
          "text": "What school is actually a trade school? How do I find them? That is the issue.... also... my parents need a piece of paper saying that I graduated... or it didn't happen...\n\nIt's great that trade schools are out there and all, but no one tells or shows anyone how to find them...",
          "author": "Odd_Drummer9815",
          "created": 1635952722,
          "upvotes": 1,
          "replies": {
            "hj9jyrr": {
              "link": "/r/CollegeRant/comments/qlmzz9/my_journey_through_education/hj9jyrr/",
              "text": "Any online search engine ought to work here.",
              "author": "dvjax",
              "created": 1636021536,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hj6bh2d": {
      "link": "/r/CollegeRant/comments/qlmzz9/my_journey_through_education/hj6bh2d/",
      "text": "In all fairness a lot of highschools offer AP classes. I took 10 AP classes in highschool was able to skip history, English, math up through Calc 2, and even some humanity requirements. All in all my AP classes from high school saved me $14,000 in tuition",
      "author": "markers_mark",
      "created": 1635961315,
      "upvotes": 1,
      "replies": {}
    }
  }
}