{"sid": "lr3h3u", "link": "/r/CollegeRant/comments/lr3h3u/fuck_math/", "title:": "Fuck math", "text": "I cannot do math. Every time I say that people say just ask for help just go to office hours just get a tutor. I understand it, I just can’t fucking remember everything I need to remember to pass a fucking test. I cheated on a quiz like an idiot and got caught, but thank God my professor didn’t report it. But I can’t cheat in the future. Which sucks because everybody else is cheating. When I don’t cheat I get F’s and D’s even if I study for weeks and understand everything, I get points off for stupid little mistakes or not properly showing my work and then that marks the whole question wrong. I fucking hate math.", "author": "throwaway12750", "created": 1614140335, "retrieved": 1632951493, "over_18": false, "upvotes": 39, "upvote_ratio": 0.87, "comments": {"gomfmgp": {"link": "/r/CollegeRant/comments/lr3h3u/fuck_math/gomfmgp/", "text": "I relate so much. I have to have one single statistics course passed to get my bachelor's degree but I just... can't goddamn do it. I've failed it twice already and am registered in it for the third time, just failed the midterm once again. This is the only course left keeping me from graduating (aside from my electives that I will finish next semester) and I might have to drop out of university and go to college instead because I just cannot do this one thing and academic advising says \"oh it's normal to have to take it 2-3 times just keep doing it\" as though it doesn't cost me almost $1000 every time I take it. Thousands of dollars gone because ///math/// and I hate it.", "author": null, "created": 1614197352, "upvotes": 1}, "golnjyb": {"link": "/r/CollegeRant/comments/lr3h3u/fuck_math/golnjyb/", "text": "I hated math when I was in school, for a lot of the same reasons you have mentioned. It didn't seem to fit how my brain was wired.   \n\n\nSomeone on this thread mentioned a disability that affects their math. If you haven't already, it might be worth getting screened for dyscalculia, dyslexia, ADD, or anything else that affects learning. I'm not a specialist in this, but I have had to navigate some disabilities in school, as have many of my friends, so this is just my way of making sure that if you do have something going on, I'm not the asshole who tells you to \"try harder.\" The other possibility is that your professor is not explaining things well, which happens more often than you would think.  \n\n\nAfter college, I ended up tutoring underserved high school students in math and one thing that seemed to really help them is making a list of the steps. Like actually writing it down, starting with \"read the question,\" and making each as simple as possible. I think students were trying to memorize the steps and do the steps, which meant that their brains were doing too many things at once. Many people need to understand the big picture, and math teachers aren't always clear *why* you are doing the steps. Sometimes they just go over the steps repeatedly and that misses the point.  \n\n\nAs someone who hates math and had a creative major, don't listen to anyone in this thread who tells you to cheat and that math doesn't matter. It's actually not true that you will never use it. Learning to get good at math can protect you in life when you are choosing credit cards, buying a house, taking out a loan, budgeting your finances, or accepting a job offer. I ended up studying music, but I used math in ways I didn't expect. I also use math in my hobbies like knitting and sewing.", "author": "NashiPearl", "created": 1614186448, "upvotes": 2}, "gollz4o": {"link": "/r/CollegeRant/comments/lr3h3u/fuck_math/gollz4o/", "text": "I'm someone that has always been good at math and it's been mostly easy for me. I still hate hate hate the people that say \"if you just get a tutor you'll understand it\". Some brains are not wired for math and while tutoring helps, it is not necessarily going to make everyone suddenly able to do math. Depending on your specific struggles it might help to find a tutor that can work with your style of learning, which I've found helpful for other subjects I struggle with. Sometimes they are able to show me things in a way that I haven't seen before and it becomes easier to remember. Still, math is hard and it sucks and try not to beat yourself up about it too much.\n\nEdit: I reread your post and wanted to add that before I got my ADHD treated I used to get Cs and Ds in math because I would forget a negative sign or forget one step in the problem. I don't know you or have anyway of saying what you're going through, but for me that was one of my biggest ADHD symptoms. Either way I definitly feel the struggle of making really simple easy mistakes or forgetting one step and failing because of it.", "author": "peppermint_snow", "created": 1614185764, "upvotes": 2}, "gola00v": {"link": "/r/CollegeRant/comments/lr3h3u/fuck_math/gola00v/", "text": "*raises coffee mug* HERE HERE!! FUCKETH MATH!!", "author": "_fuckyodreams", "created": 1614180593, "upvotes": 1}, "gokwssb": {"link": "/r/CollegeRant/comments/lr3h3u/fuck_math/gokwssb/", "text": "What do you have to remember? Usually with math (and any subject) it’s about repetition. If you don’t want to get a tutor I would recommend just going over and over and over the questions you struggle with until it clicks. I’m not sure if that works for everyone, but it always worked for me in all subjects. Good luck tho! I hope you pass or the curve gods be with you.", "author": "BlkGirl181", "created": 1614173906, "upvotes": 2}, "gokfaby": {"link": "/r/CollegeRant/comments/lr3h3u/fuck_math/gokfaby/", "text": "личный опыт [https://extraessay.com?key\\_wpg=dac3d7dfa0280cf596eef6458d636d04&sub\\_id=е2](https://extraessay.com?key_wpg=dac3d7dfa0280cf596eef6458d636d04&sub_id=е2)", "author": "filatova23", "created": 1614160051, "upvotes": 1}, "gok22qa": {"link": "/r/CollegeRant/comments/lr3h3u/fuck_math/gok22qa/", "text": "u/throwaway12750 I totally understand your hatred for math. I have a learning disability called Dyscalculia (a math learning disability that impairs an individual’s ability to learn number-related concepts, perform accurate math calculations, reason and problem solve, and perform other basic math skills). I have always struggled with mathematical concepts. Algebra 2 was by far the hardest for me. Back when i was a community college student (2017-2019), i took the same algebra 2 class back-to-back and failed it both times, leading me to drop out of the class on the 2nd go-around.\n\nMy learning disability always made me feel stupid. I am now a junior at the University of Arizona, studying history with a minor in government & public policy and international relations. During the Spring 2020 semester, my learning specialist, who also doubles as my counselor, asked me if i wanted to take a statistics class and i immediately shut her down (in a respectful manner). Math overwhelms me, my brain shuts down when it hits mathematical roadblocks.", "author": "DConMont505", "created": 1614148108, "upvotes": 16}, "gok1ypz": {"link": "/r/CollegeRant/comments/lr3h3u/fuck_math/gok1ypz/", "text": "Which class is it?", "author": "MolecularMalevolence", "created": 1614148020, "upvotes": 2}, "gojung5": {"link": "/r/CollegeRant/comments/lr3h3u/fuck_math/gojung5/", "text": "depending on the subject I can help. I'm a math tutor. Pm'd you!", "author": "Substantial-Remote-7", "created": 1614142886, "upvotes": 4}}}