{"sid": "ln6u5s", "link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/", "title:": "my parents expected me to go to college", "text": "i quite honestly don't know where this post will go but i have to say something before i explode. i am a true first generation college student, i mean we've gone back three generations and nothing. i'm the youngest of four kids, all half siblings. my childhood was shit bc my parents were together and apart, my oldest sister had kids at 17, and i was the smart kid they expected good things from. and that's what i gave them. i started college in august of last year, a very good college if i may add, and there was a celebration from my parents, resentment from my siblings, and honestly i was so proud of myself. but i was expecting some sort of college fund. i know, boo hoo my parents didn't save for college, at least i'm going. i get that. but they decided to buy a house as i entered my senior year. and the day they dropped me off at school, they bought a boat. i ended up having to come back home, i've already got a loan on my hands we're semi struggling to make payments on, and i have a 1.224 gpa. i am absolutely livid at them and i'm not so sure i have the right to be but i am. they didn't want to pay for me to stay if the university was downsizing for covid bc of the cost, i get home and it's hell on earth. i desperately want to get out, they try to say \"what are we, bad parents?\" yeah, kind of! there is almost zero interaction between us, they like to go out on the weekends and i'm stuck driving them back home. i told my mom i was thinking about dropping a class last semester and she freaked out, told me i wasn't doing that, and i'm almost certain that's when i hit bottom and just stopped caring. it just pisses me off that they have these high expectations for me but are absolute shit parents, especially since i've gotten older. when i was young i was lucky to go to sleep one night without them fighting about costs, and they go and spend money right before i go to college. and i want to be a fucking doctor just so my family, a bunch of addicts and teen parents, have to acknowledge that i fucking did it. anyway, feels nice to say.\n\ntl;dr my parents expect everything from me and give me nothing in return", "author": "Technical_Director89", "created": 1613709421, "retrieved": 1632950903, "over_18": false, "upvotes": 88, "upvote_ratio": 0.99, "comments": {"go0yul7": {"link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/go0yul7/", "text": "Drop out", "author": "bigbread2020", "created": 1613755524, "upvotes": 1}, "go0qwep": {"link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/go0qwep/", "text": "Go to college if for nothing else, you learn to write in paragraphs. I couldn't get through this mess of a post.", "author": "orangeblackteal", "created": 1613752028, "upvotes": 1}, "go0jwhw": {"link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/go0jwhw/", "text": "The great thing about your age is you don't have to give a fuck what they think anymore! Yes they'll probably bitch at you (and trust me, I understand avoiding things for the sake of not getting bullshit) but if dropping a class is what it takes to keep your head in the game do it. If you need to only do school half time? Do it. It doesn't matter how long it takes to get your degree it just matters that you do it and learn. Especially with your major. They're not paying for you to go to college so they don't get to tell you how to go through your college life.\n\n That being said, if home life is messing you up so much that it's affecting your GPA then I'd go to school half time and get a job and try to move out. No more bullshit or resentment from siblings or having to listen to them complain and tell you to do things that aren't good for your health. No fighting no bullshit no NOTHIN. You know your limits and how you work. Of course this is advice from an internet stranger, but I'm 25 and (hopefully) graduating this May and I may be behind when my mom wanted me to graduate or my friends but idgaf I just want my degree so I can really start moving forward in life by having a good job. What you can't do is let people who OBVIOUSLY don't make good life choices pressure you into doing things that will directly affect YOUR future.", "author": "vness1213", "created": 1613748915, "upvotes": 4}, "go07qdh": {"link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/go07qdh/", "text": "Quit caring because, where has that landed you? Start living YOUR life.", "author": "custompprs", "created": 1613742815, "upvotes": 4}, "go073hb": {"link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/go073hb/", "text": "Mine are the same way. Endless expectations and rules and absolutely no help along the way. They pull good money but spend it all on themselves and actually sink themselves into massive debt every year with their excess. I never see a cent. I just dropped out of the community college I was paying for. Not sure when they’re gonna kick me out now lol", "author": "LonelyActor", "created": 1613742459, "upvotes": 5}, "go04kmh": {"link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/go04kmh/", "text": "That sucks.  I was in a similar situation and just focused on my grades at all costs.  Now I don't spend any money on my family and they barely get any contact from me.  Just do everything you can to get a degree and the best grades possible and move on with your life.  Don't depend on them for support at all.", "author": null, "created": 1613740960, "upvotes": 6}, "gnzfbqq": {"link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/gnzfbqq/", "text": "My parents says things like its okay if I can't do it or there are still other things I can do but sometimes they unconsciously make condescending remarks. I just want you to know you arr not alone and we are here for you. Hope you'll be fine soon.", "author": "ReviveRoast", "created": 1613719297, "upvotes": 4}, "gnzchjr": {"link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/gnzchjr/", "text": "Parents can be toxic, fam.\n\nMine were the same way.", "author": "FoxWyrd", "created": 1613717063, "upvotes": 3}, "gnz8jwz": {"link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/gnz8jwz/", "text": "I'm so sorry you have to deal with that.\n\nI was in a similar situation, and it's really tough to face, especially while staying in contact with your family, and during a pandemic.\n\nI can't offer perfect advice, but I can share some things from my experience.\n\nFirst, if you need, you can probably get your loans deferred. It's not too difficult, and you pretty much say \"I dont have the money this year.\" Then you can do that each year until you get back in school.\n\nAs unfortunate as it was for me, I had to move out of my parents house before going back to school. We ended up cutting ties from one another (long story), but living away from them helped me be in charge of my own life and decisions.\n\nFinally, remember: you are going to school FOR YOU and NO ONE ELSE. Your success and disappointments are decided by you alone. You might want to help your family, but even as a doctor you can't fully support every single person in your household. Their journey is theirs and yours is yours. Take a step back, consider what you want, and where you want to go. It's your decision to make. But take this all one step at a time.\n\nIf you don't like your current university, apply to transfer. Explain to the admissions office your situation, and use your story to prove you'll do better. You might get a couple no's, but chances are someone will take a chance on you. Maybe get your associates at a community college first, if you're nervous about being rejected.\n\nBut you will get through this. We aren't actually set on a timeline, but are all facing life together. Breathe, care for yourself, do what you can for your family (if you want), but don't let their expectations drown you. Your priorities matter.", "author": "Automatic_Corgi_3237", "created": 1613714110, "upvotes": 31}, "gnz4gk9": {"link": "/r/CollegeRant/comments/ln6u5s/my_parents_expected_me_to_go_to_college/gnz4gk9/", "text": "sorry if i can’t help cuz i’m going through a similar situation with you. i’m sorry that this is happening to you, being 1st generation is hard...", "author": "Fristi2147", "created": 1613711352, "upvotes": 1}}}