{"sid": "pxi5ru", "link": "/r/CollegeRant/comments/pxi5ru/a_peruvian_kid_got_beaten_into_a_state_of/", "title:": "A Peruvian kid got beaten into a state of semi-unconsciousness at a UPenn frat by a violently racist student while his frat bros looked on. Here is an open letter to the assailant...", "text": "To the criminal who committed this horrific crime,\n\nI don't know much about you, other than your name, the details of your crime, and the name of your victim and quite frankly, I'm not terribly interested. For that reason, this letter won't be about you. It will instead be dedicated to the person you maimed and quite likely traumatized out of your own personal sadism.\n\nYou may be surprised to hear that I went to high school with your victim. We sat in the same classes, ate in the same lunch rooms, talked to the same people. On the day I got into college, he was one of the first people to congratulate me. This was a guy who knew no respite from hard work, who came to this country as a pre-teen and labored to become our valedictorian and a prominent figure on campus, who loved his brother more than anything in the world, who spent valuable class time engaging me in good-natured debates about Latin American politics. Your victim, whose name you stole when you forced him into a state of terrified anonymity, is genuinely one of the most meritorious people I've ever met. He is the opposite of you.\n\nPerhaps you were upset that your victim's brother reported you for racist comments that you'd made on a previous occasion, or maybe you were just feeling particularly belligerent. Regardless, your victim, my classmate, wouldn't ever hurt a fly, so save your breath before you even try to call what happened a \"fight\". He was carried out of the frat house in a state of semi-unconsciousness without even a single mark on his knuckles. You presumably walked away on your own two legs. This wasn't a fight, this was assault. You weren't \"just being drunk\", you're a sadist. Forget being ashamed of yourself, you should be in jail. People like you *need* consequences more than anyone because when things like this happen, it's never the person in your position who's left looking over their shoulder for the rest of their lives. You didn't have to suffer cranial trauma or a concussion, you don't have to walk around campus with a police escort, and yet you have a legion of similarly callous people sticking up for you, who are more worried about the frats closing than about the life and safety of another human being. Your frat bros, the ones who looked on in silence as you committed your crime are guilty too, if not of assault then of vile and irredeemable cowardice.\n\nI'm not here to call for the closure of all frats at UPenn, nor am I here to make a political statement about being Latino at an Ivy League school or anything like that. Simply put, I am writing to you, your classmates, and to everyone else who would turn a blind eye towards such savage cruelty to express my hope that something impactful enough will happen to make you all develop a conscience. And to those of you who already have a conscience and a little bit of time to spare, I am writing to you as well, with the earnest hope that we can all work together to make sure that justice is done.\n\nIn rage and love,\n\nThe Victim's High School Classmate\n\n[https://www.thedp.com/article/2021/09/penn-castle-fraternity-assault-party-severe-injuries](https://www.thedp.com/article/2021/09/penn-castle-fraternity-assault-party-severe-injuries)", "author": "ThrowawayIvy12", "created": 1632869899, "retrieved": 1632950368, "over_18": false, "upvotes": 187, "upvote_ratio": 0.98, "comments": {"heqiyy7": {"link": "/r/CollegeRant/comments/pxi5ru/a_peruvian_kid_got_beaten_into_a_state_of/heqiyy7/", "text": "A frat in a fucking castle?? Are you kidding me? Administration gotta start doing something because this is fucking disgusting. I hope the assailant gets punished for what he’s done.", "author": "tittysticker", "created": 1632931248, "upvotes": 7}, "hepkk33": {"link": "/r/CollegeRant/comments/pxi5ru/a_peruvian_kid_got_beaten_into_a_state_of/hepkk33/", "text": "This is beautifully written. So angry that this happened. When ever I see this building in person i thought it was a lecture hall. You mean to tell me that the frat house is a fucking castle? I was thinking about UPenn  for grad school but this just confirms more reasons why I do not want to go there.", "author": "95xander", "created": 1632914840, "upvotes": 9}, "heoxocv": {"link": "/r/CollegeRant/comments/pxi5ru/a_peruvian_kid_got_beaten_into_a_state_of/heoxocv/", "text": "This is literally the richest frat on campus, sitting in a castle on our main road, and the administration is doing nothing. Absolutely disgusting.", "author": "zh_13", "created": 1632895518, "upvotes": 20}, "heoi88z": {"link": "/r/CollegeRant/comments/pxi5ru/a_peruvian_kid_got_beaten_into_a_state_of/heoi88z/", "text": "This is the first I have heard of this. I would hope that the fraternity would — at the very least — kick the jerk out. Of course, if they were there, they should have stopped it. \n\nI am so sorry the victim went through this. Is wish him a speedy and full recovery", "author": "inflewants", "created": 1632885809, "upvotes": 21}, "heohvgx": {"link": "/r/CollegeRant/comments/pxi5ru/a_peruvian_kid_got_beaten_into_a_state_of/heohvgx/", "text": "I’m horrified. May justice be served. I can really get a sense of how good a person your classmate is & so sorry this happened.", "author": "ihatemathplshelp", "created": 1632885618, "upvotes": 24}, "heod7i1": {"link": "/r/CollegeRant/comments/pxi5ru/a_peruvian_kid_got_beaten_into_a_state_of/heod7i1/", "text": "Disgusting.", "author": "taybay462", "created": 1632883276, "upvotes": 14}, "heo7kh9": {"link": "/r/CollegeRant/comments/pxi5ru/a_peruvian_kid_got_beaten_into_a_state_of/heo7kh9/", "text": "Holy fuck. This is well written. Something similar happened at UMass I believe a couple of weeks ago (I was not there, heard over social media). People like this are disgusting. Hope there is justice for this!", "author": "Reaper_gaming_afk", "created": 1632880598, "upvotes": 62}}}