{"sid": "lsj02c", "link": "/r/CollegeRant/comments/lsj02c/if_youre_a_professor_you_need_the_best_internet/", "title:": "If you're a professor, you need the best internet", "text": "One of my professors always lags out of class or it keeps freezing smh.", "author": "_readyforww3", "created": 1614292834, "retrieved": 1632950884, "over_18": false, "upvotes": 97, "upvote_ratio": 0.85, "comments": {"gp9t2th": {"link": "/r/CollegeRant/comments/lsj02c/if_youre_a_professor_you_need_the_best_internet/gp9t2th/", "text": "It's not their fault if their wifi is spotty. That's on the internet providers (e.g. AT&T, Verizon, Sprint, etc) and most of the time, it's a temporary issue. Just be patient and let them know if you're having trouble hearing their audio or seeing their video.", "author": "Temporary-Complex751", "created": 1614577713, "upvotes": 1}, "gouxexb": {"link": "/r/CollegeRant/comments/lsj02c/if_youre_a_professor_you_need_the_best_internet/gouxexb/", "text": "This is a joke, right?\n\nYou do realize that professors who are teaching from home don't always have a lot of say in the quality of their internet. Depending on where they live, there might be a single option for internet service and without competition there's no incentive for the provider to offer \"the best\" internet.\n\nCoverage in some areas is spotty or has an outage. What are professors supposed to do about that? \n\nEven if they pay for top tier service, depending on the provider and demand, it might be throttled.", "author": "SlackjawJimmy", "created": 1614362511, "upvotes": 4}, "goshq3u": {"link": "/r/CollegeRant/comments/lsj02c/if_youre_a_professor_you_need_the_best_internet/goshq3u/", "text": "Professors don’t make a ton of money (I mean not bad but not amazing - from what I know. Most salaries for professors at public colleges are on a state database so anyone can see). So it might not be that easy for them to upgrade their WiFi/cams/mics. But I do think they need to be gracious with students’ technical difficulties if they expect the same vice versa. And honestly even if they don’t. College students are known for being broke, and everyone’s broke because of the pandemic, and nobody can use public resources as easily as pre-COVID. Professors should be understanding and flexible.", "author": "dmackl", "created": 1614310805, "upvotes": 17}, "gose6tb": {"link": "/r/CollegeRant/comments/lsj02c/if_youre_a_professor_you_need_the_best_internet/gose6tb/", "text": "I find it funny how some professors always say that we don’t have an excuse to miss class if our internet isn’t working and such but it’s fine if their internet isn’t working. I had one professor that said if our wifi wasn’t working then we needed to go somewhere that had public wifi because it’s no excuse to miss class. Double standard here", "author": "BetNarrow77", "created": 1614308923, "upvotes": 36}, "gos5z4s": {"link": "/r/CollegeRant/comments/lsj02c/if_youre_a_professor_you_need_the_best_internet/gos5z4s/", "text": "One of my prof literally doesnt have a mic that works. The ENTIRE class told them this on the first day of term almost 2 months ago. Doesnt matter they can't hear the class but the class can hear them, when the prof speaks no one can hear it sounds watery and shitty. Also all prof does is reads slides VERBATIM. I mean the least you can do is have a good mic cmon, its not rocket science. Or just quit being a prof. Seriously mega millions shelled out for shit like this?", "author": "seantaylornation21", "created": 1614304728, "upvotes": 7}, "gos12yt": {"link": "/r/CollegeRant/comments/lsj02c/if_youre_a_professor_you_need_the_best_internet/gos12yt/", "text": "Inconsiderate of him; he should sell his house and move somewhere with better internet, or pay more out of pocket for a better router or whatever.", "author": "badskeleton", "created": 1614302233, "upvotes": 82}, "gorq1if": {"link": "/r/CollegeRant/comments/lsj02c/if_youre_a_professor_you_need_the_best_internet/gorq1if/", "text": "O’Dea?", "author": "Theomegaparadox", "created": 1614296759, "upvotes": 8}}}