{
  "sid": "g40zdb",
  "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/",
  "title:": "I am so over this virtual class thing.",
  "text": "I am so frustrated right now and letting it all out on reddit. I’m sick and tired of the virtual classes and how some professors are going about it. My prof is purposely making exams extra hard because it is online now & even if you had your book wide open and notes during the exam, you still could fail. \nI just finished one of my online exams & I feel like I legit failed because I didn’t finish in time & because the questions were nothing like the study guide questions & more of things you had to figure out on your own since they aren’t in the book either. I am trying so hard & purposely studied before hand to get a good grade. I am struggling with the online learning & feel it is making my grades suffer. I need suggestions or some advice because I am in the worst mood I’ve been in a while. Sorry for the rant",
  "author": "rachaeliciouss",
  "created": 1587267945,
  "over_18": false,
  "upvotes": 99,
  "upvote_ratio": 1.0,
  "comments": {
    "fpjv9b7": {
      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fpjv9b7/",
      "text": "hard agree they just make the course significantly harder. One of my finals is 10 essays out of 22 possible ones with a 2 hour time limit completely unreasoneable",
      "author": "deathworld123",
      "created": 1588681916,
      "upvotes": 2,
      "replies": {}
    },
    "fosrl6o": {
      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fosrl6o/",
      "text": "Rejections. Failures. Bad grades. Future. Irritable.  Fatigued. Sleepless. \n\nI’ve been staying up late since the remote learning has started, trying to study day in and out. I’m getting remote tutoring. Im barely getting enough time to do other personal projects. \n\nI’m trying SO DAMN HARD to be positive with little or barely progress. I don’t at all, feel like I will accomplish anything exceptional with the remote learning format. I just overall feel miserable, anxious, and lonely. I miss talking to people, and, receiving in-person support from my profs.",
      "author": "_VitaminA",
      "created": 1588036596,
      "upvotes": 1,
      "replies": {}
    },
    "fnycc4w": {
      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnycc4w/",
      "text": "Online classes have turned my entire life upside down. I feel like everything I do online is a blur and I can’t even think straight",
      "author": "pixiedxll",
      "created": 1587358989,
      "upvotes": 3,
      "replies": {}
    },
    "fnxulht": {
      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnxulht/",
      "text": "FWIW, it sucks for us profs too.  We signed up to teach on ground, which many of us really enjoy and have honed over years or even decades.  And then we've been shoved against our will into a teaching style we've never experienced, never been trained at, with students who don't want to be in this modality, with bosses who tell us to not compromise rigor while also going easy on the students, oh and we're being judged not only on how well we do, but also on how well our students do.  \n\nIt's a shit situation for all of us.  I personally have been teaching online for 10 years, and I'm glad that some profs are finally getting a wakeup call and being shoved into the 21st century, but I wish it didn't have to be at the expense of students.  I'm also glad that many schools which have been anti-online education are now also being dragged into the 21st century, but again this is at *everyone's* expense, and simultaneously we're in the middle of a pandemic.  This sucks SOOOOO bad for everyone, including the profs who've taught online for a while, and even for the students who are with those profs.",
      "author": "AceyAceyAcey",
      "created": 1587346662,
      "upvotes": 2,
      "replies": {}
    },
    "fnxoluw": {
      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnxoluw/",
      "text": "I love online classes when they're done correctly. I used to take them in high school. But its a huge leap when you go from online classes designed around disability to teachers who have no clue what the fuck they're doing.\n\nAt least I have one teacher who is understanding and takes the time to caption the zoom sessions. Another told me there's no possible accommodations he can make and that I'm required to be in class. Even though I understand nothing. So there's no point to me being there because I don't understand anything. And it's a writing and research class. I'm just taking the class next year with a teacher I KNOW is reliable.",
      "author": "arlomilano",
      "created": 1587343043,
      "upvotes": 1,
      "replies": {}
    },
    "fnxfp4p": {
      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnxfp4p/",
      "text": "What kind of teachers gives an exam on a Saturday in the first place 🥴",
      "author": "MobForever",
      "created": 1587337670,
      "upvotes": 2,
      "replies": {
        "fnxuqzs": {
          "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnxuqzs/",
          "text": "My school has Saturday classes. \n\nThis week I'm giving an hour exam, but students get to pick which day they take it, they just have to take it in a single sitting.",
          "author": "AceyAceyAcey",
          "created": 1587346751,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fnw49jh": {
      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnw49jh/",
      "text": "My school told our professors to be lenient and not set hard due dates for any week except finals week. Instead my professors have seemingly set even closer due dates with no consideration of us students. This whole thing blows.",
      "author": "Eeeeeeeeeeeeeek12",
      "created": 1587311127,
      "upvotes": 11,
      "replies": {}
    },
    "fnvy0jx": {
      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnvy0jx/",
      "text": "Dude I feel this. My genetics teacher did the same thing with that line of thinking, and made it also so once you move on from a question you cannot go back. Also for the multiple choice part, she made it so there was a multiple answer option and you had to get all of the choices to get the points for that question. Needless to say I did no better than in class exams (which is failing lol)",
      "author": "oyoung101",
      "created": 1587307379,
      "upvotes": 4,
      "replies": {}
    },
    "fnuxvd8": {
      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnuxvd8/",
      "text": "Same\n\nThe way some professors are handling this online thing is TERRIBLE.\n\nThey assign way more hw, have harder exams with little time, put up proctario, etc\n\nUnfortunately I don't think there's a way around this. You can try to create group chats if you can but I know for some classes it may not be possible to use during tests or be practical (I used discord and literally got an A on a exam on a class I was failing bc we worked together)",
      "author": "cochoadoux",
      "created": 1587274082,
      "upvotes": 36,
      "replies": {
        "fnv5m1u": {
          "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnv5m1u/",
          "text": "One of my professors is still having both their exams (in two of their classes) closed-book. The one is multiple parts, has to be printed out and returned, and done in one sitting. It's a mess.",
          "author": "Flying_Ninja_Bunny",
          "created": 1587281042,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fnusgrt": {
      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnusgrt/",
      "text": "Don’t be sorry for ranting man it’s ok. And I feel this. I may bomb my exams just because literally all of my professors are probably gonna make them extremely hard and short answer so believe me I don’t have much confidence either. I’m sorry this is all happening to you and I’m equally sorry that I can’t do anything but offer up my words in a mere comment. Hang in there man. I feel you really",
      "author": null,
      "created": 1587269896,
      "upvotes": 19,
      "replies": {
        "fnx9kcq": {
          "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnx9kcq/",
          "text": "How come this doesn't happen in community colleges? So far all my tests have been easy, especially with open book.",
          "author": "chenthehen",
          "created": 1587334182,
          "upvotes": 1,
          "replies": {
            "fnx9t89": {
              "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnx9t89/",
              "text": "I gotta be honest I’m not sure what you’re talking about in relation to community college? (EDIT: scratch that I get whatcha mean lmfao my bad)\n\nBut I’ve just known being at my university specifically they make it harder on purpose so people have less opportunities to cheat. There have been a lot of instances of cheating \n\nAnd even at a community college if the professor gave me a take home similar measures were implemented tbh. Still had hard professors at a community college too. It just depends really some are more lenient some aren’t I don’t think it’s dependent on what college tbh. And I guess dependent on what the circumstances are",
              "author": null,
              "created": 1587334322,
              "upvotes": 2,
              "replies": {}
            },
            "fnxuvut": {
              "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnxuvut/",
              "text": "I'm a community college prof.  My tests aren't open book.  Even if students cheat and open their books, they're written so they won't be easily answered in the book unless they already know the material.",
              "author": "AceyAceyAcey",
              "created": 1587346835,
              "upvotes": 2,
              "replies": {
                "fnxvdyr": {
                  "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnxvdyr/",
                  "text": "What class do you teach?",
                  "author": "chenthehen",
                  "created": 1587347153,
                  "upvotes": 1,
                  "replies": {
                    "fnxzs3g": {
                      "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fnxzs3g/",
                      "text": "Assorted 100 level physics and astronomy courses, both as gen-eds and for STEM majors.",
                      "author": "AceyAceyAcey",
                      "created": 1587349999,
                      "upvotes": 2,
                      "replies": {
                        "fr6pdw3": {
                          "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fr6pdw3/",
                          "text": "Philly?",
                          "author": "mobileagnes",
                          "created": 1589930595,
                          "upvotes": 1,
                          "replies": {
                            "fr6yi2g": {
                              "link": "/r/CollegeRant/comments/g40zdb/i_am_so_over_this_virtual_class_thing/fr6yi2g/",
                              "text": "If you're asking if I'm in Philadelphia, no I am not.  There are many places that teach 100-level astronomy and physics as gen-eds and for majors.  ;)",
                              "author": "AceyAceyAcey",
                              "created": 1589935849,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634063828
}