{"sid": "ndg348", "link": "/r/CollegeRant/comments/ndg348/cost_of_summer_attendance_increase/", "title:": "Cost of summer attendance increase", "text": "My college changed summer classes into a third 18 week semester. So now instead of taking 9 hours of classes to be full time I need to 12 hours of accelerated 6 week course work. All I need to do was take 9 hours of classes to graduate next fall but now I won't get financial aid because my course load is too small and if I take extra classes they won't be considered apart of my degree plan and I'll be dropped from financial aid. I get that universities are bleeding because no one is paying for residency but this is ridiculous. I'm going to have to take 22 hours next semester and that'll be rough.\n\nTLDR: my summer financial aid is screwed because of a scheduling change", "author": "DementedCooki3", "created": 1621138071, "retrieved": 1632842381, "over_18": false, "upvotes": 4, "upvote_ratio": 0.84, "comments": {"gyafxrc": {"link": "/r/CollegeRant/comments/ndg348/cost_of_summer_attendance_increase/gyafxrc/", "text": "Thank you u/DementedCooki3 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1621138071, "upvotes": 1}, "gymhkbg": {"link": "/r/CollegeRant/comments/ndg348/cost_of_summer_attendance_increase/gymhkbg/", "text": "I would contact financial aid and say how you’re graduating soon and it’s really important to take these classes on time but the sudden change of schedule on the college’s part is preventing you from achieving your graduation.", "author": "cabbage-soup", "created": 1621375756, "upvotes": 1}, "gyannda": {"link": "/r/CollegeRant/comments/ndg348/cost_of_summer_attendance_increase/gyannda/", "text": "Classes are normally 16 weeks. Why did they make summer longer than a regular semester?", "author": null, "created": 1621143421, "upvotes": 2}}}