{"sid": "nkb2xo", "link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/", "title:": "WTF even is college?", "text": "So the semester wrapped up last week and good lord, I'm over this shit. I just finished sophomore year  and every time I think about school, I don't really think positively about it. Either I'm just a bum or the CS department has killed any and all interest in coding for me, I'm doing a major I don't even like (nor will I use after graduation bc I'm a product designer), and I just miss my fucking friends for Christ sake. My immigrant parents also don't understand any of my issues bc \"education is key\" or whatever (pulled a 3.58 this semester, not great but not \\*bad\\* either). \n\nCan someone explain to me what college is for? They say learning but I'm not doing that, my school doesn't have an HCI major so I'm just chasing a stupid GPA for my parents. They say growing but I'm stuck in my childhood home. I really turned down a $70k job offer for this shit, kill me now.", "author": "neptunestrident11", "created": 1621897840, "retrieved": 1632842320, "over_18": false, "upvotes": 21, "upvote_ratio": 0.89, "comments": {"gzbva3g": {"link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzbva3g/", "text": "Thank you u/neptunestrident11 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1621897840, "upvotes": 1}, "gzo9bc8": {"link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzo9bc8/", "text": "College has become strictly a credentialing service.", "author": "arkonix1000", "created": 1622144095, "upvotes": 6}, "gzeads0": {"link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzeads0/", "text": "I'd never decline a 70k job offer to go to college instead. college is a waste. you pay for a degree so employers consider you. ur parents are stupid shits. most of what you learn in college is easily accesible online, just need self-discpline.", "author": "jhf6782", "created": 1621953822, "upvotes": 9}, "gzdiiww": {"link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzdiiww/", "text": "> Can someone explain to me what college is for? \n\n\ngetting you into debt so you'll become a slave to the system.", "author": "ObjectiveAnalysis643", "created": 1621937299, "upvotes": 14}, "gzcjkpa": {"link": "/r/CollegeRant/comments/nkb2xo/wtf_even_is_college/gzcjkpa/", "text": "What was the job offer for?", "author": "jatea", "created": 1621910486, "upvotes": 3}}}