{
  "sid": "hviq26",
  "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/",
  "title:": "No Matter What I Do - I Am F*****",
  "text": "I am the first to attend college in 4 generations of my family. I am a cyber security major in 2 area of specialization. Im going into my Jr. Year at the top of my class. Here is the catch, I can't afford it or make logical sense of it. I have a perfect GPA, was a TA, and have chronic disabilities, yet I get 0 in scholarships because \"online is cheaper.\" The online is cheaper is BS, my fiance goes on campus and her tuition after her FAFSA was 1k due to scholarships (different schools). She would normally have to pay double my tuition. I pay 26k per year and even with an 800 credit score, my family does not make enough to get good private loan rates. My best rate is an 11.41%. I have privately borrowed 18k in 2 years and have to pay back 39k on a 5 year fixed. The banker originally made a mistake and it was supposed to be sub 10, but they said sorry and that I signed it (not the point here really). This year the FAFSA said my family made too much in 2018 and my contribution is 36k, about a third on my familys income. For this I lose the 5500 I get annually from the state for being disabled. I had to take half of summer off for medical leave and the school told me that would not affect my federal aid, yet they took that too. Here I am sitting here supposed to be doing homework, yet wondering, WHY!? I feel despite whatever I accomplish in college and no matter how good I do, I am going to spend the first 20 years paying off shit. I get others go through this, but the rates are double what my friends have (yes ive checked multiple banks), too much for a grant, havent heard from almost 3 dozen scholarships, family either cant or wont help financially. I. Am. F\\*\\*\\*\\*\\*. \n\n&#x200B;\n\nTL:DR - I have a perfect GPA and no matter what I do I cannot get a scholarship, financial aid is taken, and finances are complicated, all of which are hindering me.",
  "author": "ComputeBeepBeep",
  "created": 1595375011,
  "over_18": false,
  "upvotes": 37,
  "upvote_ratio": 0.95,
  "comments": {
    "fywzzcj": {
      "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fywzzcj/",
      "text": "[removed]",
      "author": null,
      "created": 1595453688,
      "upvotes": -1,
      "replies": {
        "fyx2ps7": {
          "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyx2ps7/",
          "text": "What?",
          "author": "ComputeBeepBeep",
          "created": 1595455131,
          "upvotes": 1,
          "replies": {
            "fyx3gde": {
              "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyx3gde/",
              "text": "Listen to understand that the system isn't exactly written to be nice to anyone financially burdened",
              "author": "OneTrickyDashy",
              "created": 1595455548,
              "upvotes": 0,
              "replies": {
                "fyx3mlz": {
                  "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyx3mlz/",
                  "text": "After his recent rant I think I'll take advice elsewhere, thanks.",
                  "author": "ComputeBeepBeep",
                  "created": 1595455647,
                  "upvotes": 3,
                  "replies": {}
                },
                "fyx3hsn": {
                  "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyx3hsn/",
                  "text": "Plus it's a good album",
                  "author": "OneTrickyDashy",
                  "created": 1595455569,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fywtwbd": {
      "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fywtwbd/",
      "text": "Questions: \n\nIs this an undergrad program or masters? \n\nIs this a private or public school? \n\nAre you in-state or out-of-state?",
      "author": "BeansWorther",
      "created": 1595450772,
      "upvotes": 1,
      "replies": {}
    },
    "fyv114o": {
      "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyv114o/",
      "text": "Well you said you have a fiance. How you thought of getting married on paper first? \nI'm lucky I've received many scholarships due to being first gen College student, low income family and my academic standing helped me lower the cost out of pocket to my traditional 4 year college. My fiance goes to a technical school and paid half of my tuition but little to no scholarship due to his family making to much. The FAFSA is supposed to make everyone be on the same playing field however they do not care if your family is helping financially, they care about the overall income received. So if you and your fiance get married and your income is less than your parents, you may qualify for scholarship since now you would be technically in a lower income family. The FAFSA will then only take account your and your fiance's income and not your parents. If not you do not get married then the FAFSA when continue to use your parents tax information until one you graduate or two you turn 23-24 whichever happens first. Hope this helps..",
      "author": "The_Queen_Bunny",
      "created": 1595416453,
      "upvotes": 1,
      "replies": {
        "fyv1hzg": {
          "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyv1hzg/",
          "text": "Not entirely true, a lot of this has been changed. Hell i know she would lose one because shed no longer be a 'dependant.'",
          "author": "ComputeBeepBeep",
          "created": 1595416872,
          "upvotes": 1,
          "replies": {
            "fyv2kky": {
              "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyv2kky/",
              "text": "Yes this is true but if the income you two make is still lower then what her parents make she can also receive more scholarship since is is now independent. \nI put below the different sources I found that answer some of the questions about being married and going to college. I not telling you this is the best solution but it is something to talk to with your fiance. I learn a lot about it topic in my accounting classes and I've even thought about it with my fiance due to my family's financial situation changing for the better but it made me lose a lot of financial help. \n\nSituations in which Marriage Improves Your Financial Aid Eligibility\n\nMarriage will usually have a positive impact on your financial aid eligibility if you are under 24 years of age and your spouse does not have high income. This is because you can then claim independent status, and your parents' income and assets will not be considered in your financial aid calculations. Your spouse's income, however, will be considered.\n\n[Am I a dependent or independent (FAFSA)](https://studentaid.gov/sites/default/files/fafsa-dependency.pdf)\n\n[source of Marriage pros & cons](https://www.thoughtco.com/financial-aid-for-married-students-788496)\n\n[Different Grant's and how marriage affects them](http://www.collegescholarships.org/grants/married.htm)",
              "author": "The_Queen_Bunny",
              "created": 1595417794,
              "upvotes": 5,
              "replies": {
                "fyvfjj1": {
                  "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyvfjj1/",
                  "text": "I appreciate it. I really do, but for a few reasons that I did not want to post etc. They would not have worked, and unfortunately still would not. Thank you though, most people just say Google it haha.",
                  "author": "ComputeBeepBeep",
                  "created": 1595426566,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fyuaawr": {
      "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyuaawr/",
      "text": "[deleted]",
      "author": null,
      "created": 1595391832,
      "upvotes": 10,
      "replies": {
        "fywvnmr": {
          "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fywvnmr/",
          "text": "I thought those with a certain percentage get like faaaaat scholarships from the federal govt?? I’m surprised you didn’t get anything but also... not surprised because #murica I guess",
          "author": "oyoung101",
          "created": 1595451579,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fytujp0": {
      "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fytujp0/",
      "text": "~The American Dream~\n\nLife isn’t fair. I’m not a financial specialist. My heart aches for you, and all I can offer is my sympathy. Know that it’s not you, the system is just broken. Good luck and God Bless.",
      "author": "Gahorma",
      "created": 1595381952,
      "upvotes": 22,
      "replies": {
        "fytvg5g": {
          "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fytvg5g/",
          "text": "I appreciate that. I have been blessed in areas of my life, but guidance for school was not one. No help in high school, no help by the schools, now the government doubled down on it. I get its an automated calculation, but ill be damned if banks aren't the biggest crooks around. I had an 800 credit score by 19 but yeah... apparently cosigner income wasn't preferable. Cant use a parent because they don't have a credit score... I also will never understand the \"26 billion in unclaimed scholarships every year\" they always talk about... i had one i filled out back in 2017, was for 50k and to this day is unclaimed since Jan of 2015....was denied because im not African American. So many of the stem scholarships are also female only. Just lost, just in my own head. I've always had the answer for big things of this nature, this one is the exception to the rule.",
          "author": "ComputeBeepBeep",
          "created": 1595382486,
          "upvotes": 3,
          "replies": {
            "fytwci6": {
              "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fytwci6/",
              "text": "Man I feel that shit. Neither of my parents took out loans when they went to school and so I called my university the day before the first tuition payment was due and asked about getting a loan. \n\nBoth my parents credit score is shit, so yeah, I have an 11.4% interest rate too. Absolute robbery. But oh well, someday I’ll buy out the bank 😉.\n\nThat’s my attitude to make it seem less shitty. Just know you aren’t alone.",
              "author": "Gahorma",
              "created": 1595383011,
              "upvotes": 3,
              "replies": {}
            },
            "fzfbevy": {
              "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fzfbevy/",
              "text": "I'm fucked as well from the looks of it. I think I might have to go about it the hard way. Start from tech support and work my way up. Sucks ass, but I also need to survive. If that doesn't work I'm gonna say fuck it and become a musician.",
              "author": "ZenithCrests",
              "created": 1595871758,
              "upvotes": 1,
              "replies": {
                "fzfbjzb": {
                  "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fzfbjzb/",
                  "text": "Get your certs. I know guys who make more with 6 certs than a 4 year degree...",
                  "author": "ComputeBeepBeep",
                  "created": 1595871825,
                  "upvotes": 1,
                  "replies": {
                    "fzfbtfk": {
                      "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fzfbtfk/",
                      "text": "Will do. Literally just bought a Bash course on Udemy.",
                      "author": "ZenithCrests",
                      "created": 1595871949,
                      "upvotes": 1,
                      "replies": {
                        "fzfby6l": {
                          "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fzfby6l/",
                          "text": "Wouldn't bother with bash personally. Python is the absolute king these days.",
                          "author": "ComputeBeepBeep",
                          "created": 1595872011,
                          "upvotes": 1,
                          "replies": {
                            "fzfdh5u": {
                              "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fzfdh5u/",
                              "text": "I'm aware of that. However unfortunately I'd rather bash my head into a wall than learn that. I did take two language classes at once so I suppose that soured the experience, but I still found that I preferred the JavaScript over the Python. The systematic approach that JavaScript seems to give actually for some reason seems to make more sense with me than Python ever did. \n\nSame with Bash. I just like how you can automate almost anything with it. At least that's what I heard. I've used it as well, and made the classic fizzbuzz program with it, but I also created an old-fashioned password checker with it. \n\nAs for JavaScript I made several basic games. I'm in the middle of making an Asteroids game now however.",
                              "author": "ZenithCrests",
                              "created": 1595872727,
                              "upvotes": 1,
                              "replies": {
                                "fzfdsho": {
                                  "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fzfdsho/",
                                  "text": "Take this with a grain of salt. Its about what the indistry uses and prefers, not what is easiest for you. Thats job security.",
                                  "author": "ComputeBeepBeep",
                                  "created": 1595872869,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634063035
}