{"sid": "m89sc2", "link": "/r/CollegeRant/comments/m89sc2/i_just_wanted_to_scream/", "title:": "i just wanted to scream", "text": "just a college rant\n\nHonestly i’m not doing well. classes sucks. work sucks. everything just kinda sucks rn. my school had taken away spring break it is just 20 weeks of just classes no type of break or anything to give us a rest. i honestly wish i took a year off because i’m not sure if i’ll be able to pass this semester i just can’t keep handling everything. online classes are the worst and i’ve reached out to my teacher and tried to talk to them about how i’m not doing well and how everything is beginning to get overwhelming and they have either ignored me or told me i need to try harder.  i am honestly starting to feel like the school just doesn’t care about us or our mental health it’s like we are just a big joke to them.", "author": "Whit3devi1", "created": 1616130251, "retrieved": 1632951583, "over_18": false, "upvotes": 34, "upvote_ratio": 1.0, "comments": {"gril36b": {"link": "/r/CollegeRant/comments/m89sc2/i_just_wanted_to_scream/gril36b/", "text": "Those are exactly my sentiments .. I had to drop my classes this semester. Just can’t continue to cope with no end in sight", "author": "sillysparklypanda", "created": 1616183082, "upvotes": 3}, "gridx9g": {"link": "/r/CollegeRant/comments/m89sc2/i_just_wanted_to_scream/gridx9g/", "text": "I know what you mean, I have two professors who are just making me want to walk out of the classroom and quit altogether.  One is basically giving us exams that don't relate to the lessons we are taught and then waiting to tell us this until after we have already failed, and the other decided to make the due date for a massive project the next day just because he was upset that one person took out their phone in class", "author": "Environmental-Swan89", "created": 1616179750, "upvotes": 7}, "grg8flu": {"link": "/r/CollegeRant/comments/m89sc2/i_just_wanted_to_scream/grg8flu/", "text": "I’m sorry you’re feeling like this... for me it’s best to just streamline my life as much as possible, cut out everything that doesn’t either serve a considerable purpose or bring a consider amount of joy. So social media, YouTube, random nonsense we might do, etc. I try to cut back on work as much as I can safely afford, and center getting my work done as much as possible. I try to eat healthy, exercise, do school, and socialize as efficiently as I can. Then I make sure I have time to unwind at the end of the day, I try to get 2 or 3 hours... hope some of my tricks for myself are useful to you! Good luck!", "author": "blazikenxoxo", "created": 1616131132, "upvotes": 5}}}