{"sid": "pusbs2", "link": "/r/CollegeRant/comments/pusbs2/student_brags_about_cheating/", "title:": "Student brags about cheating", "text": "The names used are not their real names, but it will be used to describe the individuals.\n\nSome context: It was an anatomy & physiology lab class. The instructor is a very chill guy (let's call him Sam). The student (let's call him Ethan) is currently in his sophomore year and is in a very competitive nursing program (because he cheated the entire freshman year that was online to have a good gpa). All situations occurred in the class with the instructor there.\n\nIn our a&p class, we have to study a question bank of over 400 questions for our first lab exam. Ethan started off with saying \"all the answers \\[to the questions\\] are on quizlet\". Of course, Sam sounded uncomfortable because he did not respond to him, but looked away from him. Sam jokingly says \"I will tell my other students that all the answers are on quizlet\". It is obvious that teachers would never tell their students to cheat. Later on in class, Sam says that \"he hates cheaters\" and \"knows many nurses that were cheaters\". I immediately dislike Ethan because who the heck admits to cheating in front of the teacher! That was just a few weeks ago.\n\nJust a few days ago, we had the first lab exam. A few minutes before the exam started, this dude Ethan boasts about cheating again, but it was more stupid than the first time. He says, \"This was the first in-person exam that I can never cheat on. I cheated on all my other online classes.\" He had this big smile on his face as he was saying it. He was wearing a mask, but you could see the happiness in his eyes and he sounded like he was so proud of himself, just openly confessing that he cheats in school.\n\nTo me, he sounded so ridiculous. I understand that it is hard to not cheat in an online environment and that everyone cheats. But, don't confess it to the world that you are a cheater and make yourself proud of it. That is just so stupid. Not only that, but he is in a nursing program, a very competitive one that only accepts 100 students. Basically, he cheated his way in, which is so disappointing because there are those who studied very hard to get a seat in the program, but it was wasted on him. Knowing that he is a cheater, if I was a patient, I would never want him to be my nurse because I will not trust my life on a cheater like him.\n\ntl;dr: A student confesses that he cheats in his classes and was very proud of cheating in his previous online classes and for this current class (anatomy & physiology). As crazy as it sounds, he then goes onto brag about it in class in front of the instructor.", "author": "No_Investigator9293", "created": 1632516746, "retrieved": 1632840984, "over_18": false, "upvotes": 36, "upvote_ratio": 0.87, "comments": {"he4ywjq": {"link": "/r/CollegeRant/comments/pusbs2/student_brags_about_cheating/he4ywjq/", "text": "Thank you u/No_Investigator9293 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1632516747, "upvotes": 1}, "he8ob1m": {"link": "/r/CollegeRant/comments/pusbs2/student_brags_about_cheating/he8ob1m/", "text": "Oh it's going to catch up with him fast. Especially once he gets a professor that makes their exams on the classwork and when the class builds off the previous ones.", "author": "LowDownnDirty", "created": 1632589225, "upvotes": 1}, "he70cee": {"link": "/r/CollegeRant/comments/pusbs2/student_brags_about_cheating/he70cee/", "text": "I experienced the same thing today! A guy in my engineering lab was describing, proudly, loudly, and in great detail, how he set up his workspace so he could cheat on his online class. Talking about angling the camera just right so he could use his cheat sheet below. We have an online exam on Monday, so he has the audacity to invite the guys he was talking to to join his group and take the exam together. This is not a group exam. \n\nOn top of that, he walked in without a mask and once the TA finally got him one, he wore it under his nose. As a senior, you would think these people would be filtered out by now.\n\nI have half a mind to report him", "author": "odgoodli", "created": 1632554122, "upvotes": 4}, "he62mbh": {"link": "/r/CollegeRant/comments/pusbs2/student_brags_about_cheating/he62mbh/", "text": "Professors have the ability to report students for cheating even if they didn’t cheat in their courses. Ethan should be careful who he brags to.", "author": "PhDapper", "created": 1632534622, "upvotes": 5}, "he5nrkt": {"link": "/r/CollegeRant/comments/pusbs2/student_brags_about_cheating/he5nrkt/", "text": "Dumbass got cocky getting away with cheating during COVID online classes, he will definitely be caught by professors seriously looking out for cheaters later on if he's being as blatant as bragging about it to random classmates and the teacher. Unless you just go to a shit school which doesn't really care about how much their degrees are worth, this guy will end up in student judicial affairs or whatever it is your school has to expel/suspend students.", "author": "Comrade_Corgo", "created": 1632527713, "upvotes": 8}, "he5gxho": {"link": "/r/CollegeRant/comments/pusbs2/student_brags_about_cheating/he5gxho/", "text": "Honestly, I hope your instructor catches Ethan in the act of cheating. Just blatantly saying it won't be enough, but how much of a freaking scumbag do you have to be to boast about that? Cheating won't help you in the field. Being a nurse requires quick thinking and the knowledge a person accumulates over years of education and practicum. Even if it is infuriating to hear Ethan brag about this kind of stuff, knowing he's taking this spot from someone more deserving, just imagine Ethan in an actual hospital setting. He will flounder, and he will only have himself to blame.", "author": "pistachiopanda4", "created": 1632524599, "upvotes": 15}}}