{"sid": "n03rnk", "link": "/r/CollegeRant/comments/n03rnk/there_needs_to_be_a_deadline_every_week_or_two/", "title:": "There needs to be a deadline every week or two for professors to update grades", "text": "I am so fucking tired of professors not updating grades until the last week of the semester how the fuck did I raise my grade from a C to a B then to now a D. It makes no fucking sense why are you out now grading the midterm that shit was over with 2months ago.\n\nIt's not fair at all and puts more stress on the student because how are you gonna deduct a whole bunch of points for the same mistakes that COULD HAVE BEEN CORRECTED HAD YOU FUCKING GRADED SHIT ON TIME.\n\nI DONT CARE THAT YOU HAVE 180 STUDENTS HIGHSCHOOL TEACHERS DO TO AND THEY STILL UPDATED GRADES REGULARLY. \n\nI genuinely do not have sympathy for professors because students don't even get half that grace. Update your stupid fucking grades so I don't have a roller coast of emotions seeing my grade got o C, B D.🤡🤡🤡 Which may I had happened all within this week. I had a fucking C for pretty much my entire semester then a B when they final updated fucking midterm grades and the final has me at a 69 and then! We get another grade weight change policy and now I am at a 64 even after asking for help professors can choke.\n\n\nTl;Dr: professors who don't regularly update grades are assholes and complete hypocrites for expecting work on time.", "author": "Fickle-Management", "created": 1619573339, "retrieved": 1632843433, "over_18": false, "upvotes": 46, "upvote_ratio": 0.93, "comments": {"gw4f17s": {"link": "/r/CollegeRant/comments/n03rnk/there_needs_to_be_a_deadline_every_week_or_two/gw4f17s/", "text": "Thank you u/Fickle-Management for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1619573339, "upvotes": 1}, "gz848zn": {"link": "/r/CollegeRant/comments/n03rnk/there_needs_to_be_a_deadline_every_week_or_two/gz848zn/", "text": "Definitely agree, my current bio professor has not graded two of my modules from two months ago.  Just waiting on the grades gives me anxiety I’m spiraling 🥲", "author": "milkteamami4", "created": 1621819072, "upvotes": 2}, "gwcdoq4": {"link": "/r/CollegeRant/comments/n03rnk/there_needs_to_be_a_deadline_every_week_or_two/gwcdoq4/", "text": "Agreed, one of my professors takes fucking weeks to grade things and said everything would be updated by last Friday. Guess what didn’t happen? 🙃 still like 4 assignments missing grades. Cool. It’s not like the semester is over in like 2 weeks or anything.", "author": null, "created": 1619729118, "upvotes": 3}, "gwbqvs4": {"link": "/r/CollegeRant/comments/n03rnk/there_needs_to_be_a_deadline_every_week_or_two/gwbqvs4/", "text": "We don't have enough time for this, frankly. If you want this kind of course structure you should go to community college which caters to this high school mindset.\n\nStudents actually receive far more feedback, assignments, and opportunities for improvement in universities now. When I was a student 20 years ago, most of my classes had a final exam and that's it. 100% of the grade was dependent on the final exam score. You didn't get your exam back and there was no feedback.", "author": "TheProfessorsCat", "created": 1619720072, "upvotes": 0}, "gw7fztr": {"link": "/r/CollegeRant/comments/n03rnk/there_needs_to_be_a_deadline_every_week_or_two/gw7fztr/", "text": "I have no grades in 3 classes. Yes even midterm grades. This should be against policy as it withholds information that students need to withdraw a course.", "author": null, "created": 1619636935, "upvotes": 4}, "gw5ap3k": {"link": "/r/CollegeRant/comments/n03rnk/there_needs_to_be_a_deadline_every_week_or_two/gw5ap3k/", "text": "Preach it, friend. I have a professor that JUST graded the midterm that last week, along with three assignments before and after the midterm. Then to top it off, she posted broken links to the documentary required for homework. I have no idea how she's still teaching SMH. Needless to say, she's not getting a very good evaluation lol, not like the school reads them though.", "author": "xwolfionx", "created": 1619593656, "upvotes": 11}, "gw51vws": {"link": "/r/CollegeRant/comments/n03rnk/there_needs_to_be_a_deadline_every_week_or_two/gw51vws/", "text": "Fucking mood", "author": "Throwaaawaayyy123456", "created": 1619586667, "upvotes": 7}, "gw4me6w": {"link": "/r/CollegeRant/comments/n03rnk/there_needs_to_be_a_deadline_every_week_or_two/gw4me6w/", "text": "As a professor, I totally agree! It’s inexcusable to go all semester without getting grades back in a timely fashion.", "author": "PhDapper", "created": 1619577093, "upvotes": 23}}}