{"sid": "o82a6r", "link": "/r/CollegeRant/comments/o82a6r/need_advice_and_genuinely_concerned_about/", "title:": "Need Advice - and Genuinely Concerned About Incoming Students", "text": "I go to a small private liberal arts college in Ohio - and I am so concerned about my incoming classmates, and want to do everything I can to warn them about how terrible my college is. I have gotten sick from this instituion, harassed and followed home from surronding areas, left with no access to food, and I cant just watch more students be put through what I was out of apathy and not speaking up. So much has happened ti myself and others at this college out of pure negligence, I don't even know where to begin.\n\nMyself and some other students want to create a lengthy post/PDF about our experiences and back it up with the information we can link to online - but my college has a very vindictive and political admin that would definitely continue to make my life hell. I want to go to grad school, but it feels selfish to compromise helping others with my own academic journey, since I could see my institution sabotgging my applications (as they did with my transfer ones). \n\nHow do I publicly drop this information somewhere I can link to without hurting the academic careers of myself or others?", "author": "gumsquish", "created": 1624675732, "retrieved": 1632842175, "over_18": false, "upvotes": 2, "upvote_ratio": 0.67, "comments": {"h32gb0z": {"link": "/r/CollegeRant/comments/o82a6r/need_advice_and_genuinely_concerned_about/h32gb0z/", "text": "Thank you u/gumsquish for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1624675732, "upvotes": 1}, "h3a272f": {"link": "/r/CollegeRant/comments/o82a6r/need_advice_and_genuinely_concerned_about/h3a272f/", "text": "Lmfao is this Kenyon?", "author": "papatimbo", "created": 1624847735, "upvotes": 0}, "h346rxn": {"link": "/r/CollegeRant/comments/o82a6r/need_advice_and_genuinely_concerned_about/h346rxn/", "text": ">I have gotten sick from this instituion, harassed and followed home from surronding areas, left with no access to food\n\nThis sounds pretty wild.  Can you elaborate?", "author": "ksuprof", "created": 1624722381, "upvotes": 2}, "h3330dx": {"link": "/r/CollegeRant/comments/o82a6r/need_advice_and_genuinely_concerned_about/h3330dx/", "text": "[deleted]", "author": null, "created": 1624692572, "upvotes": 0}}}