{"sid": "pg2g3g", "link": "/r/CollegeRant/comments/pg2g3g/im_so_tired_of_people_saying_this_to_me/", "title:": "i’m so tired of people saying this to me", "text": "“you’ll regret not having as much fun after college”\nhere’s my take on this. i am half introverted/extroverted, but i really enjoy being alone. i always have. even in high school. i like doing my own thing and focusing on school because i’m good at it. i like spending time in my room, because it gives me a sense of comfort, which really helps my anxiety. \ni have constantly been told how i need to go out, i need to party, i need to go to bars and frat houses, i need to make a ton of new friends, etc. \nwhy is it that this is the expectation for college? another redditor said it best- my whole life, college has sounded like an extroverted paradise for partying. but now that i’m in college, it looks like SCHOOL. \nisn’t that what it’s supposed to be? if i don’t like to drink, why do i have to? if i like being alone, why do i have to force myself to go out? \ni am happy. i am focused, doing well in classes, and living on my own. but i can’t even seem to ENJOY being happy, because every single adult i talk to tells me how i’m going to regret that one day, how i’m wasting the best years of my life being lonely. i’m not lonely. i have friends that i see here and there and in my classes, and a wonderful boyfriend who always supports me. i’m physically alone. there’s a difference. and i don’t see a problem with it. has anyone ever considered that maybe some people don’t like being social? \nif you took a kid to the playground and he went on the swings the whole time because he didn’t like the slide, would you tell him that he’s gonna regret that after leaving the park? no. u would probably be fine with it, as long as he’s having fun. college should be like that too. \n\nthanks for reading my rant.", "author": "ham_alamadingdong", "created": 1630528379, "retrieved": 1632841183, "over_18": false, "upvotes": 58, "upvote_ratio": 0.97, "comments": {"hb8dlh7": {"link": "/r/CollegeRant/comments/pg2g3g/im_so_tired_of_people_saying_this_to_me/hb8dlh7/", "text": "Thank you u/ham_alamadingdong for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1630528380, "upvotes": 1}, "hd3bvg4": {"link": "/r/CollegeRant/comments/pg2g3g/im_so_tired_of_people_saying_this_to_me/hd3bvg4/", "text": "They are insecure that you are comfortable on your own. There are too many people who have the FOMO mentality who take offense when people don't go out doing drugs every night. They are jealous that you don't succumb to peer pressure to go fck strangers every weekend. There is absolutely nothing wrong with doing things you enjoy. I live in Manhattan and go to the beach on Staten Island every Saturday to de-stress. For some reason that makes me weird for not wanting to get a fake ID and go to a shady club in the Bronx every weekend.", "author": "Short_Champion", "created": 1631807550, "upvotes": 2}, "hbbvoxx": {"link": "/r/CollegeRant/comments/pg2g3g/im_so_tired_of_people_saying_this_to_me/hbbvoxx/", "text": "God, this. People keep telling me this is the time to party, drink, and date....but its really not lol. Friends I have who have already gratuated didn't start dating and such till months after college, that's what I plan to do. Makes more sense to me tbh.\n\nI wish people would stop hyping college up as \"the best years of your life!\" Its really not lol. Shit doesn't really begin till after you gratuate and move into your own place and make your own money lol.\n\nThank god I'm basically done with my degree lol", "author": "ButteryBakedSalmon", "created": 1630598215, "upvotes": 7}, "hbbfqqn": {"link": "/r/CollegeRant/comments/pg2g3g/im_so_tired_of_people_saying_this_to_me/hbbfqqn/", "text": "Just do what you want to do my friend. There is a large portion of the student demographic that doesn’t care about any of the “college experience” shit. They just want to get their degree and that’s more or less it. The common trope about what you’re supposed to do in college shouldn’t make you think everyone is like that though. There are a lot of chill, mild mannered people around you, you probably just don’t see them because they aren’t the kind of people that feel like they have to make themselves seen. You could find some people like that for a social outlet, or you could just do your own thing on your own. It doesn’t really matter in the end.", "author": "115machine", "created": 1630591538, "upvotes": 1}, "hbafl5m": {"link": "/r/CollegeRant/comments/pg2g3g/im_so_tired_of_people_saying_this_to_me/hbafl5m/", "text": "i totally agree with you. another thing that doesn’t get talked about as much is hookup culture in college. it almost feels “expected” at this point?", "author": "gbcmaile", "created": 1630567684, "upvotes": 7}, "hb9jd01": {"link": "/r/CollegeRant/comments/pg2g3g/im_so_tired_of_people_saying_this_to_me/hb9jd01/", "text": "Well said!", "author": "Small-Button-2308", "created": 1630547967, "upvotes": 7}, "hb98zcs": {"link": "/r/CollegeRant/comments/pg2g3g/im_so_tired_of_people_saying_this_to_me/hb98zcs/", "text": "I hate how some people think that if you haven’t partied or otherwise had the “typical college experience” that you missed out. But the reality is, for a lot of people the point of college is to learn things and get a degree so you can hopefully get a good job. Not saying people who party are bad people (some still do well, and anyway it’s not my business), but it is not necessary to have a fulfilling college experience", "author": "ld2009_39", "created": 1630543169, "upvotes": 9}, "hb8ty7m": {"link": "/r/CollegeRant/comments/pg2g3g/im_so_tired_of_people_saying_this_to_me/hb8ty7m/", "text": "I've been in the same exact boat. My own mother tells me I'm focusing too much on my work, like what? I ended up graduating with honors because I worked hard and did my best for four years, not because I was out partying and shit. And now I'm in a masters program and built that work ethic in my undergrad to be able to succeed in this too. I'm with you on enjoying being alone, honestly, I hate hanging out with my friends. I like them, but getting the \"wyd\" messages just irritate me. I love doing my own thing and minding my own business and having the freedom to do whatever the hell I want without other people involved. You aren't going to regret it, and you know it, some people just don't understand us mega introverts", "author": "strangelyahuman", "created": 1630535817, "upvotes": 17}}}