{
  "sid": "pzhxz6",
  "link": "/r/CollegeRant/comments/pzhxz6/what_should_i_do_change_in_financial_aid/",
  "title:": "What should I do change in Financial aid?",
  "text": "I dropped a class before the withdrawal deadline. As a result, my financial aid package changed; it still covered the costs of my 5 credit course that I am still in and offered a refund. I also received an email that reflected this change.\n\nHowever, my tuition now says I owe money by October 12.  I have not registered, dropped, or added any classes after the add/drop deadline. I did not receive an email notifying me of this change and cannot pull up my former statements. I honestly wish I had documented everything prior to this.\n\nI have contacted financial aid, they basically told me I had to pay.",
  "author": "TheFriendlyAmoeba",
  "created": 1633124914,
  "updated": 1634093904,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hf3syt3": {
      "link": "/r/CollegeRant/comments/pzhxz6/what_should_i_do_change_in_financial_aid/hf3syt3/",
      "text": "You have to pay because they gave you money that doesn’t cover your schooling anymore since you withdrew from a class before the deadline. They technically gave you too much money",
      "author": "tryingyourbest",
      "created": 1633187329,
      "upvotes": 2,
      "replies": {
        "hf453jg": {
          "link": "/r/CollegeRant/comments/pzhxz6/what_should_i_do_change_in_financial_aid/hf453jg/",
          "text": "Allow me to clarify. When I dropped a class, financial aid adjusted. The new amount still covered costs of the  course that I was enrolled in with a reduced refund. \n\nSomehow, it adjusted again, this time it did not cover the full total of my course.",
          "author": "TheFriendlyAmoeba",
          "created": 1633192626,
          "upvotes": 1,
          "replies": {
            "hf45a8l": {
              "link": "/r/CollegeRant/comments/pzhxz6/what_should_i_do_change_in_financial_aid/hf45a8l/",
              "text": "Yeah I think they didn’t adjust it the amount they should have. It sucks im sorry. Next time contact them before you drop any classes to see exactly what is going to happen",
              "author": "tryingyourbest",
              "created": 1633192705,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}