{"sid": "koqa6c", "link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/", "title:": "The longer I'm in college, the more it's starting to feel like a scam.", "text": " \n\nI don't really have much to say, it's just my own personal opinion/rant about how I feel. College just feels like it's a huge fucking scam and majority of the time it just feels like a sick way to get impressionable late teens/early adults to forever pull money out of their asses because they didn't have the money when they were working dead-end minimum wage jobs. It's ridiculous how much you waste in college for like fucking four useless classes you don't need that isn't going to help you with your majors. There's only like 1-2 classes for your major while the rest are just fillers and they'll preach that it's mandatory. If I wanted to take a class for culture, I would take a class for culture. And don't even get me started on the BS prices new books cost. It's batshit insane that they're around 130$ while the rented ones are for 110$. Even more BS when you're already paying for a class but then you gotta fucking pay for that class again because it's on a website that will only let you use it if you pay. I had to pay for a website and the lowest price was 70$ and that was just to use it for that one semester. I have another class and it's on one website and I have to take that class like 3-4 times and pay to use it every time my subscription ends. I'm starting to really regret going to college.", "author": "dank666420", "created": 1609559911, "retrieved": 1632842772, "over_18": false, "upvotes": 281, "upvote_ratio": 0.98, "comments": {"gl23gte": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/gl23gte/", "text": "I've known this for a while. But then again, that's because I've been to college for about 7 years now. And for my Bachelors degree thesis, I covered the history of PR and Propaganda. Really makes you aware of some things.", "author": "ZenithCrests", "created": 1611815155, "upvotes": 1}, "ghycsd3": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghycsd3/", "text": "Honestly I only went because my mom pushed me to apply, and I'm only still here because she had to take out a plus loan the first year so now I feel obligated to finish it. I only had a vague interest in computer science, and nothing else. Now I'm miserable, and I still only have a vague interest, but at least I'm like 60k in debt too!", "author": "deltagardevoir", "created": 1609683880, "upvotes": 1}, "ghw9ufm": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghw9ufm/", "text": "For my major (Social Work) I'm only allowed to take the two introductory courses my third semester before I have to apply again. It's ridiculous to me because there's literally less than 200 people within the whole major itself so they need me more than I need them.", "author": "Wowzaitstorii", "created": 1609645137, "upvotes": 1}, "ghvswgm": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghvswgm/", "text": "more like 400 for new books", "author": "deathworld123", "created": 1609635438, "upvotes": 1}, "ghux69x": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghux69x/", "text": "I feel this on a personal level.", "author": "BecuzMDsaid", "created": 1609618757, "upvotes": 1}, "ghuh81e": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghuh81e/", "text": "I totally understand. I guess it depends on what you’re majoring versus what you want to do as a career. The college experience is a great way to social and meet some really cool professors. I’ve never had an issue with classes and websites. Usually the teachers pay for anything additional for the class. The only time that’s happened to me is my organic chemistry class. That was totally bullshit. \n\nAlso, you don’t have brand new books unless there’s a code you need to access the material online. You can get them if on Amazon or other websites that are sold at a much cheaper price.", "author": "tigerlillylolita", "created": 1609610574, "upvotes": 1}, "ghudo7c": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghudo7c/", "text": "You’re preaching to the choir. I’m a science major and some of my books are like $300. It’s truly disgusting. Not to mention fafsa is trying to cut my money because I’ve been in school for almost 6 years. Well yeah I gotta do that because poor people gotta work (which means I had a couple part time semesters) so they can pay their bills smh, not to mention my crap advisors which told me I could take art classes as an elective for a science major (first generation here so I had to figure college out for myself). I am a senior and hate college. I used to love school when I was in grade school. Just do my work, no worries that I’m gonna be dropped from my major or can’t get into a class because there are 50000 students at my school or can’t pay for a textbook. I can’t wait to graduate and be done with this sham. People always say they’d rather be in college than working a real job, well I left my real job to finish out my BS and I can’t wait to go back 😂", "author": "Ohhiitsmeyagirl", "created": 1609608774, "upvotes": 3}, "ghu7rjv": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghu7rjv/", "text": "Yes, it's a scam. \n\nDon't do it unless you have a clear career goal in mind. (or at least, viable area). Don't do a \"passion\" major unless you have a moneymaker to back it up.", "author": "fiftycamelsworth", "created": 1609605752, "upvotes": 2}, "ghu6qwp": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghu6qwp/", "text": "I transferred and had to take an extra year to finish my first degree, and I have more schooling after that 🤡", "author": "frisbae_4", "created": 1609605209, "upvotes": 2}, "ghty768": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghty768/", "text": "My mom bitches whenever I register for classes because when she became a veterinarian in Cuba, she did 5 straight years of college. Her friends who became doctors? 5 straight years. The engineers and architects? 3 straight years. None of that Bachelors/Masters/PhD/Med School. There they have kids only take the classes that are absolutely necessary for their career, so a career here that would take 7+ years of higher education would take about 4 over there. Blew my mind when my cousin became a gyno in five years instead of nine.", "author": "fallenlatest", "created": 1609600318, "upvotes": 18}, "ghthy3v": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghthy3v/", "text": "I’m an English instructor at college and I feel the same way about the books and software packages. I just want to be able to teach my subject in the way I want to teach it, but book companies and textbook distributors figured out a long time ago they were being shoved out by Amazon and they fought back HARD. \n\nI need the textbook I teach from because I don’t believe it’s appropriate to be a college professor and writing your own textbooks or using open source ones, when all of those texts should still have a knowledge debt to the sources that informed them. The legal requirements on the textbook publishers make them cite their sources quite well, and they honestly put together English texts better than I would ever think to with a team of one, so the book itself is indispensable. So, I can’t neglect to include the book. That’s a necessity. Do I want to charge a ridiculous price for it? No. But I don’t think students who are only planning on taking their English core classes should have to pay 130 dollars for a book. When I look at the book my students use, I think that book should be worth about 40 to 50 bucks, and has as least that much knowledge in it. However, the textbook companies get around that now by charging a ridiculous price for a paper copy, a reduced price for a digital copy that can be used once, and a software pack that only comes with a new copy that is required for all the homework (and at my institution, I have no option to not include that extra work...I’ve asked).\n\nBut yeah, the textbook companies got tired about people using Amazon to buy used books, so they just started using ebooks. One time access. Software packages with all the problems and answers that they’ve spent a ton of money developing for each textbook, one-time use codes with expirations, deals with colleges for book discounts as long as so many classes teach the same book, etc etc. And the instructors? We basically have no say in this. Some of us do, but not the vast majority.\n\nNow, I disagree with your assessment of a class like mine, composition or literature, or other classes like history, algebra, sociology, etc not being necessary. A lot of what people think college is supposed to be is not what college is supposed to be. It’s not supposed to be a funnel to a specific job that only offers off-the-job training. It’s supposed to be a place where students come and voluntary gain a broad scope of in-depth knowledge in various subjects that will serve any type of job or career path you choose within an area. Unfortunately, a lot of people have come to feel like higher education shouldn’t be “higher” at all, but rather “further”, just offering additional, specialized education in a field like computer sciences or business. Honestly, I think that misses the point of education. I think if you want to just take classes that deal specifically with a particular area that is completely focused on learning a skill that will bring you money, go learn A/C repair at a community college or something. You’ll end up making more than I do and you won’t have to hear about “culture”. But the education itself is meant to be a bit higher. It’s a lot of classes that deal with “why” rather than “what”, looking at the inner workings of things and talking about them, figuring out how to dig deeper and access more truth. And those skills help, just not in as direct a way. Wax on, wax off, you know?\n\nBut, I’ll definitely agree with you on the books and websites. But blame the textbook companies. We don’t want to charge that much as instructors, we receive no cut of it, and the software packages are often forced on us by the college who got some deal from the publisher for cheaper books if we do so, and then we have to use a product we don’t even want and it isn’t optional. We just want to teach.", "author": "chrisrayn", "created": 1609586889, "upvotes": 14}, "ghtacns": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghtacns/", "text": "I started uni at 17 who am now as a 19 year old is already so different ,should have taken a gap year and now I’m in this position of questioning my degree🤦‍♂️", "author": "Mufasa4299", "created": 1609578659, "upvotes": 13}, "ght5wlh": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ght5wlh/", "text": "I’ve transferred twice and rn I’m on its 100% scam. But I’ve invested 100k so im gonna see it through I guess.", "author": "vr1252", "created": 1609574098, "upvotes": 12}, "ght5k2l": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ght5k2l/", "text": "I’m upset that it was sold to me as the only option. That no one sat me down and really got through to me that there were other paths that lead to financial security and personal success. That no one told me it’s okay to take time to figure out what I’m really going to college for before starting. That no one explained to me that the growth I would endure from 18-21 would change my outlook and goals vastly, before I got myself extremely in debt due to my 18 year old selfs naivety. I didn’t know any better. Especially as a first generation college student. But now, I’ll never be able to forget, I’ll be reminded every time a payment is due", "author": null, "created": 1609573754, "upvotes": 52}, "ght3bd6": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ght3bd6/", "text": "I agree. Similar to the other guy, my parents would loose their shit if I didn't go to college.", "author": "taa20002", "created": 1609571668, "upvotes": 7}, "ghsp9h4": {"link": "/r/CollegeRant/comments/koqa6c/the_longer_im_in_college_the_more_its_starting_to/ghsp9h4/", "text": "[deleted]", "author": null, "created": 1609561614, "upvotes": 79}}}