{"sid": "mrhguw", "link": "/r/CollegeRant/comments/mrhguw/when_the_entire_campus_loses_electrical_power_1/", "title:": "When the entire campus loses electrical power 1 hour before an online assignment is due.", "text": "And you had planned to finish entering in the assignment during that hour.\n\nShout-out to all the professors who warned of such a situation occuring and that one should never wait for the last minute to upload homework assignments.", "author": "TehWildMan_", "created": 1618501718, "retrieved": 1632950371, "over_18": false, "upvotes": 181, "upvote_ratio": 1.0, "comments": {"guorw1c": {"link": "/r/CollegeRant/comments/mrhguw/when_the_entire_campus_loses_electrical_power_1/guorw1c/", "text": "...and other reasons why you should never leave stuff to be submitted at the last minute: a story of anxiety and Murphy’s Law”", "author": "lealacademics", "created": 1618545960, "upvotes": 2}, "guo58ej": {"link": "/r/CollegeRant/comments/mrhguw/when_the_entire_campus_loses_electrical_power_1/guo58ej/", "text": "I feel as though the professor should be  understanding. Sure getting in work the sooner the better is always the way to go but Im sure a lot of students, if not most, turn things in the day it's due vs early.", "author": "Isaac_Ezac", "created": 1618533538, "upvotes": 2}, "gunel3d": {"link": "/r/CollegeRant/comments/mrhguw/when_the_entire_campus_loses_electrical_power_1/gunel3d/", "text": "We had a similar situation last month but it was our Blackboard that went out, so we couldn't even submit our assignments if we tried. That also knocked out tests. So most professors gave out extensions except mine. Our assignment was due the next day and she said there is no excuse and there was so many students complaining. I'm 100% on her side though", "author": "willowmei", "created": 1618520434, "upvotes": -4}, "gunbmmg": {"link": "/r/CollegeRant/comments/mrhguw/when_the_entire_campus_loses_electrical_power_1/gunbmmg/", "text": "Damn that really sucks. I know it's a good habit to turn things in/finish early, but I think we've all had moments where we ended up waiting til the last minute because of having to do work from other classes or jobs or other activities that make it difficult to do that. Hopefully the professor is understanding. It's one thing when one students power goes out. It's another when the entire campus does", "author": "vness1213", "created": 1618519153, "upvotes": 34}, "gun0dan": {"link": "/r/CollegeRant/comments/mrhguw/when_the_entire_campus_loses_electrical_power_1/gun0dan/", "text": "HMMM and what about the other 167 hrs you had on this week long assignment to hand it in??\n\nThis is why i warn to back your files up and to hand things as early as possible .. THAT kind of thing will happen NOT IF BUT when.", "author": "electricdom", "created": 1618514337, "upvotes": 17}}}