{"sid": "pjpa8c", "link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/", "title:": "Teachers that answer a question with a question.", "text": "Ok sorry if you disagree with me so don't attack me but I just need to vent. AHHHHHH!!!! I HATE teachers that answer your questions with another question what the hell is wrong with these people??? I get it if they are trying to make you think but when it's a simple question that I need to know the answer to like what units do we use for this specific thing? Then they tell me.. well with the info I have given you you should be able to figure it out. Well no!!! I cannot figure it out because I've been looking at all of the damn homeworks and papers and online stuff you have given me and googled everything and I cannot get a clear answer anywhere and since you are grading my work I want to know what you want from me!!! Can you just give me one clear answer because that is why I am asking you a freaking question!!! \n\nOk I'm done now thank you for letting me vent.\n\nTl;Dr I hate it when teachers don't answer a question clearly and instead respond with a question.", "author": "radchicken23", "created": 1631028440, "retrieved": 1632841135, "over_18": false, "upvotes": 8, "upvote_ratio": 0.84, "comments": {"hbxw6a4": {"link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbxw6a4/", "text": "Thank you u/radchicken23 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1631028442, "upvotes": 1}, "hbyw2qv": {"link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbyw2qv/", "text": "That's not answering a question with a question. That's answering a question with, \"Read the instructions.\"", "author": "hdorsettcase", "created": 1631043243, "upvotes": 5}, "hbyv865": {"link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbyv865/", "text": "I'm a high school teacher and college student and i always do the asl questions thing when i don't know much about the subject myself or when i want to show my students i'm trying to engage with them and i appreciate that they ask questions.\nEdit; okay i just read it again and your teacher either isn't confident about their own knowledge or they are one of those teachers who think that the subject is easy for *them* it is easy and obvious for everyone. That's usually an issue that a lot of professors have. Most of them don't actually have a pedagogical or teaching degree, which is why they suck at teaching and do these dumb things.", "author": "churchisforbrunettes", "created": 1631042890, "upvotes": 1}, "hbxzwtt": {"link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbxzwtt/", "text": "That's totally a dick move. I don't really have great advice, but if you have tutoring services offered by the school, they will help you for free.", "author": "SouthernRhubarb", "created": 1631029964, "upvotes": 6}, "hbxybdg": {"link": "/r/CollegeRant/comments/pjpa8c/teachers_that_answer_a_question_with_a_question/hbxybdg/", "text": "This\nI feel college existence is pure pain, its not even remotely close to real life\n\nIn a job they train you, you can ask colleagues if you're doing something right or wrong\nnot giving you a direct answer has always been my frustration", "author": "GadgetSun", "created": 1631029315, "upvotes": 11}}}