{"sid": "m87cln", "link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/", "title:": "Stop making mid terms 4 questions long", "text": "Literally have a mid term that’s four questions and worth 60 points. Like if I have miss two questions I’m fucked.", "author": "Loner216", "created": 1616121495, "retrieved": 1632950320, "over_18": false, "upvotes": 209, "upvote_ratio": 0.97, "comments": {"gscupvb": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/gscupvb/", "text": "I feel your pain. I have one class that all the tests are 225 points. But it’s only 22 questions so each question was 10pts. Not to mention it was multiple choice. If i missed one it’s automatic letter grade drop. It’s so frustrating because of the 1 hour time limit as well. The grading system of every class is different and i just have to hope for next semester classes to not have outrageous point systems.", "author": "Sharp_Kiwi_531", "created": 1616802564, "upvotes": 1}, "grpa6ui": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grpa6ui/", "text": "i have a midterm that is 4 questions and 100 points total...", "author": "Audenian", "created": 1616335915, "upvotes": 1}, "grjbary": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grjbary/", "text": "I have a professor thats doing this. I got a D (6/10) on my first quiz and an F (4/10) on my second. Each quiz is 4 questions. Professor provides 0 study guides, no tutors, no homework/practice problems and when the class discussed other ways to learn/practice the material, he had the audacity to say something like “you shouldn’t rely on the internet when you have a professor.” \n\nI’m just trying to get a C since it’s a prerequisite for 6 other courses.", "author": "18dwhyte", "created": 1616196161, "upvotes": 3}, "grhzvdl": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grhzvdl/", "text": "Yes! I have a three question exam worth 120 points. I miss one and I’m done right away. I know I know my stuff and that I’ve studied and prepared, but the pressure of “you score perfectly or else fail” kind of sucks", "author": "mother_of_nerd", "created": 1616173635, "upvotes": 2}, "grhdlke": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grhdlke/", "text": "And then professors act all surprised when the average is a 60%", "author": "xXMassiveRoosterXx", "created": 1616163657, "upvotes": 6}, "grh20uu": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grh20uu/", "text": "this. \n\nmy calculus professor makes tests that are like 3-5 questions and are a huge part of our grade. it’s like they want us to not get good grades or something.", "author": "jennie033", "created": 1616157361, "upvotes": 14}, "grgszu3": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grgszu3/", "text": "Professor here. Genuinely curious because I think I've done this. Your suggestion is to make smaller questions that are worth less but include more of them. So like a 10 question exam but each one is just a small part. Rather than one question that is super hard and worth a lot of points\n\nEdit: thanks for the responses. The only other comment I'll make is that grading exams is hard. The more questions the harder it is to grade. It's also hard to create questions. Still i think I can strike a balance between number of questions, pertial credit and the time it takes me to grade to make it easier for the students while still providing a way for me to assess how well the students understand the material.", "author": "familyofgorillas", "created": 1616150600, "upvotes": 45}, "grgpylt": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grgpylt/", "text": "I had one with 6 questions. 3/6 were only worth 1point. 1 point out of 42. Why? The other three were worth 10-20 points. Awful.", "author": "OatmealRaisin254", "created": 1616147630, "upvotes": 7}, "grgn2fp": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grgn2fp/", "text": "Had a test that was 6 (long) questions worth 75 points each. And had a time limit of 30 minutes. Only final ive ever failed fuck that prof", "author": "ally-x", "created": 1616144605, "upvotes": 22}, "grg9xuu": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grg9xuu/", "text": "My last chem exam had one question, a very lengthy involved calculation, worth 15% of the exam, and no partial credit.  It was on Canvas, so there was no showing of work.\n\nI transcribed one number incorrectly, and thus my final answer was wrong (but still a very reasonable answer, hence me not noticing the error).  If we had been in-person with written tests, the grader would have seen that I performed each step correctly, and maybe I wouldn't have lost 15 fucking points for using .89 instead of .98 or whatever it was.", "author": "ThereIsNo14thStreet", "created": 1616132325, "upvotes": 54}, "grg417f": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grg417f/", "text": "More easy questions>a few hard questions", "author": "slateish", "created": 1616128020, "upvotes": 31}, "grg2xsf": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grg2xsf/", "text": "So what more questions so that each individual question is worth less?\n\nI mean, yes. If you flub half the teat you're fucked. I don't see how more or less questions affects your chances of doing so.", "author": "BarackTrudeau", "created": 1616127322, "upvotes": -20}, "grfte38": {"link": "/r/CollegeRant/comments/m87cln/stop_making_mid_terms_4_questions_long/grfte38/", "text": "Hate hate this. Had a final with 5 once each had from 2-3 sections. No partial credit just right or wrong. I studied for days and still failed.", "author": null, "created": 1616121684, "upvotes": 102}}}