{
  "sid": "pgcqmp",
  "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/",
  "title:": "I completely f**ked myself over",
  "text": "So i'm basically freaking the fuck out right now. I needed to take Calc 2 this semester, but there were two classes with two different professors. I enrolled the first course but found the professor's style of teaching to not be a good fit, so I dropped today in order to pick up the other professor. Unfortunately now the other Professor is saying it is too late to add her class, even though the College website says the deadline for add codes, paying, withdrawing, etc. is all on September 3rd (in 2 days). I emailed her today and she just said, \"it's too late to add the class\". I've fucked myself over and now I have no Calc 2 to take this semester. I want to pull my damn hair out. I emailed the counseling department, I even emailed her replying just basically pleading to be added. I really screwed myself over. Completely blew my chances of transferring this semester. My parents are gonna kill me",
  "author": "palm888angel",
  "created": 1630566326,
  "over_18": false,
  "upvotes": 79,
  "upvote_ratio": 0.99,
  "comments": {
    "hbougpf": {
      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbougpf/",
      "text": "See if you can add the original calc 2 class. I know you said you didn’t care for the professor’s teaching style but maybe with tutoring help or online videos you could understand the material?",
      "author": "mokshmoon",
      "created": 1630851973,
      "upvotes": 1,
      "replies": {}
    },
    "hbdvexm": {
      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbdvexm/",
      "text": "Calc 2 is a pretty standard course that many schools offer. Any chance you could seek out another school for the course as a transient student and have the credit applied to your degree? Many schools have a transient/transfer credit policy so it might be worth investigating.",
      "author": "dvjax",
      "created": 1630628516,
      "upvotes": 1,
      "replies": {}
    },
    "hbdm9rk": {
      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbdm9rk/",
      "text": "Its probably University dependent but I've actually added a course 6 weeks in before. I went to Penn State\n\nI had to ask the professor for permission then fill out a form with enrollment and that was it.\n\nSo maybe try to go back to the other professor?\n\nCalc 2 isnt the hardest class,  just follow tutorials on youtube. I personally used 'The Organic Chemistry Tutor'.\n\nSuper helpful",
      "author": "BigLHours",
      "created": 1630624142,
      "upvotes": 1,
      "replies": {}
    },
    "hbc6p9o": {
      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbc6p9o/",
      "text": "Personally I would email the original calc Professor and tell him I accidentally dropped the class when I meant to drop another one and see if he lets you back in. That seems like the only option at this point otherwise I would double check to see if you can still transfer but take that class at the university you’re transferring to.",
      "author": "LivWJ",
      "created": 1630602549,
      "upvotes": 11,
      "replies": {}
    },
    "hbc49iv": {
      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbc49iv/",
      "text": "This is some major bull. You're paying an exorbitant rate to attend this university, and a professor (that YOU'RE PAYING) is going to tell you that you can't join her class while it's still within the university's deadline for adding classes. Raise hell. CC the president on every email you send. Don't let your university and professors push you around and treat you like sh\\*t.",
      "author": "eager_rd2be",
      "created": 1630601587,
      "upvotes": -4,
      "replies": {
        "hbe8vhb": {
          "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbe8vhb/",
          "text": "The deadline is the latest time that the registrar's office allows a student to add. The instructor of any given class has control over late admissions.\n\nI teach a couple of courses which are too intensive to sign up late, and I reject all late requests to add. This is completely within my power and student advisors can only request that I reconsider.\n\nI do this because students who add late have a very slim chance of success. Letting students join late is setting them up for failure.\n\nAnyway, your advice about raising a stink is not going to help OP.  We are not in the business of customer service and you do not pay our salaries, so Karen-esque tactics don't work here.",
          "author": "TheProfessorsCat",
          "created": 1630634821,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hbbullj": {
      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbullj/",
      "text": "I can’t reply to OP’s response for some reason, so I’m replying with a new comment.\n\nOP, are you sure that time window is the regular drop/add time window? If so, you wouldn’t need permission to drop or add - you would just be able to do it. From what you wrote, it sounds like you’re in that limbo period where you can still add courses but only with instructor permission. If it really is regular drop/add and you can self-select into the course, I’m not sure why you would need her permission (hence my assumption that it’s not the regular period for drop/add).\n\nAs for the last comment about her just not wanting you in her class, I doubt it’s that. It’s probably more that she feels that you might be set up for failure by joining late. This is especially the case in math courses - even getting behind by one week can lead to a cascade of problems that you can’t ever quite overcome.",
      "author": "PhDapper",
      "created": 1630597778,
      "upvotes": 9,
      "replies": {
        "hbbw96t": {
          "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbw96t/",
          "text": "There’s nothing online that says when regular add/drop without permission ends, just that classes can be added/dropped until 9/3. Even though a week is a good amount, I’ve tried emailing the prof and dept head again with more detail of my situation and saying I would be adamant on catching up. I’m just upset because I basically pushed myself back a semester for no reason. I wanted to transfer as an Economics major but everyone is saying I need to take it at CC before going. Again I’m not trying to blame them, this was totally my fault and I’m taking the consequences. And you make a very good point in the last paragraph",
          "author": "palm888angel",
          "created": 1630598437,
          "upvotes": 1,
          "replies": {
            "hbdrx1r": {
              "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbdrx1r/",
              "text": "If the school has the policy to be able to add drop within that window she needs to honor that. Only thing I could see preventing that is if the class has a wait-list and the class is already full. Otherwise I would go to the department chair.",
              "author": "dflipb",
              "created": 1630626851,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hbbmr3q": {
      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbmr3q/",
      "text": "Would you be able to take a winter intersession course?",
      "author": "pistachiopanda4",
      "created": 1630594515,
      "upvotes": 1,
      "replies": {
        "hbc4fnu": {
          "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbc4fnu/",
          "text": "I don’t think it’s one of the classes offered",
          "author": "palm888angel",
          "created": 1630601655,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbb0u7c": {
      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbb0u7c/",
      "text": "Can you go back to the original professor?",
      "author": "Oplatki",
      "created": 1630584327,
      "upvotes": 32,
      "replies": {
        "hbb9iq9": {
          "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbb9iq9/",
          "text": "This is what I would suggest.",
          "author": "PhDapper",
          "created": 1630588780,
          "upvotes": 12,
          "replies": {
            "hbbgkim": {
              "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbgkim/",
              "text": "If OP can't understand the materials due to the professor's teaching style, they will just fail the class or do less than they had hoped for anyways though.",
              "author": "toofeduptocare",
              "created": 1630591896,
              "upvotes": 6,
              "replies": {
                "hbbi2b1": {
                  "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbi2b1/",
                  "text": "There are other avenues for help if the teaching style is not what OP would prefer - tutoring, outside sources, etc. It’s not ideal, of course, but it’s better than just not taking it and then getting set back by a semester.",
                  "author": "PhDapper",
                  "created": 1630592535,
                  "upvotes": 18,
                  "replies": {
                    "hbbp4vm": {
                      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbp4vm/",
                      "text": "Yeah, I forgot that tutoring/outside help is an option.",
                      "author": "toofeduptocare",
                      "created": 1630595513,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hbe1f6a": {
                  "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbe1f6a/",
                  "text": "OP is weird, if he can’t handle the professors teaching style then just teach yourself? Not every class is going to have a perfect professor and when the situation arises you’re going to have to push through by teaching yourself.",
                  "author": "coffee_math",
                  "created": 1630631301,
                  "upvotes": -1,
                  "replies": {
                    "hbep49z": {
                      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbep49z/",
                      "text": "Yeah, it really shouldn't be that way but that's a whole other discussion that I could go on about for days",
                      "author": "toofeduptocare",
                      "created": 1630643052,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hbavlji": {
      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbavlji/",
      "text": "Go to the department chair, provost, etc. go higher. She can’t override a policy like that",
      "author": "Ksmom124",
      "created": 1630581131,
      "upvotes": 21,
      "replies": {
        "hbbhwjq": {
          "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbhwjq/",
          "text": "Actually, she can.  If a professor determines that their class has progressed to the point where a latecomer would either be hopelessly behind or too confused, they can - and often do - deny late enrollment, regardless of the school's policy.  \n\nThat policy is a \"worst-case\" policy, meaning that if OP found a professor who agreed, then they'd have until September 3 to finalize things.  That policy does not require a professor to accept a late student, nor does it trump the professor's prerogative, and that's who makes the final decision.  OP can complain all the way to the college president but if the professor refuses, that's pretty much it.",
          "author": "DeskRider",
          "created": 1630592468,
          "upvotes": 20,
          "replies": {
            "hbby7zd": {
              "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbby7zd/",
              "text": "It's pretty bullshit when the deadline is in 2 days but the professor says its too late. What's the point of a deadline then",
              "author": "Zyrobe",
              "created": 1630599221,
              "upvotes": 4,
              "replies": {
                "hbbz6ez": {
                  "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbz6ez/",
                  "text": "The deadline is financial. If you add or drop before the deadline you usually get your money back or an adjusted bill.",
                  "author": "renebeca",
                  "created": 1630599601,
                  "upvotes": 8,
                  "replies": {
                    "hbc74gs": {
                      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbc74gs/",
                      "text": "Not usually.  Most schools have last days to add/drop and separate last day to drop with a refund.",
                      "author": "Spheresdeep",
                      "created": 1630602721,
                      "upvotes": 1,
                      "replies": {
                        "hbcevzp": {
                          "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbcevzp/",
                          "text": "Have you heard of the national student clearinghouse? An interesting rabbit hole about how they affect add drop and financial aid deadlines.",
                          "author": "renebeca",
                          "created": 1630605832,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hbcny7d": {
                  "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbcny7d/",
                  "text": "But that's not what the deadline says.  It says that OP has until September 3 to add a class.  It doesn't say that the professor is obligated to accept him into it.  After the first day, any further enrollments are almost entirely at the professor's discretion.\n\n\"Too late\" doesn't refer to the deadline; it refers to where they are in class.  It might very well be too late for OP to catch up.  It might be a situation where the professor is not interested in devoting time for private lectures to bring OP up to speed.  It might be a situation where the existing class has proven to be a handful and adding anyone else will only make things worse.  There are a dozen reasons why the professor may not enroll OP, but the bottom line is that it's her decision to make.",
                  "author": "DeskRider",
                  "created": 1630609438,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hbb9p7c": {
          "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbb9p7c/",
          "text": "It’s usually at the professor’s discretion as to whether someone can be added late. It sounds like regular drop/add is over and the only way to be added at this point is with permission, which can happen until September 3.",
          "author": "PhDapper",
          "created": 1630588860,
          "upvotes": 8,
          "replies": {
            "hbbgods": {
              "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbgods/",
              "text": "Did you read the post?",
              "author": "toofeduptocare",
              "created": 1630591941,
              "upvotes": -3,
              "replies": {
                "hbbhwez": {
                  "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbhwez/",
                  "text": "Yes, I did. What do you think I misunderstood?",
                  "author": "PhDapper",
                  "created": 1630592467,
                  "upvotes": 6,
                  "replies": {
                    "hbbparl": {
                      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbparl/",
                      "text": "OP claimed that the college itself said the deadline was September 3rd.",
                      "author": "toofeduptocare",
                      "created": 1630595578,
                      "upvotes": 1,
                      "replies": {
                        "hbbpjeb": {
                          "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbpjeb/",
                          "text": "That’s the deadline for late adds by permission according to the post. Sounds like it’s not the regular drop/add period, which must have already ended.",
                          "author": "PhDapper",
                          "created": 1630595676,
                          "upvotes": 8,
                          "replies": {
                            "hbbsreh": {
                              "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbbsreh/",
                              "text": "But it is the regular period. It says on the syllabus that the cutoff for 16 week classes is 9/3, and classes started 8/23. I think the professor just doesn’t want me in",
                              "author": "palm888angel",
                              "created": 1630596999,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hbalwss": {
      "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbalwss/",
      "text": "Do NOT give up just yet.  \nIt's not over till it's over",
      "author": "Rho_Bull",
      "created": 1630573262,
      "upvotes": 53,
      "replies": {
        "hbaoqud": {
          "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbaoqud/",
          "text": "From what I’ve read I’m pretty much screwed",
          "author": "palm888angel",
          "created": 1630575823,
          "upvotes": 11,
          "replies": {
            "hbddpb6": {
              "link": "/r/CollegeRant/comments/pgcqmp/i_completely_fked_myself_over/hbddpb6/",
              "text": "Don't rely on email. Call admin. Start in the department, then go to the general university admin in charge of scheduling. Send email as well, but if you get someone on the phone, they're more likely to help you",
              "author": "physgm",
              "created": 1630620213,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634064450
}