{"sid": "onic7e", "link": "/r/CollegeRant/comments/onic7e/chemistry_hell/", "title:": "CHEMISTRY HELL", "text": "So let me preface I have ZERO experience in chemistry. Like I had no idea what was even taught in chemistry beyond chemical formulas. So the class I'm in is like the basics of Chemistry I think. When I google things, highschool gets mentioned a lot lol. Anyway onto my rant.\n\nIt started off bad. I get bookservice funds but they expire 2 weeks before class starts typically. So I bought my book and activation codes from the bookstore bit don't bother to set anything up until a few days before class is due to start. But need an invite link to the course which yeah, super common, think nothing of it, no worries. Yeah was I wrong. Whatever textbook we were told to buy is not the right one. The teacher never stated this, just kept telling us crap that didn't work and it took another student to help me figure out what I needed. Idk if that's the teachers fault, but he also failed at getting all the online homework sites set up.\n\nIt took until Friday for me to get the textbook, for him to fix the online homework so we could login and we are in an accelerated course. 18wks condensed into 5. Our homework is due every Sunday along with chapter quizzes. At this point I have 2 days to learn 3 chapters plus 50 question homework assignments for each chapter. Needless to say I FLUNKED them.\n\nAnyway, moving on. Every week it's the same. 3 chapters, 3 sets of 50 question homework things, 2-3 lab experiments, some printed out assignments to fill in, discussion boards then chapter quizzes and a larger test of the chapters bundled together. I get it. It's accelerated, it's a ton of work.\n\nBut then I notice a pattern. All the homework that isn't part of the textbook, is stuff we learned the week before and I don't get it? Aren't we supposed to be practicing what we're gonna get quizzed on? Why are we practicing what we've moved on from?\n\nThe class is online and asynchronous so there's no lectures. Just slides. That have almost zero of the material he quizzes on. So they're a waste of time. And the quizzes. The quizzes. They're almost solely equation problems. Every question. He gives you one minute per question and I'm just...I'm flunking every quiz because I just do not have enough TIME.\n\nI'm not blaming the teacher for my lack of understanding of the material. Something is not clicking for me so I take responsibility for that. But I just feel like I've been set up to fail in this class and I'm so stressed because I can't apply for my program without passing it.", "author": "befuddledmama", "created": 1626714359, "retrieved": 1632949435, "over_18": false, "upvotes": 8, "upvote_ratio": 0.91, "comments": {"h5voh7t": {"link": "/r/CollegeRant/comments/onic7e/chemistry_hell/h5voh7t/", "text": "As someone who is now a chemistry TA and tutor at my school I’m sorry about how he’s formatting the class. Chemistry takes intensive problem solving skills, and you being in basic chem I your prof should know now to make anything overly complicated. Chemistry takes TIME, and a minute per questions sounds insane. Please reach out to someone if you want help! Me even! DM me if you feel comfortable", "author": "ttyltyler", "created": 1626792012, "upvotes": 6}}}