{
  "sid": "i7kqeo",
  "link": "/r/CollegeRant/comments/i7kqeo/anyone_else_have_the_worst_years_of_their_life_in/",
  "title:": "Anyone else have the worst years of their life in college?",
  "text": "College has been absolute hell for me. My freshman year I was in a horrible roommate situation, and sophomore year my roommate, who I considered to be my best friend at the time, ignored me for weeks and when I tried to talk to her about it she moved out and we haven't spoken since. I've been extremely depressed, my grades have fallen to C's after being a straight A kid in high school, and I don't have any friends since the school is so cliquey. The school culture is so incredibly image based and uptight, everyone is competing with each other constantly to be the prettiest, the most involved, have the most friends and the best grades. I've had people I considered to be friends tell me that I'm unattractive and I've been both bodyshamed and bullied here. I've tried to transfer but since its a private school I can't get my credits transferred and will have to start over if I do. It seems like everyone else around me is doing so much better than I am, and I've lost all of my friends along the way. I'm just afraid it won't get easier post college to make friends or to feel normal. Does it get easier after graduating?",
  "author": "katelynwestland",
  "created": 1597118494,
  "over_18": false,
  "upvotes": 92,
  "upvote_ratio": 0.97,
  "comments": {
    "g17cn6o": {
      "link": "/r/CollegeRant/comments/i7kqeo/anyone_else_have_the_worst_years_of_their_life_in/g17cn6o/",
      "text": "My first two years of college were horrible but it was because I went to a super small (only 1500 students) school in a town of 5000 people. I only went because it I got a Native American tuition waiver. They also only offered 35 majors, so I was stuck in a program in which I had very little interest. So few students made it very cliquey and gossipy. There also was no psychiatrist and a super long waitlist for counseling, so that didn’t make things better for me, especially because I didn’t have a car until the last few months that I lived there. So it wasn’t like I could drive to another town for care. I left after two years because I was withdrawing from classes left and right and I was having serious issues with depression. \n\nI moved to a larger city (50k people) and enrolled in a larger state school that had more to offer as far as majors, jobs, pay, nightlife, and events. I came here in 2018 and will be graduating next spring. The last two years of my life have been amazing, but I still had my ups and downs and felt like I had more resilience here than I did at my last school. \n\nMoral of the story is...each college is different and it may make you feel overwhelmed when you transfer, but I guarantee switching to a state school will be cheaper and will make it easier for you to start over. I started over and now have to take a 5th year because of it, but my grades have drastically improved since I moved here and I’m overall happy. \n\nIf I were you, I would transfer right away.",
      "author": "itsamberbitch",
      "created": 1597231574,
      "upvotes": 1,
      "replies": {}
    },
    "g14vevq": {
      "link": "/r/CollegeRant/comments/i7kqeo/anyone_else_have_the_worst_years_of_their_life_in/g14vevq/",
      "text": "College sucked for me too in my home country so I applied for a semester abroad (Erasmus in Europe) and spent 1 year oversees, making friends within the Erasmus community which was linked to the locals :) I would’ve dropped out if I had stayed home.",
      "author": "kuriny",
      "created": 1597175269,
      "upvotes": 1,
      "replies": {}
    },
    "g14lztj": {
      "link": "/r/CollegeRant/comments/i7kqeo/anyone_else_have_the_worst_years_of_their_life_in/g14lztj/",
      "text": "College was really tough early on but that was something that was necessary in my development, I was never going to break out or face the changes necessary to be the person I wanted to be if I didn’t go out of my bubble and comfort zone. By the end I was more comfortable and having fun and now I’m ready to pursue it all more in the rest of my life. College seems like a time for this, sometimes you gotta go through the bad.",
      "author": "fluffychiblets",
      "created": 1597170917,
      "upvotes": 1,
      "replies": {}
    },
    "g12rxs4": {
      "link": "/r/CollegeRant/comments/i7kqeo/anyone_else_have_the_worst_years_of_their_life_in/g12rxs4/",
      "text": "I agree with the other comment saying that life after college is easier. I’m going into my 2nd year, but I’ve changed my major so many times I’m practically a first year again. And honestly I’m still not satisfied with my current major. I’ve struggled making friends, and this pandemic happened right when I was breaking my shell. Now my anxiety spiked and I’m back in therapy.\n\nTL:DR college has sucked so far for me too. But we really just gotta keep our heads up bud <3",
      "author": "UwUkimoi",
      "created": 1597126400,
      "upvotes": 13,
      "replies": {}
    },
    "g12kvis": {
      "link": "/r/CollegeRant/comments/i7kqeo/anyone_else_have_the_worst_years_of_their_life_in/g12kvis/",
      "text": "The worst years of my life were grade school, I can tell you that life gets better after you graduate. Academia is a bubble from reality. I don't like college much either, but I worked full time when I graduated from high school and work environments are ten-times better. Academia seems to be filled to the brim with childish idiots who only seem to care about mainstream trends instead of their education. Makes me wonder how they even graduated high school let alone got into college.",
      "author": "NoChannel1",
      "created": 1597120769,
      "upvotes": 24,
      "replies": {
        "g13tw8f": {
          "link": "/r/CollegeRant/comments/i7kqeo/anyone_else_have_the_worst_years_of_their_life_in/g13tw8f/",
          "text": "[deleted]",
          "author": null,
          "created": 1597157252,
          "upvotes": 0,
          "replies": {
            "g13w23e": {
              "link": "/r/CollegeRant/comments/i7kqeo/anyone_else_have_the_worst_years_of_their_life_in/g13w23e/",
              "text": "I went to an inner city high school where drugs and gang violence were common so it operated similar to a prison. You either found a group or got bullied. I luckily found a group, but it still was no picnic. My middle school was in a good area, but the administration was corrupt and did nothing about the bullying because they needed their star athletes to play and not be in detention. Again, luckily I was able to join a group, but fighting continued with other groups.\n\n I'll sum up grade school for me, someone messes with me, I retaliated, I got in trouble. Mix all this with an abusive mother and you have the worst period of my life from 7th-12th grade.",
              "author": "NoChannel1",
              "created": 1597158533,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062596
}