{"sid": "dg82lx", "link": "/r/CollegeRant/comments/dg82lx/i_just_dropped_out_of_college/", "title:": "I just dropped out of college", "text": "I just dropped out\n\nI caught some freak virus that doctors believe to be the flu a few weeks ago and I missed 2.5 weeks of class. At this point I already failed one class because my professor has an understandably strict attendance policy and I was waaaayyyy Behind in all my other class to catch back up and still manage to pass.  I also had a job to pay for my apartment and I think I might have to quit that too.\n\nThe weird thing is, I’m okay with my life falling apart. Everything was stressing me out and I guess this virus is my body’s way of telling me to chill. Best thing to happen to me all year.", "author": "zeeainie", "created": 1570757982, "retrieved": 1632843515, "over_18": false, "upvotes": 41, "upvote_ratio": 0.98, "comments": {"f3bmogi": {"link": "/r/CollegeRant/comments/dg82lx/i_just_dropped_out_of_college/f3bmogi/", "text": "As someone who dropped out of college twice, that feeling of relief and \"okay with my life falling apart\" let me know I made the right decision. Enjoy your chill time, but use it well!!", "author": "capricorn_sun", "created": 1570813197, "upvotes": 4}, "f3b7hgh": {"link": "/r/CollegeRant/comments/dg82lx/i_just_dropped_out_of_college/f3b7hgh/", "text": "I think your body was telling you to slow down. However, I truly hope you continue with college by either returning next year or try part time. Regardless, I wish you luck & that you recuperate quickly!", "author": "Karenena", "created": 1570803628, "upvotes": 3}, "f3ap1vg": {"link": "/r/CollegeRant/comments/dg82lx/i_just_dropped_out_of_college/f3ap1vg/", "text": "I wish you the best if luck for what's to come!", "author": "Kocia-ska", "created": 1570784314, "upvotes": 3}, "f3af3kr": {"link": "/r/CollegeRant/comments/dg82lx/i_just_dropped_out_of_college/f3af3kr/", "text": "I’m not sure where you’re from, what college you went to, or what your background is - \n\nYou’re fineeeeeeee.\n\nCollege is NOT the only route to success. Do not beat yourself up over the title of “college dropout”. However, that does not mean you can sit around all day, you have to start figuring out what you want to do instead (and this does not happen by just thinking). Go out and DO.\n\nYou got this, you have your whole life ahead of you. Get fired up for what’s ahead!!", "author": "BreadedYogurt", "created": 1570770730, "upvotes": 17}, "f3a9wbg": {"link": "/r/CollegeRant/comments/dg82lx/i_just_dropped_out_of_college/f3a9wbg/", "text": "I know you’re having a rough time and I just wanna say that I hope things get better. I hope you feel better and I hope that things fall into place for you.", "author": "regxswan", "created": 1570765646, "upvotes": 15}}}