{"sid": "k93j0b", "link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/", "title:": "Can we please be treated like STUDENTS and NOT CONSUMERS?", "text": "It’s so stupid seeing all these useless fees for a student that is virtually taking all of her college courses online. It irks me to see a $275 athletic fee, $85 recreational fee, $75 transportation fee, $36 student center facility fee, $85 library facility fee and so on for the seeing a professor accidentally talk on mute experience or the teaching myself experience. \nOn a side note look up how much a college president makes a year. (It’s varies but there you go)", "author": "establisher", "created": 1607431411, "retrieved": 1632950195, "over_18": false, "upvotes": 352, "upvote_ratio": 0.99, "comments": {"gf53xkx": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf53xkx/", "text": "Not in America", "author": null, "created": 1607492820, "upvotes": 1}, "gf3xmhg": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf3xmhg/", "text": "Students should be treated like *customers* and not *consumers*. Colleges don't view their students as anything but consumers. \n\nIt's why they tack on fees upon fees. \n\nIt's why when those fees don't apply to the student, they still get tacked on.\n\nIt's why a lot of professors are lazy at best and utterly incompetent at worst.\n\nIt's why many professors can openly show contempt for their students when they have to teach.\n\nIt's why colleges don't do anything to those contemptuous professors unless they do something that can get *the college* in trouble. With few exceptions, they are free to engage in unethical/incompetent bullshit towards students if the college can't be punished.\n\nIt's why shit like Respondus is implemented and not actual anti-cheat measures.\n\nIt's why cheating is treated as the cause *and* the symptom rather than just the symptom of the college's or professor's own ineptitude/incompetence/laziness.\n\nIt's why 99.99% of the curriculums are questions copy/pasted from Google as opposed to requiring, at their easiest, reading, interpreting, and understanding the information you read from Google. This is why a lot of courses, especially online ones, are largely just \"you teach yourself, we just grade you and look pretty\".\n\nEverything about how colleges handle their service, and it *is* a service that they are providing, is intentionally designed to make it so they get paid for *not* providing the service while price gouging you at every turn since they know the majority of employers seem to have no comprehension of the concept of reasonable job requirements.", "author": "-LuciditySam-", "created": 1607470703, "upvotes": 6}, "gf3p5gr": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf3p5gr/", "text": "I took all of my classes online this semester and I still had to pay an extra $250+ for athletic/recreation fee, $50+ for transportation, and a bunch of unnecessary charges that I never even used 💀 I’ve never used the gym nor do I play any sports. The least they could do is give us a refund on those fees but my school is stingy", "author": "acorn_dotori", "created": 1607466697, "upvotes": 7}, "gf3mj57": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf3mj57/", "text": "As a college professor (adjunct- we make minimum wage, essentially) I cannot BELIEVE what they are doing to schools and to students.\n\nFORGET THE BOWLING LANES!  FUCK THE FREE MOVIE NIGHTS!   Teach your goddamn classes and don’t make students go into ridiculous debt.\n\nAirlines make their money off of first class.  More and more, colleges make their money off of those that can afford full tuition.", "author": "emarcomd", "created": 1607465398, "upvotes": 8}, "gf3abms": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf3abms/", "text": "the fees are bs especially for people who never dorm and even more bs right now", "author": "deathworld123", "created": 1607459696, "upvotes": 3}, "gf35k7o": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf35k7o/", "text": " I am being charged double this upcoming semester and more because I have exceeded the hours in my degree (out of state tuition fee). The only reason this occurred because I was in a different university with the same degree but different degree plan. This honestly is the most stupidest thing I’ve ever heard to be honest it really put things into perspective. My Finacial aid is coming to an end unfortunately and I had begin taking out loans a couple of semesters ago. If I knew this is what “college” really was I would have just done something else because this sucks so hard.", "author": "sarairams24", "created": 1607457456, "upvotes": 6}, "gf2nvt7": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf2nvt7/", "text": "One time, and I’m not proud, but I was slapped on a 25$ late fee over the weekend. My school gave me 6 weeks to pay 1800$. I just finished spring semester and live on my own and bc of how much I was making was NOT  getting financial aid. So after paying all the bills for the month ur telling me I need to pay all this in just one month basically???? Umm fuck no and how I was treated by the person at the business office, bc that’s where we pay our tuition in person, she didn’t let me see her supervisor or give me her number and email. And I’m not very calm when I’m angry, so when she refused me service I got irate started yelling at everyone of those people, told them exactly what I was going to do and told her she’ll be hearing from me again. Went in to the school grievance office put in  that, then when over head to the head of the business office met with them and told them how I was treated. Then I went to the border of trustees and found out if I want to change payment plans I needed to sit in a meeting and then present it to the border which is only held on specific Thursdays at not always the same time. So, I told him I would also be going over his head... long story short I went all the way to the vice chancellor of finances of the district of the school. She was not happy to hear from me. I had to look up property ownerships of the land the school sat on just to find her number, so when I explained to her everything and that if she checked her email she would also see a written and filed grievance and my attempts to go to the board meetings, she immediately took off the 25$ charge and miraculously the next semester we no long had to pay full tuition in one month. Also the students received information about the faculty now needing to take sensitivity training to handle escalated issues. Again, not proud of this but if u really want to fuck with ur school and get notice then ur going to have to make a lot of noise to do it. And ur going to need to offend some people by going over their head and piss some people off by actually finding their direct number. Students have so much power if we actually rallied behind the ideas we want. Bc I don’t think they are out of line being treated like a student? Oh fuck yea I agree and I have had to remind grown ass adult professors that they aren’t the only adult in the room. Not all of us come fresh out of high school.", "author": "Hawkbiitt", "created": 1607449398, "upvotes": 13}, "gf2nj0k": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf2nj0k/", "text": "I get irked by this notion a lot. My school has one of the lowest tuition rates in the state but somehow manages to get amenities like a dental office and a bowling alley. They are trying to be the big school in the city closest but are in The middle of nowhere. \nI could do without the bowling alley to which it drove the local one out of business but that low cost dental office was beneficial. I got my wisdom teeth out for $60. Also if you go to a public school and have a free Friday night, I highly recommend you look at how much your professors,football coach, and President makes. My school has an excel sheet on request but a math professor who’s angry that the football coach gets $250k publishes it every year.", "author": "AXXII_wreckless", "created": 1607449234, "upvotes": 15}, "gf2dm7k": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf2dm7k/", "text": "[removed]", "author": null, "created": 1607444619, "upvotes": -10}, "gf2demo": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf2demo/", "text": "Jesus paying at the end again just for the diploma?", "author": "establisher", "created": 1607444519, "upvotes": 6}, "gf2c6j6": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf2c6j6/", "text": "The fees are annoying as hell. I was as cost efficient as possible with school (did most of my pre reqs at community college, commuted to university, no extra currics that cost money, had a job on the side, went to an in state school) there's literally no reason I should be paying for food fees or campus fees or transportation. I literally just showed up to class then left the campus. Plus, graduation fee! I spend all this time and money to get my diploma and now you're saying I have to pay to graduate?? After doing all that??? It's astounding that you can go to college for 4 years, do everything you need to, but if you don't pay for your piece of paper in time, you can't graduate. Fucking ridiculous", "author": "vness1213", "created": 1607443941, "upvotes": 21}, "gf22iqg": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf22iqg/", "text": "Emphasis on the “not in a hole by graduation”. \n\nSome countries offer degrees that are recognized worldwide for free and somehow, in the US, most students or parents are broke. The system is run by greedy pigs who create policies to keep robbing people in order to fund their eccentric lifestyles.\n\nNo college out there cares about their students. It’s all profits. Covid has shown us that.", "author": "majoroofboys", "created": 1607439092, "upvotes": 31}, "gf1wsux": {"link": "/r/CollegeRant/comments/k93j0b/can_we_please_be_treated_like_students_and_not/gf1wsux/", "text": "It's because colleges are trying to attract the students that can comfortably just be consumers. It's why they pool all their money into renovating buildings to make them more modern and state-of-the-art equipment instead of giving it to underfunded departments and students in need.\n\nBack when college was more affordable, it was partially because they received more government funding through taxes of the people in the area. But as taxes got cut and budgets moved around more and more, the burden of paying for school ended up more and more on students.\n\nSo schools decided to appeal more to students who could pay more (not to mention people who had parents who would donate thousands just to help ensure their kid had a slot). Of course, they basically started shutting out the poor kids somewhat because they ended up adding the additional burden of having to pay for fees to help pay off their bills\n\nAlso there's just plain old greed as you pointed out. Like right now you have college administrations lining their pockets with the extra CARES act money that was supposed to be dedicated towards helping students. Also, even pre-CARES ACT, schools have several millions they're sitting on from fundraisers and donors but conveniently couldn't use to help students with full room & board and partial tuition refunds because \"we don't decide how that money is spent\" \n\nSo long story short, the US College System is a burning trash heap. Literally every other developed country has higher education that does not end with most students in the hole by graduation.", "author": "sunnirays", "created": 1607435739, "upvotes": 87}}}