{"sid": "l0kl7c", "link": "/r/CollegeRant/comments/l0kl7c/i_hate_these_paid_access_learning_softwares/", "title:": "I hate these paid access learning softwares", "text": "I just got into my first class this morning and my teacher being all positive is like don't worry you wont need the book... But you need to purchase a 100$ access code to take these quizzes the department wants you to take.\n\nI don't have that kind of money i bought the book secondhand to try and save money and now its practically useless.\n\nIf you want me to take these quizzes so bad why not oh i don't know PUT THEM ON D2L.  YOU KNOW THE SOFTWARE WE ALREADY HAVE.  But no i have to get yet another course access code for this semester only just so i can make a good grade.\n\nHonestly im at the point of just taking the 50pt loss and getting a lower grade but of course my anxiety wont allow that.\n\nIf you read through this entire thing im sorry im mad and just needed to vent.", "author": "SmileyDev", "created": 1611065598, "retrieved": 1632950761, "over_18": false, "upvotes": 136, "upvote_ratio": 0.99, "comments": {"gjwp5cd": {"link": "/r/CollegeRant/comments/l0kl7c/i_hate_these_paid_access_learning_softwares/gjwp5cd/", "text": "I had one professor apologize today saying they don’t like the software and wouldn’t use it but since we are remote the school requires it. If we weren’t remote, no book, no software. RIP my $129.", "author": "Bodidiva", "created": 1611113982, "upvotes": 2}, "gjv9hte": {"link": "/r/CollegeRant/comments/l0kl7c/i_hate_these_paid_access_learning_softwares/gjv9hte/", "text": "Just an aside here - but we (professors) don't always choose our books. Depending on the course and institution, there might be a department-wide determination to use one particular book and accompanying software. \n\nMy department just changed to use a new book, which is fine and all, but the accompanying software and hoop jumping for the profs and the students as well has been nothing short of appalling. \n\nI have always in the past either used free online books, or just straight up copied and provided the pdfs to the students. There is truly no bigger rip off than the publishing companies in academia, and I legit LOVED the part of the semester when I got to tell my students that they could pirate the book if they liked and then gave them some sites where they could get it. One semester I had a student ask to borrow my book, then she went and made pdfs of every reading, and sent them to me to post on our LMS. I was thrilled. \n\nAnd don't get me started on that bullshit software that takes your picture every few seconds while you take a test. That's straight up not ok. But students aren't in a position to object, and it's seriously messed up.", "author": "Readthesyllabus3", "created": 1611087975, "upvotes": 8}, "gjv3ish": {"link": "/r/CollegeRant/comments/l0kl7c/i_hate_these_paid_access_learning_softwares/gjv3ish/", "text": "Yep I’m with ya, idk how many times I’ve paid for Cengage/Mindtap at $100+ a pop for 4 months or whatever it is. I think classes should tell you ahead of time if you need these access codes so the least you can do is purchase a longer subscription and save money. I’ve wasted so much money.", "author": "trippapotamus", "created": 1611085281, "upvotes": 3}, "gjuzp7h": {"link": "/r/CollegeRant/comments/l0kl7c/i_hate_these_paid_access_learning_softwares/gjuzp7h/", "text": "It's so criminal what publishers get away with.\n\nI mean even my digital media class had VMs set up so we didn't have to pay money to use Photoshop and the book was $20 max to rent, or we could access it in the library virtually.", "author": "SweetTeaBags", "created": 1611083511, "upvotes": 4}, "gjuwsr2": {"link": "/r/CollegeRant/comments/l0kl7c/i_hate_these_paid_access_learning_softwares/gjuwsr2/", "text": "Professor here. Just wanted to say I agree 100%. All these companies are ruthless too. I get tons of emails and reps that want to stop to convince me to use something so that they can suck money out of you.", "author": "real-nobody", "created": 1611082190, "upvotes": 18}, "gjuv4oc": {"link": "/r/CollegeRant/comments/l0kl7c/i_hate_these_paid_access_learning_softwares/gjuv4oc/", "text": "Honestly, this is the price we have to pay for trying to be resourceful. It makes no sense that departments in my college enforces the rule that we must pay 125 for a book with an access code to take “quizzes”. How an independent institution makes its students, the consumer who already pays thousands of dollars just to sit in a lecture hall, pay even more money to a company who has nothing to do with the institution itself. To me it makes zero sense. I can find the book for 12.75 for resale; however, my professor insists on doing the quizzes from the book, instead of writing their own. It is the antithesis high educations failure, and the ultimate disrespect of reducing people to numbers on a class sheet, instead of reaching out and teaching students. No wonder people are saying college is worthless! And I feel awful for people who aren’t in the position I am, where I only have to pay for books. When I see access codes, I see colleges colluding with companies to gain profits. So that’s the rant lads.", "author": "Longjumping_Pride235", "created": 1611081442, "upvotes": 9}, "gjurx5l": {"link": "/r/CollegeRant/comments/l0kl7c/i_hate_these_paid_access_learning_softwares/gjurx5l/", "text": "Dude access codes are the fucking worst", "author": "ren65", "created": 1611079963, "upvotes": 3}, "gjuljp6": {"link": "/r/CollegeRant/comments/l0kl7c/i_hate_these_paid_access_learning_softwares/gjuljp6/", "text": "I'm feeling it, too. Had to pay $120 for MindTap so I can do the course material for a completely online computer applications class. For a basic class like that it hurt a bit. I should have dual enrolled in high school for that class.", "author": "drowned_anus", "created": 1611077105, "upvotes": 8}, "gjtz7k7": {"link": "/r/CollegeRant/comments/l0kl7c/i_hate_these_paid_access_learning_softwares/gjtz7k7/", "text": "I’m sorry. Those softwares are such a scam and absolutely just textbook companies money grubbing because they knew people resell their books or find them for free. It makes me so mad when profs agree to use their buggy ass software too. If you want advice, tell your professor. Seriously, send them an email and tell them you don’t have the money to afford an access code. It will at least buy you some leeway on the first few quizzes and they might even be able to connect you with resources to help pay for it or offer an alternate way to complete that portion of the class. Good luck!", "author": "crunchy_tit", "created": 1611066451, "upvotes": 41}}}