{
  "sid": "qxyrwm",
  "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/",
  "title:": "Why are professors allowed to assign any work during a break?",
  "text": "It's not every professor, but it's at least one every semester. Fall/Spring break comes around, and I can't get just ONE WEEK without a professor assigning something during it. It's happened in most of my semesters starting from high school. There's always that one teacher, and it keeps happening in college. Most of the time, there aren't any assignments due *during* the break, but they're due *the day immediately following the break*, so if I can't get it done in 1 day, I'd have to work on it during the break. The few teachers that have commented on this have said \"work on it now, so you won't have to work on it during your break\".\n\n**JUST MAKE IT DUE BEFORE THE BREAK! WHY CAN'T YOU RESPECT MY BREAK?!**\n\nThankfully, it's usually not an assignment that we didn't know about ahead of time, but why are they even allowed to assign work during the break? In my last two semesters, I've had a professor assign work that was actually DUE during the break, which I didn't even know was allowed.\n\nIt's a break off from coming to class, but if all of my classes are online and I'm not going to an in-person class anyway, then I'm not even getting that benefit.",
  "author": "Net56",
  "created": 1637386353,
  "updated": 1637689675,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.69,
  "comments": {
    "hle87dw": {
      "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hle87dw/",
      "text": "Were you able to start the assignment well before the break began? If so, then you have time before the break to finish it so that you don’t have to work on it during the break.\n\nThere are some students who would rather things be this way so that they have the break time to do it. They’d complain if they didn’t.\n\nAlso, they aren’t disrespecting your break. That’s why they’re giving it to you in advance of the break starting so that you can choose when to work on it. If you choose to wait until your break, then you have that option; if you choose to do it before the break, then you have that option, too.",
      "author": "PhDapper",
      "created": 1637422859,
      "upvotes": 10,
      "replies": {
        "hlg2nle": {
          "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hlg2nle/",
          "text": "That's a reply that fundamentally ignores the nuances of human behavior. I'm 37, and I've literally *never* started an assignment more than 24 hours before it was due. I have the option of doing it earlier, just as I have the option of deliberately driving into oncoming traffic on the highway; they're both technically possible , but they're also both so far outside of my behavioral paradigm that realistically, neither one is *ever* going to happen.",
          "author": "CubistHamster",
          "created": 1637452034,
          "upvotes": -2,
          "replies": {
            "hlg57s7": {
              "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hlg57s7/",
              "text": "Choosing to drive into oncoming traffic is extremely dangerous. Choosing to be proactive is a smart way of managing your time. If all you ever do is procrastinate, you can change your behavior without threatening your safety. If you choose to drive into oncoming traffic, you’re risking severe injury or death.\n\nSure, it’s really difficult to break out of the habit of procrastination, and it might be a real challenge, but it’s also a responsible way to manage your time. There are lots of human behaviors that are common and easy but also detrimental to health and safety. That doesn’t mean that we shouldn’t work to make ourselves better.",
              "author": "PhDapper",
              "created": 1637453217,
              "upvotes": 6,
              "replies": {
                "hlg798i": {
                  "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hlg798i/",
                  "text": "I don't disagree with you--but I also know that in my case it's simply not going to happen (and there's no particular reason to, in my case. My program is Marine Engineering--our curriculum is dictated by the US Coast Guard, the overwhelming majority of our work consists of practical demonstrations. When I finish my ethics class this semester, I'll be completely done with Gen Ed. requirements, and will have no more classes with long-term assignments.)\n\nThat sort of procrastination is a deeply rooted part of my personality. I *might* be able to change it, with tremendous effort, but I decided a long time ago that it was a better use of time and effort to arrange my life so that particular trait wasn't a major downside (which has worked out quite well so far.)",
                  "author": "CubistHamster",
                  "created": 1637454184,
                  "upvotes": -2,
                  "replies": {}
                }
              }
            },
            "hlqm857": {
              "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hlqm857/",
              "text": "You’re 37 and posting about writing papers. Clearly something has gone a more non traditional route and your insight isn’t really relevant.",
              "author": "snoboy8999",
              "created": 1637648247,
              "upvotes": 1,
              "replies": {
                "hlrtdz9": {
                  "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hlrtdz9/",
                  "text": "There are 23 students in the same stage of my program (Marine Engineering) at school. 8 of them are under 30 years old. (4 are older than me.)\n\nAlso found a variety of sources putting the average age of Community College students in the US at 28-29. Perhaps not *quite* so irrelevant.",
                  "author": "CubistHamster",
                  "created": 1637678732,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hleq2d6": {
      "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hleq2d6/",
      "text": "If they make it due before the break, then you have to work on it before the break. If they make it due after the break then you can work on it before the break, since you don't like working during your break, while people who do like to use the break to catch up on assignments can do that. \n\nYour proposed option is worse for some people and no better for people like you. There is no category of people for whom it is better.",
      "author": "BarackTrudeau",
      "created": 1637430478,
      "upvotes": 5,
      "replies": {
        "hlg36hv": {
          "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hlg36hv/",
          "text": "It's better for people who are going to feel like it's hanging over their heads during the break (thus reducing the R & R value of the break) who are also *not* going to work on it over the break. \n\n(I am one of those people; I would legitimately rather not have more than a day's notice any assignment that actually requires turning something in.)",
          "author": "CubistHamster",
          "created": 1637452277,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "hlgp6oo": {
      "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hlgp6oo/",
      "text": "That reminds me of how last winter semester my college gave us two break days instead of spring break so people wouldn’t travel and one of professors gave us several extra assignments since we weren’t meeting. Like what?! That’s literally not what the ** BREAK ** is for 😭",
      "author": "junocereal",
      "created": 1637462985,
      "upvotes": 1,
      "replies": {}
    },
    "hld0ojt": {
      "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hld0ojt/",
      "text": "Last semester I had assignments due before the break never after or during.",
      "author": "Forever_ForLove",
      "created": 1637392563,
      "upvotes": 1,
      "replies": {}
    },
    "hllq6y8": {
      "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hllq6y8/",
      "text": "Was the homework assigned to be done over the break, or was it assigned earlier and you chose to leave it for the break?",
      "author": "TheProfessorsCat",
      "created": 1637556372,
      "upvotes": 1,
      "replies": {}
    },
    "hllsvup": {
      "link": "/r/CollegeRant/comments/qxyrwm/why_are_professors_allowed_to_assign_any_work/hllsvup/",
      "text": "I feel you. I have several things due literally the day after break and one of my professors wants us to work on it specifically over the break. It’s stupid, but you’ll have to put up with it a few times over your time in college.",
      "author": "Key_Cobbler_6967",
      "created": 1637557939,
      "upvotes": 1,
      "replies": {}
    }
  }
}