{
  "sid": "nserxw",
  "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/",
  "title:": "Crying my eyes out. Thought the exam deadline was 11:59 PM. It was 11:59 AM.",
  "text": "I have a 100% (my social life is non existent) in my Biology I class and I completely misread the deadline. I came back from work at 4 and had a panic attack when I saw the quiz was locked. It's a Friday after usual office hours so I doubt she will even read my email. I am feeling so dumb. I always have all my other work turned in days before the deadline and am always diligent in the class.\n\nI have been refreshing my email every 5 minutes for the past 45 minutes. My grade will drop to a 64 if I have to take the 0. No idea what to do.\n\n&#x200B;\n\nEDIT: Still no reply. I decided to take the day off work in case she opens the exam for me today at a weird time. Wasn't able to sleep last night because of anxiety. ",
  "author": "ASmallGardenFairy",
  "created": 1622838771,
  "over_18": false,
  "upvotes": 333,
  "upvote_ratio": 1.0,
  "comments": {
    "h0odxc6": {
      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0odxc6/",
      "text": "I’m a professor and the only time I’ve ever made something due at 11:59am is when I messed up setting the time for PM. Chances are your prof has a dozen emails exactly like yours and he/she will reopen it with apologies.  If that’s not the case, I’d be shocked if you weren’t granted an extension based on your past work.",
      "author": "oleladytake",
      "created": 1622893988,
      "upvotes": 19,
      "replies": {}
    },
    "h0o5yep": {
      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0o5yep/",
      "text": "Try to contact your Professor and be honest about it! I would help you out, however, some Professors would not. Therefore, if you think your Professor is a hard ass -- lie! Students have been pulling the Covid card and getting away with it for the past year! The question is: are you going to remain ethical and take the higher road and chalk this up as a learning experience (which it is since I doubt you will do this again in your life); or are you going to take the low road and lie (a business person or lawyer would likely do this!)",
      "author": "erice3r",
      "created": 1622887594,
      "upvotes": -2,
      "replies": {}
    },
    "h0nw1dc": {
      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0nw1dc/",
      "text": "Profs who pull that shit and fake students out are the worst. If you want to make your stuff due at a weird time that isn’t midnight don’t make it look like it’s due at fuckin midnight. I’m convinced they do it intentionally and are just spiteful",
      "author": "TheFlamingLemon",
      "created": 1622878476,
      "upvotes": 16,
      "replies": {}
    },
    "h0nr3fn": {
      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0nr3fn/",
      "text": "My Lecterers at univrrsity have a policy. All assignments are due at 11:59pm in all the wine department \n\nIts an unspoken rule I find it avoids confusion. \nHowever that really sucks, hope the university is not one that is really strict with its deadlines",
      "author": "Impressive-Name5129",
      "created": 1622874195,
      "upvotes": 5,
      "replies": {}
    },
    "h0nowxz": {
      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0nowxz/",
      "text": "Try to not worry--the nice profs will give you another chance, especially if you already have a good grade in the class.\n\nJust remember that whatever happens it will still be okay. Really. I have ADHD and do major stuff like this once or twice a year, and more minor stuff all the time. (Yes, it's a stressful way to live but such is the ADHD life . . . ).\n\nI have found that when I make a sincere mistake people are really willing to give me grace and I hope your prof will be understanding and give you grace as well!",
      "author": "Purple_Chipmunk_",
      "created": 1622872445,
      "upvotes": 11,
      "replies": {
        "h0ox598": {
          "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0ox598/",
          "text": "Off topic but for your adhd do you use the accessibility services at your school for things like extra testing time and other accommodations? My bf has adhd and isn’t on medication and he’s having a hard time in school.",
          "author": "kenziechurch",
          "created": 1622905189,
          "upvotes": 2,
          "replies": {
            "h0pisyr": {
              "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0pisyr/",
              "text": "Yes, he should DEFINITELY contact the disability office at his school!!",
              "author": "Purple_Chipmunk_",
              "created": 1622915445,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h0nkw0k": {
      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0nkw0k/",
      "text": "just email with the completed work so she at least knows you're not trying to get away with anything.",
      "author": "rheetkd",
      "created": 1622869440,
      "upvotes": 12,
      "replies": {
        "h0o2rmq": {
          "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0o2rmq/",
          "text": "Once i did this with the exact same thinking  in my mind but the TA scolded me saying that i am basically forcing him to grade me and i should have asked first if i could send the work.",
          "author": "bewarevsaware",
          "created": 1622884693,
          "upvotes": 5,
          "replies": {
            "h0o318v": {
              "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0o318v/",
              "text": "yeah well you dont demand it. You apologize for being wrong first and attach the work so they know you were not doing it intentionally.",
              "author": "rheetkd",
              "created": 1622884898,
              "upvotes": 0,
              "replies": {
                "h0o4poc": {
                  "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0o4poc/",
                  "text": "I did exactly this. I apologized and gave a detailed explanation of the situation which was me hurting my ankle and therefore could not go to school (ca. 40kms from where i live) at the day we were supposed to hand in the homework as hardcopy. And i mailed the homework just so he knows that i did it and i am not trying to postpone it or anything but could not hand in and will do so once i get back on my feet. He scolded me having all this information (written them on mail in a proper way).",
                  "author": "bewarevsaware",
                  "created": 1622886465,
                  "upvotes": 3,
                  "replies": {
                    "h0o55tb": {
                      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0o55tb/",
                      "text": "did you provide a medical certificate for the injury? I have never had an issue. But sad to hear you did. It can be difficult at times, however that email is still vital.",
                      "author": "rheetkd",
                      "created": 1622886870,
                      "upvotes": 1,
                      "replies": {
                        "h0o5h9o": {
                          "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0o5h9o/",
                          "text": "I could not bcs i did not go to the hospital. He has the right to not accept it but his claim on me crossing a boundary and sending the proof for the homework is actually commanding him to grade is was just ridiculous in my opinion. And i still think that he could have been more understanding since i had provided the proof. He could have just asked for a report from the hospital and i would have gone then but i can tend to it at home, i know how to, that is why i did not make the effort to go to a hospital.",
                          "author": "bewarevsaware",
                          "created": 1622887160,
                          "upvotes": 3,
                          "replies": {
                            "h0o63s7": {
                              "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0o63s7/",
                              "text": "Well you should have at least seen a GP then.",
                              "author": "rheetkd",
                              "created": 1622887728,
                              "upvotes": -7,
                              "replies": {
                                "h0o6zxa": {
                                  "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0o6zxa/",
                                  "text": "He did not ask for it? And even afterwards he said he believed me but the problem was that i sent him the digital version of the homework without asking for his permission if i could send him the homework.",
                                  "author": "bewarevsaware",
                                  "created": 1622888511,
                                  "upvotes": 2,
                                  "replies": {
                                    "h0o7npn": {
                                      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0o7npn/",
                                      "text": "yeah that seems odd. However, I have personally never faced push back like that. But to be fair i'm a disabilities student.",
                                      "author": "rheetkd",
                                      "created": 1622889055,
                                      "upvotes": 0,
                                      "replies": {
                                        "h0o9qcb": {
                                          "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0o9qcb/",
                                          "text": "It only has to do with his character in my opinion.",
                                          "author": "bewarevsaware",
                                          "created": 1622890766,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h0necyr": {
      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0necyr/",
      "text": "I'm a professor. If you have a 100 in the course, yeah, I'd work with you. Really terrible there's profs out there who wouldn't.",
      "author": "big__cheddar",
      "created": 1622865165,
      "upvotes": 97,
      "replies": {
        "h0nxj7b": {
          "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0nxj7b/",
          "text": "I wish I had you as mine. Can’t say the same. Got the short end of the stick with the exact same scenario and a 100 in the course. This was a couple years ago though.",
          "author": "majoroofboys",
          "created": 1622879848,
          "upvotes": 23,
          "replies": {}
        },
        "h0qfjl3": {
          "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0qfjl3/",
          "text": "I accidentally did this once in a class that had online midterms (this was way before COVID) After a couple hours of back and forth emailing and vaguely aggressive emails about how she was \"talking to the degree advisor\" (oooh you're talking to a professor I had last year how scary lol) she finally reopened the exam. \n\nNever had anyone else do the whole back and forth part, usually professors will either just say yes or no and that's the end of that.",
          "author": null,
          "created": 1622932038,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h0mcyf8": {
      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0mcyf8/",
      "text": "I just graduated college with a 3.99 and this happened to me on more than one occasion. Most of the time my professor was really understanding and willing to work with me as I was a good student. However, there was the occasional time where they wouldn’t and in those time I tried to think of the worst possible scenario and how that would impact my life. \n\nSo let’s say you get a 64. Depending on your school that may or may not be passing. No matter what you can always take it again and replace the original grade on your transcript if you’re worried about overall gpa. That may seem like the end of the world but you’ve probably already done most of the work so would it really be that hard to add it on to a later semester? And if you’re not worried about your GPA (read: you’re not trying to go to a top law or med school) then who cares? One low grade isn’t going to matter. \n\nSo, hope for the best but know that if it doesn’t pan out the way you hope then there’s options you can take to fix the error. You’re human, try to cut yourself a little slack",
      "author": "MrsMelodyPond",
      "created": 1622845067,
      "upvotes": 83,
      "replies": {
        "h0nu7sr": {
          "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0nu7sr/",
          "text": "What college?",
          "author": "procrastinatinq",
          "created": 1622876836,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "h0m0ehj": {
      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0m0ehj/",
      "text": "Right now all you need to do is wait for your professor, that is completely out of your control so please take a deep breath and wait for the email. You can’t control the time span of when they reply so don’t worry too hard",
      "author": "Just-me-please",
      "created": 1622839252,
      "upvotes": 189,
      "replies": {}
    },
    "h0lzd4j": {
      "link": "/r/CollegeRant/comments/nserxw/crying_my_eyes_out_thought_the_exam_deadline_was/h0lzd4j/",
      "text": "\nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nhttps://suicidepreventionlifeline.org",
      "author": "hotlinehelpbot",
      "created": 1622838783,
      "upvotes": 39,
      "replies": {}
    }
  },
  "updated": 1634063923
}