{"sid": "pyb9ov", "link": "/r/CollegeRant/comments/pyb9ov/dorm_life_sucks/", "title:": "Dorm life sucks", "text": "Why do people just sit in the hallways on the floor and block the entire hallway?? There’s literally a nice sized lounge right above us but no they would rather sit on the dirty floor in front of my door. I have a paper to write I don’t want to hear these fucking idiots screaming outside my door and looking at me like I have three heads when I leave my room to go to the bathroom. I literally have to step over them and when I do they’re all like “sorry”. Well if you’re sorry then why do y’all keep doing it?\n\nWhy do people act like they’re still in high school? Seriously grow up.", "author": "BlopperBlooper", "created": 1632971856, "retrieved": 1633029488, "over_18": false, "upvotes": 70, "upvote_ratio": 0.98, "comments": {"hevrmms": {"link": "/r/CollegeRant/comments/pyb9ov/dorm_life_sucks/hevrmms/", "text": "why don't you guys have bathrooms in your dorms like every room", "author": "mans123373u2", "created": 1633027220, "upvotes": 1}, "heuxp8n": {"link": "/r/CollegeRant/comments/pyb9ov/dorm_life_sucks/heuxp8n/", "text": "People did that all the time my freshman year, and I hated every second of it.", "author": "SuggestionElectrical", "created": 1633014816, "upvotes": 3}, "heuwlyu": {"link": "/r/CollegeRant/comments/pyb9ov/dorm_life_sucks/heuwlyu/", "text": "Be that guy and tell them to fuck off and go somewhere else lol, I’ve done it, who carss", "author": "More_Coffees", "created": 1633014359, "upvotes": 3}, "heugwwk": {"link": "/r/CollegeRant/comments/pyb9ov/dorm_life_sucks/heugwwk/", "text": "I was in dorms in early 1990's, but it seems things have not changed one bit.  There were always three sounds:  people having sex, music, or loud girls talking.   \n\nYour mistake is trying to do homework in the dorm.  You should go to the library or empty classroom.   Be careful with empty classroom, I did that and woke in the middle of a lecture.", "author": "-Economist-", "created": 1633007362, "upvotes": 5}, "heucunv": {"link": "/r/CollegeRant/comments/pyb9ov/dorm_life_sucks/heucunv/", "text": "In my case most people on my floor who did stuff like this ended up dropping out at the end of first semester or at least by sophomore year. I think there’s a lot of people who come to college but aren’t yet mature enough to handle professors who don’t cater to their every need or being surprised they’re actually expected to do homework and there are consequences to not doing it, as well as not going to class then being surprised that they’re failing.", "author": "ms-tangled", "created": 1633005221, "upvotes": 5}, "hettcmt": {"link": "/r/CollegeRant/comments/pyb9ov/dorm_life_sucks/hettcmt/", "text": "maybe ask them to move or tell the RA about it?", "author": "gamergirl12305", "created": 1632990176, "upvotes": 1}, "hetnjs4": {"link": "/r/CollegeRant/comments/pyb9ov/dorm_life_sucks/hetnjs4/", "text": "literallyyyy if i sit in the hallway because the lounge is full, i do so without making any noise. the girls on my hall slam their doors and scream at full volume constantly", "author": "yell0wcherry", "created": 1632984979, "upvotes": 9}, "hetfav0": {"link": "/r/CollegeRant/comments/pyb9ov/dorm_life_sucks/hetfav0/", "text": "Walk out naked and assert dominance", "author": "genericusername_____", "created": 1632978928, "upvotes": 36}, "hetbqyw": {"link": "/r/CollegeRant/comments/pyb9ov/dorm_life_sucks/hetbqyw/", "text": "That sounds extremely annoying", "author": "TragicalKingdom", "created": 1632976622, "upvotes": 11}}}