{"sid": "nkuc12", "link": "/r/CollegeRant/comments/nkuc12/im_stuck_in_a_corner_i_need_help_on_how_to_go/", "title:": "I'm stuck in a corner. I need help on how to go about this.", "text": "So animation is one of my majors, ive taken every single class for this major even some upper division courses but one class is impossible to have for some reason.\n\nIts 3d design, I waited maybe a year and a half for it to open back up in my community College, it hasn't resurfaced in a year thanks to covid. I applied to a whole other college two cities down. Now im wait listed.\n\nI need this class because its required for the anination application as a prerequisite. What should I do? Should I ask the professor to let me in?", "author": "Turtleisim", "created": 1621961453, "retrieved": 1632949792, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"gzga126": {"link": "/r/CollegeRant/comments/nkuc12/im_stuck_in_a_corner_i_need_help_on_how_to_go/gzga126/", "text": "My experience as a dropout.\n\nBased on my limited experience in life, you have to do everything possible to get what you want because you are the only person in charge of your life. Also what's the worst that can say? They say no? If no, tell them you really need this class and need a spot next time. They will see your dedication and make an exception for you because you spent the extra time and effort to meet/email them online probably.\n\nOr if they don't they either have a capacity limit, staff to student ratio policy, some other policy, or they're heartless. Think about that, how many dedicated students would have to be doing that to make the staff to student ratio such a big problem? I feel like that would be a great problem to have, too many dedicated students like you. \n\n Talk with the department head if there is one for your major or anyone in charge. They oversee everything.\n\nI know being courteous is important but you gotta be assertive to get what you want because inaction leads to nothing is what I found out (wow what a surprise for me). The only person you can rely on is yourself since everyone is doing their own thing.\n\nI like this quote from someone \"You regret the things you didn't do\"", "author": "executordestroyer", "created": 1621985813, "upvotes": 2}}}