{"sid": "oeubbc", "link": "/r/CollegeRant/comments/oeubbc/group_assignment_is_the_worst/", "title:": "Group assignment is the worst", "text": "My first group assignment this semester: 3 person group include me, 2 other person didn't put any heart in their part, simply do all the stuff without a care as long as they \"contributed\". Meeting with our lecturer, their part are all wrong and they said to me \"They dont know how to do anymore\"\n\nSecond group assignment started today, i just meet my group today. 5 person group including me, 4 others stay silence the entire 30minutes zoom meeting while i barely talk because they are not responding me when i ask something. Can you imagine just how AWKWARD IT IS? Cant decide which topic we gonna choose when teacher need it by tomorrow. (If i choose it myself, they will probably just like \"ok you chose it without discussing, do it all yourself\")\n\nSeriously thought, i rather do extra 5x individual assignment or test than do 1 group assignment. Since i can control my time, deadline myself and people dont get credit for my work. It triggers my anxiety and insomnia because i got so much stuff to do, and i barely have any time doing group assignment solo. Now im expecting to lose majority of my group assignment mark.\n\nI hate group assignment SO FUCKING MUCH, it gave me depression and bad thought...\n\nEdit: regarding my second group assignment, the reason 4 of them keep quiet is because they DO NOT HAVE A TEXTBOOK AND THEY UNDERSTAND NOTHING, AND ITS ALREADY ALMOST THE END OF THE SEMESTER. OMG IM GOING CRAZY", "author": "Catanddogg", "created": 1625575962, "retrieved": 1632842015, "over_18": false, "upvotes": 155, "upvote_ratio": 0.99, "comments": {"h48ddq9": {"link": "/r/CollegeRant/comments/oeubbc/group_assignment_is_the_worst/h48ddq9/", "text": "Thank you u/Catanddogg for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1625575962, "upvotes": 1}, "h4ay32h": {"link": "/r/CollegeRant/comments/oeubbc/group_assignment_is_the_worst/h4ay32h/", "text": "Oh god don't get me started... Group assignments are one thing in person, which tbh still sucks, but online that is total shit. Its basically a way for the prof to be lazy and pretend that this builds character or work ethic or teamwork blah blah blah bullshit I have heard all this past fall, spring, and even now during the summer classes its always the same damn speal. I have it happen all the time where nobody does shit, or talks during the supposed \"meeting\" time but yet I literally get alerts that they are posting shit on snap and fb and twitter while in the fucking meeting. Yes FR. \n\nI have thought about just doing it all myself but then they get the marks for doing nothing and I lose my sanity trying to pull a passing grade for 3 other lazy dolts. Flip side is I go to the teacher and then that drama ensues and classmates get mad and I become a snitch and on and on so I don't do that. Its just horrible, profs should just assign the damn work to every damn student and let us do it ourselves on our own damn time. Put a due date and then leave us tf alone. \n\nAll that being said I would try to reach out to somebody, be it an advisor, or maybe even the prof themselves. That way at least they know you are trying and your classmates are not giving a fk. If its online hopefully that will be easier for you to tell someone since you aren't gonna be sitting tomorrow morning next to the guy you reported. Don't lose your sanity and get depressed over a damn group assignment. Worse comes to the worse try to ask them to pitch in over text or something and if no one does crap screenshot it and send it in, same thing with the meetings over zoom. Try to record them and show em to the prof as back up or even if you have to record on your phone. Well maybe don't I'm not sure if you can record others without their permission so it may not. \n\nAll to say yes group projects suck ass but don't destroy your mental health over these bums", "author": "seantaylornation21", "created": 1625620240, "upvotes": 6}, "h49z8oz": {"link": "/r/CollegeRant/comments/oeubbc/group_assignment_is_the_worst/h49z8oz/", "text": "I had a group debate with two others. The previous group project my partner dropped the class. This project one partner was an athlete in Michigan for the week and the other was not on the roster. Shit happens all the time. \n\nTalk to the prof. Talk to your advisor. If you have a mentor on campus talk to them. They may be able to help you.", "author": "Campbellgr3", "created": 1625602971, "upvotes": 3}, "h495p7w": {"link": "/r/CollegeRant/comments/oeubbc/group_assignment_is_the_worst/h495p7w/", "text": "Create a Google doc and add then to it. \nIn the Google doc, add your suggestions, and how the division of with will be. Ask for their input. Develop a timeline for when everyone’s portion should be completed, and dates for rough drafts/outlines. Write all of this down in the Google doc. \n\nNo matter what, continue doing your part and updating the Google doc. \n\nThe Google doc will be your written record of all your contributions, all the times you’ve asked for their input, and their lack of work. \n\nSometimes in school and in life you need to become the project leader. At least when you show this to your professor, you might be able to get full marks even if the rest of the group fails to contribute in any meaningful way.", "author": "tiny_sweaters", "created": 1625589778, "upvotes": 26}, "h48x1b6": {"link": "/r/CollegeRant/comments/oeubbc/group_assignment_is_the_worst/h48x1b6/", "text": "My professor was very clear that if people weren't pitching in or doing their fair share we could talk to her about it. Even if that person didn't do anything for the overall project our own grades would not suffer from it.", "author": "TJkiwi", "created": 1625585912, "upvotes": 10}, "h48okpd": {"link": "/r/CollegeRant/comments/oeubbc/group_assignment_is_the_worst/h48okpd/", "text": "I thought it would all change in college tbh. \nHave you talked to your prof about it? \nIt seems more like individual assignment than a group contribution, thus your group members cant really say \"do it urself\".", "author": "adarkpond", "created": 1625581900, "upvotes": 28}}}