{"sid": "pw4wu5", "link": "/r/CollegeRant/comments/pw4wu5/i_done_fed_up/", "title:": "I done f-ed up", "text": "I’m a graduate student, first year with my plan to get my masters in history. Well, the classes in taking are doubled as undergrad components so I have an extra assignment to do. \n\nThought one of the papers wasn’t due until early November, professor (who is usually on top of due dates) hasn’t breathed a word about it since the first day and I had the wrong syllabus as he accidentally gave me the undergraduate one. Paper is due tomorrow at 2pm. \n\n5-8 pages, comparing two books about WW1 to one another. Easy enough assignment but it’s currently 6:30pm and I am drawing a huge blank in my brain. \n\nPlease send virtual coffee and caffeinated beverages, I’ll be wrapped up in a blanket with music blasting as I write this damned thing.\n\nEdit: I have finished the paper. My colleges library closes early on Sunday’s so I had to get my books from Google scholar… let’s just say I’ve jumped through every browser I could so I could read through what I needed. My brain hurts and I’m now staring at my bed contemplating if I skip dinner so I can go to bed or if I eat dinner in bed. Paper is 8 pages, not my greatest work but it’s done and I’m so glad it’s done.", "author": "Eeeeeeeeeeeeeek12", "created": 1632699019, "retrieved": 1632948395, "over_18": false, "upvotes": 14, "upvote_ratio": 0.95, "comments": {"heffyw7": {"link": "/r/CollegeRant/comments/pw4wu5/i_done_fed_up/heffyw7/", "text": "Oh boy. How's it going?", "author": "cereal_crusader", "created": 1632711307, "upvotes": 1}, "hef1vu8": {"link": "/r/CollegeRant/comments/pw4wu5/i_done_fed_up/hef1vu8/", "text": "I’m an undergrad history major working on a 5 page paper about WWI due this week. You got this!", "author": "Rite1234", "created": 1632704378, "upvotes": 1}, "heex8be": {"link": "/r/CollegeRant/comments/pw4wu5/i_done_fed_up/heex8be/", "text": "Order up ☕️", "author": "Sxlaty", "created": 1632702147, "upvotes": 6}}}