{
  "sid": "p44ve9",
  "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/",
  "title:": "I hate myself for cheating",
  "text": "I cheated on 3 exams last semester. I got caught in one subject and I will receive a failing grade for the class. I am stupid for cheating. Although I posted just to compare my own answers and with no intent of just copying, I still made a huge mistake by posting it. Stupid for using Chegg thinking that its okay because everyone else in the batch seems to post there too. I have no excuse, I am dumb. And its scary to think that if I was not caught, I’d probably think of this lightly and might continue doing this for the next semesters. So I’m glad I got caught but at the same time so afraid of the consequence I might face.\n\nI was academically honest the whole time before that semester.. My friends from high school to college can attest to that. But now, that doesn't matter. I feel like because I cheated that semester, I feel like all my hard work from the previous years and from now onwards is invalid, that no one will ever believe in me, that people would not recognize my efforts for the good grades that I have because I cheated at some point in my life. I am so ashamed and I know this a consequence I must face because I cheated.\n\nI want to hide from embarrassment. I want to transfer school and even want to stop studying for a while to reassess my values in life. Because I don’t think I can continue.. I am so ashamed of myself. I don’t know what to do. I already have grades for the two subjects I wasn't caught, but should I admit to my two professors that I posted in chegg?",
  "author": "Individual-Ad-2274",
  "created": 1628932873,
  "over_18": false,
  "upvotes": 116,
  "upvote_ratio": 0.96,
  "comments": {
    "h8ztz7x": {
      "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8ztz7x/",
      "text": "Look out for yourself. Do what you need to do. Do NOT turn yourself in. See a therapist if you’re harboring that much guilt, and I don’t mean that comment in a snarky way. Just consider not cheating again if you feel guilty. I cheated through a bunch of gen ed classes and I do not feel an ounce of guilt. I enjoyed my semesters while being able to have a ton of free time while getting a 4.0. Again, look out for yourself. No one in this world is going to do that for you.",
      "author": "Dream_is_destiny",
      "created": 1629001580,
      "upvotes": 2,
      "replies": {}
    },
    "h8zsm3e": {
      "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8zsm3e/",
      "text": "I understand how you feel. I used chegg basically for anything during my 1 semester and summer class. Even for labs. I feel guilty each time. I want to change this semester though. I saw people failing but they are trying so hard and studying well. It feels unfair to them. I didn’t even try to understand anything anymore because I knew the internet could help me anyway. Chegg is def helpful when clarifying some stuff but it gets really tempting to just copy. Don’t admit it to your profs but don’t ever use chegg again.",
      "author": "jukiiee",
      "created": 1629000747,
      "upvotes": 1,
      "replies": {}
    },
    "h8zd5du": {
      "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8zd5du/",
      "text": "I used Chegg a few times last semester too. I had a really tough time keeping up with stuff and I absolutely was going to fail Calc if I didn’t. Now I can take Calc II twice if absolutely needed and get study help in person this year, so I somewhat justify it with that. Ultimately, using Chegg hurts you because it’s going to make the next level of the course brutal for you or any time you can’t cheat will be sketchy going from an A to an F on different things that are online and not. I’d just be extra careful and only post certain questions you truly can’t figure out instead of posting the entire assignment. I found it very helpful in actually explaining certain things in Calc and Chem.",
      "author": "XxNHLxX",
      "created": 1628992301,
      "upvotes": 7,
      "replies": {}
    },
    "h8yhtz1": {
      "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8yhtz1/",
      "text": "Take this with a grain of salt of course, but I have some thoughts and zero judgement of your actions. First of all, it's clear you are feeling very guilty and ashamed. You understanding what you did is considered \"wrong\" in the academic community. You're beating yourself up which may be clouding your thoughts and not helping you move forward.\n\nYou cheated. And you claim that fact. I think you're focused so much on the fact you cheated that you're not asking yourself the big question: why did you cheat? The reason why is, imo, a lot more important than the fact you did it. You said you'd always had academic integrity previously. Did you cheat because of parental pressure? Or are school and grades important to you personally? Was it because of mental health and stress around Covid and online learning? What did you fear would happen if you did flunk? Was it financial pressure (are you putting yourself through school and have $X amount to finish) or parental pressure? Is it pressure to be successful by society/classmates/professors or because you love what you're learning and want to succeed for yourself?\n\nTo sum it up: what were you afraid of happening if you failed?\n\nAfter considering the reason behind it, could this have been avoided? By taking less courses? By studying more? Were you struggling because you were overwhelmed with the material and didn't understand it regardless of how much you studied? Or were you struggling because you spent time doing things other than studying, like partying or hanging out with friends, when you should have been studying?\n\nAlso, what was different this year than in previous years? Heavier course load? New romantic partner? A move? Loss of a job, a friend, loss of motivation? Simply just the change to online learning? Lack of a peer support group?\n\nTry not to have too much self-judgement when asking yourself these questions and try to use neutral language.\n\nSecond, why are you feeling shame and embarrassment? Is it external (i.e. my professors will look down on me, my classmates/friends will judge me, I may suffer repercussions) or internal (i.e. I'm smarter than that, I personally value academic integrity because it is important to me, it's important to me to get good grades the honest way).\n\nFinally, are your embarrassment and reasons for cheating similar? For instance, did you feel incapable of learning the material no matter how much you studied, so your confidence in your capabilities dropped, which was a blow to your self confidence because you love what you're studying? Or did you cheat because your parents are putting pressure on you to finish your degree, when you would have preferred to take the year off or study something else entirely, so you spent time with friends and procrastinated on studying? Were you overwhelmed with mental health/exhaustion because of Covid/online learning?\n\nJust my thoughts :)\n\nI think looking at it objectively, instead of punishing and hating yourself, may help you move through it, take steps to prevent it from happening in the future, and move forward. Best of luck! And remember that our mistakes to not automatically define who we are as people.",
      "author": "acrylicvigilante_",
      "created": 1628976733,
      "upvotes": 6,
      "replies": {}
    },
    "h8y0unk": {
      "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8y0unk/",
      "text": "I'm not justifying your cheating, but nearly every college student has done it (or attempted it) during the covid period. Idk your situation, but if it's a curved class, and exams are given online, there's a good chance you're not the only one who did it. It's good that you feel guilty, and don't do it again. \n\nYou've already done what you've done, you can't undo it. Don't turn yourself in unless you think there's over a 75% chance you'll get caught. You'd cause more damage. Your grades for these two classes are already in. Move on.",
      "author": null,
      "created": 1628968979,
      "upvotes": 35,
      "replies": {}
    },
    "h8xq12r": {
      "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8xq12r/",
      "text": "Fuck that, cheat if you wanna cheat. I don’t care if I get downvoted. I graduated with damn near 4.0 and I did it fair and square but I don’t judge anyone who cheats in college. The whole thing is a profit scam, and they have no problem exploiting students for $$. Do what you gotta to survive",
      "author": "Brownie_McBrown_Face",
      "created": 1628964123,
      "upvotes": 56,
      "replies": {
        "h8y2hqu": {
          "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8y2hqu/",
          "text": "Depending on the subject, I more or less feel the same way. If its something like engineering or medicine where people can get hurt from not learning correctly, then I hope people don't cheat, but when it comes to things like business, I feel like universities are so detached from the real world that the only real learning that happens is from actually working.",
          "author": "Eighth_Octavarium",
          "created": 1628969733,
          "upvotes": 24,
          "replies": {
            "h8yjy9q": {
              "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8yjy9q/",
              "text": "especially general education requirements lmao like some people are just not math and science people, why force it",
              "author": "butthatshitsbroken",
              "created": 1628977739,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "h8y0cpx": {
          "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8y0cpx/",
          "text": "I actually agree with that, too.\n\nTo add to that, I have engineering profs with PhDs and many published research papers who will BARELY modify previous year exams and pass them off to the current class, while also expecting no one to cheat...how naïve can they be?\n\nThe school cheats you out of your own education, not you. Do it at your own risk, but don't feel bad about it.",
          "author": "enriqueg9031",
          "created": 1628968748,
          "upvotes": 2,
          "replies": {
            "h8y0qfh": {
              "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8y0qfh/",
              "text": "They’re not naive they just don’t give a shit. A lot of STEM professors took the job to do research and teaching is secondary to that for them. I agree with you, the school will fuck you for every penny in your pocket. I don’t fault anyone for taking shortcuts or cheating, as long as they accept the risks that comes with.",
              "author": "Brownie_McBrown_Face",
              "created": 1628968925,
              "upvotes": 13,
              "replies": {
                "h8yk3wo": {
                  "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8yk3wo/",
                  "text": "saaaaame, my school was a giant research school and some of my large lecture hall classes, the profs wouldn't even show up to teach and would make their TA's do it because it just wasn't their priority.",
                  "author": "butthatshitsbroken",
                  "created": 1628977812,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h8xe5ha": {
      "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8xe5ha/",
      "text": "don’t beat yourself up. school can be excruciating and is built up to be the end all be all to whether or not you’ll have a life ahead of you. with those parameters, of course people cheat. this is not condoning anything - just providing context so that you don’t end up convincing yourself that you’re a horrible person. you’re not. you’re a normal student who made a normal mistake.\n\njust don’t cheat again and try your best. that’s the only thing you should be focused on.",
      "author": "reflexivesound",
      "created": 1628959006,
      "upvotes": 13,
      "replies": {}
    },
    "h8wylum": {
      "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8wylum/",
      "text": "I think it’s probably more plausible that they would know the work or questions where it would make it easy that you cheated. I.e getting a high grade on questions that historically, most students have failed. \n\nBut yeah, cheating in college is one thing. Getting caught is worse. Colleges don’t like those that get caught and you’re lucky you only have to retake a class and not go through an extensive hearing by academic dishonesty. You got off a lot easier than most. \n\nMove on. Don’t make the same mistake twice",
      "author": "majoroofboys",
      "created": 1628952190,
      "upvotes": 21,
      "replies": {}
    },
    "h8wjpx7": {
      "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8wjpx7/",
      "text": "No, don’t do that. That will get you kicked out of college. Just take the guilt and push it into something constructive when retaking the class you failed.",
      "author": "Topazz410",
      "created": 1628944378,
      "upvotes": 112,
      "replies": {
        "h8wkcg1": {
          "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8wkcg1/",
          "text": " they would still track my ip address and know that its me. admitting before being caught,,, isn't it a better choice?",
          "author": "Individual-Ad-2274",
          "created": 1628944754,
          "upvotes": 24,
          "replies": {
            "h8wkttd": {
              "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h8wkttd/",
              "text": "And what if they don’t? It’s not like you comming forward will warrent a lesser responce, they get you to pay them for 2 extra classes or kick you out. It’s better to not risk losing everything. Your only way to not get kicked out is to shut up and let this all pass over. you won’t get in MORE trouble for not confessing, but confesding to a board will GUARENTEE a harsher punishment. This is a not a plea bargain.",
              "author": "Topazz410",
              "created": 1628945027,
              "upvotes": 67,
              "replies": {}
            },
            "h9490ha": {
              "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/h9490ha/",
              "text": "I am a college professor. I am so overworked and underpaid that there is no chance in hell I’m wasting time investigating something from a course that is now over. Spend a few minutes browsing through the professors sub and you’ll see that sentiment is widespread. You’re almost certainly in the clear. Just learn from this and move on. \n\nAlso, as a professor, I know nothing about the academic integrity records of my students. I don’t get a list with my class roster that identifies students with past transgressions. As long as you learn from this and don’t do it again, you are almost certainly ok.",
              "author": "fredprof9999",
              "created": 1629087381,
              "upvotes": 4,
              "replies": {
                "hb9mvgn": {
                  "link": "/r/CollegeRant/comments/p44ve9/i_hate_myself_for_cheating/hb9mvgn/",
                  "text": "This is kind of you. The issue with Chegg is that apparently when profs request the data on any link on the site, they provide viewers of ALL time, not just the current semester. What happens if a question is reused later on? It’s terrifying, even if you genuinely use it for practice problems.",
                  "author": "craig_ferguson_owns",
                  "created": 1630549685,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634062189
}