{"sid": "ptf94g", "link": "/r/CollegeRant/comments/ptf94g/im_so_tired_of_college/", "title:": "im so tired of college", "text": "everything. From academics, to social life, to professors, internships, networking. It's aggrevating. I feel so pressured to get an internship, but it's hard finding one for my respective major/concentration. Then, my school \"changed\" my major so I may not finish my major for another 2 years (2026), when I was intended (AND WILL) graduated in 2024. Social life stinks and everyone is cliquey (high school all over again IMO). I try to make friends, but they never really contact me back, or they ignore me, or they find new people to hang with. (Then again my social skills are trash so I guess i can't completely blame everyone else). On top of that, Im ugly (i know it has nothing to do with college but everyone here looks good and has relationships and these experiences and I'm left behind, but im borderline too mentally ill to even be in a relationship so it's kind of whatever. plus i attract stalkers)\n\n&#x200B;\n\nI cannot stress this next part enough: WHY DO YOU NEED SO MUCH EXPERIENCE FOR EVERYTHING? HOW TF ARE 17/18/19 YEAR OLDS SUPPOSED TO HAVE 1000 HRS OF MEDICAL EXPERIENCE? HOW ARE WE SUPPOSED TO BE EXPERIENCED IN TECHNOLOGY AND SPREADSHEETS TO A PHD LEVEL? I just don't get it. It's so annoying. Honestly, I feel like my parents/school didn't prepare me well enough for this. I had no idea it was gonna be this bad. I repeatedly tell my dad that it's going to be much harder for me find a job and/or internships than he thinks, but he thinks everything will be fine, meanwhile, I'm overhere getting panic attacks, headaches, and stomaches from the thought of wasting my parents money in school for no reason, and being stuck in the deadend retail job I work that makes me want to kms. I'm so TIRED of this BULLSHIT. It's not WORTH IT AT ALL. My parents are literally paying this school to stress me OUT. I won't even be able to go to grad school until I get some experience, which I have no idea how to do. I am going to FAIL. No matter what I do, it won't be enough, i wont get attention, i wont get enough money, etc. If I EVER have kids (which I seriously doubt in this climate), I am going to raise them to absolute perfection because that is what the world asks of them. Internships in middle school, medical experience in middle school, all instruments and sports and extracurriculars they can possibly handle. No excuses. \n\n&#x200B;\n\nI'm seriously considering going off the grid and living with the villages in the amazonian jungles atp.", "author": "MysticalElephant", "created": 1632339526, "retrieved": 1632948428, "over_18": false, "upvotes": 29, "upvote_ratio": 0.94, "comments": {"heivr7p": {"link": "/r/CollegeRant/comments/ptf94g/im_so_tired_of_college/heivr7p/", "text": "I consider going off the grid basically everyday now 🥲 I figure I’d be happier tbh even though it would be a lot of work", "author": "i_do_the_kokomo", "created": 1632781596, "upvotes": 1}, "he0ttj9": {"link": "/r/CollegeRant/comments/ptf94g/im_so_tired_of_college/he0ttj9/", "text": "Yea, honestly I agree 100%, I’m not sure if it gets better given I’m in the same age group, but I hope it does", "author": "asianboyopoyo", "created": 1632437736, "upvotes": 3}}}