{
  "sid": "nb6ifm",
  "link": "/r/CollegeRant/comments/nb6ifm/my_biggest_regret_this_semester_is_not_dropping/",
  "title:": "My biggest regret this semester is not dropping this useless math class",
  "text": "I’m in this math class right now and I don’t even need it anymore bc I changed my major (kinda) but I decided to stick it out and we’ll.... regrets. This is going to sound kind of silly but this is how my mind works since I’m a very anxious person who likes to plan for the worst just so I have a plan in case the worst happens.... I have an 82% right now. I know, not bad. My first midterm I got a 82, which is fine for me since I’ve never been a math person. It was barely proctored so I admit I was able to use notes... second midterm I got a 41...... bc I didn’t understand the material well and was highly proctored. This third midterm is another 15% of my grade and I’m struggling with a big portion of the material. Our final is 20% but he will replace the final grade with the lowest exam grade if we get a better grade on the final. To barely pass the class with a C, I need at least a 20 on this next exam and at least a higher than a 20 on the final so it can replace the grade. Which I know I can do better than a 20 obviously that’s a super low grade but I’m anxious that I will still somehow end up failing. I don’t understand the material very well and it’s making me mad because I don’t need this class and it will likely drop my GPA. And I’m planning on transferring from my CC too next year. I just regret not dropping this class while I was able too.",
  "author": "peepeepoopaccount",
  "created": 1620873664,
  "over_18": false,
  "upvotes": 82,
  "upvote_ratio": 1.0,
  "comments": {
    "gxymf9g": {
      "link": "/r/CollegeRant/comments/nb6ifm/my_biggest_regret_this_semester_is_not_dropping/gxymf9g/",
      "text": "How can you still have a 82 with a 41 and a 15...?",
      "author": "rh3hru12",
      "created": 1620900754,
      "upvotes": 2,
      "replies": {
        "gxymh8a": {
          "link": "/r/CollegeRant/comments/nb6ifm/my_biggest_regret_this_semester_is_not_dropping/gxymh8a/",
          "text": "Nvm misread it",
          "author": "rh3hru12",
          "created": 1620900801,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gxxq4na": {
      "link": "/r/CollegeRant/comments/nb6ifm/my_biggest_regret_this_semester_is_not_dropping/gxxq4na/",
      "text": "What math class is it? When I was having trouble with math this semester I went to office hours as needed and went to our writing/math center for free tutoring. If you have options available like that, use them. Math is something that doesn't always clicks the first time, so a 1-on-1 explanation of what you're having trouble with can certainly help.",
      "author": "drowned_anus",
      "created": 1620875152,
      "upvotes": 9,
      "replies": {
        "gxxyquu": {
          "link": "/r/CollegeRant/comments/nb6ifm/my_biggest_regret_this_semester_is_not_dropping/gxxyquu/",
          "text": "Trigonometry lol. Probably will do some last minute office hours before my exam tommorow but I’m still scared",
          "author": "peepeepoopaccount",
          "created": 1620880369,
          "upvotes": 4,
          "replies": {
            "gy2k27l": {
              "link": "/r/CollegeRant/comments/nb6ifm/my_biggest_regret_this_semester_is_not_dropping/gy2k27l/",
              "text": "Trig is easily a pattern/remember course. Mathway, Desmos, and a Trig Cheat Sheet pdf will help ace the course. \nEdit: aced my trig final with these programs!",
              "author": "LoreBloop",
              "created": 1620972974,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634061875
}