{
  "sid": "pabfbu",
  "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/",
  "title:": "21f just transferred to big university and I realize how much I hate school",
  "text": "I just transferred from a smaller international university in Spain to a really big state school in Texas. It was my first day today and it was packed with people, lines with 50 plus people for food and student ID. I commute and the only parking lot was a 30 min walk from my 1st class and it’s about 95 degrees outside. I could have taken a shuttle but I was already late. I took the shuttle back to my car and took forever. Just the hoards of people, pointless classes I could care less about makes me realize how much I hate college and don’t even want to be here. I regret not doing online, I don’t mind online as much. Now it’s too late and I have to suffer through commuting like this everyday until December. Im just so sad and upset and frustrated and I can’t get over the fact im doing it to myself. My parents would disown me if I didn’t finish school so I really feel like I have no choice. Im just so sad rn. Thanks for listening. \n\nTL;DR\nI transferred from a small private school to a huge state school and I don’t even want to be in college in the 1st place.",
  "author": "sadgirlxxx00",
  "created": 1629761120,
  "over_18": false,
  "upvotes": 95,
  "upvote_ratio": 0.98,
  "comments": {
    "ha88im5": {
      "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha88im5/",
      "text": "My fucking commute is just like that. Makes me want to die",
      "author": "xwintercandyapplex",
      "created": 1629849170,
      "upvotes": 2,
      "replies": {}
    },
    "ha63c3v": {
      "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha63c3v/",
      "text": "I'm sorry you're feeling this way, and it sucks that you don't want to be there. Are you studying something your parents want you to study that you have no interest in? What are your career goals and what other educational or work path could you take to get there?\n\nI went to both A&M and UT and felt so lonely at A&M because it was my first college experience, I lived off campus, and my classes were so huge I didn't get to know anyone. Just the parking situation and 30 minute walks to class was soul sucking, and I can't imagine how I would feel doing it now in the middle of the pandemic. I transferred after a semester to a smaller school, where I lived in the dorms and later within walking distance of campus, and there I found a good solid friend group when I joined an organization and then another friend group because I worked on campus at one of the colleges and met a ton of people that way. I hope the best for you, and you can DM me if you just want to vent.",
      "author": "yayfortacos",
      "created": 1629817326,
      "upvotes": 3,
      "replies": {
        "ha6wgsu": {
          "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha6wgsu/",
          "text": "Yeah I was going to go to A&M but settled for Texas state to be closer to home and my parents. It’s not that I’m studying something my parents want me to, they just want me to get a college degree but I hate school lol. I thought after high school it would be over. And did you transfer to A&M then UT and then to a smaller school? Smaller schools are definitely way better I think. I’m glad you found a solid friend group and a good school! That’s amazing",
          "author": "sadgirlxxx00",
          "created": 1629829119,
          "upvotes": 2,
          "replies": {
            "ha79k3k": {
              "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha79k3k/",
              "text": "I lived in Austin after finishing up at UT and loved visiting the San Marcos/New Braunfels area - wish I could have been on the river tubing today!!! I was a wayward teenager and didn't know what I wanted to do, followed my best friend to A&M and only stayed a semester then transferred to SFA, failed most of my courses that semester, had to take a semester off to figure out what I was going to do with myself then went back and switched majors. UT was grad school but I didn't finish my Master's degree there, but I did finish a program to get my teaching certification.\n\nI've mostly always loved school as a student and teacher, but I can relate to why so many people hate it. Formal education can be boring and tedious, but it can also be exciting and rewarding. I think when you find a class or program, peer group, or organization that really fits you, you could grow to enjoy it. If you loved your studies in Spain, I encourage you to definitely see how much study abroad you can fit into your degree program. Also I wonder how much that change is affecting you - it's really hard to go another country and live/study for a while and then come back home. I did a semester in México and loved it, and when I came back home everything felt so different and weird.",
              "author": "yayfortacos",
              "created": 1629834268,
              "upvotes": 1,
              "replies": {}
            },
            "ha88p20": {
              "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha88p20/",
              "text": "[deleted]",
              "author": null,
              "created": 1629849251,
              "upvotes": 1,
              "replies": {
                "ha8pzbq": {
                  "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha8pzbq/",
                  "text": "Both actually",
                  "author": "sadgirlxxx00",
                  "created": 1629857220,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ha3w3wb": {
      "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha3w3wb/",
      "text": "I don't really have much advice but if it's super sunny try an umbrella/parasol. Keeps people away and keeps the sun off of you ): maybe you could ask about attending a different school? Do some classes here this semester and then next semester you can go somewhere else and transfer the credits?",
      "author": "joyleaf",
      "created": 1629768437,
      "upvotes": 11,
      "replies": {
        "ha5y8h0": {
          "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha5y8h0/",
          "text": "Yeah that would be nice but the problem is I transferred from my smaller school thinking that this one would be better :(",
          "author": "sadgirlxxx00",
          "created": 1629815132,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ha3torj": {
      "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha3torj/",
      "text": "I go to a pretty small school; I could walk from one end to the other in under 15 min. You could always transfer to a smaller school. But you say you dont want to be in college at all... forget about your parents for a sec, whats your plan? You dont have to go to college but you should have some idea of the career path you want to take. Huge colleges arent for everyone and a small school would eliminate all the annoyances you faced today. Would changing your major help?",
      "author": "taybay462",
      "created": 1629767344,
      "upvotes": 28,
      "replies": {
        "ha4315y": {
          "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha4315y/",
          "text": "I got a full tuition scholarship to a private college right by my house. I went to a public university instead. Biggest regret of my life.",
          "author": "TheAmazingDisgrace",
          "created": 1629771594,
          "upvotes": 15,
          "replies": {
            "ha498x0": {
              "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha498x0/",
              "text": "The issue in the post seems to be big school vs small, not public vs private",
              "author": "taybay462",
              "created": 1629774636,
              "upvotes": 6,
              "replies": {
                "ha49tus": {
                  "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha49tus/",
                  "text": "Yes but that's what I'm saying- the private one was small and public is huge",
                  "author": "TheAmazingDisgrace",
                  "created": 1629774935,
                  "upvotes": 5,
                  "replies": {
                    "ha4b7ix": {
                      "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha4b7ix/",
                      "text": "Oh okay that makes sense. My school has about 2000 students, undergrad and grad. Theres like 8 buildings lol. Its cozy i like it",
                      "author": "taybay462",
                      "created": 1629775658,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ha65e9r": {
              "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha65e9r/",
              "text": "Same. Although, it's an hour away. I started the public uni the other day and kinda hate all things.",
              "author": "colostomeat",
              "created": 1629818216,
              "upvotes": 3,
              "replies": {
                "ha6nxj2": {
                  "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha6nxj2/",
                  "text": "I get that. There's less of a sense of a community, and especially under covid restrictions (no activities, limited indoor eating, etc) the campus feels dead and soulless.\n\nPlus, everything is harder to get to and professors are more distant",
                  "author": "TheAmazingDisgrace",
                  "created": 1629825754,
                  "upvotes": 2,
                  "replies": {
                    "ha6orrr": {
                      "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha6orrr/",
                      "text": "I wish that were the case with me. I'm at USC (South Carolina) and there is absolutely no indoor social distancing. I'm trying my best now to get online classes since I'm immunocompromised, but it's not looking great.",
                      "author": "colostomeat",
                      "created": 1629826086,
                      "upvotes": 3,
                      "replies": {
                        "ha6pwi7": {
                          "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha6pwi7/",
                          "text": "I more meant the last two semesters that I live on campus, not right now. I am taking mainly online courses this fall. However, idk about social distancing but apparently my school requires both vaccines and masks now: \n\nhttps://amp.detroitnews.com/amp/8247228002\n\nThis is a surprise to me as I haven't been keeping up with campus communications over the summer haha\n\nOh, and good luck with either the online stuff or staying safe on campus",
                          "author": "TheAmazingDisgrace",
                          "created": 1629826529,
                          "upvotes": 2,
                          "replies": {
                            "ha6qsrx": {
                              "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha6qsrx/",
                              "text": "Thank you and good luck to you!",
                              "author": "colostomeat",
                              "created": 1629826886,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ha5yer8": {
          "link": "/r/CollegeRant/comments/pabfbu/21f_just_transferred_to_big_university_and_i/ha5yer8/",
          "text": "Yes huge schools definitely aren’t for everyone, but I transferred from a smaller school to this one so I have already transferred one I don’t know if I should do it again",
          "author": "sadgirlxxx00",
          "created": 1629815209,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634061564
}