{"sid": "pxnf19", "link": "/r/CollegeRant/comments/pxnf19/the_college_experience_is_pressuring_me/", "title:": "The college experience is pressuring me...", "text": "Before anyone speaks please hear me out...this might be a vent and im sorry for asking the same question over and over. This mindset is destroying my happiness...my creativity is dying and I feel like im losing myself...I used to be excited even with covid cause I felt like I could meet up with friends and laugh...\n\nBut now im starting to hate college and I value education. My family and I weren't able to afford college, simply for the fact that we did have no money and no matter how much I saved. I feel defeated in the most bizarre way possible. I feel like im ready to graduate already. I'm embarrassed about my age when I really shouldn't be. Is there something wrong with me because im not having the fun college experiences everyone having...\n\nI feel like im not living life correctly like im not living my high life. No matter what beautiful things are happening around me (especially moving to another amazing state) I feel bad for going to an online college. I feel I shouldn't be happy cause im not hooking up atm, im not getting drunk, and getting high off the bar. Sometimes I want to forget every responsibility, choice, and consequence...so I can have the experience of its true desperation. This glamorized ideal about college is wrapped around my head and nothing going right. I feel like my 4.0 high school GPA wasn't shit. I hate having to apply to cause everything a hassle now... it has been difficult...is it because covid-19 hitting my life. \n\n\nI vent about these things and it seems like no one understands. Just tells me it gets better and moves on. Maybe there is something wrong with me. I work hard but it feels like wasting my dreams and hobbies on the standards of everyone else. \"The best 4 years of your life.\" It doesn't feel like that...right now it feels like FASFA doesn't give a shit and doesn't understand my need...I still think something is wrong with me...\n\n\nI'm wasting my life even though I have everything around going great so far. Grades, covid, I need to hook up, I need to go to parties so I can just be nostalgic about my 20's and feel like I didn't waste it on everything....sometimes when people say \"im sorry you're going through this experience, college is supposed to be freeing time!\" It doesn't feel like that...it feels like im worthless and im a soulless body....and everyone in my age group is living it up. And im wasting days and time in my life. When things around me are going well...just not traditionally. But I feel like that's wrong and im looked at as weird for doing these things...I don't I wanna continue...the pressures are killing me...I cried many times cause of this...I wanna graduate and get fuck over this college thing...cause all it's making me is depressed and unhappy...I cry every day. I cry at night the most....remembering the laughs and words I was given when I said I was taking a gap year and how no one gonna takes me seriously causes of my status...I don't even know if I wanna keep going...", "author": "luludica_is_ded", "created": 1632888057, "retrieved": 1632948366, "over_18": false, "upvotes": 7, "upvote_ratio": 1.0, "comments": {"heonfhu": {"link": "/r/CollegeRant/comments/pxnf19/the_college_experience_is_pressuring_me/heonfhu/", "text": "I have to be honest with you- getting “fucked up” and sleeping around isn’t all it amounts to. I drink every weekend or so with my roommates and I typically regret it. It kills my mood the entire week and makes it feel like I’m living for the weekend. I absolutely hate that. Plus I don’t want to sleep around. I want a relationship and sometimes I feel like I’m “wasting my opportunities” (I can relate with you there) but I know that’s not the truth.\n\nTrust me- you aren’t missing out on anything. Keep working at your grades and focus on your future. What do you want your future to look like? Sleep well knowing you can achieve the future you want by working hard now. Soon you’ll be able to retire and travel the world if that’s what you want to do. Let THAT motivate you.\n\nI mean sure, drinking and partying can be fun but it gets old FAST. I usually try to go every other week nowadays and I have to actively remind myself to drink less because when I go out everyone is always drinking a shitload. Thankfully I have roommates who aren’t huge drinkers but it’s still tough to not get drawn in.\n\nWorst case I would say go to the bar and see if you enjoy it. If you don’t, don’t worry about it. The “idealized” college life is so toxic in my opinion. Focus on the future and keep working hard. Don’t be afraid to go to the bars or drink with some friends but know that it isn’t what it amounts to.\n\nGood luck and I hope you find the peace you’re looking for. With a 4.0 GPA I’m sure you’ll have a very successful future.\n\nP.S. I took a gap year as well. Don’t worry about it.", "author": "I__like__food__", "created": 1632888728, "upvotes": 5}}}