{"sid": "pi2shx", "link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/", "title:": "I failed my first year and I don’t know what to do now", "text": "So I started college last year and it was all online classes from the start. At first it was fine but then it got so boring. I started accidentally sleeping through some classes and because it was online and I didn’t know anyone I didn’t know who to ask for help and I was also very afraid of speaking to people or presenting and stuff. Anyway I passed only one class the whole year and I just keep telling myself this year will be different and I’ll be able to do it but I don’t know how or what to do and if my parents find out it will be the death of me", "author": "bibitibobitiboup", "created": 1630801073, "retrieved": 1632950913, "over_18": false, "upvotes": 85, "upvote_ratio": 0.97, "comments": {"hbpsu3u": {"link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/hbpsu3u/", "text": "You know you made bad choices but if you focus on being ashamed, it'll be hard to fix it. There's something called the shame-avoidance cycle that is hard to get out of. A person makes a mistake, feels bad, thinks about trying to fix it, but thinking about the mistake makes them feel worse so they try to avoid the whole situation. It's much worse long-term but works in the short term, which is why it's so common. Keep in mind that it's not an excuse, but a lot of people had a similar experience last year. The pandemic is a beast. You know you could have done better, but last year also doesn't make you a terrible person or a failure. \n\nYou can do this! Try to think of this last year as a learning experience. You've learned that online classes aren't a great fit for you and you'll have you work extra hard to stay engaged. As soon as you enroll, set multiple phone alarms for class and try to set up a pleasurable routine. Make coffee or set out a snack for halfway through class if they're online again. If they're in person, try to budget so you can spring for something in the school cafe or shop to give you something to look forward to. You learned from last year that if you start skipping class, you might not recover, so pump your energy and willpower into making yourself go to class every single day. That will probably fix the whole situation tbh.\n\nYou may want to look into executive functioning coaching. There are a ton of free online books and articles about it. Most people's executive functioning isn't great until their mid-20s anyway,  but a lot of people who struggle with online school have executive functioning deficits. That's the brain skill set involved in organization, short and long term planning, prioritization, etc. I have deficits there and had one really awful college semester where it caught up with me and I screwed up bad. But I was able to recover and graduated and now I'm a teacher with a Master's degree. One of the things that helps me is religiously keeping a phone calendar and to-do list. It's a widget on my home screen so I have to see it every time I look at my phone. You might play around with things like Todoist and Anydo and other smart list apps. \n\nGood luck!!", "author": "spallanzanii", "created": 1630867227, "upvotes": 1}, "hbpaygq": {"link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/hbpaygq/", "text": "Get back up and try again. Learn from your mistakes. I have failed a class or 2 and there’s no way I could bring myself to tell my parents. But learn from this and try again. At some point everyone fails. It’s how you act after you fail, whether you quit or try again, that sets you apart from the rest.", "author": "mv159357", "created": 1630859309, "upvotes": 1}, "hbp1pbo": {"link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/hbp1pbo/", "text": "Something to keep in mind is that if you tell your parents what happened they might be open to helping you or give you some advice to do better because an unfortunate reality is that you might have another tough year and that would be a shame if you had to come clean about this year AND last year. Hopefully you knock it out of the park and it was just a bump in the road but you might find it easier to do the climb back to your academic goals  with your folks behind you.", "author": "RemarkableScene", "created": 1630855221, "upvotes": 1}, "hboux9p": {"link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/hboux9p/", "text": "Here are a couple of tips that might help. People can only sit and listen passively for their age in minutes +/-2 minutes. If you’re 18, that means it’s harder for you to focus after 16-20 minutes. Every 16-20 minutes, try to get up and get a drink or step outside or stand up and stretch. If you’re in a long lecture and can’t just leave, pause to tighten and loosen your muscles or mentally check out for a sec to circle one important thing in your notes before mentally tuning back in. This all applies to lectures and to sitting still and working. Don’t use your tiny breaks to check your phone or to watch TV!! It will totally derail you. \n\nWhen you’re faced with things you don’t want to do, break them into smaller bits, and give yourself a timed break every time you get 3-5 done. For example: I have to write this 1000 word essay. Okay. I need to choose a topic, find 3 related peer-reviewed studies, read through each study, pick a few key ideas for each study, map out my paper… (etc.). Right now, I will choose a topic and find 2 related studies, then I get a 15 minute break to take a walk. Then I’ll find the last study I need and read through it while jotting down key ideas from it. After that, I get 45 minutes to make and eat dinner while I chill out. This part is key: **write down each item on your list and check each one off as you finish it!!!!!!** Making a list and checking off items is proven to make you feel good. It’s also a visual reminder of how far you’ve come and how much you have left to do. \n\nAnother thing that might help is making or printing a large calendar for the next 2-3 weeks (I use Word and create a table).  Break down what you need to do for all of your classes into realistic daily goals, making sure that you aim to finish each large assignment a day or two early (because… life).\n\nI hope this helps!!! You CAN do this, and your college probably has a lot of resources to help. You should have some kind of advisor, and he/she should be able to tell you some resources to get started. You probably didn’t fail because you’re lazy, unmotivated, or unintelligent. My guess is that you lack knowledge of some strategies you need to be successful. Don’t be ashamed of that. College is for learning, right? So learn what you can do to do better, then do it. You’ve got this.", "author": "JA_08", "created": 1630852189, "upvotes": 5}, "hbotv55": {"link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/hbotv55/", "text": "I am going to preface this by saying that I made some of the same poor decisions when I was a freshman.\n  \nThis is 100% a consequence of your actions. Yours alone. You don't just \"accidentally\" sleep through your entire first year. You chose to sleep. You knew exactly who to ask for help... Your professor.\n  \nSounds to me that you just weren't mature enough for college this go-around. You can always try again in the future... Just don't waste your parents money on your bad decisions.", "author": "genghisKHANNNNN", "created": 1630851691, "upvotes": 2}, "hbolc3z": {"link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/hbolc3z/", "text": "I totally get being scared of your parents. As long as this doesn’t have an impact on scholarships or anything like that I would inspect element the grade page. You can change the letter grades and numerical values on the website", "author": "RillaBam", "created": 1630847322, "upvotes": -1}, "hbogl91": {"link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/hbogl91/", "text": "You made bad choices. You don’t accidentally sleep through a school year. You didn’t self advocate or ask for help. Time to grow up.", "author": "PenGroundbreaking419", "created": 1630844392, "upvotes": -1}, "hbnnqg9": {"link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/hbnnqg9/", "text": "I think you really should tell your parents about this. College is pretty serious especially FAILING your entire first year. Your university could even not let you back because of failing classes and not getting enough credits. This is pretty serious.\n\nAlso, did you not message or get help from professors? If you go back to college, message your professors and do not be afraid to get help or tutoring to help you pass classes. Professors will respect you and treat you better in class if you show interest and ask any doubt, you do not have to worry about being afraid or shy about it. \n\nPlease let your uni and parents know that u need help in classes. If not, you can always take a gap year and go back when u feel more prepared", "author": "Oro-Lavanda", "created": 1630820493, "upvotes": 32}, "hbndb63": {"link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/hbndb63/", "text": "I think you should have a sit down and talk to your parents. This isnt something that you can hide", "author": "GoldRequest", "created": 1630813587, "upvotes": 62}, "hbmtgqd": {"link": "/r/CollegeRant/comments/pi2shx/i_failed_my_first_year_and_i_dont_know_what_to_do/hbmtgqd/", "text": "Your parents don’t know about you failing?", "author": "beywill19", "created": 1630802902, "upvotes": 9}}}