{
  "sid": "qzdp7u",
  "link": "/r/CollegeRant/comments/qzdp7u/am_i_rightfully_angry/",
  "title:": "Am I rightfully angry?",
  "text": "I woke up on Saturday morning to giggles and shifting—and that’s when I realized my roommate (we are both freshman in a college dorm—its just two beds in a small square room 8 feet apart) has his girlfriend over and that she had spent the night. I had fallen asleep at around 11 that night and woke up to a third person sleeping in our dorm without being asked. I move on, go to work and slowly start to forget about it. Then, that same day, he texts me asking if she can sleep over—I make it clear that she already slept here last night but I don’t like confrontation so I said fine. They spent the entire day in the dorm—I went to work a 6am and didn’t get home until 7. I am not mad that he didn’t leave the room at all (he pays for housing same as me), I more so am referring to them both having been there all day. They have been snuggling on my futon and in their bed, and are now in bed together—which I suppose means she plans on spending the night again (I was never asked). They have a pizza box under the futon, her bags on the floor, our futon pillow on the carpet—idk. Should I say something? Do I let him “get it” and keep my mouth closed because of some “bro code”? Just need some advice ig..\n\nTL;DR : My roommate has let his girlfriend sleep over three nights in a row now without really asking me if I was okay with it—should I be mad? Should I respect the “bro code”?",
  "author": "Divinebookersreader",
  "created": 1637557809,
  "updated": 1637689664,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hllzb1a": {
      "link": "/r/CollegeRant/comments/qzdp7u/am_i_rightfully_angry/hllzb1a/",
      "text": "I mean, the first night was not cool as he never asked you, but you did consent afterwards when he asked. But remember, consent can be withdrawn and if you feel that she's overstepping the lines, it is within your right to do that. \n\nIt is partly your dorm room too. But yea, just bring it up and talk to your roommate about it and try to set some boundaries or lay down some ground rules. \n\nAlso, it's good that you are being a good and considerate roommate, and being supportive of him \"getting it\".",
      "author": "ENDofZERO",
      "created": 1637562103,
      "upvotes": 2,
      "replies": {}
    },
    "hlm8y3w": {
      "link": "/r/CollegeRant/comments/qzdp7u/am_i_rightfully_angry/hlm8y3w/",
      "text": "Surely this situation will anger a lot of people. I think you should just talk to your roommate",
      "author": "gaunter04",
      "created": 1637569430,
      "upvotes": 1,
      "replies": {}
    },
    "hlmozhg": {
      "link": "/r/CollegeRant/comments/qzdp7u/am_i_rightfully_angry/hlmozhg/",
      "text": "3 nights in a row is a no go. set him straight.",
      "author": "cbdinfusedcocaine",
      "created": 1637582973,
      "upvotes": 1,
      "replies": {}
    }
  }
}