{"sid": "nv0iwb", "link": "/r/CollegeRant/comments/nv0iwb/wish_me_luck_just_posted_this_in_the_get_to_know/", "title:": "WISH ME LUCK - Just posted this in the \"get to know each other\" discussion board assignment area of each of my 4 summer classes that began today.", "text": "Hello classmates! My name is *~~censored~~*. And there is only one thing you need to know about me: **I am a man with a question!**\n\nI'd like to present the \"Dunbar's Number\" theory which is a well accepted theory in psychology. It states that the average human throughout all of human history, including modern times in California, will befriend about 150 people throughout their entire life. Obviously some will know more, and some less. However, generally most people will make about that many friends in their lifetime.\n\nNow let's put that into perspective: I'm taking 4 classes this summer, and just finished 5 others 2 weeks ago. I work part time, meet new people almost every day, if only briefly at times, and have a family and friends of my own. I also have hobbies and maintain social connections in those circles. Oh, and roommates, whose families and partners I see often.\n\nMy 4 courses I'm taking this summer are all over-booked, thanks to the clinical efficiency of online learning, which I do appreciate *(it hopefully allows me to finish my degree on time and go from a broke college student living in a rented basement with no windows to affording a room that has a view one day).* Regardless, the overbooking of my courses means I'll be sharing my 4 instructors with around **200** fellow students.\n\nRemember Dunbar's Number? I just talked about it. If you already forgot, it's okay! (We'll talk about cognitive fatigue in a bit.) I'll remind you: the average human makes around 150 friends in a lifetime. I'm taking classes this summer with **more humans** than I'll probably ever befriend **in my entire life**, and I plan to do this 4 more times in 4 more semesters before graduating with my bachelor's degree.\n\nObviously it'd be absurd for me to \"get to know\" all my classmates this semester, or even unlikely 2 in each of my 4 courses (5.3% of my lifetime friends right there) and so the pinnacle of these discussion boards for me and virtually all other students is the same. We simply race to create a post with generic information about ourselves, then spew up some brain-dead response to our classmates whose profile pictures are the size of our thumbnails, and whose names we'll remember for less time than it takes us to move on to the next student, then we post a second reply, and then we go back to watching TikTok videos, seeing new people, and forgetting them seconds later too...\n\nAnd really, why should we remember the thumbnail named John Doe who likes hiking and is getting his AA in business? After all, if 150 friends will result in me finding happiness and success in life, why should I waste time in a busy semester \"getting to know\" my fellow **thumbnails** on a laptop screen? I feel perfectly on track to make 150 friends in real life, and don't need this discussion board to get there.\n\nSo what void is it intended to fill, that is missing in our lives? YouTube and television ensure I'll be exposed to other faces and cultures. The grocery store forces me to interact with other humans I've never met. My work allows me to get to know all sorts of people from diverse backgrounds. I mean, who here has ever felt that reading poorly written, single paragraph bios on a school discussion board's \"get to know each other\" topic has ever made them a more understanding, intelligent, lively person? I'd argue no one, but am open to debate.\n\nAnd in the college world, we need to realize that in-person classes and online classes are just plain and simply different. In-person classes have introductions that help us find like minded people to sit next to and talk with during our break. I should add however, that in-person classes **that don't have** introductions on day one seem to yield friendships just as readily! Humans can apparently initiate interaction and make friends in college **without** a round-the-classroom introduction consisting of your name, major, and favorite dessert food. So if the \"introductions\" trope is barely productive in an in-person course, and useless online, why do we need to utilize it in the online environment at all?\n\nIt should be said that this useless act should not be confused with being a harmless act. Cognitive output is a finite resource. I'd like anyone interested in what I've had to say so far read this study:[ https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3113724/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3113724/)\n\nI'll summarize. A study was conducted to see if people who were given easy mental tasks to do for 8 straight hours experienced cognitive fatigue afterwards. Conclusion: They got cognitive fatigue. Are you surprised? Probably not. People's brains can only process so many trivial tasks a day, before fatigue sets in and they become worse at said tasks, or unable to do them entirely and need sleep. Even if these mental tasks are painfully easy. I can provide many more studies if you're interested in discussing it further. But this is common knowledge to most people, as we've all experienced it firsthand.\n\nSo why then, in our online, college level courses that we spend our hard earned cash on, are we tasked with completing trivial tasks that tire our brains out while accomplishing nothing productive for anyone? We have to write about ourselves, who we already know about, read about and respond to our forgettable thumbnail-sized classmates with statements we'll forget, and then our overburdened teachers have to carefully grade every single one of the posts that ironically gained us nothing.\n\n**So my fellow thumbnails, this is my question:**\n\nWhy do all four of my online classes this semester have a \"get to know each other\" discussion board in them?\n\n...ironically if you read that entire post, you probably have \"gotten to know me\" better than anyone else on this discussion board.", "author": "Interesting_Tune3403", "created": 1623143417, "retrieved": 1632949738, "over_18": false, "upvotes": 0, "upvote_ratio": 0.31, "comments": {"h1ao472": {"link": "/r/CollegeRant/comments/nv0iwb/wish_me_luck_just_posted_this_in_the_get_to_know/h1ao472/", "text": "it is an attempt to \"build community\" in an online environment. If class met in person, you would do a \"get to know me\" icebreaker activity. \n\nOnline \"learning\" is lame.", "author": "ObjectiveAnalysis643", "created": 1623342041, "upvotes": 2}}}