{
  "sid": "k0tset",
  "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/",
  "title:": "You know what really sucks about remote learning? No Free Food :(",
  "text": "I keep thinking about how we're missing out on so much free food at campus events and such.\n\nEspecially during the holidays, according to upperclassmen and professors there's usually a lot of free food on campus, especially pastries. My student mentor for Math says that she usually brings in donuts in for morning study sessions, and they'll be special decorated ones when it's near holidays  \n\nAnd during Halloween, people just like giving away candy for no reason.\n\nAlso pizza, apparently there are usually lots of events where they have pizza\n\nAnyway, that's just reason #5731589932 on why remote learning sucks (it's necessary of course, but still shitty!) \n\nThanks for coming to my TedTalk :D",
  "author": "sunnirays",
  "created": 1606316841,
  "over_18": false,
  "upvotes": 277,
  "upvote_ratio": 0.99,
  "comments": {
    "gdmm2ya": {
      "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdmm2ya/",
      "text": "Now this is a rant I can get behind. Library lectures don't have the same pull as they did when I could go back for kebabs and mini cheesecakes six times during the pre-keynote",
      "author": "biggestbaddestnerd",
      "created": 1606365420,
      "upvotes": 1,
      "replies": {}
    },
    "gdlyuau": {
      "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdlyuau/",
      "text": "i remember my first year of college, I practically lived off the free food from student gatherings. I joined Catholic student union because they had free pizza and I didn’t have breakfast or dinner that day.\n\nA zoom meeting for a student org I actually have semi regular attendance in had a “coffee and donuts” day over zoom where you provided your own snacks lol.",
      "author": "sans_serif_size12",
      "created": 1606350885,
      "upvotes": 2,
      "replies": {}
    },
    "gdlrqu7": {
      "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdlrqu7/",
      "text": "My college would do a welcome week every year with free food and snacks and merch and it would always be so fun, pre-pandemic of course! It feels completely out of place to be taking finals this semester online instead and not have therapy dogs available (we usually have a finals week where we have access to a room full of puppies to play with). All these campus events really added to the element of self care and just genuinely enjoying the college experience instead of just working to get the next assignment turned in online.",
      "author": "vnutbutter",
      "created": 1606346780,
      "upvotes": 3,
      "replies": {}
    },
    "gdlhr39": {
      "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdlhr39/",
      "text": "your college sounds cool",
      "author": "qxxii",
      "created": 1606341353,
      "upvotes": 1,
      "replies": {}
    },
    "gdl9ntn": {
      "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdl9ntn/",
      "text": "I actually have food I would love to give away, but there aren't any events happening to donate to. I tried finding a donation box in Fairhaven commons and there wasn't one there. Perishables like spaghetti.",
      "author": "molly_yyy",
      "created": 1606337201,
      "upvotes": 1,
      "replies": {}
    },
    "gdl5qgz": {
      "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdl5qgz/",
      "text": "Very true.  Am broke ass grad student, have been hearing stories from the more senior grad students about all of the opportunities there normally were to grab free food.   The smart ones were carrying storage containers in their backpacks because sometimes they'd have so much food at these events that they let the grad students take some home with them.\n\nIt also makes me sad because I really enjoy baking for people (I tend to stress bake) and I would have loved to be able to bring my teaching team and my lab fresh-baked goodies to our meetings.  (Especially since my teaching team has been wonderful while I had a family loss earlier this month, telling them that they have an IOU for their favorite cookies isn't quite the \"thank you\" that they deserve).  I'd also be the one keeping a bag of candy in my backpack for my students who didn't dip out of lab before we were actually done for the day.\n\nDefinitely another one on the mountain of reasons remote learning sucks horribly.",
      "author": "LadyWolfshadow",
      "created": 1606335176,
      "upvotes": 5,
      "replies": {}
    },
    "gdkuj86": {
      "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdkuj86/",
      "text": "Aw don't remind me :(",
      "author": "zarnonymous",
      "created": 1606329580,
      "upvotes": 2,
      "replies": {}
    },
    "gdkmgw1": {
      "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdkmgw1/",
      "text": "Wait, *you guys are getting free food?*",
      "author": "vness1213",
      "created": 1606325686,
      "upvotes": 15,
      "replies": {}
    },
    "gdkl7ow": {
      "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdkl7ow/",
      "text": "I agree. I miss the thanksgiving meal my college used to have for us on the Tuesday before thanksgiving and the free burgers during the first week of school. And the Saturday workshops I used to attend had free breakfast and lunch.",
      "author": "dogandcats424242",
      "created": 1606325085,
      "upvotes": 9,
      "replies": {}
    },
    "gdkfux7": {
      "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdkfux7/",
      "text": "True. I think it’s worse for students still in public school. For most kids that’s where they get their daily meal and daily intake of fruits and veggies. Then go home to a house where they live with either a single parent or blue collar income. There are families can’t afford to drop 30 plus dollars a month on JUST healthy groceries when there’s a mortgage to pay, gas, taxes, bills etc. that’s why most poorer families can be found eating fact food or the bulky frozen food they can just dump in the oven. Forget trying to eat healthy if you can barely afford to eat at all",
      "author": "You_Artistic",
      "created": 1606322496,
      "upvotes": 72,
      "replies": {
        "gdkor0b": {
          "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdkor0b/",
          "text": "Agreed. There are so many kids in public schools who rely on free and reduced lunches and now with online learning, I just can’t imagine. I feel like something should be done about this, some of these kids wake up hungry and they can’t focus on classes.",
          "author": "DumbHuman53",
          "created": 1606326766,
          "upvotes": 26,
          "replies": {
            "gdkozmg": {
              "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdkozmg/",
              "text": "My biggest fear from back in March when lockdown first happened was how are the kids who are in abusive  home and crappy situations going to make it",
              "author": "You_Artistic",
              "created": 1606326880,
              "upvotes": 16,
              "replies": {
                "gdkqvyk": {
                  "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdkqvyk/",
                  "text": "Yes! We were talking about this in my child maltreatment class. Kids in abusive situations, it’s hard to see what’s going on. Teachers do try there best in these situations like asking them to keep their camera on, asking them about their day. I’ve read that some students don’t want their camera on because they don’t want people seeing their homes and the people there.  \n\n\nI can’t imagine what these poor babies are going though.",
                  "author": "DumbHuman53",
                  "created": 1606327797,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        },
        "gdku3ij": {
          "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdku3ij/",
          "text": "All of the school districts where I live are remote but they're at least trying to help the food insecurity situation by giving away the food they aren't serving for school lunches.\n\nAnd the public libraries also have events where they just give away boxed lunches to anyone who asks for them. \n\nBut that's another thing that really sucks about this whole thing. Everyone is struggling but everyone was already struggling before is just barely hanging on, if that.\n\nYou have so many kids who are hungry and abused and failing classes because of their crappy WiFi at home and their crazy parents. This whole thing is just super *super* shitty",
          "author": "sunnirays",
          "created": 1606329368,
          "upvotes": 10,
          "replies": {}
        },
        "gdl9uqr": {
          "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdl9uqr/",
          "text": "Yeah for real. Better to eat unhealthy than to starve. If a family or individual's only choice is fast food, then it should be fast food. Better than starving.",
          "author": "molly_yyy",
          "created": 1606337299,
          "upvotes": 2,
          "replies": {
            "gdlaabx": {
              "link": "/r/CollegeRant/comments/k0tset/you_know_what_really_sucks_about_remote_learning/gdlaabx/",
              "text": "True. A lot of people don’t realize that",
              "author": "You_Artistic",
              "created": 1606337519,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634063202
}