{"sid": "keix0m", "link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/", "title:": "Got a D and mostly C's in my first semester. How screwed am I and can I fix this?", "text": "Title says it all. Im just disappointed in myself but if i improve next semester can I fix this? Is this gonna hurt my future employment after graduation? thanks", "author": "SrumsAsloth", "created": 1608155614, "retrieved": 1632951742, "over_18": false, "upvotes": 29, "upvote_ratio": 0.98, "comments": {"ggo5pyo": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/ggo5pyo/", "text": "You are in a great spot. I'm serious. Many students pass with lower grades. Begin again next semester", "author": "hasrocks1", "created": 1608620143, "upvotes": 1}, "gg5mfj4": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg5mfj4/", "text": "I had a full ride, lost it bc my first semester i got a 1.8 GPA, took me two years but now I’m back at a 3.5 and graduating with honors. Keep your head up. You can retake courses if you really want to, but one rough semester will NOT ruin your GPA as long as you improve abit throughout the rest of your college career", "author": "A_Stoned_Wall", "created": 1608223689, "upvotes": 1}, "gg5aai0": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg5aai0/", "text": "Its ALL about time management, look at your assignments and split them up as needed to complete them on schedule. Learn from failures but also engage your class and teacher, it never hurts to be proactive because YOU are paying for it. Think of it like school is a product that you really wanted and you paid for, if that doesn't spark a want to do your courses then switch your major to something that interests you. Also another huge piece of advice, get past your first two years and it gets waaaaay better. These are the years that are known as proving grounds to get to the juicy stuff and weed out knuckledraggers. \n\nSome people are just more technical minded and need to build on that first in their life, so if this is you don't sweat it. You actually have a good chance to make more money early in life than a college grad likely will in their first 5 years out of college. Get a good job that maybe pays for education and you will be in the juxtaposition to come out on top. Don't give up!!!", "author": "Chevidz", "created": 1608217588, "upvotes": 2}, "gg4w9gm": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg4w9gm/", "text": "You’re not screwed you can fix this. My second semester sophomore I got Cd and Ds the entire semester. I realized this couldn’t happen again, now I’m all good grades and employed. (I got employed before the good grades) just work on it ASAP, it’s hard to fix the further up you go", "author": "whynottellmemore", "created": 1608208411, "upvotes": 1}, "gg4otfc": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg4otfc/", "text": "Just make sure you get internships and you’ll be fine.", "author": "FoxWyrd", "created": 1608201313, "upvotes": 1}, "gg4an20": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg4an20/", "text": "You can definitely! Just figure out what went wrong and get help if needed.\n\nI ended my freshman year with a 2.43 GPA: D+, A, C, Y (incomplete). \n\nI'm now a senior, won multiple scholarships, did 2 rounds of completely funded research, got into a selective fellowship, and I'm applying to grad school. Have a 3.54 GPA now (and bout to get another boost this semester)\n\nYou got this!!! Just don't get defeated, make sure to take time off, talk with professors, and get help!!!\n\nEdit: Also, consider switching majors or reduced course loads.", "author": "NarrativeCurious", "created": 1608187833, "upvotes": 6}, "gg3pyh5": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg3pyh5/", "text": "You aren't screwed. Learn from your mistakes this semester and work to not make the same ones next semester.", "author": "Cjb3z4", "created": 1608174426, "upvotes": 1}, "gg3d0qx": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg3d0qx/", "text": "don’t stress about it at all!!! i had 2 real shit semesters my freshman and sophomore years but i’m about to graduate with a 3.2, you definitely have time to fix it! and i totally get feeling disappointed in yourself, i know i did, but don’t be so hard on yourself <3 after all, it shows amazing resilience and dedication that you are concerned with getting your grades back up! just take it one semester at a time, and don’t forget you’re worth so much more than your college grades :)", "author": "lexi_lynn_715", "created": 1608167638, "upvotes": 5}, "gg38pth": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg38pth/", "text": "It’ll be ok. I’m sure if you do good next semester you’ll be able to turn it around. This was a terrible semester so  you shouldn’t  feel bad that the semester didn’t go so well. Retake the classes that you failed because you already know the material for them. Good luck in the future.", "author": "Cmtr2113", "created": 1608165277, "upvotes": 2}, "gg3640x": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg3640x/", "text": "I failed an entire semester. I struggled to balance my education with a new part time job and my social life. In the moment, I felt disappointed in myself and really didn’t know how and if I could recover. I re-evaluated my priorities, retook all of those classes over the summer, and passed them. That was 2 years ago, and here I am now graduating with a 3.0. You’re not a failure, and making mistakes is apart of human nature. In addition, many if not a majority employers will not be looking at your GPA, they are looking for a degree and relevant skills/experience.", "author": "sassyashle__", "created": 1608163836, "upvotes": 21}, "gg2y94u": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg2y94u/", "text": "It’s just your first semester. Hurts now but you’ll be okay. Definitely won’t hurt your future employment as you have 3.5 more years until you get a job\n\nJust think if you get all B’s for the next two semesters you’ll have around a 3.0 so try to think long term", "author": "OBPoverAVG", "created": 1608159618, "upvotes": 7}, "gg2swme": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg2swme/", "text": "Don’t sweat it too hard, this has been a horrendous semester for most people. You can retake classes if you feel badly about them, but you can save your gpa by being vigilant in the future. Don’t worry too much, it’s all gonna be okay.", "author": "bluesflew", "created": 1608156903, "upvotes": 27}, "gg2scht": {"link": "/r/CollegeRant/comments/keix0m/got_a_d_and_mostly_cs_in_my_first_semester_how/gg2scht/", "text": "It’s been a real tough year, you’re not alone. Can this term hurt you? That really depends on your overall GPA and if these courses are instrumental in your career choice. You should consider retaking the D courses for a better grade if this is the case.", "author": "Italo_Disco_", "created": 1608156622, "upvotes": 8}}}