{"sid": "jmx4fh", "link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/", "title:": "What the he** even is Zoom College. I hate it here. I’m way too stressed. And I could use some encouragement.", "text": "It’s my fourth year, and I’m one semester away from a degree. If I wasn’t so close I’d drop out.  \n\nI just can’t pay attention on zoom. It feels like I’ve learned nothing this semester. I’ve tried everything. Snacks, water, keeping my phone under my bed. I even locked myself in my closet for one class so I wouldn’t have any distractions. And I just watched the shirts on the hangers. I couldn’t do it. \n\nMy school has no universal online school work policy (I don’t know if other schools have guidelines, but our professors are left to their own devices). And many professors have been making supplementary assignments to make up for classes not being in person. \n\nI’ve been missing assignments because we have many supplementary online assignments. Discussion boards, voice recordings, peer reviews, and things we normally wouldn’t be doing during the semester on top of what we would normally be doing in a semester. I’ve got Bs and Cs but that’s not enough to keep my scholarship. \n\nWe have had no set midterm week. So I have been doing midterms, supplementary midterm assignments, and draft assignments since September. Now we’ve moved into finals. I’m screaming. I’ve gotten no breaks. I had 4 mid to large scale assignments due on Halloween. \n\n\nI’m so burnt out. I’m struggling to keep up. On top of this I have a puppy, part time work, and an internship. I cry literally every night. I feel as if my time is not my own. My hair is falling out. It feels like everyone else gets this online school more than me and I hate feeling this way. I’m so so far behind. \n\nSo please. I could use some encouragement. Some de-stressing tips. Some empathy. Anything. My support systems have been mostly unhelpful. Mainly giving me the advice “just do your work” but the anxiety and stress is usually too overwhelming to even start. And I’m super afraid my professors won’t be sympathetic. Thank you in advance. Sorry for the rant.", "author": "LittleCrochetedBee", "created": 1604353944, "retrieved": 1632842786, "over_18": false, "upvotes": 264, "upvote_ratio": 1.0, "comments": {"gbpgqdw": {"link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/gbpgqdw/", "text": "Don’t apologize for ranting :) i’m also burnt out and i completely understand where you’re coming from. You are trying so hard to pass thru this and i congratulate u for trying ur best. Not everyone does that", "author": "lorencali", "created": 1604917644, "upvotes": 1}, "gb4silu": {"link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/gb4silu/", "text": "[removed]", "author": null, "created": 1604509228, "upvotes": 1}, "gb0n7tl": {"link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/gb0n7tl/", "text": "I'm terms of focusing, I don't do well when things are silent ( silence gives me anxiety for some reason. I start hearing my own heart beat and freaking out). I usually just put on low-fi music on youtube. It's a continuous string of really chill music. Helps you focus in since the music isn't super busy. Kinda like white noise. I set it to be just under the audio of zoom. It's called \"chill beats to study to\", many of them will show up and it's always live.\n\nIn terms of not having time, I'm really sorry that you've been under so much stress. Although it's counter intuitive, it could be helpful to take little breaks in between long amounts of work (10min break every hour or something). As long as you commit (and it sounds like you're super committed to trying to make things work) it can help. I procrastinate when I feel overwhelmed so the breaks help me gather my thoughts of what I'm gonna do when my break is over into smaller increments. instead of just \"I have to write this essay NOW\" it becomes \"after this break I'm gonna do a paragraph. Then kinda do whatever while passively brain storming and walking around or getting a snack.\n\nI've DEFINITELY been frustrated about the work load. You're absolutely right. There's so much supplementary work just to fill in the time slot. Just because an assignment SHOULD take up a missed hour of class doesn't mean every student CAN finish it in that time. Especially if instructions are unclear or students have other shit and it's hard to keep track. I rarely had to interact with students the entirety of my college career, but now for one course we get put into different groups every week so we constantly have to reintroduce ourselves and it's part of our grade. Why not just keep us in the groups we were put in? The excuse of using discussion boards to help interact with other students the way you would in a class setting is total BS. unless there's some pre-planned group assignment you never were going to have to even talk to your classmates lol \n\nIt's pissing me off how much they're trying to justify bitch work. Give me ONE assignment that takes enough research/critical thinking to take up class time for the week and then a normal Assignment and call it a day. And it'd also be nice if schedules and dates weren't fucked too. I have one class that says I'm on break this week? When none of my other classes are. So during Thanksgiving I'm gonna have a shit ton of work for that class while I already have to do a bunch of work for the other classes that you normally get right before break\n\nSorry this is so long, guess I needed to vent more than I thought lol\n\nTL:DR play \"chill beats to study to\" music on YouTube to help focus. Take incremental breaks when doing longer assignments. School sucks ass and I'm tired of all the bitch work", "author": "vness1213", "created": 1604420813, "upvotes": 1}, "gb020hj": {"link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/gb020hj/", "text": "So I have ADHD which means I also find it terribly impossible to focus on class. However, I have found a loop hole. If I color while listening to class, I retain the information. I actually pay attention. \n\nI use a color by number app on my phone, but you could use literally anything. Keeping hands busy in this way is really helpful.", "author": "TrueRusher", "created": 1604409399, "upvotes": 3}, "gazpaxk": {"link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/gazpaxk/", "text": "It’s 2am where I’m at right now, and I feel you. I wish I had something better to say. But just know there’s a stranger in California, scrolling through reddit at 2am that understands.", "author": "sans_serif_size12", "created": 1604397939, "upvotes": 3}, "gazlzqn": {"link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/gazlzqn/", "text": "Right now im just dropping my second major and graduating with just the one that is easier for me.\nHonestly l suggest a psychiatrist if thats something you'd be comfortable with. Ive found pharmaceutical intervention to be very helpful", "author": "spaztasticnerd", "created": 1604394216, "upvotes": 3}, "gazjki9": {"link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/gazjki9/", "text": "lol check out [dropinbot.com](https://dropinbot.com) my man", "author": "hungn100", "created": 1604391640, "upvotes": 1}, "gaysfb2": {"link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/gaysfb2/", "text": "Dude im doing a gap YEAR and I DONT KNOW WHAT IM DOING WITH MY LIFE IM 18 YEARS OLD LIFE was supposed to be EASY FOR NOW MY GOD IM ALREADY AN ADULT AND I HAVE NO FUCKING EDUCATION AHHHHAHAHAHA", "author": "szechuantrex21", "created": 1604371603, "upvotes": 15}, "gayoyz9": {"link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/gayoyz9/", "text": "the other commenters have given some great advice in terms of planning to get work done! breaks have helped me a lot, but it’s also really hard to stick to a schedule sometimes, especially on bad days. it’s important to cut yourself slack where you can, and if you’re having a bad day it’s okay to do less work if you can afford to. another thing that helps me is having a snack like m&ms or cheez its, and after i get a certain thing done i’ll have one m&m or a couple cheez its. you can do this with any snack that’s in pieces! :)\n\ni used to be absolutely terrified of reaching out to my professors for help, and still am sometimes. in reality, most of them are really there to help you succeed and are willing to pull some strings to help you do that. something that has really helped me feel more confident in reaching out is remembering that especially because classes are online, the fact that you took the initiative to contact them will make an impact, even if they end up saying no. it never hurts to ask! their perception of you won’t turn sour, and you’re not a bad student for asking. you’re doing your best to take care of yourself and help yourself succeed, and that is the mark of a good student.\n\nhope i could help, and good luck! my inbox is open if you need anything!", "author": "kurochaa", "created": 1604369704, "upvotes": 6}, "gay8hyf": {"link": "/r/CollegeRant/comments/jmx4fh/what_the_he_even_is_zoom_college_i_hate_it_here/gay8hyf/", "text": "[deleted]", "author": null, "created": 1604360619, "upvotes": 33}}}