{"sid": "let957", "link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/", "title:": "I have a very English heavy semester for a STEM major...", "text": "So three of my six classes for this semester are pretty heavy on reading and writing stuff. Two happen to have discussion post assignments due every week (they're pretty short, but the reading takes a while) and two also have around 4-5 short essays for the class (it goes from 500-1000 words).\n\nBut even with this small amount of assignments I've had so far, it's been a bit much. I'm talking scrambling to bullshit my way through an essay (i have one due tomorrow where I have to pretend like I care about ethics issues in engineering) and pulling up SparkNotes so I can pretend like I know what I'm taking about when I'm discussing the book that I forgot to read that week.\n\nAnd I can already tell finals week is going to be a nightmare (two projects and three final essays anyone?!). I don't think I'll bother dropping any of them since they're all required credits that I'll have to take anyway. and I think I'd like to just get everything out the way now. Plus I think since this is another COVID semester, there's a good chance my college will do pass/fail again hopefully (just in case I start slipping into B and C territory, I can keep my 4.0 GPA in tact). \n\nThis semester is just reminding me why I decided to go into Computer Science instead of English. I like to think I'm good at writing essays and reading between the lines of books, but I'm really not. It's mostly just complete bullshitting on my part and getting the tl;dr version of required readings I couldn't force my way through (lowkey i'm depressed and it's very difficult for me to focus on books these days). I'm pretty sure I'd have a mental breakdown if all I had were English classes.\n\nThe best classes I have this semester are the ones that are like \"do these math problems\" or \"write a Java program that does this\" and that's all they want from me. Which in hindsight, even though I doubt myself a lot, I made the right choice going into the Engineering school.", "author": "sunnirays", "created": 1612725431, "retrieved": 1632950889, "over_18": false, "upvotes": 96, "upvote_ratio": 0.95, "comments": {"gmjw784": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmjw784/", "text": "Bro I am in the honors college and I can so relate. I hate this so much and honestly, it’s just been excessive work. Literally have an essay that I am not interested due Tuesday and take up so much of my time. I am a decent writer and I do like reading/writing, but I want to be taking more STEM courses. At the end of the day, you can make yourself well rounded without having to take these courses.", "author": "leeeelihkvgbv", "created": 1612761252, "upvotes": 2}, "gmju0bv": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmju0bv/", "text": "I’m majoring in software development and the writing classes are the easiest for me. I struggle with the programming aspect (but the math is easy for me, so that helps at least). Just power through the essays. If you type fast, it should be even easier.", "author": "Dreampup", "created": 1612759784, "upvotes": 2}, "gmjqtzx": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmjqtzx/", "text": "Me too", "author": "waterpik007", "created": 1612757779, "upvotes": 2}, "gmjndir": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmjndir/", "text": "I’m a biology major and I don’t mind writing essays for my science classes. Not my favorite, but it doesn’t make me loathe life, and sometimes I get engrossed in the research process and go way over the word limit. It’s those English essays I had to write on those fiction novels that really made me want to tear my hair out. Like, unpopular opinion, most fiction on the adult reading level is incredibly boring and not mentally stimulating (for me) in the slightest, and writing 5 page papers on them just adds insult to injury. I understand that writing and crediting sources is an important skill in any field, including the one I’m going into, but I can’t imagine how deeply studying character development in The Awakening is going to help me achieve my career goals.", "author": "yuxngdogmom", "created": 1612755742, "upvotes": 3}, "gmjl5c3": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmjl5c3/", "text": "Full disclosure: English Instructor here\n\nNow, out of curiosity, did you build your own schedule, or negotiate with an advisor on the class order?  Or did you just show up to an advisor, accept the set of classes that you were supposed to take this semester, let them pick the section numbers for you, and take the classes?  \n\nThe reason I ask is, while the degree plan may seem prescriptive, there is some leeway to influence your own schedule. I saw an advisor to help schedule classes only twice during my time at my university, in my freshman year, which was once to drop music as a major, and once mid-spring to declare English as a major and get a degree plan. After that, I logged in and found my own classes on my own time, researched the best instructors to take for those classes by talking to other people, checking RMP, and looking at class sizes and offering times. I also looked at where they got their degree, what in, and their photo on the university website. Generally, their photo was pretty indicative of what they were like, for whatever reason, although I may be misremembering that fact entirely.\n\nThe reason I went off-script and made my own schedule through mix and matching the degree plan was that, basically, even as an English major who enjoys all of the English stuff, I’m a slow reader who likes to enjoy the reading I do. The degree plan had me taking all of my majors courses during my junior and senior years, with all of my basics courses during my freshman and sophomore years.  I didn't want to do that because that would put me reading a novel every two weeks in three classes at the same time, or taking Brit Lit and Shakespeare and Linguistics and Spanish all in the same semester.  That was dumb.\n\nSo...what I did was rearrange my degree plan by trying to take the hardest classes first, especially the ones that required a course sequence.  That meant I took Intermediate Writing: Non-Fiction first so I could take Advanced Writing: Non-Fiction later, and I also began my Spanish Sequence, of which there were four to complete.  And then I would also provide a counterbalancing English course like a literature to go alongside a writing, or pick linguistics to go alongside a class I knew I would enjoy (since I'd probably hate linguistics).  \n\nIt may benefit you to approach your major this way instead of having tons of unrelated classes all at once without having a chance to get into your major and make sure you like it.  You'll also not end up slamming yourself with a bunch of majors classes all at once in your junior year, and you'll also be able to start sequence classes earlier.", "author": "chrisrayn", "created": 1612754486, "upvotes": 3}, "gmiwfnm": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmiwfnm/", "text": "With those classes you learn more about how to successfully find info on the internet that will get you through than actually reading the books. You don’t have to read the books you just need to know how to navigate the internet and piece your paper together with that info.", "author": "Kind_Concert_6300", "created": 1612741784, "upvotes": 8}, "gmiuvbk": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmiuvbk/", "text": "The sheer number of writing and communications classes I've had to take is staggering, not to mention the cs classes that throw a surprise presentation in at the last minute...", "author": "deltagardevoir", "created": 1612740952, "upvotes": 3}, "gmii142": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmii142/", "text": "I just finished my bachelors this fall and I think that English classes are needed. Like 80% of my time last semester was writing and looking up journal articles to use for my papers. It’s important to learn rhetoric and how to properly construct a paper and even how citations work (which is what I learned in my lower level English classes).\n\nEdited to add that I’m a chemistry major!", "author": "BlkGirl181", "created": 1612734640, "upvotes": 36}, "gmi370d": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmi370d/", "text": "9/16 of my credits this semester are English related. Kinda sucks and I already hate it, but there’s nothing I can do unfortunately.", "author": "matt3302", "created": 1612730063, "upvotes": 5}, "gmi0fuc": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmi0fuc/", "text": "Instead of blaming colleges requiring you to take classes that ask you to put ideas into words and how to communicate across different contexts, you might should ask your future employers about why they complain about graduates who can’t communicate as part of their jobs. \n\nFor some reason, many companies don’t enjoy spending time and money—think Billions with a B—training individuals how to understand different rhetorical situations, write a competent email, and communicate complicated information for various audiences. \n\nWild. I know.", "author": "dvjax", "created": 1612729257, "upvotes": 16}, "gmhuyag": {"link": "/r/CollegeRant/comments/let957/i_have_a_very_english_heavy_semester_for_a_stem/gmhuyag/", "text": "The fact that we even have to take so many writing/communication classes as engineering majors just shows how colleges only care about making a profit off of us.", "author": "xXMassiveRoosterXx", "created": 1612727167, "upvotes": 44}}}