{
  "sid": "ny6a3t",
  "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/",
  "title:": "\"Failed\" online quiz, professor won't correct grade",
  "text": "I took a quiz online, basic dosage/metric stuff, pretty easy. I put down my answers as 0.5 mL, 103.7 f, 36.8 kg, etc. \n\nthe \"correct\" answers were 0.5, 103.7, 36.8, etc. I thought, no big deal, the teacher will go back and fix anyone who did that. After emailing her, she said our grade is what we get and she won't be fixing quizzes. There is nothing in her syllabus on using units or not using units. \n\nShe drops our 2 lowest quizzes, so I could just say fuck it. But I think it's bullshit to being penalized for using units. Should I take this further to the head and to the dean? Or should I just realize she's a bitch and let it slide?\n\ntl;dr, got my answers \"right\" but labeled with units and thereby got them \"wrong.\"",
  "author": "KamadoJonathan",
  "created": 1623503053,
  "over_18": false,
  "upvotes": 200,
  "upvote_ratio": 0.98,
  "comments": {
    "h1p2ilj": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1p2ilj/",
      "text": "Usually for classes like this they really hammer in using correct units so I’m confused as to how you could “fail” that. I’d talk to someone higher about it.",
      "author": "WhyY_196",
      "created": 1623643531,
      "upvotes": 1,
      "replies": {}
    },
    "h1laqj7": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1laqj7/",
      "text": "In my opinion it’s actually wrong not to include units",
      "author": "crystalliite",
      "created": 1623560392,
      "upvotes": 3,
      "replies": {}
    },
    "h1kbzqy": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1kbzqy/",
      "text": "Oh I initially read this that you had left out the units and agreed with the professor that they should be included as different measures have very different results.\n\nThis is something I definitely would approach the professor and request them to review since your answers technically are more accurate than the answer awarded the points. \n\nIf the answer is still a negative I would forward your email(s) and the response from the professor to the Chair.\n\nAs a Lecturer I am not infallible and do make mistakes but attempt to correct them without penalizing students.",
      "author": "SlightScholar1",
      "created": 1623539080,
      "upvotes": 1,
      "replies": {}
    },
    "h1k4zar": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1k4zar/",
      "text": "I know said that it didn’t say anything about using units in the syllabus, but I’m assuming she didn’t say whether not to use units in the instructions for the quiz either. \n\nYou technically got it right, but the fact that she won’t correct it is messed up. From my perspective, it looks like she just doesn’t want to change it because she either doesn’t care or because you didn’t put it in the way she wanted you to. \n\nIf I was your professor, I would honestly be happy that you not only did the work and put the actually units, but that you did in fact get it right.",
      "author": "Best_Bisexual",
      "created": 1623535166,
      "upvotes": 3,
      "replies": {}
    },
    "h1k17yd": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1k17yd/",
      "text": "Strange, my math professors always told me if I'm given a problem in which I'm dealing with a specific type of measurement (gallons, lbs, kilometers etc...) my answer had to reflect that, and only writing the number alone would be wrong.",
      "author": "orangeblackteal",
      "created": 1623533118,
      "upvotes": 6,
      "replies": {}
    },
    "h1ju0tl": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1ju0tl/",
      "text": "Don't go to the Dean.  Students who skip the department chair and go right to the dean get put on \"the list.\"  Trust me, you don't want to be on \"the list.\"\n  \n  If you feel the prof is being a douche, then please go to the department head/chair because that is what they are for.  If you get no results, then the dean.\n  \n  Please keep in mind that the quiz was probably not the first time you should have seen these types of questions.  Check the homework associated with the assignment.  However, I am not your prof; I could be wrong.",
      "author": "Merkwurdichliebe",
      "created": 1623529286,
      "upvotes": 7,
      "replies": {
        "h1k2j3b": {
          "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1k2j3b/",
          "text": "What if the professor IS the department chair? Then is it OK to go right to the dean?",
          "author": "therealmegluvsu",
          "created": 1623533837,
          "upvotes": 3,
          "replies": {
            "h1msn38": {
              "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1msn38/",
              "text": "then it turns out dean and prof are best friends",
              "author": "ObjectiveAnalysis643",
              "created": 1623599899,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h1jenbu": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1jenbu/",
      "text": "Speaking as a professor, this is some NONSENSE.   Your answers are correct, she just created a poor quiz that required exact matches for the auto-grading to work.",
      "author": "emarcomd",
      "created": 1623521370,
      "upvotes": 7,
      "replies": {
        "h1jlgix": {
          "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1jlgix/",
          "text": "I had a test awhile back where the answer was urinary Tract infection. The “correct” answer was UTI. She went back and fixed it for all of us and we got our actual grade a few hours after\nThe test. Stuff like that is fine with me. But that’s being fair.",
          "author": "KamadoJonathan",
          "created": 1623524825,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "h1j2rat": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1j2rat/",
      "text": "If unspecified in written instructions, the actual question, or in the syllabus, definitely take this to the department head. I would try and convince the other wronged students to do so as well. Take copies of any email correspondence about the matter you e had with the professor. If you haven't emailed about it, I'd send one last email  to your professor asking/explaining the situation and maybe BCC the department head or just take copies of the response to them directly. Good luck OP.",
      "author": "shelly5825",
      "created": 1623515536,
      "upvotes": 8,
      "replies": {}
    },
    "h1j2ptj": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1j2ptj/",
      "text": "The type of professor that isn't there to actually help students learn, and takes the easy way out while disguising their own laziness as your shortcoming. I would be really annoying about this. I'd be talking to department heads and stuff. You pay a lot for your education, this professor is sabotaging your performance.",
      "author": "brashhiphop",
      "created": 1623515516,
      "upvotes": 15,
      "replies": {}
    },
    "h1j22rc": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1j22rc/",
      "text": "I’m an instructor. Yes, you should take this to someone higher up. The teacher likely just didn’t  encode the test with unit answer possibilities. It would double her work to go fix them all, but she should at least manually assign you a proper grade for your error.",
      "author": "chrisrayn",
      "created": 1623515187,
      "upvotes": 47,
      "replies": {
        "h1juxhm": {
          "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1juxhm/",
          "text": "Depends on the system.  Some systems are like a locked-down Apple device and take all option away from professors.  Some systems are like a TRS-80 and you have to know some obscure programming language from the 60s to make it work the way you want it.",
          "author": "Merkwurdichliebe",
          "created": 1623529734,
          "upvotes": 5,
          "replies": {
            "h1k2bex": {
              "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1k2bex/",
              "text": "Well that sucks. We work with Blackboard, which is pretty easy.",
              "author": "chrisrayn",
              "created": 1623533718,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h1j1ill": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1j1ill/",
      "text": "She’s just being lazy. No educator in their right mind would count that as incorrect, especially if it wasn’t specified.",
      "author": "Gerardo1917",
      "created": 1623514899,
      "upvotes": 59,
      "replies": {}
    },
    "h1iidoq": {
      "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1iidoq/",
      "text": "Does is specify anywhere that you should or shouldn’t? This is BS lol",
      "author": "More_Coffees",
      "created": 1623504576,
      "upvotes": 100,
      "replies": {
        "h1iilvf": {
          "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1iilvf/",
          "text": "Nothing in the syllabus or course announcements or anything like it. We have a groupchat and I'm not the only one. She must be one of those professors who has such little control over her life she has to exert minimal authority she has on her students.",
          "author": "KamadoJonathan",
          "created": 1623504718,
          "upvotes": 78,
          "replies": {
            "h1ijv8z": {
              "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1ijv8z/",
              "text": "I’d go to office hours and explain that you’re trying your best but she has to work with you just a little, if she’s not willing to correct this then she should have been crystal clear somewhere. There’s no point in giving you a grade like that over you trying to correctly answer. Most classes I’ve been in require units and Realistically it’s the professional way to do it.",
              "author": "More_Coffees",
              "created": 1623505484,
              "upvotes": 46,
              "replies": {}
            },
            "h1it4g5": {
              "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1it4g5/",
              "text": "What about the instructions for the quiz, which is the logical place to put something like this?\n\nETA: Going to the dean for this is incredible overkill. Dept. chair is probably overkill too. You should still try to work it out with the professor. At WORST, you might file a grade appeal at the end of the semester if this actually affects your final grade, noting that you approached the professor when the issue happened and were denied.",
              "author": "Dr_Pizzas",
              "created": 1623510549,
              "upvotes": 27,
              "replies": {
                "h1iyc1z": {
                  "link": "/r/CollegeRant/comments/ny6a3t/failed_online_quiz_professor_wont_correct_grade/h1iyc1z/",
                  "text": "I don't agree that your first two sentences are overkill.\n\nArrogant and useless professors like this will never learn and therefore aren't worth a student's time and effort to try to reason with. If she is saying that grades are what they are and won't be fixed, then there's obviously no swaying her under any circumstances.\n\nOP should not just move on and accept the worst. The fact is his answers were correct and it's the Professor's fault for not clarifying the inclusion of units. People like her are why college life is miserable for countless students.\n\nSo fuck this professor. Take this shit to the department head or the dean, OP. You deserve the grade you worked hard for and rightfully earned. Don't let one teacher fuck up your grade because her life is so pathetic she's not willing to see the error of her ways or care about the educational well-being of her students.",
                  "author": "Elyktronix",
                  "created": 1623513250,
                  "upvotes": 25,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634063206
}