{
  "sid": "qkuf0i",
  "link": "/r/CollegeRant/comments/qkuf0i/i_had_a_panic_attack_and_walked_out_on_a_test/",
  "title:": "I had a panic attack and walked out on a test worth 20% of my grade.",
  "text": "I maintain great grades, high 90s usually. I try very hard to get good grades and do the best I can, I really really do. I have NEVER had a panic attacks before these last few months. Because of this, I decided to talk to accessibility services for a bit more time on my tests (not just because I'm dumb...I promise).\n\nAnyways, I only just received my letter of accommodation and I didn't have time to send it to my professor (you need to send it a week in advance). Firstly, I'm embarrassed to be using this, but I genuinely get so worked up during tests I feel like I could pass out. I stare at the clock and start panicking about the time and end up WASTING time because of it.\n\nToday, I had a lab test (I'm in a computer course). Ive been studying for the past 2 weeks. I know my stuff, but when it came to the test, my heart started racing and my mind was going blank. I deadass thought I was going to pass out. Obviously, I didn't. I continued to try and work on the test but I messed something up (I can easily go back and change it) but my anxiety took over and I started making STUPID mistakes I know not to do. Like my brain just stopped functioning. I realized what was happening and my eyes started to tear up and before you know it I was sitting there crying and hyperventilating (trying to be quiet.....) People started looking at me because I was obviously crying. That made it worse. I wiped my eyes and grabbed my purse and walked out because I was literally about to start sobbing and I felt like I couldn't breathe. I get to the bathroom and start sobbing in the stall and I CANT CATCH MY BREATH. \n\nI was in there for a good 45 minutes. My eyes were all red and puffy, my eyeliner (I wear quite a bit) was smeared everywhere. I couldn't just go back into my small classroom infront of everyone and ask to speak to the teacher.. That's so embarassing for me and even worse because I have social anxiety. I called my Accessibility counselor from the school and asked her what I should do. She told me to write an email, so I did. I explained to the teacher what happened. He hasn't emailed back yet.\n\nI don't know if he will let me retake it but this is a huge part of my mark and I am unbelievably depressed over this. I can't believe this happened..... Before I had them, I never used to think panic attacks were that bad but holy hell they are. It's hard to explain the feeling.\n\nNo one in my class bothered to ask me what happened even though I spend my time helping them with homework and assignments whenever they ask me. I guess I can't expect anything but wow that hurts. \n\nNow I have to go back on Wednesday with the SAME professor for another course with ANOTHER test. So embarrassing and I'm scared it is going to happen again. \n\nHas anyone else had an experience similar to me? I feel so defeated and just want to give up. I have no idea if my teacher will allow me to, he's usually hard on not letting people redo for valid reasons. \n\nSigh. If you read this all, thanks for listening to my rant..well reading.",
  "author": "dumbgirl34",
  "created": 1635820592,
  "updated": 1636193875,
  "over_18": false,
  "upvotes": 32,
  "upvote_ratio": 0.89,
  "comments": {
    "hiytit2": {
      "link": "/r/CollegeRant/comments/qkuf0i/i_had_a_panic_attack_and_walked_out_on_a_test/hiytit2/",
      "text": "My math teacher mentions math anxiety a lot which is why I like him. Anxiety is real in any course. You have to email your professor and let he or she know what happened. Maybe they’ll understand.\n\nEdit: irrelevant but I wear a lot of eyeliner too.",
      "author": "Coffeeislife1119",
      "created": 1635821375,
      "upvotes": 19,
      "replies": {
        "hiz1fih": {
          "link": "/r/CollegeRant/comments/qkuf0i/i_had_a_panic_attack_and_walked_out_on_a_test/hiz1fih/",
          "text": "Absolutely right. Just email and explain to the professor. I would also include talking to Accessibility counselor in the email as well. I have anxiety as well and would talk to my professors before class if I feel uncomfortable or overwhelmed with anything. The staff(most) at my college understood anxiety kids and tho with health issues and made us come to a day school is closed or Fridays (when the college is mostly empty due to name many students and you can ease your mind.",
          "author": "Forever_ForLove",
          "created": 1635825528,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hj93pnd": {
      "link": "/r/CollegeRant/comments/qkuf0i/i_had_a_panic_attack_and_walked_out_on_a_test/hj93pnd/",
      "text": "My test anxiety is hoooorrible, if you find out a good way to overcome it hmu",
      "author": "roachincalzone",
      "created": 1636007252,
      "upvotes": 1,
      "replies": {}
    }
  }
}