{"sid": "mp3dyl", "link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/", "title:": "School warns us about a rise in cases, making us think its OUR fault, yet they're allowing tours in the dorms... #logic", "text": "TL;DR: school is prioritizing new freshmen over the existing student population and their health\n\nWe've been getting emails warning us about a rise in cases and the school is saying it's because we're letting non-resident guests in and going off-campus. Meanwhile, every Saturday we see giant tours going on - they aren't social distancing and they're even coming in to see our dorms! My dad can't come in to use the bathroom but yeah sure let's allow a bunch of strangers in. I'm so glad I'm graduating in June, this is ridiculous... we get tested at least once a week! We aren't doing anything wrong! I have to fill out a form to leave campus for groceries!", "author": "cr1ss-b", "created": 1618188637, "retrieved": 1632843550, "over_18": false, "upvotes": 35, "upvote_ratio": 0.95, "comments": {"gu7dj4w": {"link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/gu7dj4w/", "text": "Thank you u/cr1ss-b for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1618188637, "upvotes": 1}, "gu9lim8": {"link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/gu9lim8/", "text": "It's always deflection with these people. But hey, the admin people on top need their yearly bonus checks, stat!", "author": "KaiserWilhelmDaThird", "created": 1618242836, "upvotes": 2}, "gu7obbt": {"link": "/r/CollegeRant/comments/mp3dyl/school_warns_us_about_a_rise_in_cases_making_us/gu7obbt/", "text": "[deleted]", "author": null, "created": 1618194509, "upvotes": -6}}}