{"sid": "oh7fyq", "link": "/r/CollegeRant/comments/oh7fyq/just_finished_a_paper_only_to_find_out_that_id/", "title:": "Just finished a paper, only to find out that I’d failed at following directions", "text": "Yeah, I just finished a fun paper for my history class and decided to go back over the guidelines one more time to make sure I hadn’t missed anything, and I realized a few things.\n\n1. Professor asked for footnote or endnote citations. I used end of sentence citations because I’m using APA format, and he *did* give us permission to use whatever format we wanted. But still I had no idea how to cite with APA the way he asked.\n\n2. He asked for essay format…intro-body-conclusion. I kind of did that, but in the APA style of sectioning things off for different topics. I still had a clear intro, obvious body parts, but I’m not sure if I needed to have a conclusion to each section or if my final “conclusion” was acceptable enough so naturally I’m stressing out.\n\n3. He asked for 10-12 pages. I know some professors out there don’t care too much if you go over page count, but I’m at 16 fucking pages. I got way too excited with my writing and went way over page count. I have history with some professors that deduct points for every page you go over and I’m now terrified.\n\nAt this point I’m just here to vent because the paper is due in 6 hours (midnight) and there’s no way I can rewrite it all. All I was really able to do was fix my citations to the best of my abilities, and even with that I feel lost. I had a lot of fun with this paper too, and I don’t usually enjoy writing papers, which makes this all the more heart breaking/frustrating. We have the option to ask for extra credit with the paper provided it’s well written, and I originally thought I’d give it a shot because I put a lot of effort into my work, but now I don’t think it would be worth it to try for extra credit. Clearly I’ve displayed that when I get excited about something I can’t follow directions. I’m so angry with myself right now.\n\nthanks for listening", "author": "WingsofRain", "created": 1625873838, "retrieved": 1632841791, "over_18": false, "upvotes": 82, "upvote_ratio": 0.98, "comments": {"h4nbj4h": {"link": "/r/CollegeRant/comments/oh7fyq/just_finished_a_paper_only_to_find_out_that_id/h4nbj4h/", "text": "Thank you u/WingsofRain for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1625873838, "upvotes": 1}, "h4phxoq": {"link": "/r/CollegeRant/comments/oh7fyq/just_finished_a_paper_only_to_find_out_that_id/h4phxoq/", "text": "For pages guidelines, I would have 12 pages max. I’ve been told this from every teacher in college. They may get mad that you didn’t pay attention to the guidelines, they may not appreciate extra “fluff” and want you to get more to the point. Also, it just takes them more time to read.", "author": "crystalliite", "created": 1625929668, "upvotes": 2}, "h4nxxcq": {"link": "/r/CollegeRant/comments/oh7fyq/just_finished_a_paper_only_to_find_out_that_id/h4nxxcq/", "text": "I have such a hard time staying within max page guidelines. A lot of people seem to struggle with the minimum, but I get really into my topics and there's just SO MUCH TO SAY. \n\nAlso I've never heard of anyone wanting conclusions at the end of each section in an essay-style paper, so that's probably exactly what they wanted.\n\nIf you fixed your citations and your information was pretty critical I'd say you're probably fine. You got good info on how to cut it back already, so good luck and I hope you get the grade you deserve for the effort ^_^", "author": "kingktroo", "created": 1625887253, "upvotes": 12}, "h4nczi0": {"link": "/r/CollegeRant/comments/oh7fyq/just_finished_a_paper_only_to_find_out_that_id/h4nczi0/", "text": "Faculty member here; archaeology, not history, but I’m familiar with their preferred style differences. 1) this sounds like your biggest issue and if youve fixed it, nothing further to worry about. 2) I would be shocked, honestly, if they expected you to have a conclusory paragraphs at the end of each section heading.  Unless its a really long, technical paper, that would be kind of weird and I would likely consider it fluff in a 10-12 page student paper.  3) My advice: proofread and remove all the obviously unnecessary superfluous language that most every non-professional writer often uses.  When I’m grading papers, if a paper is extra long, but the paper is tightly written and on topic, I might grumble about it but won’t fault them grade-wise for being an overachiever.  On the other hand, if there is constant repetition, meandering writing, and just useless nonsense that causes them to exceed the max, I will usually take points off (and note so on my rubric).  My advice is use what time you have left to carefully edit your writing to be more parsimonious.  Reading your work out loud or better, give it to a peer and ask them to be merciless in their critique. Either will help you hone in on wordy writing and whittle it down.  You could also simply attach a note in an email or upload like “sorry, I really got into this topic and had a lot to say.” If your writing is good, I would probably smile and accept that.  The only times I’ve known faculty to be draconian about going over page length is when they’re expressly trying to teach students to write succinctly (usually in very short essays) or they are jerks and should have made their grading policy on going over the page limit clear.", "author": "AgentIndiana", "created": 1625874782, "upvotes": 53}}}