{"sid": "p8ivca", "link": "/r/CollegeRant/comments/p8ivca/taking_the_second_half_of_the_semester_off/", "title:": "Taking the second half of the semester off", "text": "I am just so burnt out I currently am in a completely asynchronous online program while working full time and also im 31weeks pregnant and my relationship with my sons dad fell apart this week😅😅😅😭. I currently am in the end of the second half of the summer session courses I have basically been in class since January and I am soo tired i thought i could just bang it out and get this last senior year over with , with no real break besides from work after i give birth but I can’t and feel like such a failure as a mom and student. Its just a year but I would only have winter break and nothing until graduation next winter. Is it worth it to take the second half off and go back in january or just bang it out and get it over with. Also the classes are only 7 weeks but are pretty intense any advice would be great for this tired mama 😭.", "author": "Silver_Least", "created": 1629511383, "retrieved": 1632841596, "over_18": false, "upvotes": 11, "upvote_ratio": 1.0, "comments": {"h9qofki": {"link": "/r/CollegeRant/comments/p8ivca/taking_the_second_half_of_the_semester_off/h9qofki/", "text": "Thank you u/Silver_Least for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1629511384, "upvotes": 1}, "ha9ze40": {"link": "/r/CollegeRant/comments/p8ivca/taking_the_second_half_of_the_semester_off/ha9ze40/", "text": "You're almost there! I've been feeling pretty burnt out too and I'm also on my senior year. I've been trying to prioritize my mental health first before anything and I think you should as well especially since you are expecting soon (congratulations). I'd see if your institution allows you to change from letter grading to credit/no credit grading. Not worrying about grades in such an intense setting as 7 week classes should help if you do decide to push it through.", "author": "globalwar_ming", "created": 1629888474, "upvotes": 1}, "h9sf86a": {"link": "/r/CollegeRant/comments/p8ivca/taking_the_second_half_of_the_semester_off/h9sf86a/", "text": "Power through it. You definitely won’t regret it. I can’t imagine how hard it is with children and pregnancy, but think about the outcome that will come sooner than later.", "author": "skyleft4", "created": 1629554201, "upvotes": 3}}}