{"sid": "hnsja4", "link": "/r/CollegeRant/comments/hnsja4/i_fucked_up_high_school/", "title:": "I fucked up high school", "text": "Ok so Im 21(f) I did terrible in high school. I barely graduated by going to an alternative school at the very last minute. and I had a terrible gpa. Because of this no one ever showed me how to apply for scholarships, or apply for school. I’m completely lost and I just want to go to school. I want to tattoo and have an apprenticeship. I already went and got my hand, head and face tattooed so I don’t even know if teaching is still an option for me. But I want to get a degree for teaching, as well as just some art classes to further my tattooing abilities. I know 2020 is a weird year for colleges in the us but Im determined to start soon. I’m just looking for any advice on how to even get started on my college journey. Thank you.", "author": "cypivy", "created": 1594252540, "retrieved": 1632843567, "over_18": false, "upvotes": 31, "upvote_ratio": 0.96, "comments": {"fxjxxaj": {"link": "/r/CollegeRant/comments/hnsja4/i_fucked_up_high_school/fxjxxaj/", "text": "Don’t worry I passed high school with average grades and no one showed me shit either.", "author": "thenicesttacolicker", "created": 1594404093, "upvotes": 1}, "fxgdrpr": {"link": "/r/CollegeRant/comments/hnsja4/i_fucked_up_high_school/fxgdrpr/", "text": "your tattoos are only going to be a problem if the person hiring you has a problem with them. my principal has a face tattoo, lol, and dresses in this amazing style that i can only describe as chic-goth. i, myself, have several tattoos all over my body, from my calf all the way up to behind my ear - including several on both hands. it’s never been a problem for me, and neither have my one-inch stretched ears. you just have to find an accepting environment, let your credentials speak for themselves, and know your rights. \n\nhigh school gpa doesn’t really factor in once you have an undergrad or graduate degree; they’re going to be looking at your gpa while at university. so if you bust your butt and get a good gpa through undergrad and grad school, that will speak for itself. \n\nlearn from your previous mistakes! you can grow from them. \n\nas for scholarships, any university you apply to has academic advisers that can help you apply for financial aid and scholarships.", "author": "atticusphere", "created": 1594323223, "upvotes": 4}, "fxfrz3r": {"link": "/r/CollegeRant/comments/hnsja4/i_fucked_up_high_school/fxfrz3r/", "text": "You could be a TEFL / TESOL / TESL / CELTA / DELTA teacher.  [http://reddit.com/r/tefl](http://reddit.com/r/tefl)  A lot of countries don't require a college degree for it and some of the more desperate countries are just happy to have a native speaker. A bit unethical but I'd bet plenty of the interviews are online so they don't ever see your face so just surprise them once you arrive (after already signing the contract). I hear tattoos are really common in Shanghai and some other parts of China so you might actually fit in pretty well there and have good interaction with other people interested in tattoos.\n\nIf you're looking to do traditional teaching in the US though then you might be out of luck with the face tattoos. You could open your own teaching business or become a private tutor (getting hired directly by parents and working in people's homes) to bypass having to be hired by someone else's business.\n\nIf you really want a degree, then you should look into community college (2 year/associates school). The requirements to get in are a lot lower, it's a lot cheaper, and you can prove yourself there to then transfer to a regular University and finish the other 2 years. If you successfully did that then there would be literally no difference between you and someone who did good in highschool and went to a 4 year school all 4 years. Usually no one puts highschool or community college on their resumes, so you and someone else's resume's from the same school would just be \"Went to \\_\\_ University, Gpa: \\_\\_\". There's a lot of different options for scholarships too if you really research them, and the community colleges you apply to will have offices that can help you with financial aid and scholarships.\n\nAgain though while you could get the teaching degree, you'd have trouble finding a job as a teacher so you might want to consider other degrees. You could get a full degree in art, and become a tattoo artist as your job. Or how about becoming a tattoo artist instructor? Teaching and tattoos. You could also look into fields where you wouldn't directly interact with customers like computer science / IT, some aspects of business, accounting, etc. Law could also be an option as a public defender (I don't think States care what you look like), finding an office that is fine with tattoos, or running your own practice if you're fine with losing some customers because of the tattoos. You could also look into being a real-estate agent, essentially it's running your own business.", "author": "thepurpleapollo", "created": 1594313039, "upvotes": 4}, "fxe73b7": {"link": "/r/CollegeRant/comments/hnsja4/i_fucked_up_high_school/fxe73b7/", "text": "Laser remove the tattoos", "author": "_readyforww3", "created": 1594271915, "upvotes": -9}, "fxdmv0k": {"link": "/r/CollegeRant/comments/hnsja4/i_fucked_up_high_school/fxdmv0k/", "text": "Email a few colleges. Also look for a career coach if you can.", "author": "gracefulspork", "created": 1594259029, "upvotes": 7}}}