{"sid": "ofp9kd", "link": "/r/CollegeRant/comments/ofp9kd/i_had_to_go_out_to_the_bathroom_during_a_final/", "title:": "I had to go out to the bathroom during a final just to cry my heart out because I was severely struggling :(", "text": "After I came back, I told the professor that even though I had an hour left I would not be able to accomplish anything in that time to put me even close to passing the exam. I studied a lot and was very confident that I would do very well. I was the only person sitting for the exam. I feel like shit. He was really nice about it but still. Now I don't even want to sit for any other final because I fear not passing is going to destroy my mental health. \nI've been severely struggling with many non-college related aspects of my life (recently started working and moved alone  for the first time due to tension/abuse in my family home, I received bad news from a lawyer I hired due to another issue, I'm struggling at my job, my anxiety is through the roof), but I think that this was the thing that really did me in.", "author": "pitolaser", "created": 1625683471, "retrieved": 1632841892, "over_18": false, "upvotes": 217, "upvote_ratio": 0.97, "comments": {"h4dtxeb": {"link": "/r/CollegeRant/comments/ofp9kd/i_had_to_go_out_to_the_bathroom_during_a_final/h4dtxeb/", "text": "Thank you u/pitolaser for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1625683472, "upvotes": 1}, "h4hhmnd": {"link": "/r/CollegeRant/comments/ofp9kd/i_had_to_go_out_to_the_bathroom_during_a_final/h4hhmnd/", "text": "Had a guy, in the middle of a zoom exam with cameras on, turn his mic on, say \"Dr. xxxxx, I need to be excused for a moment.\" He left his mic on and you could hear him vomiting. He comes back and he's sweating, trying to finish the exam. Asked about it later on, he said he got too stressed out, was gonna faint, and ran to the bathroom. \n\nAverage on that exam was in the 30s.", "author": "Quarentus", "created": 1625759580, "upvotes": 4}, "h4ev1vf": {"link": "/r/CollegeRant/comments/ofp9kd/i_had_to_go_out_to_the_bathroom_during_a_final/h4ev1vf/", "text": "Listen, it happens. I lost my mind last week because I had to W and it’s not the first class I’ve failed. Don’t be too hard on yourself and take some time to decompress. \n\nAlso, if you feel like your mental health has affected school you can get an appeal (a medical withdrawal). Look into it.", "author": "Ohhiitsmeyagirl", "created": 1625699964, "upvotes": 20}, "h4emj1p": {"link": "/r/CollegeRant/comments/ofp9kd/i_had_to_go_out_to_the_bathroom_during_a_final/h4emj1p/", "text": "damn, kinda the same thing happened to me today, but it was an online exam and I just started crying a little bit hoping no one will look at me and notice. The grading is gonna be in a few days with me present and I just want to tell the professor to give me the default point and move on, but I think it's too late now. I also had a lot of personal problems and nothing seems to work out, so yeah... it sucks. I'm sorry it happened to you, it's heartbreaking and I understand how you feel, you're not alone. I'm trying to make myself feel better by saying that there have to be both ups and downs, and I'm going through a giant down rn. Maybe it's for the best and it's a clear sign that I might not have understood the subject as well as I thought I did, so it's gonna be better if I study for it again next time and understand all the concepts.", "author": "Some_Random-Name01", "created": 1625695897, "upvotes": 37}}}