{
  "sid": "pirz3g",
  "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/",
  "title:": "I fucking hate it here.",
  "text": "Please I wish someone would get me out of here. I feel like I am stuck in a nightmare. Wait, I FUCKING AM. I’m trying to make friends but literally everyone PARTIES. They all dress so immodestly and completely different than me. I feel so stupid. I hate to party. Males won’t even acknowledge me because I don’t look like a whore. I just feel embarrassed. I so badly want to die. I just want to go home. I’ve been sobbing every night since being here.",
  "author": "Fantastic-Cry2927",
  "created": 1630901237,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.22,
  "comments": {
    "hbuwjyn": {
      "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbuwjyn/",
      "text": "/r/notlikeothergirls",
      "author": "nadehlaaay",
      "created": 1630965051,
      "upvotes": 2,
      "replies": {}
    },
    "hbrx0nb": {
      "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbrx0nb/",
      "text": "This is my 3rd year in college and it’s all the same for me. I honestly feel like a really tall 12 year old. Everything from the way I dress, to being dependent on my parents for any and all emotional support since I don’t have friends, to not liking to drink excessively or party at all. I hate to be a downer all the time but everyone told me that it will get better and if anything it’s just gotten worse.",
      "author": "notthelettuce",
      "created": 1630904714,
      "upvotes": 1,
      "replies": {}
    },
    "hbrtac0": {
      "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbrtac0/",
      "text": "Youd probably get along better if you werent so judgemental.",
      "author": "taybay462",
      "created": 1630902409,
      "upvotes": 15,
      "replies": {
        "hbrtcnb": {
          "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbrtcnb/",
          "text": "It’s not judgment. It’s facts",
          "author": "Fantastic-Cry2927",
          "created": 1630902448,
          "upvotes": -9,
          "replies": {
            "hbtr2so": {
              "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbtr2so/",
              "text": "Youre litetally calling women whores for the clothes they choose to wear. Thats judgemental as fuck. Who gives a shit if they have a lot of sex? As long as its safe and consensual its none of your business. I highly, highly doubt every single man (not male, thats dehumanizing language) on your campus wouldnt speak to you because of how you dress. I promise you, its your attitude and demeanor.",
              "author": "taybay462",
              "created": 1630946701,
              "upvotes": 4,
              "replies": {
                "hbux11o": {
                  "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbux11o/",
                  "text": "I used to think this way too when I was 15…if you dress a certain way then you’re a whore!! Then I grew the fuck up after realizing I was just projecting my own insecurities.\n\nGirls dress for themselves, not men. Maybe OP should take a gen ed on feminism if they end up growing up and making it through the first two weeks.",
                  "author": "nadehlaaay",
                  "created": 1630965271,
                  "upvotes": 3,
                  "replies": {
                    "hbv1s0t": {
                      "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbv1s0t/",
                      "text": ">Girls dress for themselves, not men.\n\nThis is absolute cap🤣 Women do not dress for themselves, they do it for attention and validation.",
                      "author": "NobleTrooper",
                      "created": 1630967529,
                      "upvotes": -2,
                      "replies": {
                        "hbvwkxl": {
                          "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbvwkxl/",
                          "text": "Gonna take a wild guess that youre a man. So what gives you the right to say with absolute certainty why women dress the way they do? Sometimes women dress to show off their body if theyre like, going out to the club and are looking to take a guy home. Sometimes we dress cute/revealing because we *just fucking want to*. Dressing cute makes you feel cute. I promise you that most women dont wake up everyday and think \"what can I wear that will most please the men who will see me?\" Lolol fuck no. Has it ever occurred to you that women dress because of their desires and motativions based on what THEY want, not what some random dude would like? Same with makeup. A lot of women genuinely enjoy the process of applying it, and the confidence boost of seeing themselves looking hot. The fact that men enjoy that type of attire is a side affect, not the goal.",
                          "author": "taybay462",
                          "created": 1630982819,
                          "upvotes": 2,
                          "replies": {
                            "hc43gq9": {
                              "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hc43gq9/",
                              "text": "Too much liberalism in this post",
                              "author": "Fantastic-Cry2927",
                              "created": 1631139915,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "hbwwdrk": {
                              "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbwwdrk/",
                              "text": "Yeah I ain’t reading all of that😂 Ahh the arrogance of women and their tone policing. Classic.",
                              "author": "NobleTrooper",
                              "created": 1631008378,
                              "upvotes": 0,
                              "replies": {
                                "hbzhbvl": {
                                  "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbzhbvl/",
                                  "text": "I wasnt tone policing you, I take issue with your word choice. And ahh, the arrogance of a man that is so sure a woman possibly couldnt have anything worthwhile to say.",
                                  "author": "taybay462",
                                  "created": 1631052218,
                                  "upvotes": 1,
                                  "replies": {
                                    "hbzhvl6": {
                                      "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbzhvl6/",
                                      "text": "No agreement here. The only thing clear about your comments is your indignation.",
                                      "author": "NobleTrooper",
                                      "created": 1631052458,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "hbv397b": {
                          "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbv397b/",
                          "text": "uhhhhh okay dude.\n\nstraight man explains how women work to women. that's a new one.",
                          "author": "nadehlaaay",
                          "created": 1630968249,
                          "upvotes": 1,
                          "replies": {
                            "hbv7tf6": {
                              "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbv7tf6/",
                              "text": "I mean y’all snitch on yourselves in public and on social media. It’s difficult to say I’m wrong…",
                              "author": "NobleTrooper",
                              "created": 1630970516,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hbrsbv3": {
      "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbrsbv3/",
      "text": "Contrary to popular belief not everyone in uni likes to party. I don’t and found my people who’s idea of a good time is staying home and watching movies. You’ll find your people once you put in the effort too. It might take time but one thing about uni is that there are so many different personalities that eventually you’ll find someone like you. 🥰",
      "author": "East-Willow6341",
      "created": 1630901844,
      "upvotes": 1,
      "replies": {
        "hbrsgwa": {
          "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbrsgwa/",
          "text": "This school just feels too small. Like it literally feels like that’s the only thing people are doing. I’m literally sobbing in my dorm alone as we speak while everyone else parties",
          "author": "Fantastic-Cry2927",
          "created": 1630901926,
          "upvotes": 1,
          "replies": {
            "hbrugkm": {
              "link": "/r/CollegeRant/comments/pirz3g/i_fucking_hate_it_here/hbrugkm/",
              "text": "Please don’t cry ( even tho I did as well in my first year when I was feeling like this so I called my sister at the time who was in 3rd year to comfort me 🙂). It’s not gonna be like this forever, wait till midterms hit and res is dead silence. 💀🤣\nYou’ll meet so many people in your classes and in clubs that you’ll  join that you’ll get the opportunity to pick your friends (Even tho yes it’s a smaller school, what I’m saying still applies).\nI’m in 4th year so take it from me when I say things will get better once you decide to put a little effort (could be something as simple as smiling or waving at the person sitting next to you), i know it’s hard and seems difficult but it’s like that when things are new. You’ll be fine, ok?☺️😌 I’m rooting for you.",
              "author": null,
              "created": 1630903118,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062133
}