{"sid": "pey8v2", "link": "/r/CollegeRant/comments/pey8v2/forced_summaries_for_readings_so_they_know_youve/", "title:": "Forced Summaries for Readings so they know you’ve read.", "text": "I’m senior in college and I’m taking a 300 level Ancient Rome class which means it’s just basically readings. Personally, I love the readings but I’m really annoyed with the forced summaries we have to do after every reading. And my teacher said it’s because she wants to know we read. I get that but I’m paying thousands of dollars to not be treated like a child in middle school. Im here to learn. I’ve taken latin for years and this level of Ancient Rome info is literally beginner course stuff so it’s not that hard. \n\nIf students don’t want to read, fine let them not. Then let them fail because they chose not to read. And let them pay to retake the course and maybe their ways will change. \n\nBecause as someone who always reads the books and comprehends the info by just reading ( bc I enjoy it and it often seems like that’s the only time I actually learn anything), Im tired of the bullshit assignments that waste my time and make me dislike the readings bc I know I have to write a summary afterwards. \n\nThis isn’t the first class I’ve had that’s done it but I figured by senior year, it wouldn’t be this way anymore.", "author": "Sunshine1813", "created": 1630382136, "retrieved": 1632841353, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"hb0mjlw": {"link": "/r/CollegeRant/comments/pey8v2/forced_summaries_for_readings_so_they_know_youve/hb0mjlw/", "text": "Thank you u/Sunshine1813 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1630382136, "upvotes": 1}, "hb8tkht": {"link": "/r/CollegeRant/comments/pey8v2/forced_summaries_for_readings_so_they_know_youve/hb8tkht/", "text": "I’m in a course that also requires summary writings to make sure we’ve read. Like you, I love reading the material, but hate writing about it. Good luck!", "author": "DScotus", "created": 1630535631, "upvotes": 1}, "hb6kmyh": {"link": "/r/CollegeRant/comments/pey8v2/forced_summaries_for_readings_so_they_know_youve/hb6kmyh/", "text": "Don't be so sure. I took a graduate course that was like this.", "author": "hdorsettcase", "created": 1630501334, "upvotes": 1}, "hb32a7i": {"link": "/r/CollegeRant/comments/pey8v2/forced_summaries_for_readings_so_they_know_youve/hb32a7i/", "text": "I totally get your point but your mindset is not the majority. Imagine your Professor trying to teach a class and no one is even remotely competent of the information. As a professor I imagine that’s annoying so I think that is part of the reason for the readings. And if you read anyway, it’s no big deal to you right?", "author": "Street_Historian_598", "created": 1630432522, "upvotes": 4}}}