{"sid": "o1d7dm", "link": "/r/CollegeRant/comments/o1d7dm/80_of_overall_grade_is_exams/", "title:": "80% of Overall Grade is Exams", "text": "(This got removed as soon as it got posted on r/college so I figured I might as well stick it here.)\n\nI'd like to preface this by saying that this is more of a rant than anything else. I'm sure I'm one of hundreds of thousands of students who have had this problem, but nevertheless, I felt like I needed to get it out of my system.\n\nI'm taking two online summer courses right now, one in Contemporary Mathematics and another in French. The condensed format of both courses makes it quite difficult to retain the information I'm being given in the amount of time that I have to learn it.\n\nHowever, I'd have to say that my biggest problem right now is with Contemporary Mathematics due to the fact that 80% of the grade is weighted toward exams, of which there are four. Spending 3 to 5 hours a day working on the abundance of homework and quizzes (each of which is only 10% of my overall grade respectively) only to have my 95% grade drop down to a 75% because of one 10 question exam that I spent not even an hour of my time working on.\n\nIt just really kills my motivation to do my best in this class when the vast majority of what I spend my time working tirelessly on ends up only being worth a flimsy percentage of my grade. Regardless, I'm just going to keep on doing what I can and hope that my grasp of the concepts being taught is stronger by the time that the next exam comes around (7 days from now, lol).\n\ntl;dr: My class is 80% exam grades despite the vast majority of my time being spent on homework and quizzes", "author": "weescve", "created": 1623871731, "retrieved": 1632949691, "over_18": false, "upvotes": 8, "upvote_ratio": 0.9, "comments": {"h207upl": {"link": "/r/CollegeRant/comments/o1d7dm/80_of_overall_grade_is_exams/h207upl/", "text": "Best thing you can do is alter your perspective.  Don't think of the homework as points. Think of the homework as studying for the exam that you happen to get some points for doing.  If the homework isn't the best way for you to study then half-ass it and study however works best for you.\n\nOdds are you aren't a math major and this is just your math GenEd you've got to get out of the way-- you only need to pass. There's no shame in one not-so-great math grade.  You wouldn't be the first one and you won't be the last to just get through it and move on.", "author": "Punchee", "created": 1623872693, "upvotes": 8}, "h206m60": {"link": "/r/CollegeRant/comments/o1d7dm/80_of_overall_grade_is_exams/h206m60/", "text": "I truly know how you feel - I'd say that, out of the 20 or so courses I did in the past 4 semesters, about 15 have been 100% (yes, 100%) exam-based. I study Physics in Portugal -\\_-", "author": "BernardoCamPt", "created": 1623872161, "upvotes": 2}}}