{
  "sid": "r0tddw",
  "link": "/r/CollegeRant/comments/r0tddw/im_terrified_to_transfer/",
  "title:": "I’m terrified to transfer",
  "text": "Next fall I transfer to a 4 year from community college. Online and CC have spoiled my ass so much. Open notes, formula sheets, open exams where they let u work with others, etc. I’m just scared I’m gonna get eaten alive when I transfer. I’m in engineering. Without my peers, notes, or formula sheets I probably would have gotten weeded out. I’m just scared for when I have to face my reality.",
  "author": "ttyltyler",
  "created": 1637718967,
  "updated": 1638207545,
  "over_18": false,
  "upvotes": 43,
  "upvote_ratio": 0.97,
  "comments": {
    "hlv91z2": {
      "link": "/r/CollegeRant/comments/r0tddw/im_terrified_to_transfer/hlv91z2/",
      "text": "Honestly man, it's really not any harder. Might even be easier. I'm wrapping up my first quarter of upper division courses in two- three weeks and it hasn't been harder despite being faster paced.",
      "author": "TheDiscoJew",
      "created": 1637732426,
      "upvotes": 12,
      "replies": {}
    },
    "hlv26ef": {
      "link": "/r/CollegeRant/comments/r0tddw/im_terrified_to_transfer/hlv26ef/",
      "text": "I have the same thoughts except I'm excited to transfer cause my CC is boring.",
      "author": "fairytail37",
      "created": 1637728543,
      "upvotes": 3,
      "replies": {}
    },
    "hluzs0w": {
      "link": "/r/CollegeRant/comments/r0tddw/im_terrified_to_transfer/hluzs0w/",
      "text": "Have u taken a lot of ur engineering classes?",
      "author": "Substantial-Koala-32",
      "created": 1637727286,
      "upvotes": 2,
      "replies": {
        "hlv3bhf": {
          "link": "/r/CollegeRant/comments/r0tddw/im_terrified_to_transfer/hlv3bhf/",
          "text": "Not really. I’m mostly just taking engineering requirements like calc chem physics bio statics etc. I don’t take more specialized engineering classes till junior year.",
          "author": "ttyltyler",
          "created": 1637729159,
          "upvotes": 3,
          "replies": {
            "hlvfhc9": {
              "link": "/r/CollegeRant/comments/r0tddw/im_terrified_to_transfer/hlvfhc9/",
              "text": "Honestly my entire freshman year was online and now that I’m at university in person it’s very challenging but not impossible you just have to dedicate a lot of your time and attention",
              "author": "Substantial-Koala-32",
              "created": 1637736442,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlwnuzm": {
      "link": "/r/CollegeRant/comments/r0tddw/im_terrified_to_transfer/hlwnuzm/",
      "text": "oof engineering calc at a CC is cake compared to Uni…. \n\njust like prepare for the worst man. engineering courses are no joke.",
      "author": "Azula-Kun",
      "created": 1637766050,
      "upvotes": 2,
      "replies": {}
    },
    "hlvhayg": {
      "link": "/r/CollegeRant/comments/r0tddw/im_terrified_to_transfer/hlvhayg/",
      "text": "ughh I'm in the exact same boat as you, I'm so scared. Almost everything for me has been open book or with formula sheets and I haven't done anything related to my major at all. Gonna kick my a$$",
      "author": "LenoraNoble",
      "created": 1637737702,
      "upvotes": 1,
      "replies": {}
    },
    "hlwgh0k": {
      "link": "/r/CollegeRant/comments/r0tddw/im_terrified_to_transfer/hlwgh0k/",
      "text": "Most of my students who transferred into engineering did fine.  Some didn't, but it wasn't because of academics.  It was because their life-situations were difficult.  At the CC there was enough flexibility that they could deal.  That ended at the 4 yr.",
      "author": "StudySwami",
      "created": 1637762693,
      "upvotes": 1,
      "replies": {}
    },
    "hlxaj3m": {
      "link": "/r/CollegeRant/comments/r0tddw/im_terrified_to_transfer/hlxaj3m/",
      "text": "Right it’s not that bad!! We’ve had open notes for online courses (depending on your major)… plus there’s tons of resources and fun spirit activities you can attend. Just lean in and utilize all the resources available to you, keep in touch with your professors, and actively participate in your classes!! Don’t take on too much I started with 3 classes when I first transferred to a 4 year because I was terrified I couldn’t handle it… but I did and survived and I believe you will too :)",
      "author": "Hungryyy4",
      "created": 1637775161,
      "upvotes": 1,
      "replies": {}
    }
  }
}