{
  "sid": "q39983",
  "link": "/r/CollegeRant/comments/q39983/i_live_here_now_ig/",
  "title:": "I live here now ig",
  "text": "Want to withdraw for the semester, can't because I had to beg for my finaid back because last year was multiple whammies at once from uncles suicide to health deteriorating to a mental breakdown during finals in spring.\n\nNow it s: nobody is masking up at our football games, some students have reported to have covid and likely more that the schools not revealing. Because most professors won't change their attendance policies for COVID, some have probably shown up sick. And I'm more crippled with anxiety that it's become harder to attend in person.\n\nI wish I could withdraw and just try again next semester because I just. I can't. I know everyone struggles but I feel like I'm relapsing but I feel too frozen to leave my bed. When I'm in class, I'll do my best to pay attention but what we'd learned feels so hazy, even with detailed notes. In German, we were going over interests and it feels like my brain skipped something and I couldn't figure out what was going on and couldn't understand a thing. And my notes were there but I may as well have never heard of German for how much I struggled to even comprehend what was going on. I pass all the assignments but fail all the quizzes. Don't know how that works.\n\nI'm working wiith disability services but it's hard to acommodate learning disabilities when we dont know what they are and the fact that nobody diagnosis adults on medicaid at my age. They somewhat acommodating to bipolar and agoraphobia, but how much patiences can a professor have in receiving emails saying I won't be in class? I'm trying. I'm in therapy, I'm on meds, I have a new psychiatrist whom I don't see until late November.\n\nBasically. I wanna withdraw because mental illness is getting worse but I can't because financial aid stuff (I receive the pell grant and article two stipulates I have to pay it back and I am poor as shit).",
  "author": "assholelesbian",
  "created": 1633613821,
  "updated": 1634093842,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {}
}