{
  "sid": "q8gsti",
  "link": "/r/CollegeRant/comments/q8gsti/professor_threw_shade_at_me_in_lecture_video/",
  "title:": "Professor threw shade at me in lecture video",
  "text": "I'm taking this coding class that's asynchronous. He does have live zoom meetings but they're uploaded online for us to watch at our convenience. I actually heard from another student that he's mad that people don't show up to the lectures, even though it's literally supposed to be an asynchronous class. I haven't attended the lectures but I have watched all the videos on my own time and I even take notes. Is my attention span always at 100%? No, but I really do try to make an honest effort to keep up with the videos.\n\nWe had a project due on Wednesday and I asked him a question that morning. His response was pretty dismissive, it was just, \"did you watch the latest lecture? I covered this extensively.\" I actually did watch it, but honestly, it's a really hard class and he rambles a lot and sometimes the stuff he says goes in one ear and out the other. So I just replied with \"I did, I'll take another look at the file\" (he uploads the coding files after class along with the videos).\n\nAnyway, cut to the latest lecture, and there's an entire rant in the first minute that's like- \"some of you guys are asking me questions that I've already covered, and I can tell you aren't watching the lectures, and you probably aren't even gonna see this because you're not watching the lectures. If you try to do this your own way you will fail. Maybe what I need to do is not upload the files after class so you're forced to watch the videos.\" The last sentence is what makes me think this is 100% about me. Of course, I'm probably not the only student that asked a dumb question, but realistically this is a small class and I asked this question the same day of the zoom meeting.\n\nThis is really disheartening because I don't know how I'm supposed to prove that \\*yes\\* I actually am watching the lectures. I was also gonna ask him for a letter of recommendation because I got an A in his class last semester, but I guess that's out the window now. Part of me wants to start attending the lectures live and really grind for the last two projects. Part of me wants to message him about this to clear my name. Part of me wants to just drop the class and accept defeat, but then I would be burning this bridge. Not sure what to do, any advice would be appreciated.",
  "author": "spotl1ght",
  "created": 1634272666,
  "updated": 1634332060,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgqs3ao": {
      "link": "/r/CollegeRant/comments/q8gsti/professor_threw_shade_at_me_in_lecture_video/hgqs3ao/",
      "text": "Ugh this is a tough one. I definitely wouldn't drop the class if you're doing well grade-wise. If it's asynchronous, how can he have mandatory Zoom meetings? The whole reason people take asynchronous classes is so they can get other shit done through the day.\n\nIf it was me I'd consider just showing up to the meetings, but if you really don't want to, maybe message him and let him know that you have other things to do during the lectures and that's why you chose an asynchronous class (worded more respectfully), but that you have been keeping up on your own time and that you apologize if it seems like you haven't been engaged. Maybe reiterate the question you asked about the project and say that you didn't fully grasp when he covered it during the lecture video.",
      "author": "peachtones",
      "created": 1634308791,
      "upvotes": 1,
      "replies": {}
    },
    "hgqsdc5": {
      "link": "/r/CollegeRant/comments/q8gsti/professor_threw_shade_at_me_in_lecture_video/hgqsdc5/",
      "text": "First of all, a professor should never be dismissive over someone asking a question. Is it annoying if its the same question that can be answered in the syllabus? Sure. But you were doing your job as a student in order to do well on your exam. I would honestly grit your teeth as much as possible for right now since your professor didn't outright insult you or anyone else, but maybe keep notes on his behavior that you can send to the department chair. Does your school do reviews every semester? Do it and write honestly about this professor. Good luck.",
      "author": "pistachiopanda4",
      "created": 1634308908,
      "upvotes": 1,
      "replies": {}
    }
  }
}