{
  "sid": "lxs5kb",
  "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/",
  "title:": "i've developed unhealthy coping mechanism",
  "text": "I'm just feeling so overwhelmed by the amount of work and exams I have this semester - it feels so much worse than the last. I've been so stressed everyday and so scared of failing (and nothing particular has happened... *yet -* my first midterms are in a few days though) that I've been eating way less than I used to. I have to listen to music - literally from the moment I wake up until the second I fall asleep - or else the thoughts will be too overwhelming. I lost motivation to attend class and do assignments or study and I have been crying way more than usual. Sleeping and taking breaks feels like a waste of time. There just isn't enough of it. I don't know what to do I'm so tired.",
  "author": "Apprehensive_End8228",
  "created": 1614884060,
  "over_18": false,
  "upvotes": 224,
  "upvote_ratio": 1.0,
  "comments": {
    "gpqqwc2": {
      "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gpqqwc2/",
      "text": "Hey I’ll trade you. I’m an instructor grading papers where the lack of motivation bleeds out of my computer screen and into my halfbeating heart and MY coping mechanism has been eating MORE. Insanely more. 20 pounds more. \n\nHow do you want to do the trade?",
      "author": "chrisrayn",
      "created": 1614921611,
      "upvotes": 5,
      "replies": {}
    },
    "gpq0kxk": {
      "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gpq0kxk/",
      "text": "Does your college have a mental health service? contact them ASAP and get help from a professional. \n\nthe fact you're even calling these \"coping mechanisms\" and you recognize they're unhealthy suggests you know that not addressing this is even more unhealthy.\n\nDepriving yourself of sleep will make you feel WORSE not better. and if you're having to listen to music to deal with intrusive thoughts, those thoughts have taken over. \n\nI say this as someone who self harmed for 20+ years, and self medicated with overwork, not sleeping, and generally treating myself badly. I wound up in hospital. don't let it get that far!\n\nSorry if this sounds a little harsh but it sounds like you know this is a slippery slope so look after yourself, talk to someone at your school's MH service (most have them) and failing that, talk to a friend, your student advisor, your hall person (if you're in residential halls on campus, not if you're remote) or someone else who might be in a position to help. I list \"friend\" first because they may actually be least well positioned to give you more practical mental health assistance - and that should really be the position of a professional - but they can give you moral support and talk to you and help you understand what's happening, which is a start.\n\ndon't let this slide even more out of your control. good luck!",
      "author": "coyotesandcrickets",
      "created": 1614906870,
      "upvotes": 8,
      "replies": {}
    },
    "gppluoi": {
      "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gppluoi/",
      "text": "I have also developed a coping mechanism. It's not as bad as yours but I started stress cleaning. I'm generally a messy person and was always made to feel like shit for it since my family is VERY particular about cleanliness. I'm living with my fiance and I started to stress clean in am attempt to justify not doing work because hey! At least I'm still doing something right? Everything's fine! But I'd literally sit there scrubbing at the floors while crying about the fact that I knew once I was done I'd have to do more work. I kept noticing/thinking about more things that I HAVE to do because there's no way I can POSSIBLY do school work when there's so much cleaning I have to do. I was starting to just reclean everything anxiously. One day my fiance finally asked me if I was okay because I woke up at 1 and immediately started cleaning. He pointed out that I just seemed like....a nervous wreck. I ended up breaking down then spent the rest of the week in a depressive state just not doing anything at all. That one week literally almost cost me my grade for the semester of one of my mandatory classes for graduation. \n\nI think we all try to deal with this stress and normally college students can drink or party or hang out with friends but it's different when youre literally either doing work or thinking about doing work and nothing else. It sucks ass. I wish I had better advice for you but I'm still a mess. Honestly all I can really say is try to schedule in time to have snacks during the day. Don't have to commit to an entire meal but try to eat regularly. It might actually help you focus more. The mind doesn't do well when your body is being ignored, ya feel me? I hope things get better. The semester is at least almost over",
      "author": "vness1213",
      "created": 1614899367,
      "upvotes": 12,
      "replies": {}
    },
    "gppjvv6": {
      "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gppjvv6/",
      "text": "Look into shrooms one trip does wonders for the mental health. Granted im still swamped with work but I feel way less shitter about doing it and I'm much more motivated now!",
      "author": "im_tired19",
      "created": 1614898415,
      "upvotes": 6,
      "replies": {
        "gpq1c4n": {
          "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gpq1c4n/",
          "text": "Don’t know why you got downvoted on this. Seems ppl instantly run off when they hear shrooms like it’s just a “drug” when it’s completely natural and part of our ancestry and relationship with nature. You would know the difference if you just gave it a shot, it feels more like a release or as you said a reset and you can actually feel your body become in tune with what really matters. \n\nI recently crashed just last week from the overload of coursework and went into panic mode. My solution was to take the shrooms I had stored for months waiting for a reset. The next day I instantly felt like I regained focus, I was able to look inside and stop being so damn hard on myself. I also realized what I was desperately needing was connection and went on to catch up with family and friends. Me and my live in partner took them together as well and had been non stop fighting for weeks as we are both in school and working. \nWe didn’t even need to say anything about our experience but we both knew afterwards that we really just needed to be freaking nicer to each other. Simple. It’s like I was becoming so disconnected I forgot how to empathize. \n\nThere’s even a podcast out there I can’t remember exactly just now, but it’s about the recent trend of big CEO’s and tech giants microdosing on the daily where before they were taking proscription “drugs” for depression, anxiety, stress, and even stimulants. Sometimes you just have to step outside of your own mind. Should look into it if you find it. Great stuff",
          "author": "DucTape696",
          "created": 1614907257,
          "upvotes": 7,
          "replies": {
            "gpq40q0": {
              "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gpq40q0/",
              "text": "Thank you for also sharing a positive perspective on psilocybin! Unfortunately our society is set up in a way that's more harmful to our wellbeing, then helpful. \nLike you said we end up being harsh towards ourselves and those around us. It's amazing how shrooms resets our mindset, promoting empathy and connection. I hope more people are open to using it as it's becoming more common in modern medicine. Especially now as we're facing a mental health crisis with the pandemic.",
              "author": "im_tired19",
              "created": 1614908647,
              "upvotes": 4,
              "replies": {
                "gpq5hrb": {
                  "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gpq5hrb/",
                  "text": "I appreciate you!! Don’t know if you have ever seen true detective (amazing show btw) but there’s a quote at the very end that I just thought of after your response. As you said sometimes it can feel like a question with no answer, society can be selfish at times, or even cold. With that no sign of peace. But this quote by the main character Russ stuck with me, about light and dark, humanities war from the dawn of time...\n\n“There was a moment, I know, when I was under in the dark, that something… whatever I’d been reduced to, not even consciousness, just a vague awareness in the dark. I could feel my definitions fading. And beneath that darkness there was another kind—it was deeper—warm, like a substance. I could feel man, I knew, I knew my daughter waited for me, there. So clear. I could feel her. I could feel … I could feel the peace of my Pop, too. It was like I was part of everything that I have ever loved, and we were all, the three of us, just fading out. And all I had to do was let go, man. And I did. I said, ‘Darkness, yeah.’ and I disappeared. But I could still feel her love there. Even more than before. Nothing. Nothing but that love. And then I woke up.”\n\nRust: “I tell you Marty I been up in that room looking out those windows every night here just thinking, it’s just one story. The oldest.”\n\nMarty: “What’s that?”\n\nRust: “Light versus dark.”\n\nMarty: “Well, I know we ain’t in Alaska, but it appears to me that the dark has a lot more territory.”\n\nRust: “Yeah, you’re right about that.”\n\n\nRust: “You’re looking at it wrong, the sky thing.”\n\nMarty: “How’s that?”\n\nRust: “Well, once there was only dark. You ask me, the light’s winning.”\n\n\nWe’re just punching holes of light one shine at a time man. Keep on lighting the world. Much love \n\n(Sorry for long post, this writer Nic Pizzolatto just needs to be heard)",
                  "author": "DucTape696",
                  "created": 1614909421,
                  "upvotes": 3,
                  "replies": {
                    "gpqn6oq": {
                      "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gpqn6oq/",
                      "text": "Aw I haven't been told that in awhile thanks, I appreciate you too 🥺 I also haven't watched it yet, but I recently got hbo so I definitely will. I really like the excerpt you shared! I've heard of accounts similar to that one of people experiencing a oneness with the universe and the people in it. It seems like a very beautiful experience that I hope to have someday. The passage reminds me a lot of the song by Childish Gambino called \"flight of the navigator\".   it actually is probably the closest song equivalent to this scene actually! \n\nIf you aren't familiar with the album \"Because the Internet\" I highly recommend you check it out. There's a screenplay that's actually meant to go along as you listen. It makes so much more sense with that and some of the other supplements Gambino used to create this world. \n\nEssentially there's a character named \"the boy\", who's aimlessly living a life full of drugs and partying.  He has an existential crisis and the rest of the story follows his attempts to find meaning in his life, and the world around him. There's a podcast called dissect, that dives into and decodes the meaning behind the album and it's themes involved. I'm fairly young so when I found  this album in 2013, I had no idea the impact it would have on my worldview. That's one of the reasons why it's my favorite album. I'll link it for you because I think you would enjoy some of the songs and especially the message. \n\nI'm glad I got to have a nice moment of connection with you on here! Here's to spreading the light, much love :)\n\nhttps://open.spotify.com/track/5k8eNtmqlKe21qjIFIp1Du?si=eJz3Ib_uR1OF3VPZkL5T9g&utm_source=copy-link\n\nhttps://open.spotify.com/show/2b025hq3gJ17tQdxS3aV43?si=DcNVILQARx-0NMbvGvdjGQ&utm_source=copy-link",
                      "author": "im_tired19",
                      "created": 1614919200,
                      "upvotes": 1,
                      "replies": {
                        "gqadt3i": {
                          "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gqadt3i/",
                          "text": "I feel very uninformed! I thought childish gambino spit some mad knowledge but did not know there was a freaking screenplay to go along with “because the internet”?! I will definitely be checking this one out. Don’t know if you like Kendrick but he’s kind of up there for me on insights into the human psyche and the current society we live in. \nKind of scary how you described “the boy” in that I myself am in a current existential crises. Yikes. I feel like everything up to this point in my life is already laid out for me and there are only so many options or roads left to travel...if you get my drift. \nThank you for your kind words. Kindred souls it feels like. Feel free to dm anytime. We will meet again ;)\n\nOh also...your username is too relatable. Stop it",
                          "author": "DucTape696",
                          "created": 1615259454,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gppd4yv": {
      "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gppd4yv/",
      "text": "You can drive a car for quite a long time without maintenance, but at a certain point, things WILL start breaking down. Whether it's an oil filter clogging up cuz you haven't changed it, tires losing their grip on the road, or spark plugs not firing correctly, things will inevitably deteriorate. After a certain point if you keep neglecting those things driving that vehicle becomes dangerous-- best case scenario your car won't start one day, worst-case scenario you become a danger to yourself and others on the road.\n\nIf you make a point to keep up with scheduled maintenance you can drive that same care for much, much longer. Instead of a year or so, you could theoretically drive the same vehicle for 20+ years.\n\nThat's how you need to think of things. College is a marathon, not a sprint. You HAVE TO make self-care a priority. I know that when you're terribly busy self-care can seem like an inconvenience, but if you make a point to at least do the minimum, I promise you'll begin to notice that the quality of your performance will also improve.\n\nFood, drinking enough water, getting enough sleep, getting some exercise. All those things are great mini-breaks in your study routine that your body actually needs. Even taking a long shower when you're a bit overwhelmed with coursework can really revitalize you.\n\nIf you're as busy as you've suggested I'm sure by now you've crashed due to exhaustion at least once. Here's the thing tho... exhaustion is cumulative. If you keep doing that to yourself your body (and performance) will inevitably suffer. Again-- think car maintenance.\n\nI know that this already a lengthy post but here are a few applicable suggestions on how you can spend less time doing the things I've mentioned throughout the workweek:\n\nFOOOOD:- Breakfast is usually the fastest thing to fix. Eggs and toast, oatmeal and fruit, bagel with cream cheese-- all things you can make in under 10 minutes.- Lunch I highly recommend you meal prep on the weekend. It seems daunting at first but its not hard. Rice-cooker and an oven and you're done in 2 hours.- Dinner you can meal prep too, but I'd just cook it fresh every night. Not sure if you enjoy cooking. But it really can be a creative outlet, and a welcome break from the books. The more you cook the quicker you'll be at it and its really a worth while skill to learn.- If you have a cafeteria in your university then things are much simpler.\n\nWATER:- Get reusable bottle of water. Highly recommend you get nothing smaller than a liter. I have a Nalgene bottle that takes about 1liter max and I just make a point to drink that about 3 times a day.- If water is too plain or whatever you add some kind of water flavoring like MiO.\n\nSLEEEEEEP!- You've gotta put a hard stop to the work and get to bed. Its often better to get some rest when you notice that your performance is going down due to exhaustion so that you can wake up super early and do the work.- Regardless of what you choose to do, make sure you're getting at least 6 hours of sleep a night. That's still less than the recommended 7-8 but it should be enough to keep you going at a good level.\n\nWORK-OUT:- No idea what you do to work out if even if you do a workout, but even a quick walk around the neighborhood can be beneficial if you don't currently workout often. If you already are working out often, don't stop. You need that to maintain sanity.\n\nLastly, I want to say that's very important to have a support network you can turn to when you're feeling overwhelmed. It could be friends, family, or even fellow students that are likely having very similar experiences. Just someone that you can shoot the shit with to get your mind off things makes a huge difference.\n\n&#x200B;\n\nTL;DR-- You have to make self-care a priority if you want to finish the marathon that is college. You got this!!",
      "author": "Resco809",
      "created": 1614895276,
      "upvotes": 44,
      "replies": {}
    },
    "gpp80sf": {
      "link": "/r/CollegeRant/comments/lxs5kb/ive_developed_unhealthy_coping_mechanism/gpp80sf/",
      "text": "Hi friend, from someone who used to be anorexic and who used to have the same bad habit as you- i think what you should do is schedule a time everyday to make a meal or to at least eat a snack. This makes it routine and you can count on it everyday, like I would always plan on eating dinner around 6 and whatnot and set aside half an hour to prepare food or go to a dining hall. But you can NEVER make excuses for this time. I would always say i’m too busy to eat and to just take care of myself, but would just end up feeling worse. That’s what helped me at least, but everyone is different :) i hope things get better!",
      "author": "olivia_ruffy",
      "created": 1614893026,
      "upvotes": 61,
      "replies": {}
    }
  },
  "updated": 1634064414
}