{"sid": "omkpb1", "link": "/r/CollegeRant/comments/omkpb1/how_to_survive_a_summer_class_that_i_hate/", "title:": "How to survive a summer class that I hate?", "text": "So I’m taking two summer classes this year. Just finished biology 2 online course last week, it was great. Like the material and the prof, and got good grades. No complaints there. BUT NOW I am taking general chemistry 2. I tried to take it spring 2020 but dropped it when we got sent home for covid. Except now I have to take it again over the summer because it’s a requirement. I HATE chemistry. I already failed the first quiz and I have no idea how I can get at least a C in the class so it’ll count as credit. I’ll be so mad if this ends up being a waste of money and time. It’s just misery in every sense of the word for the next month for me. I’m trying my best but I don’t know if I can do this.", "author": "toastedmeat_", "created": 1626587465, "retrieved": 1632841759, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"h5lmvqq": {"link": "/r/CollegeRant/comments/omkpb1/how_to_survive_a_summer_class_that_i_hate/h5lmvqq/", "text": "Thank you u/toastedmeat_ for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1626587465, "upvotes": 1}, "h5r9r7r": {"link": "/r/CollegeRant/comments/omkpb1/how_to_survive_a_summer_class_that_i_hate/h5r9r7r/", "text": "Gen chem 2 was a CHORE but I pulled an A out my ass near the end. I thought it was harder then 1 due to how much more math intensive it is. I can’t imagine taking it during summer instead of the normal 16 weeks. Organic chemistry tutor has amazing videos on Gen chem 2. You can do this!! That class is a hell of a chore and I had to study hours upon hours to figure it out. Also most Gen Chems end with nuclear chemistry and that is probably the easiest chem unit you’ll ever take unless you’re taking Ochem. Without nuclear chem at the end I probably would have gotten a B. Good luck!", "author": "ttyltyler", "created": 1626705730, "upvotes": 1}, "h5m3uie": {"link": "/r/CollegeRant/comments/omkpb1/how_to_survive_a_summer_class_that_i_hate/h5m3uie/", "text": "I had to take chem 1 in 6 weeks over the summer and it sucked ass. I was in class 4 hours every day. If you’re in in-person classes, just ask the prof for help and they’ll be partial to kick your grade up a little, just trust me on that", "author": "newmuffins1216", "created": 1626601310, "upvotes": 1}}}