{
  "sid": "qumtu2",
  "link": "/r/CollegeRant/comments/qumtu2/what_is_the_what_if_score_on_canvas/",
  "title:": "What is the what if score on Canvas?",
  "text": "So my university is pretty new to using canvas. I didn’t notice the what if score button till now scrolling on my phone. I was checking for a class where I have only one assignment left worth 120, my final project. And when I clicked the button it lowered my 92 of the class to an 80. So does it calculate if you miss an assignment?? Really curious about this, been very anxious considering this is my last semester and I don’t want to mess up. While I obviously plan to do my final, I get these very anxiety inducing thought every time I do an assignment that I’m gonna fail. I wanna do my best with this coming assignment, but to know I’ll pass even if it isn’t as great, is a bit of a relief, so I’m just curious if these scores are accurate or not. There’s also an assignment worth 50 points that I submitted but has not been graded yet so idk if the score takes that into consideration.",
  "author": "Inevitable-Tomato-81",
  "created": 1637000591,
  "updated": 1637182197,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hkr0cg2": {
      "link": "/r/CollegeRant/comments/qumtu2/what_is_the_what_if_score_on_canvas/hkr0cg2/",
      "text": "The what if is pretty accurate but it depends on your grades tho. For example lets just say its near the end of the semester and you have these assignments left\n\n&#x200B;\n\nDiscussion post 5 -/5\n\nQuiz 7 -/30\n\nTest 3 -/100\n\nFinal 90/100\n\n&#x200B;\n\nIf you only put in a hypothethical score for the final then it won't be accurate because you didn't put in anything for the 3 assignments due before that. When you take your final you are already going to have assignments that could lower or raise your score before the final so the overall grade would not be accurate. If you are anticipating that you can ace every final assignment before the final then you can this\n\n&#x200B;\n\nDiscussion post 5 5/5\n\nQuiz 7 95/100\n\nTest 3 85/100\n\nFinal 90/100\n\nThis is better because doing well on the last couple of assigments mean that you don't need to have such a high final exam grade to get a certain grade level in the class. If you don't put in those last grades then canvas may say you need at least a 97 on the final to have an A in the class. But if you put in those grades then you may only need like a 89 to have an A in the class. \n\n&#x200B;\n\nMy friends and I love this function because during exam week we would walk around saying stuff like \"OHOHOHO wE oNLY nEED a 52 oN tHe FinAL tO HaVE An A iN tHE cLAsS",
      "author": "TheRapidTrailblazer",
      "created": 1637001154,
      "upvotes": 3,
      "replies": {}
    }
  }
}