{"sid": "medxe9", "link": "/r/CollegeRant/comments/medxe9/use_your_equation_sheet_jeezus/", "title:": "Use your equation sheet, jeezus", "text": "I've been tutoring for a little bit now (engineering). The top behavior I see in the students earning the lowest grades is ignoring the tools they're given. I'm talking about not using a calculator, ruler, equations sheet, or book. Or not talking to anyone where collaboration is encouraged or when you're allowed to use a program like excel or something to help. Coming to tutoring is a good step, at least. This type of student is usually surprised when I pull out my binder, laptop, whatever. I've been asked if I remember everything from my old class. No! But I know when and what to look up when I need it.\n\nI've heard too many people say \"but I don't want to use the equation/reference sheet\" or \"I want to do this (insanely long problem) by hand and no other way\" and proceed to do something that wasn't even taught in the class.\n\nI don't really think it's an ego thing, but a general misunderstanding of what makes the good students, good students. There seems to be this idea that good students have super-brain, photogenic memories, never need help, and do things in a special way. In reality, they're the people who know how to use their resources and work with others. \n\nIf you legitimately don't need the tools because you've done something so many times, that's cool, but in college, a proffesor will make an exam expecting students to use what was given.\n\n**TL:DR**  In the real world professionals double-check their stuff. There's no secret level you unlock by doing everything from memory.", "author": "odgoodli", "created": 1616852181, "retrieved": 1632951402, "over_18": false, "upvotes": 49, "upvote_ratio": 1.0, "comments": {"gsh9g3c": {"link": "/r/CollegeRant/comments/medxe9/use_your_equation_sheet_jeezus/gsh9g3c/", "text": "I’m an accounting major and excel is my best friend for most classes. At my college they even offer excel classes to learn new things and tools to use to solve problems. Some students hate the class and never use excel to their advantage. It’s sad but it’s also their own fault.", "author": "worlds_away_", "created": 1616866068, "upvotes": 9}, "gsgafpx": {"link": "/r/CollegeRant/comments/medxe9/use_your_equation_sheet_jeezus/gsgafpx/", "text": "This made me chuckle. I’m dating an engineer who just graduated with his masters in construction management. He literally has on hand at all times a tape measure and a calculator. This man has broken these guys out to try and win arguments with me!! Additionally, he makes excel sheets for his hobby games. God I love him 😂\n\nAnyways, he thinks that school has nothing to do with memorization anymore, it’s all about your ability to locate and utilize resources. All this to say you’re not alone!", "author": "ta2confess", "created": 1616854921, "upvotes": 23}}}