{
  "sid": "q3ljxv",
  "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/",
  "title:": "I have no talents for a job but I can’t handle college",
  "text": "I’m going to have to withdraw from/drop out of college (for the second time) and I have nothing I’m good at in life. I used to think I was good at school (this was in high school), but then I got to college. I’m very severely mentally ill and even just sitting down to do my homework triggers tears for me to the point where I call my mom sobbing. If I stay I’m failing out. Might have to live with my parents for the rest of my life /srs",
  "author": "iamhonestlysolost",
  "created": 1633649859,
  "updated": 1634093825,
  "over_18": false,
  "upvotes": 93,
  "upvote_ratio": 0.98,
  "comments": {
    "hfterem": {
      "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfterem/",
      "text": "I totally feel that. College is not your only option and college isn’t for everyone. My brother and several friends have all taken different paths other than college. One went to a trade school and now makes more money than some college graduates. One got a fantastic internship and now has their dream job. \n\nThere are other options and college just might not be the right one for you. Do what is best for you! Go at your own pace, maybe in a few years college could be for you, if that is what you want. Life is not a race or a competition, just be the best you, whatever that is! Everyone has a purpose in life! Even if it is just the little things, like making someone else smile, or showing your mom that you love them. \n\nNow you mentioning that you have no talents. I highly highly doubt that is true. Everyone can learn something if you practice enough and everyone has a talent. You could learn guitar and become some famous musician! No college degree necessary lol. You can turn a favorite hobby into a career. \n\nThere are so many jobs out there that people never even realized were jobs. Maybe do some research and see what could fit you well. I wish you all the best and stop being so hard on yourself, you are fantastic!",
      "author": "layne26",
      "created": 1633666224,
      "upvotes": 26,
      "replies": {
        "hfto5va": {
          "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfto5va/",
          "text": "I’m not OP, but..... thank you.",
          "author": "purplepinkpurple",
          "created": 1633672621,
          "upvotes": 18,
          "replies": {}
        },
        "hfuu89b": {
          "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfuu89b/",
          "text": "Thanks, this was so kind and thoughtful and made my day :) I hope there’s something out there for me, even if college is too stressful for someone like me",
          "author": "iamhonestlysolost",
          "created": 1633702487,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hft3g3h": {
      "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hft3g3h/",
      "text": "Have you considered a trade school?",
      "author": "wallace1313525",
      "created": 1633660166,
      "upvotes": 19,
      "replies": {
        "hfutswe": {
          "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfutswe/",
          "text": "Could be a possibility",
          "author": "iamhonestlysolost",
          "created": 1633702295,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfts3nk": {
      "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfts3nk/",
      "text": "Not sure if this helps but you were me last year and man let me tell you, anti-anxiety meds really helped. Plus to be quite honest, dropping a class and a little extra time management really went a long way. I'm by no means smart at all but I'm getting by. What did me wonders when trying to figure shit out was just attending a community college and getting gen ed credits out of the way while working. It helped keep my parents of my butt while giving me some space to figure shit out in my head. \n\n&#x200B;\n\nWhat you're going through is rough but not the end of the world, just remember you're gonna get through this fam and many people have gone through this before. We all get burnt out and have our breaking points, nothing to be ashamed of homie :) I wish you the best of luck fr",
      "author": "AverageGuy16",
      "created": 1633675690,
      "upvotes": 10,
      "replies": {
        "hfuuece": {
          "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfuuece/",
          "text": "Thanks for all this, it really helped! Wish you the best of luck as well!",
          "author": "iamhonestlysolost",
          "created": 1633702564,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfy87he": {
      "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfy87he/",
      "text": "Real talk. get a “menial” job, as an office assistant or something. Doing so restores some dignity in my life and helped me feel less anxious about job prospects post college. If you are lost then get a task oriented job, it’ll help you slowly restore confidence in yourself and give you some experience   as you try to heal your mental health",
      "author": "Visible_Negotiation4",
      "created": 1633758984,
      "upvotes": 3,
      "replies": {
        "hfzquc6": {
          "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfzquc6/",
          "text": "That sounds like a good idea, thanks :)",
          "author": "iamhonestlysolost",
          "created": 1633794385,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfsqmd3": {
      "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfsqmd3/",
      "text": "What's your mental illness, if I may ask?",
      "author": "Orion_greed",
      "created": 1633653920,
      "upvotes": 7,
      "replies": {
        "hfutqsl": {
          "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfutqsl/",
          "text": "Severe depression, severe anxiety, ocd, panic disorder, BPD, among others",
          "author": "iamhonestlysolost",
          "created": 1633702268,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hft4o96": {
      "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hft4o96/",
      "text": "I believe you have a purpose you just have to persevere buddy. God made you with a purpose, if that's not enough look you came back to college continue to push forward it's going to be hard but this is a part of life this summer the FBI is offering a summer internship maybe you might want to apply.  I sometimes feel dejected sometimes but you have to remember all the people who struggled in college and got through it and became successful but college is not all ok so do not overwhelm yourself, buddy.",
      "author": "Jaden0205",
      "created": 1633660761,
      "upvotes": 6,
      "replies": {
        "hfu2xab": {
          "link": "/r/CollegeRant/comments/q3ljxv/i_have_no_talents_for_a_job_but_i_cant_handle/hfu2xab/",
          "text": "Abort Christ",
          "author": "yeTaughtMe2",
          "created": 1633685357,
          "upvotes": -1,
          "replies": {}
        }
      }
    }
  }
}