{
  "sid": "qckkj7",
  "link": "/r/CollegeRant/comments/qckkj7/i_despise_dorm_showers/",
  "title:": "I despise dorm showers",
  "text": "I'm a freshman, and while I feel like I'm doing alright with actual classwork and stuff, one of my biggest challenges has been taking showers frequently. I knew dorm showers would be an adjustment, but more and more I find myself just absolutely hating them, to the point of causing me anxiety. I've always been a private and fairly clean person, though not to an extreme level, but I just can't bring myself to feel comfortable in a dorm shower. Between the lack of privacy and the fact that my hallmates always leave everything very messy, I just can't do it. I know this is something that shouldn't be this big a problem and I should just get over it, but I've reached the point where I've had shower related panic attacks and I just don't know what to do.",
  "author": "RoboNarples29",
  "created": 1634794383,
  "updated": 1634849393,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.88,
  "comments": {
    "hhhf5va": {
      "link": "/r/CollegeRant/comments/qckkj7/i_despise_dorm_showers/hhhf5va/",
      "text": "Yeah, panic attacks are not normal reactions to taking a shower and not bathing regularly can become a health issue. I’m sorry that you’re struggling with that. \n\nDorm showers are disgusting and uncomfortable to everyone, but if you’re distressed enough that you’re not bathing enough or properly I would suggest talking to somebody in counseling. I don’t know for certain what accommodations they could make, if any - maybe you could be moved to a condo-style dormitory where you can have a more private shower or only share it with one other person instead of a whole freshman floor. \n\nI know some friends who got really bothered by the public showers thing and they would opt to take them at odd hours of the day to avoid interacting with a lot of other people. For example, the early afternoon between classes.",
      "author": "enbymoviescript",
      "created": 1634819626,
      "upvotes": 7,
      "replies": {}
    },
    "hhh1kbq": {
      "link": "/r/CollegeRant/comments/qckkj7/i_despise_dorm_showers/hhh1kbq/",
      "text": "Idk what to tell you because everyone's brain is differently wired. However, I was sort of in a similar situation where the restrooms and showers in my dorm were pretty nasty. It bothered me for a few months but got used to it for the rest of my four years.",
      "author": "updog_nothing_much",
      "created": 1634810177,
      "upvotes": 1,
      "replies": {}
    },
    "hhipvw4": {
      "link": "/r/CollegeRant/comments/qckkj7/i_despise_dorm_showers/hhipvw4/",
      "text": "Get some shower flip flops if you don’t have some.",
      "author": "GreyStomp",
      "created": 1634839897,
      "upvotes": 1,
      "replies": {}
    }
  }
}