{"sid": "nrhcsd", "link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/", "title:": "Do you also do reporting (teaching) of your lessons in class instead of your professors?", "text": "I don't know if it's just here, but when I entered college, half of our semester is taught by us students instead of our professors. Like, we're the ones who actually teach in class. It's actually the same when I was in high school. \n\nI'm just so sick of learning all these things by my own. Isn't it their job to teach, not ours? I shouldn't have enrolled if I'm just going to self-study. Sometimes I feel like I'm just forcing myself to do these tasks instead of actually learning lol. \n\nAside from this, it does not help that I really get anxious when I report my assigned topic. I really suck at public speaking. It takes me hours, maybe days, and a lot of preparation because of my anxiety.\n\nSo yeah. I'm curious, is this really normal? Does your college do this too? Is it different there? I just wanna move outside this country if I could only be that lucky. Maybe I could actually learn something if I did.", "author": "inconsistentdreamer", "created": 1622737178, "retrieved": 1632951580, "over_18": false, "upvotes": 32, "upvote_ratio": 0.78, "comments": {"h0jv107": {"link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0jv107/", "text": "you need to get good at public speaking--there is no avoiding it. \n\nyou will need to present at work--to clients, to coworkers, to trainees. try to get better at it so you can convince people to see things your way.", "author": "ObjectiveAnalysis643", "created": 1622802815, "upvotes": 6}, "h0h75up": {"link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0h75up/", "text": "Yes, it’s normal because it’s good pedagogy. Studies show that you retain knowledge more effectively when you’re ‘teaching’ it to someone else. This is because you first need to understand the topic and it’s implications, and then you need to understand it well enough to communicate it to others and answer their questions. \n\nCollege really is a lot of self study, partially because you’re in class so much less than you are in high school. Professors are there to guide your learning and keep you on track, but it’s your job to learn the material and be able to track your studies. \n\nFinally, it’s totally normal to be anxious to present! That doesn’t mean you’re any worse of a student than anyone else in the room. Even though it sucks, it does get less nerve wracking over time. Also, a lot of people aren’t great at public speaking, but if you continue to practice and get better it’ll make you look more competitive in the job market. \n\nGood luck!", "author": "HighlyPolitical16", "created": 1622748892, "upvotes": 28}, "h0h0ba3": {"link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0h0ba3/", "text": "Yea we did this for the entire semester with 2 of our classes", "author": "Anyaness", "created": 1622745974, "upvotes": 2}, "h0gzr8q": {"link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0gzr8q/", "text": "I remember in high school I was able to test out of classes, like Spanish, bc I already spoke the language. And didn’t have to spend entire semesters in a class I pretty much was fluent in. I wish they would practice that in college. Like let me test out subjects I’m just teaching myself since the professors clearly aren’t trying to teach.", "author": "Hawkbiitt", "created": 1622745742, "upvotes": 5}, "h0gzphu": {"link": "/r/CollegeRant/comments/nrhcsd/do_you_also_do_reporting_teaching_of_your_lessons/h0gzphu/", "text": "[deleted]", "author": null, "created": 1622745721, "upvotes": 1}}}