{
  "sid": "r0rp9k",
  "link": "/r/CollegeRant/comments/r0rp9k/the_truth_behind_rutgers_nursing/",
  "title:": "The truth behind Rutgers Nursing",
  "text": "I did not realize how messed up Nursing School is lol. Before admission, they were busy boasting about how great the program is and the high percentage of passing Nclex. However, I realized that so many students are being discouraged, dismissed, and looked down on. They have no empathy! We only get one opportunity to get a grade lower than a C+ (which they consider failing) and if we try to withdraw before we might get dismissed, they dismiss you anyways because you failed once; the program itself is so discouraging. Even though so many students are failing the class, they do nothing. It makes it feel like the professors, counselors, the dean are all in it together. The professors (not all) claim that they want all of us to succeed, but it seem like they do not care enough because they are so unapproachable. It is so sad to see so many people struggle mentally and giving up their dream because of this. If you guys want to apply to Rutgers Nursing, I suggest you to really read the policy because they’re not going to tell you beforehand 🤷🏻‍♀️",
  "author": "No-Efficiency2537",
  "created": 1637713950,
  "updated": 1638207548,
  "over_18": false,
  "upvotes": 19,
  "upvote_ratio": 0.91,
  "comments": {
    "hluy50j": {
      "link": "/r/CollegeRant/comments/r0rp9k/the_truth_behind_rutgers_nursing/hluy50j/",
      "text": "I think every nursing program is super impacted. At my university you take 2 years of \"pre-nursing\" then you apply to the actual nursing program. They only take 40 students at a time and you have to have a 4.0 GPA to get in. They literally won't accept less than perfect.\n\nI guess a plus is that career placement is 100% for nurses. (Edit to say at my campus, not in general for the whole country)",
      "author": "TheJaycobA",
      "created": 1637726440,
      "upvotes": 5,
      "replies": {}
    },
    "hlvhvpi": {
      "link": "/r/CollegeRant/comments/r0rp9k/the_truth_behind_rutgers_nursing/hlvhvpi/",
      "text": "The attitude issue is one of the reasons I left. The \"eat your young\" behavior is repulsive and the school/workplace is toxic AF. However that grading sounds pretty normal to me. We weren't allowed anything under a C under any condition. Kind of important when lives are on the line. (cheesy but true)",
      "author": "LenoraNoble",
      "created": 1637738117,
      "upvotes": 1,
      "replies": {}
    },
    "hlx6die": {
      "link": "/r/CollegeRant/comments/r0rp9k/the_truth_behind_rutgers_nursing/hlx6die/",
      "text": "Schools pull shit like this and wonder why we have a nursing shortage",
      "author": "TheRapidTrailblazer",
      "created": 1637773546,
      "upvotes": 1,
      "replies": {
        "hlyiqnw": {
          "link": "/r/CollegeRant/comments/r0rp9k/the_truth_behind_rutgers_nursing/hlyiqnw/",
          "text": "There are a lot of people attempting nursing degrees who don't have the fundamentals down and who are not prepared for the workload. It sounds bad to \"weed out\" 30% of students in a class... but if you have 30% of students who can't do basic math (mulitply by 10, for example), then they will not succeed in a nursing program.  It's better for them to exit earlier than later, after they've paid a lot of money.",
          "author": "thelyfeaquatic",
          "created": 1637792581,
          "upvotes": 3,
          "replies": {
            "hlzep9j": {
              "link": "/r/CollegeRant/comments/r0rp9k/the_truth_behind_rutgers_nursing/hlzep9j/",
              "text": "That I agree on but if 70% of the students are failing one class and no faculty is doing anything about it it’s a problem.",
              "author": "No-Efficiency2537",
              "created": 1637806750,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    }
  }
}