{"sid": "iupqb5", "link": "/r/CollegeRant/comments/iupqb5/how_the_fuck_does_someone_like_to_go_to_college/", "title:": "How the fuck does someone like to go to college!? - UPDATE", "text": "So I made it. I fucking survived what was literally the worst, most hellish part of my life. I FUCKING FINISHED MY MASTER'S! My thesis has been presented, I passed all the classes and I'm finally free from that goddamn shithole that I should've never put myself into...  \n\n\nAs for the job market? I started searching for a job 2 months after my thesis's presentation. I went through various tests and assessments and, as I saw many other people around me with better soft/technical skills, I thought to myself \"Well, you're done for, my man...\". BUT NO, I actually got the job and I'm currently in an intership at the company I applied for!  \n\n\nAt first I was extremely anxious because literally EVERYONE on my college told me that \"the job market is way more intense\", that \"if you can't handle it here, you won't last a week at your job\", AND, my personal favorite: \"in the job market no one's going to teach you anything\". This undoubtely filled me with anxiety, and I suffered a lot beforehand. But guess what:  \n\\- **THEY ACTUALLY FUCKING TEACH YOU STUFF, YOU JUST NEED TO ASK AND THEY'LL DELIBERATELY PROVIDE HELP**  \n\\- **PEOPLE ACTUALLY HAVE A STRONG WILL (AND LOVE TO) TEACH OTHER PEOPLE**\n\n  \nAlso, in the group of interns, we're **ALWAYS** hanging out and helping each other when need be!\n\nConclusion: I just wanted to give you guys an update on my current status, since my last post here caused quite a stir and loads of people actually related to it. Also, from my story I want you to understand that **THINGS CAN AND WILL GET BETTER ONCE YOU LEAVE THAT FUCKING SHITHOLE THAT YOU'RE IN! BE STRONG, COMRADES! IF I DID IT, SO WILL YOU!**\n\nOP:\nhttps://www.reddit.com/r/CollegeRant/comments/ghb1s0/how_the_fuck_does_someone_like_to_go_to_college/?utm_medium=android_app&utm_source=share", "author": null, "created": 1600368492, "retrieved": 1632843577, "over_18": false, "upvotes": 31, "upvote_ratio": 0.98, "comments": {"g5nzxr5": {"link": "/r/CollegeRant/comments/iupqb5/how_the_fuck_does_someone_like_to_go_to_college/g5nzxr5/", "text": "so, your college experience was positive and helped to prepare you  for the working world. What is your rant?", "author": null, "created": 1600398716, "upvotes": 1}, "g5mlkw3": {"link": "/r/CollegeRant/comments/iupqb5/how_the_fuck_does_someone_like_to_go_to_college/g5mlkw3/", "text": "Sounds like you had a shitty masters program. I'm glad you are in a better place now (rest in peace lol).\n\nI \\*really\\* enjoyed my masters program, but I had a very challenging phd program after that and it is worlds different. My current job has a good community more like my masters program. The people you are around make a big difference.", "author": "real-nobody", "created": 1600373891, "upvotes": 10}, "g5mh6tj": {"link": "/r/CollegeRant/comments/iupqb5/how_the_fuck_does_someone_like_to_go_to_college/g5mh6tj/", "text": "Where’s your original post?", "author": "devjohnson13", "created": 1600372285, "upvotes": 3}}}