{"sid": "o0kn79", "link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/", "title:": "I don't understand why there are majors that only prepare you for grad school and nothing else", "text": "By this, I mean very specific majors that are only intended for further education (ex. pre-med as a major, any pre-professional degree). I understand that some people might know exactly what they want to do, so getting a degree in, let's say, exercise science, might be a great path to grad school for PT. However, colleges do not make it clear enough that it puts you at a disadvantage if you decide not to go that route. They say, \"oh, it's versatile! you can get any job!\" Sure, but it'll be more difficult than someone who studied IT or business. People say that college is to prepare you for a job, but then others say it's to learn, grow, and explore your interests. Which is it, then?! If it's the latter, any degree would be fine...but then, jobs shouldn't require specific degrees if they're just going to teach you everything on the job, anyways.\n\nI'm not knocking the importance of the subjects. Every college major is important and worthy of being studied, in my opinion. But it frustrates me that professors and faculty do not properly guide students within pre-professional majors. I wish that these fields of study were offered only as leveling courses or as 3 year grad programs (if needed) so that people wouldn't get stuck with a degree that is intended as a stepping-stone and have no other option but to fight like hell for a job or go to grad school.\n\n\\*speaking from personal experience of people I know who are stuck in limbo due to not getting into grad school or changing their mind and feeling regretful. ", "author": "itllwashaway", "created": 1623780460, "retrieved": 1632842222, "over_18": false, "upvotes": 37, "upvote_ratio": 0.93, "comments": {"h1vi8dl": {"link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1vi8dl/", "text": "Thank you u/itllwashaway for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1623780460, "upvotes": 1}, "h1wd52h": {"link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1wd52h/", "text": "Colleges are for profit businesses. they will find any way possible to squeeze as much money out of you as they can.", "author": "2valve", "created": 1623794016, "upvotes": 2}, "h1vrb8n": {"link": "/r/CollegeRant/comments/o0kn79/i_dont_understand_why_there_are_majors_that_only/h1vrb8n/", "text": "Meeting \"Consumer demand\" pretty much. There's a certain type of student who only gives a shit about getting into med school or law school or what have you, and has no interest in actually studying a real undergrad degree. \n\n> However, colleges do not make it clear enough that it puts you at a disadvantage if you decide not to go that route. They say, \"oh, it's versatile! you can get any job!\"\n\nDo they really say that? I mean, sure they may want to play up the other fields you can go into to assuage doubt, but face it, if you're studying something that only covers the prereqs for something else, and you don't get into that something else, expecting what you did for an undergrad degree to be all that useful is just foolish.\n\nPersonally, I think this is a problem created by the law schools and the medical schools admissions processes. They should be more highly rating people who took actual degrees than those who did these fake pre-req degrees.", "author": "BarackTrudeau", "created": 1623784352, "upvotes": 5}}}