{
  "sid": "n9e95b",
  "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/",
  "title:": "PowerPoint slides are NOT a LECTURE",
  "text": "I'm sick of professors putting zero work into their online courses. Powerpoint slides are not a lecture and I hate that so many professors refer to them as that. You can't even record a lecture for each unit and repost it every semester? All I get is powerpoint slides? I'm better off just reading the textbook cover to cover and taking my own notes. And at that point, I'm just teaching myself. Why do I even need to be in a class if everything I need to know can be learned from reading the book?",
  "author": "Greeneyesablaze",
  "created": 1620676151,
  "over_18": false,
  "upvotes": 338,
  "upvote_ratio": 0.99,
  "comments": {
    "gxter0m": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxter0m/",
      "text": "One of my classes last semester was just \"read chapter x-y and take a brief quiz.\" Even the \"final\" was really just a slightly longer quiz.",
      "author": "tyttuutface",
      "created": 1620792783,
      "upvotes": 1,
      "replies": {}
    },
    "gxrfh74": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxrfh74/",
      "text": "I guess I should have specified \"online-only courses.\" I'm talking about professors of classes that don't offer the option of attending in person who only post a PowerPoint  attachment and call that a lecture.\n\nHowever, professors who stand at the front and just read the bullet points on the slides are just as terrible and attendance should definitely not be expected or required if that's all they're going to do.",
      "author": "Greeneyesablaze",
      "created": 1620758908,
      "upvotes": 1,
      "replies": {}
    },
    "gxr0dmv": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxr0dmv/",
      "text": "What i hate the most about this kind of \"teaching\" lmao, its that my profs dont give time to even copy a little bit of the slides, they just talk and talk and talk, and swipe slide, so all i can do is wait till my profs upload the slides, and then the worst thing is that they take up to 3 days to do it. theeeen in top of that im currently taking 6 different subjects, and in every single one of them its the same stuff. sometimes i spend all day trying to catch up but its impossible.",
      "author": "roseekilljoy",
      "created": 1620752735,
      "upvotes": 3,
      "replies": {}
    },
    "gxqgv40": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxqgv40/",
      "text": "If you think that’s fun, all my classes this semester are like this (IT major). Best part is that  all my required classes are fully online next semester. 🙃",
      "author": "QuickCoyote097",
      "created": 1620744574,
      "upvotes": 1,
      "replies": {}
    },
    "gxqgsgx": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxqgsgx/",
      "text": "One of my professors this past semester would just read off the slides, not add anything, and say that is his lecture. He would also count attendance for these \"lectures\", pointless. I can read on my own time.",
      "author": "hexgirll",
      "created": 1620744543,
      "upvotes": 2,
      "replies": {
        "gxrcvw3": {
          "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxrcvw3/",
          "text": "Yeah, that's another thing, and it's just as bad as not giving your online course any sort of lecture. \n\nThere are a couple online-only profs who do this too. They actually put in the effort to record a video, and then they just read the slide bullet points. :|",
          "author": "Greeneyesablaze",
          "created": 1620757846,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gxpv62s": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxpv62s/",
      "text": "Tooting my own horn here. I'm a professor.\n\nI made about something like 70 hours of fully edited video lectures with motion graphics, photoshops, all the works for my students. I know not all faculty have that ability (I'm in media studies/comm and have a background in content production), BUT I found it really distasteful that so many educators in higher ed. literally just posted PP slides and thought that was sufficient.\n\nHere are a couple of videos. I'm honestly proud of them. It took a lot of time and effort.\n\n[What is Ideology](https://youtu.be/MhTko9cH2XA)\n\n[Primer on Marxism](https://youtu.be/acneovTr2BU)\n\n[How to Make Memes 3 Ways (assignment instructions)](https://youtu.be/_kv2c80Nqzs)",
      "author": "Mtt76812",
      "created": 1620733635,
      "upvotes": 8,
      "replies": {
        "gxqierx": {
          "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxqierx/",
          "text": "You know what's really distasteful? Professors imbedding videos in .ppt, and setting the slides to go forward regardless of the video finishing or being paused...  then making students download those 1-3 Gb files. Not only can we not pause, rewind, or take a break  during that 90 minute crap fest. We also cannot use our computer, cast to a screen, or take notes while it's going. I ended up having to buy a 12 foot HDMI so I could add a screen to watch on my TV while note taking. Guess what! That fat file was consuming my (gaming) laptop's horse power and the lag would cause the power point to close. Oh, and test questions would be stuff like \"in lecture 9 I described a person with dementia, what color was his jacket?\". So, if you get bored and want to create a lecture for lecturers on how to not be slugs, I'd be glad to share it.",
          "author": "SemanticBattle",
          "created": 1620745233,
          "upvotes": 6,
          "replies": {
            "gxqiy42": {
              "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxqiy42/",
              "text": "I've actually made a few and shared them on r/professors. I submitted my final grades a day or so ago, so I now have a bit of free time. I was going to make another video re: how to make better/more engaging online content. \n\nNot sure it will do any good, but maybe.",
              "author": "Mtt76812",
              "created": 1620745463,
              "upvotes": 3,
              "replies": {
                "gxqiz68": {
                  "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxqiz68/",
                  "text": "Here's a sneak peek of /r/Professors using the [top posts](https://np.reddit.com/r/Professors/top/?sort=top&t=year) of the year!\n\n\\#1: [An email I got from a student](https://i.redd.it/dba60mmui2161.png) | [206 comments](https://np.reddit.com/r/Professors/comments/jzsf4r/an_email_i_got_from_a_student/)  \n\\#2: [They're playing hard to get](https://i.redd.it/c7f4iz1q9p651.jpg) | [48 comments](https://np.reddit.com/r/Professors/comments/hejoew/theyre_playing_hard_to_get/)  \n\\#3: [I'm so happy](https://i.redd.it/hvospic4zwi51.jpg) | [80 comments](https://np.reddit.com/r/Professors/comments/ifle8r/im_so_happy/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/joo7mb/blacklist_viii/)",
                  "author": "sneakpeekbot",
                  "created": 1620745475,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gxr9qn0": {
              "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxr9qn0/",
              "text": "Dropped a class that had powerpoint lectures kind of like this. I don't have the patience to listen to lectures where I can neither forward/rewind, play at 2x speed, or even know how much of the lecture is left. \n\nIt's an elective that I do really want to take, but I knew if I took the class in this format I'd skip over most of the audio for the lectures.",
              "author": "symmetrical_kettle",
              "created": 1620756550,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gxrcjfa": {
          "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxrcjfa/",
          "text": "I have had **one** professor like you! He put all of his lectures onto a public Youtube channel as well, so that anyone could study any of the subjects that he taught, for free. He made microbiology insanely interesting. \n\nI appreciate these efforts so very much.",
          "author": "Greeneyesablaze",
          "created": 1620757705,
          "upvotes": 4,
          "replies": {
            "gxrsbhw": {
              "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxrsbhw/",
              "text": "Thank you. Do you happen to have a link to said channel/content? Wouldn’t mind watching/learning/gleaning ideas.",
              "author": "Mtt76812",
              "created": 1620764180,
              "upvotes": 3,
              "replies": {
                "gxt16mc": {
                  "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxt16mc/",
                  "text": "Yeah definitely!\n[Here’s his channel ](https://youtube.com/c/GrowGrayMatter)",
                  "author": "Greeneyesablaze",
                  "created": 1620785266,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gxojv3e": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxojv3e/",
      "text": "Atleast you get the damn slides. My Mathematical Physics prof. doesn't even share the slides and his (read: excuses) reasons are stupid as well.\n(And screen captures are hard to organize, ughhh)",
      "author": "topQuark24",
      "created": 1620697996,
      "upvotes": 3,
      "replies": {}
    },
    "gxoe5gb": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxoe5gb/",
      "text": "According to my professors, the PowerPoint slides will have most of what I need to know to pass the exams. However, I also need to go to the lectures because the rest will be taught in person. So if you miss the lecture, you miss a crucial 1/3 of the needed info, even though the slides are online.\n\nAnd they weren't joking. There are slides that have nothing on it. Just a question with an empty space.",
      "author": "HJSDGCE",
      "created": 1620695053,
      "upvotes": 8,
      "replies": {
        "gxorp3d": {
          "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxorp3d/",
          "text": "Honestly, this is somewhat amusing. OP is ranting about how the a lecture should expand upon the material in the slide deck, and you're here complaining that your professors are doing just that.\n\nYes, you need to go to the lectures, so they can do things like go over examples  explaining as they go. THat's the point of having classes. Otherwise what's the point, just read the textbook instead?",
          "author": "BarackTrudeau",
          "created": 1620702246,
          "upvotes": 15,
          "replies": {}
        },
        "gxok8ye": {
          "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxok8ye/",
          "text": "It's so sad that I'm laughing. Just a question?🥺😂",
          "author": "topQuark24",
          "created": 1620698197,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "gxocewx": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxocewx/",
      "text": "Even if they draw on it it still isn’t enough. Especially in the more abstract the concepts get. Like seriously, learning a portion of electrical engineering via a 10 minute PowerPoint is just….ugh",
      "author": "Romano16",
      "created": 1620694151,
      "upvotes": 5,
      "replies": {}
    },
    "gxoc166": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxoc166/",
      "text": "I had a professor that did PowerPoint slides and I didn’t have an issue with it. I prefer having information to look at during lectures, especially if you compare it to professors that don’t give you anything to look at, sometimes not even their faces if they decide not to turn the camera on, and just talk about whatever topic that lecture is on. \n\nAlso, the thing with recording is that people that do online on a schedule have to physically be logged into the class. The professor doesn’t have to record it necessarily unless they’re nice enough to or if someone had accommodations.",
      "author": "Best_Bisexual",
      "created": 1620693950,
      "upvotes": 13,
      "replies": {}
    },
    "gxo9o42": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxo9o42/",
      "text": "I saw a post in professors where someone was like “do they actually think they can learn everything from youtube” and I was like yes, yes sir we do and we have !",
      "author": "lch_xo",
      "created": 1620692729,
      "upvotes": 10,
      "replies": {
        "gxrb65z": {
          "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxrb65z/",
          "text": "Literally.. all of my math and chemistry classes were taught by various YouTube channels. Reading text about how to balance an equation does not help me learn how to balance an equation. And that's a very basic/simple/easy thing in chem.",
          "author": "Greeneyesablaze",
          "created": 1620757146,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gxnzesa": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxnzesa/",
      "text": "> Why do I even need to be in a class \n\nYou don't, which is why college in general should just be online in the 1st place.\n\n I get it though, people who come to college for the social life definitely want their money's worth. Expensive social life you're paying for though.",
      "author": "WickedProblems",
      "created": 1620687587,
      "upvotes": 3,
      "replies": {
        "gxrcdll": {
          "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxrcdll/",
          "text": "What I meant was, why am I enrolled in a class at all if I could just buy the textbook and read it and that's all I need to know. It would save me a couple thousand dollars. Now, obviously I need to be enrolled because I need to pass these classes to get a degree, but I'm paying for more than just someone assigning me book chapters and auto-graded quizzes. I'm paying these professors' salaries so that they can *teach* me and help me learn.",
          "author": "Greeneyesablaze",
          "created": 1620757638,
          "upvotes": 1,
          "replies": {
            "gxrmbg8": {
              "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxrmbg8/",
              "text": ">I could just buy the textbook and read it and that's all I need to know\n\nMost people do this even outside of college and will continue to do it forever.\n\n>but I'm paying for more than just someone assigning me book chapters and auto-graded quizzes.\n\nYou are paying for more than this already... but someone has to put together the coursework, choose the material, separate redundant information (off-scope/advanced information), create the powerpoints/notes to lecture from, or for students to take notes, be there to answer questions or be able to refer you back to their source of science/theory and create/assign tests or exams.\n\nCollege is basically structural support for students to self teach. The professors themselves aren't necessarily going to magically teach you anything you couldn't have done yourself. Think about it like this, if you had this ability to simply learn on your own, then college would be a breeze. You wouldn't need the structural support nearly as much as you'd just be there to get the degree.\n\nCollege isn't entirely useless, it just doesn't do what you think it's supposed to do IMO. Hence, why I say most people pay to attend college for an expensive social life experience.\n\nObviously, the end goal is to get the degree because employers today create a demand for it. You're paying tuition to basically go through professional corporation training so you can eventually be deemed competent for hire by having credentials.",
              "author": "WickedProblems",
              "created": 1620761693,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gxnyqjh": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxnyqjh/",
      "text": "Say it a little louder for the person at the front",
      "author": "dangerous-alaska",
      "created": 1620687249,
      "upvotes": 55,
      "replies": {}
    },
    "gxnyo9h": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxnyo9h/",
      "text": "I feel that. For one of my classes the professor is completely impersonal. She posted all of the slides at once, all of the exams, and the discussion board entries. She sent out only one reminder for an exam, she hasn’t interacted with us besides that.",
      "author": "CluelessCapybara2421",
      "created": 1620687216,
      "upvotes": 15,
      "replies": {}
    },
    "gxnjt1t": {
      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxnjt1t/",
      "text": "I feel it. I have friends that are stem and nursing students and all their power points at least 150 slides a piece. They have to teach themselves at this point. It’s so sad and my heart goes out to them cause their major was hard enough now you have professors being super fucking lazy.",
      "author": null,
      "created": 1620680318,
      "upvotes": 109,
      "replies": {
        "gxpp6vu": {
          "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxpp6vu/",
          "text": "Nursing student here. It’s bullshit! My “classroom” consists of my apartment living room and my “classes” are quite literally:\n\n1. Dreadfully open computer and go to blackboard. \n2. Download boring ass power point \n3. Take quiz.\n4. Repeat. \n\nThankfully I’m back on campus for A&P 2 next semester!",
          "author": "AiriAnime",
          "created": 1620729125,
          "upvotes": 18,
          "replies": {
            "gxrl1qw": {
              "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxrl1qw/",
              "text": "Good! I hope you pass. Anatomy and physiology is hard (well from what I’ve seen) I just know quite a few people who failed. And they changed their major so they wouldn’t be fifth years. But if you can do what you’re doing now with those lame ass power points you’re going to do so great.",
              "author": null,
              "created": 1620761166,
              "upvotes": 2,
              "replies": {
                "gxrmcvv": {
                  "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxrmcvv/",
                  "text": "I am seriously scared especially because I’m taking A&P 1 in a minimester this summer.",
                  "author": "AiriAnime",
                  "created": 1620761710,
                  "upvotes": 2,
                  "replies": {
                    "gxs3y3o": {
                      "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxs3y3o/",
                      "text": "You’ll be okay! You got it. 😊",
                      "author": null,
                      "created": 1620769083,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gxqnizb": {
          "link": "/r/CollegeRant/comments/n9e95b/powerpoint_slides_are_not_a_lecture/gxqnizb/",
          "text": "Stem student here. Even before COVID, all of my stem lectures have always been just powerpoints. It’s actually one of the reasons I got an iPad last year. I got tired of having to print off hundreds of pages every month (I have to take notes by hand or I won’t remember). \n\nBut after COVID, this way of “teaching” was an absolute disaster. Staying focused in class while reading over a PowerPoint was hard enough. But doing it at home with a million distractions was rough & my GPA tanked. I could usually teach myself the material but I could not for the life of me grasp any STEM related material this year.",
          "author": "lazairiaw",
          "created": 1620747401,
          "upvotes": 5,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634063291
}