{"sid": "o5ucbc", "link": "/r/CollegeRant/comments/o5ucbc/discrimination_from_male_research_partner/", "title:": "Discrimination from male research partner", "text": "So, I am doing B. S. Psych. And we are supposed to work in a group of four people. We are three girls and one boy. Imma start with:-  Our teacher said that we are supposed to submit through one person only. So, this boy who also happens to be the vice president of foreign society takes up that thing. Now, dunno if it is the ego from being a vp or what but is being real disrespectful. And really rude. If our submission is one week from now he will start asking for the work a week earlier. The thing is he doesn't do much himself. He happens to have other research works from his contacts so everytime he is supposed to do something he copies those research works uses a paraphrasing tool and sends it in the group. The things I have done all the editing. I have written down all the material. He barely did anything. All he knows is how to copy from other research works. It's not even like using the abstract or for inspiration he legit writes down the same material. This is so disturbing. He is he is some god or something. And he thinks it is okay to be disrespectful and rude.He gives orders as if I owe him something. And some people even take them as if they do owe him something. I also happen to have this friend group. But recently I have noticed that he is trying to take my place. Earlier everyone used to call me for asking or clearing things out but he showed them like he is doing all the work when is NOT. Dunno why but he is turning my friends against me. This is so disturbing. What do I do????\nWhen things like this happen it becomes really hard to focus on studies. Please any suggestions??????\nTL;DR This is some bullshit. And I dunno how to deal with it.", "author": "This_Direction_4843", "created": 1624388009, "retrieved": 1632842183, "over_18": false, "upvotes": 7, "upvote_ratio": 0.82, "comments": {"h2okcab": {"link": "/r/CollegeRant/comments/o5ucbc/discrimination_from_male_research_partner/h2okcab/", "text": "Thank you u/This_Direction_4843 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1624388009, "upvotes": 1}, "h31xdso": {"link": "/r/CollegeRant/comments/o5ucbc/discrimination_from_male_research_partner/h31xdso/", "text": "If they are your friends, try talking to them and explaining your side of the story and your worries. If you can, calmly confront him and express what you’re unhappy with. Never lose your cool, because he sounds like he’d love that. Sorry that you have to deal with this — try taking on less work if you can afford to. But also, definitely weird that they would just believe him. Make sure to reflect on what you maybe could’ve done better, just for self reflection’s sake!", "author": "calicocatico", "created": 1624664885, "upvotes": 2}, "h2qwzfr": {"link": "/r/CollegeRant/comments/o5ucbc/discrimination_from_male_research_partner/h2qwzfr/", "text": "Par-a-graphs", "author": "orangeblackteal", "created": 1624436535, "upvotes": 5}}}