{"sid": "jry4n1", "link": "/r/CollegeRant/comments/jry4n1/parents_mad_because_i_dont_want_to_give_them/", "title:": "Parents mad because I don’t want to give them access to my canvas account so they can monitor my grades", "text": "I tell them what my grades are, so it shouldn’t be a problem if they don’t have it. I have all A’s except for in astronomy which I have a B in for now. I paid for this entire semester myself with scholarship money, so they can’t use paying for it as an excuse to keep nagging me about it. I don’t know why it’s such a problem if I have good grades.", "author": "kviiiie", "created": 1605057025, "retrieved": 1632951783, "over_18": false, "upvotes": 30, "upvote_ratio": 1.0, "comments": {"gbya2rk": {"link": "/r/CollegeRant/comments/jry4n1/parents_mad_because_i_dont_want_to_give_them/gbya2rk/", "text": "If they’re paying for it, show them.  If not, you should still show them as they’re hosting you in their house right now.  They’re gonna keep nagging you regardless, just show them and take away a tool they have to use against you.", "author": "PM_ME_YOUR_PO0P", "created": 1605114867, "upvotes": 2}, "gbx59le": {"link": "/r/CollegeRant/comments/jry4n1/parents_mad_because_i_dont_want_to_give_them/gbx59le/", "text": "Tell them you will get in trouble from the school for sharing your account info.", "author": "AXXII_wreckless", "created": 1605085991, "upvotes": 2}, "gbwxth2": {"link": "/r/CollegeRant/comments/jry4n1/parents_mad_because_i_dont_want_to_give_them/gbwxth2/", "text": "Damn so I’m a senior and there have been times where my parents asked for my grades here and there, no issue. All of a sudden after I get arrested they have been on my ass since last January and they get crazy about her anything below a 80. It sucks", "author": "FEStienewb", "created": 1605078419, "upvotes": 3}, "gbwtefg": {"link": "/r/CollegeRant/comments/jry4n1/parents_mad_because_i_dont_want_to_give_them/gbwtefg/", "text": "Are they helping support you in any other way (food, rent, insurance, etc)? If so, I think they deserve to know. If not, they’re your grades and you paid for them, earned them, and can divulge them however you wish.", "author": "MyNameIsZink", "created": 1605074527, "upvotes": 0}}}