{"sid": "pbdqmh", "link": "/r/CollegeRant/comments/pbdqmh/it_sucks_being_called_in_recitation_and_you_dont/", "title:": "It sucks being called in recitation and you don’t know the answer :(", "text": "It is really embarrassing to not know the answer to the instructor’s question :(. My name is always being picked randomly by my instructors to answer in 2 consecutive subjects. I sometimes feel that my name has a curse or what :(. Imagine out of 40 people to be chosen, why am I always the one being picked? Now I feel like not attending their classes but I love my parents and I want to make sure that the $$$ they paid for my education is going to a direction :( It really sucks and seems like I am a stupid person for not knowing the answer. This is just a rant of me having a bad day :( Thank you for reading :( and I hope you all have a good day :)", "author": "Psychological_Sign42", "created": 1629905807, "retrieved": 1632841562, "over_18": false, "upvotes": 27, "upvote_ratio": 0.97, "comments": {"haaydnx": {"link": "/r/CollegeRant/comments/pbdqmh/it_sucks_being_called_in_recitation_and_you_dont/haaydnx/", "text": "Thank you u/Psychological_Sign42 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1629905808, "upvotes": 1}, "hae1ji1": {"link": "/r/CollegeRant/comments/pbdqmh/it_sucks_being_called_in_recitation_and_you_dont/hae1ji1/", "text": "Best way to avoid teachers picking on you is to answer questions you DO know! Participate when you know the answers bc they will most likely not call on you if you’ve already participated.", "author": "maddymckay", "created": 1629955107, "upvotes": 3}, "habw5o1": {"link": "/r/CollegeRant/comments/pbdqmh/it_sucks_being_called_in_recitation_and_you_dont/habw5o1/", "text": "Being singled out is horrible to begin with. Never let a professor make you feel like you have to know the answer. It's ok to say you don't. This doesn't make you stupid in the least. We're at school to learn. If we had all the answers, you wouldn't need that class.", "author": "Wronium_", "created": 1629919344, "upvotes": 5}, "haazdfw": {"link": "/r/CollegeRant/comments/pbdqmh/it_sucks_being_called_in_recitation_and_you_dont/haazdfw/", "text": "The teacher remembers you though! use that to your advantage. It's annoying that they pick you a lot but if they remember your name that must mean you're a good student to them. They're most likely picking you bc you look like you know the answer.\n\nMaybe avoiding eye contact and looking at someone else will help them stop picking you. I've done this and it directed their attention towards others. Good luck!", "author": "genericusername_____", "created": 1629906211, "upvotes": 20}}}