{"sid": "ohzbdb", "link": "/r/CollegeRant/comments/ohzbdb/im_fed_up_with_this_asynchronous_class/", "title:": "I’m fed up with this “asynchronous” class", "text": "I took an asynchronous stats class this summer and I took it asynchronous because I work retail with a new schedule every week. I thought the whole point of asynchronous was so that everyone could do it on their own time (I understand there are due dates and that stuff.) What irritates me is the professor requires us to take our quizzes and exams over zoom at certain times, and only gives us one time slot for each. The worst part is she sends an email a few days before the test/exam letting you know what time she decided. Last Thursday I had a quiz at 10 am and this Monday I have a test at 7 pm. I thought the whole point of asynchronous was to avoid this mess.", "author": "tate3223", "created": 1625984791, "retrieved": 1632950289, "over_18": false, "upvotes": 229, "upvote_ratio": 0.99, "comments": {"h4vzqr2": {"link": "/r/CollegeRant/comments/ohzbdb/im_fed_up_with_this_asynchronous_class/h4vzqr2/", "text": "This is NOT asynchronous an did the class is listed without meeting times, please complain to the dept or decision head.", "author": "no1uneed2noritenow", "created": 1626065764, "upvotes": 3}, "h4u2shn": {"link": "/r/CollegeRant/comments/ohzbdb/im_fed_up_with_this_asynchronous_class/h4u2shn/", "text": "I am sorry to hear that?", "author": "Small-Button-2308", "created": 1626029496, "upvotes": -4}, "h4u1cct": {"link": "/r/CollegeRant/comments/ohzbdb/im_fed_up_with_this_asynchronous_class/h4u1cct/", "text": "I think what they mean is everything but quizzes and tests you do on your own. All universities and college have set midterms or big exam times", "author": "Romano16", "created": 1626028784, "upvotes": 0}, "h4tczln": {"link": "/r/CollegeRant/comments/ohzbdb/im_fed_up_with_this_asynchronous_class/h4tczln/", "text": "I just completed my entire first year of University online, without stepping foot on campus once. I did much better in my asynchronous then synchronous classes simply because of the stress of making the zooms on time. I also worked retail during my first year, and my job was extremely strict. Days off had to be know two weeks in advance there, and I worked weekends. One of my professors gave us all of our exams on Sundays because he thought that \"it would prevent you from having other class work in the way.\" This class was also considered asynch, even though we had set times and places for every exam...", "author": "saggybritches83", "created": 1626016581, "upvotes": 4}, "h4tcsm9": {"link": "/r/CollegeRant/comments/ohzbdb/im_fed_up_with_this_asynchronous_class/h4tcsm9/", "text": "Yeah my asynchronous classes get atleast a 12 hour window to do quizzes or tests", "author": "crystalliite", "created": 1626016479, "upvotes": 6}, "h4t9679": {"link": "/r/CollegeRant/comments/ohzbdb/im_fed_up_with_this_asynchronous_class/h4t9679/", "text": "We all hate it (speaking as professor).  I'm assuming she is doing that because of the epidemic of cheating.   The cheating is a huge problem right now. Personally I don't care. I prefer to write tests that are cheat proof (critical thinking questions).   I then set a timer to the test.  Student has up to three days to complete exam, but once they start, the timer starts.   I don't use any of the other anti-cheating stuff.  \n\nHang in there.", "author": "-Economist-", "created": 1626014571, "upvotes": 23}, "h4syzty": {"link": "/r/CollegeRant/comments/ohzbdb/im_fed_up_with_this_asynchronous_class/h4syzty/", "text": "Was I the only who thought this was a reference to JavaScript?", "author": "academicRedditor", "created": 1626008627, "upvotes": 0}, "h4sng8b": {"link": "/r/CollegeRant/comments/ohzbdb/im_fed_up_with_this_asynchronous_class/h4sng8b/", "text": "Who TF is doing zoom quizzes do they not have eproctor?", "author": "chicityhopper", "created": 1625998980, "upvotes": 21}, "h4sf48h": {"link": "/r/CollegeRant/comments/ohzbdb/im_fed_up_with_this_asynchronous_class/h4sf48h/", "text": "I’m in the same boat and it’s a living nightmare. “TBA” is only ok for finals…\n\nHang in there fellow comrade and stick with it. Nothing makes sense right now, one step at a time. \n\nBUT I’d def ask around w your peers (if that’s even feasible with everything virtual), to maybe ask your prof. for a more consistent/reliable schedule. Hopefully, having at least a few others willing to speak up might help things?", "author": "dnj_", "created": 1625990674, "upvotes": 64}}}