{"sid": "oz7410", "link": "/r/CollegeRant/comments/oz7410/stay_online_or_go_back_to_campus/", "title:": "Stay Online or Go Back To Campus", "text": "This might be an unpopular opinion, but I like online classes. I like the flexibility and tgat it doesn’t feel like “actual school”. However, my family is wanting me to go back to campus this semester and it is causing me a lot of emotional distress. \n\nI currently attend Penn State Harrisburg and this will be my first semester on campus if this is the case. I know there is the online World Campus and it has my major, but idk if I should switch. I understand that being on-campus helps me socialize, but I am already in a crisis mode of if college is right for me. \n\nWhere I live is 20-30 minutes away from the Harrisburg campus, and most of the classes that I need either make my schedule 5 days a week or have a night class and I am not happy about that. I want to know from you guys if I should stay online or I should take a shot on-campus.\nThe fall semester is coming up in about three weeks so I need some quick advice.", "author": "lunamoonorg", "created": 1628258116, "retrieved": 1632949143, "over_18": false, "upvotes": 10, "upvote_ratio": 1.0, "comments": {"h8y006v": {"link": "/r/CollegeRant/comments/oz7410/stay_online_or_go_back_to_campus/h8y006v/", "text": "I LOVE living at home and being with my family and doing online classes. I’m one of the few who hope we go back online 🥴", "author": "fuitgummyy", "created": 1628968587, "upvotes": 3}, "h8qz1u1": {"link": "/r/CollegeRant/comments/oz7410/stay_online_or_go_back_to_campus/h8qz1u1/", "text": "I LOVED ONLINE CLASSES I wished THEY had TOTALLY GOne BACK TO it😫", "author": "TheJazmineRose", "created": 1628830999, "upvotes": 3}, "h81dtdn": {"link": "/r/CollegeRant/comments/oz7410/stay_online_or_go_back_to_campus/h81dtdn/", "text": "Is it a financial concern at all? Being that close to home it doesn’t seem like it would be that hard to commute to you classes and not be stuck living on campus full time, plus it would save thousands. I’m in the same boat that I prefer the online classes now too. I’m not a super social person, though. If you’re looking to have that social life I’d suggest going as college is one of the easiest ways to make friends. If you’re more concerned with getting your degree and moving on, I’d definitely say online is easier and would save you a ton of money in the long run.", "author": "XxNHLxX", "created": 1628327840, "upvotes": 4}}}