{"sid": "n2mrzc", "link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/", "title:": "Making exams worth over half your grade makes no sense", "text": "I don’t know a single person who does better under the stress of taking an exam. So why do so many professors make exams worth over half your grade? I leaves zero room for error which just makes it all the more nerve wracking and as a result more likely to make a mistake.\n\nOne of my classes the exams are worth 90% of my grade, another 70%, and another 50%. I can bear 50%, but man the other two? Almost makes you destined to fail.", "author": "darkerthanthenight", "created": 1619889496, "retrieved": 1632842689, "over_18": false, "upvotes": 403, "upvote_ratio": 0.99, "comments": {"gwk8roa": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwk8roa/", "text": "Thank you u/darkerthanthenight for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1619889496, "upvotes": 1}, "gwpajo0": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwpajo0/", "text": "It’s from lazy professors. They don’t want to add and grade hws projects and other stuff that can supplement your grade. They just want to go thru exams and have that be the bulk of their work", "author": "Bergfinn-al-Duri", "created": 1619984634, "upvotes": 0}, "gwnjdsi": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwnjdsi/", "text": "I’m a science major and the majority, if not all, of my classes are like 80-85% or above exam based grades. It sucks. I have anxiety especially now with the Proctorio crap cause one exam kept messing up and my professor didn’t care so I ended up withdrawing from that class. I don’t get it either though, I miss community college where they at least tried to help you lol.", "author": "Ohhiitsmeyagirl", "created": 1619958051, "upvotes": 1}, "gwniq5h": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwniq5h/", "text": "Most of my courses have exams being the primary — even only — method of grading. Some have attestations alongside exams where, in the worst way imaginable, you need to pass the attestation or else you fail the course, even if you pass the exams.\n\nThankfully, attestations are repeatable but holy shit.", "author": "HJSDGCE", "created": 1619957701, "upvotes": 1}, "gwn5j62": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwn5j62/", "text": "You should learn how to thrive under stress. If you cant chill out during an exam, you cant chill out in the real world. Stop being a little biscuit and treat these tests as a time to dominate!", "author": "erice3r", "created": 1619950777, "upvotes": 1}, "gwmzspx": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwmzspx/", "text": "My exams worth entire my grade :(", "author": null, "created": 1619945125, "upvotes": 1}, "gwmvhoj": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwmvhoj/", "text": "Emm... For 95% of my undergrad courses, the exam was worth 100% of the grade. Master's courses are different but it's still always larger than 50%. America is a weird country.", "author": "BelgianWaffle97", "created": 1619940990, "upvotes": 1}, "gwmrkgq": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwmrkgq/", "text": "What kind of work environment has basically nothing then two hours of intensive work and three more months of unimportant stuff again.", "author": "Alistair_TheAlvarian", "created": 1619937429, "upvotes": 1}, "gwmpmnu": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwmpmnu/", "text": "Most profs are terrible educators and have no clue about grading.", "author": "A-roguebanana", "created": 1619935733, "upvotes": 1}, "gwmojsi": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwmojsi/", "text": "I am from Germany where this ist the gold Standard and I hate this lol. I do get really good Grades luckily but Sometimes working throughout the Semester feels absolutely pointless. \n\nOh and in my major we have modules, each module is usually one Class with an exam or Research Paper and a bunch of Others classes that you have to pass but dont get a grade for. Then the grade for the entire module is made up by that ONE class.\n\nHonestly make it make sense. Just makes a lot of people 'binge study' (at least thats what we call it) and Just forget everything soon after🙄", "author": "Odd-Tie6308", "created": 1619934807, "upvotes": 7}, "gwmei0g": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwmei0g/", "text": "I absolutely hate that this is a thing. I remember having a professor who made the midterm and finals worth only 25% of the grade (collectively) and I actually felt like I had the freedom to learn in his class. It didn’t feel like bombing those exams was a death sentence and I hardly stressed at all during those exams.\n\n\nThen I had another professor where again, collectively, the midterm and final exam was worth 65% of our total grade. That class was absolutely miserable. By the end of the term, I think it was only myself and 7 other students who had made it through the final exam. I aced every single exam, which part of me is really proud of. But it was at the expense of my health. Those exams used to give me chest pains.", "author": "Taro_Otto", "created": 1619927579, "upvotes": 13}, "gwm406c": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwm406c/", "text": "I'm a chemistry major and every single one of my chemistry classes has been worth 80-100% exam-based. Graduating with a 3.8 from a top 50 university in 2 weeks! It's hard, but it's definitely possible. Learn how you study the best, and focus on review about a week before your exams. The ***good*** thing about most of your grade being based on exams is that you don't have any busy work and you can put all of your time into focused study time (and spending time with friends!) in the way that you learn the best.", "author": "Maximum_Minx", "created": 1619921186, "upvotes": 2}, "gwm3kfa": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwm3kfa/", "text": "One of my classes this semester, I hade 3 exams all worth 25% of my grade and one paper worth the other 25%. And her exams were extremely, *extremely* hard. If not for the paper, I would’ve gotten a D in the class. I literally got 70% in the class because I got Ds on all 3 of the exams (and the class average on the exams tells the same story for the majority of the class) and a 91 on the paper. Was bullshit, but I’m glad I got out of the class alive.", "author": "Megadog3", "created": 1619920930, "upvotes": 7}, "gwm23qt": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwm23qt/", "text": "I had a 93% in my class. I got 100% on all homework assignments for the first 5 chapters. Then took the midterm and somehow got a 52% and now I have a 60% in the class 😐\nMy professor says it will probably no longer be possible for me to get an A in the class.", "author": "lch_xo", "created": 1619920095, "upvotes": 9}, "gwlz7on": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwlz7on/", "text": "I guess I’m in the minority in that I actually prefer this in a lot of cases. In one of my classes right now, a big chunk of our grade comes from group projects and in-class participation (the former of which is the absolute bane of my existence- and I’m not the biggest fan of speaking up in class either).", "author": null, "created": 1619918465, "upvotes": 3}, "gwlw90q": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwlw90q/", "text": "I had one class where my only grades were 3 exams. It was super rough and I did make it through.", "author": "SweetTeaBags", "created": 1619916808, "upvotes": 5}, "gwl9ezi": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwl9ezi/", "text": "Worse if their's a timer counting down the amount of time you have and you can see the timer :(", "author": null, "created": 1619905214, "upvotes": 21}, "gwl246u": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwl246u/", "text": "I’m taking mechanics of materials rn and our professor made tests 100% of our grade. The only hw we have is for bonus points.", "author": "Alias-H", "created": 1619902272, "upvotes": 14}, "gwl17z9": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwl17z9/", "text": "Testing in lower-level college courses is usually based on rote memorization. We no longer live in a world where information needs to be memorized and regurgitated: we have smartphones with the answer to every basic question that we could possibly have at our fingertips. Even doctors have \"[doctor google](http://www.uptodate.com/)\". Instead, we should be training students to think critically and solve complex problems, skills that are necessary to be successful in today's workforce.\n\nCramming for a high-stakes final does not lead to a high level of retention for the information that is presented in the class, and missing this critical information can affect the student in their higher level courses and even later in their careers. It is well documented that [higher stakes](https://www.researchgate.net/profile/Mounya-Abdaoui/publication/326673058_Strategies_for_avoiding_cheating_and_preserving_academic_integrity_in_tests/links/5b5cb7a60f7e9bc79a6c493d/Strategies-for-avoiding-cheating-and-preserving-academic-integrity-in-tests.pdf) exams lead to [increased rates of cheating](https://d1wqtxts1xzle7.cloudfront.net/49696002/05.10.14_WP191_brandaoteixeira.pdf?1476821334=&response-content-disposition=inline%3B+filename%3DCrime_without_punishment_An_update_revie.pdf&Expires=1619905014&Signature=hL7JKYsXTbEiFSn5tnSbZZO2SrcEB2hYHoGchyXyDKrBak6nnDXxSzS0dkrmI4Vtg~-2T4HEGiJnXvwQLw3558-0y~XyaPofFss4noavdOpOmtBxKZR-21vsN1MzWTx4c5nkA1clcs~GShREtfVUhOX4ljagIqLVxVDP1f3ftkE-PIEJzxXBP81aI9doB34w21WV-sblOuqQ3YaHo0FAcoEIeDEWKo2vljsE1pEOvvaDmWMI534s8GIwsAcoAzPORHauzj9uv1u5tDxH2lpiCpKJEijHncZIaLgZLYyv4uIe8zVr3tetxI6JYt04OB1lM-1TW8TtxXd~ycrvrrjEUg__&Key-Pair-Id=APKAJLOHF5GGSLRBV4ZA). On top of that, basing your student evaluations on high-stakes exams is just plain poor pedagogical strategy: there are students that are perfectly capable that do not test well, and students with perfect photographic memory that would not make effective critical decisions in real world situations. There are plenty of options that are proven to lead to greater retention, understanding, and application of information:\n\n* [Analyzing a college course that adheres to the Universal Design for Learning (UDL) framework.](https://files.eric.ed.gov/fulltext/EJ992116.pdf)\n* [Construction of a creative instructional design model using blended, project-based learning for college students](https://www.scirp.org/html/24850.html?pagespeed=noscript)\n* [The Testing Charade](http://press.uchicago.edu/ucp/books/book/chicago/T/bo24695545.html)\n* [Applying Science of Learning in Education: Infusing Psychological Science into the Curriculum](https://teachpsych.org/ebooks/asle2014/index.php)\n* [Perceptions of universal design for learning (UDL) in college classrooms](https://search.proquest.com/openview/8d4559e2225b72179e668313c5ac3524/1?pq-origsite=gscholar&cbl=18750&diss=y&casa_token=8mRAcqBZKGQAAAAA:wnce3vMm2Bq4WPIwJBqRvH7lOaJao9BxRe_wlRzFR-NuYUeVsyCYOBZ8Zt6Vn6Rt2TWSidZDCQ)\n* [Improving College and Career Readiness through Challenge-Based Learning.](https://eric.ed.gov/?id=EJ1073224)\n* [Improving Students’ Learning With Effective Learning Techniques: Promising Directions From Cognitive and Educational Psychology](https://journals.sagepub.com/stoken/rbtfl/Z10jaVH/60XQM/full)\n* [Organizing Instruction and Study to Improve Student Learning](http://files.eric.ed.gov/fulltext/ED498555.pdf)\n* [Project-based learning: A review of the literature](https://journals.sagepub.com/doi/abs/10.1177/1365480216659733?casa_token=jwDUpD2YoXEAAAAA:hrZz2XG-gRVkeY_QbrVOxXUqzAxVtqILfajhwCsYKiXcD6bl-nl7S5kydEzTzMPQPm6ADEpoNlUp)", "author": "jomyers_online", "created": 1619901894, "upvotes": 28}, "gwksygu": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwksygu/", "text": "You're saying the exam category is over 50% or a single exam is over 50%? For the exam category to be over 50% is pretty normal even in high school. Typically homework and classwork is only 20-30%. But if one exam is over 50% that seems quite problematic.\n\n>Almost makes you destined to fail\n\nWell most people don't fall, but I guess you did say almost.", "author": "didhestealtheraisins", "created": 1619898228, "upvotes": 1}, "gwkljeh": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwkljeh/", "text": "As a psyc major, almost all my classes have 3 exams, including the final and typically are worth 60-90% of my mark. The 60% ones have an essay or other project with the higher ones having something like journal entries. Lmao.", "author": "xSooIntense", "created": 1619894868, "upvotes": 17}, "gwkjb81": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwkjb81/", "text": "Lmaoo im a cs major and my programming final exam is worth 80% of my grade. F this shit", "author": "satlovernot", "created": 1619893908, "upvotes": 53}, "gwki2lm": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwki2lm/", "text": "My physiology 2 course is divided to 40% for the midterm and 60% for the finals. Thats it, no quizzes, assignments, projects, anything. And I already screwed up my midterm. There really is no chance for error.", "author": "Maxolak", "created": 1619893375, "upvotes": 109}, "gwkfwme": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwkfwme/", "text": "I think it makes sense to challenge students to really learn and synthesize the information and to demonstrate their command of that subject in real time.\n\nGreat preparation for the real world.", "author": "logoyahoo", "created": 1619892446, "upvotes": -15}, "gwketv3": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwketv3/", "text": "Never understood that but I was told \"it is what it is\" man do people not question professors anymore??", "author": "Xygn0", "created": 1619891993, "upvotes": 80}, "gwkejj2": {"link": "/r/CollegeRant/comments/n2mrzc/making_exams_worth_over_half_your_grade_makes_no/gwkejj2/", "text": "Laziness.", "author": "noexqses", "created": 1619891872, "upvotes": 12}}}