{"sid": "mpm7ua", "link": "/r/CollegeRant/comments/mpm7ua/linkedin_makes_me_realize_how_pathetic_i_am/", "title:": "LinkedIn makes me realize how pathetic I am", "text": "I’m a junior in college majoring in marketing and I’m currently taking part in a mentorship program that my school offers. I haven’t had any internships yet so that makes me already feel very behind. but my mentor told me that i need to use linkedin more and how it will help me build my network and all that. but boy do i hate linkedin. before using linkedin i assumed everyone was in the same boat as me when it comes to having little experience with their degree. but now that i am on linkedin and seeing everyone around my age doing these amazing things and internships i just feel so discouraged and lost. i feel like i’m already too behind to even get started. i’m so worried about not being able to get a job after college and just feel so stressed and overwhelmed. it also doesn’t help that my depression doesn’t really allow me to do anything and i don’t put in the time or effort for internship searches. i’m kind of just focusing on my classes and this remote learning bs is definitely not making me motivated. okay rant over 🙃", "author": "tarobean_18", "created": 1618258222, "retrieved": 1632843497, "over_18": false, "upvotes": 39, "upvote_ratio": 1.0, "comments": {"guaklhc": {"link": "/r/CollegeRant/comments/mpm7ua/linkedin_makes_me_realize_how_pathetic_i_am/guaklhc/", "text": "Thank you u/tarobean_18 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1618258222, "upvotes": 1}, "gvx0rvr": {"link": "/r/CollegeRant/comments/mpm7ua/linkedin_makes_me_realize_how_pathetic_i_am/gvx0rvr/", "text": "I hate to say this but... it gets 10x worse when you’re out of college and in the professional world. I hate it just as much as you. I’m 26", "author": "alwaysmovingx", "created": 1619435256, "upvotes": 1}, "guh0a2x": {"link": "/r/CollegeRant/comments/mpm7ua/linkedin_makes_me_realize_how_pathetic_i_am/guh0a2x/", "text": "Omfg I literally related to everything you said— down to the major and grade level too. I honestly don’t understand the point of these job/internship placement posts, they seem like they’ve become increasingly self-righteous too. The only ones I actually get anything out of is the ones where people talk about their struggles and how they worked hard to land the position, because those actually inspire me. But the other ones don’t help me as someone who is connected in a network; I get being proud, but they all seem so braggy nowadays.", "author": "hotcoco-jo16", "created": 1618395724, "upvotes": 2}, "gug01fh": {"link": "/r/CollegeRant/comments/mpm7ua/linkedin_makes_me_realize_how_pathetic_i_am/gug01fh/", "text": "i feel the same way. it seems everyone around me has a bunch of lab experience and has connections with professors and i don’t have shit and never felt any of my professors even cared about me enough to help", "author": "bmoneyy5", "created": 1618367165, "upvotes": 2}, "guebn5p": {"link": "/r/CollegeRant/comments/mpm7ua/linkedin_makes_me_realize_how_pathetic_i_am/guebn5p/", "text": "Social media is terrible for your mental health. This is why I dont use any of it. Including Linkedin.", "author": "Throwawaynobodywoo", "created": 1618337613, "upvotes": 4}, "gudh8wi": {"link": "/r/CollegeRant/comments/mpm7ua/linkedin_makes_me_realize_how_pathetic_i_am/gudh8wi/", "text": "I can imagine that, especially since college also emphasizes how important all these things are. But remember that LinkedIn is just like Instagram and Facebook, people only post their big successes on it. You don't get to see all the times they got rejected for an internship, the university they actually wanted to study at but didn't get accepted, or the fact that they almost have a burnout from doing all these things.", "author": "ScienceCat08", "created": 1618324134, "upvotes": 4}, "gucdp3y": {"link": "/r/CollegeRant/comments/mpm7ua/linkedin_makes_me_realize_how_pathetic_i_am/gucdp3y/", "text": "Yea feel the same way.", "author": "QuickCoyote097", "created": 1618294214, "upvotes": 5}, "gub0frq": {"link": "/r/CollegeRant/comments/mpm7ua/linkedin_makes_me_realize_how_pathetic_i_am/gub0frq/", "text": "I'm on another site similar to linkedin but I feel the way sometimes. This summer i'll try to do more part time jobs and internships", "author": "Oro-Lavanda", "created": 1618265622, "upvotes": 8}}}