{
  "sid": "qk6mcc",
  "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/",
  "title:": "Some things I have learned about college",
  "text": "So, I am entering my last full month of college before graduating in December and am so happy to be out of here. I made the right decision to graduate in 3.5 years, and it feels crazy to be 21 with a bachelor's degree and starting a full time job in a few months. But, looking back on college it was a big disappointment for me. I have some takeaways that I want to rant about.\n\nI came into college thinking it was going to be a life changing experience, expecting to make lifelong friends and thoroughly enjoy it. High school was lonely, as I never felt comfortable trying to make friends because everyone is so fake, and I expected this to change in college, but it is all the same. I have been here for 3.5 years and have not made a single legitimate friend. Zero. It is what it is. I have many acquaintances who I see day to day and say hello to, but then we just move on to the next thing and forget about it. That's the reality. I've actually been very involved on campus in a number of different groups, so I have met so many different people, but have made no truly strong relationships. I also attend a large power 5 school with 30k+ people, so there are so many different types of people you can meet. I feel that, after college, if I were to move to the other side of the US, no one would care. No one would remember me or reach out. It's a weird feeling, but it's the truth, and there are probably many others out there who feel the same way. I just feel like I have not gained anything besides a degree after all this time. And college really does go by fast. \n\nI feel that, from an educational standpoint, college is just a process. In my classes, there is such few work that needs to be done compared to high school. You attend class a few times a week and take away nothing from it. I feel that I could have succeeded in my higher level classes as a high school freshman. At this point, classes are just a waste of time and don't truly teach you important skills and concepts. The whole concept of getting an education is not even a thing anymore. Schools just want to 'process' you through the system and show you off to big time employers to improve the University's status. I'm not sure if that makes sense, but that's the way I see it. \n\nSo, I am very optimistic about what is to come after college. Still disappointed though because I feel robbed, as I wanted to get more out of these past few years. \n\nAnyone else feel the same way?",
  "author": "tonygunk6900",
  "created": 1635741841,
  "updated": 1636193994,
  "over_18": false,
  "upvotes": 59,
  "upvote_ratio": 0.93,
  "comments": {
    "hivmams": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hivmams/",
      "text": "Finally! Someone have put word to my thoughts.  I feel exactly the same.  I think High School was way more challenging than College.  And in the social side of things I hasn't made any significant relationship.",
      "author": "curlymarketer",
      "created": 1635770805,
      "upvotes": 10,
      "replies": {
        "hivrv4v": {
          "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hivrv4v/",
          "text": "Yeah, I expected college to be incredibly challenging as that is what I was led to believe but it's not at all",
          "author": "tonygunk6900",
          "created": 1635773843,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hivhpvo": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hivhpvo/",
      "text": "What upper level classes are you taking? Because I have a mental breakdown on schedule every two weeks.",
      "author": "DucTape696",
      "created": 1635767933,
      "upvotes": 8,
      "replies": {
        "hivj4du": {
          "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hivj4du/",
          "text": "Corporate financial analysis, retail mgmt, marketing strategy",
          "author": "tonygunk6900",
          "created": 1635768865,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hivuq5w": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hivuq5w/",
      "text": "I totally relate. I’m also graduating this December after 3.5 years (I went to a community college then transferred to a large school, 60,000+ people) and I’m leaving feeling hardly any more knowledgeable in my major than when I started. Made no friends. A lot of professors are just here to do their own research and don’t actually care about teaching. Had to teach myself a lot too when we were fully remote for Covid. I think this is a completely valid experience, I’m not sure why our society is obsessed with your college years being the peak of your life I’m soo excited to get out of here.",
      "author": "Extra-Ad-3043",
      "created": 1635775267,
      "upvotes": 5,
      "replies": {}
    },
    "hiuxtz1": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hiuxtz1/",
      "text": "I mean yeah it’s all bs. Modern Ed is fake.",
      "author": "uniekheid",
      "created": 1635750517,
      "upvotes": 9,
      "replies": {}
    },
    "hivw8h9": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hivw8h9/",
      "text": "Also: If you want to get out of college early, take online summer courses. It will save you money and you might be able to graduate in 3-3.5 years. I took two summer courses this past summer to graduate early.",
      "author": "tonygunk6900",
      "created": 1635775989,
      "upvotes": 3,
      "replies": {
        "hixtuva": {
          "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hixtuva/",
          "text": "Yep, best advice.",
          "author": "Waffles38",
          "created": 1635805290,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hivqbmc": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hivqbmc/",
      "text": "Any tips and tricks for someone like me who has entered recently the epitome of the failed modern education or in another words ,THE COLLEGE???",
      "author": "Mystic_Spirit71",
      "created": 1635773041,
      "upvotes": 2,
      "replies": {
        "hivrmcu": {
          "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hivrmcu/",
          "text": "I would say don't put an excessive amount of effort into your courses. Just do what you can to get by. Unless, of course, you have high standards for your GPA. But at the end of college, it's really not that big of a deal. What matters is that you make sure you get the degree, grades are not important imo.",
          "author": "tonygunk6900",
          "created": 1635773717,
          "upvotes": 3,
          "replies": {
            "hiwgj1w": {
              "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hiwgj1w/",
              "text": "> Thanks , i will remember it",
              "author": "Mystic_Spirit71",
              "created": 1635784995,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hiw0i5z": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hiw0i5z/",
      "text": "High School Never Ends -Bowling for Soup",
      "author": "Adrien0715",
      "created": 1635777935,
      "upvotes": 1,
      "replies": {}
    },
    "hiwayzr": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hiwayzr/",
      "text": "I’m currently in my third year and will probably graduate in an extra year after taking a couple of semesters off. The worst thing for me was actually people trying to encourage me to make friends. I tried my damndest for the first three years and nothing worked. Joining clubs? Everyone else shows up with friends and will only talk to their own friends, so I was awkwardly standing on the edge of their conversations while being treated like a nuisance. Social events organized by the school? Everyone goes with a set friend group and doesn't talk to anyone outside their group. Parties? If you're not friends with anyone that knows about it, how are you even aware it's happening? Asking classmates to go get lunch/dinner/coffee? They'll pretend to not hear you or say they have class (and then walk directly into the dining hall with their friends).\n\nWhen I finally gave up and accepted that I preferred being happy alone than unhappy with people, everyone decided to make it their problem to find me friends—but none would be friends with me themselves. Like girls in my classes would give advice on how to make friends and pity me for not having any, but not actually offer to be my friend—which honestly hurt the most.\n\nThis isn't to say that college without friends was a bad experience, once I finally decided to stop wasting energy trying to make friends I really had a great time. I love classes, I love connecting with professors and sweet talking library and custodial staff, my college experience just looks vastly different to most people's. And that's okay.",
      "author": "squidhandss",
      "created": 1635782598,
      "upvotes": 16,
      "replies": {
        "hixtpxk": {
          "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hixtpxk/",
          "text": "This was my last year high school experience instead of my college experience. This is exactly what it was like.\n\nI did make friends in college but covid interrupted everything. Also, classmates and professors almost always had somewhere to go, so I only had a few options.",
          "author": "Waffles38",
          "created": 1635805232,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hixt72n": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hixt72n/",
      "text": "I’m in year 5 at a massive public university. I’ve changed my major a ton so I’m here for another year and it just kills me. College has definitely been a massive disappointment for me. I study, I work, I adult. I try to stave off depression and anxiety. And I just count the days until I can completely leave this all behind. The only reason I’m still here is to finish my degree; as soon as that’s done, I’m never thinking about this shit again. I’ve learned a lot about myself, people, and life, and I’ve grown a lot, but it’s sucked so much. You’re definitely not alone.",
      "author": "AStruggling8",
      "created": 1635805002,
      "upvotes": 5,
      "replies": {}
    },
    "hiwcxol": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hiwcxol/",
      "text": "I think it’s more common than we might think when it comes to lifelong friends from college. Sure a lot of people will meet those lifelong friends where you’re in each other’s weddings and hit milestones together, but there are also a lot of us that just don’t and it’s very discouraging when you have that mindset based on what you think to be the norm, but it doesn’t always go that way for some of us. \n\nI’ve been graduated for a little over a year now. And I will say, it’s a big adjustment period that you go through. Not being in school for once, no more studying, no more exams, no more classes. It feels weird sometimes when you’re just working every day all day long and you think you need to be studying for an exam but you just don’t. Life after college may not get easier and that’s okay. But rather I’d say it’s a whole new challenge. And something they don’t warn you about after college is some of us can experience that post-graduation depression and you feel like you have to find yourself all over again. \n\nMy advice to you is accept this new challenge that is about to come and remember to take care of yourself and focus on the positives and strive for happiness given any situation. I didn’t have the best college experience either but I did earn my bachelors degree. And the biggest takeaway from your college experience is that you earned your bachelors degree and that’s a huge achievement to be proud of! College is not easy but you made it through the bumps and roadblocks!",
      "author": "alcreis",
      "created": 1635783459,
      "upvotes": 5,
      "replies": {
        "hj5ei6a": {
          "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hj5ei6a/",
          "text": "Thank you for what you wrote, it's really encouraging for me even though I'm still a student and won't possibly hold my degree in my hands any earlier than two years from now.\n\n>Not being in school for once, no more studying, no more exams, no more classes. It feels weird sometimes when you’re just working every day all day long and you think you need to be studying for an exam but you just don’t.\n\nThis describes my past two semesters under corona at home pretty well. See, summer 2020 was my 8th semester, but as I had endless time and everything was online at home anyway, I beloeved it was a good idea to do the 8th, 9th amd 10th semester all at once, and did that, and it left me with two empty semesters (we're not allowed to do the final exams earlier even depite having all the courses) which I filled with work, trying to silence the extreme depression from loneliness during home studying and trying to \"get out\" from the endless soul crushing routine at home.\n\nI finally moved out, back into my uni town, but after having basically wasted away the second half of my 21st and whole 22nd lifeyear at home, student life is nothing like it used to be back in the days. I'd even go as far as saying I never truly enjoyed life as a student and missed out on many opportunities and a lot of the fun I could have had, and not being able to \"catch up\" at the end made the whole ordeal worse than it was.\n\n>that post-graduation depression and you feel like you have to find yourself all over again. \n\n\nI know this may sound weird or wrong, but I seriously felt the post graduation depression over the past 2 years, even at times when graduation was 3-4 years away. It's just that everyone is getting more involved in studying and the courses are getting harder, everyone more and more busy as the semesters fly by, it's crazy how fast everything started to feel like we're not even going to the same school anymore.\n\n>I didn’t have the best college experience either but I did earn my bachelors degree. And the biggest takeaway from your college experience is that you earned your bachelors degree and that’s a huge achievement to be proud of!\n\nHell yeah. Getting the degree is at times the only thing that keeps me motivated. I used to love the feeling of freedom and going to the little parties after huge exams, but now (especially after having gone through Corona times...) the only thing I look forward to is the lack of unemployment, not completely hitting rock bottom apart from my mental health.\n\nMy thirties are still in the far distant future, but whenever I hear people in my profession in their thirties talk about how they feel about their success, it gives me some kind of hope. I feel like, if I eventually get there and think differently about my youth and all, all the suffering right now might be less important by the time then.",
          "author": "themo98",
          "created": 1635948624,
          "upvotes": 2,
          "replies": {}
        },
        "hiwd71w": {
          "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hiwd71w/",
          "text": "That's true and very helpful, thank you! Getting the degree is the most important part of it.",
          "author": "tonygunk6900",
          "created": 1635783572,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hix0ssb": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hix0ssb/",
      "text": "This post is nothing but facts, especially the part about saying college is just a process. I have learned nothing in any of my classes. My professors dont care about teaching, and then complain that he has to curve and that we dont get stuff. Free Youtube videos teach me more than the $1000 class professor. I just finished an interview today for an EE internship and I only feel good about it because of the concepts I learned and applied in trade school for electronics.\n\nAlso it is much harder to make friends in university. There are more ppl, but most just want to stay in their group. Classmates are just classmates and dont want to do become friends. At other schools Ive been friends with classmates and we would go out to eat sometimes.\n\nI feel very robbed at engineering school. Im gonna transfer to a community college with an EET bachelor degree and hopefully it goes better.",
      "author": "RainyFL",
      "created": 1635793352,
      "upvotes": 3,
      "replies": {}
    },
    "hiwml9n": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hiwml9n/",
      "text": "I've got another 3.5 years left and I've been in since 2015.... not all full time.\n\nCollege isn't a place I make lifelong friends. Aquintences at most. Maybe some networking buddies. Maybe some girlfriends.\n\nAll the hype from the college movies are bullshit if you don't have the money to not work and go to college. I dunno, im sick of college and want to finish, but I don't want to lose my damn income.",
      "author": "guy_with-thumbs",
      "created": 1635787515,
      "upvotes": 2,
      "replies": {}
    },
    "hiy93cn": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hiy93cn/",
      "text": "Yeah, if kids were allowed to start studying for their degree in highschool with even just 1 course a semester, they could be halfway through the coursework easily. College is a scam in its own right, but it would be nice if some of the cirriculum on non-major related coursework was skimmed. Most of it should really be optional, at an affordable cost. Cut college administration and half the bloat of colleges is gone..",
      "author": "yuhboipo",
      "created": 1635812016,
      "upvotes": 2,
      "replies": {}
    },
    "hiyw4d7": {
      "link": "/r/CollegeRant/comments/qk6mcc/some_things_i_have_learned_about_college/hiyw4d7/",
      "text": "This is so true. I also think that the pandemic messed up the college experience.",
      "author": "aanuma",
      "created": 1635822655,
      "upvotes": 2,
      "replies": {}
    }
  }
}