{
  "sid": "q7v4pd",
  "link": "/r/CollegeRant/comments/q7v4pd/i_got_a_0_on_my_midterm_exam/",
  "title:": "I got a 0 on my midterm exam",
  "text": "I am currently a freshmen in Community College, The exam was for History of Western Civ and I was pretty confident about the exam since I got to take it at home and had a 2 hour time limit, but unfortunately as soon as I hit the 'Start Test' button, my page stopped responding. I couldn't even enter a single question before the site closed and my exam was entered as a 0.\n\nBefore this exam, my grade in the class was equivalent to a low A, but now because of this single glitch on a 2 hour exam, my grade will now likely be a low C. I need a class average of B to get into my university of choice. I have already sent my professor an email asking for the exam to be re-opened.\n\nI can't believe this could even happen, and it seriously threatens my ability to pass a class that I clearly work hard in. When an assignment that should be about my knowledge of a subject is turned into my internet speed, then I don't know what to expect from my next exam.\n\nTl;Dr, I failed an exam because of my internet speed",
  "author": "Optimal_Wishbone322",
  "created": 1634198434,
  "updated": 1636193966,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hglleeu": {
      "link": "/r/CollegeRant/comments/q7v4pd/i_got_a_0_on_my_midterm_exam/hglleeu/",
      "text": "It’s not your fault. If your professor says no I would go to their higher up. But since your obviously a good student I think they should not have an issue. \n\nDon’t beat yourself up for this. For the next exam, maybe consider taking the exam where you know will have good wifi.\n\nP.S have your profs # Handy or E-Mail them explaining the situation right when it happens. They can often help right then \n\nGood Luck!",
      "author": "jenniferrook9",
      "created": 1634211439,
      "upvotes": 2,
      "replies": {
        "hgpv20h": {
          "link": "/r/CollegeRant/comments/q7v4pd/i_got_a_0_on_my_midterm_exam/hgpv20h/",
          "text": "So I sent my professor 2 emails and still haven't heard back after a day and a half. The exam availability is from wednesday-saturday and I have to travel out of state today. What can I do?",
          "author": "Optimal_Wishbone322",
          "created": 1634288605,
          "upvotes": 1,
          "replies": {
            "hgqlqzx": {
              "link": "/r/CollegeRant/comments/q7v4pd/i_got_a_0_on_my_midterm_exam/hgqlqzx/",
              "text": "Talk to your faculty or department about the situation. Explain your prof hasn’t responded and it is a important matter. Or see your prof in person (if you can) before you leave",
              "author": "jenniferrook9",
              "created": 1634305977,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhagp0k": {
      "link": "/r/CollegeRant/comments/q7v4pd/i_got_a_0_on_my_midterm_exam/hhagp0k/",
      "text": "Good news\n\nI luckily have a very nice professor and she let me retake the exam again. I'm kind of shocked that she would give me that kind of leeway (I'm used to professors being assholes). But I'll take it regardless",
      "author": "Optimal_Wishbone322",
      "created": 1634682308,
      "upvotes": 1,
      "replies": {}
    }
  }
}