{
  "sid": "q8mzin",
  "link": "/r/CollegeRant/comments/q8mzin/bitterness_jealousy_and_comparison/",
  "title:": "Bitterness, jealousy, and comparison",
  "text": "to preface: \n\nI am grateful for so much in my life and I don’t want to seem like I just sit around and feel sorry for myself. That is not my intention. I’m seeking advice to overcome this deep bitterness and loneliness. \n\nI know so many kids that have it all: the looks, the friends, the social life, focus, motivation. I wonder how I can find this for myself. It seems as though these people (even if they’re shitty), constantly win in every aspect of their lives.\n\nThere is a lot of jealousy there and I know it’s one of my worst vices. Its hard not to be jealous. \nSometimes I wonder that maybe if I was more attractive and less socially awkward I’d have it a bit easier in life. I’m stuck in a cycle of comparison, wishing I could be someone else for a day or two. Just to know what it’s like to have a group of friends always willing to go out with me and have a good time, or to be motivated/ focused enough to do well in classes. \n\nI feel like an observer everyday of my life. Just watching people make connections and sharing experiences. College hasn’t been completely isolating for me. I’ve made friends here and there, gone to parties, had some fun experiences. But at the end of the day, I feel so disconnected from those times. I never made any genuine friendships. I always felt like an outsider even during those times. When I go out now, I just observe, I can’t seem to escape the dissociative state from myself. I don’t know how to feel more connected. I feel a deep hole inside me like i’m really missing out on life. I just long for the life of someone else, to feel wanted. I get so angry when I see other people having a good time. Of course you can have a good time with friend, money, and good looks. I know all of this stems from jealously and I feel disgusted with myself when I think so childishly. I should be improving myself instead of feeling this way but how? How do I find a way out of this deep slump? How can I change my perspective and bitterness? How do I stop comparing myself? How do I feel more grounded to earth?",
  "author": "ycayw2222",
  "created": 1634299364,
  "updated": 1634332054,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgqtp1l": {
      "link": "/r/CollegeRant/comments/q8mzin/bitterness_jealousy_and_comparison/hgqtp1l/",
      "text": "I hear you, my dear. Thank you for sharing all of this; it sounds like you experience a lot with all this.\n\nI encourage you to validate how you feel it’s okay to feel bitter and jealous it’s just human nature. You say that you make friends here and there and go out which is great! But honestly, in college you make a lot of acquaintances. And this means you’re being a nice and civil human being to the people around you for the sake of interaction. And there’s nothing wrong with this everyone does it intentionally or not! It’s pretty common to find that one or couple people to really be open to.\n\nPersonally, how I navigate it all is by being in the mindset of having one goal before I graduate from college: get to know as many people as I can in order to benefit from them in the future. See it as an opportunity to social network to know a guy who does this and that if someone asks. You’ll never know if you’ll need their help later and in return you give something back.\n\nBut at the end of the day, be kind to yourself. Sometimes I forget that the world is still in a weird transitioning phase right now with the pandemic and it’s still not back to normal. You got this, just one day at a time.",
      "author": "issaajoy",
      "created": 1634309465,
      "upvotes": 1,
      "replies": {}
    }
  }
}