{
  "sid": "bkfa9j",
  "link": "/r/CollegeRant/comments/bkfa9j/it_really_pisses_me_off_when_people_just_come_to/",
  "title:": "It really pisses me off when people just come to class goof off and talk to each other while the professor tries to teach",
  "text": "It's my last day of school for the semester but I gotta just rant about this because today it was REALLY bad in one of my classes.\n\nFor context I go to a less than 10,000 students sized state university.\n\nI've had several moments in some of my classes this semester where I've wanted to go full George Costanza and yell at some of these kids to shut the fuck up. Like I get it the professor isn't saying anything really useful. The class were in is a super easy elective class that doesn't require a lot of note taking or effort. But I really don't want to hear you bitch and moan to the person sitting next you about how tired and hungover you are because you drank to much the night before or just like hold a normal volume conversation with the person sitting next to you.\n\nThere's a girl and a guy that sit behind me in one of my classes and they basically talk the whole class but today it was really bad. I get that it's the last day of class and the professor isn't really saying anything important but like this guy was basically doing an improv routine to this girl and she would obnoxiously giggle or laugh at LITERALLY everything he said. I think she probably found him attractive but like I shit you not he could of said anything and she laughing about it and it was so fucking annoying.\n\nMy classrooms are pretty small so when people decide to do this it's hard to just tune it out. If you want whisper to each other occasionally through class thats one thing but don't be goofing off or whining through class. Don't come if you're just going to goof off the whole time. I'm almost 24 where as most of the people in my classes are usually in the under 20 range so I think i might have a bit more awareness then them on these things. I don't know I could be wrong but it really fucking annoys me when people don't want to pay attention and they do it at other people's expense.\n\ntl;dr: People need to stop going to class just to socialize it's fucking disruptive and just ruins it for other people in the class.",
  "author": "SuspiciousChip8",
  "created": 1556928241,
  "over_18": false,
  "upvotes": 36,
  "upvote_ratio": 1.0,
  "comments": {
    "emgequz": {
      "link": "/r/CollegeRant/comments/bkfa9j/it_really_pisses_me_off_when_people_just_come_to/emgequz/",
      "text": "If I'm close enough to people like this, I'll straight up tell them \"if you're not gonna pay attention  just leave\" or something along those lines. Nothing explicitly rude, just blatant enough that they either shut up or leave. If I'm too far away but they're still so loud that they're distracting me, I give them the most obvious death glare I can manage while still paying attention. Works even better when they're sitting behind me because they see me turn around to do it.",
      "author": "livingto_love",
      "created": 1556933535,
      "upvotes": 4,
      "replies": {
        "emgetj9": {
          "link": "/r/CollegeRant/comments/bkfa9j/it_really_pisses_me_off_when_people_just_come_to/emgetj9/",
          "text": "Yeah thats really not in my personality at all lol.",
          "author": "SuspiciousChip8",
          "created": 1556933599,
          "upvotes": 1,
          "replies": {
            "emgeyxq": {
              "link": "/r/CollegeRant/comments/bkfa9j/it_really_pisses_me_off_when_people_just_come_to/emgeyxq/",
              "text": "See the funny thing is, me neither. It just really pisses me the fuck off when people are wasting MY money to sit in class and not pay attention, distract people around them, and just be so fucking rude to the professor. I care more about my education than I do about some people thinking in a bitch for asking them to be quiet.",
              "author": "livingto_love",
              "created": 1556933726,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "emgdn24": {
      "link": "/r/CollegeRant/comments/bkfa9j/it_really_pisses_me_off_when_people_just_come_to/emgdn24/",
      "text": "PREACH\n\n&#x200B;\n\nI'm always too afraid to say anything to these people because I don't think I could control my mouth, so instead I give them very dirty looks. But seriously it's so rude to the professor and the other students.",
      "author": "anniza",
      "created": 1556932574,
      "upvotes": 6,
      "replies": {}
    }
  },
  "updated": 1634064420
}