{"sid": "mb06mb", "link": "/r/CollegeRant/comments/mb06mb/this_was_supposed_to_be_my_spring_break_week/", "title:": "This was supposed to be my Spring Break week...", "text": "I attend a STEM-heavy college. Earlier on this year, the university preemptively cancelled our spring break. I don’t know anyone that uses the spring break to travel down to the beach and drink. Most people, myself included, literally use it to relax, work, study for any upcoming exams, or simply just sleep. But instead, we’re pushing on like business as usual. Makes me upset, since this has already been a long, strenuous semester. Semesters are usually like this in a normal year, but add the pandemic, social isolation and online school to that list, and it makes it much more harder. I honestly don’t know if there would be a “surge” in cases if Spring Break wasn’t cancelled. It probably wouldn’t have made a difference in the case numbers anyway..\n\nTl;dr: College cancelled spring break; college student upset about it.", "author": "atmoscience", "created": 1616453407, "retrieved": 1632843526, "over_18": false, "upvotes": 36, "upvote_ratio": 0.95, "comments": {"grv6dei": {"link": "/r/CollegeRant/comments/mb06mb/this_was_supposed_to_be_my_spring_break_week/grv6dei/", "text": "Thank you u/atmoscience for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1616453408, "upvotes": 1}, "gry31yr": {"link": "/r/CollegeRant/comments/mb06mb/this_was_supposed_to_be_my_spring_break_week/gry31yr/", "text": "I'm happy I had a spring break, but I ended up having 2 tests right after. Wasn't really a spring break if you ask me...\n\nIt'll be a relieving end of the semester at least. Hopefully it's the same for you.", "author": "drowned_anus", "created": 1616517849, "upvotes": 3}}}