{
  "sid": "q8zs94",
  "link": "/r/CollegeRant/comments/q8zs94/im_just_getting_shit_on_right_now/",
  "title:": "I’m just getting shit on right now",
  "text": "Midterms are kicking my ass, I’m still trying to grieve over the death of my grandfather, I’ve been ostracized by a group I thought things were going well with, I failed a test today, my grades in one class in particular are sinking, my depression is worsening, honestly I just feel like everyone hates me, and I kinda just want to disappear. I just, it feels like one thing after another after another, and things keep getting worse and worse and worse, like what the actual fuck am I supposed to do anymore? Everything just feels like it’s collapsing and I’m slowly going inwards. Life just feels like shit and I honestly feel like a bad person for feeling that way and not just pushing forward but damn I really just wanna collapse or something",
  "author": "throwawaya2ckid",
  "created": 1634339401,
  "updated": 1634423949,
  "over_18": false,
  "upvotes": 84,
  "upvote_ratio": 0.99,
  "comments": {
    "hgt5b2r": {
      "link": "/r/CollegeRant/comments/q8zs94/im_just_getting_shit_on_right_now/hgt5b2r/",
      "text": "I can feel you OP my grades are sinking no amount of cheating is helping my older brother used the death of my recently deceased aunty to make me feel like ish for having my mom and her 2 kids sleep in a car somewhere outside because yeah it’s my fault my mom had only $2.27 in the bank spends her money on herself didn’t plan a place to say literally months in advance and willingly becomes homeless because of it which isn’t a shocker didn’t pay for any of my moms moving costs or even gave her money after learning she was sleeping in a car i live with my aunties family which consists of a tween girl who’s downright disrespectful af a psychopathic cousin on drugs who’s no more than 17 a indifferent uncle and a severely autistic non verbal cousin who isn’t directed to use the bathroom 24/7 having a husband who is self centered always asks me for money having his sister and him gang up on me if he feels disrespected having his sister then tell me if i don’t like him etc divorce him like if that’s not an option for me and end it with my husband threatening self harm if I leave him like I truly care anymore",
      "author": "International-Ant-79",
      "created": 1634346675,
      "upvotes": 12,
      "replies": {
        "hgvf9ja": {
          "link": "/r/CollegeRant/comments/q8zs94/im_just_getting_shit_on_right_now/hgvf9ja/",
          "text": "Now that's fucked up",
          "author": "TAMUVIBEZ",
          "created": 1634400048,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgvf88v": {
      "link": "/r/CollegeRant/comments/q8zs94/im_just_getting_shit_on_right_now/hgvf88v/",
      "text": "I'm so sorry to hear that about your grandfather, and to top it off I can totally relate to getting your ass kicked by school. Anybody who wants to succeed in college ends up taking a hit but damn, these fkn classes like, and these fkn tests tho it can just all be too much to handle at one point like how tf are we even supposed to process all of this? One thing I've learned throughout college is that it feels like you're in a bubble. Just like back in high school where everything was, well, high school. But in college, it still feels like you're in a bubble where everyone is suffering from school but, guess what, life is still happening outside and shit is still going down. Like with your grandfather, these terrible things happen and wtf are we supposed to do, brush it off? Tf? And also school is a pain in the fkn ass and the ppl in college can be a pain in the ass as well. I hate accepting the fact that oh this is just life, but I never thought it would feel so unfair.\n\nFor you, I think one thing you can do is try to find a support system wherever with whomever it may be, even if it's on Reddit tbh. That, and just know that you're not alone",
      "author": "TAMUVIBEZ",
      "created": 1634400033,
      "upvotes": 2,
      "replies": {
        "hgvn0o6": {
          "link": "/r/CollegeRant/comments/q8zs94/im_just_getting_shit_on_right_now/hgvn0o6/",
          "text": "I’ve been googling support systems and stuff because the term is new to me, but like, how does one even get something like that? It just feels foreign like doing all that so like how does that even work?",
          "author": "throwawaya2ckid",
          "created": 1634403473,
          "upvotes": 1,
          "replies": {
            "hgvoi5h": {
              "link": "/r/CollegeRant/comments/q8zs94/im_just_getting_shit_on_right_now/hgvoi5h/",
              "text": "So, a support system is just anyone, or group of people, who will be there for you in times like the one you're having rn. I think the first step would be making an appointment with an on-campus counselor. I think they'll point you in the right direction plus they can be someone you can talk to as well! That's just my opinion, but you could also look and see if there's a campus-affiliated organization that acts as a support group where students help each other. I know at some universities, and at my university, they have that available",
              "author": "TAMUVIBEZ",
              "created": 1634404103,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}