{"sid": "kbtbnh", "link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/", "title:": "I’m failing every class this semester.", "text": "Just wanted to say that for those who might feel like they were the only ones struggling. Before it’s asked, this WAS my first semester of senior year. I took on a part time job to cover my bills, and all of my classes were writing-heavy. Missed the withdrawal deadline due to work and so I have to stick with these classes. I’ve never performed like this before, but asking to suddenly adjust to distanced learning, and see my bedroom and desk (which are often seen as a place to relax) as my new classroom wasn’t going to magically happen. \n\nEven better, I was teaching myself this semester. I’d be fine if I was actually able to go to the library or anywhere outside the house to actually focus, but I could never get into the subjects. It didn’t help that the only contact I got from all my professors but ONE was a weekly email with all the readings, assignments and PowerPoints to look at and do. More ironic, these are COMMUNICATION classes, and this is the worst communication I’ve seen. But yes, let the university pat itself on the back for its fantastic job as they sit in the county with the highest amount of COVID cases in the state. \n\nI got a single D in my freshman year from an entry level class that tanked my GPA, and just last semester I got it back up to what is was before then, but all that progress is gonna go away in an instant due to this semester. I’ve already accepted it, really just said fuck it because I’m paying the same amount of money I do every fucking year just to teach myself and fail out lol. I’d rather just work if it means not dealing with this bullshit.\n\ntl;dr couldn’t focus on courses due to the incredible lack of engagement and having to teach myself. Failing every class as a result, have little motivation to continue even in my senior year because the grading system is an absolute joke and it shows this year.", "author": "noiitamina", "created": 1607795271, "retrieved": 1632842785, "over_18": false, "upvotes": 268, "upvote_ratio": 0.99, "comments": {"gfz8hf1": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gfz8hf1/", "text": "You can still succeed. I believe in all of you but forget about what I think - you need to believe in yourself.", "author": "oakc510", "created": 1608077029, "upvotes": 1}, "gfugjzk": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gfugjzk/", "text": "You’re not alone! I started work during the beginning of the semester as well and my job was such a big workload when I was told it wouldn’t be. The scheduling sucked and that contributed to my burnout. I’m prepared to go on academic probation for the first time since I started college but it sucks", "author": "sweetnectarines", "created": 1607976570, "upvotes": 1}, "gfqnfml": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gfqnfml/", "text": "Don't worry! You're not alone! I actually seem to be in deeper water in the courses I thought I was going to pass! It is looking grim. Just hang in there! As difficult as that can be", "author": "Sovyyy", "created": 1607892337, "upvotes": 1}, "gfmsop7": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gfmsop7/", "text": "same friend same. \n\nI swear im gonna be stuck in college til im 35 at the rate im going through my classes.", "author": "boringgremlin", "created": 1607828000, "upvotes": 5}, "gfmge0x": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gfmge0x/", "text": "I hear you, man. I think I failed two of my courses, but because I’m repeating them next semester, the grades I get in those courses will replace my Fs. That means if I ace those two courses, my GPA could skyrocket back up.", "author": "simberry2", "created": 1607822989, "upvotes": 1}, "gfmevy1": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gfmevy1/", "text": "No option to switch classes to pass/fail to not hurt your GPA?", "author": "DanHassler0", "created": 1607822344, "upvotes": 5}, "gfm50ql": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gfm50ql/", "text": "I just finished my first semester of junior year failing 3 of my 4 classes, as well. I also took on a full time job to pay bills and rent and couldn’t withdraw from classes, so now I’m just taking the L and retaking the courses next semester.", "author": "childish-sadbino420", "created": 1607818831, "upvotes": 9}, "gflthck": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gflthck/", "text": "Just started college here and fuck, it's too hard...", "author": "foufou51", "created": 1607815454, "upvotes": 24}, "gflo6de": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gflo6de/", "text": "I have. 1.8 gpa", "author": "brackattack27", "created": 1607813947, "upvotes": 23}, "gflcsc4": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gflcsc4/", "text": "I was in the same boat a couple semesters ago and it trickled. I had a horrible year that ended with a close family member dying. I ended up medically withdrawing that semester but unfortunately failed the 4/6 of the next classes I had and my GPA is trash now. It sucks because I wanted to go to med school but I pretty much sealed the envelope on that one. \n\nEveryone struggles and it’s been a rough time lately. Don’t beat yourself up. I’m a senior too and now I’m freaking out cause my financial aid and all that. It sucks but we’ll get through it.", "author": "Ohhiitsmeyagirl", "created": 1607810189, "upvotes": 14}, "gflc6pm": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gflc6pm/", "text": "I'm on the verge of failing, but I think I'll pull through with straight Cs.\n\nI was in a very similar situation, but I studied extremely hard and aced my second round of midterms. \n\nThis week is my finals week so its kindof make or break for me. \n\nBut you're definitely not alone. (Also first semester senior)", "author": "BigLHours", "created": 1607809996, "upvotes": 14}, "gfl9tax": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gfl9tax/", "text": "ive always been a below average student but all around me, friends ive known to put all their effort into their studies, have failed classes and are being forced to retake them because of a lack of communication from their professors. these institutions continue to take our money knowing full well that we are literally having to teach ourselves and in a completely upside down environment.", "author": "serotonin-factory", "created": 1607809243, "upvotes": 52}, "gfkatcx": {"link": "/r/CollegeRant/comments/kbtbnh/im_failing_every_class_this_semester/gfkatcx/", "text": "You’re not alone bro", "author": "matsudasociety", "created": 1607797893, "upvotes": 93}}}