{"sid": "pk7dp8", "link": "/r/CollegeRant/comments/pk7dp8/online_college_rant/", "title:": "Online college rant", "text": "I’ve never been to college cause i started with it during covid. Can’t concentrate in online classes and it’s fucking up my grades\n\nI understand that people have it worse out there but i’m just so done with this shit and in my country they’re not planning to start them on campus anytime soon", "author": "boredcollegekid_", "created": 1631094660, "retrieved": 1632841130, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"hc1h1ux": {"link": "/r/CollegeRant/comments/pk7dp8/online_college_rant/hc1h1ux/", "text": "Thank you u/boredcollegekid_ for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1631094660, "upvotes": 1}, "hc3uvms": {"link": "/r/CollegeRant/comments/pk7dp8/online_college_rant/hc3uvms/", "text": "Yeah last time I checked the news yall had it real bad. I wish this pandemic would just end already. The hospital I work at we ran out of beds in the ER so we used recliner chairs and put curtains\n\nSome of the patients don't have a room so I would see patients sleeping in a hospital bed in the middle of a hallway while im pushing a medicine cart on a delivery round (im a pharmacy technician). Also we would get alerts on the announcements that somebody went into sepsis in the Er lobby. As much as I like my job I don't like how there is a real chance that I could walk past a random patient and they stop fucking breathing", "author": "TheRapidTrailblazer", "created": 1631135898, "upvotes": 1}, "hc269ny": {"link": "/r/CollegeRant/comments/pk7dp8/online_college_rant/hc269ny/", "text": "May I ask, what country you’re in? \n\nI too did online classes last year for both semesters, for me and this is just me, it worked out great cause I had a job so I didn’t have to worry about driving around as much. \n\nBut now we’re taking in classes, and it’s made me focus more vs online which made me fall asleep a lot. \n\nI’m really sorry you’re going through this, I know it’s hard for a lot of students right now. I do hope your school soon changes that.", "author": "DumbHuman53", "created": 1631110010, "upvotes": 2}}}