{
  "sid": "pr1uh1",
  "link": "/r/CollegeRant/comments/pr1uh1/i_think_i_made_a_mistake/",
  "title:": "I think I made a mistake…",
  "text": "Hi everyone. I just started college a month ago and I think I’ve made the wrong decision in my major. I have been completely miserable and not enjoying what I’m doing. I’m a bio major, and I loved doing college-level labs and science classes in high school…but now that I’m in college I’m not liking it at all. The stress level is out of control because they make us go so fast. I have two chronic illnesses and “fast” is just not in my vocabulary. It makes me feel (the way professors/other students treat me) that only those who are quick minded and able-bodied are able to succeed in a stem field. It hurts because all of my life I thought I wanted to be a scientist, but now I feel like I’m not meant to do it in this volatile environment. I’m also terrible at math, so I struggle anytime there’s math involved. I’m very artistic and creative, but I feel I don’t have the skills necessary to pursue that path. I’ve never been in an art class or anything like that, I just like doing it for fun. \n\nBasically, I’m having a crisis. I know the biggest thing most people will say is give it a chance, but I had a feeling things would be like this back in high school. I feel like I chose my major based on what I thought was “stability.” Maybe stability is doing what I truly love…I’m not sure.",
  "author": "artsyspaceperson",
  "created": 1632028395,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hdh3udd": {
      "link": "/r/CollegeRant/comments/pr1uh1/i_think_i_made_a_mistake/hdh3udd/",
      "text": "Sorry you are in this situation. Its hard to know what you really want to do in high school. I always though I was going to be an engineer and now I'm in construction management and thinking about switching majors again as a sophomore. College courses in general move fast, since you only work on a course for 12-14 weeks, where in high school you work on a course for 180 days. I would recommend trying it our a bit longer but it is worth it to try out classes outside your major. If you have to get tutoring or talk with your professor.",
      "author": "Reaper_gaming_afk",
      "created": 1632066522,
      "upvotes": 2,
      "replies": {}
    },
    "hdh2sn8": {
      "link": "/r/CollegeRant/comments/pr1uh1/i_think_i_made_a_mistake/hdh2sn8/",
      "text": "That’s the problem with college it could make you rethink all of your passions really quick due to labs, exams or even the Professor just being an asshole. If you know you really want to do this but isn’t mentally prepared yet, I would say take a gap year and figure out what you really want to do. Or during that time you can create a plan on how to tackle your organizational skills on how to study better. \nIf a gap year isn’t optional for you I would say change your major to something you would really like to try out and see how it goes. During the meantime you can think about science and if you want to go back. As a freshman you have time to change your mind, don’t let anyone influence you choose what’s best for you.",
      "author": "RachelJ57",
      "created": 1632066082,
      "upvotes": 1,
      "replies": {}
    },
    "hdgx4si": {
      "link": "/r/CollegeRant/comments/pr1uh1/i_think_i_made_a_mistake/hdgx4si/",
      "text": "Sorry about this but it’s a good thing you’re realizing your true interests early. Usually you don’t actually have to officially declare your major until you’re about halfway through your degree. So can you just simply start taking classes in another major and declare that major?",
      "author": "renebeca",
      "created": 1632063633,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634063290
}