{
  "sid": "i9tx7c",
  "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/",
  "title:": "When you went from having a few in person classes to all online",
  "text": "The title says it all. I had a few in-person classes, but now my schedule is basically all online. I didn't think it was worth it to pay Room & Board to sit in a room all day to take classes online. It's disappointing because I wanted the college experience, however, with the COVID-19 pandemic it's not looking like it'll happen this year :((",
  "author": "L7NDON",
  "created": 1597437867,
  "over_18": false,
  "upvotes": 76,
  "upvote_ratio": 0.95,
  "comments": {
    "g1qglsw": {
      "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1qglsw/",
      "text": "If it makes you feel better, even those who have all in-person classes (who have been far and few across the country in my experience) won’t have the typical “college experience” either. Classroom interactions are looking different as well as extracurriculars, events, and social time.",
      "author": "purplemayweed",
      "created": 1597585520,
      "upvotes": 1,
      "replies": {}
    },
    "g1mqif0": {
      "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1mqif0/",
      "text": "3 out of 5 of my classes are online as of today and I suspect that number will go up. It's not a *huge* deal, since I'm an English major and a lot of my assignments are writing, but I'm also a criminology minor and those classes rely on discussion that obviously goes a lot better when it's in person :\\\\\\\\ I guess I'll have a lot more time to adjust to my apartment then lol",
      "author": "longfurbymother",
      "created": 1597515980,
      "upvotes": 2,
      "replies": {}
    },
    "g1iw68t": {
      "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1iw68t/",
      "text": "Two of my classes got outright cancelled and three of em got moved to online. I’ll be in school forever.",
      "author": "richdegraff",
      "created": 1597465619,
      "upvotes": 3,
      "replies": {}
    },
    "g1ikn61": {
      "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1ikn61/",
      "text": "My brother and I both decided to remain home last week (me) and him this week. We’re both getting adv. room deposits back and R&B taken off our statements due to classes changing last minute to online.",
      "author": "KingdomsPath",
      "created": 1597460481,
      "upvotes": 7,
      "replies": {
        "g1il85q": {
          "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1il85q/",
          "text": "I went with the same route. It’s a tough decision, but ultimately I feel like it’s the best choice if you have all online classes. Hopefully there will be another chance soon.",
          "author": "L7NDON",
          "created": 1597460856,
          "upvotes": 3,
          "replies": {
            "g1ild34": {
              "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1ild34/",
              "text": "I would be 45 minutes away and he 6hrs. We both wished to be on campus just for our mental health sake and both of doing better in that environment but it just isn’t worth all the money especially with them charging full tuition and all these activity fees",
              "author": "KingdomsPath",
              "created": 1597460941,
              "upvotes": 2,
              "replies": {
                "g1io6nj": {
                  "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1io6nj/",
                  "text": "I would be a little over an hour. I also thought it would be good for me to stay on campus because of the activities, but with covid it’s so bland that it’s basically nothing with some events being online. I understand that they’re trying, but it just doesn’t feel right. I just couldn’t justify staying to complete my school work online. I like to stay active, and with most events being mostly online with in person being so heavily limited it just didn’t feel like a good time.",
                  "author": "L7NDON",
                  "created": 1597462225,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g1hxr2n": {
      "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1hxr2n/",
      "text": "I’m in the same boat... emailed the presidents office for an explanation but no response... understand the move to online but still not okay to charge full tuition & room/board the same time. Almost seems like a “bait and switch” scheme if I knew any better",
      "author": null,
      "created": 1597447358,
      "upvotes": 17,
      "replies": {
        "g1hydb3": {
          "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1hydb3/",
          "text": "I guarantee they’re trying to milk money from their students because I know all of them suffered a loss from the closing in the spring semester. Soon as the deadline passes for payment, bam everybody is now home",
          "author": "L7NDON",
          "created": 1597447683,
          "upvotes": 8,
          "replies": {
            "g1lwjdg": {
              "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1lwjdg/",
              "text": "It really is a money scheme. Throughout the summer I saw numerous posts on this sub and r/college about all the mixed signals they're giving and how everything will return to online after colleges have small outbreaks.",
              "author": "gandreeva18",
              "created": 1597507256,
              "upvotes": 6,
              "replies": {
                "g1m145k": {
                  "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1m145k/",
                  "text": "I feel like if they are gonna charge us an absurd amount of money for a useless education and useless fees that we won’t get to see that the classes should be little to no work and easy then. Not saying they should be, but we are still in a pandemic even tho most act like we are not it would be nice to not be stressing over pointless classes that won’t amount to anything in a few years when we graduate Anyways.",
                  "author": "L7Weeniiee",
                  "created": 1597508770,
                  "upvotes": 1,
                  "replies": {
                    "g1m2d1m": {
                      "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1m2d1m/",
                      "text": "I agree and I hope your university isnt charging too much for tuition. \n\nProfessors are making these classes so much harder for no reason.",
                      "author": "gandreeva18",
                      "created": 1597509146,
                      "upvotes": 1,
                      "replies": {
                        "g1m3gtk": {
                          "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1m3gtk/",
                          "text": "Lmao I had a professor say we need to dedicate 5-6 hours a week for their class. Like they are not my only class and it’s English literature. I’m just trying to graduate and my school is charging online charges for everyone since they might make us go online.",
                          "author": "L7Weeniiee",
                          "created": 1597509479,
                          "upvotes": 2,
                          "replies": {
                            "g1mpq55": {
                              "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1mpq55/",
                              "text": "Lol the funnier professors are those who say we need you to dedicate 15 hours if you want to do well. MEANWHILE... I will be taking 19 credits this semester... I am not sure if they expect you \n\n&#x200B;\n\nLast semester, my professor changed our final exam percentage from 30% to 40% without notifying any of us. Needless to say everyone received a lower grade than they anticipated",
                              "author": "gandreeva18",
                              "created": 1597515701,
                              "upvotes": 1,
                              "replies": {
                                "g1mqk7j": {
                                  "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1mqk7j/",
                                  "text": "Some professors need to get reviewed and need to start changing how they teach cuz it ain’t working. There are some who are good at teaching and I love them but they change because of like one person complaining.",
                                  "author": "L7Weeniiee",
                                  "created": 1597515999,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "g1qn8oq": {
              "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1qn8oq/",
              "text": "Welcome to every college in America right now. Everyone is in the same boat. Anyone who is interested, check to see if your specific school has a sub. I found mine and it has been WAY more helpful than the school itself has been. Plus, the feeling of being a part-of is alive and well",
              "author": "DisappearHereXx",
              "created": 1597589644,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g3axk9a": {
          "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g3axk9a/",
          "text": "This is a total joke. It isn’t bait and switch. You made the decision to chance in person classes.",
          "author": "snoboy8999",
          "created": 1598747105,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g1ho8x4": {
      "link": "/r/CollegeRant/comments/i9tx7c/when_you_went_from_having_a_few_in_person_classes/g1ho8x4/",
      "text": "agreed",
      "author": "deathworld123",
      "created": 1597442436,
      "upvotes": 7,
      "replies": {}
    }
  },
  "updated": 1634061835
}