{
  "sid": "q0vnud",
  "link": "/r/CollegeRant/comments/q0vnud/i_hate_having_professors_walk_behind_me/",
  "title:": "I hate having professors walk behind me",
  "text": "I took an exam last Friday and my professor of course walks around the room to catch cheaters. I sit all the way in the back and I'm almost against the wall. During his walks around the room, he would often stand right where I was seated. Not because I was suspicious but it just helps him see the entire class. I am a SA survivor and it only occurred several months ago and so I hate people behind my back like that. I'm somewhat more comfortable with peers my age but someone older, standing up, puts me into a panic attack. I cried in silence during my exam and I couldn't focus. It was an easy exam but I was just getting so scared and thinking about my SA experience, that I screwed up and failed the exam.   \nThere's no way of talking to him about it. I haven't been able to talk to anyone but some support groups online about it. I hate that he might think I'm dumb. I just wish he would use a lockdown browser and let me be alone giving me no chance to panic.",
  "author": "ThrowAwayMyCollegeR",
  "created": 1633311721,
  "updated": 1634093886,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.73,
  "comments": {
    "hfcve49": {
      "link": "/r/CollegeRant/comments/q0vnud/i_hate_having_professors_walk_behind_me/hfcve49/",
      "text": "Can you seat at the front for the next exam? From experience, professor’s hardly pay any attention to students in the front row during the test.",
      "author": "MyHeartIsByTheOcean",
      "created": 1633359567,
      "upvotes": 5,
      "replies": {}
    },
    "hfaza4g": {
      "link": "/r/CollegeRant/comments/q0vnud/i_hate_having_professors_walk_behind_me/hfaza4g/",
      "text": "Unfortunately, if he doesn't know he is doing something wrong, he won't know how to help you.  Hell, I'm not sure how to help you, but if/when you can tell someone in person, your college (if in the USA) probably has an office of councilors who can get you a letter of accommodation.  You would work out what accommodation(s) you would need for class and they will provide a letter for your professors.  Your conversation with the councilor is confidential and the letter will only provide the accomms. you need, no further details.  As long as your accomms. are reasonable given the class, your professor is obliged to abide.  I am a faculty member and if you wish, you may DM me and I can help you find out your school's policies.",
      "author": "AgentIndiana",
      "created": 1633314269,
      "upvotes": 17,
      "replies": {}
    },
    "hfbrz2u": {
      "link": "/r/CollegeRant/comments/q0vnud/i_hate_having_professors_walk_behind_me/hfbrz2u/",
      "text": "Hey! Speak with your school's disability services. If you don't already have a therapist, definitely try to find one. Most colleges have free ones available for the time you are attending there. They can always explain to your professor in a way that doesn't \"out\" your trauma but makes it clear that the behaviour makes you uncomfortable because of your history. They're usually great with keeping things as private as possible. I have ADHD and PTSD and being in quiet rooms like that listening to the shuffling and the sniffling and the moving around and just white noise that people make gets me so anxious I can't think. So basically my accommodation is that I get to leave all my stuff behind in the classroom and only take my exam stuff with me. I have a female staff member that stays in a private room with me while I take my test. It's been great. I wish you luck. I know it's hard to talk about things like this but it really, truly is in your best interest to speak with your disability support team at your uni.",
      "author": "anthrosaturn",
      "created": 1633333074,
      "upvotes": 6,
      "replies": {}
    },
    "hfcpgvl": {
      "link": "/r/CollegeRant/comments/q0vnud/i_hate_having_professors_walk_behind_me/hfcpgvl/",
      "text": "This could have easily been resolved by you just speaking up and letting him know. You are going to have to learn to advocate for yourself. Sitting there crying doesn't solve anything.",
      "author": "daisuki_janai_desu",
      "created": 1633356922,
      "upvotes": 1,
      "replies": {}
    }
  }
}