{
  "sid": "kw3sa8",
  "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/",
  "title:": "International students are so fucking unlucky they have it the worst",
  "text": "My landlord is being a wholeass fucking bitch, but what can I do about it sitting in another country literally across the world?? Absolutely nothing. I'm pulling all nighters(NOT because I procrastinated or anything) just to be able to attend classes. What is a sleep schedule?? Circadian rhythm W H O??? social life? Dead. Hah try having friends when ur up only when they are asleep. At this point I'm not even getting access to food - only being able to have 1 proper meal with my family and having to cook for myself (I don't know how to) every other time. I'm fucking living on grilled cheese sandwiches. It's really fucking hard. I had an anxiety attack today because of my dumb fucking landlord and the first day of classes reminding me how fucking hard last term was. I cannot do this. It's killing me that we're paying significantly more than local students for this shit. Fuck my landlord, fuck university. Sorry for being born in the wrong part of the world I guess, can't even fucking do anything about it???\n\nOH and for FUCKS SAKE THE FUCKING VISAS. I don't think anyone gets how fucking soul crushing it is to get all excited about FINALLY getting to campus and then cancelling the whole fucking trip because a bank document needed for the visa is taking too long. And the fucking document shows up within the next half an hour. The plans getting cancelled and then back on and then cancelled. Flights are stinking expensive and getting cancelled left right and centre. Even if you have everything worked out, your flight can STILL FUCKING GET CANCELLED. there's no way out of this shitty fucking country even though you're paying so much for the fucking experience of being outside here.\n\nTry being a first year international student during covid. Sorry im just really pissed and really fucking scared.",
  "author": "gamergirl12305",
  "created": 1610494659,
  "over_18": false,
  "upvotes": 226,
  "upvote_ratio": 0.98,
  "comments": {
    "gj8gunn": {
      "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gj8gunn/",
      "text": "I know an international student who discovered he hated his major when he started college, but couldn't change it because that would be some sort of visa fraud. It really sucks - there's got to be an easier way for you all.",
      "author": "Paesana",
      "created": 1610637723,
      "upvotes": 1,
      "replies": {}
    },
    "gj339qc": {
      "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gj339qc/",
      "text": "Woah this sounds like me honestly, I also have a messed up sleeping schedule due to time difference from Korea, and I keep paying my apartment in dollars, which means the bank changes it into won. It has been hard since the exchange rate keeps changing and apparently I owe a lot despite paying the same quantity every month... it sucks really to be a college student during a pandemic. Let’s hope this gets better :)",
      "author": "Luexd",
      "created": 1610516267,
      "upvotes": 3,
      "replies": {
        "gl24lwz": {
          "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gl24lwz/",
          "text": "So wait, are you stuck here? If you are, housing prices outside cities/college cities are going sky high due to the mass amount of people moving out of them.  \nMy family was about to get a house built outside Seattle, but now that's not going to happen as prices there soared up 30% in one year.",
          "author": "ZenithCrests",
          "created": 1611815946,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gj2q2id": {
      "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gj2q2id/",
      "text": "International student here (studying in the US), try book a flight through an agent (so when it gets cancelled, the agent is obligated to find you a new one). I’m sorry this happened to you. For me, the visa process is stressful too. I cried multiple times because of flights getting cancelled, you’re not alone.",
      "author": "hoodie_1225",
      "created": 1610508077,
      "upvotes": 17,
      "replies": {}
    },
    "gj2pp3f": {
      "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gj2pp3f/",
      "text": "As someone who isn't studying in their home country, yeah. I feel like I'm getting fucked from all angles",
      "author": "Elusth",
      "created": 1610507868,
      "upvotes": 27,
      "replies": {}
    },
    "gj2dlpp": {
      "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gj2dlpp/",
      "text": "[removed]",
      "author": null,
      "created": 1610501395,
      "upvotes": -11,
      "replies": {
        "gj2yfhf": {
          "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gj2yfhf/",
          "text": "Hey man let’s not be racist okay? You’re in college... you should know better by now",
          "author": "07hesst",
          "created": 1610512978,
          "upvotes": 30,
          "replies": {
            "gj3onrb": {
              "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gj3onrb/",
              "text": "What’s so racist about what I said? Covid-19 originated in Wuhan, China. I have been to China, and they have the wet markets. China tried to silence the whistleblowers to avoid being the sole sufferer in this situation. Hundreds of thousands people died around the world because China knew about the virus, yet they didn’t want to shutdown the international travel. China has recovered very quickly, all other countries are fucked. China refuses to let in the WHO investigation team who want to explore the origins of the virus more carefully. What’s so racist about what I said? Or are you one of the paid CCP shills?\n\nEdit: checked your comment history. Well, looks like you are Chinese. Heh, who would have guessed. Protecting the image of the CCP much? Do you like to get free social credit for defending the CCP on the internet? Or maybe a free wig made from the heads of Wuighur prisoners?  What about Tianmen square massacre, buddy? Am I racist again for pointing this out?",
              "author": "StarDingo",
              "created": 1610536213,
              "upvotes": -2,
              "replies": {
                "gj432y9": {
                  "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gj432y9/",
                  "text": "Wth bro?!? Even if he is Chinese, what’s wrong with  it? No one gets to choose their nationality the moment they are born. Even if you want to blame China for the virus, blame the government for not taking proper action, don’t blame the people. They are just like us, all suffering. \n\nTalking about rising cases? Blame those who underestimated the virus and did not follow social distancing. I can guarantee that there are tons of people out there not bother wearing mask when they are in public. It’s all about moral after all.",
                  "author": "duckie_123",
                  "created": 1610547101,
                  "upvotes": 8,
                  "replies": {
                    "gj46j1l": {
                      "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gj46j1l/",
                      "text": "Dude, it’s known that Reddit is flooded with Chinese bots. Tencent owns a huge share of Reddit. Chinese students all over the world are protesting to silence the rumors that the virus started in China. They are actively trying to shift the blame to other countries.\n\nEdit: it’s not the fact that he is Chinese. I love the Chinese culture, but I hate the Chinese Communist Party and everyone who defends it. You can’t change the place where you were born, but you are responsible for what you believe in.\n\nEdit 2: you argument “Well yeah, the virus leaked, but it’s your fault that your government didn’t take the right measures.” I call bullshit. It’s equivalent to the events in Chernobyl in 1986. The huge doses of radiation were spread all across the Eastern Europe and Central Asia. The traces of radiation were even found in Ireland. In this case, you can also say “Well, it’s the fault of those governments that didn’t act accordingly to stop the radiation exposure” \n\nChina fucked up. Period. China does not have the authority to test any country’s defense systems. You are saying that the Chinese people are suffering. Really? As far as I know, they have almost fully recovered. Some people say that China released the virus to curb the rising protests in Hong Kong.",
                      "author": "StarDingo",
                      "created": 1610548984,
                      "upvotes": -4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gj36fv6": {
          "link": "/r/CollegeRant/comments/kw3sa8/international_students_are_so_fucking_unlucky/gj36fv6/",
          "text": "Uh yikes",
          "author": "Lyx_Chai",
          "created": 1610518664,
          "upvotes": 4,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634062113
}