{"sid": "pd9of3", "link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/", "title:": "Orientation leaders (also students) SCREAMING sexual noises and innuendos on the quad during orientation, and trying to get my entering class to LITERALLY CHANT SEXUAL THINGS!!!", "text": "I am completely boggled at what happened yesterday afternoon. After a full of day of sitting there listening to faculty talk about how amazing our school is and how smart and lucky we are to be accepted (only 16% undergrad acceptance rate apparently - I didn't know it was so low), things went to hell as soon as we walked out out onto the quad. \n\nThe orientation leaders were getting everyone to chant sexual noises (moans etc) and innuendo out on the quad. I didn't join in on the \"fun.\" I turned around, walked out and drove back to my apartment. I am a non-traditional student in my mid-30s and it felt so weird being in such a sexually charged environment surrounded by kids nearly half my age. Not my cup of tea at all. I am not here for that.\n\n&#x200B;\n\nImportant note: This is NOT a party school. This is a very nerdy niche professional doctorate-granting research university. I am completely shocked at the difference between the faculty's professionalism, which is also expected of us as students, and the awful behavior of their orientation leaders, who represent our faculty. One of the major reasons I chose this school over others is because, according to my research, it is NOT a party school. Clearly, I was wrong about that. \n\n&#x200B;\n\nI don't know what to think at the moment. Classes start on Monday and I'm going to spend the weekend studying, as I should.", "author": null, "created": 1630156920, "retrieved": 1632950751, "over_18": false, "upvotes": 144, "upvote_ratio": 0.92, "comments": {"hbk4g47": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/hbk4g47/", "text": "What actually happened?", "author": "snoboy8999", "created": 1630756016, "upvotes": 1}, "hassenr": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/hassenr/", "text": "Just go to school and have no social life if you want, but don’t report students that want to have fun at an orientation. You sound very uptight and judgmental, and quite frankly I don’t feel any sympathy for your situation.", "author": "randomassname0120", "created": 1630242900, "upvotes": 3}, "hasm963": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/hasm963/", "text": "Kids are idiots, regardless of what school they go to. Harvard, Yale, UVA, UofM…nearly every school has a party culture, even if they’re not known for partying.\n\nMany of these kids are from affluent families and are sheltered, and there’s definitely hormones to blame as well. It’s all part of growing up.\n\nI mean, what did you expect? A freshman is a freshman. Kids do stupid things. They’re fucking horndogs.", "author": "CalmingVisionary", "created": 1630239276, "upvotes": 1}, "haroa4q": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haroa4q/", "text": "Go to class, finish your day, then go to student services and don't loiter, but demand to speak to the head, in office. Let him know firmly you feel disgusted, and exactly what transpired.", "author": "bananaguard36", "created": 1630212178, "upvotes": 1}, "haqxoie": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haqxoie/", "text": "Maybe try having fun with them", "author": "csems", "created": 1630197524, "upvotes": 5}, "haqr5ik": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haqr5ik/", "text": "If they aren’t being vulgar/offensive/harassing, just avoid them but don’t ruin the fun", "author": "5krishnan", "created": 1630194218, "upvotes": 7}, "haqpr3d": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haqpr3d/", "text": "I mean...I don't know what you expected honestly, most of the other freshmen are going to be around 17-20. And DO NOT report it or you run the chance of getting a target put on your back, just lay low and ignore the immaturity so you can secure that degree in peace.", "author": "toofeduptocare", "created": 1630193527, "upvotes": 8}, "haqofw8": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haqofw8/", "text": "lmao", "author": "Badfriend112233", "created": 1630192876, "upvotes": 3}, "haqijfn": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haqijfn/", "text": "You are a non traditional student but these are brand new undergrads who have been stuck at home for a year and more. Most are 18 years old and just got set loose on college for the first time after all that, and the orientation leaders are prolly just a year or so older. \n\nNot the most professional but cmon it’s not worth reporting. Just don’t partake.", "author": "zh_13", "created": 1630189984, "upvotes": 23}, "haq658u": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haq658u/", "text": "is it possible to skip orientation events or icebreakers and whatnot? when fall quarter rolls around I really don't want to participate at all", "author": "jjspacecat10", "created": 1630184146, "upvotes": 7}, "haq5fwb": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haq5fwb/", "text": "That's just inappropriate I can understand doing that in the dorms but not when new students are looking out the property that just makes the school look bad", "author": "mingxingai", "created": 1630183829, "upvotes": 3}, "haplz3g": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haplz3g/", "text": "I’d like a fuller run down of the story like the context for the moaning and chanting.", "author": "Slight_Reason", "created": 1630175144, "upvotes": 24}, "hapkgs9": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/hapkgs9/", "text": "Sounds like a good time. Wish my school had fun, goofy times like that", "author": "SmegmaPiFraternity", "created": 1630174500, "upvotes": 18}, "hapajcz": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/hapajcz/", "text": "As someone who also attends a nerdy niche school and is 30+, I’m really kind of appalled. We’re all so quiet and honestly awkward on campus, even our professors. I can’t imagine how uncomfortable this must have been.", "author": "introverted_lesbian", "created": 1630170375, "upvotes": 9}, "hap90pq": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/hap90pq/", "text": "This sounds like a title nine discussion waiting to happen", "author": "SincerelySinclair", "created": 1630169715, "upvotes": 18}, "haovsxt": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haovsxt/", "text": "That sounds *awful* wow. I'm a 31year old nontrad as well & would have done the same thing as you.", "author": "huntsber", "created": 1630163917, "upvotes": 26}, "haosdwy": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haosdwy/", "text": "Those kids are acting unprofessional while working. You could report it to an adult in student services. Tell the faculty who you saw that day and complain how unprofessional their student employees are. Do that stunt in any job and you will be immediately terminated for displaying inappropriate sexual conduct.\n\nI've been to various orientations and tours, and I have always had pleasant and professional students.", "author": "RainyFL", "created": 1630162407, "upvotes": 38}, "haok6nt": {"link": "/r/CollegeRant/comments/pd9of3/orientation_leaders_also_students_screaming/haok6nt/", "text": "Is there someone in student services you could speak to about your concerns? Usually, orientation leaders work for a program that is housed in student services and assigned to a director on staff (though that could differ from one place to the next). It might not change anything, and I find it hard to believe they don’t know about this already, but it’s one potential option.", "author": "PhDapper", "created": 1630158608, "upvotes": 62}}}