{"sid": "kyazeo", "link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/", "title:": "University senior, regretting my major...", "text": "Hi all! I graduate this May, and I'm currently feeling like I just wasted my time in college. Ever since I was a kid, I wanted to go into STEM. By the time I got to middle school, that dream pretty much died, and I became discouraged and didn't think anything was worth the effort if I couldn't get it right the first time. I went to a really competitive high school and I really just didn't try anymore because everyone seemed like geniuses. I really did enjoy math and my science classes, I even took AP Chem even though I was the worst in the class. By the time we had to apply to college, I had a mediocre GPA and no passion for anything. I got into a state school, and I chose to major in something that came easily to me: English. I am taking my last class for it this semester and then I graduate. I feel like I haven't learned *anything*worthwhile. Everything I have learned I could literally just look up on SparkNotes or Shmoop. Every paper I write ends up being the same and I just feel bored. And because I truly don't know what to do with my life and just the general dissatisfaction at what I chose to study, I am going to pursue a teaching credential after graduation, just for the time being. While I teach, I'll save up money and whatnot, since my parents paid for my education this time around. I really would like to go back to school in the future for something STEM related and go into research, but I just cannot see this happening, I feel like I am just crazy. I truly wish I had just bitten the bullet and pushed myself these past 4 years. The only time I truly felt like I was learning something was during a G.E Biology course I took 2 years back. It was awesome and I loved it. I even considered changing my major to biology back then. Although my interests lie in astrophysics, science is just so much more satisfying to learn, you know? I think I should've just gotten over my fear of failure and gone for it. Anyways, is going back to school later in life at least possible? Or am I out of my mind? I turn 22 next month, I don't plan on having kids anytime soon, nor getting married. I seriously cannot see myself teaching until I retire, and I feel like my B.A in English is basically worthless. Ahh! I seriously regret choosing English. No disrespect to any fellow English majors, but my passions just aren't within the pages... Any advice is appreciated!\n\nTL:DR: I feel like I chose the wrong major and shoulda gone for STEM. Will be going into teaching for the meantime, but I want to go back to school for STEM in the future.", "author": "puppy227", "created": 1610767787, "retrieved": 1632842953, "over_18": false, "upvotes": 120, "upvote_ratio": 0.99, "comments": {"gji1ffq": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gji1ffq/", "text": "For now, I think you should start teaching cause in that way there's some money flowing into your bank account. Meanwhile, why not check out some online courses on STEM? I don't know which specific subject you want to go into, but there are tons of available online courses. If after a couple of years of teaching, you saved enough money to go back to school without taking out a student loan, go do it. But I think there are already other cheaper, more convenient ways of learning, especially learning online. So try to explore that possibility.", "author": "p_collegelifehustle", "created": 1610829094, "upvotes": 2}, "gjhxx76": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjhxx76/", "text": "I'm majoring in biology and sometimes I wonder why I even try, but other days I feel like I'm kicking ass. All that math and chemistry. Sometimes it's super easy to me and I'm figuring it out and then I get hit with an F on a test I'm confident on. It's definitely something.", "author": "Mkg102216", "created": 1610827605, "upvotes": 1}, "gjhp34g": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjhp34g/", "text": "Oof this one hit hard. The last four years have basically just been the realization that everything I did in class I could have done at home...and paid way less for it. Honestly I feel like if you're not getting some sort of tech training for a specific job (like a doctor), the whole thing is kinda pointless. Not to rag on humanities or anything (spanish/hist major here) but I think they're way more intuitive and pushing for everyone to go to college is just creating a qualification saturation.", "author": "Gracchusinbyzantio", "created": 1610823353, "upvotes": 2}, "gjh2ire": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjh2ire/", "text": "Wow I’m so glad I’m not the only one who feels like this. I’m graduating in May with a major in marketing and I absolutely hated all 4 yrs of college. I didn’t enjoy any of my classes expect for these design classes I took as electives. Really considering going back to school for graphic design or interior design once I have a stable career. \n\nMy issue is my family is Asian, so to them majors that aren’t engineering, business, medical, or lawyer is useless. So I felt pressured to pick a major that would make a good amount of money over what I would actually enjoy. I honestly realized I hated my major halfway through college and would’ve changed it but had no idea what I wanted to change to at that time so I just kept going. Now I’m stuck with a degree I hate and trying to figure out how I can change it", "author": "RVboulder", "created": 1610814352, "upvotes": 3}, "gjgyg7h": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjgyg7h/", "text": "Wow, this makes me feel better about choosing the wrong area of focus. Like at least for me I ended up in the major and minor I love but I chose the wrong area of focus within my major. Right now I'm in the process of looking at grad programs to potentially correct this mistake (and so I can teach college in the future) but at least I'm in a field I love.", "author": "squirrel8296", "created": 1610812599, "upvotes": 3}, "gjgjbyy": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjgjbyy/", "text": "i’m only a freshman and i’m studying pharmaceutical engineering, but i freaked out when i started university because i thought i couldn’t continue with my major (which is a mix of all the sciences + math). my fear of failure made me doubt my decision, which i was so sure of before i started. english has always been easy for me (and languages in general), so i thought that was a right major for me & i told my mom i wanted to change to german & english. \n\nyou know what she told me? she told me if i really thought that was right for me, then she would immediately let me change, but she said i shouldn’t let my fear of failure dictate my life. \n\nso my advice to you is absolutely save up and start another major. don’t let your fears dictate your life decisions. you’re sure you love science & you love stem, and even if you fail, you should pursue that passion.", "author": "jennie033", "created": 1610805736, "upvotes": 2}, "gjge8xn": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjge8xn/", "text": "Hey the minimum wage is going to 15 dollar here pretty soon If you want you can flips burgers at McDonald I'm pretty sure you won't be bored.", "author": "papichuloswag", "created": 1610803291, "upvotes": -3}, "gjgclxk": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjgclxk/", "text": "My mom went back to school to get her management bdegrre when she was in her mid 40's. My aunt went to nursing school her late thirties. My accounting teacher got his bachelor's in education around age 50. My other accounting professor....idk when he went to go into teaching but he's like 80 now and said he went into it because he served all he could in the military and didn't have anything else to really do with life. Figured it wasn't too late to attempt to go into his passion. I've even had a 60yr old grandma in one of my gen eds. It's never too late my friend. And your plan of saving up sounds pretty solid", "author": "vness1213", "created": 1610802439, "upvotes": 3}, "gjg95tj": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjg95tj/", "text": "22 is hella young. Definitely nothing wrong with starting college again.", "author": "PersonalNaming", "created": 1610800579, "upvotes": 5}, "gjfscmx": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjfscmx/", "text": "Like you, I started college a language major because I was good at it and didn't think I could handle scientific studies. After my first year I passed everything but my heart wasn't in it; changed to biology the following year and never looked back. About to get my masters so it was not a mistake!\n\nYour age really won't be much of an issue, some of my classmates in the first year were 26 and nobody cared. The biggest tip I can give you is this; dedication to learn is much more important than any knowledge you have coming in. Put in the work and you'll probably succeed.", "author": "ColonConoisseur", "created": 1610788459, "upvotes": 3}, "gjfqv09": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjfqv09/", "text": "It’s okay to not use your major.\nMy mom has a degree in kinesiology with an emphasis in sports medicine. Basically, she was a sports physical trainer. She LOVED IT, and was damn good at it. She was the top of her class, but got married to my dad before she was offered a job. Soon after my older brother was born (prematurely), she was offered a job at a big high school. She couldn’t dedicate time to both her premature son and that job. She said no to the job. So, at 50 years old she works as a receptionist at a Vet clinic. She doesn’t TOUCH her Kinesiology degree in any shape or form. And that’s okay. She loves her job. She gets to play with fckin puppies all day. As long as you’re happy and can support yourself, there’s nothing to worry about.\nFinish your major though. Stick it out as a Senior, and graduate. When you get that degree, that’s a highlight you can put on your resume. \nI’m drunk as shit right now, so I hope that made at least some sense. Sending good vibes your way that you find peace, my friend.", "author": "ltoale", "created": 1610786919, "upvotes": 6}, "gjfjmlw": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjfjmlw/", "text": "I know how you feel. I've always wanted to go to an elite college/university and become a doctor. I did very well in elementary school and middle school, but once I got to high school I kind of slacked, but I graduated with a 3.8 gpa. Once I went a college that I nearly had a full scholarship at (I only had to pay $2k of my own money for the semester) I hated it. I was a Chemistry and Optical Engineering major and the classes were great, but the dorm life/social life on campus killed it for me. I went back home and went to community college as an Engineering major...I ended up hating that too. I am now back to a Chemistry major since I do understand Chemistry and math compared to the other classes that I have taken.\n\nAnyway, I would say to just go for another major once you finish your degree! You don't want to be stuck teaching if you don't actually enjoy it. I feel like the worst teachers/professors are the ones who don't enjoy their job and only do it because they are qualified to do it. I know that you said that your parents paid for your tuition, but if you are able to pay your way through another major then go for it! I'm sure that it won't take as long since I am assuming that you have gotten your general education requirements out of the way.\n\nI'm pretty sure that lots of people that have graduated already or are currently studying right now HATE or don't enjoy their majors. My point is to do what you actually want to do right away. If I actually end up hating my life as a chem. major, then I will go for a different one EVEN IF it means that I have to take out private loans (in case F.A. is no longer available). I have a mindset like if I have exceptional student loans for college with a major that I love, then I do not mind the debt. It may be a bad mindset, but if you're doing what you love then the cost should not matter (at least if you are able to live comfortably). Good luck to you!", "author": "prncsx", "created": 1610779939, "upvotes": 3}, "gjffwbm": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjffwbm/", "text": "I am in the complete opposite boat as you. I did spend my entire life wanting to do stem, so when I got to college I went stem. And my sophomore year, I struggled and realized that it wasn't for me. And while I had a passion for science, learning, and discovery. I absolutely hated so much of it, essentially still love learning it but hate the work. \n\nNow I switched majors to psychology, and don't know what to do with my life cause I killed my GPA with organic chemistry.", "author": "masterzorogama", "created": 1610776927, "upvotes": 17}, "gjfdxbd": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjfdxbd/", "text": "I mean you could either be 26 with a degree u love or u could be 26 with the degree u hate", "author": "Zeyn0202", "created": 1610775471, "upvotes": 12}, "gjfc47i": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjfc47i/", "text": "I went back to school at 31, 4 years later... I just graduated with BS. Never too old. Figure out what you truely want and give it a go.", "author": "Toast_face_killa", "created": 1610774197, "upvotes": 9}, "gjf9bsb": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjf9bsb/", "text": "I feel this. I was in the English honours program at my university for 2.5 years. Around the 1.5 year mark it started to feel boring and worthless. I didn't know what I wanted to do and I could only see myself landing a marketing job, which I knew I would hate. I stuck with it for a little while longer before realizing it wasn't worth it. I dropped all my classes I had set up for the next semester and hit the drawing board of figuring out what I wanted to do. It's been a year since I made that decision and I have now been accepted to nursing school and I couldn't be more excited. Do what you are passionate about and the rewards will follow.", "author": "taangellW", "created": 1610772288, "upvotes": 9}, "gjf6dvr": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjf6dvr/", "text": "WOW I feel like I just read something I wrote but forgot about writing it! I am in the exact. same. boat.\n\nAbsolutely loved science, my goal was to major in either meteorology or astrophysics, and then get my masters in something combining the two. However, I was too afraid. Like you, compared to everyone else out my high school I wasn’t the smartest and people definitely outscored me. I also took AP Chem as well and although I didn’t excel in the class like my other classmates I still enjoyed it so much. But, when it came time to go to college I just went the easy route. I went in undeclared my first year because I wasn’t exactly sure, and then I ended up declaring as an English major with a teaching certificate. I’m a senior as well and am 21 (turning 22 in a month).\n\nI have beaten myself up for the past 4 years for not challenging myself. I have cried myself to sleep some nights because of this. My boyfriends brother graduated from high school last year and he is now majoring in astrophysics, and man, every time I talk to him I just think “that should be me” and I just get really bummed about it. And his brother was just like me in high school as well, smart, but not the “smartest”. Yet he still went with it. And I really wish that was what I did.\n\nI have been thinking the same thing, about going back to school later on down the road. It does seem a little crazy because I can’t even imagine going to school again, and for some reason society really labels people who aren’t the “conventional” age for college to be failures if they’re in school. But I just know that it would be something I’d be really happy with, and that’s all that should matter.\n\nAnd honestly, I have heard of SO many people going back to school a second time around, including my brother. He got a degree in business, however 8 years later at the age of 30 he just graduated from some IT program this past December and got a job in IT making $120,000 a year, THREE times what his business degree job got him. Also, he’s just super happy and loves his job (so far, at least lol). So that really made me feel okay with the possibility of going back to school, that there’s other people in the same boat and that they can be just as successful \n\nIt’s so dumb that people expect us to know exactly what we want to do when we graduate from high school too. Hardly anyone knows what they want to do forever. So there’s always going to be a lot of people going back to school or even just getting a job that doesn’t relate to the degree they have.\n\nSorry for such a long comment. Your post just really really really sounds like me and I had to spew out some of my thoughts!\n\nEdit: I also realize we have somewhat similar usernames haha. I swear we are the same person lmao", "author": "pennypupper", "created": 1610770427, "upvotes": 48}, "gjf5vwh": {"link": "/r/CollegeRant/comments/kyazeo/university_senior_regretting_my_major/gjf5vwh/", "text": "maybe you can go back to community college to get a small associates or certificate in stem or maybe get a side job or internship in stem", "author": "Fristi2147", "created": 1610770116, "upvotes": 19}}}