{"sid": "kthbhz", "link": "/r/CollegeRant/comments/kthbhz/my_first_semester_of_college_made_me_feel_like/", "title:": "My first semester of college made me feel like shit (Long rant)", "text": "After putting up with so much crap in my senior year of HS, I was truly expecting college to be the time I would be able to change. I expected my college experience to be better, I'd make a couple friends, choose what major I wanted to pursue, find a job to make some money on the side, and looking back at it now, I realize how DREADFULLY naive I was to think I would enjoy college.\n\n2020 happened, and with it came Covid-19, which forced my college to put us into online classes through Zoom. I already struggle enough to stay focused in a class in-person, and Zoom meetings made this problem worse. This also meant I had no classmates to be around with. I have no friends at all, I am a very shy, antisocial person, and needless to say, being forced to be stuck in my room during classes did not do anything to help me.\n\nI was pressured by my parents to start my own business as a screenprinter. It failed because I lost the patience to put up with it since countless mistakes kept coming up, I barely had any requests coming in, and almost all the money I received had to be spent buying more materials. Plus, I had no passion for this job. This left me completely burned out, and it might have affected my college performance at the end.\n\nThe worst part came with the schoolwork. Having five classes to take, I was doing pretty well with all of them, consistently earning good grades. But towards the end of October, I completely crashed. Family and personal problems started to be an issue, it was impossible for me to stay organized because things kept coming up out of nowhere and took away the time I had, my mental health weakened and demotivated me from doing anything productive, even if it was important, and I struggled to understand parts of my assignments, and with all the stress I had on me, I felt it was easier to not do the assignment at all rather than spend hours trying to study and figure out what to do.\n\nThis reflected BADLY on my grades. I failed all but one of my classes, with the highest grade I made being a C. My GPA tanked, and my college put me into academic suspension. Thankfully, they're willing to give me a second chance, I am allowed to come back this upcoming semester, and I am still allowed to receive financial aid to pay for my education, but this time it is clear that I must improve my GPA and pass all my classes. To this day, though, I barely have the willpower to keep going through with college, and I have to try my best to keep news about failing my semester away from my parents, because I know I will be in for an awful punishment, and they might even force me to change to a major that THEY want me to pursue. I will never be able to become independent from my family this way.\n\n2020 has really made me hate college, and adult life in general. Things were bad in high school, but the problems got a thousand times worse now. I truly wish I could just drop out and leave my parents house at this point.\n\n**tl;dr:** Screw the college life, it just makes you feel worse than when you were a teenager. I truly don't want to keep going with it, and I don't know what to do anymore. Sorry for the wall of text", "author": "Hydrakobold", "created": 1610157301, "retrieved": 1632842985, "over_18": false, "upvotes": 102, "upvote_ratio": 0.99, "comments": {"ginsoel": {"link": "/r/CollegeRant/comments/kthbhz/my_first_semester_of_college_made_me_feel_like/ginsoel/", "text": "Common Questions any sane person should have:\n“Why do I pay so much money for online videos?”\n“How does paying for a class guarantee that I actually learn?”\n“Why am I receiving mental health emails if the school is causing me to suffer?”\n“Why to you take random fees and call it tuition?”\n\nCollege is a cash machine. They don’t care about anything except for money. That is why you’re stuck there for four whole years (or more) and why there’s no room for error. They’re banking on you (students) screwing up so that they can make even more money. You, a distant spec in the clusterfuck we call life, are not an equal human. You are a customer. Not a student but, a tool of which you are used to fund a rich lifestyle for someone else. \n\nCollege system needs to be rebuilt where education comes first and where money isn’t superseding the act of learning. And just because you have a doctorate or a masters doesn’t grant you the right to teach. \n\nIt’s increasingly subpar and shitty to raise college prices to some insane standard, have parents force it on their kids and then, have the same god damn college you go to (after the hell beforehand) to let you down in almost every respect. Even more-so, using the pandemic as an excuse to just not do your job. \n\nCrazy thing is that no one is willing to take any form of responsibility. Instead, they all point fingers at each other and expect something out of it. So, when you muster the rare courage to speak up, you’re met with the same stupid people that are using your money and robbing you of your own future. \n\nImagine that.", "author": "majoroofboys", "created": 1610205271, "upvotes": 1}, "ginj5br": {"link": "/r/CollegeRant/comments/kthbhz/my_first_semester_of_college_made_me_feel_like/ginj5br/", "text": "Gotta ask yourself a few questions: Why are you going to college? What is the light waiting at the end of the tunnel once you get your degree? What's your motivation? Write that shit all over a white board or something to post up near you.\n\nIt might work. It might not. It's little things like that which one of many things that helped me keep going when I asked myself why I bothered trying again every time I fucked up an assignment.", "author": "SweetTeaBags", "created": 1610198897, "upvotes": 2}, "gindura": {"link": "/r/CollegeRant/comments/kthbhz/my_first_semester_of_college_made_me_feel_like/gindura/", "text": "i feel you. i’m still doing my first semester after not doing anything in senior year, which really had a toll on my ability to do well and study. in high school, i was first in my class and i effortlessly got good grades. now, i’m struggling to pass two classes while hoping for B+ in the rest 4 classes i’m taking. i’m having a lot, and i mean a lot, of personal problems and i’m the type of person to overthink everything so now, not only can i not sit down for an hour to do homework and study for tests, i overthink every single problem we have. \n\nmy parents are understanding though, with online and all the problems we’ve been having, so they don’t pressure me about my grades and are totally supportive, but it hurts to see how good of a student i was and how i am doing now. \n\nso yeah, college has made me feel like shit from the beginning till the end. i went in hoping to have a good college experience, instead i’m struggling to keep my grades up and i can’t sit down and study for tests. yes, it is my fault i’m getting worse grades & i probably could get better grades if i put in the work (tbh my grades aren’t as bad since i barely study) but at the same time, my mental health can’t take it. \n\ni really hope things get better for you and i. i know how hard it is and i just wanted you to know that you’re not alone in this. i hope we can get past this and get better grades next semester.", "author": "jennie033", "created": 1610194333, "upvotes": 1}, "gin0ezt": {"link": "/r/CollegeRant/comments/kthbhz/my_first_semester_of_college_made_me_feel_like/gin0ezt/", "text": "I’m in my senior year. And I’m in the exact same position. I’ve come to terms with my college experience being a lackluster mess. I’m not happy with it so I just don’t think about it. You still have a chance for COVID to go away and for it to improve. \n\nBut I’d also advise not putting it on a pedestal anymore like media has for us growing up. Just in the event that it doesn’t turn out to be what you want. 18-23 years old should not be referred to as the “best time of our lives.” It’s the new “peaked in high school tbh”", "author": "kiingof15", "created": 1610180768, "upvotes": 3}, "gimw06w": {"link": "/r/CollegeRant/comments/kthbhz/my_first_semester_of_college_made_me_feel_like/gimw06w/", "text": "OP, college is highschool 2.0, and is entirely what you make of it. You will deal with hopping through a bunch of hoops to get a degree- that may or may not be useful later on along with a bunch of other bs- welcome to reality.", "author": "Rich-Cryptographer-7", "created": 1610176695, "upvotes": 8}, "gimgv77": {"link": "/r/CollegeRant/comments/kthbhz/my_first_semester_of_college_made_me_feel_like/gimgv77/", "text": "Hey OP, I sincerely hope college looks up for you. Before the pandemic hit, I was enjoying the freedom I had away from home. I made a lot of friends and loved learning as a whole. Ever since the pandemic hit though, it's been hard. We're all in this together, and I hope everything ends up working out for you.", "author": "kaytherine", "created": 1610166269, "upvotes": 9}, "gim1etq": {"link": "/r/CollegeRant/comments/kthbhz/my_first_semester_of_college_made_me_feel_like/gim1etq/", "text": "This speaks to me. I’m in my second semester retaking a class i failed because of the burnout I had last time. We got this", "author": "matsudasociety", "created": 1610157975, "upvotes": 20}}}