{"sid": "iupwnu", "link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/", "title:": "FML got kicked out of proctorio exam because of noise.", "text": "Had to take 2 hour exam on proctorio this morning. I’m supposed to be alone in the “testing room”. Husband forgot I was taking exam, walked into my “testing” room and started talking loud. Proctorio immediately kicked me out of exam. Luckily I was finished but merely checking over my answers. Didn’t get to check over the rest of them and got some wrong because of it. Husband knows better than that. Grrrr. Tried to contact prof on zoom but he’s no longer there. fucking proctorio.", "author": "dogandcats424242", "created": 1600369020, "retrieved": 1632950315, "over_18": false, "upvotes": 212, "upvote_ratio": 0.99, "comments": {"g82fdzl": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g82fdzl/", "text": "I know-do professors know/care about shared dorm living??  We are living in a studio w/ our own  kids being home from school & a spouse working from home. We have winter coming-alrighty everyone out in sub zero weather while Mommy takes a freakin’ quiz.  Ugghhhh", "author": "Tumbleweed_Life", "created": 1602121759, "upvotes": 1}, "g5w469u": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g5w469u/", "text": "Wait what’s Proctorio? Also can you just turn off your mic if your professor uses this?", "author": "Stacheshadow", "created": 1600561519, "upvotes": 3}, "g5qajy4": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g5qajy4/", "text": "Honestly, as a professor in engineering, I think that type of software is useless and privacy invading. Also, many students do not have strong and reliable internet connections in many places, so it is really unfair.  Faculty need to rethink how they give exams and what the goal is. I gave my students 24 hours to do the exam and upload their answers. Sadly, someone  uploaded the midterm to Course Hero (a site that lives on plagiarism), however, the solutions that they bought used techniques not covered in class...\n\nIn the real world, people can look at books and check methods. This means that the test should be about how and when to apply the methods to a problem and demonstrate that process.", "author": "Educational_Walrus_3", "created": 1600455009, "upvotes": 4}, "g5okuz6": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g5okuz6/", "text": "My pre-cal professor is the only one who doesn’t use proctorio. I think hes fine with us looking through the book and whatnot, because its still hard with that added help lol.", "author": "deprimada", "created": 1600414860, "upvotes": 3}, "g5nnlit": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g5nnlit/", "text": "Just email your professor. It’s literally the dumbest software", "author": "sgoolsby", "created": 1600391986, "upvotes": 8}, "g5njpuv": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g5njpuv/", "text": "Wait. What the fuck is this? What if you have kids? Or fart? Or a tree falls? Or rings the doorbell? Or someone decides to pressure wash next door? Or a drunk guy starts yelling outside?", "author": "familyofgorillas", "created": 1600389949, "upvotes": 16}, "g5ncj2l": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g5ncj2l/", "text": "I haven’t had to use any software like that but honestly that’s unfair \nI have a friend who shares a room with her toddler sister and there is no where else in the house for her to go because her parents have the other room. Where is she to go to take an exam? That sounds very unfair to me. How do some of you guys deal with it?", "author": "HateInAWig", "created": 1600385871, "upvotes": 26}, "g5nb1o6": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g5nb1o6/", "text": "I make sure to lock the door to my room and make it clear to everyone that I'm testing. Fuck these proctoring services anyway. Honorlock hasn't been too bad for me but still.", "author": "warrior15678", "created": 1600385026, "upvotes": 19}, "g5n85eo": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g5n85eo/", "text": "Proctorio is honestly disturbing how intrusive it is.", "author": "matroid21", "created": 1600383378, "upvotes": 48}, "g5n7y9i": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g5n7y9i/", "text": "Professors who use those methods to “prevent cheating” aren’t actually preventing cheating, they are just making it more difficult for students who don’t have an ideal work environment. Some students don’t even have their own room or desk to take exams. Not to mention, there are plenty of ways to cheat when using that software, making it pretty useless in my opinion. So not only is it creepy it’s also classist, ableist, and not even effective.", "author": "kittypwitty", "created": 1600383265, "upvotes": 161}, "g5mxe93": {"link": "/r/CollegeRant/comments/iupwnu/fml_got_kicked_out_of_proctorio_exam_because_of/g5mxe93/", "text": "Yeah, those kinds of software are stupid and creepy honestly.", "author": "shitheadboot1122", "created": 1600378444, "upvotes": 142}}}