{
  "sid": "o4nf41",
  "link": "/r/CollegeRant/comments/o4nf41/seeing_incoming_freshmen_on_campus_before_me/",
  "title:": "Seeing incoming freshmen on campus before me",
  "text": "At first, I didn't feel sad about the HS Class of 2020 not having a proper senior year and first year of college but recently, it's been getting to me. I decided to stay home for my first year of college since my college is out-of-state and I didn't want to spend money for a half-baked college experience worrying about Covid. I don't regret my decision at all but seeing the HS Class of 2021 have prom & graduation and the incoming freshmen having fun on campus for the summer semester really hurts. I still don't even know what my college looks like yet so I might be asking them to show me around. I know other students have had it just as worse throughout this pandemic but it's sucks that I didn't experience my transition into adulthood yet. I've grown more attached to my family throughout the year so it feels much harder to leave home to be on my own now. I know it will come in due time but I just wanted to rant about it.",
  "author": "ChickenGodSepse",
  "created": 1624251245,
  "over_18": false,
  "upvotes": 24,
  "upvote_ratio": 0.94,
  "comments": {
    "h2kee76": {
      "link": "/r/CollegeRant/comments/o4nf41/seeing_incoming_freshmen_on_campus_before_me/h2kee76/",
      "text": "Exact same situation here, you're not alone. Hope we'll both have a better time this fall :')",
      "author": "citieskylines",
      "created": 1624301158,
      "upvotes": 2,
      "replies": {}
    },
    "h2j3v3e": {
      "link": "/r/CollegeRant/comments/o4nf41/seeing_incoming_freshmen_on_campus_before_me/h2j3v3e/",
      "text": "Class of 2020 over here! Like you I had to spend my first semester at home haha. It was honestly sad but it was the first human interaction I’d ever had since moving from my home country. We open back in the fall and I truly hope it will be better. Seeing people celebrate that their entering directly on campus during the fall makes me sad because I never got that. It feels kinda wasted yknow. You’re not the only one out here. I honestly hope that I make friends/have a better next semester. I’m sure you will too! Just hang in there. 😊",
      "author": "InevitableTone65",
      "created": 1624278941,
      "upvotes": 4,
      "replies": {}
    }
  },
  "updated": 1634062012
}