{"sid": "p9i2pm", "link": "/r/CollegeRant/comments/p9i2pm/torn_between_so_many_majors/", "title:": "Torn between so many majors", "text": "I'm really having a dilemma here.\n\nI'm going into my sophomore year of college and still don't know what to major in.\n\nI'm interested in history and art and English. Reading and writing have been passions since I was young. I'd like to work in a museum, or as a professor. I love anthropology and historic preservation. I also love philosophy and economics and would like to work in foreign affairs. I've considered double majoring in English and History, or History and Anthropology, or getting a PPE degree (Politics, Philosophy, Econ) \n\nHow am I supposed to choose between all these majors? I don't know what I want to do with my life. Is it bad to do a double major and minor? Does that look bad to future employers? \n\nTL;DR: I'm having trouble choosing between all the majors in college.", "author": "depressedstudent25", "created": 1629657315, "retrieved": 1632949060, "over_18": false, "upvotes": 3, "upvote_ratio": 0.8, "comments": {"h9zftb6": {"link": "/r/CollegeRant/comments/p9i2pm/torn_between_so_many_majors/h9zftb6/", "text": "Not sure about your college, but my college reports the average salary, positions held, and employment % for each major’s alumni, and that really helped me narrow down what I wanted to do. \n\nI’m biased, but I absolutely love being in the Econ program. At my school it’s a BBA degree, and there’s a lot of flexibility to really focus on what you like. I know a lot of people that focus on foreign affairs, finance, public policy, development, and so much more. I think it’s a really diverse major that often gets overlooked.", "author": "CollectiveJam", "created": 1629684592, "upvotes": 2}, "h9ygzn4": {"link": "/r/CollegeRant/comments/p9i2pm/torn_between_so_many_majors/h9ygzn4/", "text": "Nothing wrong with doing a double major or adding in a minor. Get your money’s worth! Pick the major that you’ve taken coursework in an actually enjoyed. Your whole life will not be defined by this one decision. The caveat is, you have to do well in your major classes. You can’t  expect to set yourself up for success post college by phoning it in. Make connections with your professors and take advantage of opportunities on and off campus. Good luck!", "author": "renebeca", "created": 1629667831, "upvotes": 5}}}