{"sid": "mdgsu6", "link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/", "title:": "Why do lecturers assign readings that are literally impossible to get through?", "text": "What’s the point? What does it actually achieve other than making students feel inadequate, overwhelmed and stressed out (thus reducing their ability to concentrate + retain information) and only having a very shallow, short term understanding of the content? \n\nI’ve been prioritising the readings bc I learn best from reading and the lecturers have accents, tend to drone in a monotone voice, talk about important topics without including them on the slides, then include things in the quizzes that weren’t in the lectures. \n\nI always thought I was good at reading but it takes me 2 hours just to get through just 5 pages. I can’t reasonably get through 1.5 - 3 chapters of science content in a week, 2 hours of mini lectures, another 2 hour lecture, a weekly quiz worth 40% of my grade, as well as other little bits of video/content and taking notes and actually absorbing and understanding it all. I’ve been putting in 15+ hours a week just for ONE unit and still barely making a dent in the content, while completely neglecting my other unit. \n\nI’ve heard people and my classmates say they don’t actually expect you to get through it all and you don’t have to read everything but then why say it’s prescribed/essential? Why not just call it background reading?\n\nPeople always say, JuSt PrIOrItIsE but why should you have to in the first place? Why not just prescribe a reasonable amount of weekly content that can be read and actually understood thoroughly?", "author": "marshmallow_bunnyx", "created": 1616733370, "retrieved": 1632842840, "over_18": false, "upvotes": 201, "upvote_ratio": 0.98, "comments": {"gs9ayow": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gs9ayow/", "text": "Thank you u/marshmallow_bunnyx for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1616733370, "upvotes": 1}, "gt4vbsq": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gt4vbsq/", "text": "You need to get at those podcastes, magazine/journal, association subscriptions, short reads, and forums, I use the textbook for keywords and definitions, chapter summaries, the unit review or questions, (skimming the chapter to answer the questions) and I copy charts in the chapter, and keep it moving. I look for real world application and interaction.  I am a undergrad, took a webinar that a professor at my school gave, she said most graduate programs don’t even want or allow you to site from the textbook, so I ask them, what’s the point of the textbook? Why is it required?\n\nBesides, the textbook usually adds a bunch of uselessness around the main point, by the time I have gotten to the main point, i haven’t even absorb it. I’ve absorbed all the bullshit around it.", "author": "Impossible_SLuv2016", "created": 1617366902, "upvotes": 2}, "gse3c91": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gse3c91/", "text": "If it's a textbook, just read the highlighted stuff or whatever is at the end of the chapter. Textbooks usually introduce something by giving a definition in the same sentence as the highlighted phrase, further explaining it, and showing it in some examples. If it's a book, find an audiobook or a reading on Youtube, and listen to it while you do an idle task.", "author": "Blastyschmoo", "created": 1616824607, "upvotes": 1}, "gsc832c": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gsc832c/", "text": "Honestly, with regard to the \"just prioritise!\" people, I feel like the lecturers who assign such a ridiculous amount of reading are the ones that should learn to prioritise. When teachers are passionate about their field it can be easy for them to go overboard in wanting too share too much all at once, but they need to understand that they only have a limited amount of class, and students have only limited amount of time to do the work for that class. \n\nAnother factor that plays a role I think is that this would require teachers to put in more time and effort to narrow down which information is the most crucial to their course. I imagine it's tempting for teachers, who are also very busy themselves, to give students a big list of reading and let them figure it out for themselves. They rationalise this by arguing that it's valuable to learn to evaluate information yourself, but I think it's more the fact that they simply don't want to bother doing it themselves. Teachers who assign a more focused reading every week and list the rest as background demonstrate that they're willing to put in time and effort to make it easier for their students. I've had teachers like that, thankfully, and they were great. You could tell that they really cared. That's why I do think we need to acknowledge it takes more effort on the teacher's part to develop a more concentrated course plan.", "author": "civilizedcat", "created": 1616793149, "upvotes": 2}, "gsc1liy": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gsc1liy/", "text": "Learning to manage, filter, and process the material IS the training. This is a valuable skill you can apply to diverse professions. Content can easily be looked up or forgotten, but skills are hard-earned and make you an asset to potential employers. If your reading load were reduced, you might retain more of the content but you wouldn't end up being as skilled.", "author": "GoosieGrander", "created": 1616790669, "upvotes": 0}, "gsbcdov": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gsbcdov/", "text": "[deleted]", "author": null, "created": 1616780354, "upvotes": 6}, "gsaaoiw": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gsaaoiw/", "text": "They're removed from reality and have generally been in their field too long to understand why intelligent students cant read a million pages of a dense-ass text on something the prof understands thoroughly. I tried to read my science books this semester but just gave up. Chapter summary or bust.", "author": "muffinfight", "created": 1616763071, "upvotes": 11}, "gsa7blz": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gsa7blz/", "text": "I had one instructor who insisted we meet online even though we could safely meet in person without ever having to be within 6 feet (she really just didn't want to make the drive). To make up for the 4½ hours we were to meet in person, she assigned \"2 hours\" of reading and 2 ½ hours of videos to watch. Her 2 hours of reading was more like 4-6 hours of reading for us. She assigned journals/scientific articles that were 20-30 pages long each. On top of that, she made sure we had work for the amount of hours we were to spend on her class each week (I think around 13 hours per week) so she made sure we had assignments to work on which was about 3-4 hours, 1-2 hour zoom meeting, and then the rest was our field experience... I hated it. I called her out on it and told her I basically wasn't doing the reading because I didn't have enough time considering I'm a full time student in other classes (we all were and no one had the time). And of course she asked questions about the readings in the meetings instead of teaching us so my grade was impacted but I also called her out on other issues with the class so I'm pretty sure my grade was also impacted by that. In 4 years of college, her and her class is what caused me to start drinking. I legit was having a breakdown every week (do was one other student...we kind of did the work together even though we weren't supposed to and participated the same and yet somehow she did better than me...like we shared documents, had the same amount of good information, and format)...", "author": "ReGr19", "created": 1616761104, "upvotes": 2}, "gs9s7sg": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gs9s7sg/", "text": "We do expect you to get through it. You need to build up your reading comprehension skills, particularly for the humanities, and this takes time and practice.\n\nEdit: Look at all these downvotes! -- and I'm offering helpful advice in every comment. Y'all need to grow up, take responsibility, and do better. You should be able to read 100-200 pages per class each week.", "author": "TheProfessorsCat", "created": 1616748493, "upvotes": -4}, "gs9m24m": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gs9m24m/", "text": "\nThis style of teaching really feels more focused on testing and pushing students as close as possible to breaking point than actually teaching for a long term, in-depth understanding that will prepare us for a career. \n\nIt’s like a sick game of “get through this massive amount of content and then guess what’s relevant for this stressful quiz! That’ll be $1000 thanks!” \n\nAt the end I’ll be good at handling stress, skimming through stuff and picking out what might be important later, but I’m not gonna have any useful, in depth knowledge preparing me for a career in my field. \n\nI’m fine with working hard and putting uni first, I’m fine with having no hobbies or social life but I’m not okay paying money to sacrifice my sleep, mental & physical health and the rest of my units just to have a shallow understanding of things that I’ll immediately forget as soon as it’s not relevant to pass.", "author": "marshmallow_bunnyx", "created": 1616742571, "upvotes": 12}, "gs9lulc": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gs9lulc/", "text": "Dude I soooo understand what you mean. For my Modern Political theory course, my professor assigns too many pages of reading, and since the texts are difficult to understand I spend a shit ton amount of time annotating the texts, then reading a summary to make sure I got the gist of it, and then watching YouTube videos to really make sure I got a sold understanding. But doing this for each chapter and section of each chapter, which is several pages long, is just a long and tedious process. If this were my only course, I would be able to do it, but since it is not I can not be able to complete it. Heck, by now I haven't completed any of my readings!! I just try to read as much as possible and by next week I read something else since now we are talking about another philosopher.", "author": "Deathstroke12420", "created": 1616742380, "upvotes": 32}, "gs9jxyd": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gs9jxyd/", "text": "As a lifelong terrible learner and still an older than average adult student, Ill try to give you some tips I have *never* mastered:\n\n1) You’re not supposed to read all of it. Depending on your major there are a lot of sections where the title says it all but the content is dense and unnecessary. If you think you understand what the section or chapter is about, then skim until you get lost/confused and go back to the last thing you understood. Continue reading until you get to the place where you were originally confused and check if you get it now. Rinse and repeat.\n\n2) Go to office hours. Go to office hours. Go to office hours. GO TO OFFICE HOURS! I never did this and still dont and its my fatal flaw every time. Professors that do this 100+ page nonsense often have some weird, unnecessary, and stupid motive behind doing it. Whether its finding out who is trying hard or who will be their next TA. Either way, if you go to office hours, its likely youll find out what they want you to focus on or what is actually relevant. From friends I have that have gone to office hours, sometimes those professors straight up give the answers to the quiz or test.\n\n3) I dont really have a third point, but dont be too hard on yourself either. If you feel comfortable with the material then feel free to give yourself a little slack. If you dont ever feel comfortable with the material, then seriously consider if youre in the the right major. From my experience, I spent years (and money) stressing myself out over material that I was never going to understand in a semester. Once I moved to an adjacent field with concepts I could grasp my GPA and mental health improved greatly...at least relatively.\n\nIf all of this is nonsense and not helpful then all I can say is keep on keepin on. Its not forever and youll be so freaking happy when its over.", "author": "Pasquanch", "created": 1616740640, "upvotes": 24}, "gs9cycr": {"link": "/r/CollegeRant/comments/mdgsu6/why_do_lecturers_assign_readings_that_are/gs9cycr/", "text": "I fucking hear ya.\n\nI have a ONE CREDIT 7-week course that has assigned 100+ pages of reading for this week..\n\nAnd every class starts with a 15 minute quiz on the readings, and the quizzes are like 20% of your grade.\n\nIt is fucking unbearable.", "author": "ThereIsNo14thStreet", "created": 1616734797, "upvotes": 74}}}