{"sid": "pje59e", "link": "/r/CollegeRant/comments/pje59e/first_day_of_community_college/", "title:": "First day of community college", "text": "\nI don’t know how to format text on here so it’s easier to read, but here goes nothing. \n\nWhen I wake up in the morning, I will have my first college class tomorrow and I’m nervous. I’ve been nervous since last week, realizing that my summer break is coming to an end. \n\nIm not sure why but since COVID, I’m more anxious when talking to people even staff. I know they don’t really care what I’m doing but it’s still nerve wrecking. I will be going here alone, as in i have to make new friends and learn my way around at school with my own guidance and of course randoms and staff around me. \n\nOne of the negative things I’ve heard about CC is that making friends is less likely than at a university. So, that also has me nervous lol.\n\nI don’t know what lies ahead, but im posting this to 1) get this off my chest so I can go to sleep and 2) to come back to this when I’ve finished my first day/week and feel better that I do right now. \n\nIf you like, you can give any tips of college life like taking notes, joining clubs, etc. \n\nThanks in advance!", "author": "blickynim2", "created": 1630982249, "retrieved": 1632841143, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"hbvvh9b": {"link": "/r/CollegeRant/comments/pje59e/first_day_of_community_college/hbvvh9b/", "text": "Thank you u/blickynim2 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1630982249, "upvotes": 1}, "hd3aqhy": {"link": "/r/CollegeRant/comments/pje59e/first_day_of_community_college/hd3aqhy/", "text": "I transferred from CC to a UNI and let me give you some advice:\n\n1. ENJOY IT! Uni absolutely VACUUMS dick compared to CC. In community college, you can expect people to act like adults. You can absolutely make friends in CC and people will be far more mature than in UNI. \n2. Make it a part of your life instead of your whole life. Most people work outside of CC and have a life and even kids sometimes. This seems to be a good formula.\n3. Take time for yourself. Do your homework in the library if you can. Ask questions. People in CC live life in the slow lane, but that is a good thing. Work hard, your professors probably expect a lower quality of work as CC is more accessible to the less-educated (which is great!), so when you put in effort, they know and appreciate you better.\n4. Again, enjoy it. UNI kids are pretentious and stupid in my experience. I have met the most intelligent and worldly people in CC.", "author": "Short_Champion", "created": 1631807099, "upvotes": 1}, "hbw40in": {"link": "/r/CollegeRant/comments/pje59e/first_day_of_community_college/hbw40in/", "text": "Just be excited to learn. You dreamt of this day once and now you are here. In a few years from now you will graduate and have bigger goals and think the same thing again. Keep going keep growing and never settle. Good luck!", "author": "Top-Bobcat-8313", "created": 1630986852, "upvotes": 2}}}