{"sid": "m7ryl6", "link": "/r/CollegeRant/comments/m7ryl6/hate_how_i_look_on_zoom_for_class_meetings/", "title:": "Hate how I look on zoom for class meetings", "text": "Anyone else think that zoom makes them look bad physically? I feel like I look better in person lol", "author": "CantuTwists", "created": 1616077572, "retrieved": 1632951522, "over_18": false, "upvotes": 34, "upvote_ratio": 0.97, "comments": {"grg3zrb": {"link": "/r/CollegeRant/comments/m7ryl6/hate_how_i_look_on_zoom_for_class_meetings/grg3zrb/", "text": "From a professor perspective I'm watching for changes in facial cues, but not what you actually look like. I took me most of a 75min class to realize a student had cut their hair. 🤷‍♀️", "author": "Cjb3z4", "created": 1616127994, "upvotes": 2}, "grfpo64": {"link": "/r/CollegeRant/comments/m7ryl6/hate_how_i_look_on_zoom_for_class_meetings/grfpo64/", "text": "Same. Just adding an extra level of spice to my body dismorphia", "author": "buzzbuzzbeetch", "created": 1616119623, "upvotes": 3}, "grdoveg": {"link": "/r/CollegeRant/comments/m7ryl6/hate_how_i_look_on_zoom_for_class_meetings/grdoveg/", "text": "Yeah same. I think a lot of it has to do with lighting. Also, the cameras on laptops aren't that great. I think you can touch up your appearance though. I have before but forgot how to do it. It didn't make much of a difference. I wouldn't feel too bad. Everyone you see on TV and pictures and stuff all has to do with good lighting and sometimes editing. Also, looking into a mirror doesn't distort your features as much", "author": "Professional-One-264", "created": 1616085310, "upvotes": 4}, "grdlpv9": {"link": "/r/CollegeRant/comments/m7ryl6/hate_how_i_look_on_zoom_for_class_meetings/grdlpv9/", "text": "My professors will present the screen of their meetings regularly and bring one of 5 people with my camera on i hate that not only do i see myself, but that my face is front and center for 20 something people", "author": "discerningpotato", "created": 1616084151, "upvotes": 1}, "grdg25g": {"link": "/r/CollegeRant/comments/m7ryl6/hate_how_i_look_on_zoom_for_class_meetings/grdg25g/", "text": "Me too. I have my camera off as much as possible, but I still talk a lot so the professors know I’m there.", "author": "nonconformistnugget", "created": 1616082113, "upvotes": 3}, "grdckx5": {"link": "/r/CollegeRant/comments/m7ryl6/hate_how_i_look_on_zoom_for_class_meetings/grdckx5/", "text": "I feel awful having my camera on because I have to be sitting in my bed. I don’t have a desk and my mom sits at the kitchen table to work so I don’t really have anywhere to go. Besides the horrible camera angle I don’t like people thinking that I’m lazy and stay in bed all day.", "author": "notthelettuce", "created": 1616081043, "upvotes": 6}, "grdbr9x": {"link": "/r/CollegeRant/comments/m7ryl6/hate_how_i_look_on_zoom_for_class_meetings/grdbr9x/", "text": "My bio professor told me recently that there are more people doing plastic surgeries during the pandemic. People realize they don’t like the way how they look during the zoom meetings, so they call it the “Zoom Boom”.\n\nJust commenting this because your post reminded me what she told me lol", "author": "IndependentReal", "created": 1616080777, "upvotes": 25}}}