{"sid": "pxxgt0", "link": "/r/CollegeRant/comments/pxxgt0/i_feel_like_i_dont_know_anything/", "title:": "I feel like I don't know anything", "text": "(lowkey an anxiety rant)\n\nFor context, I'm a junior in college studying stem. I started taking my major specific classes my sophomore year but I have been struggling to get the content to stick. I feel like part of it is because my foundational knowledge of biology and chemistry, etc. is not very good..? Basically, I went through all of my gen eds memorizing information for the exams and forgetting everything afterwards. I'm really interested in stem research, immunology, and all that jazz but I cannot get through my class material.\n\nI feel like part of it is because of the pandemic and online classes which have completely screwed my entire mental status on studying and doing work. I cannot get anything period. Now, I'm really behind in a lot of my classes and I know I can't push anything off but no matter how hard I try to catch up I feel like I'm always super behind and dumb and don't know anything I should know by this stage of college. My thinking is that I need to go back and review all of the basic stem knowledge I should know and use that to help me now, but I can't really study past stuff and current stuff at the same time because there's only so much time. \n\nAt this point, everything is very very overwhelming for me and I just don't feel like thinking or doing anymore but I can't do that because future endeavors, finding a job, and just everything future. \n\nI don't really know what I want to get out of this post, but if you have any advice or comments or anything I would really appreciate it. \n\nTL;DR: a very stressed stem junior in college feeling like they don't know anything they should, can't seem to get work done although interested in stem stuff and is very conflicted about what to do now because they feel behind in everything and they don't really know what they wanted out of this post but felt like they needed to share it", "author": "sleepdiver", "created": 1632928446, "retrieved": 1632948360, "over_18": false, "upvotes": 24, "upvote_ratio": 0.95, "comments": {"heqmnge": {"link": "/r/CollegeRant/comments/pxxgt0/i_feel_like_i_dont_know_anything/heqmnge/", "text": "I can relate a lot, by which I mean A LOT with your feeling. I'm a junior in college too and I think it's burnout that's causing us all to be this way. From the feeling of not being good enough(impostor syndrome) to the struggle with learning, burnout just ruins us. I don't know how exactly we can move past it but from what I've read, taking a proper break where you don't interact with your work can help. Setting a time after which work is prohibited also seems to help some people. I've found doing some creative tasks(writing, drawing, etc.) to be a bit therapeutic.  If you can talk to someone who will hear, definitely do that. Just venting it out like this, by itself, gives a great feeling.   \n\n\nI have not won against burnout anyway. I'm also still suffering from a lack of resolve and meaning to do my work and also the impostor syndrome. It's too draining but hopefully will find a way through this. Hang in there, friend.   \n\n\n(Btw, immunology research sounds so cool! Definitely one of the most fascinating things in the universe!)", "author": "Maxwellmonkey", "created": 1632932720, "upvotes": 5}}}