{
  "sid": "jbrycd",
  "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/",
  "title:": "Online school is kicking my ass",
  "text": "Online School is kicking my butt\n\nLet me start off by saying this is gonna be a rant\n\nI’m in my second year of college and man is it destroying me, I take 5 classes atm and tbh that’s fair and normal for me. The issue is I can’t stand this online stuff, I’m not a book learner at all and I feel like I’m not learning anything. \n\nI’m trying my best with it, giving it like 6 or more hours a day and I still feel I’m struggling. (I’m so invested in it bc I have a full ride scholarship rn but it requires me to keep high grades) \n\nHonestly tho all of this wouldn’t be that hard other than 1-2 classes I have. My one class the teacher doesn’t teach or have any interactions with us, all he does is post 2 assignments a week which are time consuming but easy to do. I’m okay with that but then we have an exam after every 3-4 chapters and the exams are wild, they’re nothing like the other assignments he gives, they’re nothing even like the book; for example one question was asking for the definition of a word and when I went into my notes to look at the definition (which were allows to) the book definition wasn’t even on the exam nor anything close to it! It’s like we’re studying the wrong book. To make it worse we only get a minute for each question so that’s about 20 seconds to read and then 10 seconds to read all the answers leaving 30 seconds to process and decide which answers best, which can be hard bc some of them require math or just take a minute to understand. And the final cherry on top is these exams count as 80% of our overall grade. \n\nAnd the reason I say he refuses to teach us is because every time I email him, he gives a copy and paste type answer like “the key to success in my class is hard work, motivation, and focus” or some bs like that or he’ll just give the classic “this is college, it’s just like this” and when I ask a question regarding the topic or try to ask to set up a meeting time to talk about stuff I don’t understand he dodges those questions (I’ve emailed him 3 times about that)\n\nThe other class is a math class which I’m fine with I just suck at math nothing big there tho.\n\nAlso am I the only one that feels teachers decided for online school to replace teaching with just more work? Bc idk bout u but I’ve been swamped with work load after work load\n\nAnyway this has been my small rant about how online school is sucking for me, just trying to get it out and maybe hear some advice or anything",
  "author": "Working_History",
  "created": 1602782467,
  "over_18": false,
  "upvotes": 123,
  "upvote_ratio": 1.0,
  "comments": {
    "g9nf0bi": {
      "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g9nf0bi/",
      "text": "[deleted]",
      "author": null,
      "created": 1603376944,
      "upvotes": 1,
      "replies": {
        "g9ng2v8": {
          "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g9ng2v8/",
          "text": "Thank you",
          "author": "Working_History",
          "created": 1603377503,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g8z4445": {
      "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8z4445/",
      "text": "I have the same exact thing happening in my gen chem class where we will do super easy, almost intro to chem type work, for homework, and the tests are a whole different level. I’m in a lab group with people from the same class but a different teacher and I just found out that their teacher does practice tests and other prep to help them and my teacher doesn’t do jack squat. To top it off, all that we have for an actual grade is the tests which I don’t feel like I’m doing very good at. All in all this class has ruined my self esteem and caused me to have several mental breakdowns over the course of the semester already. I honestly feel like I’m just completing busy work that doesn’t really benefit my education. Although I will say the classes I’m doing best in right now have scheduled zoom lectures and that seems to help a lot just for pure organization purposes. I am the kind of person who hates lack of structure, and the lack of scheduled meetings as well as me not knowing what an actual college schedule should look like (I’m a first year student) is really wild and quite honestly making life so much harder. Plus it’s so hard to be in education mode living with my family. I just want to be back in a classroom",
      "author": "Elegant_plantmom",
      "created": 1602824863,
      "upvotes": 2,
      "replies": {
        "g90qhy0": {
          "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g90qhy0/",
          "text": "I feel u and I want that too, good luck in ur situation I hope everything works out for you and maybe try emailing ur teacher and see what they say",
          "author": "Working_History",
          "created": 1602868458,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g8ygv53": {
      "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8ygv53/",
      "text": "I absolutely hate my nutrition professor she’s so scattered and her recorded lecture videos have her watching her kids so she’s being disrupted and it’s bothersome. Emailing her is the same regurgitated answer like “read the directions” umm what directions? U literally just posted an assignment and said do it. I fucking can’t with this anymore it’s just so frustrating! The quality I’ve been getting is absolute trash I’m so over professors inflated egos having the finally say over my grade. At this point I’m quite confident an AI robot can replace her and I’d learn more.",
      "author": "Hawkbiitt",
      "created": 1602809812,
      "upvotes": 5,
      "replies": {
        "g8yh9th": {
          "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8yh9th/",
          "text": "I’m sorry u gotta go through that, I had a teacher like that back in high school but obviously not as bad, I hope u can stick through it and make it and good luck to u",
          "author": "Working_History",
          "created": 1602810041,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g8yaka9": {
      "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8yaka9/",
      "text": "I got accepted a week late to my college, and had two week burnout right from the start due to familial circumstances. When I actually sat down and started working, I asked one of my professors what the best way to get caught up is. He just told me “just get started.” Wow thanks. \n\nMy math professor doesn’t even really help us. He just gives very vague hints on what to do. \n\nMy final professor doesn’t ever send out literally anything regarding the class, or deadlines, or even lets us know when our own individual projects (that he never alerted us we had) were due. I emailed him last night asking if my grade is salvageable (we have a midterm this week) and he hasn’t gotten back to me. \n\nCollege so far has been hell.",
      "author": "Avek01",
      "created": 1602806283,
      "upvotes": 5,
      "replies": {
        "g8yccel": {
          "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8yccel/",
          "text": "Well I hope it doesn’t taint ur overall college career bc normal college is the best, u have so much more free time and flexibility, u feel like ur actually learning compared to high school and it’s just loads better but not online college at least rn normal online college is fine bc the teachers who do it are prepared to do it bc they wanted to.\n\nMy advice I can give for that is check ur syllabus and see if that helps if u haven’t already which I’m sure u did and just keep working, I wish you the best friend and hope u make it through this",
          "author": "Working_History",
          "created": 1602807293,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g8y4ncy": {
      "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8y4ncy/",
      "text": "Bruh that second to last statement hit me hard lol I do feel like teachers are substituting time teaching for more work. They come up with the bullshit excuse that \"you're supposed to complete a certain amount of hours in a course so they give you work that makes up for the amount of time you would've been in class\". We don't want bullshit work (which is literally what it is. They just won't call it that). I'd rather have a long assignment that takes work and thought than have a bunch of random shit to do that's the same thing over and over and a waste of time. And I LOATHE professors who's test doesn't match up with the content. I had a professor like that. End of the semester I found out he uses multiple people's tests and just gives them to us. It explained everything. He was too lazy to even make his own tests to make sure it matched the format of the rest of our work. Freakin ridiculous",
      "author": "vness1213",
      "created": 1602802856,
      "upvotes": 9,
      "replies": {
        "g8ybtwd": {
          "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8ybtwd/",
          "text": "Yeah it’s just teachers trying to make up not teaching with work thinking that helps when all it really does is burn us out, make us not want to do it, and to try and find the fastest easiest way to do it all",
          "author": "Working_History",
          "created": 1602807006,
          "upvotes": 3,
          "replies": {
            "g8ycgbe": {
              "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8ycgbe/",
              "text": "Then quizlet starts lookin like a better option lol",
              "author": "vness1213",
              "created": 1602807354,
              "upvotes": 3,
              "replies": {
                "g8ycj8d": {
                  "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8ycj8d/",
                  "text": "Bruh if quizlet didn’t exist I wouldn’t be passing rn lol",
                  "author": "Working_History",
                  "created": 1602807399,
                  "upvotes": 2,
                  "replies": {
                    "g8yd7j0": {
                      "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8yd7j0/",
                      "text": "I think that's how a lot of people are rn. Especially since we're halfway through the semester. Honestly, I follow my high school teachers motto \"work smarter not harder\". If I'm taking a class where I'm genuinely not learning anything and just have to pass it to get my degree, I'm gonna do it efficiently. I always try doing things the old fashioned normal way. But if that's not working, Im doing something else because I'm ready to be out of school",
                      "author": "vness1213",
                      "created": 1602807781,
                      "upvotes": 3,
                      "replies": {
                        "g8ydcz9": {
                          "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8ydcz9/",
                          "text": "Yeah same like I enjoy learning and knowing myself how to figure stuff out but if I need to for a grade I gotta do what’s gotta be done in an unfair circumstance yk",
                          "author": "Working_History",
                          "created": 1602807865,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g8y3fax": {
      "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8y3fax/",
      "text": "Before online I could mitigate the affects of a sloppy Professor, I didn’t like it but I did it. Now I realize how much crap Professor’s get away with , and students have virtually no say and end up with the shitty grade—thousands of $$$ paid for this treatment and shitty quality. The Dean doesn’t give a shit, they’re all just busy keeping the machine running cause they got to get paid—it’s the whole reason why they’re forcing everything online and continuing “education” as if everything were normal—they want absolute no disruption in their mortgage payments, accumulation of pension benefits, and netting financial aid for their institution. Lawsuits claiming lower fees are needed for online courses,  😂, they’re looking to get those dismissed by burying you in work to claim your getting a “complete education “ Fuck your mental health!",
      "author": "RomanLion29",
      "created": 1602802179,
      "upvotes": 24,
      "replies": {
        "g8ybofm": {
          "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8ybofm/",
          "text": "I’ve never had a bad professor to my memory, all were great from last year but I feel it’s the quarantine mindset of “I’m not doing this bs” that makes the professor like that which I understand but then u gotta make it easy for the students as well, like my history class rn is like that but the teacher makes it very easy with video lectures uploaded for the whole semester and a handout of all that will be on the tests. I 100% agree with u tho and it’s a shame",
          "author": "Working_History",
          "created": 1602806920,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g8xo3nc": {
      "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8xo3nc/",
      "text": "That “professor”, if he dares call himself that, needs to be fired. His job is not only to assign his students assignments and exams but also to help them learn which includes answering questions on the material and assignments. Why the hell would he dodge pertinent questions like that?? And those cheesy copy-paste statements would piss me off.  Some of these professors need an ass-whoopin for real. What in fuck.",
      "author": "Pikabluee",
      "created": 1602793966,
      "upvotes": 8,
      "replies": {
        "g8xot3u": {
          "link": "/r/CollegeRant/comments/jbrycd/online_school_is_kicking_my_ass/g8xot3u/",
          "text": "It seems you’ve also had professors like that huh? \n\nI would love to report him to something but idk who I would and I’m sure he’s doing just the bare minimum to stay out of trouble especially since my college is scrambling during this online thing. \n\nThe last time I asked him for help by asking him if there is an answer sheet for the practice questions in the book so I know if I’m right or not he said and I quote “the way this course is set up is so you can use any outside resources you would like.”\n\nAs someone recently told me “there’s some who do their job, and there’s some who do their job well”",
          "author": "Working_History",
          "created": 1602794337,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634063311
}