{"sid": "oewuo6", "link": "/r/CollegeRant/comments/oewuo6/my_professor_assigns_awful_tests/", "title:": "My professor assigns awful tests.", "text": "Organic Chemistry is the only class I'm taking for the summer semester. That being the case, I figured I would have plenty of time to dedicate to studying for the sake of raising my GPA up ever so slightly. And I feel that I use that time wisely. I read through each chapter before we go over it in class, and note the differences between what's taught in the book vs what we learn in class. Then I run through every single additional practice problem that the book offers, as well as the assigned homework and optional practice tests. I planned on mastering this class. I was going to eat, breathe, and speak organic chemistry.\n\nThe material isn't difficult. I actually take to it pretty well. I have no issue running through the practice problems. The problem is the tests. A lot of the material that we study winds up being left off of the test in the end. This wouldn't be so much of an issue if it weren't for the fact that in it's place are either questions with vague wording (that may or may not be trick questions), or questions regarding material that was barely skimmed over. On top of this, the tests are anywhere from 20-28 questions long, so even a few wrong answers drastically drop your test grade. I tend to make careless mistakes, so I can see the value in having so few questions that you're forced to be more careful with your choices. But I feel that there's no way to study for some of these questions. Even with all the studying that I do, it seems like there's no way to predict what questions will show up on the next test, or how they'll be worded. Even the practice tests do nothing to prepare you (I'm thankful to have practice tests at all, but they're criminally short. Usually <10 questions).\n\nI've asked around, and my classmates seem to share the same feeling. Despite all my trouble, I actually have the second highest grade in the class. The only exception being someone who is currently retaking the class. One class should not be wearing me out this much.", "author": "VeXedZenith", "created": 1625584188, "retrieved": 1632949599, "over_18": false, "upvotes": 6, "upvote_ratio": 0.8, "comments": {"h4bu4wu": {"link": "/r/CollegeRant/comments/oewuo6/my_professor_assigns_awful_tests/h4bu4wu/", "text": "I honestly don't know what to say because I had the exact problem through my two sems of ochem. I guess I just powered through it , looked at past exams , studied honestly all week. Make sure to do practice material if the prof hand makes questions. I hope everything goes good for you , you can do it !", "author": "tae8jinafk", "created": 1625639984, "upvotes": 1}, "h4a1n2v": {"link": "/r/CollegeRant/comments/oewuo6/my_professor_assigns_awful_tests/h4a1n2v/", "text": "revise on past exams", "author": "kaytherine", "created": 1625603978, "upvotes": 1}, "h49s14k": {"link": "/r/CollegeRant/comments/oewuo6/my_professor_assigns_awful_tests/h49s14k/", "text": "Maybe try studying with the person that has the highest grade and if you can look at previous tests, that may help? This feels like a case of knowing the professor more than knowing the material.", "author": "asynchronicity", "created": 1625599807, "upvotes": 1}}}