{"sid": "lxws65", "link": "/r/CollegeRant/comments/lxws65/professors_not_making_assignments_due_during/", "title:": "Professors not making assignments due during spring break, but making them due immediately after so I have no choice but to do it during spring break", "text": "This whole semester has been nothing but an absolute buttfuck. All I ask is one week where I don’t have to think about school at all. My brain can only handle so much of this online shit. \n\nI know I probably shouldn’t complain because I’ve heard that some schools have up and cancelled spring break. Even if they are doing it to keep from having a covid outbreak, I still think that’s such a dirty thing to do to students during such a stressful time like this, and my heart goes out to you if your school did that.", "author": "yuxngdogmom", "created": 1614895727, "retrieved": 1632951396, "over_18": false, "upvotes": 48, "upvote_ratio": 0.92, "comments": {"gr3b7hm": {"link": "/r/CollegeRant/comments/lxws65/professors_not_making_assignments_due_during/gr3b7hm/", "text": "Honestly I feel you. My college is officially doing spring break this week but lol. One of my professors scheduled a midterm due at midnight next Monday. Not 11:59 pm on Monday, after the whole day, so you technically officially have the whole first day back from break to work on it. Nope. Due *literally the exact minute* that spring break ends (and per the schedule break runs through Sunday, not just M-F, so it's not even like \"we have the weekend to work on it\") And I have three other big assignments due basically as soon as break ends, but at least with a little bit more breathing room (i.e. a 10 page lab due next Tuesday). \n\nIt's absolute hell. The one consolation I've been able to give myself is that I at least have a little bit more breathing room, because I *only* have these big assignments to worry about and the week to work on them, instead of having to constantly stop and do other classwork in between like I would in a normal week. I hope it was at least the same for you. But yeah it's absolutely obscene that we can't get an actual break, especially after every professor seems to have collectively gone insane with their workload since the onset of covid.", "author": "TiberiusCornelius", "created": 1615869909, "upvotes": 2}, "gpr9rst": {"link": "/r/CollegeRant/comments/lxws65/professors_not_making_assignments_due_during/gpr9rst/", "text": "I get you :(\nOur spring break was in February for some reason ;-; and resits were scheduled right after so I've spent my break working even more than before", "author": "Szannok", "created": 1614937251, "upvotes": 2}, "gpq9fz6": {"link": "/r/CollegeRant/comments/lxws65/professors_not_making_assignments_due_during/gpq9fz6/", "text": "Same. I hate when they schedule an exam when we come back.\n\nI also am glad my school doing spring break. Sadly for me I'm enrolled at a university and CC and they of course have different spring breaks. Atleast getting half a break is still nice though!", "author": "elocinkrob", "created": 1614911487, "upvotes": 4}, "gpq1kh4": {"link": "/r/CollegeRant/comments/lxws65/professors_not_making_assignments_due_during/gpq1kh4/", "text": "Four straight months of waking up at 7 AM after not going to bed till 12, and three online classes - all with no break. Maybe six classes was not the best decision I made but i just want to graduate already.", "author": "rubytherubicon", "created": 1614907378, "upvotes": 10}, "gpptgy7": {"link": "/r/CollegeRant/comments/lxws65/professors_not_making_assignments_due_during/gpptgy7/", "text": "Lol lucky you, at least you get spring break. My university took it away so legit i have no break, just 16 weeks of straight AIDs and then finals kms :(", "author": "throaway121217", "created": 1614903221, "upvotes": 21}, "gppiye5": {"link": "/r/CollegeRant/comments/lxws65/professors_not_making_assignments_due_during/gppiye5/", "text": "I’m so sorry that is awful. We all are under enough stress already that break is well needed and deserved. I’ve been blessed to have understanding professors but it’s terrible that not everyone gets to have that.\n\nEDIT: I had to come back and take this back lmao my spring break is next week and I got lots of major assignments due immediately after the “break”", "author": "julsya004", "created": 1614897979, "upvotes": 2}}}