{
  "sid": "j66jyz",
  "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/",
  "title:": "My head hurts",
  "text": "Everyday I stare at my screen for 5+ hours on zoom calls, assignments, and reading. I actually get nauseous at times. I dont even want to look at my phone. This can't be healthy, right? And breaking up screen time during the day would simply mean taking x3 as long to get through everything, so I just try to knock it all out with a few breaks. I wonder what health impacts this will have for students? I can guess :\\",
  "author": "n0way0ut1",
  "created": 1601996375,
  "over_18": false,
  "upvotes": 172,
  "upvote_ratio": 0.99,
  "comments": {
    "g7z8sdb": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7z8sdb/",
      "text": "Smoke some weed",
      "author": null,
      "created": 1602050525,
      "upvotes": 1,
      "replies": {}
    },
    "g7ywvlq": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7ywvlq/",
      "text": "I REALLY recomend going to an eye doctor. I was having a similar issue and it turned out I needed glasses. Save yourself some stress and GO GET THEM CHECKED.",
      "author": null,
      "created": 1602041594,
      "upvotes": 1,
      "replies": {}
    },
    "g7y8ltu": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7y8ltu/",
      "text": "I’ve been getting chest pains from sitting in a chair all day.",
      "author": "CapriciousSalmon",
      "created": 1602027635,
      "upvotes": 1,
      "replies": {}
    },
    "g7xvhvz": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7xvhvz/",
      "text": "I’ve been getting headaches where I smell random stuff. Sometimes it’s blood, sometimes it’s smoke, whatever. I talked to my doctor and turns out they’re migraines from staring at screens all the time and the smells are auras. I didn’t realize it could be a migraine if the pain wasn’t debilitating but here we are I guess.",
      "author": "judolphphph",
      "created": 1602020347,
      "upvotes": 3,
      "replies": {}
    },
    "g7xuyzk": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7xuyzk/",
      "text": "My eyes are starting to hurt. I also noticed when I’ve been staring at my laptop for hours, I start seeing double. Sooo... that definitely not good",
      "author": "BlackLabel6661",
      "created": 1602020072,
      "upvotes": 3,
      "replies": {}
    },
    "g7xnkpt": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7xnkpt/",
      "text": "Get up, stretch, take breaks, exercise, and coffee would be my suggestion!",
      "author": "xyzninja",
      "created": 1602016312,
      "upvotes": 2,
      "replies": {}
    },
    "g7xf5bo": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7xf5bo/",
      "text": "You need to get a comprehensive eye exam.  Get some glasses with blue tint and glare protection.  When I don't wear my glasses, my migraines intensify. Also, sitting down for extended hours doing research or writing papers wrecks my neck and back.  Do stretches and eye breaks during zooms.  And walk around when you can.",
      "author": "apl2291",
      "created": 1602012771,
      "upvotes": 3,
      "replies": {}
    },
    "g7wzwtf": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7wzwtf/",
      "text": "My eyes get really watery and burn sometimes I gotta stop staring at my screen at the point and only work on paper. I have to print out all my assignments just so I won’t stare at a screen all day.",
      "author": "Hawkbiitt",
      "created": 1602006366,
      "upvotes": 5,
      "replies": {}
    },
    "g7wwxpc": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7wwxpc/",
      "text": "I had to go to the doctor after having migraines pop up more frequently. They have stopped for now. I try wearing my glasses everyday and drink coffee to keep the migraines away. I do take benadryl and/or naproxen when I get the feeling of a migraine coming.",
      "author": "darkaquamarine007",
      "created": 1602005133,
      "upvotes": 2,
      "replies": {
        "g7x0gb7": {
          "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7x0gb7/",
          "text": "I think the fact that I stopped drinking coffee a week ago has made it harder, for sure. I stopped because it was causing super inflammatory issues with my skin, but it sure helped with headaches. 😥",
          "author": "n0way0ut1",
          "created": 1602006592,
          "upvotes": 2,
          "replies": {
            "g7x24op": {
              "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7x24op/",
              "text": "Yeah, I have anxiety but I can't skip coffee because within two days of no caffeine I will get a migraine/headache for sure. I try not making my coffee too dark and eating yogurt seems to help with stomach problems.",
              "author": "darkaquamarine007",
              "created": 1602007290,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g7wrwk5": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7wrwk5/",
      "text": "I recommend getting blue light blocking glasses to at least help alleviate some of the headaches. They’re pretty helpful and inexpensive.",
      "author": "lavendrambr",
      "created": 1602002887,
      "upvotes": 3,
      "replies": {}
    },
    "g7wpv46": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7wpv46/",
      "text": "Highly recommended tip: look 20 ft. away from your screen every 20 minutes for 20 seconds ! Eye doctors recommend doing this to avoid eye strain and worsening any vision problems you have. Please please please do this!\n\nAnd every hour, take a short 5 min. walk or stretch to make sure your muscles won’t atrophy. It helps prevent shoulder/back/neck stiffness as well. Sitting is comparatively more unhealthier than smoking if leading a sedentary lifestyle over a long time period.\n\nPlease make sure to take care of yourself !!!! <3",
      "author": "yjn_park",
      "created": 1602001866,
      "upvotes": 26,
      "replies": {
        "g7wu8jx": {
          "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7wu8jx/",
          "text": "These are really great tips. I would also like to add that using blue light blocking glasses are really helpful too. They stopped the majority of migraines I got from staring at a screen",
          "author": "ASacOFluffyPups",
          "created": 1602004033,
          "upvotes": 5,
          "replies": {}
        },
        "g7wzq2n": {
          "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7wzq2n/",
          "text": "Thanks! ☺",
          "author": "n0way0ut1",
          "created": 1602006290,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g7wp8n0": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7wp8n0/",
      "text": "I recently just had to go see my eye doctor because I noticed my vision, without my glasses or contacts, was getting very blurry. Turns out my eyes were literally drying out from looking at screens all day. I had to get a change in prescription because the damage is permanent :/ My eye doctor advised me to purchase blue light glasses (along with some expensive eye drops) and it’s gotten better. \n\nIt upsets me that no one is really considering the impact zoom university will have on our health. Like my eye sight has been permanently changed because of this and it’s just shocking to think of sometimes. I would suggest buying blue light blocking glasses and staying hydrated :)",
      "author": "lazairiaw",
      "created": 1602001558,
      "upvotes": 15,
      "replies": {
        "g7xxme8": {
          "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7xxme8/",
          "text": "same :/ my eye sight has genuinely gotten significantly worse. sucks that its permanent damage.",
          "author": "SheriffSpooky",
          "created": 1602021484,
          "upvotes": 5,
          "replies": {
            "g7y4xgn": {
              "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7y4xgn/",
              "text": "It does suck. Hopefully we’ll all get through this",
              "author": "lazairiaw",
              "created": 1602025549,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "g7x02n4": {
          "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7x02n4/",
          "text": "Whoaa Im so sorry thats happened to you :(\nI didn't realize it could get that bad, I was worried about this kind of thing.",
          "author": "n0way0ut1",
          "created": 1602006433,
          "upvotes": 4,
          "replies": {
            "g7y51nk": {
              "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7y51nk/",
              "text": "Me too man. Luckily we all might be able to find some sort of relief",
              "author": "lazairiaw",
              "created": 1602025614,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g7wida9": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7wida9/",
      "text": "The lack of movement and the long hours staring at a computer it's not healthy. I feel terrible at the end of the day... My body resent it too.",
      "author": "swetdeaths",
      "created": 1601998127,
      "upvotes": 7,
      "replies": {}
    },
    "g7whyxq": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7whyxq/",
      "text": "This happens to me! Two things I highly recommend purchasing are blue light blocking glasses and a migraine essential oil roll on stick. I got both on amazon. I have headaches from staring at my phone and computer all day and the glasses help soooo much. The roll on stick helps to limit headache pain as well. :)",
      "author": "Fluffy_Magazine222",
      "created": 1601997926,
      "upvotes": 39,
      "replies": {
        "g7yxyse": {
          "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7yxyse/",
          "text": "#HEAD ON APPLY DIRECTLY TO THE FOREHEAD",
          "author": "KrombopulousMary",
          "created": 1602042231,
          "upvotes": 11,
          "replies": {
            "g7yyg8p": {
              "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7yyg8p/",
              "text": "This made me laugh much more than it should have.",
              "author": "ILikeGoldAndShowers",
              "created": 1602042526,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g7wzhep": {
          "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7wzhep/",
          "text": "Good idea! I have blue light blocker on my phone but not for the laptop, where I do all my work.",
          "author": "n0way0ut1",
          "created": 1602006188,
          "upvotes": 6,
          "replies": {
            "g7xu02i": {
              "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7xu02i/",
              "text": "If you have a MacBook, there’s a blue light filter that you can activate in your settings and there’s also a program called f.lux. Hope things get better!",
              "author": "bananagramxo",
              "created": 1602019564,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "g7whl1e": {
      "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7whl1e/",
      "text": "I suffer from migraines and staring at a screen and not getting off my ass the entire day is *killing* me. I feel super unhealthy. I think we'll probably see articles popping up in the next year or so about the health impacts online classes have had on students.",
      "author": "NarrowLoveX",
      "created": 1601997734,
      "upvotes": 81,
      "replies": {
        "g7yo043": {
          "link": "/r/CollegeRant/comments/j66jyz/my_head_hurts/g7yo043/",
          "text": "I workout in the morning before class, so I don’t feel like a pos for sitting on the couch all day",
          "author": "crystalliite",
          "created": 1602036402,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634063130
}