{
  "sid": "pwy6f0",
  "link": "/r/CollegeRant/comments/pwy6f0/fuck_lazy_professors_who_dont_teach/",
  "title:": "Fuck lazy professors who don’t teach.",
  "text": "I get it, you’re allowed to use Covid as an excuse, and this is a fully online class, so I guess I’m supposed to “teach myself.” But what the fuck? \n\nI emailed her and the response I got was “Did you read the textbook? I don’t have office hours.” And this is a 5 credit class, I’m paying thousands to not understand the text, watch hours of YouTube to try and understand, then have Pearson grade all my assignments. This sucks.",
  "author": "MiddleweightMuffin",
  "created": 1632801772,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.83,
  "comments": {
    "henfpu1": {
      "link": "/r/CollegeRant/comments/pwy6f0/fuck_lazy_professors_who_dont_teach/henfpu1/",
      "text": "Sounds like you got my prof exactly. Every single part of the course was copy and pasted from a template. So was the syllabus. She called herself the FACILITATOR for the course rather than the instructor! Didn’t have office hours because she didn’t even live in the state! No notes, no recorded lectures, just a shitty math lab that you had to pay an extra 150 bucks for. 5 credit precal class with trig and not one fuck given. Didn’t even send an email welcome the first week of class. It’s my last class before I get my associates too:/ I had to drop it. I’ll just take the class at whatever 4 year I transfer to. I honestly can’t believe they are allowed to do that.",
      "author": "LenoraNoble",
      "created": 1632867564,
      "upvotes": 1,
      "replies": {}
    },
    "hele5s5": {
      "link": "/r/CollegeRant/comments/pwy6f0/fuck_lazy_professors_who_dont_teach/hele5s5/",
      "text": "Lazy/distant professors online are the worst. In person they physically cant avoid you, but online they can be as distant, lazy, and boring as they want.",
      "author": "ttyltyler",
      "created": 1632836384,
      "upvotes": 3,
      "replies": {}
    },
    "hek5n96": {
      "link": "/r/CollegeRant/comments/pwy6f0/fuck_lazy_professors_who_dont_teach/hek5n96/",
      "text": "I’m sorry to hear about this. Online/asynchronous education has largely been self-led for many years, and COVID has made it more apparent to more people. To people who are used to live instruction, it can seem problematic. In any situation, there should be support for you if you have questions.\n\nWhat did you ask in your email? It usually helps to tailor your question to indicate that you read and still don’t understand. For example, “I read about X on p. XX, but I’m still unclear on XYZ.” If they still won’t help you, then that’s crappy, and you should consider speaking to the department chair. However, if you said “I don’t understand what to do,” that can signal that you haven’t tried (whether or not that’s true).",
      "author": "PhDapper",
      "created": 1632804248,
      "upvotes": 5,
      "replies": {}
    },
    "hek40bz": {
      "link": "/r/CollegeRant/comments/pwy6f0/fuck_lazy_professors_who_dont_teach/hek40bz/",
      "text": "Omg my daughter and I were just ranting about this. She still hasn’t seen her Professor as he has the TA talking to them and just turned in a paper about something they never covered. It was just bam, here’s a due date and write this paper and figure out the answer to this problem we never did before in an INTRO class.\n\nLots of students straight out of high school in there that are confused. He (TA)really gives off the vibe that he’s enjoying stumping the Freshmen. He also seems stressed (understandably) and keeps mentioning he’s super busy and may not be able to get back at them because he’s working on his dissertation. No mention and no sight of the Professor.",
      "author": "wawabubbzies",
      "created": 1632803216,
      "upvotes": 3,
      "replies": {
        "herrvam": {
          "link": "/r/CollegeRant/comments/pwy6f0/fuck_lazy_professors_who_dont_teach/herrvam/",
          "text": "It sounds like this TA isn't doing a great job, but I will say it's pretty typical for TAs/grad students to basically teach entire courses. Not that it should be that way, but it isn't abnormal",
          "author": "biggestbaddestnerd",
          "created": 1632949450,
          "upvotes": 1,
          "replies": {
            "hersh2m": {
              "link": "/r/CollegeRant/comments/pwy6f0/fuck_lazy_professors_who_dont_teach/hersh2m/",
              "text": "Really sucks because it feels like we’re paying for crap  but it’s a course she has to take for her major;-;",
              "author": "wawabubbzies",
              "created": 1632949698,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hewawsb": {
      "link": "/r/CollegeRant/comments/pwy6f0/fuck_lazy_professors_who_dont_teach/hewawsb/",
      "text": "I agree. Thankfully, all of my online professors have cared so far, but I am upset on your behalf considering I never had a professor who didn't have office hours.",
      "author": "yobaby123",
      "created": 1633035510,
      "upvotes": 1,
      "replies": {}
    },
    "hey9tl3": {
      "link": "/r/CollegeRant/comments/pwy6f0/fuck_lazy_professors_who_dont_teach/hey9tl3/",
      "text": "totally understand where you are coming from they are always like\" if you have any questions or need anything im here just email me and i will get back to you\" then you email them and ask a question and never get any help. paying thousands of dollars to do your stupid ass 10 year old cookie cutter courses is fucking stupid especially when the professor isnt there to help you when you need it",
      "author": "ThanosToaster",
      "created": 1633074928,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634061558
}