{
  "sid": "q7jcl6",
  "link": "/r/CollegeRant/comments/q7jcl6/whats_your_worst_breakout_room_experience/",
  "title:": "what's your worst breakout room experience?",
  "text": "So many awkward & cringe stories these past two years of remote school. Breakout rooms have personally been such a missed opportunity and have potential as a concept, but somehow so poorly educated they get all students to quit zoom once the professor announces breakouts. Has ANYONE had them go well? how??",
  "author": "Prestigious_Tea_3781",
  "created": 1634155211,
  "updated": 1634595395,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hgjh9qz": {
      "link": "/r/CollegeRant/comments/q7jcl6/whats_your_worst_breakout_room_experience/hgjh9qz/",
      "text": "I just pop my camera on and start talking about whatever we are supposed to be discussing. \nI asking people in my group questions, and call them by their names.  Sometimes I would introduce myself and try to make it feel friendly and not awkward.",
      "author": "ThereIsNo14thStreet",
      "created": 1634163959,
      "upvotes": 3,
      "replies": {
        "hgjniwj": {
          "link": "/r/CollegeRant/comments/q7jcl6/whats_your_worst_breakout_room_experience/hgjniwj/",
          "text": "Absolutely this. I fluctuate between thinking of it as \"group leader\", \"designated adult\", and \"TA surrogate\".  I feel like I take on that role so often even when I don't really want it, but otherwise the limited time is wasted. My biggest gripe is I think it presents me as knowing more than I do or thinking higher of myself than I do.",
          "author": "WriggleNightbug",
          "created": 1634166822,
          "upvotes": 1,
          "replies": {
            "hgjxsfo": {
              "link": "/r/CollegeRant/comments/q7jcl6/whats_your_worst_breakout_room_experience/hgjxsfo/",
              "text": "Hahaha- Yes!  It's funny 'cause I am a tutor, and sometimes in the breakout rooms, I accidentally adopt my tutoring voice and ask probing questions, even if I don't know jack.  I can't help it!  But same thing, I am worried that I come off as being a know-it-all snot or something, but really I just don't wanna waste time.",
              "author": "ThereIsNo14thStreet",
              "created": 1634171673,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hgjpwsh": {
      "link": "/r/CollegeRant/comments/q7jcl6/whats_your_worst_breakout_room_experience/hgjpwsh/",
      "text": "When no one else would step up to write down answers or share their screen when we had a online lab. \n\nThere was this one girl who, as soon as the room was opened and everyone joined, she would immediately say, \"sooo, who wants to share their screen?\" And then she would proceed to just sit there and wait until someone besides her volunteered to do it. She not only never volunteered to share her screen, but she also never volunteered to record answers or help answer questions. I bet she was probably looking at something else off screen, and she would just say \"mmmhmmm\" when we asked if the answer seemed correct. In hindsight, I should have just not put her name on our answer sheet when we turned it in. Screw her.",
      "author": "Actual-Gap-9800",
      "created": 1634167942,
      "upvotes": 8,
      "replies": {
        "hgjz0m0": {
          "link": "/r/CollegeRant/comments/q7jcl6/whats_your_worst_breakout_room_experience/hgjz0m0/",
          "text": "I know this is playing devils avocado, but at least she's sending a signal that it needs to happen.  Sure, its bullshit and passive aggressive and she could just frigging step up but its better than no one doing anything at all.... probably.",
          "author": "WriggleNightbug",
          "created": 1634172255,
          "upvotes": 7,
          "replies": {
            "hgk2q4g": {
              "link": "/r/CollegeRant/comments/q7jcl6/whats_your_worst_breakout_room_experience/hgk2q4g/",
              "text": "Well, yeah, but I mean the thing is we all know the work has to get done. If we just sit there staring at each other then of course we're going to get a 0 for the day. Perhaps I should have been more clear...she would say \"so who wants to share their screen?\" As soon as all the group members were there, as if to make a preemptive strike and make it look like she was so productive getting the ball rolling. I would have been fooled (as in, I would have been totally fine with it) IF she actually contributed to the discussion/ work. Those were the only words she said the entire 2 1/2 hour lab lol. That's why I remember it as a bad experience with breakout rooms. Everyone else besides her contributed, even when they didn't want to.",
              "author": "Actual-Gap-9800",
              "created": 1634174021,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    }
  }
}