{
  "sid": "o4mziv",
  "link": "/r/CollegeRant/comments/o4mziv/my_experience_in_undergraduate_dissertation_year/",
  "title:": "My experience in undergraduate dissertation year. (Long)",
  "text": "I started my final year of Bsc. Environment Science with confidence. I was doing great, great is an exaggeration i guess but still. I went in with a plan, i had already thought of my dissertation topic and what i would do, what schedule i will follow etc.etc. \n\nOnly for my first choice of topic to be shot down for god knows what reason. But i did end up finally writing a proposal in same study area, that was accepted and so i went ahead with the plan. It was hard for me just like for anyone else in their final year studying during this unholy pandemic. Juggling classes, assignments of other modules and monthly field visits was equally hard. \n\nMy instructor was really unhelpful to the point where he went from being my favorite professor to one i dont even respect. So, that was nice. Me and my friends who had choosen same field site did everything by ourselves. My instructor didn't even give me someone who hasn't ever been to field, a basic run down of what i should do and what i should be cautious of during the field. I went in blind, I had read enough literature to know how to conduct my sampling so it was fine. I was scared that i might get kidnapped or smthing in the middle of the jungle but that didn't happen so that's fine too. \n\nMy first month's water sample's Dissolved oxygen reading was completely ruined cause the fucking hanna probe wasn't calliberated. When i told my instructor that his meter gave me wrong readings he just told me that I should have had a backup plan. Which fair enough, still stung cause i had never even been to field like that and i actually had asked for the chemicals for winkler's test to my college but when they didn't get it on time, he told me to take the meter. Got the chemical by next month and everything went smoothly. \n\nI finished my 3 month biotic sampling, worked on my water samples  till 8 ? 9? Pm in college lab everyday after i came back from the field trip. It was tough i was tired from riding my scooter on the jungle's shitty roads but it was a fun experience. Riding in the dark or on roads that made me nearly cry cause i thought i was gonna fall off (i did btw plenty of times), having mini picnics by the river side, for someone who hadnt travelled much it was amazing. Especially running around in empty college hallway at 9 pm with flashlight on with my friends cause we were scared af. \n\nSo, all my instructor had to do was to give me past data. The whole reason i wrote the proposal for \"Long term variation\" was because he was confident when he said \"I will provide you the data\". That was all he had to do and mind you I had been asking for those data of those months even before i had submitted the proposal. 3 month field trip and 1 month lab works later he still hadn't given me the data. I was still not that pissed off cause he is a busy man and we still had time to submit our dissertation. \n\nI kept waiting wrote few sections of my dissertation but the deadline was getting closer. I received the data 1 week before my submission :). I was way too overconfident with my knowledge about R studio and had predicted that by 2 days i would finish all of my analysis but nono it took 2 days to just sort those fucking data only to find out that instead of 5 years, the data i received was only of 2 years and the months i had been working on was missing. Great. \n\nSoo went with it. Did whatever i had to do. Submitted it so fucking late cause analysis was an absolute fucking bitch. I couldn't even give my instructor my draft for him to review it cause i was finished on the deadline date and noway in hell could i ask him to review it. \n\nAll that idk can i call it hardwork if it bore no fruit? Lol, either way, after submitting i hadn't expected grade A whatsoever. Idk if this is my final grade or not but i got B (UK grading). I am absolutely devasted because my field work had been so annoying and so stressful. I know that we aren't graded on the scale of how much work we have done instead on how well you wrote. The reason i am devasted it cause i feel all that hard work was for nothing. I couldn't write or give much time to the writeup of my thesis nor could i ask for draft feedback. I am even more torn because other students in my class who had choose to do smthing easy af and their field finished in like a week, will get better grades than me cause well might be easy or simple but they probably did a better job writing than me.  \n\nIdk if i should be happy that i got B cause i wrote my dissertation in 1 week or if i should be sad cause fuck i didn't get the mrks i was expecting when i was doing my field work for the research. \n\nI just wanted to get it off my chest cause idk how to bitch about this to anyone.\n\nTldr: My dissertation took alot of hardwork but because i couldn't write properly i got low marks. :)",
  "author": "shinshinshu",
  "created": 1624249585,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "h2l7mh0": {
      "link": "/r/CollegeRant/comments/o4mziv/my_experience_in_undergraduate_dissertation_year/h2l7mh0/",
      "text": "Same thing here. I am in the US and my mentor for my thesis was always returning to edits late. Made me compose a contract with official deadlines, terms, & conditions, and never signed it. \n\nI worked my ass off my dissertation and communication attempts were often replied with \"I don't understand, we had a deadline.\" Worked my ass off, abused my adderal, paid extra for thesis services that said one thing, but all other resources said another thing. \n\nUni fucked a lot of people over. I was unable to turn in a final draft as well. Regardless we did what we could, & your in a hard major so I have no idea how you managed all that you did given the circumstances you were in. \n\nRegardless, don't let this consume you. I know how hard it can be, it's heartbreaking. It's not your fault. Mentorships are a two way street, the failure is not a result of you and only you alone.",
      "author": "xoklgxo",
      "created": 1624314794,
      "upvotes": 2,
      "replies": {
        "h2nevqt": {
          "link": "/r/CollegeRant/comments/o4mziv/my_experience_in_undergraduate_dissertation_year/h2nevqt/",
          "text": "That really fucking sucks. I mean i feel like instructors don't realise how hard it is for students. \n\nI feel like not sending first draft is smthing i will always regret cause you just think that maybe if had sent in this would have gone better.\n\nThank you for the kind words.ㅠㅠ",
          "author": "shinshinshu",
          "created": 1624368975,
          "upvotes": 1,
          "replies": {
            "h2uvf6u": {
              "link": "/r/CollegeRant/comments/o4mziv/my_experience_in_undergraduate_dissertation_year/h2uvf6u/",
              "text": "I can totally relate on the final draft, but honestly we were doing this stuff during the pandemic. At least we attempted!",
              "author": "xoklgxo",
              "created": 1624514611,
              "upvotes": 2,
              "replies": {
                "h2wqmhn": {
                  "link": "/r/CollegeRant/comments/o4mziv/my_experience_in_undergraduate_dissertation_year/h2wqmhn/",
                  "text": "Yep!",
                  "author": "shinshinshu",
                  "created": 1624556789,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h2kuv4t": {
      "link": "/r/CollegeRant/comments/o4mziv/my_experience_in_undergraduate_dissertation_year/h2kuv4t/",
      "text": "A lot of people gave me grief about not doing an undergrad dissertation/thesis (I decided not to do this before the pandemic hit because I didn't think I could find a good committee) but honestly? Zero regrets about not making COVID harder for myself. Didn't help that most of the professors who were bugging me about it were also aware of the committee issue but refused to be on my committee anyways.",
      "author": null,
      "created": 1624308665,
      "upvotes": 3,
      "replies": {
        "h2neoc6": {
          "link": "/r/CollegeRant/comments/o4mziv/my_experience_in_undergraduate_dissertation_year/h2neoc6/",
          "text": "Its great that you could opt out! It was compulsory module so i had to do ㅠㅠ",
          "author": "shinshinshu",
          "created": 1624368866,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h2ipk2d": {
      "link": "/r/CollegeRant/comments/o4mziv/my_experience_in_undergraduate_dissertation_year/h2ipk2d/",
      "text": "[deleted]",
      "author": null,
      "created": 1624266756,
      "upvotes": 3,
      "replies": {
        "h2irqpf": {
          "link": "/r/CollegeRant/comments/o4mziv/my_experience_in_undergraduate_dissertation_year/h2irqpf/",
          "text": "Regarding the I stopped caring thing, tbh same. After submitting it i felt so drained cause i felt i didnt do as good as i hoped i would do. \n\nIdk why professors agree on being an instructor if they dont gave the time or feel the need to help their students.\n\nOh god i am glad i didn't reallly have to present my work, cause that would have suckeeeed. I hope you get more than you expected ㅠㅠ. But cheers to us for atleady finishing before deadline lol.",
          "author": "shinshinshu",
          "created": 1624268963,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634064408
}