{
  "sid": "mwpplc",
  "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/",
  "title:": "College is beating a dead horse with this semester.",
  "text": "It’s me. I’m the dead horse. And they are beating me.",
  "author": "yuxngdogmom",
  "created": 1619162085,
  "over_18": false,
  "upvotes": 294,
  "upvote_ratio": 0.99,
  "comments": {
    "gvmgo7d": {
      "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvmgo7d/",
      "text": "For some reason its the opposite for me, first year student here; the first semester kicked my ass, ended up with a 2.31 gpa, got a drug charge on campus due to being caught with some left over weed when I was pulled over for speeding, made no friends, and felt like transferring to a college near home. This semester i’m making all A’s and decided to continue attending this school. This semester really made me enjoy college.",
      "author": "haceunmes",
      "created": 1619219782,
      "upvotes": 8,
      "replies": {}
    },
    "gvjxhjc": {
      "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvjxhjc/",
      "text": "I just got the critique from a group paper rough draft and mine got the most ciriticism and now I feel like the dumbest person there/the weak link. I understand that professors shorthand critique so that it fits on paper and he wasn't a dick about it. It just blew out my confidence and crushed the last bitvof motivation I really had. I'm ready to just half ass my portion because I'd at least come out with an 80 in the class, but I don't wanna bring down my groups grade. Idk just sucks.",
      "author": "vness1213",
      "created": 1619175880,
      "upvotes": 32,
      "replies": {
        "gvk5uee": {
          "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvk5uee/",
          "text": "Don't give up! That critique shows that your professor believes you have the necessary knowledge, skills, and abilities to (1) learn from the feedback and (2) apply it to submit work that meets a higher standard/is better quality. Remember, this is all to help you learn and grow, and believe me, professors who care also provide the best (and sometimes harshest) critiques. If he didn't care, he wouldn't waste his time on it. \n\nIf his feedback is mostly about meeting assignment requirements (e.g., length, formality, structure), maybe you just needed that extra guidance from the professor. Or maybe it's about meeting your field's reporting/writing standards. That takes a lot of practice before it becomes more natural to you. \n\nKeep it up - I know you can do this.",
          "author": "griffinicky",
          "created": 1619181549,
          "upvotes": 19,
          "replies": {
            "gvke2ne": {
              "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvke2ne/",
              "text": "great advice!",
              "author": "kollegekidkardashian",
              "created": 1619185890,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gvkilrl": {
          "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvkilrl/",
          "text": "Fuck em. Get the grade and move on. Graduation is your goal not impressing your peers.",
          "author": "ICantFindMyUnderwear",
          "created": 1619187994,
          "upvotes": 6,
          "replies": {}
        },
        "gvk5eh1": {
          "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvk5eh1/",
          "text": "Well, I would suggest working extra hard to make the next bit of stuff be overly good to assert academic dominance.",
          "author": "Alistair_TheAlvarian",
          "created": 1619181289,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gvjw4du": {
      "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvjw4du/",
      "text": "I still love you little dead horsey",
      "author": "ICantFindMyUnderwear",
      "created": 1619174759,
      "upvotes": 21,
      "replies": {}
    },
    "gvjs3hj": {
      "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvjs3hj/",
      "text": "I’m dead inside. Does that count?",
      "author": "majoroofboys",
      "created": 1619171146,
      "upvotes": 65,
      "replies": {
        "gvk4zxr": {
          "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvk4zxr/",
          "text": "I'm dead inside and the only thing keeping me upright is my pathetically tiny dose of adhd meds I can get before my official testing.\n\nAlso a gallon a day coffee habit.\n\nDuring 2020 and 2021 I have consumed a pound and a half of pure caffeine from all of the coffee.",
          "author": "Alistair_TheAlvarian",
          "created": 1619181046,
          "upvotes": 23,
          "replies": {
            "gvmkmxa": {
              "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvmkmxa/",
              "text": "My antidepressants the only thing keeping me from failing all my classes at the moment.",
              "author": "saltyfae",
              "created": 1619221890,
              "upvotes": 3,
              "replies": {
                "gvmtldj": {
                  "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvmtldj/",
                  "text": "Yup, I got prescribed 300mg wellbutrin and a \"that's rough buddy\" until I can get evaluated in 8 months to a whole fucking year.",
                  "author": "Alistair_TheAlvarian",
                  "created": 1619226758,
                  "upvotes": 3,
                  "replies": {
                    "gvn44yx": {
                      "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvn44yx/",
                      "text": "Literally just talked to my psychiatrist about getting wellbutrin on top of my antidepressants because they aren’t cutting it anymore. We got this though, just gotta hang in there for a little longer.\n\n“My girlfriend became the moon” - Sokka\n\n“That’s rough buddy” - Zuko",
                      "author": "saltyfae",
                      "created": 1619232812,
                      "upvotes": 3,
                      "replies": {
                        "gvn6zj0": {
                          "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvn6zj0/",
                          "text": "Yeah, I just got wellbutrin and it took me from depression, apathy, anhedonia, and nihilistic existential died to meh, the world actually looked brighter.\n\nI also have zero caffeine tolerance now so a single shot of espresso gets me awake when I used to have 14 and not really feel it.\n\nAlthough it does make my tinnitus worse but totally worth it.\n\nI also forget to eat for like two days at a time.\n\nI've never tried an ssri before, but the wellbutrin which is an snri is amazing.  I'm having a followup with my psychiatrist in a couple of weeks and I definitely need way stronger stimulants but if she increases my wellbutrin dose I'll have a seizure and if I drink more caffeine it might cause seizures.\n\nSo I'm either getting a real adhd med or a that's rough buddy.",
                          "author": "Alistair_TheAlvarian",
                          "created": 1619234577,
                          "upvotes": 2,
                          "replies": {
                            "gvn7kon": {
                              "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvn7kon/",
                              "text": "I’m glad it helped you a bit though. Have you considered SSRIs or what has your psychiatrist thought would help other than just wellbutrin. Just asking because you mentioned it was a strong stimulant.\n\nStimulants seems like a double edged sword, but that’s everything you know? Pros and cons.\n\nThe only reason I didn’t opt for wellbutrin is because I already have 0 tolerance for caffeine, had 2 red bulls and felt like I was going to die. Another day I had a 2 lattes and felt like I was going to die again- so I went for buspbar (buspirone?).",
                              "author": "saltyfae",
                              "created": 1619234948,
                              "upvotes": 2,
                              "replies": {
                                "gvnnuya": {
                                  "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvnnuya/",
                                  "text": "Not depressed anymore so no ssri needed.\n\nTwo redbulls is quite a lot of caffeine and near the maximum safe tolerance for many people.  Basically wellbutrin stops the reabsorption of norepinephrine and dopamine both of which caffeine causes the release of so they amplify eachothers effect.  It's also a smoking cessation aid so it massively reduces cravings and stops withdrawal from caffeine.\n\nFor me stimulants relax and focus me and make me not feel like shit and they let me sleep regularly.  The caffeine and now wellbutrin have been all perfect, the world seems physically brighter and I can feel joy again so that's nice.  The only tiny negative is that my tinnitus is a tiny bit worse and my resting heart rate is about 10bpm faster than normal sitting at 65bpm now.  Also my heart rate goes up quicker with light exercise to around 114bpm from cleaning or walking  but it feels fine and isn't really a problem since my max heart rate stayed about the same so it's all fine.\n\nI would 100% recommend trying it if you think it might help.  Some people feel way better and less anxious like me while others turn into sweaty jittery anxious messes on the two extreme ends.  It actually makes you slightly warmer by raising your basal metabolic rate by about 100 calories a day and also promotes sweating and suppresses appetite.\n\nIt's actually used along with an opiate blocker to help with weight loss in severely overweight people.",
                                  "author": "Alistair_TheAlvarian",
                                  "created": 1619247100,
                                  "upvotes": 2,
                                  "replies": {
                                    "gvnsz9l": {
                                      "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvnsz9l/",
                                      "text": "The weight loss and hunger/craving suppression really appealing to my BDD right now LOL. But thank you for the information, I’m just hesitant because of my negative experience with caffeine, but if my new anxiety meds don’t work I’ll try it out :)",
                                      "author": "saltyfae",
                                      "created": 1619251947,
                                      "upvotes": 2,
                                      "replies": {
                                        "gvnta0b": {
                                          "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvnta0b/",
                                          "text": "That shouldn't be to much of an issue, just avoid caffeine.\n\nAnd the stimulant effects are relatively mild without any other compounding stimulant.\n\nAlso as an added thing it can be used to treat ssri induced sexual dysfunction, so that's nice.",
                                          "author": "Alistair_TheAlvarian",
                                          "created": 1619252240,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gvskhux": {
              "link": "/r/CollegeRant/comments/mwpplc/college_is_beating_a_dead_horse_with_this_semester/gvskhux/",
              "text": "I think I got a cavity from the amount of soda I drank.",
              "author": "CapriciousSalmon",
              "created": 1619331591,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634063929
}