{"sid": "ooiq9q", "link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/", "title:": "People who go to community college", "text": "Doesn't it get tiring when you tell people what school you go to and they sound so diapointed :( \n\nLike im sorry dude, I just didn't want to start off life with -$30,000 to my name, this stigma needs to die \n\nLike bro if you want me to go to some expensive private school, come pay my bills", "author": "Turtleisim", "created": 1626841570, "retrieved": 1632841739, "over_18": false, "upvotes": 422, "upvote_ratio": 0.99, "comments": {"h5yq5q1": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5yq5q1/", "text": "Thank you u/Turtleisim for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1626841571, "upvotes": 1}, "ha250jf": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/ha250jf/", "text": "Honestly, when people mention that they did their first 2 years at community college, it makes me think they're more intelligent and savvy with their money. \n\nUnless you aim to work in a field that isn't in demand or are already in line for top connections, you may be wasting money with some of these more expensive colleges.", "author": "MinimalSithLord", "created": 1629741370, "upvotes": 1}, "h8vqbth": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h8vqbth/", "text": "Id rather go to a CC tbh, you can connect more with the professors, less money, and good way to keep student life on task", "author": "flying_alligators", "created": 1628920923, "upvotes": 1}, "h7xzfb3": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h7xzfb3/", "text": "No, because I get to turn around and ask them how much their last student loan payment was; mine was $0.00. I got to do a 90-30 program and walk with my bachelors degree and *no debt*.\n\nMy professors were all professionals in their fields. I have a contact in the city communications department. A contact in a number of Fortune 50 companies. Nobody works in academia, this is their part time gig that they do because they love the field, not because they are doing research and so their hung over TA teaches the whole class.", "author": "SamSeebourne", "created": 1628262812, "upvotes": 1}, "h7riw07": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h7riw07/", "text": "My husband went to a community college, transferred to a four year college, graduated, and landed a 100k a year job right outta college. Community college is the shiiiiiiittttt it was so cheap and was a vital stepping stone to succeeding in harder four year college classes. Love community colleges. Don’t be embarrassed. You’re getting more for your money.", "author": "catsofamericagirl", "created": 1628135191, "upvotes": 1}, "h7itzs3": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h7itzs3/", "text": "The only thing I hear is straight fucking facts.", "author": "GrowthDifficult9233", "created": 1627970598, "upvotes": 2}, "h6rdr7v": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h6rdr7v/", "text": "It makes me so sad because I know I'm making the better choice from a financial perspective but god I'm sad to miss out on the social aspect.  I feel like I have absolutely no friends as my high school friends are going to a 4-year college and moving and I'm right here. Having people look down on it just makes me feel even worse.", "author": "idkcat23", "created": 1627424467, "upvotes": 1}, "h67mdch": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h67mdch/", "text": "I don't know why people hate on community college. I went to CC after graduating high school to get a 2 year degree for transfer. The money I saved from doing that I invested into AMD and Nvidia stock along with bitcoin and ethereum back in 2016. All of those investments have paid off handsomely. I don't see any value in overpaying tens of thousands for classes that just check off a box on a list to get an 8.5 x 11 piece of paper. \n\nI guess it depends on what your goals are. If it's for bragging rights, or the so called \"college experience\" then all power to you. For me, its to make money. Thats the bottom line.", "author": "glitchmaster0001", "created": 1627013183, "upvotes": 2}, "h64h7ec": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h64h7ec/", "text": "Honestly, Community College was the best thing ever. It was much easier than college (which helped your GPA), getting refunds, and allow me to work on other things. \n\nWith college degrees becoming more common, why not save money and avoid debt to get similar education that others?  :)", "author": "aldosius17", "created": 1626960266, "upvotes": 1}, "h6379mn": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h6379mn/", "text": "There is nothing embarrassing about it. CC have tons of recourses and since it is located in your community, networking and opportunities are a lot more prevalent. When I was younger I always thought it was inferior to non-cc but once I saw how much it helped my mom finish her degree….that changed. Plus, They wouldn’t be judgemental once they see that refund check!!", "author": "Asleep_Cut505", "created": 1626925945, "upvotes": 1}, "h62q5ms": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h62q5ms/", "text": "I just graduated with an AA- Social and Behavioral Science, in my mid 20’s. I was a triple threat of “disappointment”: I finished 4 years late, it was “just an AA”- not AS, and it was *community college*. Yeah, I felt like a flop when I was attending. Yet, I finished, and am now enrolled in my local University which gets some nods of approval. I have zero regrets. Zero. I KNEW as a teenager and in my earlier 20’s that I had no idea what I wanted to do with my life. I KNEW I needed to trial and error my way around life to understand what my true interests, strengths, weaknesses, passions, and goals are. I had the self-awareness to know at 16 when everyone else was applying for universities that I didn’t belong there. People scorned  me for it and told me I’d go nowhere in life but oh the fuck well. It’s called self-awareness and looking back, I am VERY proud of younger me for going to CC first. Far more affordable, I could just take one class per semester if I wanted to (and often did-hence the 6 years to get a 2 year degree). I had a chance to learn how to manage my anxiety and self-confidence issues with fewer consequences. For instance, I did wind up on academic probation because my heart just wasn’t into college. I had a chance to mature, learn from mistakes, and stand on my own two feet. I graduated and now I’m on my way to a bachelors degree where I’m confident I won’t fuck shit up and can actually get the most out of higher education- all while having saved some serious cash for my general studies which I would have had to take anyway. \n\nPeople can judge but you could have chosen to not even be in college. You could NOT be working toward a degree. \n\nSociety is weird. You know what’s best for you.", "author": "ThrowAwayIdk6", "created": 1626917106, "upvotes": 3}, "h62q0hh": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h62q0hh/", "text": "So true. All the funny looks when you say u go to community College. Almost like they're disgusted  at you. But you'll have the last laugh. When your not in crippling debt after u get your degree.", "author": "LegendkillahQB", "created": 1626917037, "upvotes": 1}, "h62e55p": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h62e55p/", "text": "I just transferred to a 4-year for this fall semester because I moved but I am still taking summer classes at a CC in my home state. The CC has paid for everything with the Pell Grant plus they gave us extra grants just because we were citizens of the state. Overall it was and still is pretty great with my current summer courses.\n\nI just registered for my classes at my new college and it cost $18000 for ONE semester. I was sick, but I have scholarships and the Pell Grant covering most of it, but to think that some people pay that out of pocket or get loans on that for one semester??? Crazy", "author": "prncsx", "created": 1626911217, "upvotes": 2}, "h626rcb": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h626rcb/", "text": "I got a scholarship that covered tuition for 2 years of community college. Recently I was feeling embarrassed about my choice, until I heard my little brother talk about the loans he’s gonna have to take out for his first semester of state university. Now I think, “THANK GOD.”", "author": "attackedbyparakeets", "created": 1626907566, "upvotes": 2}, "h6263d9": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h6263d9/", "text": "It's so stupid how stigmatized community college is. Whenever I've had younger people ask me for college advice, I've told them to start their first two years there because you get better individualized attention compared to a university, it's much cheaper, and you'll have your gen ed creds knocked out.", "author": "SweetTeaBags", "created": 1626907248, "upvotes": 2}, "h61zhr4": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h61zhr4/", "text": "I just graduated from CC (transferring to a four year this fall) and any time anyone did that to me I would just go off on an obnoxious spiel bragging about my high school stats and how many colleges I got into but chose not to go into debt. Shuts them right up lol. I never brag about my high school stats otherwise but if people want to make me feel stupid I will do it right back to them.", "author": "yuxngdogmom", "created": 1626904172, "upvotes": 2}, "h61zc6q": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h61zc6q/", "text": "CC should be everyone’s first step of they aren’t getting a full ride, tbh. That’s what I did and now I’m only (lol at “only”) $25k in the hole after having to do 4 more years at a university", "author": "The_LostandFound", "created": 1626904099, "upvotes": 1}, "h61r08a": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h61r08a/", "text": "🍃", "author": "Small-Button-2308", "created": 1626900431, "upvotes": 1}, "h61qz2a": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h61qz2a/", "text": "My high school teacher was making fun of us because we were going to a 4-year school. He said that he transferred to a university from a CC and didn’t have to bother with SATs. Great guy 😃", "author": "justarandomguy07", "created": 1626900416, "upvotes": 1}, "h61mkfe": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h61mkfe/", "text": "Yup yup yup. I agree with the stigma needing to go away and it's an awesome place to get an education.", "author": "Tiedbison305407", "created": 1626898576, "upvotes": 1}, "h61m9o4": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h61m9o4/", "text": "There was a teacher in the classroom next to mine a few years back. She went to an Ivy League school. She used to tell the kids in our inner city school that only losers went to community college. They’d come to my class all upset because that was their only choice if they went to college. \n\nThey perked up when I’d tell them that I went to a community college for my first two years and Mrs. Ivy League and I had the same job in the same school in the same hallway. \n\nNothing wrong with community college.", "author": "DIGGYRULES", "created": 1626898449, "upvotes": 6}, "h61a6bx": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h61a6bx/", "text": "I’m just getting finished with my 2 years at my community college. I’m still going to have to pay $100,000 for the next two years because I’m middle class and my parents make too much money for me to receive any aid but they don’t make near enough that they can help me pay it. Middle class gets screwed as usual. I should be able to make a decent living when I get out though as my degree is in high demand.", "author": "RW3713", "created": 1626893376, "upvotes": 2}, "h612etw": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h612etw/", "text": "Prof here - I went to community college and I’m incredibly glad I did. My education didn’t suffer at all, and I came out of college with little debt. I recommend this option to pretty much everyone I know because it saves so much money. Save the investment for your last two years, which is where connections will matter much more. Additionally, GE classes are all pretty similar across community college and four year university, so why not save money?  I will never understand the idea that it’s considered a secondary or lesser option. \n\nI have offered classes at both community college and a four year university, and guess what?  Classes are exactly the same. I change nothing between institutions if the class subject is the same.", "author": "apreena", "created": 1626890119, "upvotes": 1}, "h611s5d": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h611s5d/", "text": "Currently going to CC, and I tell all my staff (who are high school kids going into college soon) to go there for pre reqs and general Ed classes and then transfer. They don't listen and are now barely 18 and 20 to 40k in debt. My tuition this semester is a grand for two classes.", "author": "StrayxWolf", "created": 1626889859, "upvotes": 6}, "h60zhvq": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h60zhvq/", "text": "You will be so happy u did this gen Eds are the same everywhere", "author": "Jollygreeninja", "created": 1626888922, "upvotes": 1}, "h60xrlo": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h60xrlo/", "text": "I'm about to go to community college, and yeah my biggest problem was just the absurd amount of fees. I'm very afraid of telling anyone I'm going to CC because I don't want to be ostracized, even though logically it's a sound decision.", "author": "how-sad-for-you", "created": 1626888209, "upvotes": 1}, "h60uaix": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h60uaix/", "text": "Yes! I spent a really long time there and felt really ashamed for a long time because I feel like people thought I was a failure or never going to transfer to uni. But also it was the only way for me to go about things for many reasons but one of them being that it was cheaper, too. CC is always the punch line of jokes too as if to say that its not a \"real\" college or that the education is bad quality but TBH I loved my teachers at CC.\n\nBut yeah fuck 'em, this isn't a race, everyone has the right to their own academic path.", "author": "yoyomomma420", "created": 1626886765, "upvotes": 1}, "h60gc97": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h60gc97/", "text": "I taught at a community college while completing my PhD at M.I.T.  Those students were getting premier level teaching at Walmart prices.  lol.   \n\nI will say the student mix is very different.   20% to 40% rarely show up.  You will have a few 4-year students looking to save money.  You have returning adults.  They are so fun to teach.  Then you have the kids that barely passed high school.   I had a lot of WTF moments teaching at CC.  \n\nI had to dumb down the class a lot.  But in fairness, at my university now I still have to dumb it down.  At M.I.T calculus shows its face on day one in intro classes.  At my university....never. We were specifically told to remove calculus.  At community college, almost no math of any kind.  Economics with no math is not economics.  Such a travesty.  But economics is very difficult.  It pays big at the end, but getting there is hard.  So to increase major count we dumbed it down in the beginning. \n\nThere is a quality difference at CC, however I'm not sure that's a bad thing.  These are general education classes (for the most part).  As long as the instructor pushes critical thinking skills, then that's good.  If you find a spark in one of the classes, awesome. Go play in the big waves and get the details.  If no spark, awesome, you saved money.  To hell with what others think.", "author": "-Economist-", "created": 1626880943, "upvotes": 1}, "h60g1jp": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h60g1jp/", "text": "I WILL NEVER feel bad about it. In fact I'm happy I'm graduating with the same credentials as the next dude and I'm not in debt while I'm getting the same amount of money. It's just much smarter to do.", "author": "DraculasAssCheeks", "created": 1626880817, "upvotes": 1}, "h60d7y4": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h60d7y4/", "text": "Honestly, I don't feel embarrassed at all by telling people I go to a community college. I just completed my AA degree for literally $0. I actually got about 16\\~ grand in refund money my first year of community college, and I also worked and I saved up a huge stash for when I transfer to a four-year university soon. By doing this I slowly started buying things I would need for when I moved out (computer, laptop, iPad, desks, chairs, etc.) and have everything I need. \n\nBecause I saved so much money my first year going to community college, I have a stash for the next few years and don't have to work so hard. (I was pulling 60+ hours a week at Walmart, it was hell.) I think I will graduate with probably under 5 grand in student loans (I am predicting I will need a loan my last semester in college cause that's when my scholarships end.) But even that is manageable. So yeah, by doing this I probably saved myself from having tens of thousands of dollars of debt.", "author": "lyndse_y", "created": 1626879602, "upvotes": 17}, "h60c69f": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h60c69f/", "text": "I went to community college, and now I have no debt while most of my classmates have $20k+ in debt.  It was definitely a sacrifice, but I’m happy I went now that I’m in grad school and can graduate without student loans.", "author": "anonymoususer609", "created": 1626879152, "upvotes": 1}, "h6049d9": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h6049d9/", "text": "Attending Community COLLEGE is such a wise investment! And let me tell you as someone who worked at a top25, if it were not for the community college a LOT of students wouldn’t have been able to graduate from their 4 year institution after they were academically dropped and told to take classes elsewhere in order to return. There shouldn’t be any stigma but if there is, it should be flipped. Like millions of people are willing setting themselves up for hundreds of thousands of dollars in debt for bragging rights? You’re not going to get paid more because of where you graduated generally speaking and I would argue that’s when that is the case, it’s because of the advanced degree they received not their undergrad degree. At the end of the day if a student transfers to a 4 year institution they’ll have two degrees, less debt, and a whole lot less stress. What is wrong with that?! It’s up to this generation to push back on this stigma the same way y’all are doing around mental health and saying no to the status quo when it comes to gun reform and the climate. #TeamGenZ #ImCheeringForYou", "author": "ColBoundDTermination", "created": 1626875596, "upvotes": 21}, "h5ztctw": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5ztctw/", "text": "I’m from a us state where you get your 2 years of cc free if you go right out of high school so it’s actually weirder now if you didn’t go. A lot of states in the us have similar programs, so I’ve found the tide shifting to show cc in a better light recently. And it’s not like I learned any less there and a couple of my profs had Ivy League degrees, so it just goes to show that saving money is almost always the better option.", "author": "thegayace6", "created": 1626869807, "upvotes": 2}, "h5zn9l5": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5zn9l5/", "text": "I haven’t had this issue, thank god, but people are going to have opinions. For me, I’m at a community college because I decided to go to one and I didn’t know where I wanted to go. Also, I screwed myself in school up through high school by not doing all of my work, so by the time I graduated high school, I had a pretty low gpa (around a 1.8-2.0). \n\nI’m  not trying to sound brag against those not at a community college, but going to a community college ended up being a good choice because:\n\n1. I got my gpa up to a 3.0\n2. I’m only doing my basics and don’t need loans, scholarships, or grants and don’t have a student debt (yet)", "author": "Best_Bisexual", "created": 1626865656, "upvotes": 12}, "h5zaxgp": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5zaxgp/", "text": "Community college is the better way anyways… Pay your way through your g.e’s and be proud of it! Plus most people at community are WAY more interactive and friendly than anyone I’ve met at uni so far", "author": "HardcoretotheGrave", "created": 1626854934, "upvotes": 4}, "h5zaci3": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5zaci3/", "text": "At my high school, the counselors would use “ending up at community college” as a scare tactic to get us to score high on tests. Like, can they not? I go to community college now and it’s one of the best decisions I’ve made in my life", "author": "Songibal", "created": 1626854531, "upvotes": 20}, "h5z8b8p": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5z8b8p/", "text": "Where I am from, it is quite the opposite. You would be considered an idiot for not competing your first two years at a CC. Your degree will list where you graduated from. That is all that matters. Most of us went to Berkeley and you bet we did our first two years at the CC. Like I said, we aren’t stupid!", "author": "messyarts", "created": 1626853456, "upvotes": -2}, "h5z8acj": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5z8acj/", "text": "Where I am from, it is quite the opposite. You would be considered an idiot for not competing your first two years at a CC. Your degree will list where you graduated from. That is all that matters. Most of us went to Berkeley and you bet we did our first two years at the CC. Like I said, we aren’t stupid!", "author": "messyarts", "created": 1626853444, "upvotes": 0}, "h5z89mr": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5z89mr/", "text": "Where I am from, it is quite the opposite. You would be considered an idiot for not competing your first two years at a CC. Your degree will list where you graduated from. That is all that matters. Most of us went to Berkeley and you bet we did our first two years at the CC. Like I said, we aren’t stupid!", "author": "messyarts", "created": 1626853435, "upvotes": 1}, "h5z24iz": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5z24iz/", "text": "Nope. I don't give a shit what others think.", "author": "orangeblackteal", "created": 1626849995, "upvotes": 1}, "h5yzebb": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5yzebb/", "text": "Big time. Because of the stigma behind community college, I spent the last 7 years at three different ones because I allowed the negative comments get to me. Finally graduated from the last one this year and will be attending a pretty good school. All I had to do was stick to my guns and ignore people. Really wish I had done that all along. The amount of money saved is great", "author": "Prof_PolyLang187", "created": 1626847801, "upvotes": 31}, "h5yy792": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5yy792/", "text": "A few months before I graduated high school, my \"close\" friend asked what school I will be attending and I named a community college. She replied, \"Oh so you're not going to a real school...\" Bruh. She already knew that I have to pay for my tuition.", "author": "caPricIous3", "created": 1626846894, "upvotes": 12}, "h5yxok1": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5yxok1/", "text": "Honestly, I wish there was less of a stigma attached to it. I wish I had gone to a community college after high school instead of just having gone to a 4-year straight away.", "author": "glorialavina", "created": 1626846511, "upvotes": 15}, "h5yw501": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5yw501/", "text": "I've attended top universities and community colleges. The best world outlooks come from community colleges.", "author": "fractaldesigner", "created": 1626845431, "upvotes": 5}, "h5yumij": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5yumij/", "text": "Their opinions cease to matter once you are either in university or you enter the professional realm, which will likely be sooner than you think. Personally, I laughed all the way to the bank graduating from college with no debt, which is 100% worth it over impressing some people I've already long forgotten. Choosing community college probably ranks somewhere in the top 3 best decisions I've made in my life.", "author": "Eighth_Octavarium", "created": 1626844400, "upvotes": 8}, "h5yufl5": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5yufl5/", "text": "My ex did his first two years at community college, then transferred over to the university in the same city to finish his BA. Said he had a few of the same professors at both schools. You’re really just paying for the “experience” which, as someone who went to university right out of high school, really isn’t worth it anyway. If I could go back and do it all again, I’d have just started off at community college instead.", "author": null, "created": 1626844271, "upvotes": 17}, "h5yt3wi": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5yt3wi/", "text": "Yes, I hear ya on this one.  I am still in way too much debt from my AS degrees and my first year at Penn State, but I know that I still saved a SHITLOAD of money.  And, since I did so well at my first year of Penn State, I was able to get enough scholarships to cover my entire tuition for my second year here.\n\nThere is no way I would have been able to keep a 4.0 if I had started at Penn State right out tha gate.  Going to CC first felt like so much less pressure, and like I was able to acquire the skills I needed to be a successful student, and they had so many resources to push students to do well.\n\nAs a side note, in my experience (I got an AS in biology and AS in chemistry simultaneously), I don't think classes at my four-year are any harder..  In fact, it is  common that professors who teach at my CC also teach the exact same course in the exact same way at a local university (I am looking at you, calculus based physics classes that made me want to die).", "author": "ThereIsNo14thStreet", "created": 1626843404, "upvotes": 83}, "h5ysf7c": {"link": "/r/CollegeRant/comments/ooiq9q/people_who_go_to_community_college/h5ysf7c/", "text": "People always have an opinion no matter what. What's important is that you know how to be responsible for your own life. Even though I've received many disappointing comments about choosing community college, I can say it was the best decision of my life. Good luck!", "author": "PBSArthurEnthusiast", "created": 1626842970, "upvotes": 63}}}