{
  "sid": "pj42sd",
  "link": "/r/CollegeRant/comments/pj42sd/i_feel_so_awkward_and_lonely_at_college/",
  "title:": "I feel so awkward and lonely at college",
  "text": "It's like I'm living in 7th grade again, when I moved schools and sat alone and didn't recognize a single person. Not ONE friend went to the same college as me, and I don't know anybody in this city. I had no issues making friends in the past but here it seems like everybody knows somebody already and doesn't need a new friend.\n\nTruthfully, I don't really... care?, for my roommates. I don't hate them, but they're very... not... my type. They're just not, I don't know how to put it. Obnoxious, rude, except for the one who's sweet but doesn't really like me, I think. I was hoping they could be my friends, but. Yeah. It's hard enough trying to make friends as a socially awkward queer girl without moving to a whole new city.\n\nI'm going to enroll in some clubs, I got a job on campus, and I already joined the school's Discord for socializing. That should help a little I hope. I want to find my group of friends that fits me in like a puzzle piece like I did with my high school friends.",
  "author": "oreodippedincoffee",
  "created": 1630949376,
  "over_18": false,
  "upvotes": 30,
  "upvote_ratio": 0.91,
  "comments": {
    "hbw4kpp": {
      "link": "/r/CollegeRant/comments/pj42sd/i_feel_so_awkward_and_lonely_at_college/hbw4kpp/",
      "text": "Wish you well! You’ll get there I know how you feel but you’ll be glad you’ll find those that understand and appreciate you!",
      "author": "waullyy",
      "created": 1630987168,
      "upvotes": 2,
      "replies": {}
    },
    "hbv6hfz": {
      "link": "/r/CollegeRant/comments/pj42sd/i_feel_so_awkward_and_lonely_at_college/hbv6hfz/",
      "text": "Try making or starting groupme for your classes. Not only is it useful for class, but a good way to meet people too",
      "author": "Hydra680",
      "created": 1630969848,
      "upvotes": 2,
      "replies": {}
    },
    "hbusobj": {
      "link": "/r/CollegeRant/comments/pj42sd/i_feel_so_awkward_and_lonely_at_college/hbusobj/",
      "text": "I feel the exact same way. I’m about to enter my last year and have made a total of 1 friend this I got here. It really sucks, makes me feel completely different from everyone else around me. Know you’re not alone.",
      "author": "taqpolo",
      "created": 1630963268,
      "upvotes": 2,
      "replies": {}
    },
    "hbuogj7": {
      "link": "/r/CollegeRant/comments/pj42sd/i_feel_so_awkward_and_lonely_at_college/hbuogj7/",
      "text": "All you gotta do is fine your niche and you will get a group. I arrived to college with no one from high school and I just kept chatting with people. Theres always new people to meet every day",
      "author": "GoldRequest",
      "created": 1630961361,
      "upvotes": 5,
      "replies": {}
    }
  },
  "updated": 1634062374
}