{
  "sid": "q8mwmm",
  "link": "/r/CollegeRant/comments/q8mwmm/i_just_need_to_vent/",
  "title:": "I Just Need to Vent :)",
  "text": "Hello all,  \n(Be prepared for a whole entire NOVEL)  \n\n\nI hope people can relate to this message. I really wanted to talk to someone but I don't necessarily have friends and not to sound like a brooding teenager but my parents wouldn't understand.   \nI graduate from high school back in May and enroll in fall for college. I only did it to make my parents happy. I was just going to finish the semester get an associates and try to figure everything out later on in life. Whether I wanted to continue with college to get a bachelors or whatever. I was planning on getting an associates in science because I did well in high school.  \n\n\nWho knew that would be the biggest lie I ever told.  \n\n\nI recognize the material in high school. I remembered doing it. I remember being pretty good at it. So why am I struggling so hard?   \n\n\nIn high school I would OBSESS over my GPA, my grades, etc and it's funny because I was never in any honors classes.   \n\n\nAnd now. I'm having trouble getting out of bed. Having trouble with the material because I can't quite get focus on anything TO care. I'm in this vicious cycle and I can't quite right myself to save myself.  \n\n\nI took an exam and now I'm stressing because I KNOW I failed it. I need that class to be a passing grade so I can not worry when Winter Break rolls around. But it was my fault. It's my fault.  \n\n\nIf I fail this semester I won't get a scholarship that is going to pay for my classes. So this is REALLY my fault and I have nobody else but myself to blame.  \n\n\nI can't quit college and I can't take a break from college. My parents are very old fashion. Get a good job, get good grades, no tattoos, Mental health? There's no such thing in my household.   \n\n\nMy dad is the type of person who support you and then behind your back say that they're disappointed. I heard it when my brother dropped being a nurse.   \n\n\nAnd don't get me wrong. I love my parents, well my mom anyways. She's always been there for me when I need her and the thought of disappointing her by either failing a class(es) or not going into school would devastate me.   \n\n\nI tried telling my mother I was depressed. Telling her it was harder for me to get out of bed and that it was getting to the point where I was contemplating on attempting... It's the most I've ever opened up to her like that. It was the most vulnerable I have ever been in my life.  \n\n\nShe became cold with me. And I had to back track and say that it was just stress talking and I would never do it.   \n\n\nAnd if you're gonna start tracking me, I won't Reddit users. I still have to see what happens in AOT and see the TLOU on HBO :)  \n\n\nI understand why she became a little distant. I did spring something on her that is very sad and no one wants to hear their child say that. She's more understanding than my father but there is a little bit of stigma when it comes to mental health with her. She understands it she emphasize with others on it. But she doesn't believe her kids or herself can have it/experience it.  \n\n\nI'm just not in the greatest of head spaces. Its this weirdness of being stressed but then not doing anything. Can anyone relate to that or am I just that bad of a human being/student.  \n\n\nMy brother made college look easy and I always strive to be like him. I went to be a nurse in HS and then I quit like 8 months after because I wasn't enjoying it. I'm constantly wanting to do better in the eyes of my family, to my brother, mother, etc.  \n\n\n I've been afraid of my own shadow for my whole life because I hate who that person is who constantly follows me around.   \n\n\nI guess what I'm trying to get across in this convoluted message is that I have no clue what I am doing. It feels like I'm having a mid-life crisis, existential crisis, an identity crisis.  \n\n\n You name a crisis I probably am having that right now. As we speak.  \n\n\nI've experience more crisis than a romantic encounter.   \n\n\nSo. I come to you guys. Strangers on the internet who I feel comfortable with to tell me what I should do.   \n\n\nWhat did you guys do? What are you doing currently? How happy are you doing with your life? How does the parents think of this? What type of jobs are looking into. Trade schools. Advice for me? Did you ever failed any classes? Did you have a scholarship and you lost it?   \n\n\nI'm an 19 year old who needs some support and advice. :)   \n\n\nI really appreciate anything you can give me. I just need some guidance and advice. From someone who isn't a parent or a brother.  \n\n\nI'll end up deleting this later. I'm afraid that someone I know or my college will see this. I'm paranoid about stuff like this but I desperately need to get this out because it feels like I am drowning.  \n\n\nThank you :)",
  "author": "Sebzpa",
  "created": 1634299080,
  "updated": 1634332055,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgqdosa": {
      "link": "/r/CollegeRant/comments/q8mwmm/i_just_need_to_vent/hgqdosa/",
      "text": "Hi there. I'm really sorry to hear that you do not have a support system at home. That must be very difficult. \n\nI have been in a place similar to yours. I struggled with a myriad of mental illnesses and was in and out of the psychiatric hospital. I ended up dropping out of school, going on disability and working a few different part-time jobs. After 5 years and when I was feeling better mentally, I went back to school and graduated with a diploma (a 2 year thing in Canada, similar to an associates). I'm now in university pursuing my Bachelors at the age of 29. \n\nWhat I'm trying to say is, not everyone's path is linear. I understand you do not want to disappoint your parents, but that should not be your top priority. What do YOU want? \n\nIf you're determined to stay in school, please find a therapist if you can. Your school should have resources. Also, looking for academic accommodations (like extensions on deadlines, more test time, etc) would be beneficial. Go to your professor's office hours, make use of writing centers if there are any at your school, use all the resources you can to succeed.\n\nWhatever you decide, I wish you all the best. If you ever need someone to chat with, please feel free to message me.",
      "author": "melmcgee",
      "created": 1634302033,
      "upvotes": 1,
      "replies": {}
    },
    "hgqgued": {
      "link": "/r/CollegeRant/comments/q8mwmm/i_just_need_to_vent/hgqgued/",
      "text": "same situation here my dude, except I went straight for the bachelor's 🙃 I hope you find a way to make things more tolerable for you and find the path you want to follow",
      "author": "All_The_Issues02",
      "created": 1634303646,
      "upvotes": 1,
      "replies": {}
    }
  }
}