{"sid": "p2hqfz", "link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/", "title:": "Giving the wrong answer to the professor in front of everyone sucks", "text": "This happens so often to me and it’s freaking ass cheeks. I know it’s easier to specifically ask someone a question in a zoom room than to ask the general audience and wait like a whole 2 min for an answer but I get so anxious about them and choke. I would say I get even more anxious about being randomly called on in class than the exams! It’s like a mini heart attack every MTW. Also, it’s not like I don’t understand the material either, I’ve been acing each exam. Each time I’m called on though and give the wrong answer I feel so damn embarrassed I just wanna sink into the depths of my chair. Today was the last lecture for the summer course though, so I’m glad that part is over. That is until next week when the fall starts ;\\_; (Im still all online in the fall just to be safe though, so I’m expecting something like this will happen again)", "author": "Mrmatchaboba", "created": 1628702786, "retrieved": 1632950383, "over_18": false, "upvotes": 182, "upvote_ratio": 0.99, "comments": {"h8o0qqz": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8o0qqz/", "text": "If the professor is waiting for an answer and no one is biting, I'll shout anything that sounds plausible out to keep the class moving. If I'm right, great - class can proceed. If I'm wrong, the professor will explain the right answer and we can move on. Don't worry about embarrassment because wrong answers lead to learning", "author": "NeatMemory", "created": 1628783173, "upvotes": 3}, "h8mfw8r": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8mfw8r/", "text": "I have no shame in it anymore. Im paying for this education, so if I dont understand something im definately going to ask the clarify. Who cares what everyone thinks and most likely, some people had the same answer you had, they just didnt say anything.", "author": "jarek168168", "created": 1628747543, "upvotes": 3}, "h8mekq3": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8mekq3/", "text": "It really depends on the professor. I’d say many professors would like to have an active/engaged audience that doesn’t make them feel like they’re talking to a wall, not so much to make people feel bad. Plus, being wrong isn’t really something to be embarrassed about. I bet everyone else didn’t know the answer either so why care? 💁🏻‍♂️", "author": "orgasmicstrawberry", "created": 1628746601, "upvotes": 3}, "h8lnj1i": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8lnj1i/", "text": "I would have to disagree, if I give the wrong answer and get called out I just turn it into a learning opportunity. I end up remembering better that way, and it makes me feel good for being an active learner. That being said, it definitely depends on the Professor, because some of them get their jollies by being the “smartest” person in the room.", "author": "_fuckyodreams", "created": 1628727130, "upvotes": 4}, "h8lk88j": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8lk88j/", "text": "What helped me is the fact that usually, if I get something wrong I won't be seeing these people again in a handful of months or enough time will pass that they'll forget. It sucks at the moment but at least from my perspective if someone gets it wrong I don't hold them against it, alongside that, I can't really remember myself of someone getting something *so wrong* that I remember it to this day.\n\nQuite honestly, I have to really dig in my memories to remember any of my Zoom courses and/or past college classes, even the ones that are actually important. College kinda's just a blur of one semester to another with maybe like 2 to 3 people I recognise that are in the same degree but I personally don't really know.", "author": "SirWangtheWizard", "created": 1628725584, "upvotes": 3}, "h8ljltl": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8ljltl/", "text": "What’s the class? Maybe you could say you dont know, or arent sure, if you arent", "author": "EmptyLevel", "created": 1628725293, "upvotes": 2}, "h8lh4k7": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8lh4k7/", "text": "If you hate it or collapse under pressure, just say so. If I ask a student and they say they don’t know or they are choking under pressure I’ll bail you out.  \n\nAlso, if you answer wrong, it’s okay.  Although I understand your position. When I was an under grad I had a professor call me stupid when I answered wrong. Pissed me off.", "author": "-Economist-", "created": 1628724139, "upvotes": 8}, "h8lgegv": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8lgegv/", "text": "Zoom class has its pros and cons and I think the way it allows questions to be asked is a big pro", "author": "More_Coffees", "created": 1628723808, "upvotes": 2}, "h8kojz5": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8kojz5/", "text": "One of the biggest life lessons to learn is that you can’t be afraid of being wrong or letting being wrong in a public space get to you. We are all wrong at times, and it’s a huge mark of maturity to be wrong publicly and then be able to say “oh, my bad!” and move on without letting it bother you that you were wrong.", "author": "PhDapper", "created": 1628711913, "upvotes": 28}, "h8kkpte": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8kkpte/", "text": "Practice makes perfect. Just do it as much as possible and remind yourself that you can withstand the embarrassment and the anxiousness. It gets better with time.", "author": "10dollaressay", "created": 1628710326, "upvotes": 9}, "h8k8qqn": {"link": "/r/CollegeRant/comments/p2hqfz/giving_the_wrong_answer_to_the_professor_in_front/h8k8qqn/", "text": "i hate this too :(  i understand why professors want to just call on someone but it drives me nuts when others actively show they know the answer (ie. raising their hand in class or on zoom) and the professor still calls on someone who doesn’t have their hand raised. i understand they want active participation but that is really not the way to get it — especially if they create an environment where mistakes aren’t “welcome”. some profs are very cool about you giving the wrong answer and not making you feel bad for it but there are some that just don’t give a damn.", "author": "analieserae", "created": 1628705452, "upvotes": 58}}}