{
  "sid": "q5pb09",
  "link": "/r/CollegeRant/comments/q5pb09/failing_classes_vent/",
  "title:": "failing classes. vent",
  "text": "Rn I have three F’s, a B and a D <3\nI am feeling so amazing :D\n\nI seriously have zero motivation. \nI literally do my homework in a dark corner on the floor cuz I dont have a room. And my dumbass dad is always in the living room so no way in hell I am going there. \nAnd I cant drive anywhere or go anywhere \n\nyall how tf do I rewire my brain so that im not so severely sad",
  "author": "stupiddumbgirlsad",
  "created": 1633931366,
  "updated": 1634093795,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.79,
  "comments": {
    "hg8lygc": {
      "link": "/r/CollegeRant/comments/q5pb09/failing_classes_vent/hg8lygc/",
      "text": "5 classes? Is the load too much?",
      "author": "matsudasociety",
      "created": 1633966442,
      "upvotes": 3,
      "replies": {}
    },
    "hg855r6": {
      "link": "/r/CollegeRant/comments/q5pb09/failing_classes_vent/hg855r6/",
      "text": "Everyone one is unique. Just focus on your mental health, and I guarantee that grades will reflect that. Motivation is outdated, at least in my case, i use discipline lol",
      "author": "LoreBloop",
      "created": 1633958792,
      "upvotes": 2,
      "replies": {}
    },
    "hg8meag": {
      "link": "/r/CollegeRant/comments/q5pb09/failing_classes_vent/hg8meag/",
      "text": "I learned that when I lived with my family, even though my room was my safe space, it wasn’t a good studying space for me. I lived close to a library and a starbucks and would do my homework there whenever possible. I would stay out pretty late at my school whenever I had class because studying at home was not working for me. I also would get the chance to grab a bite with friends which helped me feel more balanced.\n\nIt helped me change my habits. It kept me active because I would need to get out of the house and walk around and it helped me focus on my effort to study. I also decided to take significantly less classes (3 instead of 5) because I just felt overwhelmed with 5 and needed to give myself the best chance at success by starting smaller and working my way back up to 4.\n\nStart with reframing how you approach things and second, get consistent. Then it’ll just become a habit",
      "author": "shoelaceys7373",
      "created": 1633966624,
      "upvotes": 2,
      "replies": {}
    }
  }
}