{
  "sid": "q946ty",
  "link": "/r/CollegeRant/comments/q946ty/were_behind_we_need_to_step_it_up_everyone_else/",
  "title:": "“We’re behind. We need to step it up. Everyone else is ahead”",
  "text": "Says my groupmate at the end of every meeting for our project. It annoys me, but I think he’s just the type of person to tell it like it is and also be a pessimist at the same time.\n\nFirst of all, we’re students. We don’t know what we’re doing. The other groups are just as clueless as we are. And there is no tardy or late. There is only the work we have.\n\nBut I’m not confrontational like that, so I say nothing, but I instinctively roll my eyes at those comments. That shit helps no one. Not to mention that I was doing shit during the meeting. Stuff that would actually be useful for the report and presentation. We were all doing things for our progress, WHY DOES HE MAKE IT SOUND LIKE WE DIDNT DO SHIT?!\n\nWe have one group member that is slacking off, though. Didn’t even call during the meeting or anything. Our group leader says he’ll talk to him, and suggests we help this groupmate however we can cause he’s usually clueless. I told the group today that I don’t really want to teach this groupmate. We all got in this class. We should all be equally capable of getting our work done. If his ass needs help he can use google, that’s what we do when we’re lost.\n\nWhen we took this class last semester we were at about the same place we are now. So I don’t know why he acts like we’re crunching for time. I don’t like being rushed like this. I hate this level of pessimism.\n\nAlso, as an extra rant, we had a lab last week, it was simple enough. So simple actually, that there were no instructions. Just a PowerPoint with formulas. The report was due today and we were unsure if each student had to turn in a report or if one report had to be turned in for the whole group. I assume one for the whole group, because that’s the only thing I can assume since one groupmate sent the report to all of us in the group with all of our names on the report. So I read through it, and turned it in on my own behalf, but now I’m wondering if that was what I’m supposed to do? Was I supposed to write my own report?? ID ONT KNOW!! AND WHY?! THIS LAB WAS LIKE 30 MINS!!! And now my ass can’t write it anyway cause the university website is down!\n\nThis whole semester has been a goddamn shit show so far.",
  "author": "Scarcity-Any",
  "created": 1634355841,
  "updated": 1634423951,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hgu8l13": {
      "link": "/r/CollegeRant/comments/q946ty/were_behind_we_need_to_step_it_up_everyone_else/hgu8l13/",
      "text": "You are only in control of your effort, not the outcome\n If you could have given more regardless of your group mates then you failed. If you gave all that you could and still failed you aren't the failure your team is. If you could of done mid I and didn't you are the failure.",
      "author": "ThristyMonkey",
      "created": 1634372893,
      "upvotes": 1,
      "replies": {}
    }
  }
}