{"sid": "pm8hkl", "link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/", "title:": "Anyone feel guilty doing anything that isn’t school stuff?", "text": "Probs due to anxiety but I’ve had some pretty heavy week with lots of assignments and I still have a  big one left to do. I haven’t gone out much but I’m hoping to go out tomorrow but I feel guilty. I told myself I start my big assignment today after work but I still have this overwhelming sensation. There are times I don’t even feel comfortable eating or doing basic human things because I feel I should be working on school crap. Anyone have this problem?", "author": "Inevitable-Tomato-81", "created": 1631370786, "retrieved": 1632950262, "over_18": false, "upvotes": 260, "upvote_ratio": 1.0, "comments": {"hckbm36": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hckbm36/", "text": "Yes.\n\nThis is extremely common. People who are smart, successful, creative, etc. all have this problem at some point.\n\nAsk yourself, \"Do I want to succeed and/or do the best I can?\" I assume the answer is yes. Then fundamentally hammer this into your brain that you CANNOT do that unless you take care of yourself first. Thus means food, sleep, and play are NECESSARY to your performance, not a distraction. You will do better on a project by leaving it, having a fun night, getting sleep, and returning to it the next morning than pulling an all-nighter to try to finish it.\n\nIn grad school it was not uncommon for me to be in lab at 1 AM. Now I'm in industry and my lab requires me to leave at the end of the day and no work on the weekends. I'm getting more sleep and performing better than I did as a burnt out grad student.", "author": "hdorsettcase", "created": 1631455712, "upvotes": 1}, "hcjgucf": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hcjgucf/", "text": "Absolutely, school consumes me to the point where I usually don't ever actually get enough sleep. It's not just my school commitment, but also the pressure from my family to do well and get a good job. I usually end up not going out with friends, eating minimally, and usually when I do eat it's junk food or instant meals. Even when I socialize I often end up not actually being part of the group since I'm usually stuck doing work or my heads in the clouds with work. If I put on videos or games while I'm working I usually shut them off after a few seconds or they just end up being background noise to help me work.", "author": "mightbe1nsane", "created": 1631434940, "upvotes": 1}, "hciz66q": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hciz66q/", "text": "Yes, and I’m the professor.", "author": "apreena", "created": 1631422151, "upvotes": 2}, "hci60sg": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hci60sg/", "text": "I take my education and grades seriously, but at the same time, I work to live, not live to work. If I’m caught up on assignments and feel like I’m understanding things well, then I give myself a break.", "author": "115machine", "created": 1631407807, "upvotes": 2}, "hci3hu1": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hci3hu1/", "text": "10000% and same thing goes with work too. I feel lazy as hell on weekends when I catch myself relaxing a little bit too much. But then I have to remind myself I had 12 hour days all of last week, going to work full-time and then night class. It helps me relax a little more and loosen up knowing I put in a hell of a week and one night isn’t going to kill be but I still feel so guilty. I think it’s just our minds getting so used to being busy that we feel weird when we’re not.", "author": "NRevenge", "created": 1631406574, "upvotes": 1}, "hci3cwx": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hci3cwx/", "text": "This is how I lost my love for reading. I felt guilty for reading for pleasure. I felt like if I was spending time reading I should be spending time reading for class or working on assignments. I stopped reading for pleasure. I'm trying to get back on the horse and get that love for reading back, but it's been really hard. College stole a lot from me.", "author": "DanglingDiceBag", "created": 1631406508, "upvotes": 6}, "hchx7fp": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hchx7fp/", "text": "Yup. Just constantly dreading deadlines and due dates, and for the life of me I can't get myself to relax. Don't get me wrong, I'm still procrastinating, but I've also got the added stress of constantly thinking about when assignments or due or why I'm not doing a particular assignment at this very moment. \n\nWish there was a switch I could flip that would just let me turn off school related thoughts for a while.", "author": "Sadict", "created": 1631403564, "upvotes": 2}, "hchvmn4": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hchvmn4/", "text": "(For context I’m the equivalent of a junior, but I’ve taken time off and am now in my mid twenties. No shame.)\n\nNope. I used to, real bad, and it ended with severe mental health issues and mono that turned into pneumonia because my whole body was weakened from the stress I was putting myself under. (This was years ago, pre-COVID) I actually dropped out of my first attempt at college because my head wasn’t on straight, and I swore to myself that when I came back to finish what I started, I would do it differently. \n\nWell, I took a couple of years to get my health and my life in order, I transferred to a different institution that was a better fit for me, and now I take time for balance and don’t feel guilty in the slightest. I cook meals from scratch and spend entire days baking or cleaning my apartment even when I have deadlines. I do my hobbies, because they bring me joy and give me something to look forward to. I listen to my body and give it rest when it needs it, because I have completely burnt out before and never want to be there again. I am more than just a student, and I need to manage my stress and do the things I love if I want to be the best student I can be. That’s a perspective I didn’t have when I was young and just setting out, but now that I’m older, I know this is the better way to be.", "author": "HeyImNyx", "created": 1631402844, "upvotes": 3}, "hchop74": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hchop74/", "text": "Yup. Can't play games or watch tv without feeling bad. Then proceed to stare at the ceiling for hours instead of starting/finishing assignments.", "author": "rw105", "created": 1631399781, "upvotes": 2}, "hch1mu6": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hch1mu6/", "text": "I create a weekly appointment with myself to do non-school related things. It’s usually about 2 hours, but whatever works for you is what’s best. During that appointment I’ll go for a hike, have coffee with a friend, relax and watch a movie, etc.  It’s not a lot of time in the grand scheme of things, but it makes a world of difference to my mental health.", "author": "tiny_sweaters", "created": 1631390165, "upvotes": 6}, "hcgsa51": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hcgsa51/", "text": "I can’t relate—you only have a finite amount of schoolwork, just get your prioritization down and you’re free to do whatever you want.", "author": "noopstilton", "created": 1631386151, "upvotes": 3}, "hcgkrni": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hcgkrni/", "text": "I feel this. It's like any time I'm not being productive I feel guilty that I should be doing schoolwork---even if I've already done several hours of work that day.", "author": "ichorren", "created": 1631382949, "upvotes": 3}, "hcghnq8": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hcghnq8/", "text": "I can't relate to this anymore. I used to feel guilty in freshman - sophomore year but now my concern is at the point of no return. Life is about having fun and having life lasting experiences not stressing over temporary assignments.\n\nSchool is important but it shouldn't make you feel guilty for doing things the you want like hobbies or things you need such as taking a break or eating. I think you should remember YOU are in full control over what you do, not school. Although it's a priority please just prioritize your health over anything.", "author": "genericusername_____", "created": 1631381620, "upvotes": 41}, "hcggf7n": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hcggf7n/", "text": "Yes.\n\nI haven't played more than 2 hours of games in three weeks. Tomorrow is my 8th wedding anniversary and I'm wondering if I should go out or take the time to study for my Japanese quiz tomorrow night.", "author": "eirilyn", "created": 1631381095, "upvotes": 6}, "hcg5yaa": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hcg5yaa/", "text": "Yes when I was in college, I felt this way all the time. Especially during finals or midterms or when I had a lot of work but needed a break. I think it's important to remember that breaks are important so that you can do your best when you are doing work.", "author": "Kouglove", "created": 1631376543, "upvotes": 5}, "hcg4fse": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hcg4fse/", "text": "Yes to the point i stopped eating and going outside. School literally consumes me and i don’t know how to create boundaries with it. I have adhd too so I talked to my doctor and she told me that i need to remember that taking breaks to sleep, eat, go outside, etc., will all help me focus on school better and do better work, and make alarms for these breaks. It’s hard to remember but it somewhat helped with the guilt i feel when i do anything but school 😅", "author": "sabicus", "created": 1631375888, "upvotes": 22}, "hcg3oop": {"link": "/r/CollegeRant/comments/pm8hkl/anyone_feel_guilty_doing_anything_that_isnt/hcg3oop/", "text": "All the time. It feels like any time that isn't 100% dedicated to either school or physically sustaining your body is a waste of time. I only have 1 more semester after this one, but I'm really burning out.", "author": "WashiBurr", "created": 1631375567, "upvotes": 47}}}