{
  "sid": "q49itq",
  "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/",
  "title:": "I hate weekends",
  "text": "In high school, weekends were the best because they were a two day break from school. Now, half my assignments are due Saturday at 11:59 so it's not a break from school. And I live on campus so there's not any leaving school. The only difference between weekends and weekdays is that on weekends I have no social life and it depresses me. I don't have a car so I can't go out and do anything. I don't have any classes to go to. Everything on campus(gym, library, dining halls, etc) are open shorter hours so I don't go as much. All I have to do on weekends is sit in my dorm doing nothing and I hate it. I've only made like 1 1/2 friends in college, and they both live off campus so I can't hang out with them because, again, no car. I have friends two hours away I could visit, but no car. I'm not friends with any of my roommates so I don't really talk to them, and half the time I go the entire weekend without saying a word to anyone. I hate college in general for a lot of reasons, but weekends are the fucking worst.\n\n&#x200B;\n\nTLDR: weekends suck bc there's still homework and i have no social life ",
  "author": "silvermoon_182",
  "created": 1633735816,
  "updated": 1634093809,
  "over_18": false,
  "upvotes": 137,
  "upvote_ratio": 0.97,
  "comments": {
    "hfx3ffn": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfx3ffn/",
      "text": "I had a professor who refused to make any paper due during/after a break or weekend. He told us how one of his professors made a huge paper due the day after his thanksgiving break and he vowed after that do never do it\n\nHis assignments are due either before break or on a Thursday",
      "author": "drspooky24",
      "created": 1633737186,
      "upvotes": 66,
      "replies": {
        "hfx73a5": {
          "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfx73a5/",
          "text": "Dang that sounds so nice. I don’t know why but two of my professors make assignments and tests due Saturday at midnight a lot, it’s just annoying. And we have our like one day off for fall break next week and I have an assignment due that Sunday for some reason",
          "author": "silvermoon_182",
          "created": 1633739016,
          "upvotes": 19,
          "replies": {
            "hfxh4qc": {
              "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfxh4qc/",
              "text": "Not trying to be a dick, but can't you just do the assignments early so that you'll have your weekends free? Or do the professors wait until Saturday to make them available, too?",
              "author": "Franklytacos",
              "created": 1633743940,
              "upvotes": 18,
              "replies": {
                "hfxj0xb": {
                  "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfxj0xb/",
                  "text": "Yeah I know, I do try I just have a bad problem with procrastination lol. I am occasionally forced into it tho bc it’ll be a test that only opened for two days, for example I was busy today trying to get stuff for a job set up and an essay done so now tomorrow I have to take a compsci test bc it’s only open two days",
                  "author": "silvermoon_182",
                  "created": 1633744874,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfxk5nh": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfxk5nh/",
      "text": ">there's not any leaving school\n\nDef part of why I stopped living in a dorm after freshman year. Even if I'm doing homework in my apartment during my work breaks I don't feel like I'm at school. When I leave campus my mind gets a mental break. \n\nUnderstand everything else too. Whoever says high school and college are the best years of your life... yikes",
      "author": "llamaintheroom",
      "created": 1633745427,
      "upvotes": 19,
      "replies": {}
    },
    "hfxfuq1": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfxfuq1/",
      "text": "Completely feel you on this. Never hated weekends until college",
      "author": "sophwhit",
      "created": 1633743294,
      "upvotes": 7,
      "replies": {
        "hfy97wl": {
          "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfy97wl/",
          "text": "Also hating it right now, not just because of requirements, but also because we have classes. Thankfully, it's only for one year.",
          "author": "2Legit2Quiz",
          "created": 1633759710,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfxxljh": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfxxljh/",
      "text": "I felt that. I’m a mom so weekends don’t mean shit anyways but as a college student it means trying to scramble to get my work done when my 2 year old is napping or is asleep. I’m tired asf.",
      "author": "mxsxc",
      "created": 1633752345,
      "upvotes": 7,
      "replies": {}
    },
    "hfxr3as": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfxr3as/",
      "text": "i can definitely relate to all of this. i cant remember the last time my weekends got to be weekends. i work on stuff every day of the week and it doesnt help that some classes make stuff due on friday, saturday or sunday. i also have no car so im stuck on campus all the time and cant even take a short break to go get mcdonalds or something",
      "author": "RainbowChocolate_",
      "created": 1633748886,
      "upvotes": 6,
      "replies": {}
    },
    "hfxto85": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfxto85/",
      "text": "I think your profs are just shitty. Talk to your faculty admin and suggest a policy to not assign work due on the weekends or during holidays. I never had anything due on the weekends.",
      "author": "DeadWoodPark",
      "created": 1633750256,
      "upvotes": 3,
      "replies": {}
    },
    "hfxy9l0": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfxy9l0/",
      "text": "Mine are Sunday at 11:59, with only a bit due in Thurs. I fucking hate how my workload is. It's like you really have to overwork yourself just to get 2 days off in a row where you don't have to do anything. \n\nAnd if there's any exams or projects, forget about it. You're working 7 days a week on college shit.",
      "author": "TheAmazingDisgrace",
      "created": 1633752705,
      "upvotes": 2,
      "replies": {}
    },
    "hfy0kxa": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfy0kxa/",
      "text": "You don’t have roommates and floor mates?",
      "author": "bfangPF1234",
      "created": 1633753994,
      "upvotes": 1,
      "replies": {
        "hfy3vy8": {
          "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfy3vy8/",
          "text": "Have roommates, we’re just not necessarily friends. Their lifestyles just don’t align with me and tbh I barely even see them bc they’re out so much. And I have 7 suite mates and among 4 of them there’s a lot of drama so it makes me wanna see them even less bc there’s just a bunch of complaining",
          "author": "silvermoon_182",
          "created": 1633756039,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hfyjvun": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfyjvun/",
      "text": "I sympathize with you! I've had semesters like that, now they're more spaced out with my more \"consistent\" class' assignments being due every Tuesday (or every other Tuesday depending on how fast the lessons go). My other classes barely assign anything.\n\nNot sure what you're classification and major is, but if you haven't gotten to this point yet, just know that it might get a bit easier once you get out of your gen ed classes. Maybe. I've heard it's just gotten harder for some students, but in my experience, my school is a lot more researched based--The professors are stretched more thinly so they don't really have time to be given out assignments to be checked weekly and shit. Overall things may get a little more sporadic, and a little more enjoyable. :) \n\nAnd what's your bus situation in your town? I'm sorry if you've already tried this and you didn't like it or it never worked out. But throughout the week if you have any lulls in your schedule maybe it'll be worth it to take some time off and catch the bus. \n\nIt *might* be the same or different for you, but in my town college students ride for free with just a swipe of our student cards. \n\nI research places I want to go, find the nearest *walkable* bus stop to that place (if I can't feasibly walk once the bus drops me off, I'm not going), catch the bus off campus and then I just go. Depending on wear I go I don't have to spend any money either. One time I went to a park to do homework for example. \n\nCan't so speak on the friend thing since I'm more of the loner/asocial, more introverted variety(not like how people mean social anxiety, but as in I don't really need people to explore and feel energized), but I hope you figure out something soon! Like getting to meet up with them in mutual places around town. \n\nIf you can help it, in the future (again, not sure if you're like a freshman or something) try to schedule your classes so that you have break days (no classes or 1 or 2 classes that end earlier in the day). Rn my break days are Tuesday and Thursday, and shit's sweet lol. I use them as days to either get off campus and clear my head, or I use it to catch up on work and study. \n\nGood luck! I hope things get better. :)\n\nI also think college sucks, but for some reason it saddens me when other people agree with me so I always try to give solutions to help. Maybe bc I don't want them to be miserable like me.",
      "author": "NoodleEmpress",
      "created": 1633767721,
      "upvotes": 1,
      "replies": {}
    },
    "hfzj5t7": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfzj5t7/",
      "text": "Why don’t you just write all the due dates in your calendar as the Friday?",
      "author": "crystalliite",
      "created": 1633790796,
      "upvotes": 1,
      "replies": {}
    },
    "hfzr5k3": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfzr5k3/",
      "text": "Yeah, assignments for me are always due on Sunday at 11:59. I try to be really smart with my time during the week so most everything is done by Friday evening. That doesn’t always happen, so my policy after that is I don’t work on the mornings during the weekend.",
      "author": "taa20002",
      "created": 1633794527,
      "upvotes": 1,
      "replies": {}
    },
    "hfzy6x4": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hfzy6x4/",
      "text": "Literally me.",
      "author": "Madarimol",
      "created": 1633797678,
      "upvotes": 1,
      "replies": {}
    },
    "hg0ceas": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hg0ceas/",
      "text": "There was a small pinch of time in my college life where on Fridays or Saturdays I drove an hour to the nearest mall just to escape. I would sit for hours outside and just daydream. I couldn’t do that on campus. FF a year or two and I had a job that ate up all of my free time. I graduated but a friend of mine told me about this certain spot next to campus where she would frequent to do the same thing as me (granted she used it as a smoke spot) but I never knew about it until after the fact. I’d say go explore and just walk around the area. You’ll never know what you’ll find while there.",
      "author": "AXXII_wreckless",
      "created": 1633803922,
      "upvotes": 1,
      "replies": {}
    },
    "hg3xbxx": {
      "link": "/r/CollegeRant/comments/q49itq/i_hate_weekends/hg3xbxx/",
      "text": "i feel you so bad, i'm also sorry for you. all my weekends are summarized in work and solitude, or just sleep all day when insomnia permits. i hope you still can find some time to enjoy your days of rest later, maybe now is just a bad moment, who knows?",
      "author": "yazukakun",
      "created": 1633877269,
      "upvotes": 1,
      "replies": {}
    }
  }
}