{"sid": "myr9rs", "link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/", "title:": "I’m disappointed by the student I’ve become", "text": "I’m wondering if anyone else can relate... I was a really good student in high school. Never cheated, was in the top 20 of my class, studied for hours every day, and did really well in AP classes. Got straight A’s, didn’t want anything below a B, etc. I’m a sophomore in college now and I feel so much worse. Online classes have destroyed my work ethic. I’m happy just to pass my classes, and I have no motivation to study when all exams are open note (and realistically, open internet if there’s no supervision). I’m an engineering student (though I’m changing my major next year) and I feel so stupid compared to my peers and the standard we’re held to. I feel like a complete failure, and I don’t know where this went wrong. 17 year old me would be so appalled by 20 year old me. Anyone feel the same??\n\nTL;DR I was a much better student in high school than I am in college, and I hate myself for it. Anyone relate?", "author": "toastedmeat_", "created": 1619418453, "retrieved": 1632950905, "over_18": false, "upvotes": 87, "upvote_ratio": 0.99, "comments": {"gw5ly20": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gw5ly20/", "text": "I felt this way when I was going to college in the late 2000’s because I didn’t know why I was in school, I wasn’t interested in it I just went because my parent stressed it. I ended up super depressed and unproductive and felt exactly what you describe. \n\nI’m now 32 years old and back in school for something I’m truly excited about, and it’s an entirely different world. I have a goal and a purpose that gives the classes meaning. I feel like myself again after over a decade. \n\nTo be honest I think your early 20s is too early to know what the hell you want to do, which is why what you describe is so common. Just remember you are still that high achiever, but you have to find what pushes you...and that may take time. \n\nIf taking a break from school is possible it may be what you need. This is also a particularly rough year with everything going on, it’s understandable you’re burnt out.", "author": "alonebadfriendgood", "created": 1619604304, "upvotes": 2}, "gw0a72c": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gw0a72c/", "text": "Same here. I have one year to fix my study habits before I start pharmacy school", "author": "TheRapidTrailblazer", "created": 1619491453, "upvotes": 1}, "gvyqau0": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvyqau0/", "text": "It's your fault. See the positive side of things. Look for them!", "author": "-boredMotherFucker", "created": 1619464673, "upvotes": 0}, "gvypq7p": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvypq7p/", "text": "You describe my experience to a T.", "author": "leo322", "created": 1619464432, "upvotes": 1}, "gvy34ko": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvy34ko/", "text": "No. Im in the completely opposite situation. I graduated HS with a 2.1 and now I have a 3.4 in college. I literally gave up being a good student in hs because of health reasons and because I thought, with all the college options, why try so hard for the same degree? And I hated everyone who was in the honors or AP courses so I stayed in the regular classes. Now in college I’m doing great. I think I work better knowing that it’s for something and not just something that I could achieve an equivalent of with one standardized test.", "author": "Slight_Reason", "created": 1619454928, "upvotes": 1}, "gvy2o9j": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvy2o9j/", "text": "Yea I feel like I'm in the same boat. With this said, does anyone have an suggestions on how to study better?", "author": "HorseJr12", "created": 1619454739, "upvotes": 1}, "gvy0fpr": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvy0fpr/", "text": "use to be a 4.0 in high school. College hit and now I'm a 2.6.", "author": "weediamonds", "created": 1619453814, "upvotes": 2}, "gvxugao": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvxugao/", "text": "I am in this comment and I don’t like it. :(\nWas also a good student all through K-12. Went to my first college, didn’t graduate and burnt out. Back in school now and I still feel like I’m burnt out. Would love to get my motivation back, or whatever it was that kept me going.\n\nLast time I went to doctor, she was concerned about sleep apnea due to my weight.", "author": "N00dlemonk3y", "created": 1619451259, "upvotes": 1}, "gvxpr2v": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvxpr2v/", "text": "At this point, I am your clone. I am you and you are me because this is exactly what I'm feeling right now and I'm so sorry.", "author": "throwaway_122919", "created": 1619449222, "upvotes": 1}, "gvxj3im": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvxj3im/", "text": "I’m in a similar position. I was super close to the teachers, I took AP classes, I was number 25, and overall I was a star of the school to the point where everybody loved me, I was their baby sister or they knew who I was. \n\nNow it’s to the point where I submit work days late because I feel no motivation to do it. I stay up all hours because I can’t stop procrastinating.  I hate this year. I overeat a lot now I think I might’ve gained some weight I lost during the pandemic. I had a three day headache and it only temporarily went away because I took an edible and walked around the mall. \n\nI can’t wait to go back to school in the fall and I feel so guilty for everybody who’s still going to be online.", "author": "CapriciousSalmon", "created": 1619446216, "upvotes": 0}, "gvxg0nr": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvxg0nr/", "text": "You’re not alone. I was a good student in high school but burned out near the end and was doing really poorly in college because high school did not adequately prepare me for it. I did get better though after transferring schools. But right now I’m failing a class and will most likely lose financial aid. Luckily I’m almost done with school and I can pay for the rest of my classes myself. It happens. You can’t always win.", "author": "UpbeatFaithlessness6", "created": 1619444721, "upvotes": 10}, "gvx67ou": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvx67ou/", "text": "You're not a failure and I relate alot :(. It does suck I do online classes with no zoom and I pretty much don't study anymore and completely relied on open internet to pass multiple classes (mainly electives). I feel really dumb about it but I guess the key is to not feel as guilty because I guarantee you so is everyone else.", "author": "Fickle-Management", "created": 1619439184, "upvotes": 12}, "gvwpyfi": {"link": "/r/CollegeRant/comments/myr9rs/im_disappointed_by_the_student_ive_become/gvwpyfi/", "text": "are we the same person? :p but please don’t think you’re a failure! it is naturally super difficult to stay motivated in a situation like this. i like to think of this year as an important reminder that there is so much more to life than grades and studying. i hope you find some things outside of class that give you fulfillment :)", "author": "lanternriver", "created": 1619425146, "upvotes": 20}}}