{"sid": "jlev8o", "link": "/r/CollegeRant/comments/jlev8o/wish_i_could_turn_my_college_experience_around/", "title:": "Wish I could turn my college experience around", "text": "I’m a junior finance major at a big state school in northeast. It’s one of the few majors my parents approve of. I don’t care for my major at all. I just find it so hard to make friends despite keep trying to join clubs and such, and this semester having everything on Zoom sucks. All the “friends” I made in soph and freshman year have not initiated conversation with me at all these past few months...I’m always the one starting it. I wish I was studying marketing, media studies, or communication at a small elite Liberal arts college. I wish I had a big friend group. I wish I could enjoy having the “classic” amazing college experience. But nope, I could never do that. Have to be the perfect daughter and get a high paying job after graduation just to make my parents happy. Anyone else feel the same way or in the same place? \n\nTL;DR I wish I could study what I’m interested in and have a good solid friend group. That’s all I’ve ever wanted.", "author": "purplefirefly09", "created": 1604132877, "retrieved": 1632842928, "over_18": false, "upvotes": 135, "upvote_ratio": 0.99, "comments": {"gaqpe6k": {"link": "/r/CollegeRant/comments/jlev8o/wish_i_could_turn_my_college_experience_around/gaqpe6k/", "text": "it might be too late for your major but can you minor in communications? i think with the combination of finance and com you’ll be able to find a job you enjoy", "author": "2001questions", "created": 1604185165, "upvotes": 1}, "gaqp56e": {"link": "/r/CollegeRant/comments/jlev8o/wish_i_could_turn_my_college_experience_around/gaqp56e/", "text": "Sometime you just have to let go of your parents expectations. Believe me, if you spend all this time to make them happy, you NEVER will be. Maybe you can trick yourself into it, but it sounds to me like you know what you want. Your friends can see through your lack of passion. Your parents need to let go of the leash. And you need to put them to do that. You only live once.", "author": "fixture817", "created": 1604185003, "upvotes": 1}, "gaq85ti": {"link": "/r/CollegeRant/comments/jlev8o/wish_i_could_turn_my_college_experience_around/gaq85ti/", "text": "Continue finance and do the other stuff as a hobby", "author": "xsonixx9", "created": 1604174669, "upvotes": 2}, "gapu9h4": {"link": "/r/CollegeRant/comments/jlev8o/wish_i_could_turn_my_college_experience_around/gapu9h4/", "text": "As a 24 year old I can confirm that once you reach a certain age, what your parents think literally doesn't mean shit. Don't set up the rest of your life doing what they want. At the end of the day they just want to make sure you'll be able to survive on your own. The path you take to get to that doesn't matter. They'll come around.", "author": "vness1213", "created": 1604167004, "upvotes": 14}, "gap7slb": {"link": "/r/CollegeRant/comments/jlev8o/wish_i_could_turn_my_college_experience_around/gap7slb/", "text": "Switch majors before it’s too late. Who cares what your parents think; your an adult now.", "author": "denver_rose", "created": 1604154238, "upvotes": 23}, "gaop3bo": {"link": "/r/CollegeRant/comments/jlev8o/wish_i_could_turn_my_college_experience_around/gaop3bo/", "text": "I found in most cases other friend groups are just  people who continued to stay friends after school, and in these cases they are just friends because of proximity, once you get to know them, you learn fast they don't really like each other. (I also don't have any college friends, yea joining clubs aren't worth it)\n\nSorry to say but the \"classic\" college experience does not exist, if people act like it... well... its simply not true, and honestly it doesn't matter what college you attend its always going to be the same... the game might change but the players remain the same. (This is not the advice you are seeking but its from my own experience). It's what you make with what you have. People who act like certain colleges have a better \"value\" but these people don't know what they are talking about. They have either 1) never been 2) students from these courses are either pretentious or just idiots.\n\nMy advice try something that is outside of university, hobby or something, that has no relation to your college. Preferable something new and challenge. Also, something I wish that I did my first year (and its really hard advice) enjoy it while it lasts, even tho at times it seems miserable, you are never going to get this time back especially the fact that your only responsibility is your school work and nothing life threatening (well I don't know you personally).\n\nOnline classes suck!!!\n\nWelcome to life! Good luck with you course\n\nTL:DR almost everyone at college have absolutely know idea what they want to do in life (as does majority of the population, regardless of age) and friends can be overrated... sometimes.", "author": null, "created": 1604137632, "upvotes": 14}, "gaom2g0": {"link": "/r/CollegeRant/comments/jlev8o/wish_i_could_turn_my_college_experience_around/gaom2g0/", "text": "Well it seems like you need to live for yourself, and not your parents. You will remain unhappy until you do so.", "author": "2valve", "created": 1604133892, "upvotes": 52}}}