{
  "sid": "pcyjir",
  "link": "/r/CollegeRant/comments/pcyjir/no_friends/",
  "title:": "No friends :(",
  "text": "I just finished my first week of college and I'm an outcast I feel like no one wants to be around me or talk to me unless they have too for group work. I just wanted one friend to keep me company in class but I don't think that's gonna happen I'm a freshman at my college a bio major my dressing style is kinda alternative and everyone else is sporty and preppy so I feel like people don't like me cause I'm not like that and I just hope someone talks to me I'm mostly a reserved person to begin with lots of social anxiety.",
  "author": "Complete-Database-40",
  "created": 1630106443,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.95,
  "comments": {
    "hapxgt8": {
      "link": "/r/CollegeRant/comments/pcyjir/no_friends/hapxgt8/",
      "text": "i felt the same thing my first year, but it really is just the beginning and you’ll have PLENTY of time/opportunities to meet new ppl! i met my closest friends from college thru a classmate in a random GE class my second semester and at that point i had given up on trying to build connections and felt like i absolutely did not belong at that school so it was a pleasant surprise since the friendships formed so effortlessly. i’d recommend joining clubs or study groups or literally anything that remotely interests u, and you’ll naturally meet ppl! \ndon’t be too hard on yourself!!!",
      "author": "a3184052",
      "created": 1630180226,
      "upvotes": 1,
      "replies": {}
    },
    "hamcldl": {
      "link": "/r/CollegeRant/comments/pcyjir/no_friends/hamcldl/",
      "text": "Oof. I’m so sorry this is happening to you. Even though I’ve been out of college since 2018, I’ve been in your shoes.\n\nYou have to remember that this is just the first week. Many students are just beginning to settle in, and get used to the college life. You have hundreds of more weeks to befriend people. \n\nYou also have to remember that friendships take time to grow. While I met some of my best friends in college, we didn’t become close for several months. It took months of constantly talking and experiencing shit together for us to become close. \n\nIs there a particular club you’re interested in? Join one, and you’re much more likely to find likeminded people. It’s much easier to befriend likeminded people.  Same thing with your classes. Find someone who likes the same stuff as you, and talk to them.",
      "author": "mayazauberman",
      "created": 1630107257,
      "upvotes": 9,
      "replies": {}
    }
  },
  "updated": 1634063871
}