{
  "sid": "o4pt2q",
  "link": "/r/CollegeRant/comments/o4pt2q/need_help_with_figuring_something_out/",
  "title:": "Need help with figuring something out!",
  "text": "Is there something against professors putting up a schedule for the course with a certain date for an exam and then changing that date without letting anyone know that she changed the date? See I am taking 4 summer courses for Summer 1, and so I have a calendar to help keep me on track so I don't miss an assignment. I had an exam scheduled for June 21st due at noon. When I went to go look at my study guide to make sure I had everything the exam wasn't there and I went to check the schedule and it was changed. I had thankful downloaded the original copy and compared the two and the date was changed. Then I went through all the announcements she sent out and not one said that she was changing the dates. So I need help on figure out if there is a rule against doing that to students. I have never missed an exam in my life and I'm freaking out. SOMEONE PLEASE HELP ME!!!!! This isn't fair and I don't know if anyone else missed it, but I have screenshots of everything so if my professor try's to say I was making this up I have proof that I'm not.\n\n!!!!UPDATE!!!!\n\nI have now emailed my professor twice and she still has not responded to either one of my emails!",
  "author": "Drowning_At_Tech303",
  "created": 1624261113,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "h2ilnff": {
      "link": "/r/CollegeRant/comments/o4pt2q/need_help_with_figuring_something_out/h2ilnff/",
      "text": "What was the adjusted due date? \n\nMost instructors will append their syllabi with a \"dates and things may change\" disclaimer. Some take the lazy way out by also stating \"it's up to the student to follow the course schedule and all updates\" without actually letting the student know. Some simply forget to post announcements about course updates.\n\nEither way, you should email your instructor asking for clarification of the due date. That's the first step.",
      "author": "Noticed-Senpai",
      "created": 1624262743,
      "upvotes": 3,
      "replies": {
        "h2jjrn3": {
          "link": "/r/CollegeRant/comments/o4pt2q/need_help_with_figuring_something_out/h2jjrn3/",
          "text": "she made it due on June 21st to start with and when I went back to check it was due yesterday at noon.",
          "author": "Drowning_At_Tech303",
          "created": 1624287422,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634062076
}