{"sid": "oyjltk", "link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/", "title:": "Just finished my first accelerated summer class", "text": "Never again ( my preference, if it works for you that's fine. However, I need to rant about this lol) \n\nSo this class (International Business) ran for a month during the summer. It was asynchronous and mainly just involved reading a lot. I'm interested in this sort of thing and I have to take it anyway so figured I would get it out of the way. \n\nWe had three exams, 50 questions each, and all together they were worth 60% of our grade. I studied, read the chapters, made my own study guide on top of what the teacher provided us with etc. \n\n1st exam: 86% \n\nOkay, well I'll study harder this time. \n\n2nd exam: 82% \n\n....Wow. Well, there's still a shot, let me go hard for this next exam. \n\nI make this study guide-bibe hybrid and study it first thing in the morning, first thing at night. \n\nI take the exam today. \n\n3rd exam: 78%\n\n... and unless my paper and discussion board knocks the professor's socks off I'm probably getting a C and my GPA is going to throw itself into a volcano. Super disappointed in myself, but I'll just try harder in this upcoming semester. \n\nDid anyone else take an accelerated class this summer or in the past? What was your experience?\n\n&#x200B;\n\nTLDR: \n\nTook a class over the summer that I thought would be easy. Sucked on the exams big time, cue me going \"wahh\".", "author": "designingwoman", "created": 1628174221, "retrieved": 1632950829, "over_18": false, "upvotes": 117, "upvote_ratio": 1.0, "comments": {"h7vpq9u": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7vpq9u/", "text": "Summer classes are only easy for the non math, science, engineering classes.", "author": "Romano16", "created": 1628212358, "upvotes": 2}, "h7vobvk": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7vobvk/", "text": "Some  lasses need to have normal paced registration options . I’m terrible at languages and I need to take two years / 4 classes of a language. I put it off for as long as possible. And now! Out of no where, the university decided to make almost every single class 6 week accelerated instead of its normal 16 weeks this way they can go from 3 semesters to 7 terms with some breaks in between and graduate people faster. What used to take someone 8 semesters/4 years roughly will now take 2-3 years depending on how many courses each term you take. So me, someone who can barely figure out the basics of a foreign language will have “two years of language credit” in 4 terms / 24 weeks … that’s less than 6 months! If I’m even able to pass the first one, let alone the other three more advanced courses in 6 weeks. Gah! I’m so sick of the constant pressure to get done faster!", "author": "mother_of_nerd", "created": 1628211669, "upvotes": 2}, "h7vkwte": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7vkwte/", "text": "Accelerated Masters degree in 16 months. I studied, ate, and slept. There was no life. Only school.  I graduated with a 4.0. \n\nThere was a price. \n\nI also gained 45 pounds, developed scoliosis in my back from an old injury and poor posture, and miscarried from stress.", "author": "L4dyGr4y", "created": 1628209980, "upvotes": 2}, "h7vi1zx": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7vi1zx/", "text": "I’m taking chemistry as a summer class rn and it is the worst thing ever. Summer classes are so painful", "author": "toastedmeat_", "created": 1628208561, "upvotes": 2}, "h7vgieq": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7vgieq/", "text": "I took an accelerated summer grad level quantitative statistics course 2 summers ago. I still have night terrors which places me as an outlier from the positive standard deviations for PTSD from this 6 week odyssey through my own personal Hades.", "author": "ABMonation", "created": 1628207799, "upvotes": 2}, "h7vcxiv": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7vcxiv/", "text": "Yeah I took 4 of those in one summer it was hell", "author": null, "created": 1628206030, "upvotes": 2}, "h7v7tio": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7v7tio/", "text": "I’m doing MAC1114 which is a trig class. I have a 95 rn but have to take 2 exams for that class tonight (due to my procrastination). Even without my procrastination, the course went up a notch for the past week or 2 and my entire class is struggling to keep up\n\nEdit: my other class is really easy and the intro class for my major (I switched majors in the spring) but my stupid ADHD brain won’t let me focus and now I’m going to learn the entirety of my class tomorrow start to finish (sem ends tomorrow). Otherwise, the summer has been great", "author": "5krishnan", "created": 1628203612, "upvotes": 2}, "h7uu8w8": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7uu8w8/", "text": "I’ve taken two this summer on top of 3 full-terms. Luckily, mine were writing intensive, not test intensive. I have wicked test anxiety. I’m sorry yours didn’t go well, but your positivity is amazing; you’ve already got a plan for next semester! I’m really hoping your grade comes back alright 🤞🏻🤞🏻", "author": "ZacKaffeine", "created": 1628197622, "upvotes": 2}, "h7ut3ja": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7ut3ja/", "text": "I did calc III and physics II over the summer. Had my last exam today. Never again.", "author": "pwoko", "created": 1628197138, "upvotes": 2}, "h7umjhr": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7umjhr/", "text": "Dude I feel this. Idk why but I took chem 1, chem lab, bio 1 lab precalculus, trig, bio 2, and my bio 2 lab this summer. I have never been so stressed out in my life. Im so glad this is the last week.", "author": "sarahdarlene", "created": 1628194400, "upvotes": 2}, "h7ukvfb": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7ukvfb/", "text": "I took 3 summer classes this summer, ended with C’s in all of them.", "author": "NoSpaceAlien", "created": 1628193704, "upvotes": 2}, "h7ukmyc": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7ukmyc/", "text": "[deleted]", "author": null, "created": 1628193606, "upvotes": 2}, "h7uk82d": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7uk82d/", "text": "Accelerated summer classes are absolute horror. You only take them if you have to or you *really* want to get some class out of the way.\n\nSource: Took accelerated differential equations this summer. I'm not the same after that.", "author": "WashiBurr", "created": 1628193435, "upvotes": 2}, "h7ue77d": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7ue77d/", "text": "My first year of college was a German submersion program that was set up in octomesters, so a new class every month. Personally, I liked it. I prefer the cramming and less classes simultaneously thana bunch of different classes moving at a glacial pace. I did 4 asynchronous classes this summer (2 in June and and 2 in July) and would usually finish all of the homework in the first two weeks and then wait impatiently for the discussion posts and tests to catch up later.", "author": "Oplatki", "created": 1628190961, "upvotes": 2}, "h7u2dsv": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7u2dsv/", "text": "you're gonna get a \"C\"? idk what your professors cut offs are but your test scores average to an 82 which is usually a B or a B- in my experience.", "author": "lguy4", "created": 1628186205, "upvotes": 2}, "h7tzww7": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7tzww7/", "text": "The only thing I don't like about my class is that I had to take a quiz and/or write an essay every damn day. But I think it's better to suffer for about 6 weeks rather than a whole semester", "author": "Competitive_Space_43", "created": 1628185210, "upvotes": 2}, "h7tzcq3": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7tzcq3/", "text": "I have my calc1 final in 30min, I have had the absolute worst professor in my life, this will either be my first C or D in college as an engineer major. I put in all my effort for this class too. Wish me luck, I need at least a 65 to pass the class with a C.", "author": "llzermll", "created": 1628184979, "upvotes": 10}, "h7tza0x": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7tza0x/", "text": "Currently me rn! I’ve taken summer and winter classes, but I had the bright idea of taking a math class in the summer…. while working 2 jobs. I’m gonna pass with a B or C, which is fine I guess but I am never doing this again 🥲", "author": "jessicaa-iv", "created": 1628184947, "upvotes": 2}, "h7ty32i": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7ty32i/", "text": "I usually took the “easier” classes in the summer, like the random electives. Nutrition, theater, etc. I tried to keep the core classes for the full semester.", "author": "Holy_Sungaal", "created": 1628184459, "upvotes": 6}, "h7tu0vf": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7tu0vf/", "text": "sorry to ask this but how is the workload for Fall semester classes that normally take three months? thank you", "author": "eustacewriter", "created": 1628182782, "upvotes": 2}, "h7tpdvh": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7tpdvh/", "text": "Not me thinking 78-86% is amazing as an engineering major 😭. Summer classes suck ass.", "author": "cheesekneesandpeas", "created": 1628180884, "upvotes": 23}, "h7tk8j9": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7tk8j9/", "text": "i had two summer maths classes wasnt easy though but i managed to score an.overall of 89% for both classes. great", "author": "eustacewriter", "created": 1628178759, "upvotes": 3}, "h7tk1w3": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7tk1w3/", "text": "I took an accelerated animal behavior course with a lab in it this summer. I will also never do it again, I got a C even though I tried so hard. We were asynchronous as well, had 12 modules, 2 done each week with 2 quizzes and 2 full labs that needed to be due. Quizzes weren’t really hard but as hard as I tried to do these labs it didn’t go that well haha. But I got an A on our final project which is the only reason I got a C! Won’t ever take a science course with a lab in it over the summer again.", "author": "mimi_00", "created": 1628178683, "upvotes": 4}, "h7tifci": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7tifci/", "text": "I usually take classes over the summer that are really hard. Its like torturing myself for a month rather than a semester.\n\n&#x200B;\n\nEdit: I once took a summer class that was only 3 weeks. RIP", "author": "Omeole", "created": 1628178000, "upvotes": 61}, "h7tdf30": {"link": "/r/CollegeRant/comments/oyjltk/just_finished_my_first_accelerated_summer_class/h7tdf30/", "text": "Oh no.  I took a accelerated CIT 1450 Intro to Linux net only which means not in person and not on zoom.  Awful thankfully it is a elective class and their wasn't anything but labs and quizzes and tests no midterm or final.  Never again taking a 6 week NET class. I had a F after he violated my ADA rights and I have a C with a slight chance at a B even though he told me it wasn't possible.", "author": "theedge23", "created": 1628175860, "upvotes": 14}}}