{"sid": "jlwv5s", "link": "/r/CollegeRant/comments/jlwv5s/parents_pressure/", "title:": "Parents pressure", "text": "Does anyone feel pressured to graduate by a certain date to please their parents? I had to drop one course this semester cause the school screwed up on their end. My graduation fate is set back and I feel like Ill be the family embarrassment for staying in school so long. I have mental health issues that affect my performance in school overall. My mom has always been “pull it together and stop playing around”. Not how can I help you succeed. She’s one of those parents who don’t believe in mental health issues.", "author": "rose-wilson", "created": 1604206380, "retrieved": 1632950948, "over_18": false, "upvotes": 77, "upvote_ratio": 0.99, "comments": {"gat7omw": {"link": "/r/CollegeRant/comments/jlwv5s/parents_pressure/gat7omw/", "text": "As a parent with a kiddo in college with mental health issues, I am sending you a hug. Hang in there, put yourself first. \n\nWorst case scenario is what? Will she not pay for that last class? Find out, have that difficult talk (or if it’s easier an email, or text), but find out so that you can prepare by finding aid. Most likely, she’s going to throw a fit about money but tough shit, things happen out of your control.\n\nAnd if you need someone to talk to, I’m here.", "author": "Karenena", "created": 1604252846, "upvotes": 2}, "gasnimr": {"link": "/r/CollegeRant/comments/jlwv5s/parents_pressure/gasnimr/", "text": "honestly i’ll need an extra semester and i still haven’t told my parents. i had undiagnosed mental health issues so i just kinda burned out and either dropped or failed all my classes. i feel a bit bad for lying but i know things will improve in the future and i’ll still be successful. if they won’t believe the extent of my mental issues then who cares what they think i should have been able to do", "author": "Chaosncalculation", "created": 1604241564, "upvotes": 2}, "gaskx6l": {"link": "/r/CollegeRant/comments/jlwv5s/parents_pressure/gaskx6l/", "text": "There's honestly nothing wrong with taking some extra time. My brother is taking 2 extra terms to fulfill  his degree requirement and get a special certification in his major. Sometimes the required classes you need to graduate and the classes you want to take just don't work together and you have to take extra terms. I'll probably have to take an extra term as well since my degree has pretty specific requirements and some of those classes are only offered at certain times. There are also very some very interesting courses I want to take. I could stay in for 2 extra terms with a full course load and have a great time taking fun courses. \n\nThis is your time. Screw the societal  timeline. Screw your mother's timeline. You said the school messed up. Explain that to your mom and if she doesn't like it, it's not your fault. I don't know your mom so idk how she would react but there's really no way to spin this situation that I can think of to make it your fault. The school messed up and now you had to drop a course and push back graduation. It's a pretty simple story that hopefully won't cause too much trouble with your mom.", "author": "mypuppyisamonster", "created": 1604239912, "upvotes": 4}, "gasgv38": {"link": "/r/CollegeRant/comments/jlwv5s/parents_pressure/gasgv38/", "text": "If your always trying to please your parents how do you expect to get a good quality girlfriend? She’s going to think your not manly enough?", "author": "Jabaggs", "created": 1604237211, "upvotes": 1}, "gartzyk": {"link": "/r/CollegeRant/comments/jlwv5s/parents_pressure/gartzyk/", "text": "Ya my mom has definitely been that way the entire college process. Especially when I was doing school part time so that I could do performing as well. She set my graduation date as the means of keeping our house until I leave. CONSTANTLY hearing \"you need to graduate by 2021 so that I can sell the house\", even though I'm not the only person living there (I don't even physically live in the house anymore and there are lots of houses for sale in that neighborhood that have no buyers so it's not like it'll magically sell once I've graduated). I just wanna graduate ASAP so I can get away from family for good", "author": "vness1213", "created": 1604216809, "upvotes": 13}, "garqpeo": {"link": "/r/CollegeRant/comments/jlwv5s/parents_pressure/garqpeo/", "text": "watch this video by Gary Vee. I love what he has to say about this. [https://www.youtube.com/watch?v=PLnWa88pS6k](https://www.youtube.com/watch?v=PLnWa88pS6k)\n\nif you please your parents, you'll never be able to please yourself. sure it might make them happy temporarily but you won't be happy. you get to decide how to run your life, not them. you're the one who's going to have to live with yourself, so stop trying to please anyone else especially your parents. here the thing: you please them, they'll be happy for a short while, and you will be miserable. you do what makes YOU happy and what will enhance your life (even if you have to stay in school longer) and they might not be happy with you at first. but in the future when you're both successful and happy, then they will be too. they will be proud of you eventually because you reached your goals and dreams, not theirs. and remember that they will love you no matter what. so yeah, stop trying to please them :)", "author": "iridescent_skiess", "created": 1604213066, "upvotes": 18}}}