{"sid": "ib37n9", "link": "/r/CollegeRant/comments/ib37n9/i_dont_feel_ready/", "title:": "I don’t feel ready", "text": "I’m heading off to my first year of college and I’ll be honest: I’m scared shitless. Don’t get me wrong, I’m super excited to see and learn new things, but I feel overwhelmed with all of the decisions I’m going to be having to make. \n\nI have stories I want to share (these stories are going to be told through animated series’, books, comics, video games, etc.) and so I am “going to college for English and art” but I have NO idea what I want to do for my actual JOB. I am worried that I will figure out what I like doing after college and have to go back and I know that’s a common thing that people do, but I am going to SERIOUSLY struggle to financially get through this semester, let alone get through all four years or even go back! (My parents/family can’t really help much). \n\nIm also scared of having to fend for myself obviously so misc tips and tricks are super appreciated!!", "author": "WishUponAStarInAJar", "created": 1597621654, "retrieved": 1632951296, "over_18": false, "upvotes": 60, "upvote_ratio": 0.99, "comments": {"g21mw2g": {"link": "/r/CollegeRant/comments/ib37n9/i_dont_feel_ready/g21mw2g/", "text": "no one feels ready for life, which is the funny part. That's the worst part of starting to grow up, realizing your parents are just as lost as you but have more experience to sustain themselves lol", "author": "bri2244", "created": 1597793440, "upvotes": 2}, "g1tde93": {"link": "/r/CollegeRant/comments/ib37n9/i_dont_feel_ready/g1tde93/", "text": "I say that you take it one step at a time! I was so overwhelmed my first year that I almost ended up dropping out (literally one meeting away from being unenrolled). But I got some advice to slow down and take things step by step, whether that was planning for classes or managing my budget or thinking about my future (I’m also studying English/Literature yay!) and tbh I’m happier than I’ve ever been and gonna graduate soon so things may work out for you! there is no one size fits all formula for college so you gotta figure it out but I wouldn’t be too concerned since everyone is scared shitless (trust me! I work with incoming freshman and EVERYONE is scared) :]", "author": "pixiedxll", "created": 1597649255, "upvotes": 2}, "g1ssbe3": {"link": "/r/CollegeRant/comments/ib37n9/i_dont_feel_ready/g1ssbe3/", "text": "i’m currently a junior and i’ve changed my major 3 times already so don’t be afraid that you’ve already commit to one thing so there’s no turning back. take classes that interest you and excite you (if u can!) your first year and then start to hone in on what you really feel passionate about. i recommend getting a planner to help you feel less overwhelmed !!! it really saved me when i started college. good luck !!", "author": "DreamRegimes", "created": 1597632483, "upvotes": 7}, "g1srk7i": {"link": "/r/CollegeRant/comments/ib37n9/i_dont_feel_ready/g1srk7i/", "text": "No one feels ready for the first year of college. Once you get there you’ll realize that no one else knows wtf is going on, and you’ll learn and grow as a person and start to discover what you think you’ll wanna do for a job", "author": "onlystreetlights", "created": 1597631999, "upvotes": 3}, "g1scpdy": {"link": "/r/CollegeRant/comments/ib37n9/i_dont_feel_ready/g1scpdy/", "text": "It seems scary now, but it will seem like nothing when you get into the motion of things. So don't worry too much, you will adapt to everything. \n\nRegarding what you'll \"do,\" don't worry about that too much. While a job after college is definitely important, if you bog yourself down in the details then you'll make decisions that will lead you to an unhappy life. \n\nJust be open to new things and be willing to make steps in different directions if you find something else that you would rather pursue. You'll get there eventually.", "author": "WashiBurr", "created": 1597622850, "upvotes": 14}}}