{"sid": "p930rg", "link": "/r/CollegeRant/comments/p930rg/students_campaigning_against_campus_police_in_an/", "title:": "Students Campaigning Against Campus Police In An Urban University", "text": "Where do I begin? I go to a large urban university in the heart of a city. In the wake of the Black Lives Matter protests, many people are questioning whether the current population of police is too high, where they receive too much funding, and various other issues. \n\nI understand that. I stand with Black Lives Matter in terms of some of their goals. I believe that systemic racism must be addressed, and have little issue with Critical Race Theory being discussed in school.\n\nHowever, some students at my university want to abolish the presence of campus police. This means no patrols around campus, less police on the grounds overall. Basically, abolish most of the police presence on campus. This is fucking stupid.\n\nThis is a large city, and although not crime-filled, is not free of crime. There are dorms filled with thousands of undergraduate students, and thousands of freshmen. Many of them are attractive young women. Do you not understand that many predators lurk the grounds because they know where the dormitories lie? Do you understand that young women walking alone or in small groups have targets painted on their backs? What of the men? Nevermind the muggers and various other threats.\n\nWhat the fuck?", "author": "CalmingVisionary", "created": 1629593848, "retrieved": 1632841590, "over_18": false, "upvotes": 5, "upvote_ratio": 0.65, "comments": {"h9urvsf": {"link": "/r/CollegeRant/comments/p930rg/students_campaigning_against_campus_police_in_an/h9urvsf/", "text": "Thank you u/CalmingVisionary for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1629593849, "upvotes": 1}, "h9va6i6": {"link": "/r/CollegeRant/comments/p930rg/students_campaigning_against_campus_police_in_an/h9va6i6/", "text": "I’m with you. The groupthink of college students on this one is ridiculous. Defunding and abolishing the police never made any sense. There’s nothing out there suggesting it was ever overfunded in the first place. The problem is hiring racists, and that could probably be evaded through the use of lie detector tests or stricter penalties for racist behavior on the job. I support the cause in a general sense (meaning that I believe black lives matter and need to be treated as though they do), but I think the movement’s way of going about ensuring that black lives are treated justly is so irrational.", "author": "ziriani", "created": 1629602998, "upvotes": 1}}}