{
  "sid": "qpta53",
  "link": "/r/CollegeRant/comments/qpta53/does_anyone_else_feel_like_college_is_nothing/",
  "title:": "Does anyone else feel like college is nothing like they imagined?",
  "text": "Almost done with my first semester of freshman year. It's been good, but I can't help but feel like my social life has taken a dive lately. I have a lot of acquaintances and people I talk to in my classes, but I have 3 main friends. Lately, it seems that my 3 friends have been super busy with work and school and other situations, and I've been eating meals by myself a lot. They all live a lot closer to the school than I do, and they usually all disappear and go home on weekends. Don't get me wrong, I'm enjoying school but I always imagined myself having a ton of friends during college but it seems like I spend the majority of my time by myself.",
  "author": "aquaderbian",
  "created": 1636423762,
  "updated": 1636656352,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 1.0,
  "comments": {
    "hjw3fqh": {
      "link": "/r/CollegeRant/comments/qpta53/does_anyone_else_feel_like_college_is_nothing/hjw3fqh/",
      "text": "I never had a social life",
      "author": "ThicccPanta",
      "created": 1636427915,
      "upvotes": 10,
      "replies": {}
    },
    "hjyim1e": {
      "link": "/r/CollegeRant/comments/qpta53/does_anyone_else_feel_like_college_is_nothing/hjyim1e/",
      "text": "You are doing better than you think trust me!",
      "author": "hazelnutlattee",
      "created": 1636478755,
      "upvotes": 3,
      "replies": {}
    },
    "hk15mtb": {
      "link": "/r/CollegeRant/comments/qpta53/does_anyone_else_feel_like_college_is_nothing/hk15mtb/",
      "text": "For me it’s partly because of Covid. I thought when I came back it was gonna be like leaving a prison but I just feel like I’m stuck at prison only this time I get to go to school. Everything closes early, until a week ago, I got night terrors, and I never get to see any of my friends. I could barely see my boyfriend because of the lockdowns and I can’t have him in my dorm because my school has a no visitor policy.",
      "author": "CapriciousSalmon",
      "created": 1636519659,
      "upvotes": 2,
      "replies": {}
    }
  }
}