{
  "sid": "qpqdni",
  "link": "/r/CollegeRant/comments/qpqdni/group_work_sucks_and_none_of_my_group_members_do/",
  "title:": "Group work sucks and none of my group members do their job",
  "text": "We were assigned to give a 50 minute presentation in class. 50 minutes divided by 4 group members is 12.5 minutes, so we all decided to speak for 12-13 minutes each. We all established this beforehand and we all agreed on 12 minutes. Day of the presentation comes, the first presenter does his job and speaks for 13 minutes, the second presenter (me) does their (my) job and speaks for 12 minutes. Then, the third presenter screws us all over and speaks for 2 minutes. The last presenter spoke for 8 minutes, which is pretty bad as well, but better than 2 minutes. How does one agree to speak for 12 minutes but then speak for 2 minutes?! That is a joke.\n\nOur presentation ended up lasting 35 minutes (13 + 12 + 2 + 8) instead of 50. I feel like my grade is going to suffer. The first presenter and I are going to speak with the professor about this to hopefully avoid being penalized for our group members' lack of work. All I can say is F this.",
  "author": "ilovejuiceandbeans",
  "created": 1636414631,
  "updated": 1636656354,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "hjwib39": {
      "link": "/r/CollegeRant/comments/qpqdni/group_work_sucks_and_none_of_my_group_members_do/hjwib39/",
      "text": "Grading presentations based on time and not content is pure garbage. That class sounds like one helluva headache.\n\n&#x200B;\n\nOne reason why I don't like group work is because sometime I can be that bad group member. Some of my other classes require most of my time, and I tend to put off a group assignment because I always have something else due that day, or the next. Disappointing people and making it hard on them is not my intent, its just that workload can take attention away from that.",
      "author": "Careful-Relation-322",
      "created": 1636435388,
      "upvotes": 1,
      "replies": {}
    }
  }
}