{"sid": "og76nl", "link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/", "title:": "Is it just my bad luck or are colleges extremely bad at giving language classes?", "text": "Everything is taught too fast, not all parts are equally well taught for the students, the resources given are also most often than not not enough for them to pass... and what's worse, the requirements to pass are almost always too unreasonable given all of what was said before.\n\nIn my German class there's an insane amount of people who haven't been able to pass, and the level in general is usually quite low, yet no one considers this unusual or worrysome (theachers and so on, the students are completely powerless in this regard).\n\nWhy is this the case?", "author": "bhlogan2", "created": 1625750837, "retrieved": 1632950793, "over_18": false, "upvotes": 129, "upvote_ratio": 0.99, "comments": {"h4m1l3a": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4m1l3a/", "text": "My school treated heritage Chinese as a dumping ground so half of the students had zero knowledge of Chinese but got assigned there anyways because they had Chinese last names, another portion was really lazy international students, and another portion was people that really belonged in the non-heritage track but they ran out of space so here you are. \n\nProfessor had a hard time to say the least", "author": null, "created": 1625851227, "upvotes": 1}, "h4iei71": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4iei71/", "text": "If your goal is to learn a language, dont take language classes for credit unless it's required and/or part of your degree; i.e. dont take it for fun.\n\nI took a language class for fun before but it was not fun. I realized that holy shit, this is going too fast for me and it's going to affect my gpa. \n\nThe fun is ruined because now, for example, you are expected to have a deep discussion about the existence of God and the origins of the universe with Jorge using Spanish by next Monday which will be 30 percent of your final grade. \n\nLike holy fuck. I just learned \"donde esta el baño\" last fucking week.", "author": "lguy4", "created": 1625774021, "upvotes": 4}, "h4iav37": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4iav37/", "text": "I took spanish in college and for Spanish II the professor, who was from mexico and was supposedly a native speaker, hardly knew anything. His response to most questions people in class would ask would be “I don’t know”. He just ready straight from the textbook or played a movie dubbed in Spanish the whole semester and no one actually learned anything.", "author": "Jdenney71", "created": 1625772343, "upvotes": 3}, "h4i6rmh": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4i6rmh/", "text": "Yup, I think that it’s this weird thing where they want you to have a good handle of the language by the time you complete the course progression, however there is not enough time to do so so they just throw everything at you and whatever you retain you retain. I think for people to truly master the language they would have to make it a 6 semester thing and dilute it rather than an intense 3 semesters but not many people are willing to do that so they stuff everything into a shorter course load while still expecting more. In my experience there was also a very heavy emphasis on grammar and in the US we don’t really teach grammar well enough, we don’t understand why our language is the way it is we just implicitly know what is correct without knowing why so when you learn another language you are also compensating for your lack of understanding of english", "author": "Visible_Negotiation4", "created": 1625770522, "upvotes": 1}, "h4i1soo": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4i1soo/", "text": "YES. it’s absolutely insane. I took AP Spanish in high school + honors (so 12 years total) and am very good at it and took basic entry level Spanish in college just to get an easy A (failed my placement exam on purpose). I couldn’t believe the stuff they were teaching the beginners. It was so fast paced and people were literally failing every exam. How could you make someone who barely knows any vocabulary start conjugating verbs? The amount of stuff that took me 12 years to learn was being forced upon people with 0 experience and I found that crazy", "author": "procrastinatinq", "created": 1625768336, "upvotes": 4}, "h4hwydf": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4hwydf/", "text": "The Spanish classes I had were pretty atrocious at my university. It was no surprise to me when I heard that the foreign language department was mere moments from being shut down entirely were it not from some donor stepping in and helping out. Due to a stupid technicality I had to take entry level Spanish twice, and thankfully the first time I took it was at a community college where the class was actually really fucking good. That carried me through the first semester and the second semester was a clusterfuck because they rushed the fuck out of past and future tenses but I managed to get by with a B. I actually feel confident speaking the language at a super basic level thanks to the first class. Don't ask me to speak out of present tense, though!", "author": "Eighth_Octavarium", "created": 1625766214, "upvotes": 5}, "h4hmkgt": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4hmkgt/", "text": "My German class was incredibly easy. I kept going and graduated with a minor. As long as you tried you got an A", "author": "wolfy321", "created": 1625761720, "upvotes": 1}, "h4hhgth": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4hhgth/", "text": "I had to take a foreign language as a gen-ed requirement. I took Spanish, since I had taken Spanish in middle and high school.\n\nThe class was a carbon copy of what my high school Spanish courses were like. I learned absolutely nothing new. I got a B, but a lot of people in my class did not do as well.", "author": "jlm2299", "created": 1625759512, "upvotes": 15}, "h4he7zj": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4he7zj/", "text": "Yeah. I took three years of spanish in high school and had a pretty good grasp of it then. I wanted to pick it back up a few years later in university and took spanish 102 where I realized the 3 years of spanish I learned was taught in span 101 and 102. It went way too fast and the only reason I did decently was because I had learned stuff a few years ago and just needed to refresh my memory. I knew someone in spanish 101 who knew nothing about spanish and he said it wasn't helpful at all and he'd just try to get through the assignments as quickly as possible and then self study spanish to actually learn it.", "author": "mypuppyisamonster", "created": 1625758077, "upvotes": 10}, "h4h10rf": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4h10rf/", "text": "Yeah, I took Italian and it was meant for people with little to no exposure to the language. Day one of class, no English speaking in the class and only speak in Italian. I was pretty blown away thinking did my dumb @ss register for a native speaking Italian class? Nope, it’s just how the department conducts their intro classes. Luckily there were some similarities to Spanish as I am a native speaker so I felt that helped. My girlfriend who isn’t (she’s Irish) took intro to Spanish and they conducted the class the same way. I think maybe schools consider most students who are taking languages are those that are familiar with it or are continuing on from what they took in high school. IMO that sucks to conduct a class that way since someone completely new to the language might struggle a bit but it sure does force you to learn quick to keep up.", "author": "XenOz3r0xT", "created": 1625751956, "upvotes": 71}, "h4h0e82": {"link": "/r/CollegeRant/comments/og76nl/is_it_just_my_bad_luck_or_are_colleges_extremely/h4h0e82/", "text": "It could be that the courses are based on an expectation that students coming in already have a certain base level of knowledge, and if they don’t, the students need to put in extra work as the professors don’t have time to reteach what should already be known on top of everything else. If the issue is with the same department’s lower-level courses, then they need to evaluate how those courses are taught and adjust them. If the issue is with other universities or area high schools, then they may want to consider some kind of entrance testing if they have expectations for a base level before entering a course.\n\nThis kind of thing happens all the time in areas like math, and even in marketing (my field), we see students who should have already learned certain things who appear to have never even heard of them. Part of that is due to siloed learning and folks not connecting the dots across courses, but another part of it may just be differences in what’s expected vs. what’s delivered.", "author": "PhDapper", "created": 1625751642, "upvotes": 8}}}