{"sid": "kny6f6", "link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/", "title:": "For anyone who struggled / is struggling this semester, don’t be too hard on yourself.", "text": "It’s literally a pandemic. We were unfairly put through hell in our classes this semester. At this point, it is what it is. Don’t be to hard on yourself, and focus on doing better or seeking help for next semester. You’ve got this!!\n\nP.S. If it helps, I’m a CS major in my last year. Don’t hesitate to reach out to me for help if you’re a fellow CS major!! Or if you just want to vent.", "author": "GentlyWeepingGuitar_", "created": 1609449105, "retrieved": 1632842800, "over_18": false, "upvotes": 247, "upvote_ratio": 0.99, "comments": {"gi098fq": {"link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/gi098fq/", "text": "I’m a senior and have failed entirely the fall semester and honestly idc if I graduate on time anymore. My mother was in the hospital from October to December and that what made me throw off the semester. She still not herself as she is in rehab but being with covid not allowed to see her. Idk if I’m even in the mood to attend school next semester and classes start on the 27th. Might just take off and go in the summer and fall", "author": "twalton18", "created": 1609715462, "upvotes": 2}, "ght6rph": {"link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/ght6rph/", "text": "This was my first semester at a four-year university and it was shit. My GPA dropped to a 3.0. Goodbye, honor roll.", "author": "iamsojellyofu", "created": 1609574933, "upvotes": 1}, "ghpkuxq": {"link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/ghpkuxq/", "text": "I did awful in my midterms because we needed to have a camera on that monitor us as we take the exam and it gave me severe panic attacks and anxiety. I am so disappointed.", "author": "MelissaArt94", "created": 1609507899, "upvotes": 3}, "ghomw4b": {"link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/ghomw4b/", "text": "Thank you ♥️", "author": "Emotional-Shirt7901", "created": 1609484174, "upvotes": 2}, "ghojvxk": {"link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/ghojvxk/", "text": "I really needed this reminder. I was looking at my grades as if it were a \"normal\" semester and was really getting down on myself. But we all know too well it was not a normal semester and it's okay if we struggled. Good luck to everyone and may this new year be better!", "author": "bullerbyn9yo", "created": 1609481578, "upvotes": 3}, "ghohj5l": {"link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/ghohj5l/", "text": "Yea man i fucked so many classes this sem. I barely learnt anything. I was stoked to start classes but i just lost interest over time. Hopefully its better next sem", "author": "urdealerbruh", "created": 1609479670, "upvotes": 3}, "ghoc4or": {"link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/ghoc4or/", "text": "Did you have to take Advanced Algorithms, I just finished Data structures and Algos this past semester and even though I passed I’m a little scared to take Advanced algorithms.", "author": "_D_4_C_", "created": 1609475445, "upvotes": 2}, "gho9fgp": {"link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/gho9fgp/", "text": "I don’t have stellar grades but I was happy that I was working up to a 3 GPA... I wasn’t there yet but that’s my end goal. I thought I was continuing my upward GPA trend but I got back all my grades a few days ago any my GPA actually went slightly down. I’m so pissed with myself because I got an A in a 4 credit physics class, but the Cs in my other classes this semester dragged my GPA down. It’s rough.", "author": "kittypwitty", "created": 1609473502, "upvotes": 3}, "gho7hmq": {"link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/gho7hmq/", "text": "This is much appreciated and needed!\nWish everyone all the best. Stay strong.", "author": "sulibood", "created": 1609472127, "upvotes": 13}, "gho3ftz": {"link": "/r/CollegeRant/comments/kny6f6/for_anyone_who_struggled_is_struggling_this/gho3ftz/", "text": "I’m so disappointed because I thought I could do school and I had good grades at midterms and then just stopped caring -> because Why care when I see so much injustice in the world?", "author": "Buffh", "created": 1609469341, "upvotes": 22}}}