{"sid": "lqwphs", "link": "/r/CollegeRant/comments/lqwphs/my_favorite_part_about_doing_exams_using/", "title:": "My favorite part about doing exams using monitoring browsers...", "text": "TL;DR my neighbors have a very active sex life that the microphone picks up and records every time do an exam.\n\n&#x200B;\n\nEvery. single. time. I do an exam my neighbors decide it's the perfect time to bang.\n\nAnd they do so really loudly.\n\nFor Christ's sake, do you know how awkward it is to be trying to do an exam with loud sex noises in the background that the microphone is definitely picking up? Almost every time I wind up typing some bullshit and submitting the exam way too early because it's just too awkward.\n\nJust let us use take home exams that don't require monitoring.", "author": null, "created": 1614123564, "retrieved": 1632951390, "over_18": true, "upvotes": 52, "upvote_ratio": 0.96, "comments": {"gol5tte": {"link": "/r/CollegeRant/comments/lqwphs/my_favorite_part_about_doing_exams_using/gol5tte/", "text": "My professor now has a recording of me shouting at the dog for eating my pillows since she records the screen/me/sounds. Def gonna have to agree that if they insist on doing it this way, they'll have to deal with that we deal with. Though it sucks to have that distraction there and I ended up turning in my exam way too early too", "author": "Manateebee31", "created": 1614178638, "upvotes": 5}, "gok4d5x": {"link": "/r/CollegeRant/comments/lqwphs/my_favorite_part_about_doing_exams_using/gok4d5x/", "text": "That's fucking hysterical!\n\nBut also shitty, for the reasons you mentioned.", "author": "ThereIsNo14thStreet", "created": 1614149969, "upvotes": 8}, "goj6v00": {"link": "/r/CollegeRant/comments/lqwphs/my_favorite_part_about_doing_exams_using/goj6v00/", "text": "Honestly, if they want to do the Big Brother shit and creep in on our lives, I say they deserve to hear exactly what that entails. No sympathy for those professors lol", "author": "milo_2244", "created": 1614130098, "upvotes": 44}}}