{"sid": "ocef87", "link": "/r/CollegeRant/comments/ocef87/norton_inquizitive_is_shit/", "title:": "Norton Inquizitive is shit", "text": "If you ever had to take class quizzes on this website then you know that it is the most stressful, most rage inducing quiz site I have ever been on in my entire life.\n\nFor starters we know how how quizzes and test work. For a regular test/quiz if you get 15/20 questions correct, for an example, then your score would be a 75%. Or like the SAT, there is a max score you can get, if you get a question right then you gain points, if you get a question wrong then you gain zero points. \n\nIn Inquizitive however, you can gain points in a question you got right but for the next question is you get it wrong you lose points that you gained from the previous question. It gives you a second chance to get the question right to gain half the points back. But the enraging thing is I shouldn’t be loosing points like that in the first place. Get question 1 right (+100) get second question wrong (-100) and you’re now back to 0.\n\nIt honestly wouldn’t be that bad if the vast majority of questions weren’t drag and drop that have multiple answers. There can be a drag and drop question that has 10 answers, you can get 9 correct but god forbid you get the last one wrong you will still loose all the points that you could’ve gained. You can’t even get 90% of the points, you just lose everything.", "author": "freewilli2509", "created": 1625245480, "retrieved": 1632842142, "over_18": false, "upvotes": 16, "upvote_ratio": 1.0, "comments": {"h3tqpp4": {"link": "/r/CollegeRant/comments/ocef87/norton_inquizitive_is_shit/h3tqpp4/", "text": "Thank you u/freewilli2509 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1625245480, "upvotes": 1}, "hee9y09": {"link": "/r/CollegeRant/comments/ocef87/norton_inquizitive_is_shit/hee9y09/", "text": "Dude, I hate Inquizitive with a passion. Sure, it makes it \"fun\". But do you know what's not fun? LOSING POINTS BECAUSE YOU HAVE TO READ A FEW PAGES WORTH OF TEXT TO ANSWER A SINGLE QUESTION!", "author": "lowrcaseletters", "created": 1632691269, "upvotes": 1}, "h3ui0ug": {"link": "/r/CollegeRant/comments/ocef87/norton_inquizitive_is_shit/h3ui0ug/", "text": "YES my inquizitive course had this stupid cyclops mascot mother fucker, i hate him i hate his stupid face and i hated inquizitive LMAO", "author": "soupysyrup", "created": 1625257116, "upvotes": 4}}}