{"sid": "ni720y", "link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/", "title:": "College is more than a full-time job! Plus a lot of us work!", "text": "I swear a whole chunk of my family doesn't understand that I can't just drop what I'm doing now that I'm not a kid who can just be dragged wherever. There is no paid vacation time in college or during my seasonal internships. I've been working from home and learning from home. I know it looks like I'm lounging around on my laptop, but I'm actually trying to get stuff done. I do have free time and holidays, of course, but do they coordinate with me? nooo.\n\nMy parent planned a trip to Orlando back in the Fall for June and I said that I can't do those dates, also Covid. And he was like, well I'm just letting you know. Passive-aggressive much. Now he keeps trying to guilt me but it's just coming off detached from reality. Literally the most crowded hottest time to go to Florida right now with people itching to get out of quarantine.\n\nMy aunt literally was texting me about how my cousin, who is the same age, also has a full-time internship and is going. Again very passive-aggressive. Talked to my cousin. Turns out her start date is *after* the trip. Even my cousin was like there's no guarantee she won't have to leave halfway through. Are all older adults this detached from reality? Also, the aunt lives like an hour from the hotel while I'm like two states away, so I have to figure out transportation and meals, but I'm welcome to squeeze in with 4 generations of people at the hotel for free and work for 8 hours a day while they roam around because *family*\n\n**TL:DR** Think that older adults near retirement age just don't have a concept of what it means to be a college student these days\n\nedit: I'll add that I said I'm not going months ago, and this is what they're bothering about this week. There is something cathartic yet troubling about how many of us are in the same wobbly boat, just trying to balance ", "author": "odgoodli", "created": 1621644274, "retrieved": 1632842335, "over_18": false, "upvotes": 360, "upvote_ratio": 0.99, "comments": {"gz08uu8": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz08uu8/", "text": "Thank you u/odgoodli for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1621644274, "upvotes": 1}, "gz7w4o8": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz7w4o8/", "text": "I feel like they also don’t understand that the term is more than just finals? I’m on the quarter system so we basically have an exam every other week. Every single time I have to study I hear “AGAIN????!! Didn’t you just take an exam” and then following the exam I hear “oh good, so you’re all done now!” No, absolutely not, I immediately have to start working on the next exam material. It’s like they think all of college is one or two exam days and that’s it, totally missing that it’s like a 50+ hour a week time commitment with lots of roadblocks along the way.", "author": "tallnsalty", "created": 1621814516, "upvotes": 1}, "gz2pdj3": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz2pdj3/", "text": "It's not that they don't understand they just don't care. They think their plans are so important that it comes before your schoolwork. If they were in the same position they'd either do the same thing or do the opposite and suffer actual consequences. If you go with them and shit the fan they'll most likely just say you're irresponsible for not finding a way to make it work out for THEM. Just do you and tell them if they're gonna keep guilting you that you have nothing to talk about because your decision is final. Part of being an adult is being responsible and sometimes not doing something you really want to. Them saying otherwise looks pretty bad on them", "author": "DontcheckSR", "created": 1621704627, "upvotes": 7}, "gz2i0xt": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz2i0xt/", "text": "Just say no.", "author": "orangeblackteal", "created": 1621701033, "upvotes": 1}, "gz2bef6": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz2bef6/", "text": "My family is driving me crazy with this. I was lucky enough to be in person but we had a couple weeks where I was home full online. My first finals week was online and I was home. Not only did I get a ton of shit for trying to leave so I can study (there are 6 people in my house, plus animals) but it took me a while durning my chem final. My mom got all pissed off because I should know how long they will be. I'm reality, she wanted me to take the car durning her lunch break so I could run errands for her. Even now, I'm trying to get some stuff figured out since I need a summer class and she took my computer with her so I wont just be sitting around doing nothing.", "author": "randomfandoms2001", "created": 1621697630, "upvotes": 1}, "gz1xytg": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz1xytg/", "text": "My family is exactly like this as well with the exception of my mom. She’s planning a vacation this year since we all got vaccinated and is ensuring that it’s not during the same time as my internship. My dad’s side however are trying to guilt trip me into seeing them the first week in June which is literally the first week of my internship and they’ve known that since March. My dad’s family are also the same ones to complain because it’s taken me longer than usual to get my bachelor’s and I’m trying to take summer classes to make up for switching my majors later. \n\nMy mom told me to just ignore them because if they can’t give me a guaranteed internship and aren’t  paying my tuition then their opinion has zero value and is worth all shit that comes out of their mouths.", "author": "inconspicuousmarvel", "created": 1621690373, "upvotes": 9}, "gz1ech6": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz1ech6/", "text": "My mom doesn’t get why I won’t get a job in college besides something just to have spending cash. College is basically a full time job plus unpaid work. I tried to work full time on top of college but I never had any free time.", "author": "CapriciousSalmon", "created": 1621674033, "upvotes": 2}, "gz1ec7i": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz1ec7i/", "text": "I was guit tripped into going to my brother's graduation, me doing a final on a laptop in a hotel with my parents snoring like help", "author": "Turtleisim", "created": 1621674025, "upvotes": 6}, "gz195l0": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz195l0/", "text": "I feel that on a deep level. Mom started making summer plans and I was just like hum... I don't know if I can go because I work and I am writing my thesis so my time is a bit stretched and she's just like \"Oh it's okay just take your computer with you", "author": "AlthaeaAmakiir", "created": 1621668835, "upvotes": 13}, "gz17g59": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz17g59/", "text": "Yes, I feel like older adults who have full-time jobs that don’t require them to do anything outside their work hours (like it’s the case for both of my parents) truly don’t understand how time-consuming being a student is. I am a full-time student with a part-time job and my mother doesn’t understand that yeah, technically no one was forcing me to study during Easter brake this year, but I had a huge exam right after the break and simply couldn’t drop everything and go with her for a family-visiting tour. I don’t think working adults understand that with university it’s so much more difficult to have those precise borders between free time and work time, where you can schedule for things way ahead, because work often spills over your free time and you simply are unable to tell how much it’s going to take to finish something.", "author": "neshoba77", "created": 1621667204, "upvotes": 20}, "gz15h0n": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz15h0n/", "text": "I agree. My mom forced me to delay my internship start date so I could visit my sister across the country for a week. I love my sister but I don’t think either of us cared if I visited, but my mom was very insistent about me coming. What’s worse is she decided to plan this like a month before hand.", "author": "cabbage-soup", "created": 1621665427, "upvotes": 2}, "gz0xgdc": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz0xgdc/", "text": "Ugh, I feel like people also don't understand what an extra burden it is to be doing online university/ learning from home right now, either. I feel half as productive and everything takes me three times as long. Before I went to work and school and dealt with things as they came up, went to class, and if I needed extra time I went to the library, but doing it from home there is ALWAYS a distraction and everyone wants your attention because you're just sitting there anyway. It takes me a whole hour to ease into any task from home and then by the time I hit my stride someone distracts me.", "author": "xaxathkamu", "created": 1621658868, "upvotes": 12}, "gz0su8j": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz0su8j/", "text": "FOR REAL. \n\nI have two exams this weekend plus several assignments due by Monday AND an essay I’ve barely started on.\n\nMy family has been bugging me to visit my sister (who lives out of state) because it’s my nephew’s birthday and they’re throwing him a party. \n\nMy nephew is autistic and he really wants me there, so my absence is going to stress him out big time. But I literally can’t. I have so much to do this weekend I could cry. \n\nEveryone in my family is guilt-tripping me like crazy and making me feel like this selfish demon but I just can’t freaking do it. \n\nThe last time I went up there for a visit I could barely get a single thing done. \n\nThis semester has been the hardest yet. It’s almost over. I can’t undo all the hard work and effort I’ve put into it when I’m so close to the finish line.", "author": "reinakun", "created": 1621655871, "upvotes": 50}, "gz0ry43": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz0ry43/", "text": "surprisingly it’s not just the older generation, people in our generation don’t understand either. I have an internship monday through friday this summer every week until the end of august. my friends are planning to go on vacation in the middle of july and keep questioning me when i say i don’t think i can go. Just like you said, this is a full time seasonal role so i cant just take off! I don’t get why people don’t understand this", "author": "DisciplineCautious84", "created": 1621655340, "upvotes": 25}, "gz0mm88": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz0mm88/", "text": "Yeah. It's bad enough to have to miss out on family stuff, the guilt tripping is just excessive. :/", "author": "caracarakite", "created": 1621652133, "upvotes": 40}, "gz0fpdi": {"link": "/r/CollegeRant/comments/ni720y/college_is_more_than_a_fulltime_job_plus_a_lot_of/gz0fpdi/", "text": "I totally get this! Just the other day, my cousin was talking about getting married in the summer and I have been working my ass off with school and with work. Anyways, my mom wants me to go, but her wedding date falls on a day where I have a huge exam and work. Plus, I have to do well in this class or it will bring down my GPA and my scholarship goes out the window. I swear families don't understand how much a priority college really is. You can go on vacation any other time when you're not in school. They're just going to have to realize that your education comes first above all else. Plus it's not that they don't understand, but rather it's that they don't want to. Internships don't fall right out of the sky.", "author": "ItzAllPeachy", "created": 1621648145, "upvotes": 86}}}