{"sid": "ot35i0", "link": "/r/CollegeRant/comments/ot35i0/i_have_no_idea_what_im_doing/", "title:": "I have no idea what I’m doing", "text": "I’m completely at a loss for what to go to college for, I’ve thought about psychology or nursing and even a English degree to be a teacher. It’s really stressful to pick out a major and stick with it because I’m gonna be in debt for this so it’s not like I can say “Never mind I choose something else” I recently researched and thought about getting a bachelors in English and teaching abroad in Japan but I’m just worried I’ll never make it. I feel completely stuck & unable to decide what to do. Is there any degrees that are good for everything? Has anyone else had trouble choosing and if so, what did you end up going to college for? Thank you so much!", "author": "astrogardenn", "created": 1627448219, "retrieved": 1632841706, "over_18": false, "upvotes": 11, "upvote_ratio": 0.84, "comments": {"h6snytb": {"link": "/r/CollegeRant/comments/ot35i0/i_have_no_idea_what_im_doing/h6snytb/", "text": "Thank you u/astrogardenn for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1627448220, "upvotes": 1}, "h7lh4zf": {"link": "/r/CollegeRant/comments/ot35i0/i_have_no_idea_what_im_doing/h7lh4zf/", "text": "Hey! I would also like to add to try and get experience at local schools either through observation or subbing if you can! Teaching can be quite stressful at times working with young people (depending on if you want to work with infants or teenagers of course!) so I’d definitely recommend asking any teachers you know to talk about that career and if you’d suit it. I did an English degree and got accepted into a teacher training certificate (PGCE in UK) but I discovered that it was a lot harder emotionally and physically than I expected and would have needed more experience beforehand. Try find out about tutoring programs in your uni or college to see if that helps! \nAlso, psychology is very difficult as you’d need a PhD (LOTS of study) at this point to become a psychologist. It’s a stressful job and you’d be working with people who could have very difficult trauma and illnesses that could be upsetting to you. My friend works with prisoners who share with her awful experiences and thoughts. Though this isn’t always the case, it’s important to bear that in mind in case you go for that career route. \nNursing is in a similar boat of tiredness, studying, and in some countries, crap pay. \n\nTLDR \nI would say that if you don’t like careers in computers, engineering, languages, IT, trades, then go for the English degree and get the teaching certificate. The teaching diploma will be your in as it is a fantastic qualification for teaching abroad with and Japan loves to have people teach them English who are native speakers/ degree in English with the teaching qualification. Also everybody thinks their degree is a waste of money and time but it’s how you choose to use it determines that. Make good connections with your lecturers and other students, go to tutoring programs your school offers and you’ll be grand. Best of luck!", "author": "JollyJ0J0", "created": 1628022912, "upvotes": 2}, "h6svvc4": {"link": "/r/CollegeRant/comments/ot35i0/i_have_no_idea_what_im_doing/h6svvc4/", "text": "Since you don't know what you want to do, I'd recommend using the website studyportals.com/mastersportal.com. It's an online database that allows you to see different careers in many fields like the arts, medicine, architecture, ect.\n\nWith this, you can at least see what degrees are available to you in your country's universities. Maybe you'll find something you're interested in and work from there.", "author": "Inside-Improvement13", "created": 1627453856, "upvotes": 1}, "h6suhfm": {"link": "/r/CollegeRant/comments/ot35i0/i_have_no_idea_what_im_doing/h6suhfm/", "text": "First thing first, unless you have a nice scholarship to attend a university, go to community college. So the good thing about starting out in college is that your prerequisites will cover a nice broad area to give you an idea of what different subjects like engineering, computer science, and majors like that are like. I encourage you and everyone not knowing what major they want to do to do a liberal arts associates at a community college, which will also count toward transferring to uni, and hopefully by then you will have enough exposure to different fields to make up your mind.", "author": "divineInsanity4", "created": 1627452781, "upvotes": 9}}}