{
  "sid": "nk8ow1",
  "link": "/r/CollegeRant/comments/nk8ow1/growing_tired/",
  "title:": "Growing tired",
  "text": "All of this is my own fault, btw. Heading into yr 6 of undergrad and I’m just here to rant and hopefully get some tips about how to do better academically. I’m HS, I was the mid-tier AP try-hard (should have done ccp) and then went to a community college to save money and develop as an adult. Was super depressed my first year and fails a few classes. Long story short, it took me 3 years to graduate a two year program with a 3.6 gpa. Managed to get into my dream school studying material science and engineering but ended up getting dismissed because my work-life balance (I worked, and got super involved on campus) was horrible and I thought I could slide with the same work habits that have gotten me to that point. I got back in the following year and changed my major to biochem after discovering an interest for the research they do and how broad the spectrum of jobs are. This past semester, I buckled down, worked hard but only managed to get the grade I wanted in 1/4 of my classes (had to pass/fail the others, though I was close to a C- in two of the three). I just feel like I’m never g",
  "author": "The_LostandFound",
  "created": 1621891117,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "gzgfd71": {
      "link": "/r/CollegeRant/comments/nk8ow1/growing_tired/gzgfd71/",
      "text": "Drop out but this is my view.\n\nYeah can't let those study habits drop because the classes only get harder with more reading (have to either read all or filter the important ones). \n\nIt feels horrible having to compare but it makes sense since we're competing with other people. I read as long as you go at your own pace while making consistent effort and discipline it goes a long way. \n\nr/getdisciplined I find is a great resource to find advice posts on how to adapt and overcome hardships. I sort by top and google keywords + reddit.",
      "author": "executordestroyer",
      "created": 1621988500,
      "upvotes": 1,
      "replies": {}
    },
    "gzdktxr": {
      "link": "/r/CollegeRant/comments/nk8ow1/growing_tired/gzdktxr/",
      "text": "Okay, but you also accomplished so much. You graduated CC with a great GPA, got into your dream school, did a tough ass major while working AND being involved on campus, which are both big accomplishments, and found your passion. All of those things mean a lot and some unsatisfactory grades don't take that away from you",
      "author": "ripprinceandrey",
      "created": 1621939285,
      "upvotes": 5,
      "replies": {}
    }
  },
  "updated": 1634062763
}