{
  "sid": "q19v9x",
  "link": "/r/CollegeRant/comments/q19v9x/cant_stop_eating_candy_any_advice/",
  "title:": "Can't stop eating candy, any advice",
  "text": "Im studying right now but honestly between work and school and a little reddit here and there I don't have much time for anything else. Even tiktok I don't watch nearly as much as I used to. \n\nI feel like there is this hole inside me, I think im lonely and miss being with friends and I think im trying to fill that hole with candy. I always be like \"oh im gonna stop eating candy for a month\" and then buy it the next day because im craving it. Not sure what to do. Maybe if more of my classes were in person or I had more freedom and free time I wouldn't be this way. \n\nWell it can also be lack of self control too",
  "author": "TheRapidTrailblazer",
  "created": 1633367387,
  "updated": 1634093877,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hfdopdy": {
      "link": "/r/CollegeRant/comments/q19v9x/cant_stop_eating_candy_any_advice/hfdopdy/",
      "text": "are you eating any real food? any satiating food? i tend to binge on candy and the like when i’m hungry and not getting that need met. \n\ndo you have a meal plan or do you cook for yourself? i think even just getting takeout can help in my experience because i get full after.",
      "author": "crazyhow",
      "created": 1633371102,
      "upvotes": 1,
      "replies": {}
    },
    "hfpubjd": {
      "link": "/r/CollegeRant/comments/q19v9x/cant_stop_eating_candy_any_advice/hfpubjd/",
      "text": "What type of candy? Maybe if you substitute it or buy like a better/expensive version of a candy, you would be less inclined into having more of it. Also you could try harder to eat candy like toffee and/or tootsie rolls. \nIf what you crave is sugar, you can buy the packets but only the small ones. It would get tiresome having to go back and forth the store to keep buying.",
      "author": "darkaquamarine007",
      "created": 1633607100,
      "upvotes": 1,
      "replies": {}
    }
  }
}