{"sid": "n2n31y", "link": "/r/CollegeRant/comments/n2n31y/so_lonely_i_dont_even_have_a_crush_any_more/", "title:": "So lonely I don't even have a crush any more", "text": "Next year will be my fifth and final year of college.\n\nI never really found my group of close friends or had a girlfriend or anything. The acquaintance level friends I did have basically all graduated this year.\n\nNow I'm just realizing that after not seeing anyone in person for more than a year, as much as I want a girlfriend I don't even have a crush on anyone any more.\n\nJust feels like a new level of loneliness to me. Because when you have a crush, at least you have someone to think about and talk to and plan next steps with. When you don't even have that, it's just... even lonelier.\n\nJust wanted to get it off my chest. Hopefully next year will be better and I'll make some friends and stuff.", "author": "agentp2319", "created": 1619890419, "retrieved": 1632843441, "over_18": false, "upvotes": 48, "upvote_ratio": 0.98, "comments": {"gwkb0uj": {"link": "/r/CollegeRant/comments/n2n31y/so_lonely_i_dont_even_have_a_crush_any_more/gwkb0uj/", "text": "Thank you u/agentp2319 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1619890420, "upvotes": 1}, "gwmq5ee": {"link": "/r/CollegeRant/comments/n2n31y/so_lonely_i_dont_even_have_a_crush_any_more/gwmq5ee/", "text": "Learn to love yourself king :) While relationships are great for us social creatures, they also require tons of energy and time. Once you have a great relationship with solitude, everything else will fall in line. This isn't me saying go completely ghost on everyone though haha", "author": "Sendmeyourfavorite", "created": 1619936190, "upvotes": 4}, "gwma0uh": {"link": "/r/CollegeRant/comments/n2n31y/so_lonely_i_dont_even_have_a_crush_any_more/gwma0uh/", "text": "(this is my opinion) friends arent everything.", "author": "matsudasociety", "created": 1619924774, "upvotes": 1}, "gwlhxvg": {"link": "/r/CollegeRant/comments/n2n31y/so_lonely_i_dont_even_have_a_crush_any_more/gwlhxvg/", "text": "Meh. Focus on yourself. Think of this as a freedom from codependency. I get lonely all the time but I also acknowledge that I've had difficulties with blatant codependency so the isolation can be somewhat good for me and others. At least in part", "author": "Almonsp", "created": 1619908989, "upvotes": 6}, "gwl8h7f": {"link": "/r/CollegeRant/comments/n2n31y/so_lonely_i_dont_even_have_a_crush_any_more/gwl8h7f/", "text": "On average how many classes did you take each semester?", "author": "Tomtheslom1", "created": 1619904838, "upvotes": 1}, "gwkh0ab": {"link": "/r/CollegeRant/comments/n2n31y/so_lonely_i_dont_even_have_a_crush_any_more/gwkh0ab/", "text": "I'm in the same boat as you - I only had my first semester on campus and then covid happened. I'm going into my junior year with no friends lol.", "author": "unknownmeadow", "created": 1619892920, "upvotes": 18}, "gwkbzpc": {"link": "/r/CollegeRant/comments/n2n31y/so_lonely_i_dont_even_have_a_crush_any_more/gwkbzpc/", "text": "Having someone love you is truly a blessing and a romantic bond makes you feel like you have a perennial warm fuzzy blanket wrapped around you shielding yourself from everything wrong when they show their care for you. Their smell and a warm hug is all you need as medicine. I see what you mean when you say that you want a girlfriend that bad. HOWEVER. Trust me, having a crush on someone and seeing that person going out with someone else and not giving two shits about u is even worse. I understand where you are coming from because I was there not too long ago but when I finally did fall in love and it didn’t work out the way I wanted it to... it is a whole different kind of hell. Maybe it is because I find it harder to get over people and it’s been a whole year and yet I am exactly where I was a year ago. I have lost weight, I have become an insomniac... it is pathetic. When I was single and did not have a crush, did not know how it feels to be in love and feel loved (even if for a bit) I was much happier, you could call it blissful ignorance perhaps. I wish you all the best brother.", "author": "Witty-Bowler9493", "created": 1619890823, "upvotes": 7}}}