{
  "sid": "pfxiql",
  "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/",
  "title:": "I’m going to end up getting exposed to covid",
  "text": "My university was doing really well handling covid cases until they suddenly decided that they didn’t want to acknowledge the pandemic anymore. Social distancing went away, cases are no longer tracked, and there are plenty of super-spreader “welcome back” events going on.\n\nI’ve had classes cancelled several times this week because the professors are getting sick. There’s no telling how many students have covid because nobody is keeping track anymore. We’re just occasionally told “don’t sit in that seat” because somebody tested positive for covid in an earlier class.\n\nI get it. I’m sick of covid. I just want a normal semester. Ignoring covid entirely and pretending that it doesn’t exist on campus isn’t the solution though. We still need to be cautious.",
  "author": "tlacct",
  "created": 1630513956,
  "over_18": false,
  "upvotes": 194,
  "upvote_ratio": 0.91,
  "comments": {
    "hbrkxj9": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hbrkxj9/",
      "text": "Guess what? We are all getting exposed to COVID no matter what, it's an endemic disease and it's here for the rest of human existence. Time to get used to that fact, your vaccination should keep it a mild cold at the absolute worst and many times it should prevent an infection from even happening.",
      "author": "Adam-Smith1901",
      "created": 1630897827,
      "upvotes": 1,
      "replies": {}
    },
    "hbafrn4": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hbafrn4/",
      "text": "I understand your concerns. I would be worried, too.\n\nIf it makes you feel better, I will share my friend's story. Over the past two years, she has been treating covid-19 patients every day; even those who had the Delta variant. The viral load she is exposed to is many times more than you and I are exposed to.\n\nOf course, she received two doses of the vaccine, but she attributes her safety to double-masking through it all. *One single-use mask underneath and one cloth mask over it, both fit properly over the nose bridge and under the chin.* \n\nSo if you are fully vaccinated and you are double masking, you will be safe.",
      "author": "aloudkiwi",
      "created": 1630567838,
      "upvotes": 2,
      "replies": {
        "hbbei9p": {
          "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hbbei9p/",
          "text": "double masks dont work stop LOL",
          "author": "dman_usa",
          "created": 1630590999,
          "upvotes": -2,
          "replies": {
            "hbrl5sl": {
              "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hbrl5sl/",
              "text": "Single ones don't work either",
              "author": "Adam-Smith1901",
              "created": 1630897947,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hba2s2g": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hba2s2g/",
      "text": "My school just informed us that they aren’t doing contact tracing and professors are no longer allowed to change to online formatting due to outbreaks within the classroom. As someone who has health conditions that Covid can seriously fuck with, I’m terrified. I have a professor who is hosting a meeting with my class tomorrow night to see if we want to move online, but he isn’t going to be telling the school we’re moving online so we aren’t forced to stay in person. It’s terrifying and I can already tell this fall isn’t going to be going well.",
      "author": "Eeeeeeeeeeeeeek12",
      "created": 1630558330,
      "upvotes": 3,
      "replies": {
        "hblqd9s": {
          "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hblqd9s/",
          "text": "I'm in the same situation. I don't want covid due to health conditions (and also just not wanting to be sick?) and my college is convinced that we are in an endemic, not a pandemic (thanks to the governor). So they aren't taking any precautions and aren't even allowing virtual classes for those in quarantine. It's all so ridiculous.",
          "author": "NatashaBrightflower",
          "created": 1630784026,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hb9hie0": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb9hie0/",
      "text": "Do you go to TTU 😳😳😳🤣🤣🤣",
      "author": "Sharkattack970",
      "created": 1630547083,
      "upvotes": 1,
      "replies": {}
    },
    "hb97csg": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb97csg/",
      "text": "My school is the same. I went so far as to contact the provost bf essentially got a long, professionally worded ‘fuck you.’",
      "author": "Yori_R6",
      "created": 1630542462,
      "upvotes": 2,
      "replies": {}
    },
    "hb92tg3": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb92tg3/",
      "text": "Apparently, someone's freedom to spread infection is more important than my right not to be infected. I guess it's related to how other people's freedom to own/operate deadly weapons is more important than my right not to be terrorized by those weapons.",
      "author": "ProfAcorn",
      "created": 1630540276,
      "upvotes": 3,
      "replies": {
        "hbbe81h": {
          "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hbbe81h/",
          "text": "LUL wat",
          "author": "dman_usa",
          "created": 1630590875,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "hb926eq": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb926eq/",
      "text": "Thank you for this rant! Finally one without the strawman professor. \n\nThe shit getting dumped on us by the administration is so disheartening. We are not allowed to ask students if they have been vaccinated. We are not allowed to tell other students if someone in the class has contracted COVID. We and the students are notified only if we personally meet the standard for an exposure, which is less than 6 feet for 15 minutes within a single hour within a 24 hour period, and only then if the student reports this exposure to their doctor. With a class of 200 students who don't know each other, how the fuck are students supposed to tell their doctor who sat next to them for 50, or 75 minutes? \n\nMy institution is reporting 30 active cases out of 20,000 students and a meager 50% vaccination rate. They promised to do weekly tests of all unvaccinated students, but at week 3 they have done only 1,000 test of unvaccinated students with a 11% positive rate. Somehow 11% of 1,000 is 30? In reality there are more likely 1,100 positive cases on campus right now. The missing 80 active cases... they sent home!!! Home to their families, to get everyone else in their antivax circle sick. \n\nAmerica is ungovernable, we are all screwed.",
      "author": "titosphone",
      "created": 1630539946,
      "upvotes": 3,
      "replies": {
        "hb9im3d": {
          "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb9im3d/",
          "text": "I hear ya. While I'm not college level, keeping unvaccinated elementary kids apart while still doing the collaborative work expected and looked for on observations is a shit show.",
          "author": "TeacherLady3",
          "created": 1630547610,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hb8iexo": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb8iexo/",
      "text": "Same at my school here in Canada :(",
      "author": "nerdfighteriaisland",
      "created": 1630530410,
      "upvotes": 2,
      "replies": {}
    },
    "hb866th": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb866th/",
      "text": "This is so wrong...on so many levels. The university should be concern about this virus and it's variants...even though cases have been going down(I haven't checked cases in awhile so I don't know if it's changed) They should take this seriously.",
      "author": "Halomast123",
      "created": 1630525390,
      "upvotes": 3,
      "replies": {}
    },
    "hb8578h": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb8578h/",
      "text": "What school if you don't mind me asking? I feel maybe there should be a sticky for students to give real time info of what is going on at their colleges, universities, etc. regarding COVID and the amount of people getting sick, etc. \n\nMost I can say is double mask if you can and use hand sanitizer often, especially if you end up eating at school. Personally, my girlfriend and I won't be attending any school events that we know will draw crowds due to safety reasons. Even though my school has announced a strict mask on always policy, I know people will disobey or wear it wrong.",
      "author": "XenOz3r0xT",
      "created": 1630524991,
      "upvotes": 14,
      "replies": {}
    },
    "hb812sl": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb812sl/",
      "text": "Universities are run by pinhead technocrats who think problems are solved by technological advances, protocols, and abstract policy -- in this case, covid is over bc we have a vaccine, let's return to normal (and say it's because the \"students want to come back,\" utilizing the students, who are mostly ignorant of what's best for them, as a political football as they are always used)",
      "author": "big__cheddar",
      "created": 1630523320,
      "upvotes": 23,
      "replies": {
        "hb828hx": {
          "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb828hx/",
          "text": "Well, it’s that and also the fact they are getting daily calls from parents threatening them and also state Republican legislature threatening them.",
          "author": "GroveHere",
          "created": 1630523795,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "hb7w2ov": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb7w2ov/",
      "text": "Contact the President of your school. List your concerns.  Schools are making minute by minute decisions based on what's happening.",
      "author": "Petronella17",
      "created": 1630521264,
      "upvotes": 26,
      "replies": {}
    },
    "hb7ndd0": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb7ndd0/",
      "text": "Are you vaccinated? If so, you really have nothing to worry about.",
      "author": "Megadog3",
      "created": 1630517700,
      "upvotes": -15,
      "replies": {
        "hb7qzuc": {
          "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb7qzuc/",
          "text": "Well getting vaxxed doesn't stop someone from getting sick, it just stops them from getting horribly sick (*hopefully* asymptomatic) and reduces transmission*\n\n*granted only if the vaxxed person keeps themselves safe with measures taken before\n\nAnd then that's not foolproof anymore considering the Delta variant wasn't a varianted accounted for in the making of the vaccine (though the vaccine still has some good amount of coverage)",
          "author": "NoodleEmpress",
          "created": 1630519175,
          "upvotes": 12,
          "replies": {
            "hb9flgx": {
              "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb9flgx/",
              "text": "Ok and? If you’re vaccinated *and* you’re young (as I’m assuming the entirety of this sub is), then there’s literally no virtual way to be hospitalized from COVID, Delta or not.\n\nThe fear of getting sick if you’re vaccinated is like fearing walking outside because you have a 1 in 500,000 chance of getting struck by lightning. It’s foolish to fear at this point. \n\nIf OP is vaccinated and 18-22, he’ll be absolutely fine, even if he contracts COVID.",
              "author": "Megadog3",
              "created": 1630546181,
              "upvotes": 1,
              "replies": {}
            },
            "hb8dvsc": {
              "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb8dvsc/",
              "text": "It also protects you from getting sick. In the recent Massachusetts wave 1 person died out of what (of unvaxxed) should have been over 100. If I’m being honest here, who cares about getting a sniffle. We face viruses that do that every year. The flu isn’t zero risk, yet we don’t destroy our lives for it.",
              "author": "wolferdoodle",
              "created": 1630528496,
              "upvotes": -5,
              "replies": {}
            }
          }
        },
        "hb91x1s": {
          "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb91x1s/",
          "text": "I don’t understand what these doomers want. We have a vaccine, theres nothing else to do. Go back to normal like everyone else",
          "author": "uzeruzer",
          "created": 1630539813,
          "upvotes": -3,
          "replies": {
            "hb9evz5": {
              "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb9evz5/",
              "text": "For real though. It seems they just want the pandemic to go on forever. I’m not sure what they get out of it.",
              "author": "Megadog3",
              "created": 1630545854,
              "upvotes": 1,
              "replies": {
                "hbrlvgo": {
                  "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hbrlvgo/",
                  "text": "They are brainwashed, they watch CNN all day and get terrified of the numbers without putting them into context",
                  "author": "Adam-Smith1901",
                  "created": 1630898324,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hb7llxz": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb7llxz/",
      "text": "I feel ya. Welcome to America right now. Very frustrating. I'm guessing a lot of places are going to go fully online again.",
      "author": "real-nobody",
      "created": 1630516979,
      "upvotes": 80,
      "replies": {
        "hbbe2ud": {
          "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hbbe2ud/",
          "text": "i dont see it going back online ever again honestly students were robed of an education experience especially those who have learning disabilities like myself who hated the zoom classesd",
          "author": "dman_usa",
          "created": 1630590811,
          "upvotes": 8,
          "replies": {
            "hbblbxw": {
              "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hbblbxw/",
              "text": "Yeah that’s what I’m thinking. There would be too much of a damn uproar if they sent kids home again.",
              "author": "115machine",
              "created": 1630593907,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hb7klqb": {
      "link": "/r/CollegeRant/comments/pfxiql/im_going_to_end_up_getting_exposed_to_covid/hb7klqb/",
      "text": "thats really shitty :( do ur best to stay safe and i would keep some disinfectant wipes on you to wipe down the chairs and stuff, maybe wear some latex gloves when open doors and stuff too. stay safe!!",
      "author": "Aldrel_TV",
      "created": 1630516576,
      "upvotes": 16,
      "replies": {}
    }
  },
  "updated": 1634061943
}