{
  "sid": "qpqbas",
  "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/",
  "title:": "I HATE the idea of being perfect in college.",
  "text": "This is the cycle every semester:\n\n- Walk into the semester with a \"refresh\", aim for a 4.0 GPA.\n\n- Do homework, maybe struggle on some grades. Maintain hope.\n\n- Bomb a test after studying.\n\n- Grade drops, 4.0 is unattainable.\n\n- Feel unhappy for the rest of the semester as I try to pass through difficult classes (with a A or 2).\n\nI KNOW NO ONE IS EXPECTING PERFECTION. I KNOW A 2.0 IS ALL IT TAKES TO GRADUATE. I KNOW CONNECTIONS ARE MORE IMPORTANT, YET ANYTHING LESS THAN A 3.0 BOTHERS ME. I CAN'T KEEP DOING THIS TO MYSELF. I AM NOT GOING TO STUDY VERY INTENSELY EITHER, I WILL NOT LET THE SYSTEM CONTROL MY LIFE.\n\nI'm just frustrated right now again. That's all.",
  "author": "SportsMajor",
  "created": 1636414418,
  "updated": 1636656340,
  "over_18": false,
  "upvotes": 202,
  "upvote_ratio": 0.99,
  "comments": {
    "hjvb3k2": {
      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjvb3k2/",
      "text": "I feel you. I’m currently on my fourth term of community college, and I had straight As my first three terms. I’ve really struggled with motivation this term, but I’m still clinging to that 4.0 GPA. I know that I just have to pass the class, but a big part of me wants to keep the streak alive—as lame as that sounds. \n\nHopefully we can both let go a bit if we have to :)",
      "author": "JumpyTwist7",
      "created": 1636415070,
      "upvotes": 54,
      "replies": {
        "hjvbbro": {
          "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjvbbro/",
          "text": "I've never been the 4.0 type, but I want to be. I just don't want to dedicate my entire four years to college to simply do that. It bothers me. Like I'm trying my best without having to go overboard to pass.",
          "author": "SportsMajor",
          "created": 1636415173,
          "upvotes": 16,
          "replies": {
            "hjylkxc": {
              "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjylkxc/",
              "text": "Set a realistic goal like 3.7 overall. This will be more achievable and allow you to actually work toward a goal and make yourself proud. That is a very good GPA as well. Also, GPA really is not a factor after graduating and getting your first job so don’t fixate on it too much. You’re absolutely right that networking is more important, spend your time doing that.",
              "author": "GreyStomp",
              "created": 1636479917,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hjwigjl": {
          "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjwigjl/",
          "text": "ayy im in my 6th semester of Computer Science and still trying to keep the 4.00 GPA streak for as long as I can\n\njust waiting for my first A- so I can stop worrying about the 4.00",
          "author": "Kipperkipper",
          "created": 1636435481,
          "upvotes": 3,
          "replies": {}
        },
        "hjylyjh": {
          "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjylyjh/",
          "text": "this post is not for people who already have 4.0’s—we know you work hard for it, but this is for those who don’t have a 4.0 to let them no its okay.",
          "author": "Divinebookersreader",
          "created": 1636480066,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjw3lrx": {
      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjw3lrx/",
      "text": "That's me. I go to a target school in my country. I have barely above 3 GPA and I want to maintain that. I know maybe I could get good grades but I'm too distracted/focused on exploring other things than my school. I don't like the college system. I try to tell myself it doesn't matter but I also want to be best at everything. My guilt/importance for grades has diminished over time and I hope it continues to do so without affecting what I can achieve in my life.",
      "author": "RevolutionaryAd9850",
      "created": 1636427991,
      "upvotes": 13,
      "replies": {}
    },
    "hjvt8k8": {
      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjvt8k8/",
      "text": "I’m a perfectionist and have a near perfect gpa but guess what? I’m miserable. I’m not even learning as much as I would if I just cut myself some fucking slack. I study to memorize & pass and then forget it. Sure, I look smart on paper, but I’m really not enjoying the classes because I put so much pressure on myself. & you’re absolutely right that connections matter more. I’ve found that it’s gotten easier as I set more boundaries for myself, like not doing schoolwork after a certain time or just turning in an assignment that I could’ve done much better on.",
      "author": "roseyelephant33",
      "created": 1636423334,
      "upvotes": 22,
      "replies": {}
    },
    "hjwyxs6": {
      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjwyxs6/",
      "text": "I mean if you're looking at any kind of grad or professional school, your GPA is pretty important.",
      "author": "FoxWyrd",
      "created": 1636447827,
      "upvotes": 5,
      "replies": {
        "hjx7sv4": {
          "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjx7sv4/",
          "text": "Yeah but only after a certain point. You need the grades to apply, but you need the experience to get in.",
          "author": "denver_rose",
          "created": 1636455661,
          "upvotes": 3,
          "replies": {
            "hjx81a7": {
              "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjx81a7/",
              "text": "Depends on the type of school you're looking at in all honesty.\n\n&#x200B;\n\nI'm looking at Law School for Fall 2022 and poor grades would hamstring one in ways that no amount of realistic experience could possibly make up for.",
              "author": "FoxWyrd",
              "created": 1636455852,
              "upvotes": 5,
              "replies": {
                "hjx853v": {
                  "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjx853v/",
                  "text": "That’s true. I didn’t think about law school. I’m a junior but I hope to go to grad school to do science research so you could still get in as long as you have 3.5 and experience.",
                  "author": "denver_rose",
                  "created": 1636455936,
                  "upvotes": 1,
                  "replies": {
                    "hjx8b6x": {
                      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjx8b6x/",
                      "text": "I mean, I think once you start steadily pushing over a 3.5, you can breathe a lot regardless of your post-grad plans unless you're deadset on the absolute top of the line schools.\n\n&#x200B;\n\nOP mentions that even though a 2.0 is all that's needed to graduate, he still stresses--and honestly--he should if he's below a 3.0 unless he's got the internships and connections to go directly to Industry.",
                      "author": "FoxWyrd",
                      "created": 1636456075,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjxzxgm": {
      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjxzxgm/",
      "text": "I actually considered intentionally breaking my 4.0 so that I could reduce my stress. Naturally, I did not because I love to hate myself.",
      "author": "ZacKaffeine",
      "created": 1636471213,
      "upvotes": 5,
      "replies": {}
    },
    "hjwirby": {
      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjwirby/",
      "text": "Whether I tried or not, this was my experience\n\nso, I just stopped trying. I have even less reasons to try nowadays",
      "author": "Waffles38",
      "created": 1636435661,
      "upvotes": 3,
      "replies": {}
    },
    "hjwjjy5": {
      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjwjjy5/",
      "text": "Im in your situation. I feel like im driving myself mad. I am a senior now ( if things would have gone myself when I transfered to my schoool I would have graduated this past May). I am working part time and I am full time student. My major is fashion design and merchnandising. I am also prt of many clubs and im in a sorority also. \n\nThe design part is fun but whole lot of work. This particular class, My senior collection which is retrrospective should be easy, no my teacher is making things tens times diffcult. mind you i need a C. I have a C in the class now. My blood always goes up because she tells me my stuff is wrong even though she provides NO FEEDBACK actual feedback to help me. Its beyond fustrasting cause she is pulling grades out of her ass. Nonetheless i ask how i can improve it is walys \"idk its your design\" like bitch ur the one grading me. The professor dead ass talks to me for 5 minutes and leaves. And making the garment in 2 weeks ?! Most designers take a good month. \n\nThese are trying times. It is impossible to do everything. I took a step back from my clubs. but damn I am hardest working person. I get little to no aknowledgement. College has made me drink on the weekdays. \n\nLast semester I was at my lowest & burn out is real. You are not alone in feeling like this",
      "author": "shygirlsclub",
      "created": 1636436142,
      "upvotes": 3,
      "replies": {}
    },
    "hjwfkyn": {
      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjwfkyn/",
      "text": "I once heard about an advisor who would tell his students, specifically pre-med, to get a grade less than A as soon as possible in their college career. The reason being to offset the ridiculous pressure of trying to maintain a \"perfect\" GPA all through college. Once I started focusing on learning the material because it was interesting to me (even if it wasn't at first) rather than because I have to take a class also helped me actually absorb material and perform better on exams!",
      "author": "pkatess",
      "created": 1636433808,
      "upvotes": 4,
      "replies": {}
    },
    "hjy4psu": {
      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjy4psu/",
      "text": "I'm on the exact opposite end of the spectrum I try to calculate my grades to see how bad I can do on an assignment and still pass the class my goal every semester is if I get a 75 or above I'm happy",
      "author": "bald_butte",
      "created": 1636473202,
      "upvotes": 2,
      "replies": {}
    },
    "hjzuauy": {
      "link": "/r/CollegeRant/comments/qpqbas/i_hate_the_idea_of_being_perfect_in_college/hjzuauy/",
      "text": "Yep, perfectionism is the enemy. Derails a lot of people and gives them a very false sense of actual learning and success.",
      "author": "Felixir-the-Cat",
      "created": 1636497786,
      "upvotes": 1,
      "replies": {}
    }
  }
}