{
  "sid": "q7htz4",
  "link": "/r/CollegeRant/comments/q7htz4/is_college_worth_it/",
  "title:": "Is college worth it?",
  "text": "I am not having a good time. I'm a sophomore and have already considered transferring every single semester. First semester was totally online and at home for me and I thought about transferring but figured I needed to give it a better shot, since that's not what college is supposed to be like. Second semester was online but I lived on campus. I emailed another school about transferring, but never took any further steps because I figured it was still not what college is normally like. I'm on campus this semester and everything is normal and I still don't like it. I just applied to transfer to another school. Every semester I take another step towards leaving this place but I still find that I'm convincing myself it will be fine if I give it more time.\n\nI have started thinking about community college but I don't know if it is worth it. I know I would save a lot of money and possibly even time, but I really want a great and fun college experience. I'm starting to think maybe I just have expectations that are too high. Is the college experience worth it? Should I stay and stick it out or should I try somewhere new and go from there?",
  "author": "UsefulHotel1861",
  "created": 1634150906,
  "updated": 1634167725,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hgisiv4": {
      "link": "/r/CollegeRant/comments/q7htz4/is_college_worth_it/hgisiv4/",
      "text": "Do you what career path you want to take? College is mainly about choosing a major of your interest and trying to make a career with it once you graduate. If you want a \"college experience\", you can see if there are any clubs that interest you or you can get housing with roommates and hang with them. If your college has greek row you can see how to rush it.",
      "author": "Fit_Seaworthiness_37",
      "created": 1634153570,
      "upvotes": 2,
      "replies": {}
    }
  }
}