{
  "sid": "r3moho",
  "link": "/r/CollegeRant/comments/r3moho/my_dad_is_getting_way_too_involved_with_my_school/",
  "title:": "My dad is getting way too involved with my school",
  "text": "I love my dad but this whole semester he's been unbearable. In highschool I took a coding class and I hated it, I'm horrible at coding and I don't feel satisfied from it. Fast forward to now, I go into my sophomore year a graphic design major and take another coding class because he thought it would be good for me. While all this is happening he starts telling me how I should become a business major. Eventually I did decide to switch to marketing (which I'm actually fine with I think it would be a good major to have) but now he won't stop telling me about how great it would be if I were an accounting major instead. I just went through all this work to change my major from art to business but he won't shut up about how I picked the \"wrong\" one. Along with this I have this four credit coding class that is doing nothing but bog down my gpa, my grade is horrible and I wish I dropped it at the start of the semester. He won't stop talking about java (even though I'm learning java script which is completely different) and how he wants to help me get my grade up so I can take another coding class next semester. I'm so tired and burnt out and I already planned on dropping the class before the deadline and the last thing I need is to take another class that will go nowhere on my transcript. It feels like nothing I do is good enough for him and I'm done with trying to please him. It just sucks how I changed my entire carrier trajectory and he won't stop talking about a field I was never going to go into.  Maybe I'm being bitter idk I just needed to get this out.",
  "author": "electricpaperclips",
  "created": 1638046398,
  "updated": 1638207525,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.97,
  "comments": {
    "hmbjc34": {
      "link": "/r/CollegeRant/comments/r3moho/my_dad_is_getting_way_too_involved_with_my_school/hmbjc34/",
      "text": "It’s your future it should be your decision what major you select.",
      "author": "BlueOcean7987",
      "created": 1638047890,
      "upvotes": 17,
      "replies": {}
    },
    "hmclajg": {
      "link": "/r/CollegeRant/comments/r3moho/my_dad_is_getting_way_too_involved_with_my_school/hmclajg/",
      "text": "Just tell him how you feel. Communicate with him.",
      "author": "Megadog3",
      "created": 1638065161,
      "upvotes": 7,
      "replies": {}
    },
    "hmbsuj2": {
      "link": "/r/CollegeRant/comments/r3moho/my_dad_is_getting_way_too_involved_with_my_school/hmbsuj2/",
      "text": "I would say if you like marketing, you should stick with it. I wouldn't let your dad talk you into a major you don't want to do. Doing poorly in classes isn't going to help with future career and  probably going to hurt your financial aid. Also, if you're truly feeling burnt out, maybe take a semester off. Taking a semester off will probably help you destress and rethink about what you truly want out of college.",
      "author": "Brian2017wshs",
      "created": 1638052099,
      "upvotes": 6,
      "replies": {}
    },
    "hmcur8h": {
      "link": "/r/CollegeRant/comments/r3moho/my_dad_is_getting_way_too_involved_with_my_school/hmcur8h/",
      "text": "Did your dad go to college? It sounds like he has no idea how it works.",
      "author": "VoxBoxMoo",
      "created": 1638069819,
      "upvotes": 4,
      "replies": {}
    },
    "hmcv4t9": {
      "link": "/r/CollegeRant/comments/r3moho/my_dad_is_getting_way_too_involved_with_my_school/hmcv4t9/",
      "text": "Sounds like he may have wanted to go to college for these things, but never got the chance to. And now he is trying to live vicariously through you. He sounds kind of like a helicopter parent. I think you need to sit down and have a talk with him, and if the behaviour doesn’t stop, maybe try to find your own place so you have your own space.",
      "author": "PleasantAmphibian101",
      "created": 1638070008,
      "upvotes": 1,
      "replies": {}
    }
  }
}