{"sid": "hviq26", "link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/", "title:": "No Matter What I Do - I Am F*****", "text": "I am the first to attend college in 4 generations of my family. I am a cyber security major in 2 area of specialization. Im going into my Jr. Year at the top of my class. Here is the catch, I can't afford it or make logical sense of it. I have a perfect GPA, was a TA, and have chronic disabilities, yet I get 0 in scholarships because \"online is cheaper.\" The online is cheaper is BS, my fiance goes on campus and her tuition after her FAFSA was 1k due to scholarships (different schools). She would normally have to pay double my tuition. I pay 26k per year and even with an 800 credit score, my family does not make enough to get good private loan rates. My best rate is an 11.41%. I have privately borrowed 18k in 2 years and have to pay back 39k on a 5 year fixed. The banker originally made a mistake and it was supposed to be sub 10, but they said sorry and that I signed it (not the point here really). This year the FAFSA said my family made too much in 2018 and my contribution is 36k, about a third on my familys income. For this I lose the 5500 I get annually from the state for being disabled. I had to take half of summer off for medical leave and the school told me that would not affect my federal aid, yet they took that too. Here I am sitting here supposed to be doing homework, yet wondering, WHY!? I feel despite whatever I accomplish in college and no matter how good I do, I am going to spend the first 20 years paying off shit. I get others go through this, but the rates are double what my friends have (yes ive checked multiple banks), too much for a grant, havent heard from almost 3 dozen scholarships, family either cant or wont help financially. I. Am. F\\*\\*\\*\\*\\*. \n\n&#x200B;\n\nTL:DR - I have a perfect GPA and no matter what I do I cannot get a scholarship, financial aid is taken, and finances are complicated, all of which are hindering me.", "author": "ComputeBeepBeep", "created": 1595375011, "retrieved": 1632951514, "over_18": false, "upvotes": 37, "upvote_ratio": 0.95, "comments": {"fywzzcj": {"link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fywzzcj/", "text": "[removed]", "author": null, "created": 1595453688, "upvotes": -1}, "fywtwbd": {"link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fywtwbd/", "text": "Questions: \n\nIs this an undergrad program or masters? \n\nIs this a private or public school? \n\nAre you in-state or out-of-state?", "author": "BeansWorther", "created": 1595450772, "upvotes": 1}, "fyv114o": {"link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyv114o/", "text": "Well you said you have a fiance. How you thought of getting married on paper first? \nI'm lucky I've received many scholarships due to being first gen College student, low income family and my academic standing helped me lower the cost out of pocket to my traditional 4 year college. My fiance goes to a technical school and paid half of my tuition but little to no scholarship due to his family making to much. The FAFSA is supposed to make everyone be on the same playing field however they do not care if your family is helping financially, they care about the overall income received. So if you and your fiance get married and your income is less than your parents, you may qualify for scholarship since now you would be technically in a lower income family. The FAFSA will then only take account your and your fiance's income and not your parents. If not you do not get married then the FAFSA when continue to use your parents tax information until one you graduate or two you turn 23-24 whichever happens first. Hope this helps..", "author": "The_Queen_Bunny", "created": 1595416453, "upvotes": 1}, "fyuaawr": {"link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fyuaawr/", "text": "[deleted]", "author": null, "created": 1595391832, "upvotes": 10}, "fytujp0": {"link": "/r/CollegeRant/comments/hviq26/no_matter_what_i_do_i_am_f/fytujp0/", "text": "~The American Dream~\n\nLife isn’t fair. I’m not a financial specialist. My heart aches for you, and all I can offer is my sympathy. Know that it’s not you, the system is just broken. Good luck and God Bless.", "author": "Gahorma", "created": 1595381952, "upvotes": 22}}}