{"sid": "l97zst", "link": "/r/CollegeRant/comments/l97zst/is_this_how_it_is_supposed_to_be_is_this_the_norm/", "title:": "Is this how it is supposed to be, is this the norm for the majority of college students?", "text": "It seems that in all my difficult and more advanced classes, the instructors will literally never teach us anything of importance in the lecture. They always go on about their personal lives and experiences the ENTIRE time.\n\nEven though there is nothing I can do about it, I am just getting tired of it because it feels like it is such a massive waste of time. Even more importantly, studying just becomes a time consuming guessing game because they only ever manage to cover 2-3 things in the lecture that are relevant to the tests, quizzes, and exams. \n\nAt this point, I am just paying for a 1 hour and 15 minute long group conversation lmaooo", "author": "toofeduptocare", "created": 1612080777, "retrieved": 1632950774, "over_18": false, "upvotes": 136, "upvote_ratio": 0.99, "comments": {"gliaq21": {"link": "/r/CollegeRant/comments/l97zst/is_this_how_it_is_supposed_to_be_is_this_the_norm/gliaq21/", "text": "There are two major types of universities: research intensive and teaching focused. \n\nIn research universities,professors are expected to be top researchers and bring in large grants. Students are expected to be able to learn with some guidance.\n\nIn teaching universities, you will have smaller classes and professors who may actually teach you. \n\nThere are universities who are somewhere in the middle, of course. For me, I expect my students to come to class prepared. I should never have to tell them what the book say because they should have already read it. Many of my students seem surprised by this.", "author": "ThatProfessor3301", "created": 1612119905, "upvotes": -2}, "glhygyu": {"link": "/r/CollegeRant/comments/l97zst/is_this_how_it_is_supposed_to_be_is_this_the_norm/glhygyu/", "text": "Honestly, I can't say because I haven't been in your classes, but the expectation that your professors will spoon feed you the information in an upper level class is misguided. I don't know what your major is, but in most of hte humanities and social sciences, it is pretty common to have discussion based classes (that, yes, can sometimes get into tangent-land) that are predicated on the assumption that you've done the reading(s) prior to class and that you will then integrate the discussion of the material into your later assessments. \n\n&#x200B;\n\nFor perspective, I teach 100-level intro classes and 300-level electives in a social science. In my upper level classes, I hardly lecture at all. We discuss the readings I assign to the class, and sometimes I prompt students to think about how the readings could apply to their own personal lives and experiences. Sometimes I'll give a brief and pretty basic example from my own life to sort of get the ball rolling (nothing too personal, maybe something like \"If I had to answer this question, I might say that the author's description of the gendered forms of communication resonated with my experiences of how differently my mother and father communicated with me when I was a kid. Anyone else?\")\n\n&#x200B;\n\nSo maybe you need to realign your expectations with how college actually works. At this point in the process, you should be able to think for yourself. Learning is not about you just sitting there passively waiting for information to be dumped into your head.", "author": "college_prof", "created": 1612114368, "upvotes": 7}, "glhllic": {"link": "/r/CollegeRant/comments/l97zst/is_this_how_it_is_supposed_to_be_is_this_the_norm/glhllic/", "text": "Not for me, I’m almost done and most of my advance course professors lecture on the topics. I do feel it is much harder to follow sometimes but its not always personal, sometimes theres anecdotes but not the whole time.", "author": "VanGoghsSeveredEar", "created": 1612108205, "upvotes": 1}, "glhdje8": {"link": "/r/CollegeRant/comments/l97zst/is_this_how_it_is_supposed_to_be_is_this_the_norm/glhdje8/", "text": "This is not normal. Sure, I’ve had some bad professors but nobody talked about themselves all day every class. If you need good stem lectures go to AKlectures.com", "author": "denver_rose", "created": 1612103645, "upvotes": 14}, "glhcmbj": {"link": "/r/CollegeRant/comments/l97zst/is_this_how_it_is_supposed_to_be_is_this_the_norm/glhcmbj/", "text": "I learned that this is the reason those classes are hard. In high school I had to take Chemistry twice. The first time, I failed miserably.  The teacher did exactly this, and I retained nothing. \n\nI also have ADD. \n\nThe second time. we got a new teacher to the school so she got all of the repeat kids (like me) and there were a lot of us. \n\nI got an A the second time around bc Mrs. Pittman was an excellent teacher. \n\nI feel like even difficult subjects can be made understandable when the instructor actually tries. if she/he's just fucking off during class, they they don't care about you learning the material. They're collecting a paycheck.", "author": "Alliski", "created": 1612103093, "upvotes": 8}, "glhc7g2": {"link": "/r/CollegeRant/comments/l97zst/is_this_how_it_is_supposed_to_be_is_this_the_norm/glhc7g2/", "text": "I wouldn’t say this is normal. I’m a senior and this sounds like the professors who may be very knowledgeable/have a doctorate in the subject but have no clue how to actually teach the information. At the very least it should be clear what you need to know for a test. I hope all of your profs aren’t like this but there should be better ones.", "author": "PuzzleheadedEar1107", "created": 1612102839, "upvotes": 39}, "glh9442": {"link": "/r/CollegeRant/comments/l97zst/is_this_how_it_is_supposed_to_be_is_this_the_norm/glh9442/", "text": "I don’t think that’s how it’s supposed to be, it’s insane how some professors waste lecture time talking things that aren’t important to the class, then test you on material they barely went over, then are surprised when majority students don’t do well on their exams", "author": "CantuTwists", "created": 1612100780, "upvotes": 7}, "glh43w0": {"link": "/r/CollegeRant/comments/l97zst/is_this_how_it_is_supposed_to_be_is_this_the_norm/glh43w0/", "text": "I've definitely experienced it lol the harder a subject is the harder it is to find a professor who knows how to TEACH it. The issue is that someone who's QUALIFIED to teach a certain subject will get hired off of the fact that they know the content and have teaching credentials. Doesn't mean they know how to explain shit to you. So that's why you end up with teachers who drone on in lectures and are no help, or teachers like yours where they're not quite sure how to teach and just ramble themselves into a comfort zone and fool themselves into thinking they're still actually teaching lol", "author": "vness1213", "created": 1612096957, "upvotes": 6}, "glgy6s3": {"link": "/r/CollegeRant/comments/l97zst/is_this_how_it_is_supposed_to_be_is_this_the_norm/glgy6s3/", "text": "holy shit i’m a freshman and i just experienced this kind of shit during this sem. i honestly feel you, idk if its normal tho or i just got unlucky :-/", "author": "xLeviosa", "created": 1612091429, "upvotes": 45}}}