{"sid": "p1j1eh", "link": "/r/CollegeRant/comments/p1j1eh/im_done_with_college_life/", "title:": "I’m done with college life.", "text": "I’m about to go into my fourth year of college, and I’m dreading it. College has not been the best experience for me. I don’t have any real college friends. I was in an awful organization my first two years of college. I haven’t had the best experiences with another organization I was involved in. I don’t even fit in with students in this other organization I’m only involved in because of scholarships. I don’t connect with college students. I don’t see the full value of a college education. College feels like a waste of time for me. \n\nFor the last year, I’ve been so unmotivated in my school work. I still feel unmotivated. I don’t know why exactly. Part of it is probably covid related. Another part of it is possibly because of anxiety/depression.\n\nI feel like I connect more with older people who aren’t in college for whatever reason. I would like to have college friends, but it seems that no one wants to hang with me. No one makes any effort to want to be with me.\n\nI got a lot more on my mind, but I don’t even know what else to say.\n\nTL;DR - I’m starting my fourth year of college, and I’m dreading it because I’m not enjoying college life. I feel like I don’t belong in college because I don’t connect with college students along with possibly anxiety/depression.", "author": "robertbchatham", "created": 1628574018, "retrieved": 1632949126, "over_18": false, "upvotes": 16, "upvote_ratio": 1.0, "comments": {"h8fy12i": {"link": "/r/CollegeRant/comments/p1j1eh/im_done_with_college_life/h8fy12i/", "text": "Same, just trying to finish my degree now. Hope things get much better after that", "author": "cody_d_baker", "created": 1628621519, "upvotes": 2}, "h8fu334": {"link": "/r/CollegeRant/comments/p1j1eh/im_done_with_college_life/h8fu334/", "text": "Hey, I’m kind of in the same boat. I struggled a lot with my mental health every year, as a result I lost the motivation to go to clubs, join organizations, meet friends, or even study. It’s really hard, I know. \n\nIf your school offers counseling, I’d suggest starting there. My school didn’t have the best services as they’re a smaller, private school, but they had people I could talk to when I needed it. There’s no harm in just checking it out.\n\nI just wanna say, I’m proud of you for getting this far. You’re in your fourth year already! That’s an accomplishment in and of itself, even if it doesn’t feel like it. I wish you all the best, I’m sorry if my words don’t help too much/or sound cliche. I really relate to what you’re saying and it would definitely help for you to open up to someone like a counselor or family member, or trusted friend.", "author": "liminal_fangs", "created": 1628619864, "upvotes": 6}, "h8dw1ab": {"link": "/r/CollegeRant/comments/p1j1eh/im_done_with_college_life/h8dw1ab/", "text": "I can’t help you with this cuz I’m going through the same shit. I’m sorry dude, but at least you ain’t the only one ~ 😓", "author": "Fristi2147", "created": 1628580728, "upvotes": 8}}}