{"sid": "ptiwzw", "link": "/r/CollegeRant/comments/ptiwzw/roommate_problems/", "title:": "Roommate Problems", "text": "Roommate Problems\n\nHi. To start, this is a burner account since I don’t frequent nor post on Reddit at all. But after reading a few similar threads on this sub, I think this should be a good place to relay what I’ve been feeling.\n\nBefore I move onto the actual problem, I’ll say that I really don’t think that I’m an antisocial or otherwise standoffish person. I never do things out of malice and am otherwise a generally agreeable person. However, I know that I’m pretty ambiverted (at best, I love talking to people but my social battery runs out pretty easily) I don’t really have the same interests as a lot of girls (I’m the kind of person who spends her time playing Dungeons and Dragons or grinding out in a JRPG rather than partying or drinking). I also have diagnosed anxiety and ADHD, and it does tend to affect my academic and social life a bit, but not to an extreme degree. That means sometimes I’ll do something with one intention but not realize that it appeared another way to someone else.\n\nThat’s all relevant, I promise.\n\nSo, I’m a freshman in university living on campus. Before I moved into my dorm, I got the chance to connect with my suite mates. They were honestly so nice before, but that might have been because we were only talking via Snapchat. When I met them in real life, they were so nice, too. Well, that lasted until two weeks. It’s been a month now, and for the last two weeks, everything seemed to change, at least with one of them. I’ll just call her Amanda.\n\nSo, Amanda is the kind of person that’s very outgoing and kind on the surface. However, she’s also a giant overachiever and I have the feeling that she’s also quite judgmental of everyone in regards to being on top or below her. She’s probably a polar opposite of me. I have two other suitemates that are fairly nice and civil to me, so I won’t be talking about them here.\n\nAmanda and the other suitemates got along so well, and they hang out every day (without me, lmao). Which I don’t care about, since they have a lot in common with each other. It does hurt just a little bit when they know I’m not busy and don’t offer to at least let me join, but again, I’m not sure how much fun I would have with them.\n\nAnd now, onto Amanda and me. I don’t know why, but whenever I say hello or wave to her, she will just stare at me with her resting bitch face. The least she could do was smile at me, but I digress. She doesn’t do this with the other suitemates, so I know it’s not part of her personality or anything. I don’t know what I did to her to piss her off in the long term (I did accidentally wake her up one time, but the key word is one time. I hardly think that calls for a grudge). I think it’s just because she sees me as “lesser” and is stuck in that popular-girl mindset. It was clear that we wouldn’t become besties from the first day, but is it so hard to be a friendly acquaintance?\n\nSo, I wanted to hear some advice about how to deal with this. It’s gotten so bad that she hasn’t talked to me in a week, brushes me off whenever I do try to talk to her, and is an otherwise uncomfortable person to be around. I do want to talk to her about it, but I don’t even know if she will listen. It’s making me hole myself in my room and not want to be out in the common room because she will be there. \n\nTo end this, I’m not looking on how to make friends. I have quite a lot of friends, both on campus and off (online, old school friends, etc). I’m a very friendly person and it’s incredibly easy to befriend me, which is why it’s always a shock when people end up hating me for no good reason.\n\nEven if there is no solution, I just wanted to get this off my chest. Thanks!", "author": "Warm-Ebb4689", "created": 1632354584, "retrieved": 1632948430, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"hdy0ggz": {"link": "/r/CollegeRant/comments/ptiwzw/roommate_problems/hdy0ggz/", "text": "She probably knows you don’t like her and doesn’t want you pretending to be her friend.", "author": "snoboy8999", "created": 1632388931, "upvotes": 0}, "hdxlzd3": {"link": "/r/CollegeRant/comments/ptiwzw/roommate_problems/hdxlzd3/", "text": "That's rude as hell.\n\n It's unfair that you have to feel uncomfortable because of her stank attitude and because she can't communicate a problem she has. Honestly, it's immature... She's not a person you want in your inner circle. \n\nBut I get it you have no choice but to try and at least make peace. Maybe when you catch her alone ask her directly what her issue is, but in a way that isn't accusational to avoid her snapping on you. You could just be like \"hey Amanda can I talk to you for a minute about something. Just want to have an honest conversation\" or something like that. \n\nAlso tell her how her actions have been making you feel and make her aware of specific situations where her actions made you feel that way. Give some examples incase she claims to be unaware of what she's doing. \n\nIf she doesn't listen you can ask the other suitemates for ideas on how to address this, or if she's ever talked about having a problem with you. And if it gets worse ask the RA to do a peer meditation between you two. She'll have no choice but to tell you her problem and try to resolve it. \n\nYou sound like a super nice person. I'm sorry you gotta deal with this.", "author": "genericusername_____", "created": 1632376330, "upvotes": 3}}}