{"sid": "n50dcy", "link": "/r/CollegeRant/comments/n50dcy/i_am_so_tired_and_stressed_and_i_just_feel_like/", "title:": "I am so tired and stressed and I just feel like crying all of the time", "text": "i have struggled so bad in school this semester I am trying so so hard its not even funny I have a job, family issues, doing zoom university at home in the not most stable environment, I am so stressed and sad I always feel like a failure and I constantly feel like crying I have cried so much in the past few weeks I just want school to be over", "author": "alphabetcarrotcake", "created": 1620167784, "retrieved": 1632951365, "over_18": false, "upvotes": 50, "upvote_ratio": 0.98, "comments": {"gx5dxf8": {"link": "/r/CollegeRant/comments/n50dcy/i_am_so_tired_and_stressed_and_i_just_feel_like/gx5dxf8/", "text": "I completely understand. I had a bit of that going on a month before I was done. It's been a rough one for a lot of us.\nI believe in you. Take care of yourself as best you can and keep looking to the finish line. You're almost there! Sending you the biggest hug ♡", "author": "kookiebunnynose", "created": 1620308718, "upvotes": 1}, "gx24uc4": {"link": "/r/CollegeRant/comments/n50dcy/i_am_so_tired_and_stressed_and_i_just_feel_like/gx24uc4/", "text": "Me too friend, me too.", "author": "Smooth_Program_5982", "created": 1620240666, "upvotes": 1}, "gwzfqc1": {"link": "/r/CollegeRant/comments/n50dcy/i_am_so_tired_and_stressed_and_i_just_feel_like/gwzfqc1/", "text": "I promise promise promise you are not alone.   You’re so close to the end of the semester, and I swear to god, no one will ever ask what grade you got in this class, whatever it is.\n\nYou can do this.   You’re not alone, and you’ll make it through.", "author": "emarcomd", "created": 1620184045, "upvotes": 3}, "gwyyebv": {"link": "/r/CollegeRant/comments/n50dcy/i_am_so_tired_and_stressed_and_i_just_feel_like/gwyyebv/", "text": "Same boat and I feel like because I feel like crying and screaming and not doing it builds up that stress. I feel like I’m ganna go insane for not expressing it but again not the most open person to do so. I be been depressed you can say but put a save face on because I want everything to be alright even it’s not. The best I did was to basically talk myself into a just do it mindset and it’s helped but it depends how long you can keep that up.", "author": "IsauroV", "created": 1620175542, "upvotes": 6}, "gwyw5hd": {"link": "/r/CollegeRant/comments/n50dcy/i_am_so_tired_and_stressed_and_i_just_feel_like/gwyw5hd/", "text": "I feel you. My semester just ended and I have to do summer classes that start on the 12th. You can do this! It’ll be okay no matter what! You got through every semester before this. You’ll get through this one too.", "author": "thnx4thememeories", "created": 1620174463, "upvotes": 12}}}