{"sid": "oewq0v", "link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/", "title:": "Is Partying with 16 Year Olds weird for a 20-24 year old group of guys?", "text": "My boyfriend and his friends got invited to a high school party by a bunch of 16-17 year old girls. (i was invited as well). All 5 of us are 20-24 years old.\nI find it a bit weird if they decided to go. I remember when I was in High School and when a bunch of 20 something year olds came it was the most awkward and weird thing ever. People talked so much crap saying “don’t you have a job to get too?” “aren’t you in uni or collage?” “why aren’t you at a collage party then?” and then they would talk A LOT of bad things about the girl who invited them. Saying she’s a Sl*t and all that. And it gave off very much pedo vibes to every female around. I even felt uncomfortable dancing at that point. \nThese guys want to go but it’s a house filled with minors and to me it’s weird. \nDoes anyone else think it’s weird or is it just me? \nLike you’re in your 20s partying with a bunch of high schoolers. If you want to party that bad, throw one yourself maybe? My bf has PLENTY of friends to throw a big party and none are minors. \nI would tell this to my bf and his friends but i don’t want them thinking i’m trying to stop them from doing something or whatever. Yes, I can state my opinion but at the same time I feel like they won’t get it unless i say “you’ll look like a pedo” and I don’t want to do that lol. \nWhat do any of you think?? Am i over thinking or is this a reasonable thing to bring up??", "author": "sabmichelle", "created": 1625583799, "retrieved": 1632842025, "over_18": false, "upvotes": 81, "upvote_ratio": 0.93, "comments": {"h48simr": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h48simr/", "text": "Thank you u/sabmichelle for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1625583799, "upvotes": 1}, "h4crka4": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h4crka4/", "text": "I think it is weird that a group of 20-24 year old guys would be interested in a party with a bunch of 16 year olds. There is just nothing good that can come of that. They would have little in common, and there would be legal risks. It makes no sense.", "author": "kristimyers72", "created": 1625666383, "upvotes": 1}, "h4bog4t": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h4bog4t/", "text": "That's so fucking weird.", "author": "best_casual_mma_", "created": 1625635431, "upvotes": 1}, "h4bl2cq": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h4bl2cq/", "text": "*college", "author": "DifferentialDuration", "created": 1625633028, "upvotes": 2}, "h4bccwo": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h4bccwo/", "text": "20 in high school parties: nope\n32y with 26y get married: yes\nso it’s a under 18y problem", "author": "Adrien0715", "created": 1625627765, "upvotes": 2}, "h4aubbr": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h4aubbr/", "text": "Just tell them that it will make them look like pedos, if anybody in the group gets offended then they probably are a pedo. \n\nIf you don't tell them they will end up going and looking like pedos to every woman at the party anyways, you'll also look bad hanging out with them too.", "author": "toofeduptocare", "created": 1625618250, "upvotes": 2}, "h4ap45b": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h4ap45b/", "text": "creep alert!!!", "author": "ghostmode342", "created": 1625615495, "upvotes": 2}, "h4aenhw": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h4aenhw/", "text": "y’all i got an update on this situation. i just talked to him and i doubled checked the girls age and he said girl A turned 18 and the rest are as turning 18 as well....they graduated year 12 this year. so they’re a year younger then me, 2 years then my bf and so on and so forth. so they are going into uni/collage in two months. idk if that changes anything but for me it’s still somewhat sus i guess?? but since they’re entering uni idk if it can be justified?", "author": "sabmichelle", "created": 1625610133, "upvotes": 15}, "h4actqk": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h4actqk/", "text": "Alarm bells, red flags, yellow sirens and foghorns are going off for me - I'd be wary of it for sure", "author": "PutSimply1", "created": 1625609254, "upvotes": 3}, "h49ukzl": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h49ukzl/", "text": "That’s weird.  It’s creepy in my opinion.", "author": "Emotional_Match8169", "created": 1625600952, "upvotes": 2}, "h49ss6m": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h49ss6m/", "text": "Nah sis. You’re right. I’m 24 and my golden rule is: if you can’t drink.... we can’t kick it! Plus if they mess with anyone there that’s an open and shut case. Why don’t they go to a college party? Shit! Go to a club! Something. They shouldn’t have a lot in common with 16 y/o’s. \n\nWEIRD!", "author": null, "created": 1625600148, "upvotes": 30}, "h49nzkv": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h49nzkv/", "text": "If your uncomfortable don’t go pretty simple. Also if trying to convince the others not to go just ask them how they plan to deal with problems that could arise. If there’s underage drinking or sex the older people are going to get the blame. “How you get the …” “wait you saw those kids drinking and let them drive?” If their comfortable going and dealing with that then it’s their problem.", "author": "Kirbylover16", "created": 1625597989, "upvotes": 1}, "h49ivlh": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h49ivlh/", "text": "It’s fucking weird and also unnecessary considering that 24 year olds can legally go to bars and clubs to party.\n\nAlso why the hell do they care that this random high schooler is a slut lol", "author": null, "created": 1625595652, "upvotes": 8}, "h499y6c": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h499y6c/", "text": "mind y’all - they are just friends of ours. i’ve met them twice and the guys hung out w them when one of them dated one of the girls **SHES LEGAL AGE FOR HIM** but they broke up now. in reality, it does look harmless since we do know them on that level, but it’s still the fact that the party will be filled with minor boy and girls...even tho the this guy dated is legal, going to the party in my head is kinda weird still. **he started dating her when he was 19**. still let me know how you feel with this more information. i’m on the fence. (only because i’m not disclosing every ounce of info yk).", "author": "sabmichelle", "created": 1625591664, "upvotes": 0}, "h499bx1": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h499bx1/", "text": "it’s not just weird, it’s very fucking weird", "author": "ShadowsTravelling", "created": 1625591384, "upvotes": 23}, "h4983sr": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h4983sr/", "text": "I completely get you about not wanting to feel like you sound controlling. But I also think it’s pretty weird. There’s really no good reason for college age guys to want to be hanging out with high school girls like that. I suggest you bring this up to your bf and his response can say a lot about his character", "author": "Floofyland", "created": 1625590839, "upvotes": 9}, "h497jd1": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h497jd1/", "text": "It's weird. Hang out with people in college lmao what are y'all doing with 16-year-olds?", "author": "texastoast134", "created": 1625590587, "upvotes": 38}, "h490ox4": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h490ox4/", "text": "That’s fuckin weird", "author": "crystalliite", "created": 1625587559, "upvotes": 48}, "h48we6j": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h48we6j/", "text": "Yeah... that's weird af. If you're in college you can go to those parties so you don't need to go to high school parties", "author": "nightfire00", "created": 1625585624, "upvotes": 62}, "h48thf3": {"link": "/r/CollegeRant/comments/oewq0v/is_partying_with_16_year_olds_weird_for_a_2024/h48thf3/", "text": "Definitely a reasonable thing to bring up I think it’s weird. It’s one thing for a college senior to date a college freshman who’s 18, but hitting on highschool chicks when you’re in college is both morally and legally iffy. Kinda weird imo. Just stick to people of college age at least", "author": "leviathanrevived99", "created": 1625584263, "upvotes": 120}}}