{
  "sid": "llp6x8",
  "link": "/r/CollegeRant/comments/llp6x8/anybody_else_feels_like_24_hrs_is_still_not/",
  "title:": "anybody else feels like 24 hrs is still not enough nowadays? Trying to catch up on assignments but still not enough time",
  "text": "I’m usually off once my adderral kicked in but damn its 2 am and i just close my tabs. It feels like i haven’t done anything and need more time of my day. Also sleeping late is becoming normal for me so also fml",
  "author": "omogal123",
  "created": 1613548312,
  "over_18": false,
  "upvotes": 62,
  "upvote_ratio": 0.98,
  "comments": {
    "gobkwr8": {
      "link": "/r/CollegeRant/comments/llp6x8/anybody_else_feels_like_24_hrs_is_still_not/gobkwr8/",
      "text": "I literally do homework from like 10 am to 1 am and i’m still behind. this has never happened to me before in college. i really don’t understand what’s going on this semester. it seems like there’s so much more work being assigned to the point where i literally can’t do it all with the time i have. it’s really frustrating and discouraging.",
      "author": "pinpeach",
      "created": 1613982658,
      "upvotes": 1,
      "replies": {}
    },
    "gnr7vt8": {
      "link": "/r/CollegeRant/comments/llp6x8/anybody_else_feels_like_24_hrs_is_still_not/gnr7vt8/",
      "text": "[deleted]",
      "author": null,
      "created": 1613562560,
      "upvotes": 3,
      "replies": {
        "gnsce0t": {
          "link": "/r/CollegeRant/comments/llp6x8/anybody_else_feels_like_24_hrs_is_still_not/gnsce0t/",
          "text": "Yes! I feel the same way!",
          "author": "omogal123",
          "created": 1613583761,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gnr5g89": {
      "link": "/r/CollegeRant/comments/llp6x8/anybody_else_feels_like_24_hrs_is_still_not/gnr5g89/",
      "text": "I remember going through a tough semester my first semester fundamentals of my program. I had 5 mandatory co-req classes plus a lab plus clinicals and lab hours and study time, plus tutors etc. man, I had to loose sleep in order to keep up- I sounded like a lunatic saying things like “there’s just not enough time!!” Or “I’m running out of time!” To my mom as she tells me to get some sleep at 3 in the morning. That semester was really damaging and I had to take mental heath days after the semester ended because I was way past exhausted. All Tests fell under the same weeks. 5 exams in one week each exam being administered then finals. It’s was like experiencing finals week 4 times over that semester.\n I slept maybe a whole week after that semester ended and it gave me ptsd for school. I dreaded going back that spring, but I did much better with way less stress. This was fall 2019, I’m doing far much more better now.\nBut what I’m really trying to say is - I feel you with what you’re talking about. I remember feeling like wishing that I could freeze the day to study.",
      "author": "Lelricaa",
      "created": 1613560351,
      "upvotes": 10,
      "replies": {}
    },
    "gnqz5mh": {
      "link": "/r/CollegeRant/comments/llp6x8/anybody_else_feels_like_24_hrs_is_still_not/gnqz5mh/",
      "text": "Yea same. Wish days were 30 hours long because it’s 3:25 AM at the time I’m writing this and I’m wide awake. I’ll be laying here for an hour and a half before my body finally gets bored and falls asleep.",
      "author": "TrickTrot",
      "created": 1613554048,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634061992
}