{
  "sid": "o0la9o",
  "link": "/r/CollegeRant/comments/o0la9o/thought_my_summer_classes_would_boost_my_gpa/",
  "title:": "Thought my Summer Classes would BOOST my GPA",
  "text": "I'm taking a finance class and an ISOM (information systems and operations management) class this summer to lower my credit loads in other semesters. \n\nI've been really good at my previous ISOM classes, and while Finance is really difficult, I've been studying really hard and developed a solid understanding. In ISOM, I understand the material just by going to class. I thought maybe I'd get an 'A' in each class and provide myself a buffer for next year's classes. \n\nUnfortunately, my finance class's grade is based entirely on 4 tests. I got a 97 on the first one, 10 points higher than the average, much to my surprise. On the second test, I thought I understood the material much better than the first test. Then I got a 61%, the worst grade in the class. \n\nThat was a horrifying moment, especially since the class is graded on a curve, but I soon realized that I didn't upload a page of my test worth 20% of the grade. My professor is very reasonable, and typically somewhat lenient about test grading, so I'm praying he might accept the missing page now and I can get partial credit, but I'm just frustrated. I can beat the class average by a little (5 points) assuming I get a perfect score on the missing section and he doesn't take points off the top for forgetting it. \n\nI'm just frustrated that I studied 15 hours for that test, only to make a stupid mistake like forgetting to upload one of the 7 pages and now I'm in this situation. I'm trying SO hard and it's just not working out.\n\nOn top of that, one of my group assignments for ISOM got a 62% and I can't believe it. It was supposed to be a simple assignment about a concept we entirely understand, but the prompts told us to write 2-3 sentences for each question, which we did, but then the TAs left a bunch of comments about how we didn't include \"enough detail.\" I just want to scream. They're grading us off a rubric that we didn't get to see until after the assignment was graded, for NO reason. And HOW do you include detail in 2-3 sentences??\n\nI've sent emails to both professors trying to get my missing test page graded in the first and to get my assignment looked at by the professor instead of a TA in the second. I'm just so tired though. Why is the school system like this? Why can you work really hard and understand the material, but then make a mistake or two and have no chance to fix things? Why does the class format make it impossible to recover from a mistake or misunderstanding? Why do I feel like I've kicked a puppy or committed a crime because I messed up in a class? It creates this sinking hole of anxiety in my chest and even though I have so much work to do today, I can't focus on it because I'm so miserable.\n\nI really gave up half of my summer for this.",
  "author": "katsteve",
  "created": 1623782140,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "h1yazf7": {
      "link": "/r/CollegeRant/comments/o0la9o/thought_my_summer_classes_would_boost_my_gpa/h1yazf7/",
      "text": "This is what you get for taking courses solely for a GPA boost. Bad karma.",
      "author": "snoboy8999",
      "created": 1623838755,
      "upvotes": -2,
      "replies": {
        "h1yityi": {
          "link": "/r/CollegeRant/comments/o0la9o/thought_my_summer_classes_would_boost_my_gpa/h1yityi/",
          "text": "Oh that's not what I meant. I just thought that taking only two classes over the summer would mean that's I'd do better because I'd have time to focus on them. \n\nThese are classes for my major, I'm not taking them randomly. If I were taking classes just for GPA, I'd sure pick something easier than corporate finance haha",
          "author": "katsteve",
          "created": 1623844815,
          "upvotes": 2,
          "replies": {
            "h2iuktk": {
              "link": "/r/CollegeRant/comments/o0la9o/thought_my_summer_classes_would_boost_my_gpa/h2iuktk/",
              "text": "This definitely makes more sense. I wouldn’t advise what I suggested. 😂",
              "author": "snoboy8999",
              "created": 1624271698,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062668
}