{"sid": "owq2er", "link": "/r/CollegeRant/comments/owq2er/is_life_after_college_even_worth_living/", "title:": "Is Life after college even worth living?", "text": "In college, before the pandemic, there were **PLENTY** of opportunities to have as much fun, make as many friends, go to many wild house parties, night clubs, or races, and talk to, befriend, date and possibly have sex with many gorgeous women (especially those in skimpy outfits such as crop tops and short shorts). This means that most college students are immature, and thus they are fun to be with. Not only that, but in college, there were over **150** vacation days. To make matters even better, in college, there are still game centers, pools, and gyms within the campus, with plenty of long breaks between classes.\n\nNow, the pandemic is running riot and I fear that the rest of my college tenure will be spent online. I only find nothing but bad things about life after college. All the opportunities of fun go away unless I were to be a very rich man, considering that economic barriers apply to all forms of fun. People are way too bitter to even care about making friends or having fun in the slightest. House parties, night clubs, and raves aren't even a thing anymore. And it's pretty much impossible to find, let alone talk to women who are even decent-looking (let alone attractive women wearing skimpy outfits). To make matters even worse, vacations are nonexistent, as everyday might as well be considered a work day. In an even worse turn of events, the game centers, the gyms, and the pools are all gone, and all that exists is an office cubicle, with no breaks in the day. This, coupled with the maturity of people (and therefore making them boring to be with) only compounds on making life after college worse. Granted you do get paid in a full-time job but considering the necessary expenses (such as taxes, refueling, energy bills, grocery shopping, car insurance or commute tickets, etc.) that come with life after college, there is no money that is actually spared to do or buy anything other than what is necessary in getting by in life. In other words, the fun stops entirely after college. Considering that my major is computer science, which is almost, if not entirely filled with men and is completely devoid of gorgeous women, I don't have much hope here.\n\nThe key difference between men and women regarding life after college is that women have choices between marrying rich, having a regular day job for themselves, and making money through OnlyFans, and the decision is entirely up to them, so it's pretty much a pipe dream and way too farfetched to hope for an attractive woman who works a regular day job considering it's the one that requires the most effort but pays the least by far (not that I am ridiculing them for it). However, men don't have that luxury, as they are thrusted into a regular day job as they have no choice because otherwise, they would be demonized by society. \n\nConsidering that everything good about college goes away and everything bad about college gets amplified  upon graduation, is there even a good reason to live life after college if you are male and aren't rich?", "author": "MostCelsArePeaceful", "created": 1627945021, "retrieved": 1632949164, "over_18": false, "upvotes": 0, "upvote_ratio": 0.33, "comments": {"h7hkeze": {"link": "/r/CollegeRant/comments/owq2er/is_life_after_college_even_worth_living/h7hkeze/", "text": "Honestly my dog keeps me alive at this point. Live after college has been complete shit for me (I am a black woman in Texas) it’s been three months since I graduated and I just want a simple entry-level position into recruiting I have four years of administrative work, an HR internship, and one year is an associate vice president in student government. But there is no opportunity for me like literally the entry-level positions will be wanting three years of experience a degree and an HR certification and then the want this and only want to pay people $30,000. Like I really bamboozled myself. I should’ve been a fucking wh0re.", "author": "arenae99", "created": 1627946174, "upvotes": 6}, "h7hk6zw": {"link": "/r/CollegeRant/comments/owq2er/is_life_after_college_even_worth_living/h7hk6zw/", "text": "It's men working in cubicles for all eternity", "author": "huntsber", "created": 1627946065, "upvotes": 4}, "h7hir44": {"link": "/r/CollegeRant/comments/owq2er/is_life_after_college_even_worth_living/h7hir44/", "text": "Yeah, life after college is simply not worth living. Gorgeous women with skimpy clothes are the most desirable women you can ever meet and you can only do that in college.\n\nAs depressing as it is, there is possible way to mitigate this despair. Try saving up for another undergrad tuition, but for a much easier major (after being taxed) and once you do so, quit your job and enroll in the college for 4 more years.\n\n**Edit:** I didn't realize you were being unable to spare any money, so I take my hopeful advice back. Unfortunately, you're doomed.", "author": "MDWandIRhatehotwomen", "created": 1627945376, "upvotes": 5}}}