{"sid": "k8gkp4", "link": "/r/CollegeRant/comments/k8gkp4/i_may_have_failed_this_sem_in_college/", "title:": "I may have failed this sem in college.", "text": "I don't know if it is relevant here, and I'll delete if it is. But I just wanted to talk about this to someone other than my parents or friends. Or just rant. Anyway. \n\nI study in a fashion design college and I kinda like what I do even though it's so hard to learn a hand skill like stitching from scratch. \n\nUntil now in college I was coping but at home, during covid, my professors took stitching classes online and I didn't know how to do it. \n\nAnd due to my amazing imposter syndrome I put unachievable goals on myself and fail terribly. \nMy anxiety levels has shot up and I feel worthless. I don't want to say I'm suicidal but the frequency of those thoughts has increased. My anxiety cripples me and makes me sleep for days on end to escape everything. I don't even know if I'm just lazy because that's what my parents tell me. \n\nI feel trapped honestly. I don't think I'm fit even to be in this prestigious university and I feel lost and alone. I don't know what I want in life anymore and everything just seems like I'm trying very hard to catch smoke, and that's it. \nI'll be disappointing like 10 people if I dropout. And this is considering I have only 10 people in my life. \n\nIn terms of career and my future, everything looks bleak. I can't stop thinking that I'm going to live for the rest of my life as a failure because I won't be employed anywhere cuz of my stupid mental issues. \n\n\nThese internals have been terrible. Absolutely terrible. I think I've failed a few subjects. And I don't even want to look at my score because what's the point. \n\nI want to cry, but I'm truly very numb. \nI don't want to keep doing this every semester end. I don't want to feel suicidal during the end of the semester. But it's been 5 semesters and NOTHING has changed. \n\nI did have therapy in the beginning of this year but then I developed trust issues with my psychologist (smh) and I stopped going thinking I'll be fine this semester. \nBut no. \nAnd now I've failed. Therapy is expensive so I don't want to burden my parents with it. \nEvery door I try to go through always slams in my face and I don't know anymore. I want to stop feeling everything and just leave my life. \n\nEverything hurts.\n\nTL;DR : I'm failing at life and I'm feeling suicidal.", "author": "radhikaishere", "created": 1607347558, "retrieved": 1632843398, "over_18": false, "upvotes": 59, "upvote_ratio": 1.0, "comments": {"gfd2rqs": {"link": "/r/CollegeRant/comments/k8gkp4/i_may_have_failed_this_sem_in_college/gfd2rqs/", "text": "I just wanted to say that I’m word for word in the same boat as you. I don’t know if I can add anything of value, but I’m rooting for you and I believe in you. The only thing that keeps me going is the hope that things will get better :)", "author": "depressedclam", "created": 1607663209, "upvotes": 2}, "gf0mdp8": {"link": "/r/CollegeRant/comments/k8gkp4/i_may_have_failed_this_sem_in_college/gf0mdp8/", "text": "I've had a headache for days because of my stress life decisions ughhh.Sometimes its like the worlds collapsing around you.\n\nThe good news is its not.\n\n At this point you need to figure out what your goal is with school then plan a way to achieve it that works for you, most importantly don't worry about what others think.You gotta live life for you.", "author": null, "created": 1607397478, "upvotes": 2}, "gezaovq": {"link": "/r/CollegeRant/comments/k8gkp4/i_may_have_failed_this_sem_in_college/gezaovq/", "text": "First and foremost, you are not alone in feeling this way. Everyone else may seem like they have it put together, but this semester has thrown so many people down a mental health spiral. College is by far one of the easiest times to doubt yourself and your choices, but you are doing the best you can in the here and now. At the end of the day, you just have to say \"I am doing my best\". Please do not fall into the trap (myself included) of feeling like we have to please our parents or others because ultimately this is your life. It can be incredibly hard to do so, but find the little things that make you happy each day and do a little more of them. I was in the same place as you for the last two years of my university experience. I was in a soul sucking relationship that left me completely numb and empty inside. I felt like I had no future and that I was failing at everything. It took me some time to get out of this feeling (also leaving the shitty relationship helped) but what helped me the most was focusing on what I wanted rather than what other people wanted for me. You may think if you change your mind or alter your plans you are going to \"let someone down\" but I promise you that if you make a change to make yourself happy it ultimately will not matter what others think because you will be so much better off than you were before. You've got this. Now go do one thing that makes you happy.", "author": "peach_bee", "created": 1607372349, "upvotes": 4}, "geyywdu": {"link": "/r/CollegeRant/comments/k8gkp4/i_may_have_failed_this_sem_in_college/geyywdu/", "text": "Oh honey, you’re really going through it. I’m sorry. This semester has been brutal and learning online is So Hard. I know this is cheesy, but maybe you can interrupt your brain’s doom-thinking with the perspective that a shitty semester isn’t going to define you. Plenty of people have really unusual paths through education, so your life isn’t over after one bad semester, especially when this semester has been horrible for most students. This isn’t to minimize your experience, just to point out that you aren’t alone in feeling terrible. Take a breath and take care of yourself in the moment — rest, have a meal you like, take a warm bath. Whatever makes you feel better. If you need someone to talk to, my DMs are open. Once present you is feeling more ok, then you can start thinking about future you.", "author": "crunchy_tit", "created": 1607367563, "upvotes": 6}, "gey1tno": {"link": "/r/CollegeRant/comments/k8gkp4/i_may_have_failed_this_sem_in_college/gey1tno/", "text": "From reading your post I don't think you are failing at life because they are no way to do that. It seems like you're going through a tough stage in your life and it's hard to navigate it at times. Don't view your goals as \"unachievable\" because you had them for a reason: you had the initial thought that you could achieve them! However whether or not you achieve them does not define your value as a being!\n\nDon't believe your parents when they call you lazy, because you're mental health, emotions, thoughts have the right to be HONORED. I think many of us can say we have had some days where we want to escape the school. Just like you, I would sleep for days on end and miss classes just for a 'break' from school, exhaustion, and stress.\n\nWhen it comes to your life, don't let the thoughts of others influence you. It's overall just an unbearable feeling. They do not make decisions for yourself, you do! They are not you in this current moment, thus they don't know what the best decision for you is. Whether you leave school or not is not their choice to decide. \n\nAlso don't focus too much on the future or even the past, it a crippling feeling that can cause a feeling of sadness, disappointment, and anxiousness. Focus on the now, what's in front of you. It may be a good thing to look at your grades whether good or bad, I know it a horrible feeling to look at bad grades but it could cause you to reflect.\n\nI have only been to therapy once in my life, but maybe it's time to find a new therapist so that you can get what you want out of it. Also if you feel bad for not paying you can always offer to pay a portion from time to time if you can. \n\n\nIn seek to honor your existence, \n\nStranger from the internet :)", "author": null, "created": 1607352821, "upvotes": 10}}}