{"sid": "g23eg1", "link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/", "title:": "Disappointment of a Child", "text": "Hi, I am currently a first year student at a top 50 university and have parents who are chinese that immigrated to the US when they were twenty. My mother has always expected a lot out of me and throughout high school I did everything I could to make her happy. I was on the board of multiple clubs, team captain of XC and track, and had a 4.48 GPA and graduated salutatorian. I was not the happiest child in high school and told myself that I would get better once I was in college because I could get far from my parents.\n\nSince, I'm Chinese I have a lot of Chinese family friends and all of their children are at an ivy league and are extremely successful. I am the only one out of the family friend group that didn't attend a top 10 school and my mother claims she doesn't care but puts out really passive aggressive comments all the time. My mother has made me ashamed of the college I go to even though it's a great school with lots of opportunities. I have two research positions, a 3.8 GPA, and a premed biochem major but it's still not enough for her.\n\nEver since I've come home for quarantine, I have been able to tolerate everything she subtly says but today really struck a nerve. She said I should try to transfer to an even better school because the school I'm at isn't good enough and my opportunities aren't good enough. It just really sucks, because I am finally in a place where I am so happy and my mother overlooks my happiness and thinks about how I could do better.\n\nTL;DR: I just needed a safe place to rant and would like to ask for advice. It just sucks never feeling praise from your parents. I go to school and work for me, but it just still really sucks when your own mother doesn't support you.", "author": "gracestar8", "created": 1586993369, "retrieved": 1632951370, "over_18": false, "upvotes": 54, "upvote_ratio": 0.98, "comments": {"fqba6x7": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fqba6x7/", "text": "You're clearly very accomplished and have a lot to be proud of. On top of that, you seem happy with your current academic/pre-professional life, so that's something awesome to even more so enjoy. Congrats. If you're feeling bold enough, if I were you, I'd just try to explain to your mom that you're not in a competition with your family friends' kids, and there's no big, shiny trophy even if you were doing better than them (which is a subjective measure anyhow). Or just try to find inner peace if your mother's mindset isn't going to change. Keep doing you as best as you can!", "author": "bucs2013", "created": 1589233289, "upvotes": 2}, "fo3ymd2": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fo3ymd2/", "text": "I’m pretty sure your mom just wants you to go to a better school so she can stop feeling like a loser in front of all her friends Bc her friends kids all go to “better” schools. Did she even take your feelings into account in at all???  \n\nI hate the losing face part in Chinese culture.", "author": "Sakura372", "created": 1587495171, "upvotes": 1}, "fo2ewep": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fo2ewep/", "text": "Don’t let your family bring you down. Congratulations on your accomplishments! You have a bright future.", "author": "artenthusiast24", "created": 1587459757, "upvotes": 1}, "fnyc7ub": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnyc7ub/", "text": "I can definitely relate to this. Parents are tricky bc you know they sacrificed so much for you to have the opportunities that you do but your values are different bc of the way you were raised. I’m glad to hear you are happy and love your school! Hold onto that and maybe one day your mom will understand. I’m sorry you went through that :/", "author": "pixiedxll", "created": 1587358895, "upvotes": 1}, "fnl0s94": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnl0s94/", "text": "I mean if it were me I'd find a way to cut contact with her and check back in a month to see if she cares about me now, but I have no patience for shitty parenting.", "author": "scaredhorrorqueer", "created": 1587044616, "upvotes": 1}, "fnjx51f": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnjx51f/", "text": "> I was on the board of multiple clubs, team captain of XC and track, and had a 4.48 GPA and graduated salutatorian\n\n> I have two research positions, a 3.8 GPA, and a premed biochem major \n\nThis is not something that everyone can do. Your parents may not tell you this but tbh what you've achieved is more than what an average 18/19 year does. I have asian parents too so I understand what your parents put you through.", "author": "bonelesslettuce", "created": 1587009097, "upvotes": 3}, "fnjvf8m": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnjvf8m/", "text": "You're doing great. So many people could only dream of the success you're having, and I'm sure you work really hard for it. If you're happy where you're at, even better. At this point, you should probably let your folks know that you recognize that they aren't willing to acknowledge your hard work and achievements, so you're done looking for their approval. You've got so much more to live for than trying to please people who get off on withholding approval.", "author": "Queso_Hygge", "created": 1587007917, "upvotes": 3}, "fnjsh4f": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnjsh4f/", "text": "lmao, no offense but i fucking hate that chinese immigrant family attitude, like youre trying so hard to compensate for something\n\nyour family SHOULD be proud of you for what you have accomplished or at the very least use constructive criticism to help you. YOU ARE DOING FUCKING GREAT man but honestly dont forget that enjoying life is just as important if not more.\n\nDO YOU and best of luck", "author": null, "created": 1587005948, "upvotes": 2}, "fnjqmqo": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnjqmqo/", "text": "I don't understand parents who send their kids to ivy league schools for undergrad when the plan is to go to med school. Once you become a doctor, is anyone going to care where you went to undergrad? It seems like a waste of time and money.", "author": "SandraGotJokes", "created": 1587004735, "upvotes": 5}, "fnjkvdz": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnjkvdz/", "text": "brother, im koream but i fucking feel you man. the academic expectations, and all the bullshit they throw out at you and knowing for a fact you cant do much to stop is just the worst. ive got no advice for u man, cus im stuck in the same boat. but if i could say simething, its just endure it or ignore it. both are almost impossible. but u gotta hang in man.", "author": "neinjuanwon", "created": 1587001102, "upvotes": 7}, "fnjfdqs": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnjfdqs/", "text": "March to the beat of your own drum. Not your parents or your friends. You’re doing a phenomenal job and I wish you the best of luck!", "author": "WearyAnnual", "created": 1586997849, "upvotes": 8}, "fnjbs5n": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnjbs5n/", "text": "Those are serious feats, if you have the energy to do more to satisfy her, then do it, you’d do just fine anywhere it seems.", "author": null, "created": 1586995803, "upvotes": 8}, "fnjb0t2": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnjb0t2/", "text": "Do what is best for you, not your parents. It’s clear you’re extremely intelligent. Don’t let them take away the amazing work you’ve done", "author": "OiCata", "created": 1586995385, "upvotes": 10}, "fnjakze": {"link": "/r/CollegeRant/comments/g23eg1/disappointment_of_a_child/fnjakze/", "text": "Your parents have ridiculous expectations. If they won't tell you, I will: you are extremely accomplished and I only wish I was as cool as you! Two research positions and that high of a GPA is no joke. I'm proud of you!! Keep going strong", "author": "ripprinceandrey", "created": 1586995141, "upvotes": 40}}}