{
  "sid": "qklgno",
  "link": "/r/CollegeRant/comments/qklgno/how_to_get_over_fear_of_presenting/",
  "title:": "how to get over fear of presenting?",
  "text": "So this semester, most of my classes require me to present a project in front of the class. I absolutely DO NOT WANT TO PRESENT. I’m terrified of presenting I’ll\nliterally break down and cry (which is embarrassing). I stutter a lot and I start shaking— I’d rather eat glass than present. What should I do ?",
  "author": "cloudieh",
  "created": 1635794408,
  "updated": 1636192182,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hixd79y": {
      "link": "/r/CollegeRant/comments/qklgno/how_to_get_over_fear_of_presenting/hixd79y/",
      "text": "Practice, practice, practice. Gather a few family members and friends and present stuff to them.",
      "author": "RainyFL",
      "created": 1635798364,
      "upvotes": 2,
      "replies": {
        "hj8ukxu": {
          "link": "/r/CollegeRant/comments/qklgno/how_to_get_over_fear_of_presenting/hj8ukxu/",
          "text": "I’ll do that, thank you :)",
          "author": "cloudieh",
          "created": 1636000611,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiy8wkt": {
      "link": "/r/CollegeRant/comments/qklgno/how_to_get_over_fear_of_presenting/hiy8wkt/",
      "text": "I’m the same way and if you’re like me the anticipation is the worst part, I get shaky and super nauseous but I found listening to music and completely spacing out before a presentation to battle the anxiety helps. Another thing is some of my professors are letting us make videos to show the class instead of an in person presentation, see if that’s an option for you.",
      "author": "roachincalzone",
      "created": 1635811930,
      "upvotes": 2,
      "replies": {
        "hj8ujqe": {
          "link": "/r/CollegeRant/comments/qklgno/how_to_get_over_fear_of_presenting/hj8ujqe/",
          "text": "i’ll do that, thank you! but yeah my stomach hurts and i would have heart palpitations it’s not fun at all😭 i hope they’ll accept video presentations",
          "author": "cloudieh",
          "created": 1636000590,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiz5309": {
      "link": "/r/CollegeRant/comments/qklgno/how_to_get_over_fear_of_presenting/hiz5309/",
      "text": "some people say practice, but honestly, i did speech and debate for all 4 Years of high school speaking in front of people every weekend by myself and i still get nervous giving presentations. i don’t think it ever gets better for anxious people. \n\ni think the real key is mindset. you just need to remember that every single person in that class has to do the same thing as you, nobody cares what you’re saying or presenting, nobody pays much attention, they’re mostly just focused on themselves. just act like you are explaining something to a friend.",
      "author": "ham_alamadingdong",
      "created": 1635827780,
      "upvotes": 1,
      "replies": {
        "hj8uici": {
          "link": "/r/CollegeRant/comments/qklgno/how_to_get_over_fear_of_presenting/hj8uici/",
          "text": "i never thought of it like that. i’ll keep that in mind when it’s time to present",
          "author": "cloudieh",
          "created": 1636000567,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}