{"sid": "ooxi5d", "link": "/r/CollegeRant/comments/ooxi5d/not_so_much_of_a_rant_but_i_guess_a_question_is/", "title:": "Not so much of a rant, but I guess a question🤔 Is this normal/has anyone experienced this?", "text": "***NOTE:*** *There are other things I've experienced & hear of there being discrimination, but I expected that because of the area the college is located in and I have dealt with people like that at school before.*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Long Version / More Info**\n\nNot so much of a rant, but I guess a question.\n\nMy first year was awful, mostly my fault because of my lack of attention and poor mental health. People there were nice, but there were some weird things going on. Though idk if it’s normal or not cause I come from a small high school and people didn’t really act that way. Also maybe the pandemic had something to do with it. I just need to know if this is normal or not, or if anyone else experienced this at their college. Here’s what happened:\n\n* All the students were depressed, struggling, and failing all their classes. I talked to accommodations there and yes all the freshmen were failing or at least a good majority.\n* Some profs had this weird relationship with the school like it is life and nothing else matters but that. One of my profs at the beginning of the year said we had to give up health, family, friends, social life, and everything so we could solely focus on grades and school work…. And it made the whole class a bit uncomfortable.\n* The school got called out for accepting $8M+ to help aid in covid crisis, but no one knows where the money is being spent and all the students are still struggling financially. Whatever they did with it wasn’t a bad thing & illegal, I hope, but they act as though they're supporting and caring for everyone but like they mainly spend most of the time asking for money. Idk just weird. They act the same way with diversity/inclusion.\n* The school tried to guilt-trip students into not taking a break from school during the pandemic, even though a lot of students were financially and mentally struggling from this crisis. Like a lot of people loss their jobs and are unable to pay the school, which again already has $8M+ for whatever reason.\n* If anyone says anything that makes the college/staff look bad (truthful or not) then their financial aid from the school could be taken away which almost everyone is on. I thought it was weird cause when I visited they were big on telling the truth even if it wasn’t a positive thing.\n* A prof was reported and had evidence (screenshots, recordings, and eye witnesses) of him being inappropriate physically and verbally with his female students and showing signs of grooming. The school just said “do you need a counselor?” to one of the many ladies (cause the rest didn’t really come out about it) and sent an email saying everything was taken care of but the people involved said it wasn’t and that he still works there till this day. I guess they just gave him a 2nd slap on the wrist, because the 1st slap he got worse in his behavior towards the girl who reported him. Idk but I feel like they should have gone to the police, lawyer, or some kind of professional legal help since they have proof and the school isn’t helping and people online can’t help them either. But since the school made that rule that you can’t say bad things about them and their staff they probably would be in a lot of debt if most/huge chuck of their financial aid is coming from the school. This is one out of many sexual assault/harassment claims, but this was the most recent, public, and the only one with evidence to defend it that I could find.\n* Interestingly, our school is near a possible cult according to reviews. It was near the building I was supposed to stay at during my second year. I don’t think most people at the school know since most people there aren’t religious, though many are into spiritualism. I only found it because I was looking for a nearby church to attend and the reviews on it were terrible: separating people from loved ones/others not a part of the church through fear, all other churches are enemies, emotional manipulation, and saying stuff like “study to show thyself approval.” This led me down a giant rabbit hole that I’m gonna need to look at later. From my current knowledge, they aren’t doing anything illegal just being super sus.\n\nI’m in a lot of debt as you can tell, but thankfully I’ll be able to pay it off during my break from college so I wouldn’t have possible debt from transferred college (which is a lot cheaper & something that I could pay off in a reasonable amount of time or even pay in full) and debt from old college (literally too much for 1 year and too much to just let it sit there and grow). I am applying to mainly local, affordable, smaller, Christian colleges. It might not be perfect but it will be better in the long run. Plus, everyone should be able to be fully on campus when I go and I'm gonna make sure to apply early so I can get a better chance of getting a dorm without roommates.\n\nOverall, I feel like a lot of the problems that happened there were because there wasn’t good communication. It was a big school so you’re seen as a number and they usually don’t seem to really react to things unless it hurts their image from the majority of people on the outside or is hurting them financially. The school does have a lot of great resources, but I think with covid and everything it kind of ruined the experience for a lot of people and the school just wasn’t prepared, but like most people weren't either so... I hope that things get better for the school, staff, and students there. It was a wild ride, though I'm thankful for the people I met and the things I did learn there, but I decided it would be better for me to move on.\n\nSo again, my question is… is any of this normal at most other colleges that you guys went to, or has anyone experienced anything similar? Thank you :)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**TL;DR / Shorter Version**\n\nNot so much of a rant, but I guess a question🤔 Is this normal/has anyone experienced this? Everyone is depressed and failing especially freshmen, some profs telling use to basically give up life for school, the school got called out for accepting $8M+ to help aid in covid crisis but no one knows where the money is being spent and all the students are still struggling financially, the school tried to guilt-trip students into not taking a break from school during the pandemic even though a lot of people are struggling and probably wouldn’t be able to pay at the moment, If anyone says anything that makes the college/staff look bad (truthful or not) then their financial aid from the school could be taken away which almost everyone is on, prof have evidence of him grooming student by physical & verbal means and school kind of hush hush about it and he still works there (one out of many claims but the only one with evidence, that's recent, and is public), and cult nearby where I was suppose to be staying. Yes, I am planning to transfer to a local, affordable, smaller, Christian college. Overall, I feel like a lot of the problems that happened there were because there wasn’t good communication and the current crisis. I hope that things get better for the school, staff, and students there. It was a wild ride, though I'm thankful for the people I met and the things I did learn there, but I decided it would be better for me to move on.", "author": "donuthoop", "created": 1626896908, "retrieved": 1632949364, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {}}