{"sid": "nkag04", "link": "/r/CollegeRant/comments/nkag04/im_depressed/", "title:": "I'm depressed", "text": "I'm in my final year of university and I honestly dont know if I'm going to make it.\n\nI have 2 major assignments due for tomorrow and Wednesday, each have to be 20 pages long. I'm only halfway with one of them. I haven't even started with the other one. I have a test I'm writing on Wednesday and a major assignment due for next week Wednesday.\n\nIf it's not a test it's an assignment, this has been happening weekly since early March. I feel burned out, I'm constantly nauseous and I haven't been sleeping well for the past few months. I just want to give up.", "author": "Representative-Win98", "created": 1621896020, "retrieved": 1632949794, "over_18": false, "upvotes": 16, "upvote_ratio": 1.0, "comments": {"gzgc9di": {"link": "/r/CollegeRant/comments/nkag04/im_depressed/gzgc9di/", "text": "If you literally been doing nothing but school and sleep that's wow. If you lost valuable sleep due to internet addiction that ends up making you even more depressed I recommend these posts that gave me a new perspective on life. \n\n[https://www.reddit.com/r/nosurf/comments/awujub/your\\_time\\_is\\_the\\_furthest\\_thing\\_from\\_free/](https://www.reddit.com/r/nosurf/comments/awujub/your_time_is_the_furthest_thing_from_free/)\n\n[https://www.reddit.com/r/nosurf/comments/hi7skf/625k\\_karma\\_2\\_years\\_on\\_this\\_platform\\_member\\_of/](https://www.reddit.com/r/nosurf/comments/hi7skf/625k_karma_2_years_on_this_platform_member_of/) \n\nHopefully it can help you maybe feel less depressed and optimize how you spend your time. But if you're already optimized as much as possible then may you find ways online to overcome the shitty storm.", "author": "executordestroyer", "created": 1621986944, "upvotes": 1}, "gzcepuh": {"link": "/r/CollegeRant/comments/nkag04/im_depressed/gzcepuh/", "text": "I totally understand. I just finished and before then I thought I was going insane mentally. Just fight till the end and don’t give up. Falling on your ass is a good thing as you learn during these tough times. I wish you all the luck in the world and I’m sure you will graduate. And if not? Life keeps living.", "author": "Frenchdu", "created": 1621907915, "upvotes": 7}}}