{"sid": "ptbovo", "link": "/r/CollegeRant/comments/ptbovo/i_wont_teach_you_how_to_pass_the_test_i_teach/", "title:": "“I won’t teach you how to pass the test. I teach concepts”", "text": "This was what my physics professor proclaimed when someone asked if he could work an example problem. It’s pure laziness on his part. Imagine if you were in a trade school to be a mechanic. Your instructor talked about the concepts of an engine. How the parts fit together, who invented them, why they work together , and the components they are made out of. Then you get a broken engine and you have no idea how to fix it, because it wasn’t discussed….no tools were mentioned nor effective processes for reasoning or any examples of how to fix  certain problems. \nThis is how some professors lecture. It’s pure laziness. When I go to a tutor, they do wonderfully. They show an example, explain the reasoning and the tools(equations) necessary to solve the problem, then actually show you how to reason it out. Who would of thought that human beings learn from examples and repetition? \nI swear so much of college is a joke and whenever you have a problem it’s just your fault for not “studying enough”.\nMaybe the problem is inefficient teaching models.", "author": "Slybooper13", "created": 1632329448, "retrieved": 1632948434, "over_18": false, "upvotes": 10, "upvote_ratio": 0.81, "comments": {"hea8vxb": {"link": "/r/CollegeRant/comments/ptbovo/i_wont_teach_you_how_to_pass_the_test_i_teach/hea8vxb/", "text": "Thats a good example. My physics (electrostatics, magnetostatics, corcuits) class is similar. He assumes we already know the derivation/explanation of each formula/concept and some examples. However, the problem sets are a mix of different variations of the same formula, we have to write proofs showing how to derive them, and he asks us to find variables like velocity from Physics 1 using the equations from Phys2 electrostatics.", "author": "Aggravating_Ad7333", "created": 1632615012, "upvotes": 2}, "hdwpnr2": {"link": "/r/CollegeRant/comments/ptbovo/i_wont_teach_you_how_to_pass_the_test_i_teach/hdwpnr2/", "text": "If you understand the concepts and formula derivations you should be able to tackle any number of problems. Physics is conceptual. It sounds like you are struggling with the calculus or algebra,which really isn't what physics is about.", "author": "TheProfessorsCat", "created": 1632358406, "upvotes": 1}, "hdvj350": {"link": "/r/CollegeRant/comments/ptbovo/i_wont_teach_you_how_to_pass_the_test_i_teach/hdvj350/", "text": "I teach physics and 70% of my class is just example problems. \n\nIf he's not doing example problems, it must be a very short lecture.", "author": "Aler123", "created": 1632335514, "upvotes": 16}, "hdvh8vn": {"link": "/r/CollegeRant/comments/ptbovo/i_wont_teach_you_how_to_pass_the_test_i_teach/hdvh8vn/", "text": "My Prob & Stats professor is like this he will begin going over a problem then stops halfway going to office hours is a waste he refuses to go over any problem in book, on board, or assigned in class (because that may show us the process for solving the graded homework questions).", "author": "Animallover4321", "created": 1632334771, "upvotes": 7}, "hdvegr1": {"link": "/r/CollegeRant/comments/ptbovo/i_wont_teach_you_how_to_pass_the_test_i_teach/hdvegr1/", "text": "I had a bunch of kids just like you in my classes. We were in university physics 2. Which is supposed to be a calculus based class on electromagnetics, optics, and a bit of thermodynamics. This prof went out of his way to make the class easier and only used algebraic formulas. No calculus whatsoever. And his teaching style was great. But kids just like you still filed complaints because he wouldn’t work out the exact problems from the exam/quiz. And all of those kids got caught using Chegg. And what did he do? He gave them a break. He let them retake the test. They still cheated. He let them pass anyway. You guys want everything handed to you on a silver platter. You need to be able to critically think for yourself. The professor’s lecture should not be the first time you’re seeing any given material. The textbook is there for a reason. Even the shoddiest textbook provides examples ad infinitum for each concept. If the only way you can pass a class is by having the professor work out the problems that will be on the test, then you should ask yourself if you’re really cut out for this degree program.\n\nAnd before you call someone lazy, you should probably look in the mirror. You want everything handed to you. Why don’t you try and make your own review? It’s not difficult. You literally have a syllabus of what each exam and/or quiz is supposed to cover. The textbook is there. Khan academy is there. There are endless resources for you. Yet you want the prof to give you the solutions essentially. That’s what I call lazy.", "author": "spring081220", "created": 1632333643, "upvotes": -12}}}