{
  "sid": "qp8tio",
  "link": "/r/CollegeRant/comments/qp8tio/freaking_hate_my_professor/",
  "title:": "Freaking hate my Professor",
  "text": "I’m taking an ethnic studies class, it’s for my college writing intensive graduation requirement so I have to pass it. This Professor is a hot mess. She told me parenthetical citations don’t count (wtf does that even mean?). She assigns essays every week basically and if you turn something in 1 minute past the due time you get an automatic zero. She wants things pasted into a box online. I tried to email a essay once, she bit my head off and refused to take it (it wasn’t due yet but I wasn’t able to submit the text box due to technical issues). However it takes her approximately 6 weeks to grade a damn paper. She emails in all capital letters. Her online picture is a picture of her laying sideways. It’s the weirdest learning experience I’ve ever had and honestly I am having a hard time faking it in this class. I even have special accommodations for a disability which she has been notified of by the school and refuses to acknowledge. 🤬",
  "author": "edaum0726",
  "created": 1636357817,
  "updated": 1636656363,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hjsaldd": {
      "link": "/r/CollegeRant/comments/qp8tio/freaking_hate_my_professor/hjsaldd/",
      "text": "Submit your essays how your asked. On time.\n\nSeems reasonable.",
      "author": "snoboy8999",
      "created": 1636363740,
      "upvotes": 6,
      "replies": {}
    },
    "hk3jm1e": {
      "link": "/r/CollegeRant/comments/qp8tio/freaking_hate_my_professor/hk3jm1e/",
      "text": "Parenthetical citations probably don’t count in the sense that it cannot be your *only* form of citation.  Every research document/document that uses evidence/ideas/etc. from a different source(s) needs parenthetical citations AND a bibliography of final, complete citations.  If you are only doing parenthetical citations, then she is correct.",
      "author": "Hyacinth048",
      "created": 1636568471,
      "upvotes": 1,
      "replies": {
        "hk3m7j5": {
          "link": "/r/CollegeRant/comments/qp8tio/freaking_hate_my_professor/hk3m7j5/",
          "text": "I did both but apparently she did not like how I did them. Idk she doesn’t explain things well at all I’m still unclear what I did wrong.",
          "author": "edaum0726",
          "created": 1636569471,
          "upvotes": 1,
          "replies": {
            "hk3woa8": {
              "link": "/r/CollegeRant/comments/qp8tio/freaking_hate_my_professor/hk3woa8/",
              "text": "How do you format them?",
              "author": "Hyacinth048",
              "created": 1636573527,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}