{"sid": "ndp44n", "link": "/r/CollegeRant/comments/ndp44n/graduating_this_month_and_i_feel_so_lost/", "title:": "Graduating this month and I feel so lost.", "text": "I feel like my background is pretty obscure so I’ll start with that first. I’m 24 years old and I turn 25 in August. I barely made it out of high school, I even had to repeat a year, but I actually enjoyed it because I made some very close friends and helped me mature significantly. After high school I went to my local community college where I got my associates degree in liberal arts with a subpar GPA (under 3.0) which also took 3 years. During this period I spent a lot of time traveling which I’m very thankful for. After that I took a gap year and did two marketing internships and some more traveling. Then I went for my bachelors for a degree in marketing from a college in NYC (a more fashion focused college). I wanted to go this school because they had a good marketing/business program, I liked the artistic side of the school since I do photography, it was an easy commute and affordable. It was also at this school that I fell in love with learning. I’m graduating this month with a 3.86 GPA. \n\nHowever, finding a job is very difficult right now. I had an internship lined up last year but fell through because of Covid. And now I’m just not sure what to do with my life. It sucks seeing all my friends have decent jobs and moving on with their life. I have had a very good part time job all while being in school which helps me survive, but it’s not at all a career. \nI want to get into a marketing agency or do marketing within the automotive industry. But lately I’ve just been thinking about learning coding and switching to that since it pays more. I’d want to learn coding now because I don’t have a full time job to distract me, and I have my part time job to keep me financially supported. I’ve been applying to marketing jobs and internships, but they don’t get back to me, and if they do it’s just a rejection. \n\nI feel like I wasted so much time not being career focus and just living for short term rewards. I feel like I jumped around a lot and took my time and now it’s biting me in the ass. I’m worried I won’t find a job in my career and if I do it won’t pay well. I feel like I’m doing the whole “keeping up with the Joneses” kinda deal. It’s such a weird, confusing age. \n\nI’m not sure what the point of me writing all this is, but I guess I just wanted to vent and see if anyone feels the same way or has any advice. I apologize if I kept jumping around, just wanted to get my thoughts into words.", "author": "james80196", "created": 1621174168, "retrieved": 1632950805, "over_18": false, "upvotes": 123, "upvote_ratio": 0.99, "comments": {"gyet7lf": {"link": "/r/CollegeRant/comments/ndp44n/graduating_this_month_and_i_feel_so_lost/gyet7lf/", "text": "Yea I agree with the other posting. Handshake will and LinkedIn will be great tools. If your an sjsu alumni there are events in the career center that helps you connect and may possibly help you finding a job. Don’t lose hope!", "author": "itsMarckyMark", "created": 1621227827, "upvotes": 1}, "gyegwku": {"link": "/r/CollegeRant/comments/ndp44n/graduating_this_month_and_i_feel_so_lost/gyegwku/", "text": "First off congratulations on graduating that’s huge! I graduated today and I’m 27. I get what you’re feeling as I was there myself, I took a couple years here/there because I have a chronic illness and pain. I kept feeling down about not completing “on time” but everyone goes at their own pace. Your chapter 12 could be someone’s chapter 23 or 35, we all go at our own pace. You should be proud of yourself! If I were you, I’d hug myself and say “I did this because I set my mind out to do it. I may have fallen away at times, but all this makes me who I am and there’s no one else I’d rather be then me!” Start putting yourself out there on LinkedIn, Indeed, Zip, career fairs, talk to professors you trust or even the career center if your college offers one. You’ve got this my friend and you will do well!", "author": "AylaZelanaGrebiel", "created": 1621221025, "upvotes": 4}, "gyd5nfb": {"link": "/r/CollegeRant/comments/ndp44n/graduating_this_month_and_i_feel_so_lost/gyd5nfb/", "text": "Hey, man, I can get your disappointment. Unfortunately, a lot of students struggle to find a good job after graduation. And this pandemic turned everything upside down... Some friends of mine faced this problem too, and you know - they just stopped for a moment, calmed down, and thought about what skills they have in general. It wasn't about their college majors - someone started to develop their hobby, someone got a low-payed job just for some job experience to find something better later. Someone focused on family.\r  \nI just want to say - try to notice alternative ways around. Maybe, it looks not so attractive for the present moment, but everything has its time. Keep you calm inside - you're not alone.\r  \nGood luck!", "author": "James_Korbyn", "created": 1621197738, "upvotes": 6}, "gybzi1r": {"link": "/r/CollegeRant/comments/ndp44n/graduating_this_month_and_i_feel_so_lost/gybzi1r/", "text": "You have experience in two marketing internships, I suppose you could say you are... MARKETABLE *ba dum tss* \n\nKidding aside, are you using LinkedIn, Indeed, or Handshake? Linkedin seems to have many opportunities for Marketing majors. You could have people check your resume at r/resumes, if that’s a concern. Other than that, I’d say many people are in this scenario, I was, about a month ago and I just graduated last night lol. \n\nI think many of us are in this position because we want to have a job that we will love, and that’s completely ok, because we shouldn’t be beggars for jobs we don’t want since we worked our asses off to graduate. Keep searching on LinkedIn or Handshake, preferably by newest job post. I did that on Handshake and I saw wayyy better results.", "author": "DonMurray1", "created": 1621178655, "upvotes": 26}}}