{"sid": "nhdng7", "link": "/r/CollegeRant/comments/nhdng7/gonna_crash_and_burn_in_the_summer/", "title:": "Gonna crash and burn in the summer", "text": "Is it bad that I’m looking forward to it? The complete apathy from a mental breakdown seems very peaceful in a way. A 5-week course I don’t want to do so I can open up more fall classes I don’t want to do, a job I know I can’t handle, and nerve wracking driving school. I really, really needed the break part of summer break. I know responsible adults don’t get them anymore and all, but I also don’t know how they possibly get through each shitty day otherwise.", "author": "RedditSucksDuckDik", "created": 1621550531, "retrieved": 1632949983, "over_18": false, "upvotes": 15, "upvote_ratio": 1.0, "comments": {"gyy5gp4": {"link": "/r/CollegeRant/comments/nhdng7/gonna_crash_and_burn_in_the_summer/gyy5gp4/", "text": "Why is driving school nerve wracking? Should be exciting and fun! Do you have a rude instructor? Or someone who rushes you?", "author": "MyHeartIsByTheOcean", "created": 1621608227, "upvotes": 1}, "gyvykgj": {"link": "/r/CollegeRant/comments/nhdng7/gonna_crash_and_burn_in_the_summer/gyvykgj/", "text": "You got this! I am in a similar boat, I have to take three (liberal arts) 5 week classes, and one (engineering) 10 week class this summer. While still working for my family business (which is a pain at times). Working on a small guest house nearby so I can get my own room again, fixing my truck to make sure it runs so I can take it to campus in the fall, and dealing with the crazy amount of complaints and questions from my parents. All while keeping my mouth shut, because the last thing I need is getting kicked out onto the street. But life is not about it getting easier, it is how we become stronger and learn to overcome difficult challenges. You got this, just realise that getting this class out of the way can allow for more interesting classes in the future!", "author": "Flaco4Lif3", "created": 1621555934, "upvotes": 5}}}