{"sid": "p8bber", "link": "/r/CollegeRant/comments/p8bber/70/", "title:": "70%", "text": "You could’ve done better, BUT you didn’t. It is okay. Even the best make bad grades all of the time. It is okay. A bad grade doesn’t define who you are. If you let them define who you are then you’re the one letting yourself down. You will be okay. You will grow, that is what’s most important.", "author": "baileyaber", "created": 1629485081, "retrieved": 1632950867, "over_18": false, "upvotes": 102, "upvote_ratio": 0.99, "comments": {"hatsp5u": {"link": "/r/CollegeRant/comments/p8bber/70/hatsp5u/", "text": "Fight for 100% every time. It is in your power.", "author": "JM10JM10JM", "created": 1630258683, "upvotes": 1}, "h9tab25": {"link": "/r/CollegeRant/comments/p8bber/70/h9tab25/", "text": "Junior college guy here. Throughout my life so far in college, I never cared if a 70% is what I get, as long as I pass the course. \n\nBut even with that in mind, I still try my best in every class, even if I don’t like the subject. And now my GPA is 3.6. I have never been happier, but it’s always helpful to understand that the 70% net is there to catch you, but should not be your goal. That’s what’s helped me get through college so far.", "author": "xSevusxBean4y", "created": 1629568447, "upvotes": 1}, "h9shnwr": {"link": "/r/CollegeRant/comments/p8bber/70/h9shnwr/", "text": "I am in my second last year of highschool and i cant get myself to study, everything mentioned in google dont work. I just read manga all day, even if i actually manage to sit with my notebook i study for like half an hour and then end up getting distracted or just dream while sitting there. This didnt happen before in 6th or 7th grade, but its happening now when i actually need to study and its been bothering me for a while.", "author": "Fox-Child", "created": 1629555417, "upvotes": 2}, "h9s1mof": {"link": "/r/CollegeRant/comments/p8bber/70/h9s1mof/", "text": "As someone who failed their very last exams of uni, now has to retake them but is surely gonna fail again: thank you. I needed this.", "author": "churchisforbrunettes", "created": 1629546223, "upvotes": 1}, "h9qur9q": {"link": "/r/CollegeRant/comments/p8bber/70/h9qur9q/", "text": "Ah yes reminds me of the time I got humbled by first year chemistry, TWICE. came out of high school Chem with a 99%, went into uni and applied the same study methods and my first midterm was a big fat 60. It taught me to see every 'failure' as a learning opportunity and now in my junior year I am thriving and I wouldn't change my experiences and struggles for anything because they were amazing learning opportunities.", "author": "IamKare", "created": 1629514488, "upvotes": 1}, "h9qlw75": {"link": "/r/CollegeRant/comments/p8bber/70/h9qlw75/", "text": "I legit failed my first course of my major.\n\nI thought it defined my career path and it dropped my GPA significantly.\n\nBut, it turns out it didnt and I'm still in my program till today - just a semester behind but I learned to forgive the failed class and myself after awhile. The fail happened fall of 2019.\n\nI absolutely agree with you, bad grades do not define us as students!", "author": "Lelricaa", "created": 1629510161, "upvotes": 6}, "h9qlin7": {"link": "/r/CollegeRant/comments/p8bber/70/h9qlin7/", "text": "Thank you, I needed this.", "author": "queersunflowerbee", "created": 1629509975, "upvotes": 2}, "h9px03l": {"link": "/r/CollegeRant/comments/p8bber/70/h9px03l/", "text": "There are some classes where I'm just mindfully hoping I get at least a 70% just to pass the class and get it over with. \n\nLove the sentiment, it's a great mantra to have no matter the grade.", "author": "Map-leaf", "created": 1629498411, "upvotes": 25}}}