{
  "sid": "qohzbl",
  "link": "/r/CollegeRant/comments/qohzbl/all_my_friends_are_stoners_but_i_want_to_get_ahead/",
  "title:": "All my friends are stoners, But I want to get ahead",
  "text": "Alright so all of my close friends are total drug addicts and won’t admit it and then shame me for wanting to get ahead. For some context I am studying chemistry while most of my friends are liberal arts (journalism, graphic design, public relations etc). Freshman year was super easy for me as I had already taken lots of AP credits and was not thinking about research or internships, but now that we are juniors I am feeling totally different. I came to college a child. I never had to study and got straight A’s. Therefore I had a lot of time to hangout with friends, and we ended up smoking a lotttt. Now I am much more dedicated to my studies and really really want to get into a PhD program. I believe in myself, but I need to put in a lot of work and extra hours to stay ahead in classes that way I have time for research and internships as well. BUT my friends don’t seem to understand that if I really want to get ahead I need to study/work most of the weekends and nights. They say stuff like “cmon man it’s 8:00pm on a Saturday you shouldn’t be working,” but all I want is to be a scientist. Sometimes I can easily ignore them and go to the library, but other times I feel like a horrible friend for not seeing them for a week or two. I want them to understand that I love and appreciate them, but I have way more work than they do and I have to do my own studies outside of the bare minimum required for class. I’ve told them this straight up but they look so disappointed. I have some STEM/work friends but we are nowhere near as close. I don’t feel comfortable having them over my apartment because my roomate just plays rap music and smokes chronic. Lol. I guess I just want some advice on how to balance my academic studies and friends. I have a two year lease with the stoners so I can’t just leave them. Am I being a square and working too much? I want to make the world a better place through science, but I feel like a loser. Help pls 💚.",
  "author": "No-Economy-666",
  "created": 1636262808,
  "updated": 1636656375,
  "over_18": false,
  "upvotes": 21,
  "upvote_ratio": 0.86,
  "comments": {
    "hjn6xec": {
      "link": "/r/CollegeRant/comments/qohzbl/all_my_friends_are_stoners_but_i_want_to_get_ahead/hjn6xec/",
      "text": "Hi, I’m a neuroscience major at a school where most people are STEM majors. Here, it’s very normal (almost customary) to want to get ahead and get into a good PhD program and spend most of your free time studying.\n\nI don’t think you’re being a square or whatever. You’re growing up, and you’re possibly growing out of your friend group. This is a part of life and it’s totally normal. I suggest informing them that you need to dedicate more time to studying so you can get into a good grad program and perhaps schedule a day where you guys can all hang out! These are NOT your friends if they can’t support your goals.",
      "author": "idkmanwhyyouaskingme",
      "created": 1636263557,
      "upvotes": 5,
      "replies": {
        "hjn7orp": {
          "link": "/r/CollegeRant/comments/qohzbl/all_my_friends_are_stoners_but_i_want_to_get_ahead/hjn7orp/",
          "text": "Wish I was at your school lol. I chose the cheapest undergrad because I heard grad school matters way more and I always knew I wanted to go on. It’s not that they don’t support me they just don’t understand…. I really wish they would grow with me because I know deep down they also want to get ahead, but they are stuck in the trap of thinking oh it’s the weekend I should party. If that makes sense. I guess they will come along at their own pace. Have a wonderful evening my friend.",
          "author": "No-Economy-666",
          "created": 1636264080,
          "upvotes": 3,
          "replies": {
            "hjoh07q": {
              "link": "/r/CollegeRant/comments/qohzbl/all_my_friends_are_stoners_but_i_want_to_get_ahead/hjoh07q/",
              "text": "Sometimes you have to break up the roots in your soil and bloom elsewhere in order for everyone to bloom individually",
              "author": "magnolia843",
              "created": 1636297001,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hjn6deh": {
      "link": "/r/CollegeRant/comments/qohzbl/all_my_friends_are_stoners_but_i_want_to_get_ahead/hjn6deh/",
      "text": "Edit. Reading this back I want to make it clear that liberal arts majors are totally awesome and I could never do that it’s just not In my DNA. Some of the art kids I know grind wayyyy harder than me but it is acceptable for them, but when I want to spend a whole Friday night reading research papers I get called a nerd. Total respect for my artist homies 💚. Also my friends are good students they just don’t go above and beyond. They get good grades and always pass their classes, but do the bare minimum and just work at target n shit instead of applying for competitive positions in their fields.",
      "author": "No-Economy-666",
      "created": 1636263199,
      "upvotes": 6,
      "replies": {
        "hjozgfr": {
          "link": "/r/CollegeRant/comments/qohzbl/all_my_friends_are_stoners_but_i_want_to_get_ahead/hjozgfr/",
          "text": "That is ok. I just started trying end a friendship with a similar problem. She's studying diplomacy (and crisis aversion) so most of her classes are thought and discussion based. They're not easy but she does enough work to do well enough in them.I'm in a very different track (accounting, and before the business major jokes start) I do want to do well in my field. It took more effort than it was worth to understand that rn I am where I need to be to do well (internships) and that I can't spend all of my free time with her (or her drinking).   \nIt's perfectly ok to realize that you want and need something to do something different from the people you call friends.",
          "author": "discerningpotato",
          "created": 1636304450,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjnhxvk": {
      "link": "/r/CollegeRant/comments/qohzbl/all_my_friends_are_stoners_but_i_want_to_get_ahead/hjnhxvk/",
      "text": "Most people aren’t ambitious, and so they have more free time. They want to live comfortably, and don’t have a burning need to get further ahead and into some niche field of research you may be interested in.  Wanting a comfortable, decent life is totally valid. People who are in science are a minority and even there people who want to get ahead and do research are a minority. \n\nThat being said, i totally understand. In my experience some feiendsips will survive this difference, others won’t. I can’t really give you solid advice, i’m not wise. But i’ll try anyway. Decide for yourself, how much effort you are willing to put into friendships. See if that is enough for any of your friends. See if any of them understand that you have your own shit going on, and their entertaient is not more important than your career. \n\nFor me, one of my old feiendships survived, two did not. One of my new uni feiendships ended up falling apart for the same reason (study sessions quickly turned to her smoking weed and me sitting and readong alone), and another turned into a relationship (she is as ambitious as i am, and we help and support eachother in our studyes).\n\nI’m just rambling at this point, i lost the thread. Point is: dont close yourself off, but if studying is important to you, that is what you should do. If you have good friends, they’ll understand. If they are bad friends, you don’t need them, and you’ll find better.  Some amount of time should be dedicated to friends though, you don’t want to end up successfull and lonely. \n\nI hope my rambeling incoherent answer helped you, good luck.",
      "author": "Ohm_stop_resisting",
      "created": 1636273265,
      "upvotes": 2,
      "replies": {
        "hjrzi7b": {
          "link": "/r/CollegeRant/comments/qohzbl/all_my_friends_are_stoners_but_i_want_to_get_ahead/hjrzi7b/",
          "text": "Appreciate you Mr. Ohm",
          "author": "No-Economy-666",
          "created": 1636354150,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}