{"sid": "pkbmah", "link": "/r/CollegeRant/comments/pkbmah/professors_need_a_damn_howto_online_circulum/", "title:": "Professors need a damn how-to online circulum", "text": "I think online is beneficial for multiple reasons **AS LONG AS THE COURSE STRUCTURE IS MADE TO BE BENEFICIAL AND ADVANTAGEOUS FOR STUDENTS.**\n\nI have a professor who is going overboard as well as a professor who is structuring things beautifully. I am inspired to compile a list of things I think should be standard for online courses, feel free to add or rant.\n\n1. **Keep the due date time 11:59.** I'm tired of seeing these 12pms, 5pms, 8pm, etc.   \n\n2. **Upload the resources you intend on being of use.** No more saturated BlackBoard/icollege/etc pages with information that is never used. Only keep the important things that are pertinent to foundation knowledge and exams, pls.  \n\n3. **You cannot be hybrid asychronous/synchronous, pick one.** We adjust our schedules based on your structure, can't having you switching up and then me being accountable for lost information you spontaneously shared and never uploaded for me to know about. Sick of it.  \n\n4. **Please turn the mic up on your videos.** My speakers only go up to 100%, not 200%, not 300%...  \n\n5. **Please start yo class on time and finish on time.** I will not be held captive just because it is online.  \n\n6. **Sessions should be 85% covering material and 15% answering questions.** If I had a dollar for every time an instructor stopped to answer every question, I would not be here right now. I'm tired of only getting through 2 slides of a 90 slide ppt. PLS.  \n\n7. **Do not give break out sessions if the objective was not furfilled.** Its literally just 6 students in a chatroom and silence for like 20 minutes.", "author": "Ether_of_Joti", "created": 1631111345, "retrieved": 1632950312, "over_18": false, "upvotes": 211, "upvote_ratio": 0.95, "comments": {"he3fxm9": {"link": "/r/CollegeRant/comments/pkbmah/professors_need_a_damn_howto_online_circulum/he3fxm9/", "text": "6. Wait, you got students asking questions? What’s that feel like?", "author": "AcademicDifficulty", "created": 1632493781, "upvotes": 1}, "hc6hyz0": {"link": "/r/CollegeRant/comments/pkbmah/professors_need_a_damn_howto_online_circulum/hc6hyz0/", "text": "i have assignments that are due during my other class times :( please god just put everything at 11:59pm", "author": "beesbuzzingintensely", "created": 1631194905, "upvotes": 2}, "hc3de0c": {"link": "/r/CollegeRant/comments/pkbmah/professors_need_a_damn_howto_online_circulum/hc3de0c/", "text": "ALSO don’t put tests after university times. Professors at my university put tests at 8:00 pm or on saturdays. It sucks.", "author": "jennie033", "created": 1631127941, "upvotes": 16}, "hc347be": {"link": "/r/CollegeRant/comments/pkbmah/professors_need_a_damn_howto_online_circulum/hc347be/", "text": "Amen on 7", "author": "KungP0wchicken", "created": 1631124159, "upvotes": 1}, "hc31r8z": {"link": "/r/CollegeRant/comments/pkbmah/professors_need_a_damn_howto_online_circulum/hc31r8z/", "text": "Professor here: trust me, we’ve had plenty of “online training.” The problem is a lot of it is run by people more focused on bells and whistles of LMS systems and how to foster “engagement” than actually learning how to transfer our content online in a way that’s easy to decipher.\n\nEdit: I’ve hated every single online course planning training I’ve had to attend and the focus on “active learning” rather than discipline specific filming/activity/content structure ideas.", "author": "Jonjoloe", "created": 1631123156, "upvotes": 55}, "hc2wn62": {"link": "/r/CollegeRant/comments/pkbmah/professors_need_a_damn_howto_online_circulum/hc2wn62/", "text": "The first point about keeping the time at 11:59.. god bless. I had a professor hit me with the 8pm due dates this semester and let me tell you, I was quite stressed from 7:37pm to 8pm the day of.", "author": "rainier-cherries", "created": 1631121068, "upvotes": 38}, "hc2ucm5": {"link": "/r/CollegeRant/comments/pkbmah/professors_need_a_damn_howto_online_circulum/hc2ucm5/", "text": "I understand that online learning is just as hard for professors as it is for students, but for the love of everything holy PLEASE show the students grace. Us students are expected to be patient and understanding when professors run into any technical issues but the minute I have a technical problem submitting an assignment everything is my fault and I should've prepared better", "author": "where_r_theavocados", "created": 1631120117, "upvotes": 64}, "hc2m8pc": {"link": "/r/CollegeRant/comments/pkbmah/professors_need_a_damn_howto_online_circulum/hc2m8pc/", "text": "Professor here: can you elaborate on #7? I don't understand. \n\nAlso, this is a pretty great post, maybe post it to r/college where many professors lurk about? If you worded this a tiny bit differently it wouldn't be a rant, it would be actually helpful advice.\n\n[edit] fixed a misguided recommendation.", "author": "titosphone", "created": 1631116779, "upvotes": 11}, "hc2e069": {"link": "/r/CollegeRant/comments/pkbmah/professors_need_a_damn_howto_online_circulum/hc2e069/", "text": "**8. For the love of all things holy, understand that asynchronous online courses are not the same as synchronous in-person.** I've had to drop a professor's course twice in as many semesters because he required the same amount of work as before the pandemic, not taking into account that most of those assignments used to be done during class. Giving six relatively labour intensive assignments each week due at midnight on Fridays along with coursework from other classes is asking far too much.", "author": "sashathebrit", "created": 1631113315, "upvotes": 15}}}