{"sid": "oviomw", "link": "/r/CollegeRant/comments/oviomw/may_need_to_change_major_advice/", "title:": "May Need To Change Major, Advice?", "text": "Hey everyone, I am new to reddit and needs some advice.\n\nI am a business management and marketing major and I need a 3.0 GPA to progress in my program.\n\nThis summer, I took two summer classes to raise my gpa. Long story short, I may end this summer with a 2.9 GPA because of the grade in my Finance class, so I may not be able to continue in my business school.\n\nI've been doing my research and I may be able to do an advertising major and a business administration minor. So, I may still be able to have business courses on my degree.\n\nI am just freaking out and need advice or something as I am dealing with this.\n\nThanks guys.", "author": "justlivinglife321", "created": 1627779286, "retrieved": 1632951388, "over_18": false, "upvotes": 51, "upvote_ratio": 1.0, "comments": {"h7bvzz9": {"link": "/r/CollegeRant/comments/oviomw/may_need_to_change_major_advice/h7bvzz9/", "text": "University instructor and student success staff member here. First, talk to your advisor, as u/L4dyGr4y said. See what guidance they can give you, since they know the requirements, people, and ins and outs better than any stranger on Reddit.\n\nSecond, why is that your plan of study? If you really want to do business administration with a marketing spin, then ask yourself if you can get the same job you want with your proposed new plan of study, which seems to make marketing/advertising the primary focus, with administration taking a back seat. If you can still land the kind of job you want with the change in your plan of study, then you may be in good shape. You should also think about what OTHER jobs you might land with each program.\n\nIf you can NOT get the job you want with a change in program, then you should find ways to raise your GPA. Can you afford to take some additional courses to round out your skill sets and raise your GPA? Doing so would add a semester or a year to your time in college, but if your heart is set on your original plan of study, then that’s the way to go, provided you can afford the additional tuition and fees.", "author": "mr-nefarious", "created": 1627836203, "upvotes": 2}, "h7au7p9": {"link": "/r/CollegeRant/comments/oviomw/may_need_to_change_major_advice/h7au7p9/", "text": "Check with your advisor.\n\nGap year? Take a few credits you need and work full time. Get your GPA back up.", "author": "L4dyGr4y", "created": 1627814803, "upvotes": 8}}}