{
  "sid": "p9lkl2",
  "link": "/r/CollegeRant/comments/p9lkl2/finding_out_college_housemates_lied_to_me_and/",
  "title:": "finding out college housemates lied to me and about me",
  "text": "So this happened about two-in-a-half years ago (I was 22 then) while I was a transfer in undergrad. Just wanted to share this story because it still annoys me and i think it's cos i haven't told anyone about it. Gonna be a long story xD\n\nI moved in a nice apartment set by the school and got to stay in a double-room because my initial roommate withdrew her enrollment so I ended up alone. A year later, all is good, chill roommates etc. I come back to the apt after going home to visit my parents and \"G\" (22f) and \"A\" (28f) stops me by the kitchen on the way to my room. A asked me if it was cool that she moved into my double room with me as she can 'no longer afford her single room'. (I didn't know how transferring rooms worked, i just thought I had to say yes and it was done.. HA! silly me.) So, I said yeah that was fine with me (we live in CA, crazy rent). After that A thanks me and leaves the room and it's just me and G. G asked me if I was \"really ok with it.\" I said something along the lines of \"well sure, it kinda sucks i no longer get my own privacy... but a roomie was good because I hate sleeping alone (i get nightmares A LOT) + i stayed in a double so I assumed a roomie was coming sooner or later\" Y'all i did not expect that this shit was gonna backfire on me.\n\n2 weeks go past and I'm wondering where A is. I cleaned up the other side of the room for her and removed all of my stuff from the other side of the closet, etc. We don't usually run into each other even at home because like I mentioned before, we have our own schedules so I'm just kinda playing the waiting game.\n\nAbout another month goes by and I get an email from the Student Housing that I will be getting a new roommate. To my surprise, it was not A. Let's call her Marissa. At first Marissa was a bit quiet and didn't bother trying to talk to me, but it didnt bother me. I thought she was just shy?? Anyway, we ended up joining a club together (unplanned) and started hanging out everyday. Basically, we got really close. Finally, one day me, Marissa, and another friend of ours were hanging out and brought up A during a random conversation (they were her friends that eventually became my friends too). I asked her if she knew what happened with A as I thought she was gonna be my roommate but i haven't seen her in a while. Marissa and other friend finally tells me that A actually got expelled from the school before the Fall Semester because she couldn't keep up with the school rule of maintaining a 2.0GPA (we went to one of the top schools in CA). I DIDN'T EVEN KNOW THAT 'A' WAS NOT LIVING WITH US ANYMORE. Not only that, I find out that G told A what I said about \"sucks not having my own privacy\" (completely blew it out of proportion btw) and so A was upset at me. She literally left being upset with me because of what G told her. I felt so bad, but also she (they?) tried to use me... When she didn't move in with me, she moved into her ex-girlfriend's apartment and after a month the ex-gf asked her to leave because she couldn't pay any rent, utilities, food, etc. and wasn't willing to go back home because she didn't want her mom to find out she was expelled. I don't know if G was aware of her situation all along, but I found out that G told Marissa she should not room with me because I was a \"bitch\" and \"needy for my own privacy\" thats why A couldnt stay with me. The twisted story of me \"saying no\" to A basically spiraled and spread amongst all of our friends, but managed to stay away from me for pretty long.\n\nIt still makes my bones hurt because G was such an innocent seeming person and the fact that A (they?) tried to take advantage of me. TBH i would have been so down to let A live in the living room and eat my food until she got on her feet but they just painted me as the bad guy and ran with it so it's whatever.\n\nFast forward, I graduated a year early so I got out of the whole housing situation. Marissa and G actually ended up rooming together because G couldn't find anyone to lease with so she asked to jump on Marissa's lease. Didn't turn out too well, but oh well.\n\nNot everyone is your friend, people. Thanks for letting me let this rant out after so long.\n\n&#x200B;\n\nTL;DR\n\nEx-housemate tried to live with me in my room provided by the college, when in fact she was expelled from the school already. Didn't work out + housemates spread lies about me that I soon found out. ",
  "author": null,
  "created": 1629668323,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.7,
  "comments": {
    "h9zumlf": {
      "link": "/r/CollegeRant/comments/p9lkl2/finding_out_college_housemates_lied_to_me_and/h9zumlf/",
      "text": "this is shitty. very shitty. i’m sorry you experienced that. but if youre still at a place where your “bones hurt” just from thinking about it 3 years later, you haven’t totally moved on from it. you need to though, for your own mental well-being.",
      "author": "trinitypisarsky",
      "created": 1629692739,
      "upvotes": 6,
      "replies": {}
    },
    "h9z7m1y": {
      "link": "/r/CollegeRant/comments/p9lkl2/finding_out_college_housemates_lied_to_me_and/h9z7m1y/",
      "text": "Yo this is pettier than the nonsense I dealt with from my sorority. Look, girls are catty and the majority of people who you hang out with aren’t actually your real friends- they’re acquaintances. Why are you still worried about this? You gotta move on",
      "author": "bluenails4444",
      "created": 1629680521,
      "upvotes": 1,
      "replies": {}
    },
    "h9z5dio": {
      "link": "/r/CollegeRant/comments/p9lkl2/finding_out_college_housemates_lied_to_me_and/h9z5dio/",
      "text": "You are 25 and this happened almost 3 years ago? Gotta move on.",
      "author": "snoboy8999",
      "created": 1629679433,
      "upvotes": 1,
      "replies": {
        "h9z7eig": {
          "link": "/r/CollegeRant/comments/p9lkl2/finding_out_college_housemates_lied_to_me_and/h9z7eig/",
          "text": "oh of course! I posted this because I forgot it ever happened, and then I was triggered this morning when my sister was telling me about her housing situation now and how complicated it's been. Didn't realize it bugged me until today so I just wanted to rant on reddit :D",
          "author": null,
          "created": 1629680417,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634062706
}