{
  "sid": "qif61h",
  "link": "/r/CollegeRant/comments/qif61h/im_completely_lost_in_programming/",
  "title:": "I’m completely lost in programming",
  "text": "I got an email from my teacher saying they several students have 0’s or have straight up just stop doing the work and that we can’t afford 0’s if we want to pass. I really tried to understand what I was learning. I pulled an all nighter re-watching all of the lectures and powerpoints from the module only to end up looking up the answer online and copy paste it to word pad (with a few changes to make it not look too obvious)and turn it in, and if they do realize it’s copy and pasted I honestly don’t think they’re gonna care. I’ve have an 80% in the class and that’s all I’ve been doing so far. I don’t know if I’m just dumb or if the way they teach programming in college is just shit, or both. It’s been about 5 months and I’ve gotten more clarity on what I’m learning through short videos on YouTube than the 33 minute lecture videos in class and I see many people in the comment sections saying the same. \n\nMy major is animation but programming is my backup and I really do want to learn programming, I like it and think it’s a useful skill to learn. I’m thinkin it was probably a better idea for me to stick to my original plan and self teach. From useful videos I found But on the other having a degree does look good on your record when getting a job so idk. I guess I gotta just go through with it now.",
  "author": "Maddmira8",
  "created": 1635520773,
  "updated": 1635780225,
  "over_18": false,
  "upvotes": 52,
  "upvote_ratio": 0.92,
  "comments": {
    "hijq4p4": {
      "link": "/r/CollegeRant/comments/qif61h/im_completely_lost_in_programming/hijq4p4/",
      "text": "You should start by learning Data Structures & Dynamic Programming. I'm assuming you have got the basic proficiency in writing code like loops and stuff. \n\n[This playlist is in Hindi but its the best Dynamic Programming playlist](https://www.youtube.com/playlist?list=PL_z_8CaSLPWekqhdCPmFohncHwz8TY2Go) out there by far. So, if translate works fine then go have a look.\n\nAs for Data Structures, apply to the Algorithmic Toolbox course by UC San Diego. They've some pretty good stuff there. Then there's also [geeksforgeeks](https://geeksforgeeks.org). They update their content daily and you can learn everything from scratch. Students in India learn everything from here. And most importantly, programming is about practice my friend. Just practice as much as you can. Solve questions on leetcode, interviewbit and geeksforgeeks and you'll be fine. And yeah, be consistent.",
      "author": "aabhasamol",
      "created": 1635533587,
      "upvotes": 9,
      "replies": {}
    },
    "hiivgkd": {
      "link": "/r/CollegeRant/comments/qif61h/im_completely_lost_in_programming/hiivgkd/",
      "text": "I switched from CS to IT because I’m too dumb for CS but IT people still get good jobs from my school",
      "author": "Silentero",
      "created": 1635521628,
      "upvotes": 12,
      "replies": {}
    }
  }
}