{"sid": "pv0gwa", "link": "/r/CollegeRant/comments/pv0gwa/yes_just_assume_i_know_what_to_do/", "title:": "Yes, just assume I know what to do...", "text": "I'm taking a Computer Science course with possibly the most complicated project specs I've ever seen. Not because they're particularly long or require a lot of different tools and functions, but because I have very little idea of how to implement them. I'm starting early enough to figure it out by submission time, but wow. We didn't do anything like this in the prerequisite classes, and we didn't go over any of it in this class. We just went over some basics of C/C++ file organization, and then... we get the project specs. They involve I/O, trees, lists, commands... it was suggested we use C++, but the few bits of example code are written in C. It doesn't even say how we're supposed to submit the program for grading.\n\nSubsequent class materials since the project was assigned have completely ignored it, so I've just been set adrift to try and decipher what I'm supposed to do. I'm going to have to email the instructor about certain parts of it, which is why I'm venting here.\n\nI'm extra annoyed because this has been happening in every CS class I was warned would be \"hard\", but they're only \"hard\" because of things like this. What's the point of the lectures if they don't have anything to do with the projects? Better yet, what's the point of projects in a class that has no emphasis on coding (and what I'm coding doesn't relate back to the lectures)? I'd rather just devote my time to studying what we're actually going to be tested over instead of burning brainpower trying to solve a problem that won't ever come up again.", "author": "Net56", "created": 1632547701, "retrieved": 1632948411, "over_18": false, "upvotes": 6, "upvote_ratio": 0.88, "comments": {"he949ru": {"link": "/r/CollegeRant/comments/pv0gwa/yes_just_assume_i_know_what_to_do/he949ru/", "text": "Are you in my CS class? Lol. I had to withdraw from a class just like this a few days ago. I talked to 3 TA’s and still had no idea what to do and the professor ignored all of my emails to the point where I would have gotten a 0 on the assignment. I’m going to have to take the class next semester, but I’m glad I have time to teach myself C now...", "author": "sthedragon", "created": 1632596225, "upvotes": 3}}}