{
  "sid": "q6sg2g",
  "link": "/r/CollegeRant/comments/q6sg2g/struggling_with_everything/",
  "title:": "Struggling with everything",
  "text": "Title basically says it. I am struggling academically, mentally, physically, socially, emotionally, and financially. \n\nAcademically - I don’t understand anything that is going on in class and I have a hard time trying to pay attention\n\nMentally - I am very exhausted and tired all the time and don’t have the motivation to do anything\n\nPhysically - Just walking to class is very tiring\n\nSocially - I have no friends and don’t have the energy to talk to people\n\nEmotionally - I feel depressed all the time and always tend to stay up very late\n\nFinancially - My dumb self took out financial aid when I didn’t need it and now I’m stressing over how I’m suppose to pay it back\n\nI am struggling so much even though I am taking “easy” classes. I am a freshman and all my class are gen ed, only taking 14 credits and I can’t even handle this. I feel like it’s only going to get worse from here.",
  "author": "pearybeary_",
  "created": 1634063195,
  "updated": 1634596105,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.79,
  "comments": {
    "hgee1m1": {
      "link": "/r/CollegeRant/comments/q6sg2g/struggling_with_everything/hgee1m1/",
      "text": "Hey, I totally feel you.\n\nI don't exactly know the right things to say and I know that my comment alone won't take away any of your stress, but if I could give you any advice, however, I'd say maybe try to slow things down and take everything one day at a time (easier said than done). I personally am still trying to get a grasp on everything as well.\n\nJust for a little background, I am a freshman as well and taking 12 credits--- also what most people consider to be the \"easy\" classes... and to put it bluntly, I have never struggled more with school in my life.\n\nTo be fair, I have never been the best student, but I feel like since starting college I have been eating, sleeping, and breathing school work and it's still not good enough. Ever since the beginning of college, I've cut off communication with the only two friends I had (not intentionally), and I'm already failing two of my classes. I feel dumb sometimes because I feel like it's just expected for everyone to do everything and feel completely fine.\n\nBut, school is difficult. I see this as a fact.\n\nI think everyone is struggling somehow or another, and when I say that, I am in no way trying to say that your struggles are not valid! They 10000000% are!!! \n\nAll I mean by this is you are not alone.\n\nI feel like mental health is something that a lot of students (and people in general) tend to push aside in order to focus on school or other things (myself included), but sometimes you have to put yourself and your health first.\n\nI read something one day about this and I haven't been able to stop thinking about it since. It said something to the extent of:\n\nIf we have a cold or are injured in some sort of way, it is almost no question for us to stay at home and rest/do whatever we need to do in order to get better. But when it comes to mental health, we are pretty much taught to work through it, grin and bear it, and eventually, things will get better... But why treat the two so different? You're not going to continue to walk on your leg if it's broken because it will never heal, so why should we treat our minds in a similar fashion?\n\nI feel like this speaks measures about how people go about taking care of themselves; we tend to focus on merely the more \\~obvious\\~ things and ignore our internal status.\n\nI know life can feel exhausting and I really wish I knew something that could make things easier on you.\n\nI know I have no idea who you are personally, but I can tell that you care a lot about your education despite how it is affecting you. \n\nSometimes we need to just take a second away from everything else and just sit and breathe and think.\n\nSomething I personally like to do is journal when I get overwhelmed; It helps me to express how I'm feeling without exerting too much energy. (Reddit is also a great place to do this too!)\n\nBut yeah. College is hard. I feel like society put so much pressure on people, especially people our age (I am assuming you're around 18 like myself but if you're not I apologize for assuming).\n\n\\~\\~\\~\n\nI am so sorry that life is difficult right now and you feel mentally and physically exhausted, but I believe in you and I know that you can get through it. You are strong and more than competent.\n\nGood luck with everything\n\n<3",
      "author": "EmotionalINFP",
      "created": 1634071092,
      "upvotes": 3,
      "replies": {
        "hgexe2n": {
          "link": "/r/CollegeRant/comments/q6sg2g/struggling_with_everything/hgexe2n/",
          "text": "Thank you <3 and yes I am 18",
          "author": "pearybeary_",
          "created": 1634079294,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgfsejy": {
      "link": "/r/CollegeRant/comments/q6sg2g/struggling_with_everything/hgfsejy/",
      "text": "Welcome to college!!! Honestly, I think most freshmen go through this and it’s especially bad since we’ve had 1.5 years of covid school which makes going back to normal so much more draining. I’m currently a sophomore, and I felt the exact same way as you did when I was a freshman. The best advice I can give is to make sure you take care of yourself. \n\nAcademically: go to office hours, seek out tutoring, but be kind to yourself. College courses are going to be hard and the profs (mostly) know that. They want you to do well, and most of them are very helpful if you ask for it. \n\nMentally: make sure you’re getting enough sleep, it makes a world of difference. I know it can be hard, but I personally prioritize sleep over everything else, and will put aside academic pressures to make sure I get a full night of rest. I know I’ll function better in every aspect of my life if I get enough sleep, even if it means I do less work. Also, look into getting therapy if you aren’t already. A lot of schools have counseling centers that are free to students, so look into that if you’re not sure where to start. \n\nPhysically: again, get sleep!!!! It will make you more tired at first, but it helps so much if you can consistently get enough. Also, make sure you’re eating well. It can be really hard to focus and you will start to feel tired all the time if you aren’t eating enough, so make sure you’re having meals and snacks throughout the day!\n\nSocially: honestly, I’m kind of in the same boat as you right now. If you can find clubs, just going and being there helps, even if you don’t talk to anyone. Try to be out and about so people will see you. They’re more likely to reach out to you if you’re a familiar face. \n\nEmotionally: Therapy!!!! And sleep!!!\n\nFinancially: paying back loans is a long term thing. Unless you have the time to work right now (which I wouldn’t recommend to a freshman if they had the option of not working), there’s really not much you can do at the moment. I know that sucks to hear. Talk to your parents about it (or whoever is paying your tuition), they might be able to help. Realistically, it takes people at least a few years after graduation to pay off student loan debt, so try not to pressure yourself about having paid off your loans right now. You’re not dumb for taking out loans you didn’t need. You, like the rest of us, were just trying your best. Unfortunately, college is typically the place where most of us have to make our mistakes so we can learn from them and become Functioning Adults later on.\n\nRandom other suggestion: look into transferring. It can be hard to do, but it can also be really helpful. I went to a school like 5 hours away from home last year, and being away from my support system was really hard, so I transferred to a school that’s less than an hour away. I know other people who have done something similar, where they transferred to be closer to their support system. Maybe look into it if you feel like it might be helpful, but sometimes transferring won’t make a difference, and you just have to deal with what you’ve got one way or another. \n\nTL;DR: Go to therapy it is amazing, also be kind to yourself, and remember that a lot of what you’re feeling is pretty common for freshmen so even though it sucks, it’s ok to be going through a rough patch right now. Also sleep is incredibly important!\n\nApologies for the long comment.\nMuch love, I’m rooting for you!!",
      "author": "we-bought-a-zoo",
      "created": 1634093781,
      "upvotes": 2,
      "replies": {
        "hgihv3l": {
          "link": "/r/CollegeRant/comments/q6sg2g/struggling_with_everything/hgihv3l/",
          "text": "Thank you! I definitely will be looking to go to therapy. Also I am honestly too scared and nervous to go to office hours and let my professor know that I literally don’t understand anything. I probably would rather look into online tutoring though, do you know any good tutoring service online specifically for engineering and math?",
          "author": "pearybeary_",
          "created": 1634149270,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hghlvnl": {
      "link": "/r/CollegeRant/comments/q6sg2g/struggling_with_everything/hghlvnl/",
      "text": "Go to office hours or get a tutor. Lots of resources on YT for learning your material as well.\n\nLook into the university provided mental health resources, almost all schools have something like this.\n\nGo to the gym, it will increase your energy levels, and help with depression, as well. The gym really is amazing for that, and you may meet people there who want a lifting partner. Also, looking good helps make friends by itself. People are low like that but it's true.\n\nSet up an appointment with the financial aid office and see if anything can be done regarding your financially situation. In the end you will be required to pay back those loans so in the future don't take out more than you need too, work part time and save up if you can, and most importantly major in STEM or a similar high paying career field.",
      "author": null,
      "created": 1634136429,
      "upvotes": 2,
      "replies": {
        "hgiiam0": {
          "link": "/r/CollegeRant/comments/q6sg2g/struggling_with_everything/hgiiam0/",
          "text": "I am honestly too scared and nervous to go to office hours, do you know any good tutoring service online specifically for math and engineering? I am currently majoring in computer science and I honestly am struggling already as STEM isn’t my strong suite.",
          "author": "pearybeary_",
          "created": 1634149447,
          "upvotes": 1,
          "replies": {
            "hgijj58": {
              "link": "/r/CollegeRant/comments/q6sg2g/struggling_with_everything/hgijj58/",
              "text": "Khan Academy has videos on just about every topic, but definelty has a lot on STEM subjects. Besides that just open YouTube or Google and search for what you're looking for + lesson or lecture, etc.\n\nI'm sorry you're feeling this way, I have been there and still deal with anxiety. If you can work up the courage to go see a university therapist they can help you feel more calm, and might even suggest medication, that will help. Unforuntly, the best way to defeat anxiety is by exposure therapy, so try baby steps. Be up front with your professor, maybe by email, and explain that you need some extra help and see if they can make some adjustments like meeting over Zoom, or a really short study session at first until you get more comfortable. You could also look into natural supplements that may help anxiety, but do your own research. \n\nI also can't recommend the gym enough for this type of thing. Even just doing pushups and free weights in your dorm room/apartment will give you endorphins that REALLY help push away anxiety and low moods. Lifting weights pulled me out a deep depression in just a few weeks.\n\nFor friends look into clubs. It's going to be hard at first but I promise you that it won't be bad at all after a couple of visits, plus this is the absolute best way to make friends in college, and not having college friends really sucks and can make the whole experience more difficult/depressing. You're going to have to talk to people and do things out of your comfort zone in your life so getting over this now is much much better than waiting until later, trust me on that. The problem only compounds if it's not addressed sooner rather than later.\n\nGood luck, I'm rooting for you and always down to talk. :)",
              "author": null,
              "created": 1634149945,
              "upvotes": 2,
              "replies": {
                "hgiktgn": {
                  "link": "/r/CollegeRant/comments/q6sg2g/struggling_with_everything/hgiktgn/",
                  "text": "Thank you! :) I will definitely look to go to therapy, but it would have to be online since I’m too nervous to see one in person",
                  "author": "pearybeary_",
                  "created": 1634150466,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}