{"sid": "ihd07n", "link": "/r/CollegeRant/comments/ihd07n/had_to_evacuate_on_monday_because_of_hurricane/", "title:": "Had to evacuate on Monday because of Hurricane Laura, my Uni is in its direct path. I’m scared I won’t have a school to go back to.", "text": "Title kind of says it all. I’m a Uni student in Lake Charles, LA, and the cat 5 hurricane is headed directly for it. I’m just...extremely terrified of everything going on right now.\n\nI’m worried about my friends, I’m worried about my school and if everything will be safe, I’m worried about my fellow students and if the people in the city will be safe, and more. It’s just a horrible experience right now, I’m horrified to see how this affects me and the rest of the students academically. \n\nIf you’re in South Louisiana during this time, please stay safe. Please evacuate if you haven’t already...I pray that everything will be alright for us.\n\nEdit: Just an update, Laura hit pretty hard this morning at 1 AM. From what I understand, my Uni is in severe condition. One building is completely gone, the roof has been ripped off of one the dorm buildings, another building was deroofed, and the whole campus is in shambles. Please keep us in your thoughts, it seems my worst fears came true. I may not have a place to stay.", "author": "CynthiaArts", "created": 1598496103, "retrieved": 1632843000, "over_18": false, "upvotes": 95, "upvote_ratio": 0.99, "comments": {"g329iwr": {"link": "/r/CollegeRant/comments/ihd07n/had_to_evacuate_on_monday_because_of_hurricane/g329iwr/", "text": "Tulane students here. We lucked out and only experienced some moderate wind and rain. Wishing you the best recovery.", "author": "NexusJellyBean", "created": 1598560707, "upvotes": 2}, "g30xczx": {"link": "/r/CollegeRant/comments/ihd07n/had_to_evacuate_on_monday_because_of_hurricane/g30xczx/", "text": "I go to the same school. I hope you and yours is safe. I evacuated to Florida, so i don't know exactly how bad it is. :/", "author": "remain_vigilant", "created": 1598538681, "upvotes": 2}, "g30lpm5": {"link": "/r/CollegeRant/comments/ihd07n/had_to_evacuate_on_monday_because_of_hurricane/g30lpm5/", "text": "Hurricanes, once they hit land, always drop *hard*. The initial two hours is awful, but from there the wind speed will halve and it will turn into a 2. \n\nIs your school on the coast? The storm surge on the beaches is always the most dangerous part.", "author": "Zorukia", "created": 1598532166, "upvotes": 11}, "g2zya9v": {"link": "/r/CollegeRant/comments/ihd07n/had_to_evacuate_on_monday_because_of_hurricane/g2zya9v/", "text": "I'm not religious, but I'm sending my best thoughts out there for you. As a fellow college student amid Corona, I can relate to you partly--it took so much for me to get here. I can only imagine how it is for you, going through all that and then getting evacuated must be awful. Times like this I can only wrap my head around the fact that I can only live in the present and let the rest of the worries melt away. Best of luck to you (:", "author": "happystarfish", "created": 1598510621, "upvotes": 16}}}