{
  "sid": "qp556i",
  "link": "/r/CollegeRant/comments/qp556i/i_have_no_idea_what_i_am_doing_in_computer/",
  "title:": "I have no idea what I am doing in Computer Science. Absolutely none. Someone help",
  "text": "I have only 9 more credits left and my degree is finished, thank God, but I feel like I'm drowning.\n\nData Structures is the one class that allows me to take all the other courses I need, and it's so hard. And I have nobody else to blame for it being hard because I spent 3/4ths of my college career hating my major so much and Chegging away at all my homework. Now I'm a senior in Computer Science and I can hardly code a thing.\n\nIm trying to forgive my past self for letting it get this bad but it's hard.  I'm 22. I don't want to cheat. I want to actually understand what's being asked in my classes. Studying for the test I have tuesday has been so tedious because I'm trying to study both data structures *and* java fundamentals. it shouldn't be this way.\n\ni don't know anymore guys. i wish I didn't choose this major. i just want to sing and write and clean up the community and be an artist. i hate how hard I made this for myself. my parents are getting so tired of me and how much of their money I wasted. i feel so stuck and disappointed in myself and I don't know what to do. i feel trapped.\n\n&#x200B;\n\n**TLDR:** cheated my way through computer science and I'm reaping the consequences as a senior. trying to change my ways and learn genuinely has me feeling super stuck and sad and I don't know what to do. ",
  "author": "bustedandblack",
  "created": 1636342557,
  "updated": 1636656366,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "hk2jtfv": {
      "link": "/r/CollegeRant/comments/qp556i/i_have_no_idea_what_i_am_doing_in_computer/hk2jtfv/",
      "text": "sorry, bud… if you have trouble with basic coding concepts, then you’re not going to survive data structures and algorithms. \n\nthe good news is that you can probably catch up on beginner-to-intermediate Java and OOP if you take a semester off and study an online course.",
      "author": "tpfang56",
      "created": 1636554176,
      "upvotes": 3,
      "replies": {}
    }
  }
}