{
  "sid": "qssar0",
  "link": "/r/CollegeRant/comments/qssar0/let_my_family_talk_me_out_of_taking_the_semester/",
  "title:": "Let my family talk me out of taking the semester off, now me and my GPA are suffering",
  "text": "I took me two and a half semesters of fully online courses to realize that its not gonna work for me. I was doing just fine when everything was in person pre-pandemic. Then I had to move back to my small crowded home with my family. For two semesters straight I had to deal with everything one has to deal with being poor in a small house.\n\n This past summer I realized that I could not allow this to go on. I needed to take the semester off since I would be fully online again. I asked my older sister for her input (she is also a college student) and she immediately dismissed my idea! The main reason was that I would catch shit from my parents, who are rushing me to graduate and start my career already. I figured she was right, I would just have to maintain through the struggle. Boy was I wrong\n\nThis third online semester has been an absolute disaster. Everything that I was afraid was going to happen did. I became \"near the end of the semester\" burnt out before even getting halfway!! Each semester my family gets more used to me being here, so as of late I have had the most chores and errands. I've even gotten in trouble for not completing them \"on time\" even though I was busy with schoolwork! My sister even noticed one day and told me \"maybe you had a point...about not taking courses.\" I am doing horrible in my classes, on some I'm even behind. Online school, not even once.",
  "author": "stevenbo",
  "created": 1636774222,
  "updated": 1637182343,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 1.0,
  "comments": {
    "hkfucsb": {
      "link": "/r/CollegeRant/comments/qssar0/let_my_family_talk_me_out_of_taking_the_semester/hkfucsb/",
      "text": "Oh my god, finally someone who has a very similar situation to me. Everything you said: poor family, in my case very small and crowded home, parents rushing me to graduate, endless errands, it just piles on and on until I eventually get burnt out and can't take it anymore, but I don't have a choice.   \nI too wanna graduate already and go job-hunting so that I can one day have a place of my own and get away from the chaos in my cramped family home (I'm afraid I sound entitled but it's really what I feel right now at this point in my life, what can I do?).   \nOf course, supporting my family is the primary goal behind my wanting to find a job already, but I also want to have peace and quiet for once in my life. There's simply no privacy-it's a luxury for us.  Everywhere I go in our home, there is someone in the room with me. It makes online classes really awkward when I'm being asked to recite my speech or present in front of the class. I'm an anxious introvert, so imagine the chaos going on in my mind when all of these things are happening all at once.   \nIt also doesn't help that they expect me to pass all my courses without a hitch when they pass on most of the chores to me. I understand them cos they're busy working, but this is also difficult for me. Research papers, group presentations, video projects, math (my weak subject) just seem to be so much harder now than when I was alone in my dorm (where I had a place to collect my thoughts and focus).   \nI'm also in college btw (3rd year, Culinary Arts major), so I too have difficulties especially when I dumbly and mistakenly chose a lab-related course. I pretty much gave up on that course already since I can't do the lab demonstrations in my home (no space).   \nSorry for the long rant, but I wanted to get across how similar to you my situation is right now, and it's really refreshing to see someone else that is going through what I am going through (I don't mean this in a bad way, I just feel like, for the first time in forever, I finally found someone who I can relate to since I can't relate to most people at all).   \nThanks for your post!",
      "author": "KiyotakaTatsuya",
      "created": 1636794682,
      "upvotes": 6,
      "replies": {
        "hkj1pzi": {
          "link": "/r/CollegeRant/comments/qssar0/let_my_family_talk_me_out_of_taking_the_semester/hkj1pzi/",
          "text": "Yes! Yes to everything!\n\nIts so hard because my parents didn't go to college themselves, so I cant explain how these things go. They seem to be under the impression that the only time I spend for school or when I'm in lecture or lab, so they accuse me of being \"just on that computer all day\" I seem to have taken up the role of the unemployed son, seeing as how easy they pass on the chores and errands to me. For the past two semesters I told myself \"I just need to adjust to online school\" when really its that my family gets more used to me being home. I'm withdrawing from this semester soon to save my GPA, not looking forward to explaining it to them\n\nThe bane of my online school experience has been professors that push students to interact over zoom. Not only is it just awkward, but its hard in this situation. I have to run to the bathroom or outside when I have to talk. Otherwise I have to rely on the chat. I feel so bad when we get put in breakout rooms because I feel like the others think I'm rude or lazy for only talking to them through the chat. I just have to type really fast. My first online semester my friends pointed out how they could hear the spanish channel news in the background when I unmuted. What was worst was last semester. I had a professor that put us in breakout rooms a lot, asked us questions for us to unmute and answer during class, AND wanted us to have our camera on. Get this, he was an ECONOMICS professor lmao",
          "author": "stevenbo",
          "created": 1636852884,
          "upvotes": 2,
          "replies": {
            "hkk7hgl": {
              "link": "/r/CollegeRant/comments/qssar0/let_my_family_talk_me_out_of_taking_the_semester/hkk7hgl/",
              "text": "I just tell myself to think of the future. Hopefully, we get through this one day. But yeah, I'm also considering taking a gap semester (as opposed to a gap year) while waiting for f2f classes since I get to focus so much more undisturbed in my dorm room. I don't care if I don't socialize much tbh, I just want to at least get a college diploma and from there, just figure out a way to live my life. \n\nRn, I can't focus on Zoom while someone watches TV in the living room (where is where my workstation is because we don't have space anywhere else). Also, since our living room is connected to the dining room, there are always people that come and go, disturbing my ZOom classes and leaving me unable to concentrate. I want to be a good student, but not like this.  \n\nI also can't stand professors that push students to interact over Zoom because as you said, I too feel it is too awkward and uncomfortable especially when you have people listening in on you and teasing you how differently you talk to strangers compared to them (my family). I can take the teasing to a certain degree, but since I don't have a room to myself, it never really dies down and it's just flat-out tiring and annoying.",
              "author": "KiyotakaTatsuya",
              "created": 1636874326,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}