{"sid": "mo5qe3", "link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/", "title:": "I’m scared of life", "text": "I’m on Academic Probation - I didn’t tell my parents- and I told myself I was going to change and work harder but I just can’t. As I’m writing this, I’m sobbing right now because I think I am going to fail almost every class like last semester and I don’t know what I’m going to tell my parents. Last semester, my school had this policy where you fail a class, you decide to put NC meaning No Credit and it won’t affect your GPA. However, I don’t think they’re gonna do that this semester. Yesterday, a professor emailed me and asked me to withdraw from his class because I have too many assignments missing and I’m really sorry that I disappointed him because I could have done better but I just wasn’t able to. \n\nIt’s all my fault. Almost every college student has a goal but I feel like I’m stuck in time and I have no passion for my major. No passion in life at all and it’s killing me. I’m fucking tired of it all man. Like I just wanna sleep all the time and stay still and my parents are so disappointed in me, thinking that I am too lazy but I just don’t have the will to keep going anymore.\n\nTl; DR: I’m failing my classes and I feel like life isn’t working out for me because I have no passion and no goals at all and I’m scared.", "author": "LTHEDREAMER", "created": 1618064906, "retrieved": 1632842796, "over_18": false, "upvotes": 247, "upvote_ratio": 0.99, "comments": {"gu1nj67": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu1nj67/", "text": "Thank you u/LTHEDREAMER for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1618064906, "upvotes": 1}, "gu4eg7l": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu4eg7l/", "text": "That instructor is giving you a gift: a heads up so you don't trash your GPA. It's really already ok.", "author": "karenaviva", "created": 1618119328, "upvotes": 3}, "gu40xif": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu40xif/", "text": "Hey, look, it took me 5 times and just hitting my 30s to FINALLY be able to go to college. I tried the other times but I just wasn’t ready and each time I failed for whatever reason I’d panic because I felt like the clock was ticking (among other reasons). It’s okay if you’re burnt out, or not feelin’ it more then just the typical rough semester or “ugh this sucks and I don’t wanna do this” we all get from time to time.\n\nIf you’re open to it, maybe take advantage of any college counseling/mental health services just to be able to vent to someone. (Since you said your parents don’t know) If you’re able to and willing, take a break. Let yourself relax mentally and get back on track there, and then go forward. If college is something you really want to do (or need to, depending on your profession) you’ll get there. Maybe you need a few semesters off to reset and rethink things. Maybe you need longer. And maybe college isn’t for you - it’s not for everyone and that’s okay! As many have proved, you don’t need to be college educated to “make it” in this world, and you definitely don’t need a college education to be happy.\n\nI feel for you and can empathize because I’ve felt similar feelings - I promise you it will sort itself out eventually and you’ll be okay whether you end up sticking with college or not. It may take longer then you’d like, but you’ll get there. Most of us have no idea what we’re doing, you’re not alone! & as far as goals go, just because you may not have any right NOW, doesn’t mean that won’t change tomorrow or next week or next month or even next year. Hang in there!\n\n\nEdit : added two sentences", "author": "trippapotamus", "created": 1618110241, "upvotes": 3}, "gu40alo": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu40alo/", "text": "I went on academic probation when there WASN'T a pandemic, just regular-ass life. Multiple semesters of crappy grades. Best thing you can do is have a REAL talk with your academic advisor about your options, potentially adding a semester or a year, summer/winter courses, community college courses, and other majors that might be a better fit. Not everyone is made for the major they start with, and that's really okay! \n\nI ended up switching majors the summer before my FIFTH year of college, after cycles of okay grades and bad grades. It wasn't what I planned, but lucky for me I enjoyed it and now I have a Bachelor's degree. The earlier you course-correct, the better your options. \n\nYour school will not save you automatically, but they will give you help if you reach out in a good faith effort to find success. Also crying is fine, crying is good, let yourself cry.", "author": "Queso_Hygge", "created": 1618109864, "upvotes": 2}, "gu3vp9q": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu3vp9q/", "text": "Hi love! I was in the exact same boat as you so I hope you know you are not alone and not a failure! It is so normal to not have a completely linear path in college and that is OK <3 after my freshman year, I was put on academic probation as I had a 2.1 GPA. I was super depressed and didn't know how to tell my parents as I had always been a super high achieving student (honors, pre-med, and a neuroscience major) - it really impacted my mental health.\n\nPlease take care of your mental health, as hard as it is. Seek counseling, friends, etc. to talk about what your feeling. Keep yourself from spiraling.\n\nLast semester, I decided to do my GE courses, and I'm doing the same this semester. I did this so I could figure out the patterns behind my motivation and what study habits work for me.\n\nIt is OKAY to take a gap year! Completely normal ❤️ think of the person you will be in few months, or several months; they would've found a solution. They will be more assured in what they are doing. They will learn from the past and still love themselves. I hope that brings you some type of comfort.\n\nAbove all, just know that what your are going through is completely normal. It happens. You are not a bad person or less worthy of acceptance because of the struggles you go through ❤️ definitely reach out if you need", "author": "mrworldwideismydad1", "created": 1618107214, "upvotes": 2}, "gu3urpy": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu3urpy/", "text": "My freshman year, I went from a 4.0 honors high school grad on a full ride to a 2.0. I barely made it past the cutoff for probation from my department. I didn’t have any of the resources I needed to be successful. I carried all the time, felt like a failure, and would stay up until 3 am every night crying, eating my weight in ice cream, or running away my anxiety on the treadmill. I didn’t tell anyone I was having a hard time, and almost had to drop out because my anxiety over failing was so bad I relapsed and had panic attacks every day. \n\nNow, I’m a 4.0 Deans List student who is set to graduate early SCL. You can do it, but you probably can’t do it alone. Reach out for help, from your parents, your advisor, a teacher you like, counseling, your doctor- literally anyone who might be willing to lend a hand. \n\nI’ve found that while no one can help you if you don’t tell them what’s wrong, there will always be someone willing to help if you do reach out. Good luck <3", "author": "juli735", "created": 1618106686, "upvotes": 3}, "gu3s3dg": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu3s3dg/", "text": "It's going to be okay. \n\nIt may not seem like it but trust that it will be okay, I can understand how you feel about being on academic probation I've been there twice! \n\nI'm currently studying electrical engineering and man it's hard and difficult through online classes, I've had to retake a few classes and even one of them I had to take 3 times to be able to pass, my parents never found out thanks to my sister helping me out with everything. \n\nIf you don't feel good with your major then it's okay to find something that actually means alot to you, no one is forcing you to choose what major you want to do, find something that you like even if someone doesn't agree with it, it's your life college isn't for everyone and that's okay, I hope you do well and have a good life/career whatever you choose to do :)", "author": "edlightenme", "created": 1618105170, "upvotes": 3}, "gu3rulc": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu3rulc/", "text": "Maybe..either figuring out why you cant get a passion for this particular field your studying might be your first step.. then look into another field to help you feel more passionate about it. Was this particular field your idea or your parents idea?", "author": "electricdom", "created": 1618105031, "upvotes": 4}, "gu3kcd1": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu3kcd1/", "text": "Keep ur head up ❤️", "author": "nortenolocito14", "created": 1618100820, "upvotes": 3}, "gu3irvd": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu3irvd/", "text": "You’re defintively not alone on this. Failing classes can make you feel so alone. I had to withdrawal from my pharmacology class back in the fall of 2019, I got a 75 on the first exam and then bombed the second exam and couldn’t come back from it.\nThen I almost failed my fundamentals class because it was so in depth and I was taking 5 classes. \nI remember feeling like I was the only one going through it and it felt so isolating. \nI specifically approached my fundamentals professor and asked “what can I do?” She looked me in the eyes and coldly said “just drop” and walked away from me. I was dead inside the whole way home and once I got home I bawled my eyes out. \nI ended up passing fundamentals because I refused to drop. \nBut had to withdrawal from pharm.\nI thought my whole career was over.\nBut it was a mere rock in the road and I tried again the next semester and did well. \n\nWe come across these road bumps throughout our lives, it’s all part of the ride. Keep going an keep striving. For the summer relax and take a breather and try again next semester ❤️\n\nIt would be good to seek out your mental heath services at your college if that’s available for you because it is very taxing on us students.", "author": "Lelricaa", "created": 1618099974, "upvotes": 3}, "gu38rdi": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu38rdi/", "text": "Hey man. I know what you’re going through. That’s what I went through last semester. I felt like I had nothing worthy of keeping me in college. Even though today I don’t know what my goals are, I know that I ultimately want to complete my math degree and go into a good-paying field with my degree and I’ve changed my lifestyle habits. As a result, I feel much better and much more confident as an individual.\n\nMy recommendations:\n\n1. Seek professional help and academic advisors immediately. They are there to help you out and get you on the right track. That’s literally their job.\n\n2. Reach out to some good friends of yours, even if it’s through a Zoom call. It’s a good way to reconnect, spend some time with them, and have some fun.\n\n3. You should join a club or two at your college that sounds interesting. I’m personally in a music club and I tried out intramural softball because I wanted a more active lifestyle. Getting involved in things that interest you make your life more fulfilling and also provide you with great friendships through common interests.", "author": "simberry2", "created": 1618094349, "upvotes": 4}, "gu2xrym": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu2xrym/", "text": "deeeeeeeep breath love. I went through exactly the same thing in 2019, took a year off and now I’m thinking of going back.\n\nI understand the guilt and the shame and the fear of telling your parents but I hope they will be understanding of you. You are not a failure my friend. You are not your GPA. I can’t even imagine going to school during this past year. Be easy on yourself. Be kind to yourself. Definitely reach out to your college’s mental health services. I actually called ours mid-panic attack and the person who answered (likely a fellow student) actually calmed me down right then and there and then helped me make an appointment to come speak with them and later the school psychiatrist.\n\nYou are alright mate. It will be alright:)", "author": "sloww_buurnnn", "created": 1618088412, "upvotes": 8}, "gu2o0au": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu2o0au/", "text": "Don’t count out being able to get NCs this semester, my university just did it for the whole year, including this semester. NCs are better than withdrawals, so ask your advisor soon. Some also have academic renewal, to clear a semester off your record. \n\nWhatever you do, get in some self-help. There are ways to make it better!", "author": "Speakingrealistic", "created": 1618083302, "upvotes": 2}, "gu27ku4": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu27ku4/", "text": "Hey man I’m on that same boat with you. If you ever need something hit me up, I know I’m her a stranger but maybe we can help each other out. I’ve gotten a therapist to help me and I can say I’m feeling better but still most of days I’m still the same me. Don’t be afraid to go undeclared and find yourself it can be liberating. Wishing you all the best", "author": "Iupin-pegasus", "created": 1618074919, "upvotes": 15}, "gu25k7x": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu25k7x/", "text": "If your parents are comprehensive enough, I'd say tell them. Take a semester off if you can. Maybe college isn't made for you or you just need to find yourself. I put too much pressure on myself and I know failing to reach our own expectation, through people like your teacher, can be extremely rough. This doesn't mean you are a failure or that you have nothing in life worth working for. Usually, your passion can be way more simple than we think. I'd say take some time off. Don't overwork yourself for nothing. Nothing is worth more than your mental health. Take it from someone who's having a hard time to believe that herself. ;)", "author": "magzzdeli", "created": 1618073927, "upvotes": 10}, "gu1xm4z": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu1xm4z/", "text": "I would reach out to your colleges counseling service ASAP. They likely have some excellent resources/advice for you.\n\nAlso, talk to an academic success coach. They can help you make a plan to improve your grades.\n\nGo to tutoring if you need it. My school’s tutoring center has a tutor for almost every subject.\n\nAs someone else said, this past year has been incredibly tough on everyone. Your college will likely be forgiving considering the circumstances and if you actively reach out for help, it will look good on your end in case you need to submit an appeal letter.", "author": "nonconformistnugget", "created": 1618069984, "upvotes": 12}, "gu1x8zw": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu1x8zw/", "text": "Do what is right for you right now. :) If you want to turn this around and do better, maybe meet with the director, academic advisor, or dean and explain the situation. They can help you figure out what course of action would be best. If you do not have the desire to go to school right now, then take a break. You can always go to school somewhere, in the future, when you feel motivated to do so. Do what you want to do right now and what you know you will be able to handle. And as others said, try to get in to see a mental health counselor at your school. I recently utilized that service at my school and am very glad I took the risk and did.", "author": "jendominates", "created": 1618069812, "upvotes": 5}, "gu1tjw0": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu1tjw0/", "text": "It's not too late. Remember take a day off to reset but don't give up. I'm here for you :-)", "author": "celpri", "created": 1618068006, "upvotes": 11}, "gu1rqkn": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu1rqkn/", "text": "Hey, a few years ago I moved to a different state to attend a huge university. I ended up on academic probation because of the dysfunctional and abusive people I used to live with during that time. I attended that uni for 1 year and a semester. I left that uni with a GPA of 2.4 and I thought my life was ruined. I went back to my home state and attended a smaller university and told my advisor what I experienced and how in the world is it possible for me to get accepted into graduate school with my GPA so low. She told me that I would have to improve my grades here and that’s what I did. I’m a senior now and for the past 3 semesters I’ve made straight A’s and about 2-3 B’s. My advisor told me that even if I did make straight A’s and B’s, my overall GPA (factoring in my GPA with the first Uni I (attended) wouldn’t be enough to give me a 3.0. BUT she did say that when I apply for graduate school, explain in my application letter what I’ve experienced during my first year (and 1 semester) at the uni I attended along with explaining how I’ve improved my grades at the current university I’ve attended. My advisor also told me she has previously worked with looking at applications and the students they accept are those who have interesting lives/those who have persevered through hardships. \n\nI hope this helps comforts you in some way. I remember being in your shoes and having such horrible anxiety. Maybe you could attend a different college and end up improving your GPA like I did! You may currently feel like it’s the end of the world, but they say when one door closes, another one opens!\n\nAlso, it’s totally okay to not know exactly what you want to do with your life. I feel that jumping straight outa high school and going into college is honestly just too soon. How in the world do most people know instantly what they want to do with their lives? I found out what I wanted to do with my life ever since a young age when I found out my mom has mental illnesses which intrigued me and from that day I decided I wanted to be a psychologist. \n\nHave you tried taking those tests in which the results show what career/s would potentially best suit you?", "author": "Jungbb", "created": 1618067086, "upvotes": 51}, "gu1prvz": {"link": "/r/CollegeRant/comments/mo5qe3/im_scared_of_life/gu1prvz/", "text": "Def reach out to your college mental health services. They may be able to help. \n\nAnd please start by forgiving yourself. This past year has been HARD. I don’t know what I would’ve done as a young full-time college student. It was tough as an old part-time one. \n\nIt is not the end of the world. You will make it through this. Please reach out for some help. It’s there.", "author": "AppleTreeBloom", "created": 1618066094, "upvotes": 170}}}