{"sid": "jkb59e", "link": "/r/CollegeRant/comments/jkb59e/professors_shouldnt_take_weeks_to_reply_during/", "title:": "Professors Shouldn't Take Weeks to Reply During Online Classes", "text": "Earlier in the semester I had had a family emergency that my professor was very understanding and said he would help me get caught up but to focus my time with my family. I ended up missing less than 5 assignments, about 2.5 weeks of stuff. There was an exam and I had emailed him asking if he could unlock the module, since I had missed it so I could properly prepare for the exam. Took him over a week to reply. By then I had missed around 10 assignments (including the exam since he never unlocked it) after emailing him a tentative schedule that would have gotten me caught up by the time the next module was due. Never heard back for almost another week and he said it wouldn't be possible to catch me up and I would have to take an incomplete and he would save a spot for me in the spring for his course. \n\nI understand that now after his response time it is unfeasible for me to catch up, but if he would've replied in a timely manner none of this would have been an issue. I just don’t understand if you are teaching an ONLINE course (this was online regardless of COVID) why it would take you so long to reply to a student who is actively trying to be proactive and get caught up on assignments. Granted when I take it in the spring I'll have over half of the course finished and saved, which is nice for sure. Just annoying as shit that in this time of everything being online and having had previous conversations with him, a professor would take weeks to reply to a student who is trying to fix the issue.", "author": "morecrabsthnmaryland", "created": 1603982102, "retrieved": 1632950299, "over_18": false, "upvotes": 220, "upvote_ratio": 0.99, "comments": {"gakey62": {"link": "/r/CollegeRant/comments/jkb59e/professors_shouldnt_take_weeks_to_reply_during/gakey62/", "text": "My one professor NEVER responds to anyone at all in the class. He also turned off the chat option on zoom. My class made a group chat, and every single one of them including me emailed him multiple times and he has never gotten back to them. And they were all very important questions. \n\nAnd he doesn’t give us time to talk to him in class. He dives straight into the lecture and the moment he’s done he says bye and ends the zoom call. I went to his virtual office hours once and waited for him to come and he never did. He’s horrible.", "author": "pennypupper", "created": 1604028608, "upvotes": 3}, "gaiy3cz": {"link": "/r/CollegeRant/comments/jkb59e/professors_shouldnt_take_weeks_to_reply_during/gaiy3cz/", "text": "This is ridiculous, I’m so sorry you’re dealing with that. None of my professors take longer than one day to reply to emails like that. Does your professor have office hours?", "author": "taddycat", "created": 1604000570, "upvotes": 2}, "gaiv6ew": {"link": "/r/CollegeRant/comments/jkb59e/professors_shouldnt_take_weeks_to_reply_during/gaiv6ew/", "text": "You’re RIGHT. If you email and don’t hear back within 3-4 days, absolutely send them a follow up!", "author": "CollegeFreshmanFocus", "created": 1603999196, "upvotes": 6}, "gairi8m": {"link": "/r/CollegeRant/comments/jkb59e/professors_shouldnt_take_weeks_to_reply_during/gairi8m/", "text": "Yikes. Report to the dean?", "author": "dogs6666", "created": 1603997738, "upvotes": 14}, "gailljj": {"link": "/r/CollegeRant/comments/jkb59e/professors_shouldnt_take_weeks_to_reply_during/gailljj/", "text": "that’s so frustrating i agree 100%. i’m sorry that happened :(", "author": "2001questions", "created": 1603995359, "upvotes": 5}, "gailawo": {"link": "/r/CollegeRant/comments/jkb59e/professors_shouldnt_take_weeks_to_reply_during/gailawo/", "text": "[deleted]", "author": null, "created": 1603995246, "upvotes": 30}}}