{
  "sid": "nfw9ud",
  "link": "/r/CollegeRant/comments/nfw9ud/thoughts_on_college_timeline/",
  "title:": "Thoughts on college timeline",
  "text": "Hey everyone,\n\nI’m having a really hard time trying to figure out what I need to do. Here’s the story, I’m supposed to be a senior in college in the fall graduating on May 2022. However, I struggled to get into nursing school. I know this now, but it was very dumb of me to stick with the same college and should have looked into other nursing schools around me. But I kept on applying to the same nursing program and I got denied three times which makes me behind 3 semesters; the nursing program I applied to is 2.5 years. Since I only had one more chance before I couldn’t apply to the same program anymore. I took the TEAS serious since it was the only thing that was preventing me from getting in. I finally got accepted and I start in August. I should be happy and looking forward to it. Here’s the problem I keep on thinking about how behind I am and how I should already be in the program. I don’t graduate with my nursing degree until December 2023 which I’m very embarrassed about. Also, I thought I could graduate with an exercise science degree in May 2022, so I don’t have to feel like I wasted my four years. Unfortunately, my advisor told me if I wanted to graduate in May I need to drop nursing school and reapply to the program and the university again. Basically, I won’t have a guaranteed spot in the program even though I already got accepted. And if I want the nursing degree I have to wait and graduate with both degrees in Dec. 2023. I wanted to mention that whenever I started college, I thought I wanted to be a nurse but now I’m not sure. I’m afraid I won’t be able to handle it. I have no idea what I’m going to do with EXS degree. I’m constantly thinking about the time frame; I don’t understand why I’m so obsessed about it. I feel like I should move on and accept what’s going on. I need advice on if I should graduate in May 2022 with the exs degree so I don’t feel like I’m behind or just wait until Dec 2023 and get both degrees at the same time. \n\nP.S--- I’m so sorry for the long post and if it’s all over the place I tried to briefly explain what’s going on in last 3 years. A girl is struggling.",
  "author": "FormalPraline4733",
  "created": 1621399543,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "gyt60s3": {
      "link": "/r/CollegeRant/comments/nfw9ud/thoughts_on_college_timeline/gyt60s3/",
      "text": "Graduate with both in 2023. Not only does it give you more options for work, but a lot of people in college graduate later than they think they will. I was originally supposed to graduate may 2020, but I'm graduating this year instead just because the workload for my major was too much for me to do in 4 years. There's nothing wrong with taking more time in school, and anyone who says otherwise is an asshole with no life anyway.",
      "author": "deltagardevoir",
      "created": 1621509775,
      "upvotes": 2,
      "replies": {}
    },
    "gyqu4cc": {
      "link": "/r/CollegeRant/comments/nfw9ud/thoughts_on_college_timeline/gyqu4cc/",
      "text": "Give yourself a break. I’ve been working on my college degree since 2008. It’s been 13 years and I’m due to graduate spring 2022. Life happens. You’re doing the best you can. And it’ll work out exactly how it’s supposed to. Look for the lessons in the years that have passed, and know you are not alone!! I’m 33 now with a kid and just barely going to graduate with a bachelors... you’re doing great and don’t think anything other than that! Much love.",
      "author": "Hungryyy4",
      "created": 1621458442,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634064377
}