{
  "sid": "nj0xhq",
  "link": "/r/CollegeRant/comments/nj0xhq/feeling_down/",
  "title:": "feeling down:(",
  "text": "I did pretty well my first sem of college. I’m a first year student so it was a bit of a challenge to transition from hs to college online. However my second sem, I did slacked off and now I’m getting B’s with a couple A’s. It’s not bad, but I know I  can do better. I’ve been so stressed about GPA, I don’t want it to go down. There is a couple of classes where I’m borderline and I’m manifesting really hard that it stays a B. I’m  hoping my parents understand how difficult a year it has been. But I do procrastinate a lot and don’t get in on top of my priorities and that’s a habit I need to fix. I just need to find new studying habits and not keep making the same mistake over again 🥲",
  "author": "milkteamami4",
  "created": 1621747843,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "gzgsl7o": {
      "link": "/r/CollegeRant/comments/nj0xhq/feeling_down/gzgsl7o/",
      "text": "Hey! I completely understand and relate to what you’re saying. Honestly, I’ve been struggling this semester too (it’s my second as well) and I’m giving my finals, still haven’t figured out how to fix my procrastination or my anxious brain. I’ve come to realise that ‘disciplining’ yourself and creating an effective routine takes a lot of time and consistency. So as long as you’re ready to put in those two things, you’ll be okay. And this doesn’t mean you start giving into hustle culture or just go go go. Even taking out your books/notes, setting them on the table is a big achievement if you struggle with procrastination/time management and/or anxiety. It’s also important to remember that it’s okay if you don’t end up sticking to schedule (which I recommend you make) or aren’t as productive as you thought you would be. Expect goals out of yourself which are realistic. Start small, divide the big tasks into smaller portions to get going. Download study apps, put on a ‘Study With Me’ on YT. Find a study buddy, or an accountability partner. Try things until u find something which feels right and comfortable for you. Don’t forget to take breaks, and most importantly, forgive yourself if you haven’t reached the point of accomplishment that you wanted to. At university level, Bs are pretty great too. And during all of this, I hope you realise that you’re doing great! Promise!",
      "author": "mayhapsacherub",
      "created": 1621995217,
      "upvotes": 1,
      "replies": {}
    },
    "gzghzzg": {
      "link": "/r/CollegeRant/comments/nj0xhq/feeling_down/gzghzzg/",
      "text": "Drop out here.\n\nIt only gets harder and those A's will be harder to get. More reading, studying means the workload will be much harder and take more time if not studying effectively. The procrastination and bad study habits and behavior will only get worse without intervention which is how I ended up dropping out. \n\nr/getdisciplined is a great resource to find advice on how to fix behaviors. I sort by top, time and google keywords + reddit.\n\nNot taking action and doing nothing only leads to being unprepared for everything I found out.",
      "author": "executordestroyer",
      "created": 1621989836,
      "upvotes": 1,
      "replies": {
        "gzgkeun": {
          "link": "/r/CollegeRant/comments/nj0xhq/feeling_down/gzgkeun/",
          "text": "this is so useful thank you!:)",
          "author": "milkteamami4",
          "created": 1621991044,
          "upvotes": 1,
          "replies": {
            "gzgshce": {
              "link": "/r/CollegeRant/comments/nj0xhq/feeling_down/gzgshce/",
              "text": "Also if you find yourself regretting all the time you spent wasting on the internet, social media, meaningless video games, stupid pointless tiktoks, dank memes, clickbait youtube, instagram, fb, snapchat, twitter, all that time wasted, time you wished back, then you should see r/nosurf.\n\nRegretfully wasting time procrastinating and stressing out about gpa feelsbadman because deep down you know there's more to life than procrastinating and stressing out.\n\nConscious mindful actively being immersed experiencing videogames for the story is what I try to do.\n\nThese posts from nosurf give me a new perspective on what's actually important in life and matters. These posts will helped me realize how stupid I was for wasting time and what I could be doing with my life. \n\n[https://www.reddit.com/r/nosurf/comments/awujub/your\\_time\\_is\\_the\\_furthest\\_thing\\_from\\_free/](https://www.reddit.com/r/nosurf/comments/awujub/your_time_is_the_furthest_thing_from_free/)\n\n[https://www.reddit.com/r/nosurf/comments/hi7skf/625k\\_karma\\_2\\_years\\_on\\_this\\_platform\\_member\\_of/](https://www.reddit.com/r/nosurf/comments/hi7skf/625k_karma_2_years_on_this_platform_member_of/)\n\n[https://www.reddit.com/r/nosurf/comments/h8rd5y/the\\_internet\\_replaced\\_my\\_ability\\_to\\_think/](https://www.reddit.com/r/nosurf/comments/h8rd5y/the_internet_replaced_my_ability_to_think/)",
              "author": "executordestroyer",
              "created": 1621995161,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062145
}