{"sid": "nc03ay", "link": "/r/CollegeRant/comments/nc03ay/so_close_yet_so_far/", "title:": "SO CLOSE yet SO FAR", "text": "I graduate tomorrow! Well I walk. I stupidly missed a deadline to turn in two labs and I failed my physics lab again. A one credit class. Now I get to go to campus twice a week for 2 hours for 10 weeks to take a lab that I’ve already done all the work for. I’m so upset at myself and the unwillingness of my professor to work with me. I haven’t told my parents yet, I don’t want them to be disappointed in me. After 5 grueling years with only one summer semester off, I’ve made it, and there’s one more goddamn bump in the road. This college shit is bullshit. I’m so over it. If covid never happened I am so sure I would have graduated already. Anyone else been through something similar?", "author": "PurpleNeko23", "created": 1620965788, "retrieved": 1632842396, "over_18": false, "upvotes": 20, "upvote_ratio": 1.0, "comments": {"gy2a5xz": {"link": "/r/CollegeRant/comments/nc03ay/so_close_yet_so_far/gy2a5xz/", "text": "Thank you u/PurpleNeko23 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1620965788, "upvotes": 1}, "gy2uxl9": {"link": "/r/CollegeRant/comments/nc03ay/so_close_yet_so_far/gy2uxl9/", "text": "Same boat, covid threw me off schedule after pushing through a 12 credit summer to catch up on a failed class and get ahead of the registration credit requirements and I have one more year after this and this semester I took temporary grades in three of my four classes because I couldn't handle the workload with all the shit going on in my life. Honestly I dont mind failing one of the classes as long as I pass the prerequisite I need for my senior courses cause it just means I take 2 classes instead of one in the spring.", "author": "shaysalterego", "created": 1620982641, "upvotes": 1}}}