{
  "sid": "ncekaw",
  "link": "/r/CollegeRant/comments/ncekaw/just_found_out_i_wont_graduate_this_month/",
  "title:": "Just found out I won’t graduate this month :)",
  "text": "So I recently made a post on the college subreddit about how I got a bad grade in one of my classes and whether I should keep it or not, but I just found out that this grade will keep me from graduating this month. I thought a D in this class was a passing grade, but it turns out it isn’t. I asked whether I could still participate in commencement anyways since it’s just one class, but nope, I’m not allowed. And the class isn’t offered in the summer, so I’ll have to retake it in the fall. It’s hard to describe the feelings I’m experiencing right now, but after getting a call that you won’t graduate after you’ve already bought all the apparel for it and your parents have told everyone including the neighbor’s dog, you can probably imagine that I’m not too great at the moment.\n\nI don’t really know what to ask or why I’m even posting this. I guess I just need a place to vent. I honestly feel like crawling inside a hole and never coming out. I was doing fine before this pandemic. I really was. Honestly, taking a leap year probably would’ve been better for me. At least then I would be delaying my graduation on my own terms and I wouldn’t have a terrible grade. Anyways, I’m just rambling now so I’ll stop. Thanks for reading I guess.",
  "author": "PandemicCollegeSUCKS",
  "created": 1621014556,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.9,
  "comments": {
    "gy9bsve": {
      "link": "/r/CollegeRant/comments/ncekaw/just_found_out_i_wont_graduate_this_month/gy9bsve/",
      "text": "Best case scenario was that you passed the class and graduated this semester. Worst case scenario is that your graduation has been delayed a semester.  You are now delayed but the important thing is that you tried. It could have easily gone the other way. Knowing that there are social pressures to graduate do play into it but in the grand scheme of things, no one minds that you will graduate a semester later than planned. The important thing is that you keep going and pass that last class. Perhaps this is a chance to land a job while still school. Fall recruiting is especially heavy in the beginning of the semester. Keep your head up and keep pushing on because you are almost there. The summer and fall semester will go quick. Enjoy your summer and don’t be to hard on yourself. Be proud of how close you have gotten to graduating. You’ll still be a 2021 graduate. You’re nearly there. Good luck.",
      "author": "litecrush",
      "created": 1621115161,
      "upvotes": 5,
      "replies": {}
    }
  },
  "updated": 1634061723
}