{
  "sid": "r04q1g",
  "link": "/r/CollegeRant/comments/r04q1g/assignment_due_in_45_min/",
  "title:": "Assignment due in 45 min....",
  "text": "Hey yall, looking to vent/gather advice. I'm hardcore experiencing the end of semester blues. My motivation has run out of steam and I'm falling behind on assignments, resulting in heaps of anxiety. I have a 40 point (a sizeable amount of points for this class) assignment due in 45 minutes, and i have only a few sentences down. I'm in tears because I'm so overwhelmed with anxiety i physically cannot write this paper. Do i A) continue to have a mental breakdown and try to write this paper, knowing good and well this won't be near done until midnight or B) take a break and see what i can scrounge together tomorrow? I'd feel guilty for taking a break because i feel like that's all I've been doing by avoiding this..... :)))",
  "author": "amburger_0",
  "created": 1637641290,
  "updated": 1637689638,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlqbmux": {
      "link": "/r/CollegeRant/comments/r04q1g/assignment_due_in_45_min/hlqbmux/",
      "text": "I don’t recommend this all the time but, write your paper and then, blame your internet for not allowing you to turn it in. If your professor doesn’t accept that, they’re unrealistic. \n\nYou could also be honest but, professors have a skill for not caring about mental health and forcing the whole “read the syllabus” jargon on you. Which, in my experience, makes it worse. \n\nAnxiety ain’t no joke. I feel.",
      "author": "majoroofboys",
      "created": 1637641754,
      "upvotes": 2,
      "replies": {}
    },
    "hlqp5xs": {
      "link": "/r/CollegeRant/comments/r04q1g/assignment_due_in_45_min/hlqp5xs/",
      "text": "well what’s the update? sorry you were in this position btw. also is it worth 40% of your grade bc…..that’s crazy…..like supremely so……",
      "author": "crazyhow",
      "created": 1637650329,
      "upvotes": 1,
      "replies": {}
    }
  }
}