{"sid": "ojs9yu", "link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/", "title:": "When Do You Call It Quits? [A Vent]", "text": "I've taken Organic Chemistry I 3 times already, and at this point I feel like I'm crazy considering going at it again for Fall 2021. \n\nSomething is just.. Not clicking up there fast enough, and I feel like maybe I should just give up. I feel like I'm getting some concepts, but it's a very *sloooooooooow* process. Problem with that is I don't know what to do with myself if I do that because Orgo is a required science for most **S**TEM majors, and I'm just *so* close to graduating. I've never saw myself doing anything besides the sciences. \n\nThis is going to sound stupid, but no I haven't asked for help like I should've. Whenever I think of asking my professor I just feel so dumb that I get anxiety even thinking about it. I take full responsibility on that. Thing is, I don't know what I don't know. You know? During classes I'll understand what my professor is saying, during homework I can take my time and figure things out, but during like a test I'll have no idea what I'm doing. So when it's time to ask for help, I'm not sure what I *really* don't know. And then when I DO work up the opportunity to ask for help, I get so overwhelmed that I can't explain my issues, I need things explained to me over and over and in simplified forms (which is reasonable for most professors).\n\nI guess I want to take another shot at it one more time because I'll be on campus next semester--No distractions, I can go to physical office hours, I can go to physical study sessions, I'll have a dedicated library to do work, maybe I'll do better if I can be in a lecture hall? I'm also hoping that with being on campus again I can physically go to therapy sessions with the on campus counsellors early on to get over my anxiety.\n\nBut 4 times? Personally I've never heard of someone taking a class ***4*** times. And I'm not calling down on anyone who has done it, but this just makes me feel so incompetent and dumb. \n\nAnd like, I'm not sure why I'm still pushing exactly. My goal was to be a vet, but schools are so competitive that I probably would never be considered now.  Like maybe giving up is my better choice. \n\nSigh, this course is a nightmare.\n\nI apologize if it just sounds like I'm whining, and this isn't meant for this sub. I'm just feeling really down on myself since tomorrow is our 3/4 exam, the 16th is the last day I can drop the course, and this sub felt like the only place I can vent to without feeling like I didn't belong in someway.", "author": "OfficialThrowaway_1", "created": 1626220689, "retrieved": 1632841776, "over_18": false, "upvotes": 78, "upvote_ratio": 1.0, "comments": {"h53insz": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h53insz/", "text": "Thank you u/OfficialThrowaway_1 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1626220689, "upvotes": 1}, "h590msw": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h590msw/", "text": "The college that I go to lets students request special accommodations for test anxiety. Students here can take their exams at another location away from the class room and get extra time. But I’m not sure how that works during online exams.", "author": "Mindless-Theme-7266", "created": 1626333918, "upvotes": 1}, "h55c6be": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h55c6be/", "text": "**You are not a failure, your future is not hopeless, and you WILL get through this.** Apologies in advance for the long response!\n\nI know absolutely nothing about organic chemistry (I didn't even enjoy regular chemistry lol). BUT I do know some things about pedagogy, professors, study skills, and mental health. I'll start by seconding what others have said to **drop the class now** and begin focusing on the general chemistry concepts that form the core of organic chem. Between now and the fall: \n1. Take a \"deep dive\" into what you said about doing well on/understanding the homework but blanking on tests. Pull together some solid examples of this (homework feedback/grades paired with related test scores) and go to both Disability Services° and your professor^∆ (yes, even after dropping the course).    \n2. With that kind of evidence, you can (a) work on possibly getting testing accomodations (extended time, different location, etc), and (b) begin to pinpoint specific concepts or skills that give you the most trouble. \n\nNow is also the time to begin my second bit of advice: **You absolutely need to advocate for yourself, starting TODAY.** You're the only one who can fully advocate for your success, as people can't help if they don't know you need it.    \n1. Contact the people above, and keep at it. If no one in disability services responds to the email or form you submitted, give them a call or drop by in person if necessary/appropriate.    \n2. Use any and all resources available to you, and don't be afraid to try new/different ways of learning. This can include videos; websites (e.g., ones specifically for chemistry help, resources/tutorials provided by another school); or maybe even one of those free online gen chem classes.    \n3. When you contact your professor, be specific about what you need. Outline what you're doing now, what you plan to do, and how they can help and/or link you to others who can help.    \n4. Suggest meeting within a specific timeframe if office hours are \"by appointment\" or don't work in your current schedule. For example, you can say, \"I'd like to meet with you to discuss this sometime in the next week if you're available.\" Maybe also provide some broad windows (\"Monday afternoon\") in which you're free.    \n5. Show up prepared, follow through on suggestions/tasks, and be tenacious. I've never heard of a professor being upset or annoyed with a student who just wants to better understand difficult concepts, so don't be afraid to ask questions and show your confusion. It means you might feel a bit vulnerable, but remember they are there to help you learn and succeed.\n\nFinally, and this is more about your mental health: **Your struggles in organic chemistry do not reflect your worth as a person/student. You are not your failures, and you are incredibly strong for seeking help here and elsewhere.** I struggle with both generalized and social anxiety, so I really understand how hard it can be to ask for help or be vulnerable in front of others. But like I said, you're the only one who can do this for yourself, so just take it one step at a time. It gets easier, I promise. \n\n^(°This office can also be called/refer to learning assistance, disability resources, or disability access, for example.)    \n\n^∆ ^(Have you had the same professor each time? Is so, some of your issues could stem from not engaging well with their teaching style, so extra/different types of resources and explanations might prove usedul. You can ask about those, or even ask about other professors/TAs/tutors who might be able to help.)\n\nEdit: Formatting. Multiple times lol", "author": "griffinicky", "created": 1626266400, "upvotes": 3}, "h55a5d7": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h55a5d7/", "text": "Can’t read the whole thing buuut, watch the organic chemistry tutor on YouTube, I recommend his videos to everyone. He’s freaking amazing when it comes to teaching orgo", "author": "imarabianaff", "created": 1626265150, "upvotes": 1}, "h547v17": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h547v17/", "text": "[deleted]", "author": null, "created": 1626234452, "upvotes": 5}, "h546flr": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h546flr/", "text": "Organic Chemistry is hard. I know I've been there. I had a great professor the for Ochem I and a really awful one for Ochem 2 (Especially Ochem 2 I took this course when the pandemic started and everything moved online where the professor who was 80+ couldn't figure out how to even type an email to us or give us online exams.) . I was lucky enough to have passed them both by the skin of my teeth the first time.  I don't have much advice but try to see who the best professor for that course is through your college. The website Rate My Professor is pretty good with that. You can see how certain professors are rated for the classes they teach. Does your college have tutoring for chemistry? Mine had a chemistry clinic where past students could help current students through homework and understand topics. If you are taking Ochem I I found it easier to learn if I used a molecular model when doing certain problems. I hope this helps a little. Good luck out there.", "author": "chelkitty1", "created": 1626233575, "upvotes": 3}, "h541zej": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h541zej/", "text": "I’ve actually taken a class 3 times. Sigh. I’m a microbiology major and I had some issues related to mental illness so the first time was appealed the second was S/U due to covid and the last I passed with a B+ (if I remember correctly, pretty sure I do lol). I have thought the same thing because I’ve struggled in other classes. \n\nMaybe you should take it at a CC as a transient student, it may be easier and less competitive.", "author": "Ohhiitsmeyagirl", "created": 1626230992, "upvotes": 4}, "h53yd8g": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h53yd8g/", "text": "Ohh I see. You need some help from your professors and advisers? But what is surprising is that you and I are opposite. Ever since we are forced to do online studying, I have no idea what I'm doing most of the time in classes. It's just so boring and distracting.....and I'm like \"ok I'm out\" but I take my time to read stuff and do hw, and that only helps me to answer tests and exams well. So in summary, I do bad in class even when professors ask our ideas/thoughts I'm brain dead, just empty. But during exams I do really well because of my knowledge on the subject and my study hours. I don't study too much tho...just read what I need to read and that's it...", "author": "SaintJay41202", "created": 1626228979, "upvotes": 1}, "h53utd4": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h53utd4/", "text": "As u/elfrenin points out- there are some key concepts from Gen Chem that are fundamental here too. I would say drop it while you can and see if you can audit Gen Chem again to really make sure that that stuff is locked in and you are totally fluent in it. Also- as you’ve said- you’ve got to ask for help! VERY few people ever get through Organic by themselves… study groups, lots and lots of visits w/ the TA or the professors. Also consider changing up how you take notes in the class? Since you’ve taken it before consider trying to quiz yourself ahead of class and say- do i remember this? Do i know this? Jot down everything you remember from past attempts and then check in after class and see if you really knew it or not. This might help you figure out what it is that you know and don’t know. I think you’ve got to build your own confidence in yourself back up…", "author": "Dremd07", "created": 1626227068, "upvotes": 5}, "h53usc0": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h53usc0/", "text": "Hi! I feel your pain but my issue was with physics. I haven’t even gotten close to where you’re at. I had to drop the class three times. Eventually I got to the point that physics was my last class. I took it at a community college, transferred the grade into my current university, and then squeezed by the graduation deadline just in time. Taking the course by itself, investing in chegg answers to study and practice questions repeatedly, and working no more than 40 hours a week helped me to pass. \n\nAlso keep in line that higher ed isn’t about teaching and learning. Tre majority of course instructors, professors, and TAs have no business teaching. This is why the majority of Americans are struggling with higher ed.", "author": "dasWibbenator", "created": 1626227053, "upvotes": 6}, "h53soqw": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h53soqw/", "text": "I feel your pain. I'm TAing for a summer Organic 1 section, and many of the students I help find that the subject just hits them like a brick. Some dense stuff from Gen Chem (molecular orbital theory, electronegativity/dipoles, resonance, etc.) comes back swinging in Organic, and I think some people get caught unaware/unprepared for this. There is also new stuff introduced that is extremely difficult to learn and teach online (imagining molecules in 3D and stereochemistry are a couple that my class struggled with).\n\nI took it online last Spring, and while I did well I also consider it one of the most stressful classes I've taken in college so far. As I'm sure you're aware, it's a class unlike most others, because it introduces a ton of new language and rules of logic that seem to exist in their own realm. \n\nMy advice to you is to take in Fall, in-person, and commit to attending office hours and tutoring sessions. Try to get really comfortable with the core concepts I mentioned above that were introduced in Gen Chem. I committed to studying it every day for at least a couple hours, because the concepts are difficult to absorb at first.\n\nI strongly prefer Leah4Sci's videos on organic, even over the well-known Organic Chemistry Tutor on YouTube. I also recommend the Organic Chemistry as a Second Language books by David Klein. I used them, my friends and classmates used them, even my professors recommended them. To this day I struggle with spectroscopy problems, but those books got me through it.\n\nBest of luck, I hope you keep going for it despite it being a difficult hurdle. It's a subject that feels great to conquer after struggling with it.", "author": "elfrinen", "created": 1626225938, "upvotes": 12}, "h53lym9": {"link": "/r/CollegeRant/comments/ojs9yu/when_do_you_call_it_quits_a_vent/h53lym9/", "text": "Ok, breath. There is light at the end of the tunnel. I took Organic three times before I finally could pass it. It was the bane of my existence and the reason I had to take a fifth year. I felt like an absolute failure because I wasn't fitting into the cookie cutter mold of four years and then off to vet school. Here are my suggestions. Drop it now, pick it up at the start of fall term. Go to office hours. Demand a one on one tutor. See if you can qualify for extended time on exams. Go to group tutoring if that is offered at your school. Find a study group to work out questions you may have. You are going to have to drag yourself out of your shell and push yourself to ask questions. Go talk to your prof at the beginning of the semester, tell them how you have studied, show them examples of your studying and see if they can give you tips on how to be more successful on learning the material. Don't let your mental health take a hit. Seek help and make sure this is actually what you want. As for vet school, there is still hope, it may just not be immediately after you graduate. You may need to take some time off, get hands on clinical hours what make you stand out, and then apply. Feel free to message me. I literally just got done being in your shoes and it is so frustrating because you feel like all your plans have fallen apart. Breath and fight like hell. Sorry if there are typos, responding on mobile.", "author": "shortcorky", "created": 1626222431, "upvotes": 37}}}