{
  "sid": "qo7dac",
  "link": "/r/CollegeRant/comments/qo7dac/getting_harrassed_for_sitting/",
  "title:": "Getting Harrassed for Sitting?",
  "text": "I go to a Liberal Arts University in Washington State that is a pain in the ***. Most of the students there have rich parents and don’t care about anyone below them. I hate it there and I am only go for the free scholarship.\n\nAnyways, it starts with me being a clinically depressed commuter student who lives with her husband about 1 1/2 hours away from the University. \n\nRecently, my depression has been through the damn roof! I cried for about 2 hours straight the other day… I had a chemistry lab due that I could not make up for. If I didn’t go, I would have to say goodbye to my scholarship. Due to my depression however, I did not feel safe going alone! I even teared up with the thought of going alone. I had been suicidal in the past and I was afraid I was gonna jump in front of a car or something dangerous (Ferry and Bus Commuter). My husband, who is the light of my life, decided he would go with me and wait.\n\nSo, we take the ferries and buses to the city where my University is in (about 2 hours that day) and we have a good time for the half of the day. I won’t go into detail because it isn’t important to the story. \n\nWe head to the bus stop that take us to the university and we get soaked from a sudden downpour of rain! My husband is freezing and his hands are turning white. I offer him to go back home, but he wants to still come with me to make sure I’ll be safe. We get there and realize there are no benches under cover. Luckily, it stopped raining by then, however, it was still cold. We finally find a bench he can sit on and I give him my hoodie for them to cover his legs with. I feel terrible to leave him like that but he insisted he would be ok and just try to hurry with my lab. \n\nI go to lab and my professor is 15 minutes! The lab takes a lot longer than expected because the details of the lab are confusing! I finish about 1:30 hours later.\n\nI ran outside to my husband I see him white and shivering. He was sitting on a different bench than before. I apologize for minutes and minutes without stopping, and I am on the urge of crying.\n\nAfter he calms me down, he explains he was on a different bench because people were harassing him. First, security harassed him for just sitting there on his phone. He wasn’t doing anything suspicious, just watching a show on his phone. Then, a few students were talking freely on “there is a weirdo sitting over on that bench”. Finally, an older lady takes a picture of him. After all that harassment, just decided to move to another spot that isn’t as noticeable.\n\nFor a man to accompany for wife while she was not in her right of mind is punished. What in the actual ****? \n\nEspecially when I have to go because there is no accommodations?\n“Oh, you might kill yourself coming here? You can do lab in your grave.” \n\nSorry, this is just a vent on how much I hate my privileged school…\n\nWhere is kindness and compassionate people nowadays?",
  "author": "Heavy_Environment_59",
  "created": 1636226840,
  "updated": 1636656381,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.86,
  "comments": {
    "hjlgai5": {
      "link": "/r/CollegeRant/comments/qo7dac/getting_harrassed_for_sitting/hjlgai5/",
      "text": "Hi friend,  college is a drag sometimes lol and locals in a college town are always annoying. Im so sorry that this happened to you. I challenge you to go to a spa this weekend. Or better yet, find a gym that has a steam room and a sauna and treat yourself to a little detox. Depression/anxiety seem to go hand in hand with college lol even in grad school now, I find myself spiraling. It’s just the stress of it all I guess but here’s the thing, it’s not the end of the world. My therapist had to remind me of this often, everything will work out, I promise. Sometimes certain class loads are more demanding than others and some classes will have to be retaken- it’s okay, it happens and you’re still amazing for giving it your best shot. The best day of my life in undergrad was when I switched my major to something that I actually found fun. Even though I knew after college would be a challenge.",
      "author": "Chemical_Western3021",
      "created": 1636232242,
      "upvotes": 8,
      "replies": {
        "hjmce45": {
          "link": "/r/CollegeRant/comments/qo7dac/getting_harrassed_for_sitting/hjmce45/",
          "text": "My major is in Sociology and it is something I very much enjoy! The only good thing about my university is the education system. Everything else is terrible.",
          "author": "Heavy_Environment_59",
          "created": 1636246943,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hjltrvh": {
      "link": "/r/CollegeRant/comments/qo7dac/getting_harrassed_for_sitting/hjltrvh/",
      "text": "Move away from this University I feel like that's BS on people.",
      "author": "Halomast123",
      "created": 1636238320,
      "upvotes": 3,
      "replies": {}
    }
  }
}