{
  "sid": "qeruqw",
  "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/",
  "title:": "I have no time!!",
  "text": "I talked to an advisor for my major and she told me it’s important that I get an internship my senior year. I told her that will be difficult considering I already have to work 20-25 hours/week and go to school full time. I have not had a day off basically since the start of this fall semester. I am very stressed and struggle to get work done. She told me that she understands it is difficult because people who live off campus have to make money. She fucking told me I could consider moving into a dorm. I live in an apartment with my husband, that ain’t gonna work lady. Also, I don’t need any more student loans for super expensive dorming. Ah fuck, guess I’ll die :} \nBy that I mean I will suffer until I graduate.\n\nTL;DR: advisor told me i should get an internship but i don’t have time and i’m stressed",
  "author": "pannil",
  "created": 1635080954,
  "updated": 1635185195,
  "over_18": false,
  "upvotes": 80,
  "upvote_ratio": 0.96,
  "comments": {
    "hhuzo9c": {
      "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhuzo9c/",
      "text": "What major are you? Could you look into paid internships? My internship pays almost $30 an hour",
      "author": "coraline_button_",
      "created": 1635083058,
      "upvotes": 24,
      "replies": {
        "hhv0yhy": {
          "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhv0yhy/",
          "text": "psychology. I am definitely going to look into it but my advisor said most are unpaid . also I am not willing to travel that far just for an internship but it seems like a lot of opportunities are outside the general vicinity of where I live. apparently it is not necessary but it is strongly encouraged to get one.",
          "author": "pannil",
          "created": 1635083711,
          "upvotes": 18,
          "replies": {
            "hhv134f": {
              "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhv134f/",
              "text": "ugh that is so frustrating!! I hate companies that don’t pay interns.",
              "author": "coraline_button_",
              "created": 1635083776,
              "upvotes": 14,
              "replies": {
                "hhv1vg6": {
                  "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhv1vg6/",
                  "text": "yeah i feel like it’s some dumb shit. i get that we are getting “paid in experience” or whatever but it’s stupid. students need to make a living too; why not give experience AND money. i would even take minimum wage",
                  "author": "pannil",
                  "created": 1635084172,
                  "upvotes": 17,
                  "replies": {
                    "hhvze0p": {
                      "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhvze0p/",
                      "text": "I worked a night job in a transitional housing unit. It was shift work overnight. I was able to complete homework and earn a living while earning a Psych degree... it was a 24/7 facility and in my field. No free labor! The job paid more than waiting tables, barista, etc. look for these facilities they exist.",
                      "author": "RomanLion29",
                      "created": 1635098522,
                      "upvotes": 9,
                      "replies": {
                        "hhxoz7a": {
                          "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhxoz7a/",
                          "text": "i’ll have to look into that, thanks!",
                          "author": "pannil",
                          "created": 1635126003,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hhx7fij": {
              "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhx7fij/",
              "text": "im currently in an internship (psych is my major too) and i do it completely remotely and it’s not even in my current location but a few hours away but it doesn’t matter when it’s completely online. it is pretty challenging ngl but there’s more flexibility when it’s on your terms. it’s also unpaid unfortunately but does your school have something you can apply to where they pay you for being in an internship?",
              "author": "throwawayrandoms7",
              "created": 1635117163,
              "upvotes": 2,
              "replies": {
                "hhxqmju": {
                  "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhxqmju/",
                  "text": "What kind of work is it that you can do remotely? i’m definitely going to talk to someone at my school for more info, i just felt stressed thinking about the future so i wanted to rant",
                  "author": "pannil",
                  "created": 1635126832,
                  "upvotes": 1,
                  "replies": {
                    "hhy886u": {
                      "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhy886u/",
                      "text": "im interning as a case manager ! im not sure what else works remotely but my positions is to help find therapists for ppl and i get assigned cases. remotely i search for therapists, email and make calls.\n\nedit: best of luck to you!!",
                      "author": "throwawayrandoms7",
                      "created": 1635136770,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhwqc06": {
      "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhwqc06/",
      "text": "I agree, schools just want more money. I haven't had a day off since the semester started either. I think you can make it without an internship if I am being honest. I work two jobs and one of them is supposed to be a part time internship but by boss likes to load me with work so I basically have 2 full time jobs and go to school part time. I have let my boss know that we agreed it was a part time internship but he will still message me or call me during my class exams requesting reports. I feel like interning is just an opportunity for cheap labor.",
      "author": "brokegirlworking2",
      "created": 1635109396,
      "upvotes": 8,
      "replies": {
        "hhxplye": {
          "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhxplye/",
          "text": "oof that sounds really rough. i actually currently have 3 jobs. one is giving me 24 hours, i’m getting one 6 hour shift a week from another and probably every other week i get like a 5 hour shift from the last one. i’m going to quit one of them tho cuz i can’t do this",
          "author": "pannil",
          "created": 1635126320,
          "upvotes": 1,
          "replies": {
            "hhxzy5b": {
              "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhxzy5b/",
              "text": "We will get through this eventually!",
              "author": "brokegirlworking2",
              "created": 1635131768,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhwqsek": {
      "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhwqsek/",
      "text": "I assist my clients with hiring new college grads (finance/economics).  If you don’t have at least two high quality internships and a GPA of 3.5 or higher you don’t get an interview.  It’s too competitive right now.",
      "author": "-Economist-",
      "created": 1635109589,
      "upvotes": 6,
      "replies": {
        "hhxpxtb": {
          "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhxpxtb/",
          "text": "luckily i’m not in those fields. however i’m sure it matters for me as well. it just does not seem feasible for the moment but i may feel different next semester. i’m not opposed to internships, i’m opposed to unpaid ones when i already have to work 2 jobs to pay my bills. i will happily accept an internship if they pay me. i understand that they must be useful and provide that practical experience",
          "author": "pannil",
          "created": 1635126486,
          "upvotes": 1,
          "replies": {
            "hhziwsf": {
              "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhziwsf/",
              "text": "I don't know of too many internships that don't pay, but that's also regional.  My fraternity brother received his graduate degree in economics from Harvard and still worked 18-months for free at Goldman as an intern.  Poor (literally) guy was living in New York, working at one of the most prestigious investment banks in the world and a bartender at night.  He had a two-hour commute into work.   \n\nOnce he was moved into a full-time paying gig, he made just under $1m a year.  He's bank rolled about $10m a year for the past 25+ years.  We are the same age, but he looks 10-years older.  They certainly work in a high pressure, fast-paced environment.  \n\nMy point, don't discredit something because it's not paying.  You never know what it may lead too.",
              "author": "-Economist-",
              "created": 1635170680,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhvjga6": {
      "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhvjga6/",
      "text": "Like AOC said, “experience doesn’t pay the bills!” Ugh, I can only imagine how stressed out you must feel. I hope everything calms down soon! Good luck!",
      "author": "invisibilitycap",
      "created": 1635092112,
      "upvotes": 23,
      "replies": {
        "hhvldis": {
          "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhvldis/",
          "text": "thank youuu",
          "author": "pannil",
          "created": 1635092863,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hhwv8pp": {
      "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhwv8pp/",
      "text": "You were told you should get one, not that you have to get one",
      "author": "NoSpaceAlien",
      "created": 1635111517,
      "upvotes": 6,
      "replies": {
        "hhxpzvf": {
          "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhxpzvf/",
          "text": "yes and i get that. she just very strongly recommended it to me, saying it’s the best path",
          "author": "pannil",
          "created": 1635126515,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhx47ht": {
      "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhx47ht/",
      "text": "I feel this. Next semester I will have to work in a lab for 9 hours a week unpaid for credit but also work 16 hours at my waitressing job and take 9-12 other credits. I had to drop a class but that may not feasible for you. However, I do want to stress how important an internship is for psychology. My friend is also a psych major and she didn’t have any experience. She applied to 3 local graduate schools and she didn’t get in any of them. Now she’s taking gap year to get experience. You might even want to look into doing another semester or summer classes if it means doing an internship if you plan to go to grad school.\n\nI’m not sure if you’re a senior or not, but get your foot in the door somehow. Maybe through credits or summer programs but get your foot in the door so you can get paid internships. I’m sorry if none of my advice is helpful; I know how hard it is but that’s just the reality.",
      "author": "denver_rose",
      "created": 1635115622,
      "upvotes": 3,
      "replies": {
        "hhxqe5f": {
          "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhxqe5f/",
          "text": "i appreciate the feedback. im in my junior year so i will graduate in 2023. i dont plan on going to grad school, at least not right after i get my bachelors. I don’t even know what direction im going in. im going to try to see if i can do some research with one of my professors or something since my school is big on research. i just think that unpaid internships are absolutely ridiculous",
          "author": "pannil",
          "created": 1635126715,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhxyim3": {
      "link": "/r/CollegeRant/comments/qeruqw/i_have_no_time/hhxyim3/",
      "text": "College advisors are the worst. Lemme guess she lives on dorm and/or makes decent money and doesn't have to do anything else except her shitty job. It seems they all think we live their exact same lives and none of these advisors can put themselves in our shoes. I suggest to forget that stupid internship, just focus on passing your classes and paying the bills.",
      "author": "Ph03n1x_5",
      "created": 1635130985,
      "upvotes": 2,
      "replies": {}
    }
  }
}