{
  "sid": "o716cy",
  "link": "/r/CollegeRant/comments/o716cy/transferring_connundrum/",
  "title:": "Transferring Connundrum",
  "text": "So rn, im planning on transferring from my community college (will be a sophmore in the fall and CS major) to a uni, but im stuck between twp unis. They are both located 1to 1.5 hr away from from house. Uni A is in a big city with more people and is abet accredited in CS. Uni b is in a small town with less people, many of which fall into one race, with an OK cs program but no abet accreditation (Im getting a d.major option tho). Im leaning towards uni A rn, just bc i like the diversity and abet accreditation (im not racist, but i prefer diversity). I feel that im making a decision on impulse and emotion and not logic. All advice and comments are welcomed and thanked by op.\n\nTLDR: deciding between two unis to transfer to, basing my decision off student body, TIA",
  "author": "acleb524",
  "created": 1624542297,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "h2zu4b5": {
      "link": "/r/CollegeRant/comments/o716cy/transferring_connundrum/h2zu4b5/",
      "text": "I don’t see the issue here… Uni A is larger, you like the diversity, it’s accredited. It doesn’t even seem like a competition to me.",
      "author": "His_Majesty_Aman",
      "created": 1624629084,
      "upvotes": 2,
      "replies": {
        "h2zuolb": {
          "link": "/r/CollegeRant/comments/o716cy/transferring_connundrum/h2zuolb/",
          "text": "The thing is that uni b will most probably give me more personalization and attention. At uni A, im going to be treated like another student. Also, uni B is abiut 15K cheaper.",
          "author": null,
          "created": 1624629363,
          "upvotes": 1,
          "replies": {
            "h302xl4": {
              "link": "/r/CollegeRant/comments/o716cy/transferring_connundrum/h302xl4/",
              "text": "I’ve gone to three different schools I’m a senior now attending a top 40 school atm upcoming senior. Attention and personalization doesn’t matter when it isn’t quality. I had the same mentality when I went with a smaller school first time around. Now I go to a larger school yes it’s less attention but much higher quality. The price however is significant.  You could consider transferring as a Junior? Better options maybe …",
              "author": "His_Majesty_Aman",
              "created": 1624633263,
              "upvotes": 2,
              "replies": {
                "h30hb06": {
                  "link": "/r/CollegeRant/comments/o716cy/transferring_connundrum/h30hb06/",
                  "text": "The reason i want to transfer now is bc everything is opening up and all of my cc classes are going to be online. I definelty want to get out and all,but i dont know what is worth the sacrifice and all",
                  "author": null,
                  "created": 1624639677,
                  "upvotes": 1,
                  "replies": {
                    "h320e0h": {
                      "link": "/r/CollegeRant/comments/o716cy/transferring_connundrum/h320e0h/",
                      "text": "Yea I understand that… it’s gonna be a difficult decision but you have more then two options .. I also recommend asking the more expensive school for more money often times they have a couple thousand more they can give …",
                      "author": "His_Majesty_Aman",
                      "created": 1624666593,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h2ylbgs": {
      "link": "/r/CollegeRant/comments/o716cy/transferring_connundrum/h2ylbgs/",
      "text": "From my experience, I would say Uni A especially if Uni B is not accredited. I’m not sure how serious accreditation is for CS, but I know for engineering in general an accredited degree is required for most jobs / institutions!",
      "author": "Born-Satisfaction783",
      "created": 1624595037,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634064398
}