{
  "sid": "pu6xh6",
  "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/",
  "title:": "I don’t really get what’s so great about the college experience",
  "text": "I’m not talking about like, academics or extracurriculars or socializing, but by living and dorming here instead. I really feel the need to move, maybe by being closer to home? I honestly don’t really feel happy with the college experience, or dorming, and would rather just have my own place (especially my own bathroom because lord knows the weird shit I’ve seen here) and just being surrounded by people when I’d rather just have the privacy of being by myself at at least one place just kinda sucks. I’d much rather chill out and play video games or watch a show than have to hear shrieking outside of my room or someone blasting the new Kanye album (I like the album and all I’d just rather not hear it at like, 2 am when I have a quiz in the morning). My concerns don’t usually get addressed by the RA, and when I confronted them directly they stopped but still, that shit gets on my nerves.\n\nI’d much rather transfer closer to home or something, because this shit, I don’t get what’s great about this…",
  "author": "asianboyopoyo",
  "created": 1632438113,
  "over_18": false,
  "upvotes": 49,
  "upvote_ratio": 0.96,
  "comments": {
    "he559do": {
      "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/he559do/",
      "text": "After living in a dorm for 3 years, I'm definitely over it.",
      "author": "aanuma",
      "created": 1632519448,
      "upvotes": 1,
      "replies": {}
    },
    "he541nv": {
      "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/he541nv/",
      "text": "For real though! I stayed on campus my freshman year and never really liked it. I need my space and alone time and did not get good roommates. I was kind of lucky to get kicked out of the dorms when Covid started. I think it just depends on who you are. Some people love campus because they get to party all of the time, others love campus because of the easy interactions with all the extroverts, and I think a lot of people like campus because it is expected of them. The only thing I liked about staying on campus was the freedom! I was starting new and was away from everything I knew. It was a great feeling and a good experience for me but I would not recommend it to everyone.",
      "author": "layne26",
      "created": 1632518927,
      "upvotes": 1,
      "replies": {}
    },
    "he1ewrh": {
      "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/he1ewrh/",
      "text": "The college experience is dependent on what college you go to.  I've transferred across 3 colleges and at one the dorms are shit holes with communal showers while another's are like hotels with suite options.",
      "author": "Jeffotato",
      "created": 1632447719,
      "upvotes": 6,
      "replies": {
        "he2aydj": {
          "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/he2aydj/",
          "text": "That sounds kinda cool, the better dorms. I go to a school that’s supposedly listed (somewhere I believe) to have better dorms, but it’s actually hit or miss, and well, I missed",
          "author": "asianboyopoyo",
          "created": 1632466723,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "he10nr9": {
      "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/he10nr9/",
      "text": "I specifically went to a school close enough to home so I could stay home and commute because I need my alone time to function. So now I’m saving $10k a year on housing alone, don’t have to share a bedroom or bathroom with anyone, and most importantly I didn’t have to pack or unpack any of my belongings.",
      "author": "notthelettuce",
      "created": 1632440928,
      "upvotes": 17,
      "replies": {
        "he23lg5": {
          "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/he23lg5/",
          "text": "Same! Sad thing is that my parents are still trying to control my life. Like I’m not allowed to go anywhere unless it’s for school, and they’ll always use the excuse of covid. But even before the pandemic, they never let me hang out with my friends. So it’s a blessing yet a curse for me.",
          "author": "LonelyBiss",
          "created": 1632461267,
          "upvotes": 3,
          "replies": {
            "he2avdh": {
              "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/he2avdh/",
              "text": "That does suck, I’d think my parents would hopefully be a bit more lenient, but I don’t really care for going out excessively other than extracurriculars and some down time",
              "author": "asianboyopoyo",
              "created": 1632466653,
              "upvotes": 2,
              "replies": {}
            },
            "hedroby": {
              "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/hedroby/",
              "text": "Same here, I feel like I have to sacrifice my mental health and basic autonomy to save money",
              "author": "TheRapidTrailblazer",
              "created": 1632683758,
              "upvotes": 2,
              "replies": {
                "hefo6qq": {
                  "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/hefo6qq/",
                  "text": "Same. Especially if you’re working in a toxic environment of jealous co-workers, it’s just horrible. But we have to keep making money so we can get our own place and be independent for once.",
                  "author": "LonelyBiss",
                  "created": 1632715803,
                  "upvotes": 2,
                  "replies": {
                    "hehdv9a": {
                      "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/hehdv9a/",
                      "text": "Bruh I was actually working in a toxic environment but I got a new job so its significantly better. At one point it was both omg and I didn't get a lot of hours so it was even worse",
                      "author": "TheRapidTrailblazer",
                      "created": 1632757036,
                      "upvotes": 2,
                      "replies": {
                        "heih0r0": {
                          "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/heih0r0/",
                          "text": "Gosh, good job in leaving that last job of yours. For me i work in a nail spa. So I worked with my mom. My co workers would just continue to bully my mom. And I’m like… fuck this I’m out. Then both my mom and me packed up our stuff and left. And that’s good that your new job is a bit better!",
                          "author": "LonelyBiss",
                          "created": 1632774707,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "he2b06c": {
          "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/he2b06c/",
          "text": "Honestly that’s what I wanna do. I don’t think I can shit peacefully when someone’s blasting certified lover boy in the shower and someone is flossing there teeth in front of the stall",
          "author": "asianboyopoyo",
          "created": 1632466764,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "he0v5me": {
      "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/he0v5me/",
      "text": "College housing are shit and dorms are hellholes, you are correct",
      "author": "TWR3545",
      "created": 1632438340,
      "upvotes": 25,
      "replies": {
        "he2awrc": {
          "link": "/r/CollegeRant/comments/pu6xh6/i_dont_really_get_whats_so_great_about_the/he2awrc/",
          "text": "Yea, I might just transfer somewhere closer for home, for less, because in the end I’m not aiming for a field that depends on where I went for under grad",
          "author": "asianboyopoyo",
          "created": 1632466685,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634063228
}