{
  "sid": "qbspom",
  "link": "/r/CollegeRant/comments/qbspom/trash_can_old_english_prof_who_deserves_my_rage/",
  "title:": "Trash can old English prof who deserves my rage and pity [warning, i am extremely triggered]",
  "text": "I am a student who has historically done very well in English, in fact, I have always done well in the writing of essays and papers, but this dumb fking geriatric is the bane of my existence right now, he must be so pleased to tie my down and fuck me over and over with these shitty B's with arcane, contradictory feedback. I asked for a friend in a class to provide his paper and I found it funny that he received 100 percent for doing things that I basically did, if I applied his feedback to my friends paper it should not at all be that high, but after all we fail to account for the fact that the grading of papers is subjective especially when no fucking rubric exists for them.\n\nI have in fact written a completely fair and reasonable response to his critique of my most recent paper which he awarded a 80% to me, but i am not submitting it to him or arguing with him because I have already tried and been met with an unyielding old fuck. I should rather just suck his old dick then argue with him because it risks my grade, even though my points are quite reasonable. I have to respect the fact that this fucker will not change his ways or his opinions to his dying breath.\n\nIf anything is to be credited with destroying my writing ability it is in attempting to follow through with his feedback only to be progressively slapped with worse grades which at this point might very well be generated from a brain that is barely functioning and subject to any number of diseases related to memory and absolute bullshit bias.\n\nI will be glad to not be under the subject of these old academic/literary fucks when I graduate. The fact that I am trying to curtail the beauty of my writing and living in fear of my next grade and being unable to write for the first time and doubting myself completely because of this old fuck is absurd.\n\n&#x200B;",
  "author": "michaelmanal",
  "created": 1634703449,
  "updated": 1634750664,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hhd4r1i": {
      "link": "/r/CollegeRant/comments/qbspom/trash_can_old_english_prof_who_deserves_my_rage/hhd4r1i/",
      "text": "I wish I had a nickel for every self-professed 'great writer' I've met in college. More than likely you're not a good writer, you just had a lenient teacher in high school. Furthermore a B is not a bad grade, it demonstrates good performance. You shouldn't expect your professor to be handing out A's like candy.",
      "author": "hdorsettcase",
      "created": 1634739746,
      "upvotes": 2,
      "replies": {}
    }
  }
}