{"sid": "ntbjso", "link": "/r/CollegeRant/comments/ntbjso/someone_copied_my_discussion_board_post_should_i/", "title:": "Someone copied my discussion board post. Should I report it? *Read desc. for context*", "text": "Hey everyone! This is my first post on reddit. I apologize if my formatting is off.\n\nFor context, I am taking an online class with a new professor. The class is small with only 10 students. My university requires all professors to use Blackboard, but my professor doesn’t know how to use it well. She has us post all of our assignments on the discussion board. We had a case study due this week which was 6-10 pages typed. Responding to others in this class is optional, but I always read other posts to see if there is anything interesting to respond to. In reading others, I noticed one was quite similar to mine, word for word and some words changed around. My writing is quite distinct and I always make it a point to write things in my own words. Moreover, I had a long reference page for this assignment and she did not cite anything. Out of curiosity, I ran my assignment against hers using Copy Leaks. It came back being about 20% similar. (I took a screenshot of the results just in case)\n\n   I was the first one who posted this assignment to the board and hers was last. I have no idea who this girl is. She was able to access my paper because our professor has us post everything to the discussion board. For anyone who doesn't know, Blackboard has a setting where professors can require students to post first before viewing other student's posts. Because my professor does not have this setting, everyone can see what you wrote before they post their own assignment. \n\n  I am super pissed. I also have horrible anxiety and I am concerned that my professor will think that I passed my assignment on to this girl to copy. I am a rising senior with plans to go to grad school and I don't need some entitled, lazy, person to come and sabotage that for me. I have a 3.85 GPA and have been on the deans list every semester since my freshman year. At the same time, I am not sure if I should bring this up to the professor. I don't want to be a snitch or cause any drama. What should I do? \n\nTLDR-Someone copied my assignment from a discussion board. Judging by previous posts, this isn't the first time she has done this. For anyone who doesn't know, Blackboard has a setting where professors can require students to post first before viewing other student's posts. Because my professor does not have this setting, everyone can see what you wrote before they post their own assignment. Copy Leaks said the assignment was significantly similar to mine. I am unsure of if I should report this to the professor or wait to see what she says when she grades the assignment.", "author": "ghostgal127", "created": 1622946666, "retrieved": 1632949742, "over_18": false, "upvotes": 13, "upvote_ratio": 1.0, "comments": {"h0u7dc8": {"link": "/r/CollegeRant/comments/ntbjso/someone_copied_my_discussion_board_post_should_i/h0u7dc8/", "text": "Yes, report it now. \n\nIf the professor doesn't understand Blackboard, they may think you copied the other student. Get ahead of this while you can.", "author": "TheProfessorsCat", "created": 1623015020, "upvotes": 1}, "h0tf086": {"link": "/r/CollegeRant/comments/ntbjso/someone_copied_my_discussion_board_post_should_i/h0tf086/", "text": "Report it.  This is not snitching.  Someone has wrongfully stolen your work.", "author": null, "created": 1623001761, "upvotes": 5}, "h0sgedi": {"link": "/r/CollegeRant/comments/ntbjso/someone_copied_my_discussion_board_post_should_i/h0sgedi/", "text": "Definitely report it to your professor then let them handle it. Academic dishonesty will definitely get you kicked out.", "author": null, "created": 1622984096, "upvotes": 6}, "h0sec7w": {"link": "/r/CollegeRant/comments/ntbjso/someone_copied_my_discussion_board_post_should_i/h0sec7w/", "text": "You should have emailed as soon as you saw it.", "author": "Hazelstone37", "created": 1622982725, "upvotes": 6}, "h0rsq4q": {"link": "/r/CollegeRant/comments/ntbjso/someone_copied_my_discussion_board_post_should_i/h0rsq4q/", "text": "Politely inform instructor that you believe another student is using the patch writing technique to copy your work. \n\nYou might ask instructor to enable setting that students must post first before seeing others.\n\nHowever, they can post something, delete it, and then put a new post to get around it. \n\nI would set a trap for copying student.", "author": "ObjectiveAnalysis643", "created": 1622963440, "upvotes": 2}, "h0rkxny": {"link": "/r/CollegeRant/comments/ntbjso/someone_copied_my_discussion_board_post_should_i/h0rkxny/", "text": "Ya especially because this is such a small class, you should feel totally justified in speaking to your professor. Having a good rapport with professors is also a big deal when later asking for LoR, for example.\n\nBut why not also message her before, when you noticed she was using blackboard wrong? If you are nice about it, and don't tell her publicly of course, but rather in email, then she will likely appreciate the help. Most profs hate when students cheat. Also, if you tell her about the issue first, you will remove any chance at being accused, whereas if she notices first, you're right, you may get in trouble too. This happened to me in grade 3 and that memory is burned into my mind lol. I can only imagine the horror of having that happen at this level.", "author": "VindicatedDynamo", "created": 1622956973, "upvotes": 8}, "h0res7i": {"link": "/r/CollegeRant/comments/ntbjso/someone_copied_my_discussion_board_post_should_i/h0res7i/", "text": "Definitely bring it up to your professor. You don't want to be accused of sharing your work.", "author": "PaoloMustafini", "created": 1622952573, "upvotes": 27}}}