{
  "sid": "mu1eex",
  "link": "/r/CollegeRant/comments/mu1eex/no_breaks/",
  "title:": "no breaks",
  "text": "ohh my god this semester is killing me. absolutely no work life separation. just work all the time and feeling guilty when i take “free time” because i really should be doing more work. \n\ni’m trying sooo fucking hard and the classes I have A’s in are slipping right at the end and i might not even pass physics 2. feel like i’m not gonna be able to breathe until i graduate next winter",
  "author": "mr-bitch-ass",
  "created": 1618841355,
  "over_18": false,
  "upvotes": 320,
  "upvote_ratio": 0.99,
  "comments": {
    "gv6vsjq": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv6vsjq/",
      "text": "I feel you so fucking hard. But I also feel myself growing resentful of it all. If I could spend all day working and have the night off, like a job, then I would be alright with it. But as it is, I’m currently working all day, taking 45 minutes to make and eat dinner with my husband, and then working until 11 or 12. Repeat that shit the next day. I’d love to look forward to summer vacation, but I’m taking just as heavy of a load over the summer. I made the mistake of looking ahead at the syllabi for my classes and one of them wants a 10 page paper 3 weeks after class starts. Another will be covering a 900-page book in 5 weeks (she doesn’t teach, we just read the book and write at least 1100 words a week). I’m praying so hard that my other classes aren’t ridiculous.\n\nAs far as your classes, try to not give up now. As irritating as that is to think about, try to think about how upset (pissed as shit) you’ll be if all of your hard work over the semester went for nothing because you let go in the last couple weeks. That’s not easy, I get it. Feeling tired, hate it, just want to have some fun, or just do literally nothing. Whatever you do, you don’t want it to be school anymore. I’m right there with you. But I know how devastated I’ll be if I don’t finish well after all the work I’ve put in over the semester. I hope this motivates you enough to help. I’m sorry if it doesn’t help, but at least know others can empathize with you. 🤍",
      "author": "ZacKaffeine",
      "created": 1618918994,
      "upvotes": 3,
      "replies": {}
    },
    "gv6ih7p": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv6ih7p/",
      "text": "this semester has been hectic for me as well. i have been studying every single day, sometimes i don’t even have time to eat. it’s really frustrating but i’m striving for AAs. my current schedule is working for me but sometimes i feel so overwhelmed. what i do is i call my friends on zoom and we study together with occasional breaks for chatter.  also i tend to wake up super early in the morning so i can do all my studying before my classes. that way i have time in the evening to relax and do whatever i want. don’t be too hard on yourself you might end up in a burnout. i’m sure you’re doing the best you can and at some point you have to be okay with that. shift your focus from your grades to learning and try to enjoy the material that way it won’t feel like a burden. wishing you the best 💗💗",
      "author": "tiramisuandbooks",
      "created": 1618907073,
      "upvotes": 2,
      "replies": {}
    },
    "gv5x5fq": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv5x5fq/",
      "text": "I’m finally on my spring break. I’m still doing homework while some of my classmates are in punta cana or Nashville...",
      "author": "WindyLiv",
      "created": 1618890128,
      "upvotes": 1,
      "replies": {}
    },
    "gv5qxsj": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv5qxsj/",
      "text": "I feel you, working two jobs and going to school fulltime during the pandemic has been an extreme struggle. Constantly have something to do and taking even a few moments to chill just seems so wrong.... knowing there are endless assignments or other things to get done.",
      "author": "biosplice",
      "created": 1618886575,
      "upvotes": 2,
      "replies": {}
    },
    "gv5oa0c": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv5oa0c/",
      "text": "I feel this. I’m a 4.0 student up to this point but I’m doing so much work and studying so much for all my classes thinking I know the stuff but I keep making bad grades. I’m on track to make straight B’s this semester which I know isn’t bad but I’m transferring and I can’t help but worry that my transfer institution isn’t gonna like that and rescind me and then I’ll be screwed. It’s so fucking frustrating and I’m so burnt out from working my ass off and getting nothing in return. Everything in me wants to drop out and crawl into a hole and never speak to anyone ever again.",
      "author": "yuxngdogmom",
      "created": 1618885157,
      "upvotes": 4,
      "replies": {
        "gv6bt4d": {
          "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv6bt4d/",
          "text": "I studied for 5 days straight from 9:30a to 9:30p and still barely made a B on a test last week. I don't have much experience in college (class of 2020), but this semester is looking like I will make my first B's. I have been completely checked out since mid-March when I should've had spring break. College has been the worst experience of my life so far. I have no friends because I am at home, and all my high school friends went off to their colleges. The burnout, depression, and pure loneliness are surreal.",
          "author": "StellarLeviathan",
          "created": 1618900875,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gv5m1i7": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv5m1i7/",
      "text": "I am still getting over having to drop a class last week. I can’t tell if it’s just me because I am typically an A student pre-Covid or if it’s all of us due to online learning. I feel there is a lot of busy work...anyone else?",
      "author": "DucTape696",
      "created": 1618883993,
      "upvotes": 4,
      "replies": {}
    },
    "gv4626d": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv4626d/",
      "text": "Same I have a major exam tomorrow my last one before the final and I’m honestly checked the fuck out. My brain is fried, and I’ve caught my professor giving us incorrect information more than twice. This class has been a nightmare.",
      "author": "Hawkbiitt",
      "created": 1618859368,
      "upvotes": 11,
      "replies": {}
    },
    "gv3y3xo": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv3y3xo/",
      "text": "As someone who has had to take at least 2 classes through every session available for the past 2 years, I feel this lol",
      "author": "vness1213",
      "created": 1618855977,
      "upvotes": 2,
      "replies": {}
    },
    "gv3kl19": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv3kl19/",
      "text": "Same man, I feel like the semester just started and finals are already this week. And then I have to start some summer classes in early may so I barely am gonna have time to rest",
      "author": "2019ForestHillsDrive",
      "created": 1618850324,
      "upvotes": 5,
      "replies": {}
    },
    "gv3cf7e": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv3cf7e/",
      "text": "i felt that. i have 3 big projects due this AND my circuits 2 prof decided to move our finals to this thursday instead of having us take it at our designated time next week. my mind has been on study mode all semester that i didnt even realize the suffering is gonna end in less than 2 weeks for me.",
      "author": "LordUrkelTheGreat",
      "created": 1618846887,
      "upvotes": 4,
      "replies": {}
    },
    "gv3bd26": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv3bd26/",
      "text": "Do you have the ability to elect for the pass/no pass grading option? And just try your very best to pass? Or do an incomplete & try to complete either over the summer only that course or possibly extend graduation a term or so?",
      "author": "Big_Lab_883",
      "created": 1618846444,
      "upvotes": 3,
      "replies": {}
    },
    "gv39qjc": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv39qjc/",
      "text": "I feel this... I got my first B and it hurt. I feel the same. I had to take this weekend off (not completely cause I completed small assignments) but I didn’t spend hours a day studying. I’m at the point where I didn’t feel so much guiltily because in order for me to be productive this weekend I HAD to give myself a break. I totally understand you though. It sucks...",
      "author": "undercovergrl42",
      "created": 1618845761,
      "upvotes": 12,
      "replies": {}
    },
    "gv38mi6": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv38mi6/",
      "text": "This is the worst semester ever. Luckily this is my last bad week but I still can’t deal. I tutor virtually for my school as well and there are times when I want to fling my computer out a wall bc I’m so over it. I just don’t even have words anymore lol this sucks",
      "author": "AStruggling8",
      "created": 1618845284,
      "upvotes": 21,
      "replies": {
        "gv399p3": {
          "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv399p3/",
          "text": "same, i just feel beaten down by the system. there’s nothing we can do to fight it all we can do is put our heads down and get through another day. definitely fucking sucks",
          "author": "mr-bitch-ass",
          "created": 1618845563,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gv37qzy": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv37qzy/",
      "text": "I'm feeling the same way. I WFH so I'm at my computer a good 10+ hrs per day. I sometimes feel like throwing the computer against the wall. It's driving me insane.",
      "author": "SwiftCEO",
      "created": 1618844902,
      "upvotes": 9,
      "replies": {}
    },
    "gv3449l": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv3449l/",
      "text": "Im losing my shit over here because the bot said thank you mr bitch ass\n\n&#x200B;\n\nBut hey, college is so fucking difficult because the same place I do my homework in the same place I chillax. And my old job used to be virtual so it was even more chaotic",
      "author": "TheRapidTrailblazer",
      "created": 1618843312,
      "upvotes": 125,
      "replies": {
        "gv34jt1": {
          "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv34jt1/",
          "text": "hahah thanks that gave me a good laugh too, didn’t notice it til you said. \n\nyeah true, that definitely makes it harder to find a separation. wish there was a solution but for now there really isn’t a good one",
          "author": "mr-bitch-ass",
          "created": 1618843501,
          "upvotes": 27,
          "replies": {
            "gv3503w": {
              "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv3503w/",
              "text": "Yeah my community college is starting to offer more in person classes so hopefully things will get better soon. Unfortunately the classes at the university im transferring to doesn't have in person classes that fit in my schedule though",
              "author": "TheRapidTrailblazer",
              "created": 1618843700,
              "upvotes": 7,
              "replies": {
                "gv35gc6": {
                  "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv35gc6/",
                  "text": "damn, that’s unfortunate. maybe the library or something will be open so you can at least get some study time in there. i’m thinking about doing that for my finals cramming, i’m not super close to it which is why i haven’t been going often but it’s probably worth it.",
                  "author": "mr-bitch-ass",
                  "created": 1618843892,
                  "upvotes": 6,
                  "replies": {
                    "gv3vlb8": {
                      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv3vlb8/",
                      "text": "The library has limited hours open but my parents don't want me to leave my house too often so im only there like once every other week",
                      "author": "TheRapidTrailblazer",
                      "created": 1618854922,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gv30bdx": {
      "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv30bdx/",
      "text": "[deleted]",
      "author": null,
      "created": 1618841602,
      "upvotes": -19,
      "replies": {
        "gv338pr": {
          "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv338pr/",
          "text": "oh great, just took a look at your profile. maybe if you’re a professor you should realize you’re invading your students’ safe place to rant and commiserate, instead of making asshole comments because you’re unhappy with your own life.",
          "author": "mr-bitch-ass",
          "created": 1618842921,
          "upvotes": 19,
          "replies": {}
        },
        "gv35lsv": {
          "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv35lsv/",
          "text": "Professors are privileged and overpaid. You guys are part of the reason college is overpriced, yet all you do is complain about everything under the sun.",
          "author": "NoChannel1",
          "created": 1618843957,
          "upvotes": 16,
          "replies": {
            "gv3sw4n": {
              "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv3sw4n/",
              "text": "its mostly administration bloat that is driving up prices, but yeah profs are still overpaid relative to the ease and infrequency of their work",
              "author": "Plat_4_Beat_Faker",
              "created": 1618853785,
              "upvotes": 7,
              "replies": {
                "gv3u0jz": {
                  "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv3u0jz/",
                  "text": "I was looking at the salaries of many professors at my college (public state school) and some should not be making 100k plus. The only people that should be making that kind of money are people involved with the coordinating and running of an entire department. \n\nThe administrators can be crooks though, especially the financial aid offices. The federal government is to blame too, because these colleges raise the price of tuition knowing the government will just give anyone a loan. Now, these students graduate and some have to get loan forgiveness and the government loses whatever the excess left over was because the person simply cannot pay back a home mortgage at 20 something years old in ten years on 50k/year. These universities are inadvertently stealing from tax payers if you think about it.",
                  "author": "NoChannel1",
                  "created": 1618854257,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        },
        "gv5jbr5": {
          "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv5jbr5/",
          "text": "Omg literally do all professors have to be annoying. It’s like there’s a rule or something",
          "author": "satlovernot",
          "created": 1618882601,
          "upvotes": 4,
          "replies": {}
        },
        "gv5r7wh": {
          "link": "/r/CollegeRant/comments/mu1eex/no_breaks/gv5r7wh/",
          "text": "I’m truly sorry that you feel that way about your life. However, this is not the time or place to express that. Instead of trying to make everyone feel as miserable as you do, take steps to find some joy in your own life. I hope you don’t speak like this to your students",
          "author": "Equinephilosopher",
          "created": 1618886727,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634063842
}