{
  "sid": "jfyb4e",
  "link": "/r/CollegeRant/comments/jfyb4e/i_know_im_being_whiny_but_i_wasnt_able_to_finish/",
  "title:": "i know im being whiny but i wasn't able to finish my exam",
  "text": "i hate it, i know u should've just studied better so i wouldn't be in this pinch. but srsly what makes taking tests harder now is that i have to take into account how the the internet lags. i hate how profs make tests were you cant backtrack. i get its a sabotage but tests were you cant back track are just not internet friendly. its hard enough with having a time limit you don't need to add a no back track sabotage :(. I mean not being able to finish the test because the internet gets you stuck in one item is really one of the biggest reasons im not able to finish a test. even if i only had a few minutes left every second counts. well for me at least. and tbh if it wasn't for the lag i would've been able to finish the test...idk i hate it. my school has three grading period in a semester and our over all grade for a semester is the average of the three grading periods. im in my second grading period and I just botched my major exams. i dunno anymore. i feel like there's no hope anymore. but at the same time i know i still have one more grading period to go, but i don't now if I'll realistically even be able to make up for my low grades right now to pass my semester. i hate it. i don't like online classes. i wont lie the pressure really takes the fun in learning away. i get its the reality and many times its the way for pushing people to study. but i swear this whole online thing is legit sabotage. i already suck in real life classes. i feel like ill end up doing worse with online classes. I also know it would be better and i would've done better if i wasn't to hung up with my previous screw ups in tests the past few months. but it's just hard for me. after having failed and being an irregular student, it's just difficult to get past the \"trauma\"(i don't mean officially diagnosed as traumatized im just throwing it casually) of like failing. anwho im scared of failing. this is just a rant ofc hence the page. im scared i screwed up. i shoudl be giving my all no matter what. and im gonna do that i dont know if its too late now or if its going to do something. i know its just logic. but im still scared, and there's just a lot of factors that i cant control. \n\n&#x200B;\n\nkay that's just about it, this is really a mix of college rant and my own personal shi problems which are just mucking up my situation with college now....",
  "author": "Poopybeans227",
  "created": 1603368203,
  "over_18": false,
  "upvotes": 82,
  "upvote_ratio": 0.96,
  "comments": {
    "g9o27w2": {
      "link": "/r/CollegeRant/comments/jfyb4e/i_know_im_being_whiny_but_i_wasnt_able_to_finish/g9o27w2/",
      "text": "I never understood why I can’t see the questions I got wrong so I at least know what I need to work on that’s what bothers me. Like I already took the damn test, not knowing isn’t going to help me in anyway.",
      "author": "Hawkbiitt",
      "created": 1603388314,
      "upvotes": 8,
      "replies": {
        "g9ouonr": {
          "link": "/r/CollegeRant/comments/jfyb4e/i_know_im_being_whiny_but_i_wasnt_able_to_finish/g9ouonr/",
          "text": "I hate that too! I know it's probably so that we don't give the answers to people who already took the test, but if you're not gonna do that then at least release an answer key once the test is closed or something. I've had teachers who do that and it's my h more simple than emailing your professor over one question you got wrong. That way we can actually learn without crowding up their emails",
          "author": "vness1213",
          "created": 1603400685,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9nkr1p": {
      "link": "/r/CollegeRant/comments/jfyb4e/i_know_im_being_whiny_but_i_wasnt_able_to_finish/g9nkr1p/",
      "text": "I'd definitely recommend talking to your professor. I've only had one class that was like that, and it was math. It's a terrible way of structuring tests, and if enough people give reasonable complaints about it and the class average is suffering as a result, the college may look into a different testing software",
      "author": "Kylrm732",
      "created": 1603379850,
      "upvotes": 15,
      "replies": {}
    }
  },
  "updated": 1634062811
}