{
  "sid": "p4c0ya",
  "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/",
  "title:": "Might fail summer course that I really needed to pass",
  "text": "So I needed to take gen chem 2 over this summer, as it’s a prereq for my new major that I just switched into. I attempted to take it spring of 2020 but ended up withdrawing and delaying it until summer. (This was a bad move). I decided to take it from a college near my parents house since I’m staying with them for the summer. Unfortunately, to transfer credit to my actual school you need a C- or better in the course. I am terrible at chemistry and barely passed gen chem 1 my freshman year. I am almost done with the course and it does not look good for keeping a C in the class after the final exam. I am so upset with myself because not only did I need this course to transfer, but I had to pay for it separately as well. So it will be a waste of a couple thousand bucks in addition to a huge problem with some courses I need down the line. I will do my best on the final exam, but I have no idea what to do should I end up getting below a C. (I even briefly considered cheating but that will never sit right with me- can’t bring myself to do it). I don’t know how lenient my professors will be in terms of waiving a prereq if I don’t have it, and I REALLY don’t want to take this course again. It would be trying for a third time and I don’t know if I can handle it. Has anyone been in this situation who could maybe offer some words of advice? I have no idea what to do. Thx",
  "author": "toastedmeat_",
  "created": 1628961290,
  "over_18": false,
  "upvotes": 42,
  "upvote_ratio": 0.91,
  "comments": {
    "h905nce": {
      "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h905nce/",
      "text": "Talk to you professor ASAP. Let them know what’s going on. Grovel or whatever you wanna call it, it doesn’t matter at this point. Advocate. For. Yourself.",
      "author": "Guess_Advanced",
      "created": 1629009669,
      "upvotes": 2,
      "replies": {}
    },
    "h8zmbc9": {
      "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8zmbc9/",
      "text": "I went through the exact same thing with the exact same class. For some reason I ended up passing. A lot of comments on my post have good advice though.",
      "author": "blabbedybloobla",
      "created": 1628997132,
      "upvotes": 1,
      "replies": {}
    },
    "h8zaidn": {
      "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8zaidn/",
      "text": "Can’t offer much advice, but if its any comfort I’ve basically been in the same position. I barely passed gen chem 1, failed gen chem 2, and then had to retake it over the summer and just barely passed that. \n\nSummer classes suck, but just know that whats done is done, you can’t change the past so just do your best on the final and don’t dwell on it.",
      "author": "JetmanNY",
      "created": 1628990972,
      "upvotes": 3,
      "replies": {}
    },
    "h8z4dau": {
      "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8z4dau/",
      "text": "Hello! I've taken General chem ll three times the first time a D+ the second time I withdrawn from the class, and the third time I passed with a C- what helped me was online resources like Clutchprep it REALLY helped me with my chemistry courses.",
      "author": "Halomast123",
      "created": 1628987873,
      "upvotes": 3,
      "replies": {}
    },
    "h8y638d": {
      "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8y638d/",
      "text": "typically if you need the course to transfer and you don't have it for whatever reason you can still transfer and would just take it again at the new school. assuming this is the only class you are missing they should be able to accomodate.",
      "author": "izzydagreat",
      "created": 1628971387,
      "upvotes": 0,
      "replies": {}
    },
    "h8y4xej": {
      "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8y4xej/",
      "text": "If you’re having trouble understanding the material I think The Organic Chemistry Tutor on YouTube would be of great help! I watched his videos and they helped me understand chemistry from AP chemistry in high school up to passing General Chemistry 2! I know the name is organic chemistry but if you search that name plus the type of questions you have he has tons of videos explaining and going through multiple practice problems! Good luck!",
      "author": "mimi_00",
      "created": 1628970848,
      "upvotes": 6,
      "replies": {}
    },
    "h8xk5hl": {
      "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8xk5hl/",
      "text": "Do you know where your weaknesses are? Can you work on fixing them?",
      "author": "Crochitting",
      "created": 1628961588,
      "upvotes": 10,
      "replies": {
        "h8xkkkh": {
          "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8xkkkh/",
          "text": "It’s mostly understanding what the written problems are asking and knowing what steps to take to reach the answer. Doing a lot of practice problems helps, but unfortunately I really don’t have the time to go above and beyond. I am also working a summer job and struggling to keep up with the mandatory assignments. (The 2x a week lab section doesn’t help either). I wish I could’ve figured out better time management earlier in the course. It might be too late now",
          "author": "toastedmeat_",
          "created": 1628961761,
          "upvotes": 6,
          "replies": {
            "h8xmmdl": {
              "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8xmmdl/",
              "text": "Get your priorities right and quit the job or take a couple weeks off to buckle down and do better in the course.",
              "author": "DeadWoodPark",
              "created": 1628962643,
              "upvotes": 10,
              "replies": {
                "h8xmy5k": {
                  "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8xmy5k/",
                  "text": "I should have done that. I regret staying at the job while trying to take the class. The worst thing is I’ll be out more money than I earned after this. Complete wrong decision on my part. Unfortunately it’s too late for that now, but thanks for the advice.",
                  "author": "toastedmeat_",
                  "created": 1628962786,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "h8xmjzu": {
              "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8xmjzu/",
              "text": "Hey! Chemistry tutor here, Gen chem 2 requires a lot of problem solving skills and practice. If you can use resources to your advantage use them!! Also is your last unit nuclear chemistry? That’s literally the easiest unit I ever learned in chemistry. It’s child’s play, and most Gen chem classes end with it and it’s a big boost to a lot of students grades. But like I said practice practice practice, chemistry involved INTENSIVE problem solving skills and if u don’t practice itll bite u in the ass on exams.",
              "author": "ttyltyler",
              "created": 1628962614,
              "upvotes": 3,
              "replies": {
                "h8xn8ng": {
                  "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8xn8ng/",
                  "text": "Interestingly we didn’t cover nuclear chemistry. I don’t know why, it might be a choice made by the professor or university. The last unit we covered was chemical kinetics. But yeah the lack of practice is really killing me. The only exam I did well on was one where I really had time to buckle down and get a lot of practice problems in.",
                  "author": "toastedmeat_",
                  "created": 1628962912,
                  "upvotes": 3,
                  "replies": {
                    "h8yc6d3": {
                      "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8yc6d3/",
                      "text": "Yea makes sense, I’d study hours to get As on exams and once for an exam I didn’t and got a D lol. That’s so weird you end with kinetics?! Most start with kinetics.. because kinetics is one of the hardest units 😭.",
                      "author": "ttyltyler",
                      "created": 1628974162,
                      "upvotes": 3,
                      "replies": {
                        "h8zit2k": {
                          "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8zit2k/",
                          "text": "Yeah I heard a lot of courses end with nuclear but i guess I’m just unlucky",
                          "author": "toastedmeat_",
                          "created": 1628995257,
                          "upvotes": 1,
                          "replies": {
                            "h8zmdj5": {
                              "link": "/r/CollegeRant/comments/p4c0ya/might_fail_summer_course_that_i_really_needed_to/h8zmdj5/",
                              "text": "Dahm that’s tough but pull through it, if u need to retake it do a 16 week class. Summer classes are usually tighter and you’ll have more study time in a 16 week.",
                              "author": "ttyltyler",
                              "created": 1628997165,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634063207
}