{
  "sid": "qasuy0",
  "link": "/r/CollegeRant/comments/qasuy0/i_cant_make_friends_for_the_life_of_me_and_i_feel/",
  "title:": "I can’t make friends for the life of me and I feel left behind.",
  "text": "I’m a first year undergrad and it SUCKS. I’m only two or so months into college but holy shit. All I do is work on my homework and study... and I try to get ahead on work so I don’t fall behind. I also prioritize my health above all else so i get a shit ton of sleep, I workout consistently, and just try to focus on me. \n\nHOWEVER, i still want friends ... duh. I feel so left behind; I’ve made acquaintances with some people in my classes but it doesn’t extend past that. Feels like everyone is going to parties and having fun besides me. It’s just so isolating. I thought college would be a chance for me to make friends but it’s just like high school except bigger. \n\ndoes anyone have like... ways to cope with this. I feel so lonely all the time",
  "author": "softsoapfish",
  "created": 1634582000,
  "updated": 1634654966,
  "over_18": false,
  "upvotes": 77,
  "upvote_ratio": 0.99,
  "comments": {
    "hh5g5el": {
      "link": "/r/CollegeRant/comments/qasuy0/i_cant_make_friends_for_the_life_of_me_and_i_feel/hh5g5el/",
      "text": "Have you tried joining clubs or organizations? That's a good way to make friends from what I hear. I tried to but could not due to space sadly as a sophomore first year on campus, it really sucks because covid already messed up my freshman year and now my first semester of sophomore year is a dud. I am in a similar spot with friends as you are right now. It is hard and lonely pretty often but it may take more time than just a semester to make friends. Just keep trying to socialize and such.",
      "author": "Reaper_gaming_afk",
      "created": 1634588416,
      "upvotes": 22,
      "replies": {
        "hh6nf91": {
          "link": "/r/CollegeRant/comments/qasuy0/i_cant_make_friends_for_the_life_of_me_and_i_feel/hh6nf91/",
          "text": "Second this. Join clubs. Opened so many doors for me. Allowed me to make friends.",
          "author": "majoroofboys",
          "created": 1634609051,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hh636fx": {
      "link": "/r/CollegeRant/comments/qasuy0/i_cant_make_friends_for_the_life_of_me_and_i_feel/hh636fx/",
      "text": "I think you just have to get out of your comfort zone and actually talk to people. I used to be very shy in high school but when I went to college I started putting effort in starting conversations about anything basically.\n\nF.e waiting outside with a random classmate before my I.t class. I go:\n-so excel is really tricky sometimes right?\n-yea it's like once you get the hang of it though you will be ok\n- yes that's what I was thinking, I'm also into (add different program here)\nAnd the conversation goes on and on\n\nI have made a lot of friends. my college has a lot of friendly people too which helped me out too (dk about yours).\n \n Keep it friendly and casual and stay away from gossiping or bringing drama. Or if you do, say it in a funny/teasing way.  try to maintain a humorous conversation and a funny mood all around.  funny people are liked and everyone wants to hang around them. \n\nIn the end of the day all people around you there are just as lost as you, don't think about what you are going to say matters too much because it really doesn't. And if you say something weird or cringy so what. We all say cringy shit all the time. Even if you do, just acknowledge it and make self depreciating humor about it. People will like and respect that.\n\nTldr: talk to everyone, don't think too much.",
      "author": "The_Demonotiser",
      "created": 1634599325,
      "upvotes": 15,
      "replies": {}
    },
    "hh668ed": {
      "link": "/r/CollegeRant/comments/qasuy0/i_cant_make_friends_for_the_life_of_me_and_i_feel/hh668ed/",
      "text": "The college that I currently go to is a commuter school, so within the first few weeks of school, I realized that I couldn't just be going to school, go home, doing homework, and sleeping. I would make acquaintances in my classes, but nothing more than that. I know how you feel. I think the best thing to do is join a club, organization, or even a frat/sorority on campus. You could also perhaps get an on-campus job. Joining orgs on campus completely changed my overall experience in college and I'm so grateful I did it. It'll help you find your niche on campus. Hang in there! :)",
      "author": "hhaileyymariee",
      "created": 1634600795,
      "upvotes": 5,
      "replies": {}
    },
    "hh6ke6p": {
      "link": "/r/CollegeRant/comments/qasuy0/i_cant_make_friends_for_the_life_of_me_and_i_feel/hh6ke6p/",
      "text": "Am unsure if this helps but I go to office hours of the professor. I sorta \"fulfill\" social need and get help/hints on my homework at the same time. Sometimes I end up making friends with classmates that visit too and even form a study group, 2 birds 1 stone.",
      "author": "mathcoral",
      "created": 1634607582,
      "upvotes": 1,
      "replies": {}
    }
  }
}