{"sid": "p3r10j", "link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/", "title:": "Everyone’s cheating and I get screwed for being honest.", "text": "My summer Political Science course is pretty straight forward—weekly reading, video lecture, supplemental reading, short discussion, and quiz. The problem all semester is that the quizzes have a lot of incredibly specific questions that are rarely covered in the reading or the lecture and I’ve struggled with them all semester. These quizzes are not open book. \n\nThe grades show a class average of every quiz and the average is always above 90%, most students are scoring 100% every week. I’m the only person who hasn’t aced almost every single quiz; my worst grade is a 70%, my best grade is a 90%. I was curious so I decided to investigate. I took my last quiz, got a B, but copied and pasted all the questions before submitting. Afterward, I looked up the terms and subjects in our textbook, but nothing came up. I would literally have to had done research outside of class material to know some of these answers. So, still curious, I copied the first question into google and it came up immediately, not just the question, but the correct answer. I did this for all 20 questions and every single correct answer came up immediately. \n\nSo, either every other student in the class knows what’ll be on the quiz and studies beforehand, or they’re all just googling the questions and getting the answers cause they know our professor is copying and pasting his quizzes. \n\nI feel like a moron. I have the lowest grade in all the quizzes, but it’s likely cause I’m the only one not cheating.", "author": "MiddleweightMuffin", "created": 1628879125, "retrieved": 1632950338, "over_18": false, "upvotes": 199, "upvote_ratio": 0.92, "comments": {"h917y7a": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h917y7a/", "text": "Love the title .", "author": "letusrantbbg2021", "created": 1629037439, "upvotes": 1}, "h8xm7lc": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8xm7lc/", "text": "I’m probably going to get downvoted to hell for saying this, but everyone (professor and classmates) but OP is shitty here. OP you clearly tried really hard in this class, and to find out that your professor didn’t give two fucks is disheartening…and believe me I understand that feeling well. And your fellow students? Absolutely shitty for thinking that academic dishonesty is acceptable. Any competent professor would’ve weeded out their cheating ages ago, or at least any professor that cared would’ve. \n\nI know the circumstances were shitty. The professor should’ve set up quizzes that actually pertained to the course work. That’s what a good professor does. However that doesn’t mean that cheating was the way to go. What everyone should’ve done instead is gone to the head of the department or the dean to roast your professor. \n\nStick to your standards, OP. And to all the people telling them that cheating is okay, take a long look at yourselves and remember that someday you’re going to be caught and put on academic probation, or worse…expelled.", "author": "WingsofRain", "created": 1628962466, "upvotes": 6}, "h8wnre3": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8wnre3/", "text": "You made it on r/professors", "author": "Nejious", "created": 1628946675, "upvotes": 17}, "h8wkg74": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8wkg74/", "text": "trust me, if your professor cared, a proctoring software would’ve been obligatory to deter straight up googling.", "author": "kaytherine", "created": 1628944813, "upvotes": 3}, "h8wcsd4": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8wcsd4/", "text": "Your professor is most likely copying their quiz questions from Quizlet or something. Teachers do it all the time, but we usually make sure they are aligned to the curriculum. That's incredibly lazy on their part.", "author": "TerranOrDie", "created": 1628939557, "upvotes": 2}, "h8w4zr1": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8w4zr1/", "text": "Tell your professor. They may not know.", "author": "Ryiujin", "created": 1628932856, "upvotes": 3}, "h8w3u9n": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8w3u9n/", "text": "My math quizzes and exams are closed book. We have tons of formulas throughout the course which I cant remember all of them. The professor specifically asks everyone to turn on their camera on zoom and show their work station while in exam. I set up my camera so that he has a full frontal view of my chest and the work desk Im sitting at, but my head is cut off from the camera angle. And guess what, I have post-it notes right in front of me which I pastes onto my computer’s bottom end with tons of formulas in them. So when I do that math, I can look at them all I want and he would not know. Am I cheating? Maybe. But Im doing all the problem correctly and get good grades in this class because I spend time in practicing the problems rather than memorizing those formulas in the first place. And when you practice enough problems, the formulas stay in your head too. So study smarter, not harder dude. Mark my words!", "author": "FluffyStuffInDaHouz", "created": 1628931834, "upvotes": 13}, "h8vbgfd": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8vbgfd/", "text": "Look man imma be straight up. That’s how a lot of higher education can be nowadays. Especially if your not in an upper level course, those profs don’t care about what you’re actually learning, they just need metrics. And if they give out bs quizzes that everyone gets A’s on, on paper it just looks like he’s teaching well and y’all are learning. \n\nAnd tbh you can think of it as cheating rn, which it is don’t get me wrong. But in the real world there’s gonna be a lot of shit you gotta do that you won’t know and you’ll have to find the fastest way to get the right answer. I applaud your integrity, but in full honesty in this case the cons outweighs the very minimal pros", "author": "CertifiedWildman", "created": 1628911668, "upvotes": 16}, "h8uy9ej": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8uy9ej/", "text": "I feel your pain but the professors may not be copying their questions. Students post study guides, home work and even tests to share with each other. Professors dont have the time to remake the same assignments every semester. \n\nOr the professor really is copying questions - I had one teacher use the publisher test bank. A fellow student bought the book and shared it with the class. \n\nEither way - if they really wanted it to be a closed book exam, they would have used a proctoring software.", "author": "jfkdodhsk", "created": 1628905006, "upvotes": 20}, "h8upeg1": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8upeg1/", "text": "Welcome to politics", "author": "NoSpaceAlien", "created": 1628900629, "upvotes": 6}, "h8ukysa": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8ukysa/", "text": "Bro not to be rude but college is a scam. Im not saying cheat your way through it but when something is that stupidly set up (answers obviously not available in the class material) then idk what you’re expecting. You make it seem like copy and pasting a question into google was some massive step you had to overtake on your moral compass when I promise you 90% of college kids are doing that for every exam or assignment where its possible. Again I’m not saying scam and cheat your way through your degree but just be smart about it. They’re making you pay thousands of dollars to take these classes why would you put yourself at a disadvantage like that. If the professor cared enough to make a class worth your money he would make quizzes that were actually based off his class.\n\nTwo years ago I had a class where every single quiz and assignment the entire class quizletted everything with no objection from the professor and then on the final he tried to screw everyone over and fail everyone for doing it but the students ended up winning and overturning the decision 🤷‍♂️", "author": "2019ForestHillsDrive", "created": 1628898478, "upvotes": 13}, "h8uhtb2": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8uhtb2/", "text": "You can cheat just as long as your learning the materials. I've been cheating for a long time, there was a few classes I did try and be honest but the whole class cheated and passed while I had to retake the subjects which was the last straw for me. Do anything in your power to get your degree even if you gotta cheat. \n\nIn the real world you use resources, ask questions, ask for help, take notes etc and not have to memorize everything. Personally I'm not gonna let one test determine my entire hard work throughout the semester. sometimes you gotta cheat the system because the system is already fucked up.\n\nEdit: cheating isn't a necessarily a bad thing, your using resources to help you get to X goal and doing your own research which is literally how it is in the work field, using your resources and outside resources to help you do the job.", "author": "edlightenme", "created": 1628896996, "upvotes": 46}, "h8ueo37": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8ueo37/", "text": "Well that's life at least you're better than them.", "author": "croweatyoureyes", "created": 1628895556, "upvotes": 5}, "h8ud1f9": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8ud1f9/", "text": "I definitely look up the answers. I'm not being lazy, I do the readings and all that. I still want to learn. However, I care about my grade too much to *not* look them up and be sure of my answers. I'm not going to let Academic Integrity get in my way", "author": "unholymanserpent", "created": 1628894824, "upvotes": 20}, "h8ubm67": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8ubm67/", "text": "If you’re able to find the questions so easily on Google I wonder how much effort your professor is really putting into the curriculum.", "author": "Visual-Hold233", "created": 1628894201, "upvotes": 150}, "h8u81pf": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8u81pf/", "text": "Maybe some people (like myself) just put off things like fun and a social life for 8 months out of the year for their gpa, you did the right thing by not cheating. However, if it’s just for a gen-ed you will never use in your life, I wouldn’t call you a morally wrong person for following the crowd.", "author": "Topazz410", "created": 1628892609, "upvotes": 9}, "h8tvuk8": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8tvuk8/", "text": "You don’t get a special award for being prideful and honest. If everyone is cheating and getting a 4.0 while you’re being honest and getting a 3.0 then you’re just digging yourself a grave. Your diploma won’t say “xx.x GPA but did so with pride”. Learn to play the game before you and excel at it. Remember, if a professor is lazy enough to pull all their course material off the internet then it’s unfair for you, as a student, to be expected to put in considerably more care into your education than them. Get that bag by all means", "author": "JoeJoe1492", "created": 1628887594, "upvotes": 166}, "h8tbcvl": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8tbcvl/", "text": "How do you know that *everyone* except you is cheating tho? just because the answers can be found online this doesn't actually give evidence of that.", "author": "Wowzaitstorii", "created": 1628879550, "upvotes": 37}, "h8taqs1": {"link": "/r/CollegeRant/comments/p3r10j/everyones_cheating_and_i_get_screwed_for_being/h8taqs1/", "text": "I didn't even read this, but you should realize that the title of your post will be applicable for the rest of your life.", "author": "ihateredditabunch", "created": 1628879301, "upvotes": 141}}}