{"sid": "pdaw1j", "link": "/r/CollegeRant/comments/pdaw1j/unsure/", "title:": "Unsure", "text": " I am 21 years old and still feel unsure with everything. I am so proud of my friends. They reaching their dreams and happy of what they're doing. They already have achievements, plans and pursuing what their hearts saying. While here I am, constantly asking what I really wanna do? I have no others plans for myself. I am pursuing a college course that I really don't want. I went back to a place which cause me trauma. I am still don't know why I am living here on earth and breathing. Somehow, I envy all the people around me.", "author": "hatdogsunog", "created": 1630161369, "retrieved": 1632841524, "over_18": false, "upvotes": 7, "upvote_ratio": 0.83, "comments": {"haoq3np": {"link": "/r/CollegeRant/comments/pdaw1j/unsure/haoq3np/", "text": "Thank you u/hatdogsunog for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*", "author": "AutoModerator", "created": 1630161369, "upvotes": 1}, "hasol4q": {"link": "/r/CollegeRant/comments/pdaw1j/unsure/hasol4q/", "text": "Hey, buddy, you're just 21 :) Of course, a lot of people of your age are unsure about what they need and what they want. It's OK. But you'll definitely get nothing with envy. Try to not compare yourself with others since everyone has their own path. Try new things, try to change your routine, communicate with people who inspire you - then you'll be clear about your next steps. If you don't like your chosen major in college, you can choose another one for your Master's degree.\r  \nHave a great day ;)", "author": "James_Korbyn", "created": 1630240747, "upvotes": 2}, "haq8yww": {"link": "/r/CollegeRant/comments/pdaw1j/unsure/haq8yww/", "text": "do what makes you happy, pursue what you’re passionate about - there are no restrictions or laws that say you have to study a certain subject or course in college. the only person capable of telling you what you want to hear is yourself. \ni’m an english major, 19 year old, and all my life i’ve been surrounded by people who work in medical and engineering fields, telling me to go into nursing school. telling me how much money they make, and how much they earn. \nin the end, it’s going to be YOU that knows what’s good for you. \nYou know you better than anyone, and you’re right, sometimes you think “what’s the point?” , no one can know for sure what the point is, so that’s why you gotta do what makes YOU happy. study whatever you want - film, art, drama, dance, hell, study philosophy! at the end of the day, you need to enjoy whatever you’re doing, right? \n“what’s the point?” exactly! what’s the point? the LEAST you can do for yourself is give yourself a chance to study something you like :)  - that way, at least then you’ll have something to look forward to\n\nfor context, i’ve been told to study in nursing school for as long as i can remember, and here i am, majoring in english with a concentration in creative writing because why not, right? i like writing and i want to be a published author. who’s to say i can’t do what i want? who’s to say YOU can’t do what you want?", "author": "Critical-Garbage-211", "created": 1630185445, "upvotes": 2}, "haotbyy": {"link": "/r/CollegeRant/comments/pdaw1j/unsure/haotbyy/", "text": "Friend you are living on earth for a reason!  You’re only 21 you have many many many years to figure out what you want to do.  The life we live isn’t relative to those around us, it’s a very subjective experience.  I am 26 and have a year left of Undergraduate. I attended a Community College 2 years after High School and ended up taking time off. I was in the same boat.  Not sure what I wanted to do and depressed over a failed relationship.  It took me until I was 24 to figure out exactly what I want to do.  You have time.  Watch Gary Vaynerchuk great motivational speaker!!!  I love you and pray that god guides you to a life of compassion, fulfillment and prosperity.", "author": "ZolwMotion", "created": 1630162818, "upvotes": 6}}}