{
  "sid": "k416ra",
  "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/",
  "title:": "My roommate is filing a police report on me over a missing plastic bowl.",
  "text": " If you'd like to take a peak at my older posts, my roommates and I have never quite gotten along. Between telling me I'm less because I'm only a biology major, never letting me turn the AC off even when it's snowing, and calling me a disgusting human for biting my nails -- a nervous tic, telling me to not speak to them because they knew I wasn't going to vibe with them from day 1, it was never very good.\n\nI moved out of our on campus apartment last week because I'm graduating this semester and obviously won't be returning for the spring. While moving out, I may have accidentally taken one of my roommate's plastic bowls because we have the same ones. They are 79 cents from target.\n\nI didn't know that I may have accidentally snagged one (I still don't know if I even did), but my roommates texted me saying I stole property from them and they will be filing a police report and suing me here soon unless I paid them. Normally I'd be like \"sure whatever\" and front the 79 cents. But instead, they venmo requested me six dollars. I said fuck that, and they can have fun trying to file a police report and suing me over a plastic bowl. I blocked their numbers and went on with my day. I then got another venmo request this morning from the other roommate saying \"you stole our shit + interest\" for TEN DOLLARS.\n\nI...what? I never thought this would be how my undergrad years ended lol, being sued over a 79 cent plastic bowl from target.\n\nHappy finals week!",
  "author": "nadehlaaay",
  "created": 1606759252,
  "over_18": false,
  "upvotes": 287,
  "upvote_ratio": 1.0,
  "comments": {
    "ge92569": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge92569/",
      "text": "What a lunatic lol",
      "author": "dopedebris",
      "created": 1606823915,
      "upvotes": 1,
      "replies": {}
    },
    "ge8denq": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge8denq/",
      "text": "Hi! In the US, you can only sue if the value of the disputed item is above $20. Anything below will not be considered in court.",
      "author": "tabby_30",
      "created": 1606800153,
      "upvotes": 3,
      "replies": {}
    },
    "ge8coai": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge8coai/",
      "text": "What state are you in? They cussed at you and demanded money? Demanded interest based on what? They demanded more money in return they wouldn't file a report? Oh buddy, where to begin with that.  That's a criminal offense. (A bit of a stretch but way less so than a bowl).\n\nI am willing to act as your attorney just reply the state and if I am there ill dm you. They won't talk to you again.",
      "author": "CrazyHorse_CFH",
      "created": 1606799617,
      "upvotes": 3,
      "replies": {}
    },
    "ge7yvzs": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge7yvzs/",
      "text": "I remember your posts lol bruh your roommates suck. At least it'll be over soon",
      "author": "vness1213",
      "created": 1606791409,
      "upvotes": 3,
      "replies": {}
    },
    "ge7nqt0": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge7nqt0/",
      "text": "What's their major?",
      "author": "mrpigerz",
      "created": 1606785414,
      "upvotes": 3,
      "replies": {}
    },
    "ge7cgxs": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge7cgxs/",
      "text": "r/badroommates",
      "author": "Brandon_partain",
      "created": 1606779783,
      "upvotes": 4,
      "replies": {}
    },
    "ge762ox": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge762ox/",
      "text": "It cost like 200$ to file small claims they won’t and I highly doubt police will get involved over this",
      "author": "night2016",
      "created": 1606777027,
      "upvotes": 10,
      "replies": {}
    },
    "ge759th": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge759th/",
      "text": "Just sit back and eat some cereals out of their (if you have it) bowl and laugh :D\n\nGuess you lived with some dickheads for a while. Glad you got out of there.",
      "author": "Omeole",
      "created": 1606776685,
      "upvotes": 10,
      "replies": {}
    },
    "ge6v4m8": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge6v4m8/",
      "text": "OMGOSH you again!!! When you said *take a peak* I knew it was you before I even started reading 😂",
      "author": "Ohhiitsmeyagirl",
      "created": 1606772078,
      "upvotes": 14,
      "replies": {}
    },
    "ge6kz8c": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge6kz8c/",
      "text": "Go buy a cheap bowl and a spoon from dollar tree, mail it to the roomate, and then start venmo requesting them for $18.37.",
      "author": "Tiny_Giant_Robot",
      "created": 1606767254,
      "upvotes": 37,
      "replies": {}
    },
    "ge6k7ro": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge6k7ro/",
      "text": "Call them on their bluff. If they seriously try to have you arrested/sued over a cheap little bowl, they will be laughed out of the police station/attorney's office if not fined for wasting public resources.\n\nIf anything, give them two dollars and tell them to piss off",
      "author": "sunnirays",
      "created": 1606766899,
      "upvotes": 37,
      "replies": {
        "ge71fr6": {
          "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge71fr6/",
          "text": "Giving them money would be admitting OP is guilty. I say just ignore them.",
          "author": "ThinkThink23",
          "created": 1606775091,
          "upvotes": 20,
          "replies": {
            "ge74g8k": {
              "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge74g8k/",
              "text": "Yeah, you're probably right. I still stand by the calling them on their bluff part though",
              "author": "sunnirays",
              "created": 1606776335,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "ge6iuuo": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge6iuuo/",
      "text": "Ignore them.",
      "author": "orangeblackteal",
      "created": 1606766258,
      "upvotes": 6,
      "replies": {}
    },
    "ge64zmp": {
      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge64zmp/",
      "text": "LOL, he said you’re “less” because you’re “only a biology major”?\n\nI’m a biology major, is it easy at your school?  Cause I’m out here working my ass off lmao.\n\nAlso the rest was ridiculous too, I’m just astonished someone would say that.\n\nEdit: also don’t give them any money.  First off, they’d have to prove you stole it.  Second, stealing is only illegal if there is intent to steal (according to google, I’m not an attorney lol).  Third, no one is going to take a case seriously for a dollar bowl lmao.",
      "author": "mttlln",
      "created": 1606759768,
      "upvotes": 114,
      "replies": {
        "ge65b78": {
          "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge65b78/",
          "text": "Oh lord no, there's a reason I had to take an extra semester. Shit's hard. They think I'm less because they're in pharmacy school, basically doctors already and are god's gift to earth. \n\nThey once asked me, \"do you even study? like, biology majors. because our stuff is so hard and we have the study a lot.\"\n\nAnd yeah hell no, I'm not giving them a penny. Maybe if they asked nicely for the amount it's worth I'd have fronted the three quarters and four pennies, but not if they're gonna be dicks about it. They know that I know one of their parents is a lawyer so I should be super scared.\n\nAlso, these are all women. Petty, vicious women.",
          "author": "nadehlaaay",
          "created": 1606759921,
          "upvotes": 66,
          "replies": {
            "ge65z22": {
              "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge65z22/",
              "text": "That’s some bullshit because pharmacy overlaps biology for the first 3 years. Also, I don’t want her to be my fucking doctor. Imagine your a day late on your script and she charges you interest. Fuck her, I’m sorry you had to live with her.",
              "author": "denver_rose",
              "created": 1606760237,
              "upvotes": 39,
              "replies": {}
            },
            "ge65rrv": {
              "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge65rrv/",
              "text": "Lmfaooooo what fucking a-holes.  I hope they become doctors, they’ll fit right in with that toxic profession.",
              "author": "mttlln",
              "created": 1606760141,
              "upvotes": 14,
              "replies": {
                "ge6isim": {
                  "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge6isim/",
                  "text": "Doctors are supposed to cure people though.",
                  "author": "matroid21",
                  "created": 1606766227,
                  "upvotes": 5,
                  "replies": {
                    "ge6j5de": {
                      "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge6j5de/",
                      "text": "Doctors are pretty notoriously assholes though.  Nurses often are trusted more by patients.\n\nIt’s actually been proven that physicians in the US often opted for C section deliveries whenever possible because they’re quicker lol.  No regard for the patient or baby, just getting it over with.\n\nPhysicians are a holes.",
                      "author": "mttlln",
                      "created": 1606766400,
                      "upvotes": 10,
                      "replies": {
                        "ge6jdxy": {
                          "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge6jdxy/",
                          "text": "I don’t know, I can only speak from my own experience, I think I’ve only met one doctor that didn’t have stellar bedside manner. Most I’ve met are super caring.",
                          "author": "matroid21",
                          "created": 1606766513,
                          "upvotes": 6,
                          "replies": {
                            "ge6lsmp": {
                              "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge6lsmp/",
                              "text": "I think most doctors are cool but it's more the wanna be doctors. I'm talking about premeds or pharm kids, they believe that their stuff is the most difficult. Additionally, they look down on other majors and blab about what they're gonna be in med school.\n\n\nPS I was a \"premed\" major (biomedical science) and witnessed all this toxic environment.",
                              "author": "ImportantGreen",
                              "created": 1606767629,
                              "upvotes": 10,
                              "replies": {
                                "ge7584b": {
                                  "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge7584b/",
                                  "text": "This is right. The stuff they’re learning in pharmacy school is no different than what I learned my second year of being a bio major. Really, cell respiration? Really?",
                                  "author": "nadehlaaay",
                                  "created": 1606776664,
                                  "upvotes": 5,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "ge86vak": {
              "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge86vak/",
              "text": "Lol of course they go to pharmacy school. Pharmacy is going down the tubes. Terrible job market, BLS confirms it. There are PharmD’s on youtube like Paul Tran begging people to not go into the field. So many schools have opened in the past 10 years, they will accept anyone with a pulse because nobody who is actually smart wants to do a PharmD because there are little jobs and pharmacy will be replaced by automation soon.",
              "author": "urlbluntstomyirlface",
              "created": 1606795906,
              "upvotes": 2,
              "replies": {
                "ge8ach1": {
                  "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge8ach1/",
                  "text": "Yup, I started out as pharmacy but once I saw that BLS stat of -12% job growth, I noped tf out.",
                  "author": "nadehlaaay",
                  "created": 1606798018,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge73a2n": {
          "link": "/r/CollegeRant/comments/k416ra/my_roommate_is_filing_a_police_report_on_me_over/ge73a2n/",
          "text": "I had to take biology for my major to satisfy science and lab credits. Biology is a lot of memorization and it’s hard as hell. Anyone who says it’s easy is either speaking out of their asses or are naive to the point where a rational conversation is no longer feasible. \n\nI’m still laughing at how stupid this kid is. If the police report actually goes through, have it wiped off your record ASAP. Employers will see that and may deny you over something stupid. I forgot what it shows up in the system. I wouldn’t be surprised if it was some bs like “theft” with no details being shown.\n\nDon’t let another person’s ego and pride discredit the work you do and want to do. Some people are dicks because they feel entitled.",
          "author": "majoroofboys",
          "created": 1606775851,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634063347
}