{"sid": "p40dh4", "link": "/r/CollegeRant/comments/p40dh4/letting_peoples_words_about_my_commuting_instead/", "title:": "Letting people’s words about my commuting instead of going away get to me", "text": "I am going into my first year of college at CSULB in about a week. I am living at home and commuting, but am super excited to meet new people and join clubs and be involved, especially since I won’t be living on campus. I’ve been to a few parties this summer with all kids from my high school and a bunch of them were super rude about the fact that I chose commuting to Long Beach over going away to Santa Barbara. They made it sound like I was gonna go four years with no friends and no memories. I’m super excited about going to Long Beach, but with one week left before school starts, besides the worry of my workload and academics in general, these words are kind of starting to get to me. I guess I just wish that people would respect other peoples college choices because whatever plan you’ve made for after high school and beyond is valid and up to no one else. I can still go to parties and be young and dumb even though I’m commuting. I’m just not paying. $20,000 more a semester to do so.", "author": "Sorry_Poet_5446", "created": 1628911168, "retrieved": 1632949108, "over_18": false, "upvotes": 9, "upvote_ratio": 0.81, "comments": {"h8yyxjt": {"link": "/r/CollegeRant/comments/p40dh4/letting_peoples_words_about_my_commuting_instead/h8yyxjt/", "text": "Hey bud, don’t fucking listen to those fools. Let them pay all the money they want and get in debt for the “experience.” In the end, it’s all about the degree and making a good life for yourself. It doesn’t matter what path you take, only the end. Keep grinding", "author": "matsudasociety", "created": 1628985098, "upvotes": 2}, "h8w69y8": {"link": "/r/CollegeRant/comments/p40dh4/letting_peoples_words_about_my_commuting_instead/h8w69y8/", "text": "So I’m USC but I had quite a few commuter friends, and they were good friends! Also had a roomate that was practically a commuter cuz they always went home, but still had a lively social life. Its not really about your living situation, but YOU. You can have a social life if you want, just make friends", "author": "Visible_Negotiation4", "created": 1628933986, "upvotes": 3}, "h8w2h6x": {"link": "/r/CollegeRant/comments/p40dh4/letting_peoples_words_about_my_commuting_instead/h8w2h6x/", "text": "You're doing the smart thing, and as soon as you get into the thick of college, you'll forget most of your high school peers at the speed of light. I swear this whole idea that you have to live on campus to properly experience college is propaganda from universities to make kids pay for shitty overpriced dorms.", "author": "Eighth_Octavarium", "created": 1628930657, "upvotes": 5}, "h8vl7g8": {"link": "/r/CollegeRant/comments/p40dh4/letting_peoples_words_about_my_commuting_instead/h8vl7g8/", "text": "Fuck those high school kids, soon you’re gonna leave them all far behind. You’ll make plenty of new CSULB friends and be in clubs and all that good stuff.\n\nI’ve never spoken to a single person from my high school since we all went our separate ways.", "author": "dogandcats424242", "created": 1628917416, "upvotes": 9}}}