{"sid": "fzoq8u", "link": "/r/CollegeRant/comments/fzoq8u/scholarship_that_require_yo_to_maintain_a_high/", "title:": "Scholarship that require yo to maintain a high GPA suck!", "text": "So I worked my ass off to get scholarships so I didn’t have any student debt. actually right now I’m getting paid to go to college. Well one of my scholarships is &\n$2,500 per semester. That’s a lot of money but it requires me to keep a 3.0 GPA.\n\nThis drives me nuts because sometimes you just get a bad professor. Some classes are impossible to pass with a B. Right now I’m working my ass off to get a D up to a C while keeping all of my other grades at an A for a buffer. It’s really starting to stress me out because I can lose this scholarship!!", "author": "GabbyTheLegend", "created": 1586660155, "retrieved": 1632843568, "over_18": false, "upvotes": 33, "upvote_ratio": 0.9, "comments": {"fnwydhy": {"link": "/r/CollegeRant/comments/fzoq8u/scholarship_that_require_yo_to_maintain_a_high/fnwydhy/", "text": "Yep I’m at like a 2.7 when I need a 2.9 after a truly awful transition to college. I’ve been struggling all semester but I had a B or better in all my classes. This pandemic hit and I lost 15 points in one month in my hardest class. I could have passed with a B and now I don’t even know if I’ll pass at all. Everything else is going to shit and I can’t even process much of it because I have to do all this class work", "author": "Mail540", "created": 1587327879, "upvotes": 1}, "fn6gwv2": {"link": "/r/CollegeRant/comments/fzoq8u/scholarship_that_require_yo_to_maintain_a_high/fn6gwv2/", "text": "I had to get a C to pass a class in my major, in the masters degree for my field I know one you need Bs in every class", "author": "GuyFromNowhereUSA", "created": 1586698952, "upvotes": 1}, "fn5ceb5": {"link": "/r/CollegeRant/comments/fzoq8u/scholarship_that_require_yo_to_maintain_a_high/fn5ceb5/", "text": "What class are you having a D in? Also what are your other classes?", "author": "chenthehen", "created": 1586661237, "upvotes": 2}, "fn5b1u4": {"link": "/r/CollegeRant/comments/fzoq8u/scholarship_that_require_yo_to_maintain_a_high/fn5b1u4/", "text": "Same boat here man, and online classes aren’t really helping.", "author": "Callofapple123", "created": 1586660276, "upvotes": 12}}}