{"sid": "fv4xfw", "link": "/r/CollegeRant/comments/fv4xfw/studying_less_than_i_should_gets_me_better_grades/", "title:": "Studying less than I should gets me better grades than studying more", "text": "This is honestly frustrating. I don’t understand why this is happening at all. Whenever I study to the point of understanding all the material completely, I get shafted on the exams but if I study less or even drink the night before I do better than focusing entirely on the exam with days of studying behind me. It’s not even an issue of easy classes vs hard classes. I give up studying pretty fast for physics and sometimes I even had a hackathon which made me sleep deprived before the test and I straight up ace most of those exams, but if I’m well prepared, I mess up on an exam even more by misreading questions entirely or just not thinking thoroughly. I’ve decided to have a more laidback approach on studying for my exams and it’s working out better than when I did study a great amount. I really envy people who can study that much and have better results but I really can’t, and it makes my exam results unpredictable and the exam themselves stressful.\nI just want some understanding on why it’s happening like this and how to fix it :(", "author": "RGBPlatypus", "created": 1586048054, "retrieved": 1632843485, "over_18": false, "upvotes": 41, "upvote_ratio": 1.0, "comments": {"fmgv4t5": {"link": "/r/CollegeRant/comments/fv4xfw/studying_less_than_i_should_gets_me_better_grades/fmgv4t5/", "text": "I’ve always been that way. If I try to spend any significant amount of time studying I do horribly, if I don’t and just do my best to retain the info the first time around I do great. It’s so weird", "author": "trippapotamus", "created": 1586058657, "upvotes": 13}, "fmgpsdg": {"link": "/r/CollegeRant/comments/fv4xfw/studying_less_than_i_should_gets_me_better_grades/fmgpsdg/", "text": "Cramming before a exam is not a ideal, and although it might work, it also might not as a stressed out brain takes in less info then a calm brain. All because cramming works for other students doesn't mean it would work for you. Also, sleep depriving yourself basically prevents info from being solidified. Maybe on the tests you do well on without studying it's either because the test is easy or because you actually studied and learned well at the normal time, so you don't really have to study before the test.  Usually the people that study harder then everybody else right before the exam are the one's that study less at the normal time when they're supposed to study. \n\nMaybe when you think you're well prepared, you're really not as prepared as you think. People have the tendency to under judge as well as over judge themselves.", "author": "chenthehen", "created": 1586054648, "upvotes": 2}}}