{
  "sid": "qje9vr",
  "link": "/r/CollegeRant/comments/qje9vr/tired_of_online_classes_with_inperson_midterms/",
  "title:": "Tired of online classes with in-person midterms and final exams, but I have no other option.",
  "text": "Sorry for the long rant, I'm just slowly getting more and more fed up with online classes due to the pandemic.\n\nAll the other colleges around me are back to face-to-face learning again except the one I enrolled in. Not only that, all other majors in *this* college are doing face-to-face learning, except computer science because apparently there are too many students for it to be feasible with Covid. When I was applying, I talked face to face to an administrator, who assured me that classes would **not** be online this year. Guess what, they changed their minds, despite the pandemic situation being *better* than it was (in my country at least) when I heard those words.\n\nThe very first lecture I attended had connectivity issues, since then \\~half of them have had issues. This Wednesday the professor didn't even start the lecture, and only let us know on Friday that we'd be having a lecture on Saturday to make up for it. I wake up early and join the class only to see the professor can't get his mic to work, so he doesn't hold the lecture. I think whatever, I'll just join group 2 an hour later and view *their* lecture since nobody will care or notice me, but the professor says he won't be holding the lecture for any of the groups today due to the technical problem, so I went back to sleep. Of course when I woke up, I found out the other groups did hold the lecture after all and I missed it.\n\nOf course, all exams will be held physically, so can't wait for that. No one will care that a lot of the lectures were not held at all, or that the professor had to teach the 1.5 hour lecture in 40 minutes because the online classes system was down for the first half of the lecture.\n\nAlso, this is my freshman year so I haven't been able to socialize at all, I have no idea who anyone in my 180 student class is, just random names and default profile pictures.\n\nTL;DR: Registered to a college because administration told me all classes would be held face-to-face, but I'm being forced to take online classes only except for one face-to-face lecture a week. Not learning anything during these lectures since there's connectivity issues with the professors most of the time. To make matters worse, the exams will be held face-to-face as if the lectures were also so.",
  "author": "_negativeonetwelfth",
  "created": 1635640298,
  "updated": 1635780134,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "hiq276d": {
      "link": "/r/CollegeRant/comments/qje9vr/tired_of_online_classes_with_inperson_midterms/hiq276d/",
      "text": "Having online lecture and face to face exams is a scam. Make it all in person or all online.",
      "author": "ttyltyler",
      "created": 1635650165,
      "upvotes": 3,
      "replies": {}
    }
  }
}