{"sid": "piwp94", "link": "/r/CollegeRant/comments/piwp94/im_burning_out_with_this_online_shit/", "title:": "I'm burning out with this online shit", "text": "I hate remote studying. This is the worst thing they could ever do with students. Now I have low-effort lectures, shitty tests and assignments which are made only to show that we are learning something. Nobody actually cares about teaching students. I'm a sophomore and my dream of becoming an expert in programming is falling apart. I lost my faith in modern education system and now I'm looking for ways to self-educate while seeking for a part-time job to practice my skills. What should I do with my classes? I don't want to spend time for this senseless bullshit, I want a real practice, however I still need to keep my grades upper than C/C+", "author": "Be2matt", "created": 1630923451, "retrieved": 1632948875, "over_18": false, "upvotes": 3, "upvote_ratio": 0.67, "comments": {"hbsn94l": {"link": "/r/CollegeRant/comments/piwp94/im_burning_out_with_this_online_shit/hbsn94l/", "text": "I know how that feel, hope you'll be okay and find your path🙏\n\nHere's the pro hint: use an academic tutoring services like [this service](https://speedypaper.net/?rt=XVi17BvT) that I used last semester.", "author": "Danikello", "created": 1630925879, "upvotes": -1}, "hbsmhhu": {"link": "/r/CollegeRant/comments/piwp94/im_burning_out_with_this_online_shit/hbsmhhu/", "text": "It's sad that educational system makes you suffer from it. However I agree with your opinion and I believe you will succeed in becoming a pro and finding a job! If you look for a fast&reliable way to manage your current tasks in college with minimum effort you should check this post: https://www.reddit.com/r/WritingEssaySucks/comments/pfttrn/my\\_writepaperforme\\_review/", "author": "Chris_J_Powell", "created": 1630925238, "upvotes": -1}, "hbsl3ku": {"link": "/r/CollegeRant/comments/piwp94/im_burning_out_with_this_online_shit/hbsl3ku/", "text": "I'll agree with you. The online stuff seemed low effort. It was even more of a if you miss it well you're screwed situation. If your major is in person well then prepare to learn slower.  \n\n\nAnd rn my college is open, but instead of people staying behind in the college. Everyone rushes out, more than normal. I understand people have a life but it feels so much like a ghost town now that, the fun of communicating with classmates and messing with projects are just non-existent. \n\nThe work environment I loved to see has become a shell of itself , which sucks cause it's what I missed so much.", "author": "Important_Ad_2538", "created": 1630924050, "upvotes": 2}}}