{
  "sid": "kvfpci",
  "link": "/r/CollegeRant/comments/kvfpci/when_you_email_a_professor_asking_if_you_can_sit/",
  "title:": "When you email a professor asking if you can sit in on their waitlisted class so you don't fall behind if you get in, and they just let you into the class 👌👌👌👌",
  "text": "Man you gotta love proffesors that are just nice because they can be. I'm gonna feel real bad when I scrape by with a D. Fuck Stats, but 💕 this proffesor.",
  "author": "PeterCanTrans",
  "created": 1610409896,
  "over_18": false,
  "upvotes": 38,
  "upvote_ratio": 0.94,
  "comments": {
    "gizte54": {
      "link": "/r/CollegeRant/comments/kvfpci/when_you_email_a_professor_asking_if_you_can_sit/gizte54/",
      "text": "It's probably because inevitably, someone will drop out within the first week or two.\n\nGL with stats. I gotta take that next semester.",
      "author": "SweetTeaBags",
      "created": 1610455605,
      "upvotes": 3,
      "replies": {
        "gj004yx": {
          "link": "/r/CollegeRant/comments/kvfpci/when_you_email_a_professor_asking_if_you_can_sit/gj004yx/",
          "text": "Exactly this. I let in any overflow students who ask because even with a cap of 24 students, there will always be a few who drop. Half-empty classrooms are no fun.",
          "author": "kgaske",
          "created": 1610460075,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "giy61tg": {
      "link": "/r/CollegeRant/comments/kvfpci/when_you_email_a_professor_asking_if_you_can_sit/giy61tg/",
      "text": "Just out of curiosity, how does your class registration work? At my university everyone’s courses are laid out for them in the beginning and you are automatically signed up for every class you need at the beginning of the semester. Granted, you might get an unfavorable class period (fuck 7am classes...), but at least you’re guaranteed a spot",
      "author": "PasswordLogger",
      "created": 1610413221,
      "upvotes": 3,
      "replies": {
        "giy6bn8": {
          "link": "/r/CollegeRant/comments/kvfpci/when_you_email_a_professor_asking_if_you_can_sit/giy6bn8/",
          "text": "Oh damn nothing like that. You have to pick your classes and register each semester. You pretty much choose your own schedule. If I wanted to I could choose 12 elective credits I don't need or 18 400 level classes. It's a free for all.",
          "author": "PeterCanTrans",
          "created": 1610413360,
          "upvotes": 7,
          "replies": {}
        },
        "gj09wv9": {
          "link": "/r/CollegeRant/comments/kvfpci/when_you_email_a_professor_asking_if_you_can_sit/gj09wv9/",
          "text": "Whoa wtf it’s all automated? So you don’t pick what you take at all, including sequence of courses? Or can you, they just have the system set up like this? Also 7am classes... who tf",
          "author": "oyoung101",
          "created": 1610465249,
          "upvotes": 2,
          "replies": {
            "gj0hsb9": {
              "link": "/r/CollegeRant/comments/kvfpci/when_you_email_a_professor_asking_if_you_can_sit/gj0hsb9/",
              "text": "Everything is predetermined, but if you want to take a different class all you have to do is just email your student service counselor. On top of that, we can change our class schedule around (times and days of classes) so long as there is room in the other classes. For me, personally, I just follow the classes that are given to me and then alter the days and times that I take the classes to suit my wants",
              "author": "PasswordLogger",
              "created": 1610469193,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634062664
}