{
  "sid": "alf01v",
  "link": "/r/collegeadvice/comments/alf01v/what_is_it_like_taking_two_language_classes_at/",
  "title:": "What is it like taking two language classes at once?",
  "text": "I am enrolled in both Spanish and French at my community college. Will this be too hard? I know quite a bit of Spanish from high school and I have been teaching myself French through Duolingo, so I know some basics. They’re very similar languages, so won’t that make it easier on me to take both at the same time? I know it’s not just going to be only about the language. It will also be literature and grammar. Thing is, I love to write and I’m getting into reading so I don’t think that will be a problem for me.\n\nHave you ever taken two different language classes at once? What is it like in your experience? What can I expect? Should I just take one or should I attempt the two",
  "author": "MO-life-MO-problems",
  "created": 1548869038,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "efdv2u0": {
      "link": "/r/collegeadvice/comments/alf01v/what_is_it_like_taking_two_language_classes_at/efdv2u0/",
      "text": "It’s completely possible, just stay consistent with your studying of both and find ways to connect vocabulary in your mind for better retention and collection but keep it separate enough that you don’t get confused, especially with languages that have similar root words or grammar structures. I’m pretty much doing 3 at a time these days, all at varying levels of proficiency and challenge, while still trying to maintain a competent level of scholarly English. Not easy but not impossible. \n\nBe prepared to feel stupid a lot though! It happens. ",
      "author": "khaleesi_onthatbeat",
      "created": 1548878303,
      "upvotes": 2,
      "replies": {
        "efdw8ep": {
          "link": "/r/collegeadvice/comments/alf01v/what_is_it_like_taking_two_language_classes_at/efdw8ep/",
          "text": "Thank you!",
          "author": "MO-life-MO-problems",
          "created": 1548879039,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634057873
}