{
  "sid": "cskzy9",
  "link": "/r/collegeadvice/comments/cskzy9/i_miss_my_parents/",
  "title:": "I Miss My Parents",
  "text": "Im an 18 year old male that just moved into the dorms for my freshman year of college. I guess I never really thought that I would miss home so much but now that I’m here its hitting me too hard. I just absolutely miss my mom and dad so much its not even funny. I just cried myself to sleep last night just because it feels like so much pressure on me. Luckily I live like 30 minutes away from home so it’s not too horrible. Any advice to help cope or resolve this issue?",
  "author": "AnonRedit",
  "created": 1566238611,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "exhj86h": {
      "link": "/r/collegeadvice/comments/cskzy9/i_miss_my_parents/exhj86h/",
      "text": "I didn't move out from my parents to go to college but I know what it can feel like moving away. I got disowned by my parents shortly after I started college or University (I'm from NZ) and I stayed at my cousin's place. I  missed my own home allot and my lovely room. It got to a point where I would spend my entire day at uni just watching videos and studying and what not. The only time I'd go home was to sleep, I ate allot of noodles xD. For me starting Uni was a huge shake up in my life and I'm now in my third year of uni. My parents and I are back on talking terms now but it took a while. My advice would be taken one day at a time and have a good layout of what you need to do and when cause let's be honest, most people make a time table and stick with it for only a few weeks. Keep in contact with your folks but think about how better your future will be in a few years. It's a struggle now but soon you'll have friends (try to find good ones) and life at uni (I mean college) will start to fly by. \nIf you feel pressured it might be your motivation, I've been down that path of having the wrong or no motivation. My advice for the pressure would be just asking yourself why you're studying your subject, what makes it fun for you, or just imagine your self in ten years doing what you studied. If you not studying what you what to become then that's another discussion.\n\nHang in there friend ♥️",
      "author": "SirAlphaa",
      "created": 1566306572,
      "upvotes": 1,
      "replies": {}
    },
    "exgcez4": {
      "link": "/r/collegeadvice/comments/cskzy9/i_miss_my_parents/exgcez4/",
      "text": "It’s okay to feel like that. Growing up and become an adult is scary sometimes.  I’m sure your parents are proud that you are attending school and working towards a career. Take this to make them proud, when the time comes for you to graduate I’m sure that moment will mean so much to your parents.  You can also hang out with them on the weekends and catch up with them. Always remember why you started college and let that be your drive. \n\nYou got this!!  😎",
      "author": "Sa_m01",
      "created": 1566260490,
      "upvotes": 2,
      "replies": {
        "exh3zis": {
          "link": "/r/collegeadvice/comments/cskzy9/i_miss_my_parents/exh3zis/",
          "text": "Thanks so much thats really helps",
          "author": "AnonRedit",
          "created": 1566290034,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059068
}