{
  "sid": "dng5wh",
  "link": "/r/collegeadvice/comments/dng5wh/writing_an_essay/",
  "title:": "Writing an essay",
  "text": "I have to write a 2 page single spaced essay on my opinion of a webpage and critique its contents. I dont really have an opinion. I think  it's an okay webpage. I have no idea how to stretch this out into 2 pages. Does anyone have any suggestions?",
  "author": "funkychickendiggle",
  "created": 1572107553,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "f5ict34": {
      "link": "/r/collegeadvice/comments/dng5wh/writing_an_essay/f5ict34/",
      "text": "Person before gave *great* advice for this. Depending on what the page is about - you could also look for any bias in the writing and how the topics are addressed. Are any common stereotypes or stigmas sustained (or challenged) by the wording or language used?",
      "author": "eleniray",
      "created": 1572213226,
      "upvotes": 1,
      "replies": {}
    },
    "f5ddtu4": {
      "link": "/r/collegeadvice/comments/dng5wh/writing_an_essay/f5ddtu4/",
      "text": "Here are some questions to think about:\n\nThink about who the webpage is for, and whether the webpage is informative and easy to use for that person. If you think it is or isn't, write about why. Look at the web design too, and how the content is presented. Are there distracting colors that make the text hard to read? Or is color used appropriately to highlight important info? Are there a lot of ads, or none? Is the font weird and hard to read, or is it good? Is the type size too big, too small, or good?\n\nCan someone easily find what they need to know on the webpage? Does it include bullet points, sections with headers, and different sizes of font to help \"chunk\" the information? Are there hyperlinks throughout the text to learn more information? Are images included, and do they distract or support what is written in the text?\n\nWould the webpage be difficult to read for someone who has a disability, and what could be changed about the webpage to make it more accessible? (Google website usability for more info on this)\n\nAlso think about the language and how it is written. Would the audience have trouble understanding what is written? Could someone reading the webpage easily summarize its main points and understand what it is saying? Is the information repetitive? Too short or too long?\n\nHope this helps!",
      "author": "writingoreos",
      "created": 1572152267,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634058409
}