{
  "sid": "dl591i",
  "link": "/r/collegeadvice/comments/dl591i/i_dont_know_where_to_go_for_astrophysics/",
  "title:": "I don’t know where to go for astrophysics",
  "text": "I currently live in California and have a 4.18 weighted gpa, a 3.74 unweighted gpa, and a 1320 on the sat with a 670 on math, and 650 on English.  And I’m a senior in high school.\n\nI am currently looking at (in order of preference)  UC Santa Cruz, University of Colorado Boulder, UC Davis, and Uc Santa Barbara. Which one do you think I should go to?\n\nEdit: Added that I’m a senior.",
  "author": "DeathDude84821",
  "created": 1571684823,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "f4qwjq1": {
      "link": "/r/collegeadvice/comments/dl591i/i_dont_know_where_to_go_for_astrophysics/f4qwjq1/",
      "text": "Research each school's program for astrophysics; which one has the best facilities, best staff, connections/events for the major? \n\n  \nTHEN look at the location! This part is huge, truly. Would you want to live in Santa Cruz? Colorado? Davis? Santa Barabara? Have you visited these campus/could you see yourself thriving in that place? Four (or more) years is a hot second! It's important you feel comfortable and happy where you are - this affects your mental health, and inevitably your ability to be successful in your academics.\n\nI'm also in California - lived in Santa Cruz for community college and spent a lot of time there as a kid, and I also had a boyfriend who was at UCSB so I spent plenty of time there as well. If you want to know anything about the environment of those two places (*ridiculously different*), I'm happy to share!",
      "author": "eleniray",
      "created": 1571759222,
      "upvotes": 2,
      "replies": {}
    },
    "f4nsq3e": {
      "link": "/r/collegeadvice/comments/dl591i/i_dont_know_where_to_go_for_astrophysics/f4nsq3e/",
      "text": "I am wondering the same thing.",
      "author": "whyismycatasian",
      "created": 1571692747,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634058464
}