{
  "sid": "deo5x8",
  "link": "/r/collegeadvice/comments/deo5x8/dropping_out_biology_bachelors_for_associates/",
  "title:": "Dropping out biology bachelors for associates degree? Are associates degrees even useful? Other options?",
  "text": " \n\nI'm currently a sophomore (third semester here) and I'm stressed of everything. I'm doing biology bachelors with ecology concentrations (which I hear from most other people is pretty much a useless degree, so I've been considering dropping out despite my love for nature and wildlife).\n\nHere's the deal: I most likely see myself dropping out or doing something else later down the line because I simply can't see myself doing another 3-4 years of this. At the same time, I don't want to live in an apartment within a trashy ghetto. I'm not asking for a huge salary, all I want is a small house of my own within a decent, non-trashy neighborhood (I want to move out of my current state, somewhere nice and quiet, away from any big cities), with a job I atleast semi-enjoy (tolerate). I'll probably live alone but my brother and I may end up being roommates if we actually agree on a place/find jobs close to eachother.\n\nQuestion is, what am I supposed to do? I wouldn't mind finding an associates degree or trade for something I'm interested in as long as it won't just be another useless degree. Are associates degrees even worth anything? I see some people say they're about as useful as a liberal arts degree and others say it's the best decision they've ever made, making great salaries. Or should I just drop out and hope to god I can find a decent paying job with no degree?\n\n**TLDR;** Fed up with college (doing biology bachelors currently). Is it worth dropping this to pursue an associates degree? If so, which degrees are both interesting/enjoyable and make enough money to move out and buy a house of my own (nothing fancy or big, I just want one in a good neighborhood at least)? Any other options?",
  "author": "mothking",
  "created": 1570475651,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "f2yjo7x": {
      "link": "/r/collegeadvice/comments/deo5x8/dropping_out_biology_bachelors_for_associates/f2yjo7x/",
      "text": "So, I graduated with a bachelor's in engineering in May. I'm currently working as a technician, which is at the associates/ equivalent trade school or experience level and does not require a bachelors degree. I honestly love it. I make about the same amount as the average starting salary for some of the lower paying engineering positions, without the extra hours and stress that come with the engineering job. I still intend to transition into an engineering position here or elsewhere in the near future, but I would be completely happy in this position as my career. \n\nThere are plenty of openings for associates level education as there are for trade workers. It really depends on what you're interested in for what to go into though because that's not one size fits all. I'm doing electrical work/ testing currently. It will also most likely be more of a physical job than if you had your bachelors, so keep that in mind. Try looking at job postings on indeed/ glassdoor and see what the requirements are education/ experience wise for things you're interested in and have acceptable pay for you. \n\nI have no idea what your debt situation is like, but you also may want to consider transitioning into a program that will transfer most of the courses you've already taken into some sort of credit. Even if it's a different field, there will likely be some programs that will accept a lot of it as electives, if nothing else. Also look into lower level positions at companies you'd like to work for. It's a foot in the door and some of them might pay for you to go to school part time while you're working there. That varies widely by the field you want to go into and the company, however. But plenty have some sort of scholarship program for employees now.",
      "author": "odactylus",
      "created": 1570492615,
      "upvotes": 2,
      "replies": {
        "f30jdc2": {
          "link": "/r/collegeadvice/comments/deo5x8/dropping_out_biology_bachelors_for_associates/f30jdc2/",
          "text": "thanks for feedback. im not worried about debt, its being completely paid and then some by scholarships/programs. i am worried about transferring credits though, i hate class, college, school in general, so i want to get done with it quickly. it stresses me. i know people will say \"well a job isnt any less stressful!\" but for me, its not true at all. a job is so much more enjoyable and less stressful to me than schooling.\n\ndo you have any recommendations for any associates or trades that would interest someone who likes being outdoors? doesnt necessarily have to be something crazy nature related like park ranger or wildlife field technician - as nice as that sounds, im still a realist lol. preferably something that doesnt require all too much critical/mathematical thinking. (im starting to think simply using my brain too much stresses me lol)\n\nbut thanks for the info, ill be looking into associates majors i may be interested in. im sorta considering military too, i feel like im at a dead end in my life.",
          "author": "mothking",
          "created": 1570555671,
          "upvotes": 1,
          "replies": {
            "f30xygl": {
              "link": "/r/collegeadvice/comments/deo5x8/dropping_out_biology_bachelors_for_associates/f30xygl/",
              "text": "First off all, fuck anyone who says a job isn't less stressful. It completely can be. Even working 50-60 hours a week, my job takes up less of my life than school did, *and* I don't have to worry about where the money for rent and food is coming from. I can actually leave work at the door and not bring home hours of projects and homework with me after spending a full day on campus. Work can be stressful- there's going to be office politics anywhere, your workplace will be understaffed eventually, there will be times you don't know how to do a task, etc, etc, etc, but you get to pick your stress with work to a greater extent than with school. The second you walk into a building on an interview you should be watching just as much how people are interacting and their mannerism to get a glimpse of what an average day is like as you are focusing on the interview to see if it's somewhere you belong. Just like the wrong professor can turn you away from a subject you enjoy, the wrong supervisor and coworkers can turn you away from a job you enjoy.\n\nRant aside, most of what I know is probably going to be a little too far on the mathy side, just because I love that stuff lol. Civil technicians and geological techs spend a fair amount of time outdoors. Working in renewable energy or sustainability for construction management might be something else to look into, although many of those positions require a bachelors or experience that's hard to get because everyone wants experience. Environmental engineering techs are also a thing, but the associates for that is probably harder to find because it's a bit more specialized than civil. NOAA Corps is something that really interested me when I was in school because I wasn't quite ready to commit to a desk job for the rest of my life, though they do require a bachelor's degree. Most scientific backgrounds work, so biology or oceanography or something similar would work if you decided to stick it out. A lot of the more outdoorsy environmental work is region specific and done through local/ state government, so see if they have a career page online if you want to stay in the area. \n\nAlso, if you do decide to stay in school, try to remember that it's fine for it to be a means to an end for you. Imo, school shouldn't be the best time of your life. You have somewhere around 50 working years of your life, and the schooling of your choice (excluding high school and below because that's kinda forced) is a fifth of that at most. You should absolutely make the most of those college years because that is years of your life you can't get back, but it's fine to look at them as a way to get to the career you want.",
              "author": "odactylus",
              "created": 1570564428,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634058598
}