{
  "sid": "fib2sa",
  "link": "/r/collegeadvice/comments/fib2sa/am_i_royally_fucked/",
  "title:": "Am I royally fucked?",
  "text": "I haven't taken the SAT and the March one has been cancelled. (And no new information about rescheduling or refunding) Am I not going to college because I felt like I wasn't ready for the SAT earlier in the school year and the Corona virus cancelling every thing? Or am I paranoid???",
  "author": "SoniXLvR",
  "created": 1584150852,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "fkhtuor": {
      "link": "/r/collegeadvice/comments/fib2sa/am_i_royally_fucked/fkhtuor/",
      "text": "I am assuming you were applying to schools with rolling admissions or for the spring semester. In any case. I work as a college advisor and in the state of the current situation I would not be surprised if deadlines are extended to accommodate all students . Colleges understand what’s going on and I’m sure will be accommodating for students that were affected. So don’t worry too much right now, it will be okay",
      "author": "medicalentusiast",
      "created": 1584205866,
      "upvotes": 1,
      "replies": {
        "fki2lmr": {
          "link": "/r/collegeadvice/comments/fib2sa/am_i_royally_fucked/fki2lmr/",
          "text": "I'm more worried about collegeboard and the SAT. I don't want to pay to reschedule for a cancellation THEY/MY SCHOOL DID. I'm not seeing any new information and the website doesn't even have my location on the list of cancellations.",
          "author": "SoniXLvR",
          "created": 1584210701,
          "upvotes": 1,
          "replies": {
            "fki382v": {
              "link": "/r/collegeadvice/comments/fib2sa/am_i_royally_fucked/fki382v/",
              "text": "Call college board immediate here’s there US number 866-756-7346 and present your situation. I really doubt that they will make you pay for it since it’s your school that did so. Remember that things are constantly changing and they might not be able to update as fast as info comes out. I doubt you’ll have to pay but you definitely need to contact them ASAP (they are only open Monday-Friday so make sure to call Monday morning.",
              "author": "medicalentusiast",
              "created": 1584211084,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fkh8ydy": {
      "link": "/r/collegeadvice/comments/fib2sa/am_i_royally_fucked/fkh8ydy/",
      "text": "Where are you? As far as I know colleges have due dates you need to apply on. Most of them already passed so if you are a senior you just did too little too late. I'm not sure how rolling due dates work but I'm pretty sure they due by Aprill.",
      "author": "krutand",
      "created": 1584192487,
      "upvotes": 1,
      "replies": {
        "fkhc539": {
          "link": "/r/collegeadvice/comments/fib2sa/am_i_royally_fucked/fkhc539/",
          "text": "The college's I want to go to have their dates due in June.",
          "author": "SoniXLvR",
          "created": 1584195081,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fkghf33": {
      "link": "/r/collegeadvice/comments/fib2sa/am_i_royally_fucked/fkghf33/",
      "text": "Are you a senior or junior?",
      "author": "medicalentusiast",
      "created": 1584159827,
      "upvotes": 1,
      "replies": {
        "fkhc5j4": {
          "link": "/r/collegeadvice/comments/fib2sa/am_i_royally_fucked/fkhc5j4/",
          "text": "Senior",
          "author": "SoniXLvR",
          "created": 1584195090,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634058541
}