{
  "sid": "cbowzw",
  "link": "/r/collegeadvice/comments/cbowzw/fourth_year_student_debating_a_second_major_change/",
  "title:": "Fourth year student debating a second major change",
  "text": "Sorry for the long post, been fighting with this a lot\n\nI’m 20 years old coming up on my senior year and still have very little idea what i want to do with my life. I started school as a finance major but quickly lost interest and switched to entertainment management in hopes of working in the music industry as an agent or manager. (I love music) I did very well in my new classes and landed my first internship at a music venue, but I’m starting to second guess my choices after learning about the kind of money that people in this field make and the cutthroat nature of the music industry. I the money wasn’t a lot going into it but that there’s a high ceiling and a lot of room to get promoted and move up. The main problem is that even the top percentage of music industry workers still don’t make more than like 45K-55K. Money isn’t the most important thing to me, hence why i left the business school, but I don’t want to be making the same as a public school teacher, especially since i will be working a lot more than one.\n\nI had an idea recently of picking up a second major in psychology in hopes of becoming a therapist, because I’m interested in the field, I love helping people, and I think mental health is a very important issue. It also doesn’t hurt that psychologists make pretty decent money. My mom is a doctor, and loved talking to patients and working to give back to her community, and I love the idea of that. I’ve done well in school so far and I feel like I’ve gotten very good at studying. It would be a more challenging path, but I feel confident that I would pass the classes and be a solid contender for graduate school. Plus I could still finish my current major. \n\nThe main problem is that these two fields have very little to do with each other and I would essentially be getting this degree as a safety net if the music thing doesn’t work out. I’m not sure if I would like psychology and I would definitely have to choose one or the other down the road. I’m extremely indecisive and the biggest struggle of my whole life has always been picking a career. (That sounds really pretentious but I’m just being honest) If I picked up psych I would be in school for another 2ish years probably and I already feel like a financial leech on my parents and I know staying in undergrad for that long would make it worse, probably why I’m so worried about money. My SO thinks that I should just graduate with the music degree and that it’s too late for me to embark on such a large endeavor. She also says that I give bad advice and would end up as a high school consoler. (Not that there’s anything wrong with that, I would just try to do private practice) Those are both valid points and I wish she would be on board with it, but I appreciate her being honest. I’m really torn right now and I haven’t stopped thinking about it for like a week. I know that undergrad degrees don’t determine what you do in life, but I feel like my current one is very niche and could be restricting. Plus, if I decide that I want to be a therapist later in life I would need to go back to undergrad and get a bachelors, which would suck. \n\nIf anyone is still reading this, please tell me what you think. I’m going to gather more information on my own, but some honest advice from strangers would really be appreciated.",
  "author": "GamecockJohnny",
  "created": 1562805419,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {},
  "updated": 1634059034
}