{
  "sid": "c5afkw",
  "link": "/r/collegeadvice/comments/c5afkw/what_are_your_thoughts_on_uopeople/",
  "title:": "What are your thoughts on UoPeople?",
  "text": "Would you consider UoPeople and would you respect a UoPeople graduate’s application to work with you if you had a company? \nThankyou.",
  "author": "EnigmaAlchemist",
  "created": 1561477402,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "f5ze7em": {
      "link": "/r/collegeadvice/comments/c5afkw/what_are_your_thoughts_on_uopeople/f5ze7em/",
      "text": "University of the People is an accredited online higher learning institution. It's accredited by DEAC, which is fully recognized as valid by the US Department of Education. It's also approved of by California's Bureau for Private Postsecondary Education (whose explicit purpose is \"proactively combatting unlicensed activity \"), so according to the state of California, it's licensed, valid, certified higher education. [https://search-bppe.dca.ca.gov/institutionDetail?schoolCode=93197836](https://search-bppe.dca.ca.gov/institutionDetail?schoolCode=93197836).\n\nApart from intangible and subjective reputation, that's as good as it gets for a higher educational institution accreditation in the United States, because the DoE itself makes no distinction between national and regional accreditation. An institution is either recognized or not recognized by the DoE, and UoPeople is recognized as accredited by the DoE. [https://ope.ed.gov/dapip/#/institution-profile/233675](https://ope.ed.gov/dapip/#/institution-profile/233675).\n\nFurthermore, UoPeople's national accreditor, the Distance Education Accrediting Commission (DEAC), is the sole accreditor of many reputable institutions besides University of the People. [https://www.deac.org/Student-Center/Directory-Of-Accredited-Institutions.aspx](https://www.deac.org/Student-Center/Directory-Of-Accredited-Institutions.aspx).\n\nMany DEAC accredited schools offer conventional degrees, like UoPeople, but some train students for specialized professions like court reporting.  Such specialized training requires student to have a specific, tangible skill that they can use effectively when they graduate, and that attests to DEAC's quality, in my opinion.\n\nDEAC has its own DoE approved, standardized criteria for vetting institutions, and UoPeople passed muster, just like the other DEAC schools. [https://www.deac.org/Seeking-Accreditation/Eligibility-Requirements.aspx](https://www.deac.org/Seeking-Accreditation/Eligibility-Requirements.aspx).\n\nUniversity of the People is an early disruptor in the education field and so making a lot of people with economic motives go frothing berserk and write hit pieces. I wouldn't take those people too seriously, especially when they slander it with absolute nonsense like calling it a \"diploma mill.\" UoPeople has been vetted and approved by two recognized organizations whose sole purpose is to reject \"diploma mills.\" It is *not* a diploma mill.\n\nUoPeople degrees take constant weekly participation, use curricula reviewed by experts, have classes on standard topics, and take years of actual proctored, tested work to achieve. A \"diploma mill\", on the other hand, sends you a piece of paper immediately for absolutely no effort. If you're going to criticize the school, please don't spout spurious nonsense.",
      "author": "CaptainLemonlime",
      "created": 1572574564,
      "upvotes": 1,
      "replies": {}
    },
    "es0ktzy": {
      "link": "/r/collegeadvice/comments/c5afkw/what_are_your_thoughts_on_uopeople/es0ktzy/",
      "text": "No- anyone who approached a job application with a degree by a degree mill does not deserve respect and certainly does not deserve hiring whatsoever. \n\n\n UoPeople isn’t a respected school. It’s a middle eastern diploma mill headquartered in Ramallah in the West Bank and run by a man who was disgraced when involved with the Israeli education system. The “address” in the United States which it uses is a P.O. Box and not a building or whatever. It’s banned from operating in three American states (Oklahoma, Alabama and Pennsylvania). It’s also considered fraudulent in South Africa, the United Kingdom and Germany. Indeed a UoPeople ‘student’ putting such a degree on their cv in Germany can get prosecuted for committing application fraud in saying they have a degree which they don’t (using a diploma mill on cvs in a serious crime in Germany). This laughable diploma mill is only recognized by the DEAC, a shady accrediting agency who generally accredit for profit religious schools and trade schools who are too useless to get regional accreditation- UoPeople was rejected by the higher learning commission when it tried to get regional accreditation. Given that HLC did agree to accredit Grand Canyon University, Phoenix and DeVry, that should show you how terrible Uopeople is that their only attempt at regional accreditation was HLC and they got turned down. I wrote an evidence based review attacking Uopeople in 2017 and rather than prove any points I’ve raised wrong, they actually tried to locate my isp address and discover my identity, without making any attempt at proving me wrong. UoPeople’s marketing is pathetic and relies on hasbara, where Uopeople employees spam discussion threads ranting about how it’s the best university in the world and has top academics; if its the best university in the world, why are it’s degrees not recognized by other American universities, professional licensing bodies in America, and outright illegal by decree of the KMK in Germany who are their education ministers? In education obsessed Germany putting a degree by the ‘greatest university in the world’ on your applications would not be a crime, so guessing UoPeople’s student ambassador spam is exaggeration or a downright lie. Uopeople also claim to be partnered with the United Nations and use its logo all over their Israeli registered and Israeli hosted webpage- the United Nations itself says it does not partner with anyone and we should beware scams implying association with the United Nations as they are not genuine. In sum, UoPeople’s a scam which preys on vulnerable and desperate people in the developing world who do not deserve to be abused by a scam artist like the diploma mill’s owner, and also preys on thick and lazy people in the west who don’t want to have to join real universities where they have to work and get a student loan. Those people- it’s “students” in the West who have real universities on their actual doorstep though choose to get an easy degree with UoPeople diploma mill scam do deserve to be scammed. I’ve got great sympathy with the people it scams in less developed countries who don’t know any better though none with its western victims who are just lazy.",
      "author": "RealAlcibiad3s",
      "created": 1561477566,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634057974
}