{
  "sid": "apoxdd",
  "link": "/r/collegeadvice/comments/apoxdd/24_need_to_finish_undergrad_where_do_i_start/",
  "title:": "24 & Need to Finish Undergrad, Where Do I Start?",
  "text": "Long story short: I was a full time student for three years at two different schools for two different fields, neither of which are a great fit for me (English/Drama Secondary ed, Theatre Lighting design). I left school when I had an opportunity for a full time job, which was necessary financially. Three years later I've maxed out; I'm as high as I can go without a degree in a career I didn't want in the first place (Ironically I run an after school program). \n\nIt's time for me to go back to school, but I don't know where to start. I need to finish my undergrad, but theres no guidance counselor in the grownup world. Here are the qualifiers I've narrowed down so far.\n\n* If I go to school full time, I need to be able to work full time as well.\n* I'm can't afford to move for school, but I'm in the Boston area so there's plenty nearby.\n* If possible, I'd like to pay out of pocket rather than take out any more student loans.\n* I don't really care what my undergrad is in. I'm not adverse to grad school if I need it. \n\nSo, Strangers of Reddit, Where do I go from here?",
  "author": "Captain_Neptune",
  "created": 1549942822,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "egakr9z": {
      "link": "/r/collegeadvice/comments/apoxdd/24_need_to_finish_undergrad_where_do_i_start/egakr9z/",
      "text": "You are in my exact situation i was 6 years ago. I even came from a similar college background, and I lived in Boston for some time as well after that. \n\nI got a job opportunity with my country abroad, turned out to be shit. Decided to stay, learn the language, apply to school here where its much cheaper than the USA and while extremely difficult POSSIBLE to pay ones way through school and work. Sacrificed social life and mental health a bit...wasn’t exactly the best choice but here I am, about to be 29 and in my last semester *finally* and i’m glad to have survived this far on my own despite everything. Maybe i could have turned out differently if i took a safer, less outrageous path but I guess thats not what God’s plan was for me lol \n\nI don’t recommend following my choice of course, but maybe you could see if your job has opportunities in other states or even countries, and just go from there? I understand how financial stability is the first and most important factor. Look at schools, think about a degree program you’d be passionate about or feel you fit in, look for schools with online classes or part-time enrollment, ones with financial aid or support programs for returning “adult” students. You do have options and its overwhelming at first but once you get that spark, that idea of what you think you wanna do follow through with it and make a rough plan. ",
      "author": "khaleesi_onthatbeat",
      "created": 1549958300,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634057923
}