{
  "sid": "fs04ga",
  "link": "/r/collegeadvice/comments/fs04ga/nyu_stern_vs_canadian_schools_for_future_mba/",
  "title:": "NYU Stern vs. Canadian Schools for future MBA",
  "text": "I recently received all of my college decisions and was hoping for some input.\n\nI was admitted to the following programs:\n\n\\-NYU Stern Undergrad\n\n\\-Rotman Commerce (U of T)\n\n\\-Desautels Faculty of Management (McGill)\n\n\\-D'Amore-McKim School of Business (Northeastern)\n\nIn my opinion, Stern is easily the most prestigious school I was admitted to. Unfortunately, it comes with a $72k price tag, and with only $15k in financial aid, I'd be looking to pay around \\~$57k annually to attend. \n\nI am a dual citizen, and I could, therefore, attend either U of T or McGill for about \\~$12k CAD annually. \n\nThe Canadian schools are clearly the cheaper option, but I was curious if anyone had any insight as to whether these choices would limit my options for MBA programs. I am especially interested in investment banking, and I know a prestigious MBA placement could help immensely with a high ranking job placement.\n\nIf anyone has any insight whatsoever it would be greatly appreciated.",
  "author": "Jassq",
  "created": 1585605192,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "fm2yx9b": {
      "link": "/r/collegeadvice/comments/fs04ga/nyu_stern_vs_canadian_schools_for_future_mba/fm2yx9b/",
      "text": "NYU Stern is the best for finance and investment banking and is one of the top feeder schools for many Wall Street investment banks.",
      "author": "Yeeet410",
      "created": 1585708717,
      "upvotes": 1,
      "replies": {}
    },
    "flzliqg": {
      "link": "/r/collegeadvice/comments/fs04ga/nyu_stern_vs_canadian_schools_for_future_mba/flzliqg/",
      "text": "NYU Stern the best out of all ur options. You’ll literally get fed on to Wall Street making like $200k+ straight out of college.",
      "author": null,
      "created": 1585626631,
      "upvotes": 1,
      "replies": {}
    },
    "flyrlv4": {
      "link": "/r/collegeadvice/comments/fs04ga/nyu_stern_vs_canadian_schools_for_future_mba/flyrlv4/",
      "text": "McGill is a great school, my brother went there and loved it and is now working in the US working with a large research and pharmaceutical company. So for what it’s worth I’d go with McGill. Cheaper price and a great education.",
      "author": "pkerrrr",
      "created": 1585607719,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634057819
}