{
  "sid": "g1uvzi",
  "link": "/r/collegeadvice/comments/g1uvzi/is_premed_honors_and_a_div_ii_sport_manageable/",
  "title:": "Is Pre-Med, Honors, and a Div. II sport manageable?",
  "text": "I'm a high school senior, and I go to a small school. Because of this, I play four sports, and I've also managed to have a A's all of my high school career to be Co-Valedictorian. I'm going to a Division II college that's around 3,000 students, so it's also pretty small. I know things will obviously be different in college, but I'm considering playing soccer for that college. The kicker is that I'm going to school to major in biology with an emphasis in Pre-Med, and am attending the honors college there as well. Is it too much to add in a sport, even if it is Division II? I know I balanced it all pretty well in high school, but college can be very different.",
  "author": "Dramatic_Storage",
  "created": 1586966831,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "fniomz4": {
      "link": "/r/collegeadvice/comments/g1uvzi/is_premed_honors_and_a_div_ii_sport_manageable/fniomz4/",
      "text": "I think what you’re  doing is amazing, so good for you!  For your first semester/year, you will maybe feel overwhelmed because I did, but everyone is different. I didn’t realize how big of a transition it would be from going to high school to college, but it’s a lot thrown at you at once and it might be hard socially because you’d be making new friends. In high school I did lots of APs, did lacrosse, worked 16 hours a week, and took after school classes such as medical terminology, medical hospital careers, EMR, and EMT from when I was a sophomore. I was always busy. \n\nI am a biochemistry Major rn at a school with 33,000 students, so that dynamic is different. I play D2 lacrosse, work, intern at a hospital, and take 16 units AND COMMUTE 1-2 hours a day. And this took a lot of getting used to because I just love to overload my self with activities. But I think you will be fine. If you are playing for the school, just be mindful that soccer is probably going to be incorporated throughout your whole day. I know athletes who wake up at 5 am for practice and finish, get ready and go to classes, finish classes then go to practice again, and still have time to eat and study and do homework. So be prepared for that. \n\nThe best advice I can give you is to take it easy for your first semester because eventually as a stem major you will be extremely stressed and constantly filled with anxiety, because I sure am. Know how to time manage and to take a deep breath when things get Hard. It will be a large adjustment, but you seem capable of achieving great things. Just keep focused and stay strong because undergrad will be the best time of your life and also the worst. Good luck!!",
      "author": "annon0511",
      "created": 1586983632,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634058548
}