{
  "sid": "as7i4a",
  "link": "/r/collegeadvice/comments/as7i4a/i_will_be_27/",
  "title:": "I will be 27",
  "text": "Is this too late un order to attend a secondary education? I am a car wash manager and am at the end of my rope. I cannot even afford a damn laptop for online schooling. I want to major in electrical engineering so I can make robots. But I dont know if I will be too old. The anxiety is killing me.",
  "author": null,
  "created": 1550558795,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "ehtha0n": {
      "link": "/r/collegeadvice/comments/as7i4a/i_will_be_27/ehtha0n/",
      "text": "I have had a classmate in his fifties in computer science! I’ve also had classmates in various age ranges, so don’t worry about being too late. I’ve had classmates ranging anywhere from their late 20’s to mid 60’s. You’ll be okay :)",
      "author": "tinypachimari",
      "created": 1551758880,
      "upvotes": 1,
      "replies": {}
    },
    "ehqxacq": {
      "link": "/r/collegeadvice/comments/as7i4a/i_will_be_27/ehqxacq/",
      "text": "Some school have special reentry programs for older students.  You may need to Google a bit to find which schools might be for you.   You can also go to community college the first two years which is much less expensive to get the basics out of the way.  The community college will have counselors to help you there and also help you with applying to transfer.  Good luck.  ",
      "author": "mollymarie123",
      "created": 1551674260,
      "upvotes": 1,
      "replies": {}
    },
    "egu215v": {
      "link": "/r/collegeadvice/comments/as7i4a/i_will_be_27/egu215v/",
      "text": "No! My uncle was 35 when he decided to take the Bacalaureate exam again (the final exam of highschool). He passed it in the second try in 2016, applied for Biology in college, got accepted, he will graduate soon and he's planning his Master degree. I'm very proud of him. He showed all of us and his kids that everything is possible!",
      "author": null,
      "created": 1550614589,
      "upvotes": 1,
      "replies": {}
    },
    "egt28t6": {
      "link": "/r/collegeadvice/comments/as7i4a/i_will_be_27/egt28t6/",
      "text": "Nope! I’m graduating this year and I will be 29~ it is a bit difficult because of the social gap, but focus on your goals, you can do it! ",
      "author": "khaleesi_onthatbeat",
      "created": 1550590809,
      "upvotes": 1,
      "replies": {
        "egt2dgs": {
          "link": "/r/collegeadvice/comments/as7i4a/i_will_be_27/egt2dgs/",
          "text": "Honestly I dont care too much on socializing. Maybe a gundam modeling club but other than that im in a relationship and have a friends circle not too worried about chasing skirts or poppin a cold one with the boys lol.",
          "author": null,
          "created": 1550590900,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "egsi7cc": {
      "link": "/r/collegeadvice/comments/as7i4a/i_will_be_27/egsi7cc/",
      "text": "It is never too old my college has 40 year olds attending and it's super fine get that education! \nIf you wanna make robots I recommend you directly start with mechatronics or robotics if any college nearby offers it. I am studying mechani al engineering and minoring in computer science in order to combine all of it into robotics lol",
      "author": "EggYolk26",
      "created": 1550568758,
      "upvotes": 2,
      "replies": {
        "egsvbkg": {
          "link": "/r/collegeadvice/comments/as7i4a/i_will_be_27/egsvbkg/",
          "text": "Thank you, i needed that.",
          "author": null,
          "created": 1550585475,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634057968
}