{
  "sid": "fj0voc",
  "link": "/r/collegeadvice/comments/fj0voc/how_do_i_learn_study_habits/",
  "title:": "How do I learn study habits?",
  "text": "I (18F) got into one of the best universities in my country. I have always been considered smart by my peers, even though I only sometimes review. This used to be okay in high school, yet I'm having problems now in college because I was so used to cruising by my studies yet getting high marks. I know that I shouldn't be so hard on myself, especially since I'm taking 34 units (I wish I was joking/exaggerating,) buuut I have friends who are doing really well and I sometimes can't help but feel sad.\n\nSo, what study habits might you guys suggest and how to actually stick to it?",
  "author": "bengthread",
  "created": 1584276756,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "fklzwj5": {
      "link": "/r/collegeadvice/comments/fj0voc/how_do_i_learn_study_habits/fklzwj5/",
      "text": "Man I'm glad I found this thread. I'm a student in the US and I just cruisedddd through high school. Ended my high school career with a 4.0 GPA, ranked 26 out of 350 students. I would just do my homework and just study right before the test and pass it with flying colors. Then college came along and I couldn't do it. I was going for electrical engineering, then software engineering because it had less math, then I just recently switched the business information systems because it has even less math but still has programming",
      "author": "Pepe_The_Abuser",
      "created": 1584318207,
      "upvotes": 1,
      "replies": {}
    },
    "fkkuyim": {
      "link": "/r/collegeadvice/comments/fj0voc/how_do_i_learn_study_habits/fkkuyim/",
      "text": "Learn to study by looking over the material days in advance, rather than by cramming. Find a study buddy or group which will allow you to talk about and discuss the material. In college rinse and repeat wont work, applying what what you know will get you far better scores. If you can successfully teach the material to someone else, then you’re golden. Its a process, youll pick it up sooner or later",
      "author": "playus3",
      "created": 1584292485,
      "upvotes": 2,
      "replies": {}
    },
    "fkkd0dv": {
      "link": "/r/collegeadvice/comments/fj0voc/how_do_i_learn_study_habits/fkkd0dv/",
      "text": "I had the same issue when i started (i am not graduated). \nFind or make groups to study with.\nFind a place of campus to make your study specific area. I always found studying at home very difficult. \nI always found reading the textbook to be difficult, try and skim through main points.\nTry and find youtube videos on your topics.",
      "author": "MightBeSomethingDumb",
      "created": 1584280937,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634058372
}