{
  "sid": "fxzkj1",
  "link": "/r/collegeadvice/comments/fxzkj1/do_i_still_have_a_chance/",
  "title:": "Do I still have a chance?",
  "text": "Hi everyone! I’ve recently ran into an unfortunate situation. Due to a chronic medical condition I have which leads to me missing a lot of school, I’ve received an average grade of 50% in an elective course the past two years. I’m working towards attempting to fix this but in the event that I cannot, I’m extremely concerned about how this will affect my college applications. Besides these grades, every other grade i’ve received in high school has been 95% or higher. I’ve taken the ACT once and got a 30, and I have a long list of extracurriculars and other accomplishments. So my questions are, will I still have a chance at getting into decent colleges with those two 50%? It obviously will impact my gpa a lot, but will colleges be able to see that I’ve done well in every other class and that those elective credits are the reason for my low gpa? Will I be able to explain to colleges the reasoning for these low grades(chronic medical condition) somewhere on my application? I apologize if this is a lot but I’m just so concerned and would like to see where I stand in terms of my future. I should also mention that I am a junior. Thank you to anyone that has some advice or knowledge to offer up here! :)",
  "author": "katyaxvi",
  "created": 1586462658,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "fmxfan3": {
      "link": "/r/collegeadvice/comments/fxzkj1/do_i_still_have_a_chance/fmxfan3/",
      "text": "r/ApplyingToCollege",
      "author": "drock13",
      "created": 1586463913,
      "upvotes": 1,
      "replies": {
        "fmxfryq": {
          "link": "/r/collegeadvice/comments/fxzkj1/do_i_still_have_a_chance/fmxfryq/",
          "text": "thank you so much! didn’t even realize this wasn’t the best subreddit to post this in",
          "author": "katyaxvi",
          "created": 1586464165,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634058442
}