{
  "sid": "6q8icb",
  "link": "/r/collegeadvice/comments/6q8icb/how_different_is_college_from_high_school_really/",
  "title:": "How different is college from high school, really.?",
  "text": "At freshmen orientation they were harping about it being different but  how different is it?",
  "author": "ToInfinityandBirds",
  "created": 1501295557,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "dl3fmah": {
      "link": "/r/collegeadvice/comments/6q8icb/how_different_is_college_from_high_school_really/dl3fmah/",
      "text": "The best answer I can give to this is it will primarily depend on your study skills. If you already have them from HS, great, keep doing what you're doing (albeit a little more) and you'll be fine. If you were like me and didn't do shit to get good grades, you're gonna die the first semester trying to figure out how to study. The other biggest difference is in writing. Fluff won't cut it anymore. Turning in 20+ page papers (especially if theyre double spaced or lab reports) isn't that weird in college. There's also the classes that have 50+ people where the Prof probably doesn't take attendance and probably doesn't even know you exist unless you go to office hours. Not a big deal and some actually do amazing with class participation and make sure everyone's on the same page during lecture. Others suck and you'll sit in the back wondering why you ever come and depending on you, you might not even go at all. ",
      "author": "odactylus",
      "created": 1501732702,
      "upvotes": 1,
      "replies": {
        "dl3t71n": {
          "link": "/r/collegeadvice/comments/6q8icb/how_different_is_college_from_high_school_really/dl3t71n/",
          "text": "I'll go. Because I'm not an idiot. Why would I skip classes? \n\n\nAlso okay I think we're good then I have study skills I enjoy learning and the clssss in taking are genuinly interesting to me. \n\nThere's one part of school\nI'm dreading at that's the physical aspect of walking across campus which I may not do but ill figure it out",
          "author": "ToInfinityandBirds",
          "created": 1501762391,
          "upvotes": 1,
          "replies": {
            "dl3xkuo": {
              "link": "/r/collegeadvice/comments/6q8icb/how_different_is_college_from_high_school_really/dl3xkuo/",
              "text": "Yeah I like to go too. You know exactly what you need to study that way.\n\nA lot of people at my school use a longboard or bike. I have no idea how some people can stand wearing flip flops all the time. College walking forced me to get arch support inserts and wear a knee brace for a little over a semester because there was just no getting off of it and I lived on the 4th floor with no elevator. (Initial knee injury not caused by walking)",
              "author": "odactylus",
              "created": 1501768592,
              "upvotes": 1,
              "replies": {
                "dl41l3p": {
                  "link": "/r/collegeadvice/comments/6q8icb/how_different_is_college_from_high_school_really/dl41l3p/",
                  "text": "It's a little more complicated than that for me. Ie: a per ant ohstxially disability that currently there isn't any outward signs of and is like to keep it that way. BecauE if I DO use any sort of mobility aid then I gave to explain to people why \"no I'm not faking\" when I DO decide i can just walk. But I am getting my motorized scooter today between 1:00 PM and 4:00 PM so that's good. And I think my dad and I are going to be working on how to get it out of my car in case I ever decide to use it ",
                  "author": "ToInfinityandBirds",
                  "created": 1501773061,
                  "upvotes": 1,
                  "replies": {
                    "dl45zcw": {
                      "link": "/r/collegeadvice/comments/6q8icb/how_different_is_college_from_high_school_really/dl45zcw/",
                      "text": "I figured it was, but that was more in the off chance it wasn't and you were just at a super big campus or something. I think most people will be fairly understanding of \"today's a good day\" type of explanation. If anything id expect more concern when you're using the scooter than accusations of faking it when you're not, but I don't have any experience with the matter myself. People are much nicer in college than HS. (Coming from being a massive nerd in hs to being a chick in an engineering school, there may be some unintentional bias there.) \n\nSorry I can't really help there. Most I can say is that according to a phone pedometer I was too lazy to uninstall, I walk 3-5 mi a day when I have classes with a dorm that's the furthest away on a fairly small campus. ",
                      "author": "odactylus",
                      "created": 1501777627,
                      "upvotes": 1,
                      "replies": {
                        "dl47qep": {
                          "link": "/r/collegeadvice/comments/6q8icb/how_different_is_college_from_high_school_really/dl47qep/",
                          "text": "Id rather not have anyone concerned. And the only reason I may need it is if it's really hot and my classes are far apart. I can usually so pretty well with walking but a lot of walking mixed with heatcanbeanissie.\n\nBetter get the hell over it given the barred I want",
                          "author": "ToInfinityandBirds",
                          "created": 1501779411,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634058572
}