{
  "sid": "qri8uu",
  "link": "/r/AskAcademia/comments/qri8uu/teaching_a_large_group_of_mixed_ability_students/",
  "title:": "Teaching a large group of mixed ability students",
  "text": "I have my first interview to become a graduate teaching assistant/PhD student and I have been asked to make a presentation to demonstrate how I would teach to a large group of mixed ability students.\n\nI asked for more details and they told they both want me to speak about a specific topic in my field, which is fair, and then explain why I did it that way and talk about mixed ability students.\n\nI spent the last 3 days looking online for any material, but it appears that I can only find information about teaching kids, and not adults in higher education.\n\nWould anyone be able to mention an author, a book, an article, anything at all?\n\nI found some generic information, but never a proper strategy. I was able to collect some tips from multiple websites, but again there is no bigger picture, it's more like random little things I can do.\n\nAny help would be appreciated!",
  "author": "Samuele156",
  "created": 1636626000,
  "updated": 1636654639,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hk74ueh": {
      "link": "/r/AskAcademia/comments/qri8uu/teaching_a_large_group_of_mixed_ability_students/hk74ueh/",
      "text": "They might just mean students with different knowledge levels and learning styles? In that case, I would just teach a single concept in multiple ways, explaining verbally and using lots of visuals/video/text and maybe even a group activity (which you’d have to describe in a demo), and being sure to define terms along the way, explaining them and giving examples. If you can find a way to explain an assignment that would be flexible enough ton have multiple options for how it can be completed, that would be great too.",
      "author": "SilencedinAcademia",
      "created": 1636636065,
      "upvotes": 6,
      "replies": {
        "hk77beu": {
          "link": "/r/AskAcademia/comments/qri8uu/teaching_a_large_group_of_mixed_ability_students/hk77beu/",
          "text": "Yeah, I was thinking about the same. Different knowledge levels and learning styles. Your suggestions are great, thank you! I will make sure to use them,,.  \n\n\nJust in case, I will prepare a final slide about special needs and inclusion, just to be sure I do not miss out on that. If it was not requested, well, no problem. But just in case they need it.",
          "author": "Samuele156",
          "created": 1636637372,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hk6wkpp": {
      "link": "/r/AskAcademia/comments/qri8uu/teaching_a_large_group_of_mixed_ability_students/hk6wkpp/",
      "text": "Maybe not what you are looking for. Something that came to mind was using grayscale graphs and figures for those with color blindness. \n\nIn my field it is common to relate information to \"laypersons\" not familiar with science. Not sure if this is an angle to pursue, or if they are asking specifically for learning-differences.",
      "author": "marisolm9",
      "created": 1636630798,
      "upvotes": 3,
      "replies": {
        "hk6xqjk": {
          "link": "/r/AskAcademia/comments/qri8uu/teaching_a_large_group_of_mixed_ability_students/hk6xqjk/",
          "text": "They have been very generic with their request, so I am not entirely sure what they are looking for. Grayscale graphs are surely something to consider for color blindness. There are so many particular situations and special needs that it's basically impossible unless you know who your students are, to deliver a perfect lesson.\n\n&#x200B;\n\nThe laypersons thing is definitely relevant and it was basically my main point to sell, because it's a major thing you can do regardless of you knowing your class.\n\nThanks for the answer!",
          "author": "Samuele156",
          "created": 1636631637,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk7efs9": {
      "link": "/r/AskAcademia/comments/qri8uu/teaching_a_large_group_of_mixed_ability_students/hk7efs9/",
      "text": "All I can offer is another anecdotal tidbit, but I've found lots of success with using group quizzes in these settings. I regularly teach logic where I have a large number of both CS and humanities students. The quizzes aren't worth much, but it's a great pedagogical device. The stronger students get the chance to cement and test their knowledge by explaining the material to the ones who are having trouble. The ones who are struggling get to hear the material explained by someone other than me. Moreover, it's great for group cohesion since it's collaborative (and, as a bonus, it gives you an item of evaluation with a fraction of the grading).",
      "author": "shedtear",
      "created": 1636640821,
      "upvotes": 1,
      "replies": {
        "hk7jgbd": {
          "link": "/r/AskAcademia/comments/qri8uu/teaching_a_large_group_of_mixed_ability_students/hk7jgbd/",
          "text": "Never thought of it. How do you make them explain? For example, the \"winning\" group that knows the answer gets to explain it to the others?",
          "author": "Samuele156",
          "created": 1636643090,
          "upvotes": 1,
          "replies": {
            "hk7vxhw": {
              "link": "/r/AskAcademia/comments/qri8uu/teaching_a_large_group_of_mixed_ability_students/hk7vxhw/",
              "text": "I break them into groups of four and, while each student has their own copy of the quiz, each group just submits one quiz. This means that they end up discussing their thoughts to come to a consensus. So, if one of the group members has a misunderstanding, they get immediate feedback from their peers. Normally at least one person in the group really knows the material and helps clear up any of the others' misunderstandings. They're not worth very much and I mix up the groups for each quiz. So, all group members get the same score (which means that there is only a quarter of the usual grading), but students rarely get screwed over by having a crappy group.",
              "author": "shedtear",
              "created": 1636648389,
              "upvotes": 1,
              "replies": {
                "hk7zcvt": {
                  "link": "/r/AskAcademia/comments/qri8uu/teaching_a_large_group_of_mixed_ability_students/hk7zcvt/",
                  "text": "Very nice idea, thank you!",
                  "author": "Samuele156",
                  "created": 1636649733,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}