{
  "sid": "pgx8n8",
  "link": "/r/AskAcademia/comments/pgx8n8/for_those_us_who_willingly_or_even_happily_left/",
  "title:": "For those us who willingly or even happily left: how did you come to realize that you didn't want to stay?",
  "text": "Anyone else come to realize that they didn't want to stay whether at an early or later point in their academic career? How'd it go for you? \n\nI'm specifically asking about those of us who came to realize that we just didn't want to do this/keep doing this/or decided it wasn't right for us anymore. I do of course understand that many of us did not willingly or happily leave but rather were pushed out due to the dismal realities of the job market. I am very sorry to all who found themselves in this position. I almost certainly would have been in this position myself had I wanted to stay. \n\nAnd to those who are having a good time in academia, more power to you! :) \n\nAs for my story:\n\nI just received my PhD earlier this year and for a while had been thinking of staying in academia but doing a postdoc in a related though different field. I had been hoping to transition into a different discipline than the one I received my PhD in. In the worst case scenario I was even prepared to do another degree to enhance my credibility and ability to make the switch, though I'd already done a lot of interdisciplinary work during my PhD.\n\nBut then things started to change. I kind of just had an epiphany: this doesn't seem like the life I want after all. I started asking myself things like \"Even if you could get your dream job doing mostly research at a university in a city you want to live in, would you like to spend your career doing this and being a part of this culture?\" I found myself uncertain of this at first and while I became closer and closer to finishing my answer started to shift firmly to \"No.\" And this was certainly an optimistic hypothetical! Given the job market in the humanities that scenario was extremely unlikely, even after years of temporary positions and trying to land a tenure track job, let alone in a region I want to live. If this ideal hypothetical had turned into a more firm \"No,\" then the reality was a certain \"No.\" \n\nThree things really got me to this point: \n\nFirst, I can't stand the general culture of academia. At least in my discipline and my department in particular, it felt like a culture that was very arrogant, obsessed with prestige (I was at a top 10 department in my discipline so maybe I was around particularly arrogant and elitist colleagues), obsessively trying to justify it's worth to the greater community outside of academia, and seemed to have a very myopic idea of human interest (seeing others mostly as a matter of \"what you work on\" and your publications or the like). Maybe others have had a better experience with academic culture. But it wasn't right for me. I loved the topic of my dissertation, my own research, and my advisor, but I couldn't stand the academic community and culture as a whole, at least the way I experienced it during my time in graduate school. \n\nSecondly, even that ideal life that I had imagined when asking myself how I really felt about academia had started to seem like a really monotonous existence. Teaching the same, or at least similar, courses for years--decades!--on end, the ever-demanding chase to publication, vying for eventual tenure...and, for what? A life of more teaching the same courses for decades? A rotating cast of students coming and going? The ability to write and publish more? It all started sounding quite unappealing. A life of monotony, really. \n\nThird, I started feeling disconnected from the larger world. I had a strong sense that my work was insular and had little impact as much as I was having fun with it at the time and that even that ideal life as a tenured professor at a university where I wanted to be would leave me unsatisfied. I would always feel like I was living at a distance from the world within the bubble of academia. \n\nI've now left to pursue a trade and honestly I couldn't be happier!",
  "author": "primarycolorsnomore",
  "created": 1630640209,
  "updated": 1634079420,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hbqklwr": {
      "link": "/r/AskAcademia/comments/pgx8n8/for_those_us_who_willingly_or_even_happily_left/hbqklwr/",
      "text": "I’m in the midst of this—and just found this sub while searching for a post- or alt-ac sub (would anyone be interested in that)?\n\nAlso PhD in the humanities, and in the wake of the pandemic and what I consider to be the necessary work of my discipline to decolonize, I know there is not a place for my progressive and interesting but niche dissertation research, and that I don’t *want* there to be. But I couldn’t get myself to turn somewhere new that didn’t feel simply trendy. I graduated into the pandemic and while I had a research postdoc, it was otherwise unsupported and untethered, and couldn’t get myself beyond my dissertation research because of the pressure to convert it to real academic capital and because I lacked the organic experiences that lead to a real connection and passion for my next topic. Instead, I was continually traumatizing myself returning my article adaptation again and again, isolated, without feedback, and without real enthusiasm for it. \n\nAnd then I also realized that I would be *lucky* to only be unsettled for the next 8 years while I drove myself into the ground to get tenure—and keep putting my life on hold, as I had been since I was 14 (which was when I started seriously pursuing my discipline). But if I didn’t suffer for this, did I ever love it? and what was all of this for? And then… I just finally was able to see the sunk cost fallacy I was operating under. \n\nI’m now unemployed and turned down an offer to adjunct so that I can focus on figuring out what else it is that I can do. I’ve been working slowly through a few career searching books to really hone in on the skills and environment I loved as an academic (and the things I want to avoid) and where I can find them elsewhere. I am also spending a good amount of effort trying to really believe that I can be more than a “failed academic” and that the best of my life is yet to come, and that all of this will play a part in it. This is was I read again and again in the quit lit—that very few if any academics that leave the professoriate (or the track) regret it.",
      "author": "schilke30",
      "created": 1630879834,
      "upvotes": 2,
      "replies": {
        "hbr9hi7": {
          "link": "/r/AskAcademia/comments/pgx8n8/for_those_us_who_willingly_or_even_happily_left/hbr9hi7/",
          "text": "I hear you and I'm sorry for the stress you've been through on your path out of academia. \n\nI don't know if this is too different from your circumstances for it to feel helpful, but my own career is now totally unrelated to my academic discipline. I went into a career that you can do without a high school diploma, even! I did this because I always held antecedent interest in my current career. Because I went with a very different (and often times much more profitable than academia) career, I really don't feel like a failed academic at all. I feel happy to have left that culture behind.\n\nMaybe if you broaden your search to things you're interested in that might be totally different it might help stave off the failed academic mindset. I don't know if this is at all helpful, so I'm sorry if it's not!",
          "author": "primarycolorsnomore",
          "created": 1630892080,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}