{
  "sid": "oqrh0t",
  "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/",
  "title:": "Professors & Faculty Members: When reviewing applications for graduate students, how do you evaluate a candidate's potential for research? What qualities in an applicant demonstrate strong potential as a successful researcher?",
  "text": "Hey there. \n\nAs a prospective grad student wishing to pursue a STEM field (Computer Science), I read Phillip Guo's [excellent article on grad applications](https://pg.ucsd.edu/PhD-application-tips.htm). My key understanding is that for M.S. and Ph.D. applicants *the biggest factor in a successful application is a candidate's research experience*.\n\nLikewise as a corollary, should the applicant lack actual experience the second-best thing would be their *research potential*.\n\nHence my question is: when you review an application, *what are some of the signs that you look for in order to evaluate a candidate's potential? What are the qualities in an applicant which demonstrate a strong potential as a future researcher?*\n\nI'm interested in these answers because I am an undergraduate myself who is applying for a M.S. in Computer Science, but I come from a Humanities (Philosophy/Classics) background without any prior experience in STEM research.\n\nAs an academically-talented student with an aptitude for the Humanities, I want to know how I can best present myself as a serious candidate, with excellent potential for graduate-level research and scientific inquiry.\n\nThank you very much!",
  "author": "Yangchenghu",
  "created": 1627138157,
  "updated": 1634081851,
  "over_18": false,
  "upvotes": 108,
  "upvote_ratio": 0.99,
  "comments": {
    "h6dhcc5": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dhcc5/",
      "text": "You should be able to get into a MS without too much of a research experience etc. That advice is mostly for PhDs. Lots of MS CS programs nowadays welcome students from non-CS backgrounds though you may have to take some bridging courses. \n\nBear in mind though that if you are interested in a PhD down the line, most good schools will not seriously consider your application without some research experience so perhaps that maybe a priority while you are doing your MS.",
      "author": "anctheblack",
      "created": 1627140769,
      "upvotes": 31,
      "replies": {
        "h6dj1gl": {
          "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dj1gl/",
          "text": "I'm glad to hear that MS admissions won't be as stringent on past research experience. Originally I had wanted to pursue a PhD, it was exactly my lack of research experience that made me decide on finishing an MS first.\n\nI'll definitely make doing research a priority at my MS, should I get in!",
          "author": "Yangchenghu",
          "created": 1627141577,
          "upvotes": 8,
          "replies": {
            "h6djzxb": {
              "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6djzxb/",
              "text": "A suggestion: with your background in philosophy and cs, you might be very competitive for faculty looking for phd students in ethics of ai/algorithmic bias/fairness etc. I work in the field and you would be a great candidate. However, I wouldn't really consider you without some solid prior research experience. The reason is that there are great applicants all over the world who apply with prior research experience. That factor is hard to pass up when choosing who to admit for PhD.",
              "author": "anctheblack",
              "created": 1627142037,
              "upvotes": 19,
              "replies": {
                "h6dm2fh": {
                  "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dm2fh/",
                  "text": "I have a question if you don’t mind. \n\nDoes research experience mean published papers? Or can it include research done for organisations that I can’t necessarily show?",
                  "author": "ravenpaw_15",
                  "created": 1627143041,
                  "upvotes": 3,
                  "replies": {
                    "h6dnwz5": {
                      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dnwz5/",
                      "text": "Publications in well regarded venues are a stronger signal than any other signals. However, actual research experience without publications backed up with strong letters from mentors are also very good.\n\nNo research experience will keep you out.",
                      "author": "anctheblack",
                      "created": 1627143929,
                      "upvotes": 7,
                      "replies": {}
                    },
                    "h6dpatm": {
                      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dpatm/",
                      "text": "Papers are nice, but other experiences count, too. It's just important to describe it in a clear and discoverable way on the CV. Further, your interviewers will understand that non-disclosure agreements may prevent you from sharing details but you should be prepared to talk about at least the most important aspects of your research and results so that they can understand what you did and how you did it.",
                      "author": "defntly_not_mathias",
                      "created": 1627144593,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                },
                "h6dm63d": {
                  "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dm63d/",
                  "text": "Thank you for your suggestion. I'm very much interested in that field of research- indeed, my plan all along was to leverage my foundation in Philosophy and Classical Studies to pursue something interdisciplinary. \n\nRegarding my lack of research experience, what things could I realistically do to best alleviate that flaw? I'll be beginning my final year of studies as a Senior/Year 4 student this August, and I'll only have one year left to 'catch up.' \n\nA lot of the traditional advice for gaining research experience does not work for my particular circumstances, as my college is a highly specialised, Philosophy-only program that does not have any other faculties. \n\nI'm always looking for suggestions of things that I can accomplish in the time that I have left which will let me gain some experience.",
                  "author": "Yangchenghu",
                  "created": 1627143090,
                  "upvotes": 3,
                  "replies": {
                    "h6epwnz": {
                      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6epwnz/",
                      "text": "You are probably the exact kind of candidate who would benefit from a rigorous research thesis based MS program. Try to choose schools where faculty are doing work in the areas that you are interested in and once you get into the MS program, from day 1, attach yourself with a lab, a faculty and start doing research. If you are fortunate enough to be put on a paper as co-author, then that sends a really strong signal.",
                      "author": "anctheblack",
                      "created": 1627162885,
                      "upvotes": 3,
                      "replies": {
                        "h6et7sb": {
                          "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6et7sb/",
                          "text": "Thank you for your kind words and encouragement! I had begun my grad school search process aiming to jump straight into a PhD, but quickly realized that a research-focused MS is exactly what I need — to develop research experience — before taking a PhD down the line.\n\nThis goal has informed my application strategy, and of the 9 institutions that I have shortlisted (Univ. Texas is one of them actually!), all are research-focused Masters.\n\nMy only real source of anxiety at this moment is the knowledge that even applicants for Masters programmes are expected to have relevant research experience, hence my questions. Höwever, at this stage all that I hope is that I’ll be able to demonstrate my strengths, and earn my research experience in the MS.\n\nI’ll be heading to bed soon, but before I leave, I just want to thank you one last time for this lovely and informative exchange. As an undergrad who’s still get unused to the ways of graduate admissions, you have been a tremendous source of perspective and advice. Many thanks!",
                          "author": "Yangchenghu",
                          "created": 1627164595,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "h6ecw8b": {
          "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6ecw8b/",
          "text": "Totally random question from someone completely removed from CS.\n\nWhat do CS research projects usually look like? Do you trying to invent new types of software/code?",
          "author": "kevinbsmith006",
          "created": 1627156224,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6dcj3y": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dcj3y/",
      "text": "I originally posted this in /r/gradadmissions, but I was told that /r/AskAcademia may have an audience better-suited to answer my question(s). I tried my best to keep my question general, and useful for all graduate students - in hope that it will be a benefit for all.",
      "author": "Yangchenghu",
      "created": 1627138393,
      "upvotes": 12,
      "replies": {
        "h6ewj0t": {
          "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6ewj0t/",
          "text": "If you're still in school, the easiest and cheapest thing you can do now is join a lab. You will have a years worth of research experience once you graduate. Many masters programs are unfunded and can cost tens of thousands of dollars. If you intend to pursue a PhD anyhow you're best served trying to gain these skills in your final year, rather than shelling out later. 1 year \nexperience is a bit slim but can work out.",
          "author": "tishtok",
          "created": 1627166334,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h6dibt8": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dibt8/",
      "text": "A subject like CS is one that translates well to having an online portfolio, e.g., of work that you have produced as part of your undergrad CS program, or just on your own out of personal interest. You could summarize the portfolio and link to it from your CV. This is assuming that you can publicly share code that you have worked on, e.g. on GitHub.\n\nMore generally, showing that you have spent time in a serious research environment even without producing research can be a very good indicator of motivation and potential, e.g., as a summer research student in a lab or some other support role.\n\nDepending on where you apply, you often need to include a personal statement as part of an application. This is a place to highlight your relevant experience and interest in the target program, and possibly propose a research problem to work on. Making a convincing proposal on a novel idea takes a lot of preparation and reflects a serious interest in the topic, even you don't have relevant outputs.",
      "author": "Vievite",
      "created": 1627141238,
      "upvotes": 10,
      "replies": {}
    },
    "h6dduef": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dduef/",
      "text": "Maybe show some self-driven tasks. Like some certs in CS on your applications CV. If you don't already have CS courses on your transcript, get them there but the online certs are icing showing independence and self starting.",
      "author": "adequateScienceDoer",
      "created": 1627139063,
      "upvotes": 5,
      "replies": {
        "h6dge50": {
          "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dge50/",
          "text": "Thank you for your response. For my application strategy, I am definitely planning to advocate for myself based on my qualities as an independent, self-driven learner. Regarding CS-related qualifications, I'm actually concurrently enrolled in a BSc in Computer Science, with the University of London. It's an entirely remote, online program that I take in my spare time alongside my BA in Philosophy. I wrote a little about my experience [in a prior post](https://www.reddit.com/r/gradadmissions/comments/oo2eq4/what_are_my_prospects_for_a_computer_science_phd/).\n\nI am definitely hoping that my academic background will prove persuasive to faculty members :) \n\nPlease let me know if you have any other advice. Thanks!",
          "author": "Yangchenghu",
          "created": 1627140303,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6dnm8l": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dnm8l/",
      "text": "I feel that the other answers provide some insights but fall a bit short in addressing the question on how you would show research potential. \n\nDemonstrating potential is of course much more subjective than demonstrating experience, which may be quantified in terms of publications etc. I guess that's largely the reason why it's hard to get into programs without experience: there's (perceived) higher risk that the potential does not materialize, and different faculty members on a committee, may disagree what constitutes great potential. \n\nAnyway, I guess you could demonstrate potential relatively easily in your statements by describing the problems you are interested in, characterizing their importance to society or whatever, how you intend to solve them (e.g., using tools from computer science, human factors, ...), and how you would measure and determine success. You will find that this is essentially what papers (and even grant proposals in a way) do, so demonstrating your skills in the above way can show potential for succeeding in research that requires the above literally all the time. \n\nAnother aspect is self-sufficient problem solving that may be demonstrated in many ways, as well as curiosity and self-Motivation. Hard to say what could work in an specific case but the important thing to note is that it's not enough to just call yourself a word, like \"I'm a passionate and hard working problem solver\", because everybody can write that. The important thing is the ability to back it up with things that you did in a specific way, and that ideally, can be verified. \n\nGood luck with your applications!",
      "author": "defntly_not_mathias",
      "created": 1627143786,
      "upvotes": 5,
      "replies": {}
    },
    "h6eoaxj": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6eoaxj/",
      "text": "Interest. Enthusiasm, Dedication.",
      "author": "kakeman69",
      "created": 1627162059,
      "upvotes": 4,
      "replies": {}
    },
    "h6euog2": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6euog2/",
      "text": "If a resume tells a story as to how it got to me, that at least gives me some reason to take a chance on a non-traditional applicant.  What's your pivot?  Volunteer experience, small projects, maybe training on lab software?  Anything, *anything*, that makes this move seem congruent with your trajectory.  At least then someone can advocate for you and point towards whatever that is to counter the two obvious concerns: flake or flop.",
      "author": null,
      "created": 1627165360,
      "upvotes": 3,
      "replies": {}
    },
    "h6dr5ee": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dr5ee/",
      "text": "(1) they actually read my website and the instructions I gave for how to inquire about positions.\n\n(2) they actually read my papers and have thought about the ideas. I'm not talking about an obviously templated email that used the title of one of my papers, I'm talking about direct engagement with the ideas, and some thoughts on how they might go beyond them.\n\n(3) I'm willing to forego the preceding item if they show that they've spent a lot of time working in and/or thinking about the ideas in my subfield, and know what kind of work I do. Again, this is more than just parroting what's in article titles and on my website.",
      "author": "respeckKnuckles",
      "created": 1627145484,
      "upvotes": 5,
      "replies": {
        "h6dt2vm": {
          "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dt2vm/",
          "text": "I am very grateful for your response, Professor. I'm very encouraged by the knowledge that personal engagement and genuine curiosity is valued and appreciated.\n\n> I'm talking about direct engagement with the ideas, and some thoughts on how they might go beyond them.\n\nThis is pretty much my current plan. Of the institutions that I am applying to, I am planning to find one or two faculty members within my field and spend some time familiarizing myself with their work, before writing polite letters.\n\nIn regards to inquiring about positions, how would you feel about a undergrad *who is not a student at your institution* writing to you? My college is a highly specialised school with only a philosophy faculty, and as a result I am ill-placed to find research experience in my home institution.\n\nAs a result I want to write to the Computer Science faculty at a neighboring University, and inquire for any opportunities to gain research experience. I intend to approach faculty members in the same manner as you indicated (familiarizing myself with their work). However I fear that it would be discourteous of me, as I am not a student at their institution.\n\nWould you (or your colleagues) be appreciative of an 'external student' inquiring about opportunities to work with you in such a way?",
          "author": "Yangchenghu",
          "created": 1627146416,
          "upvotes": 1,
          "replies": {
            "h6e1pn9": {
              "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6e1pn9/",
              "text": "It wouldn't hurt; the worst they could say is no. There are two things to keep in mind, however: First, there may not be a mechanism in place for them to easily start formal collaborations with non-students. Yes, even if you want to volunteer your time for free, we may not be allowed to accept it, because of the possibility that we'll be sued later for exploiting free / unpaid labor. There are sometimes formal volunteering programs in place to allow our students to work with us, but again, this might not extend to those outside of the university.\n\nSecond, you need to be exceptionally self-motivated and independent. And that's unfortunately very difficult to convey in emails---it's why I usually only work with a student when I've seen how they are in one of my classes. All too often, working with a new student research assistant means I need to spend a lot of my own time and energy supervising this student, figuring out what they can work on, directing them, etc. At least with students I'm in a formal partnership with (e.g., those taking a research semester with me), there's some expectation that it'll pay off (in the form of a paper, report, work done, etc.). Students outside of the university always have the risk of simply disappearing. That may not be a time sink many professors think is worth the risk.",
              "author": "respeckKnuckles",
              "created": 1627150617,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h6eaa26": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6eaa26/",
      "text": "Reading these answers makes me wonder how the hell I got accepted to three PhD programs at pretty good schools in physics.  I had ZERO research experience.  My personal statement was vague and undirected.  I had no idea what areas I wanted to study.  My GPA was middling and my GRE scores were... fine... I guess.  I got funding offers from all three schools.\n\nI really to this day dont know if I'd get accepted with the same application in this day and age.  I do wonder what the hell the committee's were thinking.  One theory for the school I attended was that they wanted mostly superstar international students but had a quota for native English speakers to TA the 'not for major's classes and if they washed out, fine, at least they courses got taught.  But that doesnt explain the other offers I got, including an Ivy League school that didnt have almost any international students.",
      "author": "bjos144",
      "created": 1627154892,
      "upvotes": 2,
      "replies": {
        "h6eejnk": {
          "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6eejnk/",
          "text": "If you know the secret to your success, do feel free to share them here! I'm honestly really anxious about my prospects, and hearing your story was reassuring :)",
          "author": "Yangchenghu",
          "created": 1627157066,
          "upvotes": 1,
          "replies": {
            "h6ekr85": {
              "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6ekr85/",
              "text": "I honestly dont know.  I went to a middling state school, I had Ok grades, but not the best.  I published nothing.  I applied to 9 schools and got into 3.  This was in 2006.  Everything I read now about applying to grad school, or even just college, makes me second guess if I would be good enough in this day and age.\n\nOn the other hand, maybe dont worry about it so much?  A PhD is a journey of exploration.  Unlike a BS or an MS, it's not scripted by a syllabus.  Everyone's PhD is different, basically by definition.  So if you get in or if you dont this year, that's just part of the journey.  Maybe you dont get in this year but you do next year?\n\nMaybe they need you too.  You're cheap labor, you do the grunt work for the profs, grade the papers etc.  So dont underestimate that having a BS or MS means you're a well trained person, and not just some random scrub.  It's easy to forget that you have value and are not so easily replaceable.  Maybe I underestimate how good of a candidate I was.\n\nI dont have answers for you.  Just that every year grad schools welcome thousands of students into PhD programs.  They dont do it for charity.  They need the students as much as the students need them.  You are more valuable than you might feel.\n\nPragmatic advice abounds.  Study hard, research what you want to do your PhD in, be flexible, reach out to profs etc etc etc.  All common sense stuff.  Just adjust your attitude about your value.",
              "author": "bjos144",
              "created": 1627160231,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h6dzm2e": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dzm2e/",
      "text": "Ability to explain their research and the role they had in it.\n\nEspecially for CS look for strong technical fundamentals like previous software engineering work. The later is more specific to our group because we had to lay down a lot of code.",
      "author": "lednakashim",
      "created": 1627149586,
      "upvotes": 1,
      "replies": {}
    },
    "h6em2hu": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6em2hu/",
      "text": "I like to see some research experience in a lab at the junior and senior level.",
      "author": "Selvadoc",
      "created": 1627160906,
      "upvotes": 1,
      "replies": {}
    },
    "h6gw5si": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6gw5si/",
      "text": "(research) experience is irrelevant to me unless its led to publications in good venues; its ability that matters. Having \"experience\" would maybe give you a month head start in a PhD, its irrelevant in the grand scheme of things. Note that others will feel different about this\n\nWhat matters to be are the things that signal ability and raw intelligence. Your grades during your previous degrees (with some informal weighting according to the prestige of the university you went to), the grades you got in difficult modules especially, your general demeanour during an informal interview, how well you seem to understand things, whether you can come up with ideas on the spot, references (but only from someone you've done a project with), etc.\n\nAside from that, I'd say that level of subject knowledge does matter but its secondary to raw ability since smart people can learn new things fast; I'd rather take a very smart person that has done only a couple of modules related to the PhD area than a somewhat smart person that has a Masters degree in exactly that field.  I usually ask a few basic competency questions to screen out the people who really do know nothing. Then you have general passion for research, whether I think the person seems to come up with good ideas, etc. Then there's the basic \"do I actually want to talk to this person multiple times a week?\" aspect - PhD student-supervisor relationships are ultimately close mentoring and you ideally need a student that you want to be around, and who can integrate into a group.",
      "author": null,
      "created": 1627217283,
      "upvotes": 1,
      "replies": {}
    },
    "h6dywyc": {
      "link": "/r/AskAcademia/comments/oqrh0t/professors_faculty_members_when_reviewing/h6dywyc/",
      "text": "Most important is grades in relevant courses.",
      "author": null,
      "created": 1627149242,
      "upvotes": -6,
      "replies": {}
    }
  }
}