{
  "sid": "ihb1hn",
  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/",
  "title:": "I would like to become a professor but don't know if the endeavor is worth it for a variety of reasons. What do you think? What are the ways to make yourself stand out?",
  "text": "I have a ton of questions regarding becoming a professor. I am wondering just how difficult overall it is. \n\nI have heard that it is difficult because there are a lack of jobs and for one position there may be up to 400 applicants. \n\nI have heard that only the top students at top schools get these positions. I am not a bad student, I just know I'm not the best. \n\nI am 30 years old and looking to go to grad school within the next 2-3 years but don't know how old I can realistically be to apply for professorship. Speculating I will be doing so in my late to early 40's. \n\nI live in Canada and have heard there are less opportunities in Canada and therefore competition is that much more tough. I have a stable unionized job that I cannot leave here in Canada. \n\n\\--\n\nIf there is space and time, are there any ways to make yourself stand out as a candidate. Does specializing in a narrow sub field help?",
  "author": "charlieirvine",
  "created": 1598488413,
  "updated": 1634081237,
  "over_18": false,
  "upvotes": 149,
  "upvote_ratio": 0.92,
  "comments": {
    "g2zcxn6": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zcxn6/",
      "text": "I always want to encourage people to pursue their goals. At the same time, as a young professor, I feel ethically obligated to agree with and reaffirm what /u/sdcouple10 and /u/phenomenologist83  have written. And the long aftermath of COVID-19 will just continue to decimate academic job markets that barely existed before. (A few disciplines, like nursing, are exceptions. Computer science also does pretty well.)\n\nI'm chiming in to add that while top students at top schools get some jobs, ***the vast majority of them also never attain a tenure-track position.***\n\nTo answer your direct question: **specializing in a narrow sub-field does not help.** That makes things harder: most jobs are at poorly resourced, teaching-heavy institutions. You can research whatever you're interested in, but you must *always* discuss its significance for the broader field(s), because you will basically never teach classes in your area of specialty. There will never be enough demand. (At well-funded R1s and elite SLACs, faculty have more flexibility.)\n\n**Almost 80% of faculty jobs are non-tenure track.** If contingent faculty were treated well and paid fairly, this might be okay. But adjuncts are treated horrifically and exploited without consequence. They might teach five classes a semester (spread across multiple universities), get paid anywhere from $1000-3000 per class, and are often denied health benefits due to the  length of their contracts.\n\nI have a feeling this isn't what you imagined what being a professor looks like.\n\nIf you choose to pursue graduate school, I'm ***not*** saying don't work hard or hope for the best. I'm saying learn as much as possible about the realities of being contingent faculty and assume you will not be the exception.\n\n**Then ask yourself:** if you knew there would be no permanent academic position at the end of the tunnel, would you still want to spend 6-7 years back in school?\n\nI'm sorry this sounds so discouraging. But I think what matters most is that you're informed, no matter what decision you make. Best of luck!",
      "author": "synthesis-synthesis",
      "created": 1598495797,
      "upvotes": 190,
      "replies": {
        "g2zlj57": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zlj57/",
          "text": "I like honest replies and this is honesty. Ideally, if I teach a few classes I like with students who want to learn, I could live with it, if its in the country I'm currently in. Again, I can go part-time at my other job.",
          "author": "charlieirvine",
          "created": 1598500942,
          "upvotes": 47,
          "replies": {
            "g2zsctm": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zsctm/",
              "text": "I started the path towards my doctoral studies while working full time and co-adjuncting on evenings, taking a half-day off my day job once a week. I did that for a year before quitting my job to adjunct and later enroll in a PhD. \n\nI had been invited to adjunct, though it helped that I had been volunteering once a month or so with different professors the year prior. Sometimes being familiar, accessible, and reliable is better than being the ‘best student’. \n\nWas it worth it?\n\nFor me, probably. The simple answer is that whatever path you lay out for yourself, it will likely change. Like life in general, academic opportunities and circumstances can take unexpected detours. Do know that it will likely be very financially difficult. But if it fulfills your own personal Ikigai, then it may be worth trying.\n\nJust know that if it doesn’t work out, there are many other fulfilling ways to teach people, and being a professor does not automatically make someone a better teacher.",
              "author": "drarch",
              "created": 1598505700,
              "upvotes": 21,
              "replies": {
                "g313b4w": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g313b4w/",
                  "text": "Luckily, I've done this throughout my undergraduate career. I volunteer in labs and organizations for free because I have the time and aren't as stretched for money. Doors openly more naturally this way because a lot of pressure it taken away on the hiring side.",
                  "author": "charlieirvine",
                  "created": 1598541597,
                  "upvotes": 4,
                  "replies": {}
                },
                "g304uku": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g304uku/",
                  "text": "I see, so you did work for free for professors and they rewarded you with a job.\n\nMost people can't afford to work for free.",
                  "author": "radionul",
                  "created": 1598517130,
                  "upvotes": 8,
                  "replies": {
                    "g30i051": {
                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30i051/",
                      "text": "Not work for free. I showed up when they needed professional guests to review student work. Made myself available once a month during school year to a few different professors, which later vouched for me when it came time to adjunct. \n\nDefinitely not something everyone can afford to do, but then neither is adjuncting. One day a month from my day job was a chance for me to test out whether I liked it, and whether they liked having me around. Two of those professors are the co-chairs of my dissertation committee, so the investment paid off.",
                      "author": "drarch",
                      "created": 1598529543,
                      "upvotes": 6,
                      "replies": {
                        "g313er1": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g313er1/",
                          "text": "I really appreciate this approach. It pays to be kind and genuine with people. Or rather, it's in your favor.",
                          "author": "charlieirvine",
                          "created": 1598541645,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g30ll4v": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30ll4v/",
              "text": "Then get a masters degree and do adjunct instructing. The majority of professorships at least quality ones are for researchers anyway. If you want to teach, just get a masters.",
              "author": "kakeman69",
              "created": 1598532087,
              "upvotes": 7,
              "replies": {
                "g313j8w": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g313j8w/",
                  "text": "I'll be honest, I prefer the research side. But I'm hoping you can do research without having to teach. That requires more research on my part doesn't it!",
                  "author": "charlieirvine",
                  "created": 1598541707,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            }
          }
        },
        "g304quy": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g304quy/",
          "text": "Specialising in a narrow sub-field doesn't help???? All the tenure track advertisements I have seen require just that.\n\nMultidisciplinary has been a burden for me career-wise,  but I do it anyway because it's the science that drives me.",
          "author": "radionul",
          "created": 1598517034,
          "upvotes": 7,
          "replies": {
            "g31lykx": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31lykx/",
              "text": "The alternative to specializing in a narrow subfield isn't being multi or interdisciplinary. That, as you rightly note, comes with its own challenges.\n\nI stated in my post that OP should research *whatever interests them.* For most of us, that's the point. But I emphasized that they must always remember to frame the significance of their research in broad terms, because \n\n**1)** no search committee (for jobs or for grants) is composed solely of people specializing in the same small area, and they all need to understand why your work is innovative and why it matters for the discipline \n\n**2)** regardless of what research appeals to an institution, that doesn't change the fact that the vast majority of undergraduate classes, regardless of discipline, are for a wide audience (whether for non-majors or majors). This is even more true for teaching-intensive schools.",
              "author": "synthesis-synthesis",
              "created": 1598550293,
              "upvotes": 3,
              "replies": {
                "g31x45i": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31x45i/",
                  "text": "I agree with your second point. Regarding your first point, unfortunately I have yet to find a tenure track job committee that aren't obsessed with a particular definition of a particular sub-field. This is a big problem in Europe. Not as bad in the US, but it exists there too in some places.\n\nWith grant committees I have had much better luck because there is no departmental politics at play there. So I have funded the near 8 years since my PhD through grants.",
                  "author": "radionul",
                  "created": 1598555042,
                  "upvotes": 2,
                  "replies": {}
                },
                "g328n5c": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g328n5c/",
                  "text": "Understanding how their research is significant in the broad scheme of things.. I am imagining it requires a working knowledge of the field as a whole, this isn't easy.",
                  "author": "charlieirvine",
                  "created": 1598560294,
                  "upvotes": 1,
                  "replies": {
                    "g32ytug": {
                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g32ytug/",
                      "text": "Gaining a working knowledge of the field as a whole is what qualifies you to have a doctorate. That's why it takes as long as it does, and that's part of why only a small percentage of the population pursues (and completes) a PhD in any discipline.",
                      "author": "synthesis-synthesis",
                      "created": 1598573611,
                      "upvotes": 1,
                      "replies": {
                        "g351spw": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g351spw/",
                          "text": "Makes sense.",
                          "author": "charlieirvine",
                          "created": 1598626561,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g313kg1": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g313kg1/",
              "text": "I'd love to see more answers speaking to this!",
              "author": "charlieirvine",
              "created": 1598541724,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g2zoiac": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zoiac/",
      "text": "I’m defending my PhD tomorrow, so this is a super fun thread to be reading right now 😂",
      "author": null,
      "created": 1598502912,
      "upvotes": 102,
      "replies": {
        "g2zwxjc": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zwxjc/",
          "text": "[deleted]",
          "author": null,
          "created": 1598509420,
          "upvotes": 22,
          "replies": {
            "g2zyrg7": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zyrg7/",
              "text": "[deleted]",
              "author": null,
              "created": 1598511052,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "g2zrfvw": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zrfvw/",
          "text": "You will do great!",
          "author": "SalishShore",
          "created": 1598505023,
          "upvotes": 8,
          "replies": {}
        },
        "g2zs15n": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zs15n/",
          "text": "Good luck!! I'm sure you'll kill it",
          "author": "Greatbigdog69",
          "created": 1598505462,
          "upvotes": 3,
          "replies": {}
        },
        "g2zsmkn": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zsmkn/",
          "text": "You got this!",
          "author": "drarch",
          "created": 1598505903,
          "upvotes": 7,
          "replies": {}
        },
        "g31f1dn": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31f1dn/",
          "text": "As a third year PhD student who’s ready to throw in the towel, this is exactly what I need to be reading 🙄\n\nAnd good luck tomorrow!",
          "author": "sexy_bellsprout",
          "created": 1598547118,
          "upvotes": 3,
          "replies": {}
        },
        "g30b7bs": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30b7bs/",
          "text": "Believe in yourself! You'll do very well.",
          "author": "goingtocalifornia_",
          "created": 1598523447,
          "upvotes": 3,
          "replies": {}
        },
        "g35gxzp": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g35gxzp/",
          "text": "update: passed!",
          "author": null,
          "created": 1598633869,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g2zerc5": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zerc5/",
      "text": "if you have a stable union job: stick with it.  you likely get paid more.",
      "author": "printandpolish",
      "created": 1598496845,
      "upvotes": 41,
      "replies": {
        "g304fhc": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g304fhc/",
          "text": "And likely have to work less to boot.",
          "author": "ShadowyPrecepts",
          "created": 1598516704,
          "upvotes": 11,
          "replies": {}
        },
        "g313qtc": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g313qtc/",
          "text": "I will. I'd like to balance it with school related things of course. Pay isn't as important to me right now but I know, not everyone will agree!",
          "author": "charlieirvine",
          "created": 1598541808,
          "upvotes": 2,
          "replies": {
            "g31874d": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31874d/",
              "text": "Wait what? You want to do a PhD while working full time, and become a professor? I'm sorry but that's not going to work, your output is directly proportional to the time you put in, no way you can surpass even your classmates. Just stick to your job, unless you're doing this for intellectual satisfaction, and you'd do this even if you wouldn't get a professor position. Getting a TT position is difficult when you go all in; if you're doing it halfheartedly I really don't think it would work, and unless you produce world-class research I would also look unfavorably on you and not take you on as my student.",
              "author": "iwantabrother",
              "created": 1598543935,
              "upvotes": 5,
              "replies": {
                "g31ixsn": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31ixsn/",
                  "text": "I don't know what my life will be like when I'm doing a Phd. I'm only in undergrad right now and I have to work to pay my way through. I don't work full time, I work part time and even that is quite flexible.\n\nOn a side note, why would you look unfavorably on someone who has to work? You can have your whole heart in something and still need to pay to live, eat and have a place to sleep. Is being a professor only for the elite classes? Some people have very real situations that require them to work and go to school. That is not elitist, that is classism from this angle.",
                  "author": "charlieirvine",
                  "created": 1598548917,
                  "upvotes": 2,
                  "replies": {
                    "g31k3qc": {
                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31k3qc/",
                      "text": "No, I expect my students to work full time on the projects. Even then most of them will fail to get a position in academia. I think it's a waste of time for both of us if I know that they'll write a thesis then leave. If you work half the time, your output is half as much, and no way you can get a job with that. That being said, my students are guaranteed an income (enough to survive).",
                      "author": "iwantabrother",
                      "created": 1598549455,
                      "upvotes": 2,
                      "replies": {
                        "g31rctm": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31rctm/",
                          "text": "> I think it's a waste of time for both of us if I know that they'll write a thesis then leave. \n\nBut you know there are so few faculty positions available...what do you expect them to do?",
                          "author": "stuffed_armchair",
                          "created": 1598552601,
                          "upvotes": 3,
                          "replies": {
                            "g31sxfv": {
                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31sxfv/",
                              "text": "Yes, it's hard. But taking on someone as a student knowing they have a chance is worth a lot more to me than taking on someone as a student knowing that they'll fail. I mean, in the end I have to write letters for them, and I cannot in my good conscience write a wholehearted letter of support for someone who worked half as hard as the others (besides the quality of their work generally will attest to this). In an ideal world, someone who works their butt off and also has a side job to support themselves exists, but I've never seen it work out.",
                              "author": "iwantabrother",
                              "created": 1598553165,
                              "upvotes": 1,
                              "replies": {
                                "g31ytt6": {
                                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31ytt6/",
                                  "text": "If you’re giving them full funding, I don’t see why they can’t fully commit. I guess it also depends on what amount you think is enough for survival.",
                                  "author": "throwawayjp2025",
                                  "created": 1598555825,
                                  "upvotes": 2,
                                  "replies": {}
                                },
                                "g31zex8": {
                                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31zex8/",
                                  "text": "It’s almost like this is purposely difficult. But I’m nobody, I don’t know academia and I don’t know what it’s like to work in the field.",
                                  "author": "throwawayjp2025",
                                  "created": 1598556092,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "g31z2xv": {
                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31z2xv/",
                              "text": "My point",
                              "author": "throwawayjp2025",
                              "created": 1598555940,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "g31z1y6": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31z1y6/",
                          "text": "So you want your students to commit 100%, with the possibility of failure and not getting a good job afterward? \n\nI see your perspective, esp if you’re funding them. I also see why that might be scary!",
                          "author": "throwawayjp2025",
                          "created": 1598555928,
                          "upvotes": 3,
                          "replies": {
                            "g31zltl": {
                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31zltl/",
                              "text": "Yeah but if you're not committing 100% you'll definitely fail. So I feel like if you don't have the passion and the confidence to do this, academia isn't for you. For those that don't make it in academia (and those that I know work hard, I have enough contact in the industry to connect them, but I wouldn't risk my reputation recommending someone who was only half as genuine in the academics)",
                              "author": "iwantabrother",
                              "created": 1598556179,
                              "upvotes": 2,
                              "replies": {
                                "g31zwti": {
                                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31zwti/",
                                  "text": "Right. Now this is making sense to me. So you’ll push someone where you think they will fit best, academia or industry. \n\nI can handle that. You are where you are for a reason and I’d trust my supervisors judgement with that. Well, I have had some great professors and people whose judgement I trust.",
                                  "author": "throwawayjp2025",
                                  "created": 1598556319,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g2z4esk": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2z4esk/",
      "text": "[deleted]",
      "author": null,
      "created": 1598491084,
      "upvotes": 54,
      "replies": {
        "g30lgvo": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30lgvo/",
          "text": "Are you saying 97% of Ph.D. Students get nothing? Like no job?",
          "author": "kakeman69",
          "created": 1598532010,
          "upvotes": 8,
          "replies": {
            "g30p6x2": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30p6x2/",
              "text": "I'm from a top school, like top 5 in any university ranking in the world. About 50% of my classmates landed tenure-track jobs, and not all of them even in recognized universities. It varies by discipline but on top of being good you need so much luck.",
              "author": "iwantabrother",
              "created": 1598534296,
              "upvotes": 13,
              "replies": {
                "g30rkyl": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30rkyl/",
                  "text": "Did all of them even want a TT job? I'm my program it seems like less than half if people are even interested in pursuing professorships.",
                  "author": "Beor_The_Old",
                  "created": 1598535641,
                  "upvotes": 5,
                  "replies": {
                    "g30rp1b": {
                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30rp1b/",
                      "text": "Yes, in my field TT jobs are more or less the holy Grail. Some people left but very few, many are still postdocs or adjuncts",
                      "author": "iwantabrother",
                      "created": 1598535704,
                      "upvotes": 5,
                      "replies": {
                        "g30rram": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30rram/",
                          "text": "Humanities?",
                          "author": "Beor_The_Old",
                          "created": 1598535739,
                          "upvotes": 1,
                          "replies": {
                            "g30rumf": {
                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30rumf/",
                              "text": "No but that's even worse",
                              "author": "iwantabrother",
                              "created": 1598535790,
                              "upvotes": 2,
                              "replies": {
                                "g30rwli": {
                                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30rwli/",
                                  "text": "Well congrats on making it to TT.",
                                  "author": "Beor_The_Old",
                                  "created": 1598535820,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g313vaj": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g313vaj/",
                  "text": "This is disheartening to me to a degree",
                  "author": "charlieirvine",
                  "created": 1598541869,
                  "upvotes": 1,
                  "replies": {
                    "g315bcp": {
                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g315bcp/",
                      "text": "It sucks to say this but academia is a young person's sport. In your early 20s I think it's ok to go for a PhD since everyone else is also just looking for their place in the world. When you're young, having a PhD usually gets you ahead a little bit in the real world too, people can hire you at a slightly higher level than the others without a PhD so it's not a complete waste of time even if you fail.\n\nIn contrast, people in their mid 30s will mostly have stable jobs and they'll have advanced enough in rank in their jobs, so you're looking at 5-6 years of living below poverty line while watching all your friends climb up in the society. Then it's not even guaranteed that you'll be a professor, and even a PhD is not enough to offset nearly a decade of experience that your non-phd friends have racked up in the real world, should you get a real job afterwards. Your managers will be 10 years younger than you and without a PhD, your friends will be even higher up, and I've seen some of my friends struggle with their pride because of this very reason.\n\nOf course, you *could* become a professor, but professor salaries aren't THAT high, and you may not have enough time to be eligible for a full pension. I just feel like you're taking a huge gamble with your life. I really hate seeing grad students in their 30s, it really pains me to think about the things they'll have to deal with in academia. I realize that it's your life and ultimately you'll make your own decisions, but if you were my younger brother, I'd try to really talk you out of it with lots of love.",
                      "author": "iwantabrother",
                      "created": 1598542568,
                      "upvotes": 4,
                      "replies": {
                        "g31jse5": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31jse5/",
                          "text": "Ok, talk me out of it with lots of love?\n\n&#x200B;\n\n1. 5-6 years of living below poverty line\n2. watching my friends climb social ladders\n3. Not enough experience in the real world like peers\n4. Managers will be 10 years younger\n5. Issues with pride\n\n\\#1 I don't see this being an issue for me. What's wrong with pursuing your goals and living with a little less money?\n\n\\#2 I don't see this being an issue for me. I don't think my friends are going  to be climbing social ladders. Most of my friends aren't university students to begin with. I have friends in university who give me advice when I contact them but my personal support group aren't these people for this reason. Gives me less to think about. I'm not interested in games of ego. I know it happens.\n\n\\#3 What experiences are you referring too? working? a job in their field?\n\n\\#4 What's wrong with that? I know some older people don't like to listen to people younger, can't change, etc. But again, I enjoy the young people I go to school and work with. They teach me a lot, I'm not there to make friends, I'm there to learn and build a craft.\n\n\\#5 This is something I'd have to wait and see and experience I think.",
                          "author": "charlieirvine",
                          "created": 1598549307,
                          "upvotes": 1,
                          "replies": {
                            "g31krwm": {
                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31krwm/",
                              "text": "Well I already see a lot of pride in what you're writing :) trust me, when you have a PhD and someone who knows a lot less is bossing you around, lots of people lose their cool (and the way you're fighting with me making lists, you will fight with your managers).\n\nYou say that an income below the poverty line is ok now, but at age 30 a lot of people are just starting out and living like that. Things start to get complicated when you have a family... You meet family of your kids and realize that your kid is poor (or your kid does etc.)\n\nAnyway, you're not my brother, and if you can't face the reality with the 100+ comments given here, it's your life and I'm not stopping you. After all, I see so many of them every day already in my department and in my field. I can live with another one making this decision (so long as it's not my 30-year-old brother).",
                              "author": "iwantabrother",
                              "created": 1598549768,
                              "upvotes": 2,
                              "replies": {
                                "g31mh1t": {
                                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31mh1t/",
                                  "text": "That is interesting. I don't know enough about how I feel about pride or my relationship with my pride to respond!\n\nI don't really see myself as fighting you, I want you to challenge me, and I want to see if I can meet that challenge. It's possible I can't. It's more important for me to know whether what you're saying actually applies to me or not than to be right. You have experience but that doesn't mean all of it will be helpful to me based on who I am, or so I think!\n\nOh I see, so you were thinking about family situations? Gotcha, no, I'm not interested in that jazz.\n\nI don't know what the reality is, I'm trying to find out. Thank you for your response.",
                                  "author": "charlieirvine",
                                  "created": 1598550520,
                                  "upvotes": 3,
                                  "replies": {
                                    "g31n5sq": {
                                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31n5sq/",
                                      "text": "Good luck with the decision! Just remember that you're committing the next decade of your life. You responded to a lot of my comments with \"oh that's not me\" \"my friends are not like that\" but a decade is a really long time, and people, their perspectives, and their priorities change. I also used to idealize the poor scholar stereotype, devoting one's life in their work thing, but now I sometimes get pissed watching my friends make 500k salary and doubt my choices. I think you'll be worse because you're older.\n\nFighting was perhaps a poor word choice, but you get my gist.",
                                      "author": "iwantabrother",
                                      "created": 1598550772,
                                      "upvotes": 1,
                                      "replies": {
                                        "g31tbcz": {
                                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31tbcz/",
                                          "text": "I'm sorry that you get pissed like that. I already watch my friends go out and enjoy lots of things without me. Albeit without the money you're talking about. I feel like I'm missing out but not to the point of being pissed just yet.\n\nIt's a very real possibility it will get to me. I don't know how I will navigate that just yet. It hasn't started to bother me.\n\nI like your point about priorities and how that may change. Yes, thanks. This is an excellent point and the best point I think you have made. I have nieces and I can understand how at this age, priorities can change. (And probably more so later in life) People are getting married, getting houses and having children. It has crossed my mind.\n\nIf this place is a place to be candid, I won't have children and I'm not ready for any long term commitments relationship wise. I've tried, they weren't things I couldn't do I just don't want them, and not just because I want to go to school. I think my parents have more of a problem with that than I do.\n\nI do think the thing that might bother me is money. Money bothers me sometimes.",
                                          "author": "charlieirvine",
                                          "created": 1598553334,
                                          "upvotes": 1,
                                          "replies": {
                                            "g31u9rn": {
                                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31u9rn/",
                                              "text": "I mean, don't get me wrong, I love my job and my 500k salary friends regularly try to recruit me and I turn them down. Being a professor is great! It's just that getting here is getting harder and harder.\n\nIn fact all the points that I made relates to you changing over the decade... Even without children, you're also putting your loved one through your journey in academia, if you end up with one. They talk about military spouses; academic spouses are much the same in that they pack up and leave with their academic partner. You'll be asking for so much sacrifice from them, and many of my colleagues end up divorced (see other comments, I think others must have commented on it).\n\nIf money bothers you now, it'll bother you more later. When I was a grad student, after rent I had about $400/mo left from my stipend and I was absolutely happy still to be in school. I think money was always lacking until I became TT, for 9 years total. Combine that with your priorities changing, and you maybe get the picture.",
                                              "author": "iwantabrother",
                                              "created": 1598553754,
                                              "upvotes": 1,
                                              "replies": {
                                                "g321jaq": {
                                                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g321jaq/",
                                                  "text": "I understand. It's really more than just an uphill battle. It's a steep slope. \n\n\" you're also putting your loved one through your journey in academia, if you end up with one. They talk about military spouses; academic spouses are much the same in that they pack up and leave with their academic partner. You'll be asking for so much sacrifice from them, and many of my colleagues end up divorced\"\n\nThis makes a lot of sense to me. And I understand how priorities can start to be a problem with reference to these things. Thanks, I'm starting to understand.",
                                                  "author": "charlieirvine",
                                                  "created": 1598557048,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "g31qxsi": {
                                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31qxsi/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1598552406,
                                      "upvotes": 1,
                                      "replies": {
                                        "g31s5kn": {
                                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31s5kn/",
                                          "text": "I'm having a hard time understanding, mainly because I just can't see these points being true for me. I'm not 40, I can't really think like one!\n\nIt's also really hard to penetrate my thought patterns considering getting a Phd is something I do really want to pursue. Many things really.",
                                          "author": "charlieirvine",
                                          "created": 1598552876,
                                          "upvotes": 1,
                                          "replies": {
                                            "g324t5c": {
                                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g324t5c/",
                                              "text": "[deleted]",
                                              "author": null,
                                              "created": 1598558527,
                                              "upvotes": 1,
                                              "replies": {
                                                "g3254vx": {
                                                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3254vx/",
                                                  "text": "Lol. Why phrase it that way? I don't understand because I don't understand, there is nothing behind that. I've been more candid in other replies if you want to go find them.",
                                                  "author": "charlieirvine",
                                                  "created": 1598558675,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g2z65x6": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2z65x6/",
      "text": "Don't do it. It's more likely you won't make it. An adjunct teaching loads of 101 sections for peanuts? Sure. But a professor like you probably picture yourself? You probably won't make the cut. And this is not because you'll be bad or underprepared for the job. You might be prepared by the job market is simply crap. I'm extremely lucky that i got my job when i did, because two years ago the market was really bad already. \n\nNow, if you decide to go ahead and try (believe me, I understand why you would), prepare to be the best. The very best. Publish. Teach. Earn awards. Publish more. Present at every conference. Network the hell out of it. Meet people. And do it all again until you graduate. Understand what a good cv in your field looks like and get it. Dont graduate from a meh school. Go big. Top school. \nGood luck.",
      "author": "phenomenologist83",
      "created": 1598492029,
      "upvotes": 82,
      "replies": {
        "g2zba54": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zba54/",
          "text": "So you do have to be at top universities yes? Because this is not the same as understanding what a good CV in your field looks like.",
          "author": "throwawayjp2025",
          "created": 1598494854,
          "upvotes": 19,
          "replies": {
            "g2zbfwa": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zbfwa/",
              "text": "To have a chance at the job market, yes.",
              "author": "phenomenologist83",
              "created": 1598494944,
              "upvotes": 26,
              "replies": {
                "g2zbt8v": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zbt8v/",
                  "text": "This is a lot of pressure. I can see myself getting a masters at a mediocre school and then possibly a top school for a PHD.",
                  "author": "throwawayjp2025",
                  "created": 1598495154,
                  "upvotes": 13,
                  "replies": {
                    "g2zc6r4": {
                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zc6r4/",
                      "text": "That's all academia is: a lot of pressure. I promise you that. It only gets worse as you advance.",
                      "author": "phenomenologist83",
                      "created": 1598495370,
                      "upvotes": 39,
                      "replies": {}
                    },
                    "g304bri": {
                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g304bri/",
                      "text": "Good R1 for both MSc and PhD here. Now doubling as a post doc and researcher tied to an emerging technology I’ve been a part of developing. Still at a ‘good’ institution.  I’ve dreamt of a professorate for my entire adult life - but the back biting, petty politics and incredibly touchy egos out there (becoming enemies over name positioning in acknowledgements in newspaper articles and the like) has me questioning the wisdom of it. The last few years several professorships have opened in schools I have network connections at - the openings arrived due to the professors holding them committing suicide. Something you’d not know about without the network connections of course. Universities hardly advertise such. \n\nI’m not sure if it’s worth it now. Being at the top is costly af. Pardon my French.",
                      "author": "ShadowyPrecepts",
                      "created": 1598516600,
                      "upvotes": 12,
                      "replies": {
                        "g3058rk": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3058rk/",
                          "text": "Yeah. I had great colleagues at PhD and postdoc level. Open-minded and honest scientists. Unfortunately faculty level jobs seem to have a selection bias for nastiness. I start to question if I want to have such people as colleagues.",
                          "author": "radionul",
                          "created": 1598517477,
                          "upvotes": 3,
                          "replies": {
                            "g32zkak": {
                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g32zkak/",
                              "text": "For nastiness? I'm sorry  you had such an awful experience that you think we are all nasty. I promise, most of us aren't even close to nasty. But hey, don't worry, you won't have us as colleagues anyway because there are no jobs. So, you're good.",
                              "author": "phenomenologist83",
                              "created": 1598574011,
                              "upvotes": 0,
                              "replies": {
                                "g340akx": {
                                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g340akx/",
                                  "text": "QED",
                                  "author": "radionul",
                                  "created": 1598597236,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "g313yzl": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g313yzl/",
                          "text": "I've heard that suicides are not uncommon. In undergrads as well.",
                          "author": "charlieirvine",
                          "created": 1598541918,
                          "upvotes": 0,
                          "replies": {}
                        },
                        "g3142gt": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3142gt/",
                          "text": "Also, I have to say I think pettiness is in any institution, there is always a hierarchy and the same politics are present in any system where hierarchy exists. Maybe the form changes but the overall game is the same. In my opinion.",
                          "author": "charlieirvine",
                          "created": 1598541965,
                          "upvotes": -2,
                          "replies": {
                            "g31sa5k": {
                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31sa5k/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1598552933,
                              "upvotes": 2,
                              "replies": {
                                "g322m4o": {
                                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g322m4o/",
                                  "text": "Sorry if my comment there sounds naive. I guess I just don't have the experience or exposure!",
                                  "author": "charlieirvine",
                                  "created": 1598557540,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "g31546q": {
                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31546q/",
                              "text": "Maybe. I don’t know, this isn’t what I research. At all. From what I know psychological issues are more common in academia than elsewhere though. At least at a PhD level. Beyond that all I have is anecdotal. Speaking of - from my contacts in industry it seems rather different. Not that anecdotes make for good evidence- or even a convincing argument. Still, as we so far operate primarily on that level we might as well speculate; if there is a difference where academia comes out on the unhealthy side it would not seem entirely implausible to me that the extreme competitiveness may serve to select for certain character traits - not all of them good. That said I’ll of course bow to any good published research on the subject.",
                              "author": "ShadowyPrecepts",
                              "created": 1598542473,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "g3053fg": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3053fg/",
              "text": "The top universities publish total trash in my field. Statistical noise being interpreted as signal, that kind of stuff. If I want permanent job, then I have to also publish similar ignorant stuff. It's a bit worrying...",
              "author": "radionul",
              "created": 1598517342,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g30bgg3": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30bgg3/",
      "text": "[deleted]",
      "author": null,
      "created": 1598523699,
      "upvotes": 21,
      "replies": {
        "g31442v": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31442v/",
          "text": "Thanks for that.",
          "author": "charlieirvine",
          "created": 1598541987,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g30fjb9": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30fjb9/",
      "text": "Academic jobs are about who you know not what you know. Make sure you meet people and make friends with people. It’ll go a long way. A job will come up and they will get 200 apps and Rose will say, do you remember Jane? And Tom will say Jane? And Rose will say yes Jane, the researcher who talked about aesthetics in protofuturistic art at the conference last November. Ah Jane Tom will say. And Rose will say, yes I was talking to her at the buffet after and she teaches intro to art history and she has done undergrad thesis supervision and she was lovely - did she apply? Robert - did Jane apply? Yes, Robert will say after checking. She applied. Ok, Rose will say. Let’s look to hiring her. Great Tom will say. Well that’s decided, Jane will say. Robert - make sure she is on the interviewee list. Will do, Robert will say.\n\nThat’s how many hires work. People want to work with nice people.",
      "author": "reversechinlock",
      "created": 1598527526,
      "upvotes": 13,
      "replies": {
        "g3146o5": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3146o5/",
          "text": "Networking is key, I know, I've heard. This is so hard to work around and difficult to digest and accept.",
          "author": "charlieirvine",
          "created": 1598542022,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g30it1b": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30it1b/",
      "text": "I just think \"I want to become a professor\" is the wrong starting point. What is it that you really want? If you want some fancy title there are easier ways to do it. You should reflect on the things you actually want out of life, and at various stages of your development you should make choices based on those. Doing a PhD can be a stepping stone to several different career paths that will give you lots of the same things being a professor would.",
      "author": "l_lecrup",
      "created": 1598530160,
      "upvotes": 11,
      "replies": {
        "g314clq": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g314clq/",
          "text": "[deleted]",
          "author": null,
          "created": 1598542104,
          "upvotes": 2,
          "replies": {
            "g318ixw": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g318ixw/",
              "text": "I am mainly interested in graphs and related discrete objects. But I also study various things in economics and theoretical computer science (mainly those with a graph theoretical flavour).",
              "author": "l_lecrup",
              "created": 1598544087,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g35xtxy": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g35xtxy/",
          "text": "[deleted]",
          "author": null,
          "created": 1598641841,
          "upvotes": 2,
          "replies": {
            "g3hmmgr": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3hmmgr/",
              "text": "I think even that goal is not stated correctly. What is it that teaching college students would give you that you want? There's probably a list: continuing a connection to your subject, nurturing the next generation, having a stable job or what have you. Now, it might well be that professor is the only career that ticks all your personal boxes, or the only one that ticks your boxes without ticking any of the boxes in some \"con\" list. But I strongly doubt it.\n\nThe point is that each career has attributes, some of which you like and some of which you don't. Even if it turns out that a particular career is the only one that has the right attributes for you, it is still worth reflecting on what the right attributes are. It will help you appreciate the jobs you do have, and recognise when it's time to move on. It will also help you avoid building your sense of self around your career path (which, trust me, is a very bad state of affairs). What you want and need from a job will change over the course of your life. If you don't reflect on what you want and need now, you will not notice those changes until it is too late.",
              "author": "l_lecrup",
              "created": 1598893886,
              "upvotes": 1,
              "replies": {
                "g3hn9r2": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3hn9r2/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1598894130,
                  "upvotes": 1,
                  "replies": {
                    "g3i2c0b": {
                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3i2c0b/",
                      "text": "I wish I could articulate it a little better. A mentor of mine asked me about my career plans once and I described a typical academic career path, to which he replied \"no, what do you \\*really\\* want?\"\n\nThere was some socratic-ish dialogue back and forth and I realised that I hadn't been thinking about it in the right way. I still think being a professor is my best shot at what I want, but for me being a musician would be an alternative, for example.",
                      "author": "l_lecrup",
                      "created": 1598899852,
                      "upvotes": 2,
                      "replies": {
                        "g3i2nhs": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3i2nhs/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1598899970,
                          "upvotes": 1,
                          "replies": {
                            "g3i38uv": {
                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3i38uv/",
                              "text": "I came fairly close to joining the data science department of a big tech company. I think there's a chance that could be fairly close, but I spent a year in the company as an analyst on the ground floor and I don't know if the corporate lifestyle suits me, even if I was in a more techy part of it (actually it might well be worse). But R&D in general involves quite a lot of learning, at least at the beginning.",
                              "author": "l_lecrup",
                              "created": 1598900193,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g314b9c": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g314b9c/",
          "text": "Thank you. This was short but very much needed to hear it. I want a Phd to learn, to delve into an academic passion deeply, I'd ideally like to do research but I know the winds will likely blow me many places before and if ever I get the chance to do that. Hopefully it is something I enjoy.",
          "author": "charlieirvine",
          "created": 1598542086,
          "upvotes": 1,
          "replies": {
            "g3194jm": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3194jm/",
              "text": "Those are good reasons! You have all sorts of opportunities ahead of you and you should keep your eyes open to them. That's the good news. The bad news is that the way things are going becoming (and being) a professor might be extremely difficult over the next decade or so.",
              "author": "l_lecrup",
              "created": 1598544372,
              "upvotes": 1,
              "replies": {
                "g31ihzn": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31ihzn/",
                  "text": "Thank you for your honesty!",
                  "author": "charlieirvine",
                  "created": 1598548716,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g32si7c": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g32si7c/",
          "text": "[deleted]",
          "author": null,
          "created": 1598570157,
          "upvotes": 1,
          "replies": {
            "g33zcsd": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g33zcsd/",
              "text": "I didn't say that being an academic will help in a specific career path, and I don't think that's true at all.\n\nIn fact, precisely my point is that going into academia isn't really a good idea for everyone. For example, being a Data scientist can bring you a lot of the things that being a professor might. But you don't actually need a PhD for that. And even if you did have a PhD the chance that your specific publication history is relevant is absolutely zero.\n\nEDIT: I said \"can be\" a stepping stone. But my broader point is that people tend to get onto fixed paths because they don't think about their career in the right way in my opinion. You need to figure out what you really want from life and make choices based on that reflection. \\*Not\\* doing a PhD is a valid choice. Actually I think a lot of people would be better off not doing a degree at all.",
              "author": "l_lecrup",
              "created": 1598596405,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g2zg77p": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zg77p/",
      "text": "So I agree with others that there are a lot of reasons why getting a PhD with the goal of being a professor is a bad idea. (Though I don't think your age is one of them - I know many successful PhD students in their thirties.)\n\nBut I think that if you want it enough, and you're realistic about having other options post-PhD if you don't find an academic job, then you should go for it.  But make sure you think about your reasons for wanting it, because there are certainly a lot of bad ones. :)  (I recently did a thing about this:  [Should you get a Phd?](https://youtu.be/p4QiJNPSdWs))",
      "author": "cfiesler",
      "created": 1598497685,
      "upvotes": 29,
      "replies": {
        "g2zlnzg": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zlnzg/",
          "text": "Thank you for posting this. I'm going to read your post. I want to pursue a Phd because I want to do specialized research in a topic i really enjoy. I want to learn, I want high level on a topic I really love. \n\nWanting to be a professor is because I was inspired by my professor, but my first goal is to learn.",
          "author": "charlieirvine",
          "created": 1598501028,
          "upvotes": 16,
          "replies": {
            "g2zq472": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zq472/",
              "text": "Please keep in mind that a lot of times PhD students end up working on a project that is not exactly what they wanted to pursue. A lot of it depends on what kind of funding your PhD supervisor has and whether they are someone who genuinely cares about their student’s interests. A lot of PIs only care for publications (coz the system promotes “publish or perish” sadly). You may be able to pursue a project of your interest if you get your own funding (a highly competitive thing).\n\nI would say if you want specialised knowledge and research experience, you could get it with a masters degree too. You don’t have to necessarily do a PhD. However I don’t know whether a PhD is a requirement for becoming a professor in Canada or not.",
              "author": "saltyPeppers47",
              "created": 1598504045,
              "upvotes": 16,
              "replies": {
                "g3065lz": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3065lz/",
                  "text": "Adjunct professors actually don't have it as bad in Canada, at least at my school. $8000 per class is the going rate. Teach 3-4 classes per semester, even with summers off and your doing okay, albeit your not living lavishly.\n\nEdit: you don't need a PhD to adjunct.",
                  "author": "Marxvsfreidman",
                  "created": 1598518305,
                  "upvotes": 14,
                  "replies": {
                    "g314cjd": {
                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g314cjd/",
                      "text": "Nice to know.",
                      "author": "charlieirvine",
                      "created": 1598542103,
                      "upvotes": 1,
                      "replies": {
                        "g32x6j3": {
                          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g32x6j3/",
                          "text": "There are even \"continuing\" lecturers in Canada if you've been rocking teaching for a while (basically, tenured teaching-track).\n\nTo figure out if you will get a lecturer position, ask yourself: in your master's degree, were you the favourite TA? Does the whole department love you? Are they happy to just be around you? (I'm serious.) Can you pick up admin work on the side and do it well without fail? Do you add diversity to the department? If the answer to ALL these questions is yes, congratulations, you might have a shot. But don't count on it. And if you meet all the criteria, you might not even need a PhD.",
                          "author": "uniadminthrowaway",
                          "created": 1598572714,
                          "upvotes": 2,
                          "replies": {
                            "g3528kq": {
                              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3528kq/",
                              "text": "This is an interesting barometer of capability, I'll keep it in mind!",
                              "author": "charlieirvine",
                              "created": 1598626784,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g30jwms": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30jwms/",
                  "text": "Note that this the part about funding/PI is only true if the OP is in a STEM field.  (They might have specified elsewhere in the thread, I just didn't catch it!)  In a lot of humanities disciplines, it's common to not even have an advisor for a couple of years and often your research is unconnected to what an advisor does beyond general area expertise.",
                  "author": "cfiesler",
                  "created": 1598530955,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "g32damx": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g32damx/",
              "text": "I think you need to be more focused on producing research and getting published and making a significant contribution to your field if you want to do a PhD. The publish or perish advice is very true.",
              "author": "CovidBlueLight",
              "created": 1598562498,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g2zm692": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zm692/",
          "text": "I'm going to subscribe!",
          "author": "charlieirvine",
          "created": 1598501355,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "g30jym3": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30jym3/",
      "text": "That stable unionized job sounds pretty good to me considering academic working conditions!\n\nI went to a top program (Berkeley) in the 00s when the market was better and of the 11 people in my entering PhD class, only four of us are still practicing academics. Some did not complete the program and others never got jobs. There were really smart people among those who didn't \"make it\" and there is a lot of luck involved in getting a tenure-track job.",
      "author": "raspberry-squirrel",
      "created": 1598530993,
      "upvotes": 6,
      "replies": {
        "g32djxd": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g32djxd/",
          "text": "Did they opt out because they didn't want to do academia anymore? Or did they decide to pursue career paths that were more suited for them? Did they want to continue into professorship after their PhD? (Sorry, I am just asking. When I first entered my Master's, I wrongfully assumed that everyone wanted a PhD, and now I realize that is not the case at all.)",
          "author": "CovidBlueLight",
          "created": 1598562624,
          "upvotes": 1,
          "replies": {
            "g332zwy": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g332zwy/",
              "text": "One failed the master’s exam, one failed PhD exams, one never wrote the dissertation, two got married and had kids (and took other jobs or adjuncted), one teaches high school and one has a corporate job now. These were choices in a way, but starting out everyone wanted to be a professor.",
              "author": "raspberry-squirrel",
              "created": 1598575831,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g2zj9d0": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zj9d0/",
      "text": "What field(s) are you looking into? This will make a huge difference. It is true that a field like Sociology is incredibly competitive and may not be worth it. However, related business fields, like Marketing or Management are much less competitive and in need of new PhDs. Also, those fields pay quite well. Here is Marketing, for example: https://www.ama.org/wp-content/uploads/2019/09/Who-Went-Where-2019.pdf\n\nThink a bit more about what you want to research. Also, take a deeper dive into the job market for the fields you are considering. Good luck!",
      "author": "NomNom_LobsterRoll",
      "created": 1598499536,
      "upvotes": 12,
      "replies": {
        "g2zl4ot": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zl4ot/",
          "text": "[deleted]",
          "author": null,
          "created": 1598500692,
          "upvotes": 10,
          "replies": {
            "g2zm07b": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zm07b/",
              "text": "Yes I’ve heard that about nursing as well!",
              "author": "NomNom_LobsterRoll",
              "created": 1598501245,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g2zm0hy": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zm0hy/",
          "text": "I want to go into social psychology and I want to either do research on gender or stress.\n\nI'll see what I can do about checking out the job market\n\nThank you.",
          "author": "charlieirvine",
          "created": 1598501250,
          "upvotes": 5,
          "replies": {
            "g2zqkpq": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zqkpq/",
              "text": "Social psych and gender specialties are both interdisciplinary, which opens your options for PhD programs but also makes the job market even harder. Gender studies departments are pretty notorious for getting hundreds of applications for one job, from people in a wide range of disciplines. Social psych tends to be a little different. Those jobs are either housed in soc or psych departments, so they'll probably prefer someone whose PhD is in their discipline. The social sciences job market isn't as bad as humanities but not as good as business, so most of the warnings you've heard still hold.",
              "author": "tritonetelephone",
              "created": 1598504383,
              "upvotes": 9,
              "replies": {
                "g314foa": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g314foa/",
                  "text": "Bittersweet warning. Thank you.",
                  "author": "charlieirvine",
                  "created": 1598542147,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "g30npj8": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30npj8/",
              "text": "Study that in a business school and you’ll have a job. Don’t do it in social psych.",
              "author": "ThatProfessor3301",
              "created": 1598533415,
              "upvotes": 3,
              "replies": {}
            },
            "g332ymi": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g332ymi/",
              "text": "Have you thought about studying gender/stress related issues using social psych methodology but within a business school? The research done in marketing/management departments uses the same methodology of the research done in social psych department - it’s basically the same stuff apart from the business / workplace spin. Job prospects are much better.",
              "author": "specific_account_",
              "created": 1598575813,
              "upvotes": 2,
              "replies": {
                "g351r3a": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g351r3a/",
                  "text": "What kind of schools are you thinking? Do you mind giving me an example?\n\nI had a professor mention this to me once.",
                  "author": "charlieirvine",
                  "created": 1598626538,
                  "upvotes": 2,
                  "replies": {
                    "g36tj4p": {
                      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g36tj4p/",
                      "text": "I am thinking about Business Schools, the ones that grant MBAs. The work done in Business Schools' marketing and management departments is virtually indistinguishable from the work done in a Social Psychology department (in particular for management.)",
                      "author": "specific_account_",
                      "created": 1598657739,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g307ewo": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g307ewo/",
      "text": "When I have kids I will make sure they dont enter this profession.",
      "author": "GabhaNua",
      "created": 1598519489,
      "upvotes": 7,
      "replies": {}
    },
    "g30c5zs": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30c5zs/",
      "text": "I am in my thirties and currently doing a PhD with the goal of becoming a professor one day. I turned down several industry job offers for this, as I really wanted to be in academia. I specialise in a very narrow sub-field that is currently getting a lot of attention and funding. I naively thought this would almost guarantee me a faculty position. I no longer think so. I love teaching, so I’ll probably continue working for peanuts without any security for the rest of my life. [Edit: a word]",
      "author": "liiac",
      "created": 1598524398,
      "upvotes": 4,
      "replies": {
        "g314k17": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g314k17/",
          "text": "Took time to figure out, but hey look at you, making the most of it, power to you!",
          "author": "charlieirvine",
          "created": 1598542204,
          "upvotes": 1,
          "replies": {
            "g328ov2": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g328ov2/",
              "text": "[deleted]",
              "author": null,
              "created": 1598560316,
              "upvotes": 0,
              "replies": {
                "g32cv4a": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g32cv4a/",
                  "text": "lol. but why",
                  "author": "charlieirvine",
                  "created": 1598562290,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g30lwrn": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30lwrn/",
      "text": "Oops I recently started my PhD program with the mindset of wanting to teach biology at the collegiate level as the end goal -- now I'm doubting myself. Reading this thread has been... disheartening to say the least. I know that I'm getting my PhD in a COVID-19 world, and I will be looking for the next thing in a (hopefully) post COVID-19 world. It sounds like I'll have to pivot what my dreams are in order to land something that's fulfilling but also will allow for me to afford rent. Maybe I'll have to work in industry for a while.",
      "author": "ankokukiraa",
      "created": 1598532291,
      "upvotes": 3,
      "replies": {
        "g314p8u": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g314p8u/",
          "text": "I find it difficult to keep up with the trends in my field. I still haven't figured out how to do it. Maybe this is worth another post.\n\nI wish you all the best.",
          "author": "charlieirvine",
          "created": 1598542274,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g30mv2y": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30mv2y/",
      "text": "Get a graduate degree because you are invested in learning and writing/creating work about the topic. A professorship is a great goal, but it is just one egg in one basket. You can do a lot with the passion and intense study of your subject besides teach about it.",
      "author": "AdamMusing",
      "created": 1598532890,
      "upvotes": 3,
      "replies": {
        "g314r13": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g314r13/",
          "text": "Thank you.",
          "author": "charlieirvine",
          "created": 1598542298,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g30oyfb": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30oyfb/",
      "text": "Up to? In my university last year I think there were about 800 applications for a single position (I think one applicant commonly applies for like 30-100 jobs but that's still a pretty high rate of competition)",
      "author": "iwantabrother",
      "created": 1598534159,
      "upvotes": 4,
      "replies": {}
    },
    "g30z0qw": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g30z0qw/",
      "text": "I'm abd PhD and got a full time faculty position at a community college in Canada. Not a uni prof, but I work 8 months a year (paid for 12), great benefits, and started at 80k. If you are in social sciences, Canada is indigenizing  education, so a background in First Nations studies is an asset.",
      "author": "catncrunch",
      "created": 1598539499,
      "upvotes": 2,
      "replies": {
        "g314s7l": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g314s7l/",
          "text": "This was part of my plan!",
          "author": "charlieirvine",
          "created": 1598542313,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g31a9ph": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31a9ph/",
      "text": "[deleted]",
      "author": null,
      "created": 1598544904,
      "upvotes": 2,
      "replies": {
        "g31ie1z": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31ie1z/",
          "text": "Interesting response.",
          "author": "charlieirvine",
          "created": 1598548666,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g322jng": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g322jng/",
      "text": "The absolutely #1 piece of advice re: subfield is to choose one where there is an obvious, natural, and preferably better-paying non-academic alternative.  \n\nIt’s not just narrowness but also perceived value and scarcity. My field (industrial/organizational psychology) is small, only about 75 PhD programs in the US, but the starting salary for a PhD in industry is about 30% higher than the starting salary in academia.\n\nEnd result: more unfilled academic jobs.  More people leaving academia randomly for double or triple pay. \n\nNothing is a guarantee of course, and you still need a fair bit of luck, but this is light years from the experience of applying for a TT job with an English degree.  \n\nLast hiring committee I was on for an assistant prof, we had maybe 4 applications that actually met the job ad requirements, and only a total of maybe 35 complete apps.",
      "author": "rnlanders",
      "created": 1598557509,
      "upvotes": 2,
      "replies": {
        "g324j87": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g324j87/",
          "text": "If I may, what is the field like in health psychology or social psychology? Could you point me to where I can learn about demand there (if you don't mind)? ANd to learn more about this perceived value you talk about. \n\nAlso yes, ok, pick a sub field where there is an obvious, natural, and better paying non academic alternative!",
          "author": "charlieirvine",
          "created": 1598558405,
          "upvotes": 1,
          "replies": {
            "g3256za": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3256za/",
              "text": "In general, you'll be best off asking some young assistant professors within each of those disciplines for that info.  I will tell you what I know though.\n\nSocial has a mixed reputation job-wise. On one hand, basically ever psych dept in the world needs a social psychologist. On the other hand, that popularity means there is a huge number of PhD programs and hundreds if not thousands of new socials graduating with PhDs every year. My impression is that their job market is rough, closer to that 100s of apps per opening situation you described.\n\nHealth psych is an interdisciplinary application area, so it's hard to predict. There is growing interest in hiring health psych people around the world, but different health programs focus on health in different ways. Someone hiring an occupational health person might have zero interest in an MRI-studying type of person, or vice-versa. So you might want to identify which kinds of health programs you're interested in, then look for new asst profs with that kind of degree, and ask them directly.",
              "author": "rnlanders",
              "created": 1598558701,
              "upvotes": 1,
              "replies": {
                "g326zfg": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g326zfg/",
                  "text": "Thank you for this. \n\nI will ask people questions when the time comes.",
                  "author": "charlieirvine",
                  "created": 1598559525,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g324ynp": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g324ynp/",
          "text": "Interesting, in my field industry jobs pay at least 3x more than TT jobs, and no one leaves voluntarily.",
          "author": "iwantabrother",
          "created": 1598558596,
          "upvotes": 1,
          "replies": {
            "g326go9": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g326go9/",
              "text": "I'd guess it depends on how closely aligned the industry and TT versions of jobs are? \n\nMost industry jobs for PhDs in my field are still to a degree research jobs, just with less freedom of choice of topic but also no pressure to publish anything.  Instead of choosing your own RQs, you study the organization you work for or work in a consultancy that studies other organizations.  \n\nWhereas an academic IO might choose to study leadership as a general concept, an industry IO will need to research their own org's leadership structure and make recommendations about it.  So the main reasons to stay in academia are \"for the love of publishing\" \"for the love of teaching\" and \"job flexibility\", but knowing that you take a pay cut for it.",
              "author": "rnlanders",
              "created": 1598559286,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g6ib8z8": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g6ib8z8/",
          "text": "Does this hold true for organizational psychology PhDs that aren't through business schools, or only for ones that \\*are\\* through business schools? \n\nAlso, would someone who has studied anthropology and political science but \\*not\\* psychology and who has some years of work experience be a suitable candidate for an organizational psych PhD program?",
          "author": "BayAreaDreamer",
          "created": 1601011847,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g322te8": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g322te8/",
      "text": "My brother is 34. Completed 2 post docs at the university of Alberta and received the Marie curie fellowship and will be doing his third post doc in London. He’s hoping after this he will be able to get a professor position. It’s highly competitive and you need quite a bit of experience following your PhD for most positions. His wife on the other hand got teaching positions at a university after completing her PhD but nothing more than contractual positions.",
      "author": "madeleinelaura",
      "created": 1598557631,
      "upvotes": 2,
      "replies": {}
    },
    "g318fwr": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g318fwr/",
      "text": "Why do you want to become a professor? Is it the research? The teaching? The status? The professional writing? I would focus on the specific appeal and ask yourself can you do that in a different career? All of those things can be done with a phd or even a masters in the right field without becoming a professor. Heck some dont even need a grad degree.",
      "author": "Darthparris",
      "created": 1598544048,
      "upvotes": 1,
      "replies": {
        "g31ikni": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31ikni/",
          "text": "I want to delve into a topic that I love. Ultimately I just want to learn about something that interests me.",
          "author": "charlieirvine",
          "created": 1598548749,
          "upvotes": 1,
          "replies": {
            "g31qimp": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31qimp/",
              "text": "Right on. You can do that with the advanced degree. Contribute to research in the field by writing a thesis or dissertation, maybe even get a few publications. Just go in with a plan. Either do internships along the way or see if theres an professional development programs that could help you get a certification or something similar so you have something to do after, if the professor thing doesn’t work out. You would have contributed to the field and then can go off to the next thing.",
              "author": "Darthparris",
              "created": 1598552211,
              "upvotes": 1,
              "replies": {
                "g31shrg": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g31shrg/",
                  "text": "I love this. Small contributions sound nice to me.\n\nInternships, professional developments, certifications. <-- Sounds doable and up my alley!\n\nThanks bud!",
                  "author": "charlieirvine",
                  "created": 1598553009,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g3256vv": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g3256vv/",
      "text": "[deleted]",
      "author": null,
      "created": 1598558700,
      "upvotes": 1,
      "replies": {
        "g328t0l": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g328t0l/",
          "text": "Maybe my response wasn't posted. But I wrote. \n\nWhy phrase it this way? I don't understand because I don't understand there is nothing more to it. If you want a more candid answer I have written them in other replies!",
          "author": "charlieirvine",
          "created": 1598560370,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g344010": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g344010/",
      "text": "Hi! Very likely it would be a quite tough road (towards the professorship) based on your background information.\n\n&#x200B;\n\nIf you have all these questions in your mind, then I would suggest you to not try it. Many good reasoning I see already been provided by folks here.\n\n&#x200B;\n\nIf you wanna become a professor, purely just for the sake of being a professor, then it does not worth it. If you wanna be a professor because it allows you to have greater freedom to do research, explore the unknown (and better enjoy life maybe), then it might be worth it.",
      "author": "alex_raw",
      "created": 1598600714,
      "upvotes": 1,
      "replies": {}
    },
    "g2zt3qb": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g2zt3qb/",
      "text": "What are you doing like there’s literally no way to a TT position academia is dead lmfao.",
      "author": null,
      "created": 1598506265,
      "upvotes": -8,
      "replies": {
        "g328ynp": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g328ynp/",
          "text": "not untrue",
          "author": "GabhaNua",
          "created": 1598560443,
          "upvotes": 1,
          "replies": {
            "g329ijz": {
              "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g329ijz/",
              "text": "Its fun to accept reality.\n\nBut seriously, like, what are you doing in the year 2020 thinking you're going to get a TT position and you're not even in grad school?\n\nhttp://theprofessorisin.com/2020/08/19/dispatches-covid-grad-students-postdocs/\n\nhttp://theprofessorisin.com/2020/05/04/dispatches-how-has-covid19-impacted-your-career-planning-part-i-leaving-the-academy/\n\nhttp://theprofessorisin.com/2020/05/18/dispatches-covid-career-impacts-3-emotional-impacts/ \n\nThe academy is dead lol.",
              "author": null,
              "created": 1598560702,
              "upvotes": 2,
              "replies": {
                "g32bshm": {
                  "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g32bshm/",
                  "text": "Totally agree.",
                  "author": "GabhaNua",
                  "created": 1598561777,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g323xsw": {
      "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g323xsw/",
      "text": "Ass Prof (senior lecturer) here. Took me 8 years to get tenure from starting a PhD. Yes, financially not the smartest thing I ever did, but not sure what everyone else is whining about. I got tenure with a few decent articles. I made a contribution in my field. Too many of these posters must be making little contribution and simply doing crappy work. I guess.",
      "author": "schumpter81",
      "created": 1598558138,
      "upvotes": 0,
      "replies": {
        "g325jin": {
          "link": "/r/AskAcademia/comments/ihb1hn/i_would_like_to_become_a_professor_but_dont_know/g325jin/",
          "text": "Maybe, or maybe not! Some people don't have the same luck? thanks for your response.",
          "author": "charlieirvine",
          "created": 1598558863,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}