{
  "sid": "pyq85w",
  "link": "/r/AskAcademia/comments/pyq85w/how_to_continue_doing_research_without_continuing/",
  "title:": "How to continue doing research without continuing the traditional research path?",
  "text": "Hi, I’m in the final year of my phd and once done, I plan to go back to working in my old field (basically my old job),but I still want to somehow continue doing research on the side as my research is indirectly related to my work and I find it interesting. Specifically,I want to continue collaborating with my project site and expand on the work I did in my Phd. However, I absolutely do not want to do a postdoc and do not want to continue working with my current research group as my phd supervisor is leaving academia and the research group leader hates the project site since they collaborate very closely with another university in the USA (we are in the EU)and it has caused quite a bit of tension.\n\nSo how do I navigate this? And even though I don’t want to continue working with my research group should I t suck it up and stick with them as an affiliated researcher?",
  "author": "South_Walrus7104",
  "created": 1633027795,
  "updated": 1634078801,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hey87qt": {
      "link": "/r/AskAcademia/comments/pyq85w/how_to_continue_doing_research_without_continuing/hey87qt/",
      "text": "How do you navigate what? \n\nWe need to understand what you think doing research looks like if you're not following a traditional research path. What are your expectations here? \n\nResearch is bound up with a whole bunch of ethical oversight, budgetary requirements, and - presumably - paying you a salary. Research institutions have the license and authority to provide ethical oversight, and administer and dispense grant funding.\n\nI'm not at all clear what you're envisaging as a 'non traditional research role'.\n\nIf you just want to volunteer,  then you need to approach the other people working in the field so that you can operate under the umbrella of their ethical oversight.",
      "author": "OrbitalPete",
      "created": 1633073470,
      "upvotes": 3,
      "replies": {}
    }
  }
}