{
  "sid": "pj5unr",
  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/",
  "title:": "What's the difference between calling someone \"Dr. Name\" vs \"Professor Name\"",
  "text": "This might be a stupid question, but I'm that meme of the guy being like \"I don't know what xyz thing is and at this point I'm afraid to ask.\"\n\nI did my MA at an R1 public university, where all the faculty I encountered had doctorates. We called them by their first names after we had been invited to do so, but the polite, formal thing was to refer to faculty as \"Dr. Name.\"\n\nNow, I'm doing my PhD at a different R1 public university, where all the faculty I have encountered have doctorates. Again, we call them by their first names on invitation, but the formal thing to do is to call them \"Professor Name.\"\n\nIs this just a department culture thing? Or is there a functional difference?",
  "author": "rummncokee",
  "created": 1630954424,
  "updated": 1634079366,
  "over_18": false,
  "upvotes": 146,
  "upvote_ratio": 0.97,
  "comments": {
    "hbua4l4": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbua4l4/",
      "text": "These are two different titles.\n\nNow, it depends a lot on the country (I'm Italian), however usually someone has the title \"professor\" if they are either associate professor or full professor, while everyone who has a Ph.D. can be called \"Doctor\".\n\nThis is the basic explanation, however as I mentioned before a lot depends on the country (for example, in Italy even people with a bachelor degree can be called \"doctor\", which in my opinion is ridiculous, but that's a different topic....)",
      "author": "HistoricalKoala3",
      "created": 1630954986,
      "upvotes": 140,
      "replies": {
        "hbuaeuk": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuaeuk/",
          "text": "thank you for this; I probably should have specified that I'm in the US. I remember when I was in undergrad we had an instructor who was ABD and almost done with his diss and was hired as an adjunct; we called him \"Professor.\"",
          "author": "rummncokee",
          "created": 1630955112,
          "upvotes": 32,
          "replies": {
            "hbuenik": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuenik/",
              "text": "otoh in america all lecturers who aren't themselves students can be informally addressed as \"professor\", but only a subset of these will actually have the job title \"assistant professor\" or above which is when they can \"officially\" lay claim to the title in emails and documents and such. Some people or places will be more or less strict about those rules.\n\nIn most other countries (especially the UK) things are a bit more strict and only full tenured professors are \"professor\" - everyone else is generally just Doctor unless they have a fancy title like dean or director or something",
              "author": "Erysiphales",
              "created": 1630956995,
              "upvotes": 63,
              "replies": {
                "hbuzsax": {
                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuzsax/",
                  "text": "Actually, the UK hasn’t had tenure for academics since 1988. A professor doesn’t have a different employment status to a lecturer - they’re both permanent positions rather than temporary contracts, although a professor holds a chair and is much more senior.",
                  "author": "ayeayefitlike",
                  "created": 1630966571,
                  "upvotes": 32,
                  "replies": {
                    "hbvbuir": {
                      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvbuir/",
                      "text": "Also, everyone in the UK (where I've worked) calls everyone else by their first name.",
                      "author": "FlyMyPretty",
                      "created": 1630972528,
                      "upvotes": 18,
                      "replies": {
                        "hbwm7gq": {
                          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwm7gq/",
                          "text": "Same in Australia, you'd address them with their title in email, but reply with whatever their sign off is. If they use their first name, you can too. I've never actually seen a professor addressed as professor, except maybe an introduction to a presentation.",
                          "author": "someth1ng_au",
                          "created": 1630999343,
                          "upvotes": 12,
                          "replies": {
                            "hbx6a27": {
                              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx6a27/",
                              "text": "I love The Good Place, but when an Australian undergrad called Chidi \"professor\" it totally broke my immersion tbh",
                              "author": "HappyAkratic",
                              "created": 1631015826,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        },
                        "hbwq0q7": {
                          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwq0q7/",
                          "text": "Yes, agreed. Even the undergraduates in the universities I’ve attended/worked at.",
                          "author": "ayeayefitlike",
                          "created": 1631002663,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    },
                    "hbwy6mt": {
                      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwy6mt/",
                      "text": "What does it mean to “hold a chair”?",
                      "author": "ADifferentDimension",
                      "created": 1631009938,
                      "upvotes": 1,
                      "replies": {
                        "hbwz4d8": {
                          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwz4d8/",
                          "text": "A chair is a position. So it’s holding a position. \n\nThere are two types of chairs: established or personal. The oldest established chairs date back to the sixteenth century, and are specific roles within a university written into the university statutes eg Oxford’s Regius Professor of Hebrew. Personal chairs are created for the person, and dissolve when they leave, and tend to be more specific in scope eg Professor of Musculoskeletal Imaging. Typically an established chair has more prestige but both are considered the highest rank of pure academic role.\n\nIt has no relationship to US department chairs.",
                          "author": "ayeayefitlike",
                          "created": 1631010701,
                          "upvotes": 6,
                          "replies": {
                            "hbx0th9": {
                              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx0th9/",
                              "text": "No relation? \nI thought a US department chair was the leader of his/her department.\n\nYoure saying the “personal chairs” where you are located are very specific types of professors.\n\nI still don’t get what an “established chair” is.\n\nBut they all kind of sound similar",
                              "author": "ADifferentDimension",
                              "created": 1631012029,
                              "upvotes": 1,
                              "replies": {
                                "hbx60zc": {
                                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx60zc/",
                                  "text": "A “chair” is basically just a full Prof. An established Chair is a position that is filled by the uni. A personal chair is what you get when you are promoted to full, but not into a vacant established chair. There are a set number of established chairs, but personal chairs vary with the number of people at full Prof level.",
                                  "author": "ardbeg",
                                  "created": 1631015662,
                                  "upvotes": 4,
                                  "replies": {}
                                },
                                "hbx9t8x": {
                                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx9t8x/",
                                  "text": "Yeah but a professorial chair isn’t a head of department. A head of department is more of an administration role than a professorial chair which is considered an academic role.\n\nPersonal chairs are made for the person being promoted, established chairs are specific roles that need to be filled by the university.",
                                  "author": "ayeayefitlike",
                                  "created": 1631017990,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "hbzq1vu": {
                          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbzq1vu/",
                          "text": "A chair is a professor slot in the university that you apply for. If you get the job, you get the title and the chair. Basically you can’t just magically become a professor, only a few positions are available and most come from old chairs retiring",
                          "author": "playmo___",
                          "created": 1631056156,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hbujm3u": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbujm3u/",
              "text": "In the US, the title of \"Doctor\" is used only when the instructor has a PhD (or similar terminal degree), while \"Professor\" may be used for virtually all instructors.",
              "author": "Stannic50",
              "created": 1630959204,
              "upvotes": 44,
              "replies": {
                "hbvf3vi": {
                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvf3vi/",
                  "text": "Huh when I was teaching as a grad student it seemed very poor form to claim for yourself the title ‘professor’ — my official title was “associate instructor”, so I insisted students call me “Instructor (or Mr.) —MCMC—“ and would always correct them if they used “Professor” (well, actually I preferred they use my first name, but understood some students’ desire for that formal separation). ‘Professor’ was also seen as a higher-level title than ‘Doctor’, so using the title without a professorship would have been a greater faux pas than calling yourself a doctor without a doctorate. Might be a regional or even school- or department-specific thing though.",
                  "author": "--MCMC--",
                  "created": 1630974148,
                  "upvotes": 10,
                  "replies": {
                    "hbvfq78": {
                      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvfq78/",
                      "text": "Typically a graduate student would not be referred to as \"Professor\", as they're not really included in the term \"instructor\". This probably differs by university, but when I was a teaching assistant, I was not the instructor of record for the course. I did all the teaching & grading for a lab section, but I did not enter final grades into the university system. The professor did that, & that professor's name was in the \"instructor\" spot on the students' schedules.",
                      "author": "Stannic50",
                      "created": 1630974456,
                      "upvotes": 5,
                      "replies": {
                        "hbvgtx4": {
                          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvgtx4/",
                          "text": "Ah in these cases I was IoR for the course(s) I taught (6 in total by the end of the PhD) and wrote all the lectures, tests, labs, assignments, etc. & had final say over all the grades. Sometimes had TAs to do the grading for me which was very cushy!",
                          "author": "--MCMC--",
                          "created": 1630975003,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hbwipv2": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwipv2/",
              "text": "I should also add: in many countries \"doctor\" is a legal title, i.e. if you refer to yourself as a \"doctor\" without having the title, you commit a crime (there was a colleague of mine who said that in Germany they are very strict about this, and if a foreigner professor come to visit, they are not allowed to put \"dr\" in front of their name, since their Ph.D. is not recognized in Germany)",
              "author": "HistoricalKoala3",
              "created": 1630996540,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hbuu1t4": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuu1t4/",
          "text": "> in Italy even people with a bachelor degree can be called \"doctor\", which in my opinion is ridiculous, but that's a different topic....\n\nAnd school teachers are called Prof ;)",
          "author": "ThePlanck",
          "created": 1630963900,
          "upvotes": 6,
          "replies": {}
        },
        "hbx0hhu": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx0hhu/",
          "text": "ARe you serious? Why oh why would anyone with a bachelor’s degree be called “Dr.”? That’s not fair to the PhD holders",
          "author": "ADifferentDimension",
          "created": 1631011777,
          "upvotes": 2,
          "replies": {
            "hbx3wkd": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx3wkd/",
              "text": "Yep! \n\nNow, the University is what is called 3+2, namely in 3 years you can get a \"laurea\", which i would say it's equivalent to USA's bachelor degree, and in another two years your can get a \"laurea magistrale\", i e. Master's degree, with these two degrees you can get a PhD as well (usually, in about 4 years). Well, when you get the laurea magistrale you become a \"dottore\" (doctor), after the specialistica you are a \"dottore magistrale\" as well, and with the PhD you receive the title of \"dottore di ricerca\". \n\nThe 3+2 system is relatively recent, 15 years or so, before it would take 5 years to get an University degree (basically, bachelor and master were joined together), but you would receive the title of doctor as well... When there was the reform if the system, there was a popular joke saying \"you cannot deny anyone the title of doctor\"....",
              "author": "HistoricalKoala3",
              "created": 1631014252,
              "upvotes": 1,
              "replies": {
                "hbx4tff": {
                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx4tff/",
                  "text": "Thanks for explaining this. \n\nI wish they would stop though because that just cheapens the title of “doctor” if a bunch of people have the title without having a PhD",
                  "author": "ADifferentDimension",
                  "created": 1631014874,
                  "upvotes": 2,
                  "replies": {
                    "hbxki1j": {
                      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxki1j/",
                      "text": "Take pride in the work you do, not the title.",
                      "author": "TheLAriver",
                      "created": 1631023413,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hcj2nrt": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hcj2nrt/",
              "text": "In Brazil, lawyers are called Dr.First & Last name. And in Brazil, a law degree is just a bachelors.",
              "author": "Moscowmule21",
              "created": 1631424353,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hbuftfq": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuftfq/",
      "text": "'Professor' is a job title; 'Doctor' is a degree title. \n\nIf you have both, the preference is cultural, I think. But as others have explained, you can be one and not the other.",
      "author": "aerrin",
      "created": 1630957511,
      "upvotes": 91,
      "replies": {
        "hbujtf1": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbujtf1/",
          "text": "I largely agree with this in the US, although there are some caveats.  In other countries the term \"professor\" has a more specific meaning (in the UK for example the early-career faculty are typically called \"lecturers\" and late-career faculty may eventually obtain the \"professor\" title).  There are also lecturers in the US who teach college classes but aren't professors, and students like to call them \"professor\" out of convenience.\n\nAt my graduate institution, anyone at the graduate level or above just used first names.  It was a bit of a shock to get used to, but it definitely made it easier to interact and collaborate with faculty.",
          "author": "dampew",
          "created": 1630959297,
          "upvotes": 27,
          "replies": {
            "hbun8x3": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbun8x3/",
              "text": "I've had students call me 'professor' before I was one, because they didn't know what else to call me, but it wasn't really my /title/. \n\nI'm in the US, but 'professor' does still have that specific meaning you mention. It's not 'anyone who teaches a college-level course', it's 'anyone with an academic rank/job title of professor'. The two USUALLY match up, but don't always.",
              "author": "aerrin",
              "created": 1630960825,
              "upvotes": 14,
              "replies": {
                "hbvdq8n": {
                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvdq8n/",
                  "text": "Also in my experience in the US at a lot of schools there really isn't any difference between a lecturer and a professor. Especially on the west coast a lot of people just introduce themselves with their first name and let students call them whatever.",
                  "author": "sailingpj",
                  "created": 1630973457,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        },
        "hbutg6b": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbutg6b/",
          "text": "To elaborate on this, there are *many* types of earned doctorate degrees. Most academics have a PhD, but there are many other doctorates such as MD, DO, DDS, EdD, PsyD, EngD, DBA, etc etc. Some of these are professional doctorates and some of them are academic doctorates (i.e., a substitute for a PhD). There's a list on Wikipedia that's a mile long ([https://en.wikipedia.org/wiki/List\\_of\\_doctoral\\_degrees\\_in\\_the\\_US](https://en.wikipedia.org/wiki/List_of_doctoral_degrees_in_the_US)) \n\nThe title \"Doctor\" is appropriate for anyone who has an earned doctorate. That is, the proper way to address such person in a formal setting is \"Dr. Lastname\", and not \"Mr./Ms./Mrs. Lastname\". \n\nMany but not all professors\\* hold a doctorate. Most persons holding a doctorate are not professors. \n\n\\* In the US, it is common/colloquial usage to refer to any person instructing a college-level class as a \"professor\" even if they don't hold the rank of Professor.",
          "author": "DeskAccepted",
          "created": 1630963621,
          "upvotes": 14,
          "replies": {}
        },
        "hbvuos0": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvuos0/",
          "text": "Cultural and also language! In French, the word doctor is used strictly for medical doctors, there's no word for a PhD holder outside of \"Professor\".",
          "author": "fireguyV2",
          "created": 1630981846,
          "upvotes": 3,
          "replies": {
            "hbwubcl": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwubcl/",
              "text": "Actually, in France, a holder of a doctorat (PhD) who doesn’t have a professional rank yet (Maître des conférences, Professeur des universités) is actually called a docteur. For example, people who have just defended their dissertation but haven’t been hired yet.",
              "author": "lespectador",
              "created": 1631006516,
              "upvotes": 4,
              "replies": {
                "hbx59td": {
                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx59td/",
                  "text": "Here in Canada however we don't use the word docteur to refer to a PhD holder. Albeit since English is so prominent, French speakers still use the term but according to the rules of the language, it's technically not correct.",
                  "author": "fireguyV2",
                  "created": 1631015174,
                  "upvotes": 3,
                  "replies": {
                    "hbx7hxk": {
                      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx7hxk/",
                      "text": "That’s interesting. Is there a separate québécois word for PhD holder?",
                      "author": "lespectador",
                      "created": 1631016605,
                      "upvotes": 1,
                      "replies": {
                        "hbx7onv": {
                          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx7onv/",
                          "text": "I'm not sure. Like I said since English is so prominent, everyone still calls them Doctors (anglicism) but I just remember learning in my undergrad scientific and technical writing course that I completed in French that \"technically\" in French doctor is reserved only for MD. But it's just one of those rules that isn't actually used in actuality.",
                          "author": "fireguyV2",
                          "created": 1631016720,
                          "upvotes": 1,
                          "replies": {
                            "hbx893v": {
                              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx893v/",
                              "text": "That’s funny. I think that’s a common misconception in the anglophone world that doctor is a term for medical doctors specifically, while in reality it originated as a term associated with the doctorate degree (which in turn gets declined into doctor of philosophy, doctor of medicine, etc). In French in France, docteur is etymologically linked to the terms doctorat and doctorant, so I don’t think that technicality you mention is a “thing” for us.",
                              "author": "lespectador",
                              "created": 1631017067,
                              "upvotes": 2,
                              "replies": {
                                "hbx8o3z": {
                                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx8o3z/",
                                  "text": "I know this isn't a very good source (although it seems to link some good ones, but I'm short on time) but look at this website, it explains it a lot better than I can.\n\nhttps://www.microbiologistes.ca/fr/docteur",
                                  "author": "fireguyV2",
                                  "created": 1631017313,
                                  "upvotes": 1,
                                  "replies": {
                                    "hbx9mdk": {
                                      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx9mdk/",
                                      "text": "Ah, that seems to raise a different question— that of who in society is allowed to use the abbreviated title of their profession as their *civil* title (Dr., Mr., Ms., etc) (edit: what we call État civil) in front of their name on forms or for receiving mail and such versus who holds which professional title. Some countries are stricter than others about this (Germany for example), and some don’t legislate about it much or at all. In France, people with PhDs or even people with the title of Professeur des universités are rarely called Dr. So-and-so or Prof. So-and-so at all, just as a cultural convention, even though their professional status is undoubtedly that of docteur.",
                                      "author": "lespectador",
                                      "created": 1631017877,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hcj36c6": {
                      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hcj36c6/",
                      "text": "I've  been an adjunct instructor, high school teacher and tutor. My education level is a masters in TESOL. \n\nWhen I taught English at the adult night school, some of my Spanish speaking students would refer to me as \"profesor de ingles\" because the word for teacher in Spanish is professor. I would usually respond by saying, \"professor...you are being too kind.\"",
                      "author": "Moscowmule21",
                      "created": 1631424700,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hbua0wy": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbua0wy/",
      "text": "I teach at an R1 and my job title is lecturer, not professor. *Technically* that makes me Dr. X and not Prof. X, at least here. But I think it can be a cultural thing or vary by field. Search the post history of this sub and you'll see some other answers to this question. For example my wife had a biology prof in undergrad who insisted that people call her Dr. and not Prof.",
      "author": "bengineering103",
      "created": 1630954940,
      "upvotes": 37,
      "replies": {
        "hbuahma": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuahma/",
          "text": "I definitely get women in STEM fields insisting that people acknowledge their doctorates.",
          "author": "rummncokee",
          "created": 1630955146,
          "upvotes": 11,
          "replies": {
            "hbucp9a": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbucp9a/",
              "text": "What confused us at the time was that all professors at our school had PhDs, so that was a default assumption, and \"professor\" was a more specific/prestigious job title (vs other jobs you can get with a PhD that are not a professor position). But again, it seems to vary.",
              "author": "bengineering103",
              "created": 1630956123,
              "upvotes": 18,
              "replies": {
                "hbut42q": {
                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbut42q/",
                  "text": "In medicine being “professor” is a distinction because it means you actually do research and teach; not just work.",
                  "author": "passwordistako",
                  "created": 1630963467,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            },
            "hbuzj42": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuzj42/",
              "text": "There's a good chance this is because they get called Miss or Mrs in situations where a man gets called Dr.",
              "author": "45eurytot7",
              "created": 1630966448,
              "upvotes": 9,
              "replies": {
                "hbv7a8g": {
                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbv7a8g/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1630970253,
                  "upvotes": -10,
                  "replies": {
                    "hbw7m3q": {
                      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbw7m3q/",
                      "text": "It’s an earned and deserved title.\nWith the amount of work that goes into earning a doctorate I understand why people would prefer to be called ‘Dr’",
                      "author": "TrishaThoon",
                      "created": 1630988969,
                      "upvotes": 6,
                      "replies": {
                        "hbxhz11": {
                          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxhz11/",
                          "text": "[removed]",
                          "author": null,
                          "created": 1631022246,
                          "upvotes": 0,
                          "replies": {
                            "hbxihn2": {
                              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxihn2/",
                              "text": "Not small ego people trying to feel important. People worked hard for their degrees and deserve to be called by dr if they so wish. Earning a doctorate is not a small achievement and it should be recognized. Just because you don’t think people should be called that doesn’t mean that they have small egos or whatever. You do what is right for you and let others be.\n-Dr. Trisha Thoon",
                              "author": "TrishaThoon",
                              "created": 1631022489,
                              "upvotes": 2,
                              "replies": {
                                "hbxjiq7": {
                                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxjiq7/",
                                  "text": "[removed]",
                                  "author": null,
                                  "created": 1631022961,
                                  "upvotes": 0,
                                  "replies": {
                                    "hbxkzkr": {
                                      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxkzkr/",
                                      "text": "GTFO with your negativity. People earned the title. If you don’t want to use it then don’t but don’t rag on other people for their choices. People don’t have small egos because they prefer to use the title they earned. The way you go on and on about it makes me think you don’t actually have the degree 🤣",
                                      "author": "TrishaThoon",
                                      "created": 1631023633,
                                      "upvotes": 2,
                                      "replies": {
                                        "hbxmfpz": {
                                          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxmfpz/",
                                          "text": "[removed]",
                                          "author": null,
                                          "created": 1631024284,
                                          "upvotes": -1,
                                          "replies": {
                                            "hbxqbv7": {
                                              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxqbv7/",
                                              "text": "And that is your choice. Just don’t rag on other people for their choices.",
                                              "author": "TrishaThoon",
                                              "created": 1631025997,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hbwn1c6": {
                      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwn1c6/",
                      "text": "Only about 1% of the US population has a doctorate. Its not a \"short dick move\" to be proud of that. \n\nFor me, it took 11 years to aquire - not to mention the sacrifices, like giving up my 20s and choosing to study rather than work or build wealth. As a first-Gen college student, and as a multiple minority, I also had a constant uphill battle in academia with professors in my R1 doctoral program who felt that I didn't belong because I went to state schools, or that I wasn't committed because I had to work in addition to going to school, or whatever else.\n\nI insist that people call me Dr. because I worked really fucking hard to get here, and in a professional setting, I deserve to have that recognized. I don't want people barely know calling me \"Miss veryshanetoday,\" when the appropriate formal title in my place of work is Dr.\n\n*edit* I frankly find the responses to this comment to be a little ignorant. I'm not interested in arguing, but for anyone lurking who genuinely wishes to understand why some \"insist\" on being called Doctor can read a few articles that I found from exactly one Google search of the phrase \"women in academia being called dr.\"... my stance is an extremely common one for minorities in academia. \n\n1. [Should all Ph.D.s be called 'doctor'? Female Academics say yes.](https://www.kqed.org/science/1926489/should-all-ph-d-s-be-called-doctor-female-academics-say-yes) \n\n> On the first day of class, Debbie Gale Mitchell, a chemistry professor at the University of Denver, introduced herself to her students, telling them about her Ph.D. and her research. She told her students they could call her either \"Dr. Mitchell\" or \"Debbie.\" A male colleague had told her that he went by his first name and that students were friendlier as a result, so Mitchell decided to try it. Many students chose to call her \"Debbie.\" Then one day a student asked if she thought she'd ever get a Ph.D. \"I discovered that for me, the use of my title is VITAL to remind students that I am qualified to be their professor,\" Mitchell wrote on Twitter.\n\n2. [Why women academics with PhDs are often not called doctor](https://theswaddle.com/why-women-academics-with-ph-d-s-are-often-not-called-dr/)\n\n> The article reflects a larger problem faced by women academics who face severe discrimination and belittlement in their fields, often from male academics whose entitlement and gatekeeping keeps women from flourishing as renowned and respected experts and scholars. While the “Dr.” title may seem superficial, women academics in the past have pointed out that it’s often the only (and quickest) way to prove to someone that they have advanced qualifications in their field of expertise. This is especially important considering the title “Dr.” has almost exclusively male connotations and associations, and women scholars with doctorates are often referred to as “Ms.” or “Mrs.”\n\n3. [What the 'doctor' title means for women of color with doctorates](https://theconversation.com/what-the-doctor-title-means-for-women-of-color-with-doctorates-150194). \n\n> I am not only a woman who holds a Ph.D. in a male-dominated field, but a woman of mixed heritage (Irish and Native American). There was never a time during my Ph.D. studies that I was not made aware that I was different, sometimes unwelcome, and most assuredly unlikely to thrive in academia. [...] There have only been a handful of times when I’ve encountered people who refuse to use the title “doctor.” I certainly have had numerous encounters, particularly on airplanes, with people who, when I tell them I am Dr. Hannigan and I explain what I study, they respond with a variant on the theme of “Oh, so you’re not a real doctor.”",
                      "author": "veryshanetoday",
                      "created": 1631000051,
                      "upvotes": 3,
                      "replies": {
                        "hbx90k2": {
                          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx90k2/",
                          "text": "[removed]",
                          "author": null,
                          "created": 1631017519,
                          "upvotes": 2,
                          "replies": {
                            "hbxiy3i": {
                              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxiy3i/",
                              "text": "Exactly! People want to feel good, and respected because they have a small ego. People can call me whatever they want, I came to the US from a super shitty third world country, I know who I am, I don’t need a research assistant and the receptionist to call me Dr. to feel important. I am certainly not, I am just another human being.\n\nWhen people say “academia ivory tower” they are right.",
                              "author": "quemacuenta",
                              "created": 1631022699,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hbvsgo5": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvsgo5/",
              "text": "I have also met female professors in STEM who insist on being called professor because in the US it's usually more prestigious to be hired as a professor than to earn a doctorate. I'm in CA at an R1.",
              "author": "rawrpandasaur",
              "created": 1630980723,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hbverm8": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbverm8/",
          "text": "Went to two big name STEM schools. Tenure-track was Prof, lecturers were Dr. I assume the reasoning was everyone teaching a class had a PhD, while only a few PhDs go on to become a professor.\n\nI'm in industry now and coadvise students and it always makes me feel weird whenever they can me Dr Reaver, haha.",
          "author": "racinreaver",
          "created": 1630973977,
          "upvotes": 2,
          "replies": {}
        },
        "hbuuc6d": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuuc6d/",
          "text": ">I teach at an R1 and my job title is lecturer, not professor. Technically that makes me Dr. X and not Prof. X, at least here. \n\nThis is a distinction that is completely meaningless. At my institution, we have full-time, permanent faculty with earned research doctorates in the title \"Lecturer\" (which at our school just indicates they do not have a research responsibility--- we have no such title as \"Teaching Professor\" that is sometimes found elsewhere), but we also have part-time, paid-by-the-course faculty whose title is \"Adjunct Assistant Professor\". You cannot give a reasonable argument about why the adjunct has somehow earned the honor of being addressed as \"Professor\" but the full-timer has not.\n\n(In practice, everyone who teaches a class at my institution is referred to as \"Professor\", not only by the students but by the staff as well).",
          "author": "DeskAccepted",
          "created": 1630964031,
          "upvotes": 4,
          "replies": {
            "hbuzhkg": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuzhkg/",
              "text": "I wasn't arguing for anything or claiming this is the \"right\" way, that's just how it works where I teach. My original post also should have said \"varies by institution.\" Technically I'm Dr. X but it's basically the same as you mentioned, all the students and staff call me Prof. X out of habit. For whatever reason we call the temporary/part time teaching positions \"visiting lecturer\" instead of \"adjunct professor\" though, which seems to keep the teaching vs research distinction more consistent.",
              "author": "bengineering103",
              "created": 1630966428,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "hbuadiq": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuadiq/",
      "text": ">Is this just a department culture thing? \n\nProbably. Some of it will also be personal preference.\n\n>Or is there a functional difference?\n\nIn some cases, yes. Not all professors have a PhD, depending on the field. In those cases, it would be inappropriate to refer to them by Dr. XXX if they do not have a doctoral degree. Professor XXX would be a more appropriate choice. In your case, it's probably just the preference thing.",
      "author": "poniesgirl",
      "created": 1630955097,
      "upvotes": 15,
      "replies": {}
    },
    "hbueeg1": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbueeg1/",
      "text": "I am a professor in music. It is quite common to have faculty without doctorates. (This is especially true in the performance areas. There are even well-known teachers with no degrees at all.)  \n\n\nIn my unit, faculty with doctorates (even lecturers and adjuncts) are referred to as \"Dr. Name\" while others are \"Professor Name\". Of course, having lecturers and adjuncts with earned doctorates is an entirely different discussion...",
      "author": "oldguy76205",
      "created": 1630956884,
      "upvotes": 12,
      "replies": {
        "hbutbbq": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbutbbq/",
          "text": "This...I have a Doctorate...I go by Dr.... Also, like this guy said you can teach at a University and not have a Doctorate or P.hd. Many only require a Mastes degree.",
          "author": "kelley5454",
          "created": 1630963559,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hbuarkw": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuarkw/",
      "text": "At my university the tenure track faculty members who have their PhDs are usually called Dr (last name) but the adjuncts and the grad students who teach are called Professor (last name) but I think it also might be a cultural thing.",
      "author": "Individual-Elk4115",
      "created": 1630955269,
      "upvotes": 8,
      "replies": {}
    },
    "hbuii3o": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuii3o/",
      "text": "In my experience in the US, this is often a cultural aspect of the university.  Most I have been to used Dr. Name but one I taught at used Professor Name. \n\nIn the US, professor is both a job title and a profession.  Anyone who teaches at a university is a professor, but only some professors are Assistant Professors, Associate Professors, or Professor (people call it full Professor, but the title is technically Professor).  You see the same thing with instructor.  If you teach a college class, you are an instructor, but some places also have a job title Instructor.  So I am Dr. Manova, Professor of neuroscience, who is the instructor for psychopharmacology.  \n\nBut to directly answer your question, it is a culture thing and there is no real functional difference.  At the one school I was at that used professor, they told me it was because when the college was first founded, not all faculty had a doctorate, so they used professor so everyone would have the same title.  That tradition stuck. \n\nRarely, because faculty without a doctorate can be called Prof Name, but not Dr. Name, some see Dr. has a \"higher title\".  However, I had a literature professor back in my undergrad school that preferred Professor even though most went by Dr.   Her reasoning was that Doctor meant you got a degree, but Professor meant you got a job.  I've always liked this line.",
      "author": "manova",
      "created": 1630958700,
      "upvotes": 8,
      "replies": {}
    },
    "hbuta4z": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuta4z/",
      "text": "In South Africa we don't use Professor lightly. It's only reserved for those of the highest academic ranking and in order to become a Prof you need to have made a substantial contribution towards the field and academics. Those who teach courses are just referred to as lecturers and then specifically Dr or Professor depending on their title. If you mistakenly call someone professor when they don't have a Prof title (and maybe only a PhD) they will correct you because we're very strict about it. Some people with a PhD will ask you to call them by their first name. \nFrom what I understand it works like this in the UK too.\n\nIt seems that in the US they use the term more lightly for anyone who teaches at a university.",
      "author": "ArcticFunki",
      "created": 1630963544,
      "upvotes": 5,
      "replies": {
        "hbvd8zl": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvd8zl/",
          "text": "I'm curious, how would you address someone who teaches a course but doesn't have a doctorate, and does not have a job title Professor? Lecturer is a job title but I wouldn't address someone as Lecturer Smith in an email or in person.",
          "author": "bacon_music_love",
          "created": 1630973220,
          "upvotes": 3,
          "replies": {
            "hdhpdgl": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hdhpdgl/",
              "text": "In that case the students will address them as Mr or Ms/Mrs Surname. If you're not sure of the person's title (say for example a guest lecturer or a new class) the students will sometimes say Professor and in turn they will correct them with the right way to address them. Sometimes the younger people who teach courses will tell the students to call them by their first name but I've only seen that happen when they teach graduates.",
              "author": "ArcticFunki",
              "created": 1632075146,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hbxhy38": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxhy38/",
          "text": "I haven’t seen that.  I’ve never heard a professor called a professor in the US.  I’ve only used Dr., Mr./Ms./Mrs. or their first name (at their request).",
          "author": "Chasman1965",
          "created": 1631022233,
          "upvotes": 2,
          "replies": {
            "hdhqboi": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hdhqboi/",
              "text": "Very interesting how conventions can be so different! Now I won't be surprised if I should ever go to the US for research :)",
              "author": "ArcticFunki",
              "created": 1632075525,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hbusah6": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbusah6/",
      "text": "American here: I’ve never been formally explained this, but usually I say Doctor if I’m positive they have their PHD and professor if they’re like an associate professor, grad student, or something. I’ve had like sixth year grad students teach classes while working on their phd and I’ll call them professor. They weren’t TA’s just to clarify.",
      "author": "Wereallcurioshere12",
      "created": 1630963095,
      "upvotes": 4,
      "replies": {
        "hbusfa8": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbusfa8/",
          "text": "lol I'm a grad student and when I teach and an undergrad calls me \"Professor\" I almost shrivel up and die out of embarrassment.",
          "author": "rummncokee",
          "created": 1630963155,
          "upvotes": 4,
          "replies": {
            "hbuwu1d": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuwu1d/",
              "text": "I’m so sorry about this I feel awkward about it too but I’ve had previous ones correct me pretty harshly over it so I’m careful now…..sorry though",
              "author": "Wereallcurioshere12",
              "created": 1630965180,
              "upvotes": 2,
              "replies": {}
            },
            "hbwz680": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwz680/",
              "text": "Why are you embarrassed? What would you like them to call you?",
              "author": "ADifferentDimension",
              "created": 1631010742,
              "upvotes": 1,
              "replies": {
                "hbx8dv8": {
                  "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx8dv8/",
                  "text": "My name? Not a title I haven’t earned",
                  "author": "rummncokee",
                  "created": 1631017144,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "hbx6pli": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx6pli/",
              "text": "One of the nice things about being in Australia, it's all first names. \n\nHonestly I wanna curl up every time I email an academic abroad and call them Dr./Professor etc. I know it's the convention in the US but it always feels like I'm taking the piss.",
              "author": "HappyAkratic",
              "created": 1631016106,
              "upvotes": 1,
              "replies": {}
            },
            "hbxi2yj": {
              "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxi2yj/",
              "text": "When I was a grad TA, I just had the students call me by first name.",
              "author": "Chasman1965",
              "created": 1631022298,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hbww2k1": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbww2k1/",
      "text": "I'll never understand why Americans are so blasé about the usage of professor.",
      "author": "spriggity",
      "created": 1631008101,
      "upvotes": 4,
      "replies": {}
    },
    "hbwxkho": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwxkho/",
      "text": "Dr. Is 'earned' in the sense of having a doctorate, professor is simply an institutional designation. Either reference should be acceptable. I am not familiar with the US context directly, but have Chinese and New Zealand experience.\n\nIn the case of China, 'professor' is standard as a student reference to faculty, whether they are a lecturer, assistant, associate or full professor. Initially, it seemed a bit odd because in New Zealand students would never call me professor. Sometimes they'd use my first name, other times nothing at all. It's usual for undergrad students to avoid faculty generally so the need for honorifics is largely avoided. Another point is that in the New Zealand system most teaching is done by lecturers and senior lecturers, the equivalent of assistant professor/seasoned assistant professor in the US system (so, above 'lecturer' as used in the US system). While almost all NZ lecturers have a doctorate I've never been called 'Dr.' by a student.",
      "author": "ChildhoodItchy",
      "created": 1631009418,
      "upvotes": 3,
      "replies": {
        "hbx0cbm": {
          "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx0cbm/",
          "text": "Aw. If you have a PhD, you’ve earned the Dr title, so students really ought to call you Dr.",
          "author": "ADifferentDimension",
          "created": 1631011667,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hbvij4v": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvij4v/",
      "text": "Dr. is a reference to the degree (Ph.D. or M.D.), Professor refers to the title. How it goes over varies a lot by country. In the USA, there is not much prestige given to the title of Professor, so people don't usually care. I am fine with either. But in the UK and Germany it is a very big deal, as many people might work all their lives without ever getting the title of Professor. \n\nWhen in doubt, it's ok to ask.",
      "author": "Ch_Ra",
      "created": 1630975841,
      "upvotes": 2,
      "replies": {}
    },
    "hbvptve": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvptve/",
      "text": "In Portuguese, there is no word for \"teacher\": everyone who teaches (from kindergarten to the university) is a \"professor\". So, in Brazil it is common to use \"Prof. Dr.\" to designate university professors (of course only those who have a doctorate). I think this is too much, especially in universities where professors holding a doctorate is the norm. Since this is the case of my university, I just present myself as Prof. Kratylos* (despite my nickname hehe). If I presented myself just as Dr. Kratylos, people would think that I am a physician or a lawyer.\n*of course this is not my name :)",
      "author": "DrKratylos",
      "created": 1630979415,
      "upvotes": 2,
      "replies": {}
    },
    "hbwl2gm": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwl2gm/",
      "text": "In the US, Doctor is the more prestigious title to go by, reserved for the more senior academics, despite a PhD meaning everyone is a doctor. Professor is anyone who lectures I think.\n\nIn the UK where I'm from, professor is the more prestigious title, whereas doctor is the lesser title. In practice, most people go by their first name and don't really give much of a crap.",
      "author": "jackanakanory_30",
      "created": 1630998390,
      "upvotes": 2,
      "replies": {}
    },
    "hbx6a84": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx6a84/",
      "text": "Doctor is a title used for a person who has received a doctoral degree or medical doctorate degree. Professor is a job title for teaching position at a college or university.\n\nNot all doctors are professors, and not all professors are doctors. When person is both, at least in the US, “doctor” is the preferred honorific except in the context where someone is acting in their capacity as a professor (teaching a class or providing academic advisement). A student may address their teacher as “professor” in class, for instance, rather than “Dr. Lastname”.",
      "author": "FellowConspirator",
      "created": 1631015828,
      "upvotes": 2,
      "replies": {}
    },
    "hbuefgv": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuefgv/",
      "text": "No functional difference in the US. \"Doctor\" is for people with doctorates, while in my cases \"Professor\" can mean any instructor-- even though it's *also* a formal rank. But we don't address anyone as \"Assistant Professor X\" or \"Associate Professor Y\" do we?\n\nWe tell our students that \"Professor\" is the polite way to address any faculty member you don't know or who hasn't already told you to use their first name. Assuming \"Doctor\" can lead to uncomfortable moments of the person explaining that they don't have a Ph.D., or have an MBA or MFA, etc.",
      "author": "SnowblindAlbino",
      "created": 1630956897,
      "upvotes": 7,
      "replies": {}
    },
    "hbud8gv": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbud8gv/",
      "text": "Professor is technically a (much) higher title than doctor. It means someone is a full Prof and therefore a senior scholar. A \"mere\" Dr. is a junior scholar. This is a holdover from the British system, where junior jobs are not \"assistant prof\" but Lecturer and Reader. In the US, people casually refer to their university teachers as professor, and there are some casual references to junior faculty as \"professor\" among colleagues when in public.",
      "author": "IamRick_Deckard",
      "created": 1630956360,
      "upvotes": 2,
      "replies": {}
    },
    "hbvel6c": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvel6c/",
      "text": "I have seen it be both a cultural thing and a specific university thing. At my universities in the US, almost all use Dr. unless they don’t have a doctoral degree and most people that I have interacted with overseas use Professor. However, at my current US University, they prefer Professor regardless of degree.",
      "author": "dreama7",
      "created": 1630973889,
      "upvotes": 1,
      "replies": {}
    },
    "hbvjw3n": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbvjw3n/",
      "text": "Funny. American here. Professor i always thought was tenured … with a title of “full professor.”  Anything else is just Dr.",
      "author": "BTownPhD",
      "created": 1630976509,
      "upvotes": 1,
      "replies": {}
    },
    "hbwr4nx": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbwr4nx/",
      "text": "Even though I didn't go to school for anybody, I am pleased to inform you that all got it right. Apart from normal academic qualifications (PhD) that all doctors pass through, a professor must engage in life changing course to earn that title. You must have extra ordinary co curriculum course or publish a new research that directly change human life to stand out of doctors as a professor. That's my 50 cents knowledge",
      "author": "Zealannum",
      "created": 1631003651,
      "upvotes": 1,
      "replies": {}
    },
    "hbx64q3": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbx64q3/",
      "text": "There are differences between the way you politely address someone, their actual job title, and their academic ranking. \n\nI've gotten used to my international students calling me \"professor\" since I understand it's just a polite thing to say to a teacher - actually reading Harry Potter helped with that ;)\n\nHowever, in the Dutch language the word \"professor\" is reserved for only those with full professorships  - i'd chuckle and politely correct them if one of my Dutch students ever addressed me like that *in the Dutch language*.  \n\nMost of my colleagues are doctors but I don't think I've ever used that term other than in writing.",
      "author": "100011101011",
      "created": 1631015729,
      "upvotes": 1,
      "replies": {}
    },
    "hbxegjm": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxegjm/",
      "text": "Professors also can have master's and be called professor but not Dr. Someone with a doctorate can be called both.",
      "author": "Weird_Surname",
      "created": 1631020507,
      "upvotes": 1,
      "replies": {}
    },
    "hbxfqq6": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxfqq6/",
      "text": "It’s definitely a culture thing. In the USA I called everyone who taught me (who wasn’t a TA) professor. When I went to the Netherlands for my PhD I was sternly told this was wrong and only full professors had the right to be called professor. Our dept at the time had like 10 faculty but only two full professors. \n\nThat effect of the system btw is just silly, but the annoying effect was only full professors could “promote” a PhD thesis, even if they had nothing to do with the writing of it.",
      "author": "Andromeda321",
      "created": 1631021150,
      "upvotes": 1,
      "replies": {}
    },
    "hbxhjx9": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxhjx9/",
      "text": "I have a bachelors degree, two masters degrees and am a ABD Ph.D. All in the US.  I have never called a professor or instructor, Professor lastname.  I’ve called them Dr. lastname, Mr. or Ms. or Mrs. lastname, or simply by their first name (at their request).  Not sure how typical Professor lastname is in the US.",
      "author": "Chasman1965",
      "created": 1631022040,
      "upvotes": 1,
      "replies": {}
    },
    "hbxl5tf": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbxl5tf/",
      "text": "In the US, they're mostly interchangeable. Students routinely call whoever is teaching their class \"Dr X\" or \"Professor X\" and I've never known anyone to care one way or the other. There are actual ranks of professor that people do care a lot about (i.e., Assistant/Associate/Visiting/etc.), but those aren't really used as titles. No one raises their hand in class and says, \"Associate Professor X, can you explain XYZ?\". Outside of a university setting, if I were forced to give a title (which is rare already), it would be \"Professor\", because \"Doctor\" is usually understood to be a medical doctor, and avoiding confusion is the best policy.\n\nIn other countries, \"Professor\" can function like a protected title where it confers the recognition that the person is actively involved in academic research at a university.",
      "author": "deong",
      "created": 1631023712,
      "upvotes": 1,
      "replies": {}
    },
    "hby7rcc": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hby7rcc/",
      "text": "As others have said, the two titles refer to different things. Doctor is appropriate for one who has earned a PhD, whereas Professor is appropriate for one who holds the position of Professor. It varies whether you need to be a full professor or if associate professor suffices to claim that title. In practice, it really doesn't matter. If a particular teacher tells you their preference, abide by it, but otherwise Professor is usually safe.",
      "author": "schoolmonky",
      "created": 1631033189,
      "upvotes": 1,
      "replies": {}
    },
    "hbylspx": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbylspx/",
      "text": "\"Dr.\" is a formal title that applies to anyone with a PhD.  In the United States \"Professor\" is used to address individuals who teach.  Once upon a time \"Professor\" was reserved to those who had that title bestowed upon them by a college or university (Asst. Prof., Assoc. Prof., Prof.) but now it just conveys respect for educators irrespective of doctorate or proper title.",
      "author": "uncl3bob",
      "created": 1631038979,
      "upvotes": 1,
      "replies": {}
    },
    "hbzpup2": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbzpup2/",
      "text": "The sr title is awarded from the completion of a PhD. The professor title is awarded from the university seat. Typically a professor holds a doctorate and it’s a higher title, but it’s basically a job title.",
      "author": "playmo___",
      "created": 1631056065,
      "upvotes": 1,
      "replies": {}
    },
    "hc0cgco": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hc0cgco/",
      "text": "In the US, calling someone “Professor LastName” is the default for professors without a doctorate regardless of their title (Assistant/Associate/Full Professor, Instructor, Lecturer, etc), or for when you’re not sure of someone’s degrees. Dr. LastName is reserved, obviously, for people who have a doctorate. In many cases, the two are interchangeable. I have a doctorate, and I don’t particularly care whether students call me Dr. or Professor, though I tend to introduce myself as “Dr.” When I was adjuncting and, later, full time non-tenure track as an Instructor, I went by “Professor” as I had not yet finished my doctorate. Once I finished, I went by Dr., but didn’t correct people if they called me Professor. \n\nDepartment/field culture is important in this distinction. In my field, you don’t call faculty by their first name. It’s either Dr. or Professor, and either is acceptable, as not everyone in my field always has a doctorate. \n\nJust don’t call me “Mr.”",
      "author": "GoldenBrahms",
      "created": 1631066582,
      "upvotes": 1,
      "replies": {}
    },
    "hbuw0tc": {
      "link": "/r/AskAcademia/comments/pj5unr/whats_the_difference_between_calling_someone_dr/hbuw0tc/",
      "text": "Professor is a just a work title! It is like calling people as ‘Engineer X’, ‘Accountant Y’ - which don’t make any sense, right?",
      "author": "clubowner69",
      "created": 1630964809,
      "upvotes": 0,
      "replies": {}
    }
  }
}