{
  "sid": "g82eky",
  "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/",
  "title:": "Academics: do you get insecure not having industrial experience?",
  "text": "I find my supervisor (who doesn't have any industrial experience) a bit insecure when facing some of the industrial folks. He often asks, \"is that how it works over there? I got more insecure for him being my supervisor by asking that for some reason.\n\nMy sister who has been working in the industry for her whole life didn't quite like working with people who have been \"stuck\" in school -  she finds them as people that couldn't really solve real problems - no offence but she said that \"these people\" are more complaining and using \"methods\" people don't understand. She says she doesn't care for \"the references\", \"the literature review\" or SCOPUS Indexed if it can't solve the business problem - I literally laughed hearing that. \n\nAcademics - do you get insecure not having industrial experience?",
  "author": "runnersgo",
  "created": 1587852511,
  "updated": 1634081379,
  "over_18": false,
  "upvotes": 129,
  "upvote_ratio": 0.95,
  "comments": {
    "folt3bt": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/folt3bt/",
      "text": "And yet general science/scholarship is drawn upon by the private sector all the time with no credit given. Without basic science, the rest simply wouldn't work very well. So no, I'm not concerned -- especially now that hopefully COVID-19 has made the world a lot more aware of why you need those esoteric experts doing weird stuff. Without people mucking around with molecular sequence evolution to answer obscure academic questions, there would be no tools to trace virus strains and identify important mutations and all this other incredible work they've done in such a short time! Without some taxpayer-money-sucking microbiologists studying weird hot water bacteria in the 1970s, there would be no PCR tests, etc. 30 years ago, people were studying Coronaviruses because they have super cool, relatively complex genomes for RNA viruses, no one suspected they'd be of any human relevance before SARS-1. Some of those people were mocked for studying non-human industry-irrelevant bat viruses...\n\n\nIf the world doesn't figure this out and I'm left without my academic job somehow, guess I'll have the rest of my life to spend on being a militant activist for basic science and make a career out of that. Because I know that despite all the anti-intellectual overly-pro-business propaganda, we basic scientists are not only useful, but actually absolutely essential to modern society and a decent quality of life in it =)",
      "author": "Hemimastix",
      "created": 1587869833,
      "upvotes": 92,
      "replies": {
        "fomet55": {
          "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomet55/",
          "text": "I think you make a good point for the hard sciences but I have found in my experience both working in industry of my field (communication) and now in academia what you're saying holds a lot less water. There's some overlap but generally speaking academics in communication could not be qualified to work above an entry level in the field and also vice versa. Just different skills.",
          "author": "flaviadeluscious",
          "created": 1587887428,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fol9b08": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fol9b08/",
      "text": "Yes, but not in the same way you're talking about. For me it's more like \"I don't think I have any marketable skills if my position is eliminated and I need to get another job.\"\n\n...Which isn't really true but that doesn't stop me from being insecure about it ;)",
      "author": "ProbabilisticWorld",
      "created": 1587857441,
      "upvotes": 93,
      "replies": {
        "fomeuzu": {
          "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomeuzu/",
          "text": "Depends on the field, I think. Some phds would have an okay industry run and some would walk into a super rough road.",
          "author": "flaviadeluscious",
          "created": 1587887481,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fom49zl": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fom49zl/",
      "text": "I don't think anyone who has developed deep and comprehensive expertise in a subject matter as well as rigorous research skills should feel insecure about anything.\n\nThat said, practitioners and academics often have very different mentalities, approaches, culture and even skillset. Practitioners typically prize breadth and efficiency, whereas academics typically prize depth and rigor. As such, academic mentality and approaches tend to clash with practitioner environments - but that doesn't mean it's inferior, just different.\n\nTheir suitabilities are likewise different. A practitioner's approach isn't very suitable for an in-depth rigorous, research driven study, whereas an academic approach isn't very suitable in a fast-paced generalized, heuristic/gut driven environment. And it's not trivial for someone steeped in practice or academia to one day put on the cap of the other.\n\nThat's why in many fields there is a lot of demand for academics to advise and consult for government and the private sector, and to do studies.",
      "author": "bennyandthef16s",
      "created": 1587877908,
      "upvotes": 28,
      "replies": {
        "fomez2c": {
          "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomez2c/",
          "text": "This a great explanation that matches my ten years in industry and academic experience.",
          "author": "flaviadeluscious",
          "created": 1587887596,
          "upvotes": 6,
          "replies": {}
        },
        "fomy5mb": {
          "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomy5mb/",
          "text": "Anyone with successful grant funding has to be good at effienciency because you have to get a lot done with a little money.\n\nIt is industry that actually wastes time and money in less efficient practices",
          "author": "OizysAndMomus",
          "created": 1587907369,
          "upvotes": 6,
          "replies": {
            "fonrf9a": {
              "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fonrf9a/",
              "text": "Not the kind of efficiency I'm talking about.\n\nI mean an efficiency orientation that is willing to sacrifice rigor and thoroughness. Effectively, \"doing it wrong\" in a strict sense, or \"doing it less knowingly\" in a fairer sense.\n\nWhat does this mean, practically? No sourcing standards, no lit reviews, deference to rules of thumb/conventions/gut feelings, less rigorous methods, manipulation of numbers to suit a narrative, no real peer review, definitive and precise conclusions/decisions made on inconclusive/unsound analysis from imprecise/vague/compromised data\n\nYou may be tempted to say that's simply malpractice, and that would be exactly what I mean when I talk about the academic mentality clashing with the practitioner environment.",
              "author": "bennyandthef16s",
              "created": 1587925000,
              "upvotes": 3,
              "replies": {
                "foo31ah": {
                  "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/foo31ah/",
                  "text": "Agreed. Had to learn not to let the perfect be the enemy of the good, even working in a research-oriented private sector job.",
                  "author": "Darkfriend337",
                  "created": 1587931518,
                  "upvotes": 2,
                  "replies": {}
                },
                "foo217n": {
                  "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/foo217n/",
                  "text": "Cant tell from your post who has these bad practices and who is so much better, but I would like to know what field",
                  "author": "OizysAndMomus",
                  "created": 1587930953,
                  "upvotes": 1,
                  "replies": {
                    "foo5n5w": {
                      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/foo5n5w/",
                      "text": "I never framed it as bad practices or either way being better. They're just different worlds - academics live in a world of perfection while practitioners live in a world of good enough.",
                      "author": "bennyandthef16s",
                      "created": 1587932977,
                      "upvotes": 0,
                      "replies": {
                        "fooclch": {
                          "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fooclch/",
                          "text": "What have you been smoking?",
                          "author": "OizysAndMomus",
                          "created": 1587936592,
                          "upvotes": 1,
                          "replies": {
                            "food7kl": {
                              "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/food7kl/",
                              "text": "Just the good stuff :)",
                              "author": "bennyandthef16s",
                              "created": 1587936897,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "folg5kb": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/folg5kb/",
      "text": "[deleted]",
      "author": null,
      "created": 1587861518,
      "upvotes": 35,
      "replies": {
        "folyyo8": {
          "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/folyyo8/",
          "text": "> I have real world experience\n\nI hate the “real world” line so much. I study the air you breathe. How is that not real? Somebody below gave an example of coronaviruses, those feel real enough yet?\n\nI know it’s shorthand turn-of-the phrase thing, but it irks me.",
          "author": "PM_me_your_squids001",
          "created": 1587873896,
          "upvotes": 36,
          "replies": {
            "fom1gv5": {
              "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fom1gv5/",
              "text": "For hard sciences it is a phrase that doesn't make much sense, but for social sciences, I think it's not too off base, to a reasonable person who isn't trying to be pedantic (because of course everything is \"real\"). But I'm pretty forgiving of imprecise language so I understand what they mean and don't get caught up by whatever \"implication\" might be read into it. But personally, I prefer to phrase \"practitioner\"",
              "author": "bennyandthef16s",
              "created": 1587875739,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "fom14dk": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fom14dk/",
      "text": "Are you sure it's insecurity? Often people really like talking about themselves/how *they* do things. Asking these kinds of questions even if you don't care that much about the answers can be a good social move, especially when dealing with industry contacts or partners.",
      "author": "tishtok",
      "created": 1587875481,
      "upvotes": 6,
      "replies": {}
    },
    "folj00a": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/folj00a/",
      "text": "What she (and many others) doesn't know is that regardless of whatever the field is, what allows her to not care about methods and references and stuff is the work of academia that provided a solid platform for the \"industry\" to happen. If you go to HN for example, you'll see, well, please excuse my wording, but a festival of dicks shitting on academia, and if you read into it, it's all sitting on a hill of ignorance or moral stockholm syndrome (\"they don't make a living invading the privacy of people and/or marketing totally unproductive and unprofitable startups to venture capitalists! what a shit life to live!\"). I guess that you're doing CS or related because the divide seems to be more pronounced there.\n\nEven someone who only has an MA under their belt is more likely to be hired to any position in any field when compared to someone who's got experience but only did the undergrad or vocational school. Academics have nothing to worry about.",
      "author": "lethally_bored",
      "created": 1587863263,
      "upvotes": 34,
      "replies": {
        "fomf4ww": {
          "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomf4ww/",
          "text": "Any position in any field is definitely not true. In marketing and public relations, and being at the director level, this definitely isn't what I observed. No one cares about your masters degree in public relations. No one even cares that much about your undergrad. \n\nSource: was a director at fortune 50 company, agency experience, venture capital startups",
          "author": "flaviadeluscious",
          "created": 1587887760,
          "upvotes": 5,
          "replies": {
            "fomohlc": {
              "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomohlc/",
              "text": "This. Frankly that poster is one example of illusions of grandeur. No one really cares you got first class in anything. I've interviewed those and master's level folks, and there's nothing there that impressed me.",
              "author": "runnersgo",
              "created": 1587897936,
              "upvotes": 0,
              "replies": {
                "fopyc8x": {
                  "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fopyc8x/",
                  "text": "I'm not saying that the education didn't impress me or that people with more education don't have stronger skills in some areas, they just aren't the skills that I am always necessarily looking for as a hiring manager. I would take someone with a history degree that is Google analytics certified, knows Salesforce, and can run a drip campaign over someone with a masters degree but not those skills. Also I would argue that for some professions your personality matters more than anything. In public relations you absolutely need a thick skin and can handle and thrive with a lot of rejection. That's a personality, not an education. While academics face a lot of rejection they aren't exactly known for their thick skins!",
                  "author": "flaviadeluscious",
                  "created": 1587976305,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "folnz3v": {
          "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/folnz3v/",
          "text": "I mean, my short answer to OPs title question was basically, \"fuck no\"",
          "author": "perceptionactionprof",
          "created": 1587866429,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "fomoxtf": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomoxtf/",
      "text": "At the research institute I work in, we do both. We consult on practical problems in return for funding grants, and spend the rest of the time doing esoteric theoretical research. \n\nThe esoteric theoretical research is what makes us good at the practical stuff - new techniques are developed in theory, and then implemented the following year in practical settings. Without the new theoretical developments, practical applications would stagnate and never improve. I personally enjoy both.",
      "author": "wellEulerbedamned",
      "created": 1587898444,
      "upvotes": 5,
      "replies": {}
    },
    "fomxvjk": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomxvjk/",
      "text": "I work a lot in industry -half the \"problem solvers\" are actually academic consultants.\n\nIT may depend on WHICH industry how applicable basic science is to a business problem.\n\nIn general, people who think other ways of looking at problems are foolish, instead of different, and anyone who disparages a different level of analysis or approach (as long as it is still valid) is kind of a douche.\n\n Asking how things work in a different field  isn't being insecure .  Nor is admitting you don't know something.\n\nAll of Pharma , most of engineering etc is entirely based in the basic sciences.  taking these to market is a whole other thing, but it is your tax dollars funding these esoteric things, that at the time, have no real world application , that all of a sudden become very important.",
      "author": "OizysAndMomus",
      "created": 1587907142,
      "upvotes": 4,
      "replies": {
        "foo7k2p": {
          "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/foo7k2p/",
          "text": ">IT may depend on WHICH industry how applicable basic science is to a business problem.\n\nYou hit it on the nail.",
          "author": "bennyandthef16s",
          "created": 1587934039,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fomyamh": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomyamh/",
      "text": "Not that I get asked to, I'm in a non-econ social science, but more contempt than insecurity.\n\nUsing methods people don't understand = not caring whether their decisions have solid foundations or are just half-assed things that will surely bite them on the ass in the future (hi, Boeing!).\n\nDoesn't care for the references etc = doesn't care about understanding and solving the actual problem, just about putting what looks like a good enough bandaid on it for the next quarter or until you've moved on to the next firm.\n\nPeople I've known who moved to industry found themselves in situations where they had to explain what interaction terms were to multibillion dollar companies, or explaining why stepwise regression is really stupid if you're trying to actually solve a problem.",
      "author": "smapdiagesix",
      "created": 1587907480,
      "upvotes": 5,
      "replies": {}
    },
    "fon6obn": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fon6obn/",
      "text": "From a non-academic in a field with a lot of intersection between academia and industry (urban planning), I get insecure walking into a meeting with people from academia because I know there’s going to be a lot more scrutiny towards methodological rigour and data quality, etc etc. It happens both ways. I feel like the contempt many in industry feel towards academia stems from an insecurity as well.",
      "author": "yoshah",
      "created": 1587913405,
      "upvotes": 5,
      "replies": {
        "fooo2na": {
          "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fooo2na/",
          "text": ">a lot more scrutiny towards methodological rigour and data quality\n\ninteresting and yes I feel this is true",
          "author": "thatabilady2",
          "created": 1587942875,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "foo2wdf": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/foo2wdf/",
      "text": "Interesting topic... I am not like insecure... but sometime I feel like I am kinda \"degenerating\" in academic field... for instance lot of my colleagues can't say difference between working and doing nothing, maybe its just profesional deformation of creative job, hard to say. Also work habits are way too different in academia (humanities) and 8/5 jobs. From time to time I work (part time) as a plumber and really the way how the concept of working is understood in \"normal\" jobs and in academia is uncomperable... So in general I guess your insecurity is something like \"being lost in the translation\"",
      "author": "JacobWeisenberger",
      "created": 1587931442,
      "upvotes": 3,
      "replies": {}
    },
    "fomihy3": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomihy3/",
      "text": "> couldn't really solve real problems\n\nsorry but this is bullshit, I know we live in a hypercapitalist society where the only people who are considered valuable are those who drive profit for shareholders, but I solve real problems, and if I worked in my fields 'industry' I be causing the fucking problems",
      "author": null,
      "created": 1587891272,
      "upvotes": 8,
      "replies": {}
    },
    "foly15h": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/foly15h/",
      "text": "No. This is just my experience, but the kinds of problems people wanted to solve where I worked weren't meaningful to me and there was a lot of value placed on making money vs. making long-term, impactful improvement. Industry doesn't interest me, so I have no FOMO or insecurities about it.",
      "author": "brownidegurl",
      "created": 1587873235,
      "upvotes": 4,
      "replies": {}
    },
    "foorlev": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/foorlev/",
      "text": "TBH I wish academics were more insecure about this, or at all interested in understandin industry.  It would be super-helpful to their students in the very least to have advisors who undersand how industry jobs work.",
      "author": "thatabilady2",
      "created": 1587944974,
      "upvotes": 2,
      "replies": {}
    },
    "folwrna": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/folwrna/",
      "text": "No.",
      "author": "mojoliveshere",
      "created": 1587872349,
      "upvotes": 3,
      "replies": {}
    },
    "fomham6": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomham6/",
      "text": "No, and presuming that industry are solving 'real problems' whereas academics arent says a lot about values. Maybe your sister is lucky and works for a company that does actually make a positive impact the world, but my experience of industry isn't that. Industry people are wasting their talent and ability 'solving' short term profit driven, often non issues. I get to focus on things I care about, things that actually make the world better rather than enrich a bunch of other people.",
      "author": "tc1991",
      "created": 1587889990,
      "upvotes": 2,
      "replies": {}
    },
    "fotwsc3": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fotwsc3/",
      "text": "Definitely yes I did, when I still worked at the university. Where I completed my degree (Finland), universities aren't really valued very high as far as job experience is concerned. This is especially true with my field, as it's an engineering field, where the industry is everything.",
      "author": "RRautamaa",
      "created": 1588068924,
      "upvotes": 1,
      "replies": {}
    },
    "folxtic": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/folxtic/",
      "text": "no lol",
      "author": "a_large_plant",
      "created": 1587873082,
      "upvotes": -3,
      "replies": {}
    },
    "fomn3q0": {
      "link": "/r/AskAcademia/comments/g82eky/academics_do_you_get_insecure_not_having/fomn3q0/",
      "text": "industry experience is the fattest red flag\n\neven having downs looks better on your resume",
      "author": "manifest-decoy",
      "created": 1587896367,
      "upvotes": -6,
      "replies": {}
    }
  }
}