{
  "sid": "qr9ghs",
  "link": "/r/AskAcademia/comments/qr9ghs/how_realistic_is_it_to_do_a_phd_in_2_years/",
  "title:": "How realistic is it to do a PhD in 2 years?",
  "text": "My academic background is a bachelor of science and a master of public health. \nI would also look to join an existing project which has already collected the data. \n\nAlso, would it be appropriate for me to ask this question to a potential supervisor without offending them?",
  "author": "CarpathianPrincess",
  "created": 1636593858,
  "updated": 1636654656,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.18,
  "comments": {
    "hk5qeqe": {
      "link": "/r/AskAcademia/comments/qr9ghs/how_realistic_is_it_to_do_a_phd_in_2_years/hk5qeqe/",
      "text": "I think that part of the process of obtaining a PhD is study design and data collection. If the data already exists, you are missing a large portion of the process. That being said, if your line of work is predominantly mining existing databases, I don't see why not. \n\nUltimately you will likely save time by having a M.S going in, that could potentially wave some course requirements, but maybe not, depending. If coursework is in the picture, no way 2 years in is doable. If it's just a couple stats classes, then maybe.\n\nImo, your advisor should not let you graduate until you both meet satisfactory requirements to earn a PhD, but also not let you graduate until you are competitive for your career goals. If you intend to stay in academia, two years likely isn't enough time to get the credentials to secure competitive positions, which snowballs until you get weeded out of the field.\n\nI have found that it's worth it to work until you are prepared for the onslaught of competition ahead, even if you could technically graduate much earlier. Being at the top of the food chain makes it easier to stay there. Science is no different from any \"rich get richer\" scheme, and taking more time in a good graduate program is a good way to start.",
      "author": "ActionXPotential",
      "created": 1636601365,
      "upvotes": 8,
      "replies": {}
    },
    "hk6ynrk": {
      "link": "/r/AskAcademia/comments/qr9ghs/how_realistic_is_it_to_do_a_phd_in_2_years/hk6ynrk/",
      "text": "What do you think a PhD is? It sounds like you just want someone to sit you at a desk and tell you what to do, and then you do that data analysis for 2 years. That isn't a PhD.",
      "author": "Honestaltly",
      "created": 1636632287,
      "upvotes": 4,
      "replies": {}
    },
    "hk5bl2b": {
      "link": "/r/AskAcademia/comments/qr9ghs/how_realistic_is_it_to_do_a_phd_in_2_years/hk5bl2b/",
      "text": "Assuming you're in the US, at least I would say extremely unlikely. Shortest I've seen is 3 years with folks who either had extensive knowledge of their research topic before coming in or didn't care about publications/conferences. Coursework alone can take 1.5 -2 years and then you also have to do a proposal, and then a thesis/defense. With institutional roadblocks and your supervisor having to approve each step. This might depend heavily on the research area, though. I'm in engineering/environmental sciences.\n\nI wouldn't be offended if a potential advisee asked this. Not everyone has a parent with a PhD to tell them of expectations ahead of time!",
      "author": "Prukutu",
      "created": 1636594674,
      "upvotes": 9,
      "replies": {}
    },
    "hk5li4j": {
      "link": "/r/AskAcademia/comments/qr9ghs/how_realistic_is_it_to_do_a_phd_in_2_years/hk5li4j/",
      "text": "Possible? Maybe. A good idea? No. Many people do doctoral work on existing projects with data collection already complete and are expected to do more than two years of work. If a prospective doctoral student asked me this question, I would immediately put them in the no pile. To answer your question, I would not be offended. But I would think they do not know what a PhD is and would wonder why they are trying to rush it. If a professor application came through with a two-year doctorate, I would be very hesitant to even interview them unless they published multiple articles in elite journals. Rather than complete your doctorate quickly, try to complete it well. You might want to talk to your professors to get some guidance on doctoral programs. Good luck.",
      "author": "professorbix",
      "created": 1636599085,
      "upvotes": 7,
      "replies": {}
    },
    "hk5bfr4": {
      "link": "/r/AskAcademia/comments/qr9ghs/how_realistic_is_it_to_do_a_phd_in_2_years/hk5bfr4/",
      "text": "It's not. 3 years is normal for some European/UK programs and that's about the shortest you can do. I do know someone who graduated a few months early from a 3 year program, but they were extraordinary and had over 20 publications.",
      "author": "Monsteriah",
      "created": 1636594610,
      "upvotes": 11,
      "replies": {}
    },
    "hk6wng2": {
      "link": "/r/AskAcademia/comments/qr9ghs/how_realistic_is_it_to_do_a_phd_in_2_years/hk6wng2/",
      "text": "I would not take seriously any PhD that could be completed in 2 years. Probably a diploma mill.",
      "author": "Sea-Plum5507",
      "created": 1636630855,
      "upvotes": 3,
      "replies": {}
    },
    "hk6mo23": {
      "link": "/r/AskAcademia/comments/qr9ghs/how_realistic_is_it_to_do_a_phd_in_2_years/hk6mo23/",
      "text": "No",
      "author": "DeepSeaDarkness",
      "created": 1636622646,
      "upvotes": 1,
      "replies": {}
    },
    "hk71f2n": {
      "link": "/r/AskAcademia/comments/qr9ghs/how_realistic_is_it_to_do_a_phd_in_2_years/hk71f2n/",
      "text": "Shortest I've seen is 3 years in the US, but that was after a 3-year masters, and the candidate in question could basically hit the ground running the moment he finished his master's degree.",
      "author": "r3dl3g",
      "created": 1636634089,
      "upvotes": 1,
      "replies": {}
    },
    "hk5dn75": {
      "link": "/r/AskAcademia/comments/qr9ghs/how_realistic_is_it_to_do_a_phd_in_2_years/hk5dn75/",
      "text": "With a masters degree you'll most likely need to take 42 credit hours to graduate. There are also restrictions on when you can present your proposal and defend.\n\nMost universities have a restriction on how many credit hours you can take in a semester with out an override. This is usually 15 credit hours.\n\nBasically unless you KNOW what your dissertation is going to be on already and you have started on your proposal and have a committee already established 2 years would be VERY hard but I guess possible...",
      "author": "HSDropoutJK",
      "created": 1636595582,
      "upvotes": 0,
      "replies": {}
    }
  }
}