{
  "sid": "q3dyl1",
  "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/",
  "title:": "Where do you advertise Research Fellowships (in the UK)?",
  "text": "I am a new academic, just won some research funding, and I am advertising for a longterm Research Fellow.  However, I am getting very few applications.  This is my second round of advertising.\n\nThe advert is on the university jobs page, and on [jobs.ac.uk](https://jobs.ac.uk).  I've also posted to arXiv jobs too.\n\nI am also sharing with all my contacts (email, LinkedIn etc) and through this I have spoken to a couple of people who have been interested, but still no-one is applying.  \n\nI'm at a loss!  Are there any other sites people post to?  Is it always this difficult to recruit to a RF?\n\nAny advice gratefully received!",
  "author": "dangerroo_2",
  "created": 1633627313,
  "updated": 1634078695,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hfr9cio": {
      "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfr9cio/",
      "text": "I am probably in a different field, but am based in the UK. Any academic job I've ever applied for I've found on [jobs.ac.uk](https://jobs.ac.uk).\n\nYou say you've spoken to people who seemed interested, but then didn't apply. That makes me think it might be an issue with the job or how it's advertised (rather than where it's advertised)? Did you have any guidance from colleagues or HR on how to write the ad?",
      "author": "New-Meringue",
      "created": 1633630133,
      "upvotes": 5,
      "replies": {
        "hfre0mk": {
          "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfre0mk/",
          "text": "Yeh I think you’re not far wrong. I expect anybody interested will be on jobs.ac.uk.\n\nThe advert was vetted numerous times by HR/funders so overall I think it looks OK to me/to the uni recruitment team. But having never applied for postdocs myself maybe I’m missing something. It’s a fairly niche 4yr post and I’m wondering whether it’s too niche, or just too long!",
          "author": "dangerroo_2",
          "created": 1633632061,
          "upvotes": 1,
          "replies": {
            "hfs8zxk": {
              "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfs8zxk/",
              "text": "The answer is obvious, too niche to even get a candidate, most likely pay rate on top of that in many fields, and then Brexit/Coronavirus. \n\nI have no idea where you are in the UK, but all academic pay rates in the south of the UK are basically a joke given the cost of living, and that is also the case for many Northern cities as well these days. \n\nNot sure why people ask why they can't get candidates when academic pay rates have spent a decade slowly being eroded. A PhD student I know, first job out of their PhD for a company in Switzerland got offered the equivalent of £80K, they would be mad to stay in the UK.",
              "author": "Psyc5",
              "created": 1633645301,
              "upvotes": 3,
              "replies": {}
            },
            "hfrfm89": {
              "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfrfm89/",
              "text": "I mean this is just an example of why vetting by HR is both great and bad. Second pair of eye for getting rid of mistakes is great! But HR typically write boring staid drivel. And people wonder why some job adverts are simultaneously somehow boring *and* confusing.",
              "author": "MFA_Nay",
              "created": 1633632719,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfrbypf": {
      "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfrbypf/",
      "text": "I’ve seen a few advertised on Twitter. If you tag the relevant professional groups you might find the right person.",
      "author": "GalwayGirlOnTheRun23",
      "created": 1633631212,
      "upvotes": 3,
      "replies": {
        "hfreizr": {
          "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfreizr/",
          "text": "Not a bad suggestion, will give it a go!",
          "author": "dangerroo_2",
          "created": 1633632271,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfr81v4": {
      "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfr81v4/",
      "text": "You've already mentioned jobs.ac.uk\n\nThis is the way.\n\nIf there are any mailing lists for your field, then that's a good idea, too.",
      "author": "Vievite",
      "created": 1633629593,
      "upvotes": 2,
      "replies": {
        "hfrey0v": {
          "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfrey0v/",
          "text": "Thanks for confirming! Alas it means it’s the advert/job that is the issue….",
          "author": "dangerroo_2",
          "created": 1633632444,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfunxi3": {
      "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfunxi3/",
      "text": "Remember that 80% of application generally arrive in the last 48 hours of it being open.\n\nHave you shared using relevant jiscmail lists for your field?",
      "author": "OrbitalPete",
      "created": 1633699512,
      "upvotes": 2,
      "replies": {
        "hfv9krl": {
          "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfv9krl/",
          "text": "I am hoping there is a last minute rush! I have not tried jiscmail lists - will give it a go!",
          "author": "dangerroo_2",
          "created": 1633709050,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfu26tu": {
      "link": "/r/AskAcademia/comments/q3dyl1/where_do_you_advertise_research_fellowships_in/hfu26tu/",
      "text": "Send this offer to universities and professors you’re in touch with. They will advertise within their departments. This way the people seeing your advert will be more targeted and will end up getting some applications too.",
      "author": "bouncii99",
      "created": 1633684682,
      "upvotes": 1,
      "replies": {}
    }
  }
}