{
  "sid": "lndq8r",
  "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/",
  "title:": "Academia, anxiety, addiction",
  "text": "For a bit of background, I (27F) am a graduate student in the field of social sciences. I've been mentally ill for at least 7 years now and getting treatment all the while. The stress and isolation of the pandemic combined with high demands and tons of coursework at my program have worn me down to the point that I've been consistently falling behind with my coursework and thesis work for weeks now, if not months. \n\nSo, I've recently started drinking to cope with the anxiety and stress. This is not a road I want to go down, though, especially since I have no illusions that it'd somehow help me overcome the demands of grad school and finish my degree.\n\nHave you had similar experiences during your own life in higher ed, and how did you manage to climb out of the proverbial hole?",
  "author": "Rose_Illusion",
  "created": 1613734217,
  "updated": 1634080766,
  "over_18": false,
  "upvotes": 183,
  "upvote_ratio": 0.96,
  "comments": {
    "gnzw9ux": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/gnzw9ux/",
      "text": "I developed a drinking problem after marriage and while completing undergrad and masters degree. I used it to cope with isolation and to cover up feelings. Therapy, although I resisted, was the most helpful thing for me in the long run. \n\nMy drinking stemmed from depression. No motivation. Alcohol, simply put, gave me motivation. It helped me through school. Or so I thought. I ended up with serious anxiety on top of depression. It was horrible. I was scared to stop drinking. Afraid of withdrawals. I was a mess. \n\nI finally went to an actual psychiatrist and got my meds straight and continued therapy. I’m many years sober now. I have weaned off all of my antidepressants except Wellbutrin. I’ve tried to get rid of that one but I have some sort of genuine imbalance where I revert back to needing sleep all the time without it. So I’m okay with continuing to take it so I can have a quality of life. I’m a yoga and meditation teacher. Have a wife and daughter. My practices and family both keep me grounded and well. Open communication with my wife was hard to develop but I eventually just had to become comfortable with sharing and feeling feelings. I found that many feelings I was trying to avoid stemmed from childhood experiences.\n\nI use light therapy every day. The light is called a happy light, the one I use. I run. I take cold showers and do breathwork. Basically every day is about becoming more mentally and spiritually healthy. I and those around me are better for it.",
      "author": "Mighty-KC",
      "created": 1613734813,
      "upvotes": 101,
      "replies": {
        "go0yfd7": {
          "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go0yfd7/",
          "text": "What is a light therapy?",
          "author": "gmu_nu",
          "created": 1613755337,
          "upvotes": 2,
          "replies": {
            "go1fos6": {
              "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go1fos6/",
              "text": "https://www.healthline.com/health/depression/light-therapy",
              "author": "Mighty-KC",
              "created": 1613762996,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gnzwtgc": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/gnzwtgc/",
      "text": "The first thing to realize is that you’re not on your own. Please reach out and let your thesis supervisor know what’s going on! My issues are largely cognitive due to adult ADHD so it may not be a perfect fit for you. \n\nFor a start, counselling supports vary from school to school but even a baseline of support can help. Tapping into counselling for me involves an extra line of accountability. I meet with someone once every couple of weeks now and tell them what my priorities are and what’s standing in the way. It’s my opportunity to reality check: \n- am I on an adequate timeline?\n- have I accomplished the previous goals?\n- what’s my next task and how do I maintain a schedule that gets me there?\n\nMood disorders don’t have to be so different! Get an excel sheet going, put your personal timetable into it week to week and use it as a visual cue. You’re working in-spite of your anxiety... that’s a tedious, exhausting task, so give yourself a bit of compassion and conserve some mental RAM where you can.\n\nThe addiction? That has to be nipped. It’s normal! You’re turning to your pleasure centre to cope with a tidal wave of stress! But, it’s also dangerous. You can’t give up everything you’ve worked this hard for just for a momentary drip of neurochemical-feel-good soup.",
      "author": "DevvieWevvieIsABear",
      "created": 1613735274,
      "upvotes": 38,
      "replies": {}
    },
    "go08ogq": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go08ogq/",
      "text": "Hi friend, 29F with similar story. Recently began therapy again for depression. Am scheduling psychological testing to determine whether there's more than just depression.\n\nMy story:\nFor me, prior to my mental health crisis, the stress of Research and PhD was the \"good\" stress and life was the \"bad\" stress. I liked research and usually perform well under pressure.. however, life stress confuses and scares me.. I had a bad breakup, unexpected pregnancy (was on oral birth control) and traumatic termination of that pregnancy, and then 6 months or so of catatonic depression.. I stopped sleeping, so I had no energy to exercise.. I didn't exercise so I had no appetite. I had no appetite so I didn't eat.. etc.. There was a period of 2-3 wks where I didn't shower or change clothes.. at that point alcohol was the only thing that allowed me to get calories and get sleep. But obviously the hangovers made work difficult. \n\nThe rebound anxiety after drinking 1-2 bottles of wine in an evening was unbearable. Meltdowns in lab meeting. Talking back to my PI. Doing the same IFA staining over and over and over again because it was the only thing that made me feel like I had some control.\n\nMy depression also affected my memory. For example, I was completing my qualifying exam in the middle of this crisis and would work all day on it. Then the next day I'd sit back down at my computer and have no recollection of what I had written. It was troubling and scary. I thought I was losing my mind.\n\nMy recovery:\nThe most important thing for me was finally reaching out to a doctor. She put me on an antidepressant. The antidepressant doesn't make the sadness or anger go away but it does increase energy and thus gets you off the proverbial bed of sadness. For me it gave me energy to get back in the gym. Back in the gym I was able to refocus on specific physical goals. Pushing hard in the gym allowed me to eat, and made me tired enough to sleep through the night. Also being in the gym requires me to see people - I live alone and work alone due to covid. Seeing people requires showering regularly. Showering regularly makes you feel better. It sucked at the beginning but now I derive so much pleasure from getting to the gym/in the pool/out for a run. Finding pleasure in things was something I never though I'd have again.\n\nAlcohol:\nIt seemed impossible at the time but im nearly 2 months sober (read: no alcohol ALONE - I have on 3 occasions had drinks WITH FRIENDS). I think back on how I felt in the midst of everything and to be perfectly honest I didn't think I'd make it this far. I don't look at my alcohol use as anything other than a last ditch survival mechanism. It really was the only thing I had to motivate me to get up, finish my work, and get out of the house. Being tipsy/drunk allowed me to have an appetite. Being drunk let me fall asleep. It was what I had. But it is addictive and the first four days or so after I drink I have strong cravings. I also smoke cigarettes so, double whammy. \n\nI cant tell you how I managed to be sober. I think it came down to rage. Once my antidepressant started elevating my energy I didn't need alcohol to motivate me, I had motivation on my own. Which allowed me to realize that, hey, fuck that dude who broke my heart, knocked me up, and abandoned me. I'm going to fucking tear shit up in the gym so I can beast mode my way through his skull. Or something like that. I was able to substitute my goals for my physical wellness for alcohol. But it wasn't easy. There were setbacks. I go on.\n\nThis coming Tuesday I have my work in progress for the dept. In the last two weeks, all of a sudden, I realized my mind was back. My data is actually good. My presentation is actually dynamic and interesting. Most importantly, it feels like me. My passion for my work is back. And that's a wonderful feeling after 8 months of gray.\n\nMy therapist asked me on Wednesday to write a letter to myself about how I feel now that I am sort of out of the woods. Something to read the next time I have a crisis. Something to tell myself that it's survivable. I guess this is that.\n\nAll I can say is - it NEVER feels survivable. It ALWAYS feels like the end.. In the words of Allie Brosh in her new book, \"Solutions and other problems\", the feelings we have of despair, dread, fear, etc... they feel like the end. So we lie on the ground and we feel those feelings drowning us and darkening the skies. We wait for the end to come.\n\nBut the end doesn't come. We wake up, hungover, anxious, depressed, but alive. As long as we live moment to moment, even though we are certain that the next moment brings death, we are alive. And as long as we are alive we might as well do something. And surviving is something to do.\n\nI survived by realizing the sadness, and the anger, and even the love and the joy, that I carry with me, are the things that help me navigate the world. When I lost my love and joy, and when I even lost my anger, my sadness kept me alive. It kept me alive long enough to get my anger back. My anger kept me going long enough to feel joy again. And now that I have joy, I think love isn't far behind. I know somewhere in you is a sadness, or an anger, or a love, that is keeping you alive. And as long as you are alive, keep on surviving. <3",
      "author": "Monosigaovata",
      "created": 1613743339,
      "upvotes": 37,
      "replies": {}
    },
    "go01759": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go01759/",
      "text": "This resonates my friend. I didn’t realize how much my drinking was taking over my entire life. It no doubt affects my health and really clearly began impacting my productivity.\n\nToday was my first day without destructive drinking in several weeks. I never expected to get myself in this situation. Today the anxiety was brutal. I managed to get a bit of work done but I’m already behind in the program.\n\nSorry I don’t have advice. It’s just odd timing for you to post this compared to my own struggles. I just hope I don’t relapse.",
      "author": "New_Hawaialawan",
      "created": 1613738694,
      "upvotes": 15,
      "replies": {}
    },
    "go018cc": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go018cc/",
      "text": "Does your school have counseling services? Mine has them for free. \n\nAs the daughter of someone with a drinking problem, good on you for recognizing the issue early! You can stop this! I believe in you!",
      "author": "dooooooooooooooope",
      "created": 1613738719,
      "upvotes": 11,
      "replies": {
        "go08moq": {
          "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go08moq/",
          "text": "My uni does have a counselling service, and a pretty good one at that. I've contacted them today and will see how it goes.\nIve also been talking to a counsellor for a few years now, and I'm seeing a psychiatrist regularly about my meds.\nAnd as for drinking problems, my father is a recovering alcoholic and I've got plenty of that in my family history...",
          "author": "Rose_Illusion",
          "created": 1613743310,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "go040lz": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go040lz/",
      "text": "Smoked weed every day for almost all of my Phd, sometimes all day every day. You need a good therapist, not just CBT, if the problems are serious (and it very much sounds like they are) and not just medication (although I have nothing against that if it helps). And close friends and proper self-care -- it's hard during lockdown, it's hard if you're feeling like shit, it's hard if you've never learned how to do this but it's possible to learn and a good therapist will help you.",
      "author": "Feral_P",
      "created": 1613740610,
      "upvotes": 11,
      "replies": {
        "go0fi1a": {
          "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go0fi1a/",
          "text": "This is me. Everyday I say I'm not going to smoke weed, everyday I cave. Sometimes it's in the morning, sometimes its not until I'm done in the lab. But I want to stop, but it feels so futile sometimes. \n\nI'm talking to a counsellor for these issues, but if you have any tips and tricks.",
          "author": "TheScienceMothra",
          "created": 1613746826,
          "upvotes": 6,
          "replies": {
            "go1lvqx": {
              "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go1lvqx/",
              "text": "I have gone through periods over the past 4 years like this. Not to sound trite but not having any weed around helps for one, and not buying any more (although while I write this I have a giant jar sitting on my desk LOL). To get some more control over my weed consumption, I first just would tell myself I'd only smoke at night, then from there I'd move it to just the weekends. Hanging out with people who don't smoke is a giant help for me too, because I noticed I was smoking everyday because I was hanging out with my neighbors who would invite me over to eat with them, we would smoke, and I'd waste a bunch of time. I try to just treat weed as a \"treat\" and not something that I use to *treat* my anxiety. I am seeing a psychologist too for the past 3ish years and working through some child abuse/other stuff from my past, which I think is the real source of my anxiety, not even my PhD. So I think I was self-medicating myself for that for a while. You may also consider switching to a high CBD, low THC strain so you just get the kind of mild wellbeing high rather than a full body or mind high (my friend also in PhD did this to quit smoking cigs). Good luck!\n\nEdit: I also think focusing on your health, ie exercising, cooking healthy food everyday helps too. I would get super high then go exercise, and by the time I'd be done exercising, I wasn't high anymore and could do work or sleep. I also adopted  dog to keep me happy which I think has done wonders :D Message me if you have any questions!",
              "author": "notjennyschecter",
              "created": 1613765783,
              "upvotes": 5,
              "replies": {
                "go4hu83": {
                  "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go4hu83/",
                  "text": "Thank you for this response. I try not to buy weed, but I live in Canada and there are two dispensaries within walking distance, so self control can be difficult. I think my problem is mainly the use of it as a treat, since often times I'll convince myself to smoke early in the morning because yesterday I only smoked in the evening (which is the current dialog going through my head). I definitely use it to treat anxiety and likely depression, but I want to have a healthy, well-adjusted relationship with weed, and I wonder if that's possible. I feel like I lack the self-control required to make lasting changes. I'll succeed for a few weeks, then go right back to the normal smoking schedule. The lockdown isn't helping at all, because there's nothing to do and everything is so monotonous. Hopefully talking to someone about this can help figure out strategies to deal with the mental health problems, and it'll get easier.\n\nAs for smoking company, I agree completely. The one person I smoke weed with is my partner,  but he's been gone for 2 weeks, and my smoking has increased, not decreased as I had hoped. But I'll keep trying. \n\nI'll try switching strains, that's a really good  suggestion. I'm also considering going on actual meds for the mind, which might help this whole thing too.",
                  "author": "TheScienceMothra",
                  "created": 1613833525,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "go3uopj": {
              "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go3uopj/",
              "text": "Don't be too hard on yourself. When forming or breaking any habit, relapse is normal and it's not the end of the world. The key is getting back on the horse asap and not beating yourself up about it. One trick I found useful is pushing smoking as late into the day as possible. Once I was consistently on evenings only, I dropped it down to weekends-only and that's where I'm at now. Not picking up more than £10/week since whatever I have I will smoke. \n\nAlso, if possible, separate tobacco and weed. Tobacco is incredibly addictive and compulsive and when I was smoking joints I'd often find that I was rolling up just in order to get the nicotine hit, without realizing it. When I separated the two and started vaping nicotine and weed separately, I could learn when I wanted one and not the other, and my weed use naturally dropped. Cutting out nicotine is imo much harder than cutting out weed, but it was years before I admitted I was also addicted to nicotine, so I was really trying to cut both out at once and that's much harder than it needs to be.\n\nBut, also, for me, I think there were underlying reasons why I smoked. Mostly to cover up the loneliness and also mental health issues. It was a coping mechanism, and it served a purpose. But, cutting out a coping mechanism without having other (healthier) ways to cope is naturally going to be difficult. For me, I needed to build a proper support network/circle of friends and learn proper self-care skills (eating enough and exercising a bit) in order to help fix the issues that weed was covering up. Otherwise, you might quit but you end up back in a position where it actually makes sense to go back to it. Therapy, also, for the deeper underlying issues.",
              "author": "Feral_P",
              "created": 1613815062,
              "upvotes": 2,
              "replies": {
                "go4jtbi": {
                  "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go4jtbi/",
                  "text": "Thank you for your response. I definitely have a hard time with getting back after relapsing. Last year I was almost a month sober, but then my partner came back home and everyday was a celebration with weed. The easiest way for me to smoke later in the day is to be out of the house, which I can't really do right now with the lockdown. I can go into lab and not smoke, but I have a hard time being at home with my bong in the next room. Its always in the back of my mind, even when I'm working and everything is fine. I'm considering getting rid of my bong for this reason and just smoking joints and nicotine-free vapes.\n\nI try not to buy weed, but I live in Canada and there are two dispensaries within walking distance, so its easy to just pop by a store and pick up a half o or pack of prerolls. \n\nAs for tobacco, I haven't smoked cigarettes in probably 4 years. But recently I've thought about picking up a pack. I don't know if I think it'll help with the anxiety/stress, but I get these weird intense cravings for a cig. I don't cave to those cravings at least. I have some self-control after all lol\n\nI use weed to cover up my own negative thoughts, and to avoid loneliness. I have great friends, but everyone's doing their own things and we don't talk often. My family doesn't really know about my mental issues, and we don't really talk about serious issues very often. I'm pretty disconnected from my lab and department here,  so the support is very superficial. I'm working on self care; I love cooking but I haven't been motivated to make any good meals, and I try to do yoga everyday for the mind and body. I've also started knitting to have something to do with my hands, but it doesn't feel like enough to replace the weed that instantly makes me feel okay, wanted, stable, neutral. \n\nI've scheduled reoccurring appointments with a counselor, so hopefully I'll get some insight and strategies for moving forward. I'm glad I'm not alone in this struggle",
                  "author": "TheScienceMothra",
                  "created": 1613834631,
                  "upvotes": 1,
                  "replies": {
                    "go7xpmw": {
                      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go7xpmw/",
                      "text": "Sounds like you're on the right path :) I used weed for very much the same reasons. Especially in the current circumstances, it really does serve a purpose. I've found I've had to (re-)build a lot of friendships recently in order to fill the remaining time. It's taken a few months of concerted effort, but between arranging calls with old friends and reconnecting with various people I've met over the last few years it's really helped. \n\nAlso, just a heads up that the first time I went to councilling I found it utterly unhelpful - I think this was a mix of being given out-of-the-box CBT (which works for many, but wasn't what I needed at the time) and the councillor not being all that great. But I've recently started seeing a cognitive therapist and he's been fantastic. Hopefully you'll have a better experience, but just to say that I've known a lot of people who didn't find the right person initially and were put off by the experience. If you feel it's not helping, or that you're not totally comfortable with your councillor or whatever, I'd encourage you to consider switching rather than giving up on the idea :)",
                      "author": "Feral_P",
                      "created": 1613909654,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "go06ora": {
          "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go06ora/",
          "text": "How did smoking every day impact your PhD?",
          "author": "Bloopbleepbloop2",
          "created": 1613742227,
          "upvotes": 5,
          "replies": {
            "go3ueux": {
              "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go3ueux/",
              "text": "Less productive, I guess. Tbh when I was just smoking in the evenings it wasn't necessarily all that bad, but obviously the times it was all day I got less done than I thought I was doing at the time. Still, on track to finish.",
              "author": "Feral_P",
              "created": 1613814794,
              "upvotes": 1,
              "replies": {
                "go4aueo": {
                  "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go4aueo/",
                  "text": "Okay so it wasn’t a huge barrier for productivity for you. I smoke every day too and have been feeling guilty about it but it makes me like 10% calmer to handle my shit. I like to read sci papers and brainstorm",
                  "author": "Bloopbleepbloop2",
                  "created": 1613829279,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gnzzzps": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/gnzzzps/",
      "text": "I fell into a hole that I wasn't fully aware of at the start of my undergrad, and things got worse and worse over the next decade or so when something happened that made me realise I needed help. I went to counselling at my uni and have been in therapy ever since, as well as a bit later visiting a psychiatrist for diagnosis (ADHD and anxiety) and medication. It's been over a year and things are on average much better than they were, but there's still a long way I'd like to go, and I'm still having bad days/weeks (but not usually months any more!). My supervisor has been partly included where I felt it was needed, and I take semi-regular mental health days as needed. Therapy, as well as counselling for the actual life skills needed for daily functioning and PhD work, have both helped me a lot.\n\nI'd encourage anyone who was struggling to reach out, either to uni services, any student support groups, therapy, or see a medical doctor. Postgrad is hard enough as it is. I think having some close people to be open to is great if you have that (unfortunately I don't have a great support network, beyond my boyfriend and dog), but I know I never could have done it alone and without professional help and support. \n\nI was also on the start of a slippery slope with alcohol, but it got banned during our first pandemic lockdown so I decided to not stock up, and have barely touched it since. How much I relied on it scared me but I know I wouldn't have been able to tone it down by myself (without the lockdown alcohol ban). I've weaned myself over to some fancy (non-alcoholic) drinks that I can drink in the same parts of my routine that I'd have gone for alcohol. Weirdly it's working. But anyhow, I know a little of how you feel, and it's something that you can 100% find some help, advice and support for! This isn't something you need to figure out alone.",
      "author": "ADPhD-hi",
      "created": 1613737814,
      "upvotes": 11,
      "replies": {}
    },
    "go02whp": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go02whp/",
      "text": "Some very good comments here, will just echo the talk to your supervisor or a faculty member you trust, you are probably eligible for a study break or interruption of studies, a few months 'off' may do you a world of good. I took one during my phd due to breaking my wrist.",
      "author": "IntLawprof",
      "created": 1613739881,
      "upvotes": 9,
      "replies": {}
    },
    "go0e9xg": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go0e9xg/",
      "text": "Burnout is real. You need to give yourself a break regularly. May not fix it all but it will fix the burnout at least. C’s get degrees",
      "author": "Reddit_Reb",
      "created": 1613746230,
      "upvotes": 5,
      "replies": {
        "go4b7ru": {
          "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go4b7ru/",
          "text": "They do, but I'm scared that it could negatively affect my future PhD applications...",
          "author": "Rose_Illusion",
          "created": 1613829531,
          "upvotes": 2,
          "replies": {
            "go4gbrp": {
              "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go4gbrp/",
              "text": "Understandable. My road stops at Masters, so I didn’t consider that.",
              "author": "Reddit_Reb",
              "created": 1613832651,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "go0pgvy": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go0pgvy/",
      "text": "I had a rough patch toward the end of my PhD, after a breakup and during a stressful and busy period of both research and writing. I was also having a falling out with my roommate, so I started spending more time at the bar drinking, reading, and writing. Sometimes I'd chat with people. Other times, I'd just enjoy working alone to be out of the office and the house. It definitely took a bit of a toll, I was gaining weight, and my sleep quality was much poorer, but I backed off quite a bit and I'm doing OK now since I've graduated. I've seen others fall into a similar trap, and one guy would even come in to work super drunk and sleep in his office, completely passed out. It was pretty bad.\n\nAnyway, it happens. Just make sure to take care of yourself and find some other outlets to help you cope and deal with the stress. Maybe that means some zoom calls with friends. Maybe meditation and more time to sleep. Maybe hiking or a long drive or some coffee with a book.",
      "author": "DrSpacecasePhD",
      "created": 1613751411,
      "upvotes": 5,
      "replies": {}
    },
    "go0tuaa": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go0tuaa/",
      "text": "You're getting good advice and I don't have any advice to add. But, it's great that you're in treatment for mental illness and I think it's great that you're recognizing a potential problem with alcohol before you've gone way to far down that road.\n\nBest wishes for a healthy recovery and knock 'em dead on your coursework and thesis!!!",
      "author": "rockyfaceprof",
      "created": 1613753312,
      "upvotes": 5,
      "replies": {}
    },
    "go0bvva": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go0bvva/",
      "text": "I'm in the same boat. I'm in my last semester of my master's program. I have bipolar disorder and undiagnosed aspergers. I've been on and off my meds since my grandfather died (August 2020). I then lost two friends (one of which is fictive kin) to COVID-19 less than a week ago. I understand, it's insanely hard to cope right now with the pressure from the pandemic and controlling our mental health. If I were you I would seek out a therapist for counseling or a psychiatrist if you need medicine. I just focus on what school work I can and try to distract myself from my stressors by doing things I used to like, even if they don't pump the serotonin like they used to.\n\nEdit: talk to your advisor about what is going on. If you do not feel comfortable with that you should speak with a school counselor.",
      "author": "CatchallPikachu",
      "created": 1613745021,
      "upvotes": 4,
      "replies": {}
    },
    "go0duai": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go0duai/",
      "text": "I drank pretty much every night for the first three years of my PhD as a coping mechanism. I have since corrected that, but the anxiety and self-doubt regarding my abilities and future in science is still ever-present and has effectively sapped the joy and passion from the experience.",
      "author": null,
      "created": 1613746016,
      "upvotes": 5,
      "replies": {}
    },
    "go0gp9z": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go0gp9z/",
      "text": "Hi. I have been in your position before. I am diagnosed with depression, anxiety and borderline personality disorder. I’m now in my 3rd year of my undergraduate degree but, up until a couple of months ago I was experiencing a lot of pressure and anxiety. I was drinking, smoking a lot and behaving recklessly to cope with the stress. At some point I realised that I needed some sort of system if I ever intended on finishing my degree. I started to schedule small tasks (e.g. one hour of study per subject on a daily basis). Through doing this it made the workload feel more manageable and, I would get those little bursts of pride whenever I would complete tasks. Eventually studying became easier and more enjoyable. I also started to use substances as a ‘reward’ for completing tasks. I’d finish my day at around 7-8pm and then for the rest of the night I would be free to indulge in substances. There are a lot of little helpful tools i’ve used to develop self discipline and to manage stress and anxiety. If you’re interested, feel free to message me.",
      "author": "Interesting-Taro-424",
      "created": 1613747412,
      "upvotes": 4,
      "replies": {}
    },
    "go118h1": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go118h1/",
      "text": "Yes, so much yes. Up until my first year of graduate school, I was racing through life, kicking ass and taking names. Got into my program with an advisor who had worked under some of the greatest in my field. Only to find out he had just completely given up on research and life. I didn’t know any better at the time, blamed myself for EVERYTHING and started going to the little casino across from my apartment to have a few drinks and be around other people.\n\nNeedless to say, that spiraled out of control very quickly. Unknowingly at the time, I had undiagnosed complex ptsd from my childhood and was having severe panic attacks on a daily basis. My advisor was a huge trigger for me (I’ve since left his lab). I thought I was losing my mind and slipping into a darkness I would not return from. \n\nMeanwhile, my regular physician (she’s a NP) was attempting to treat neuropsychiatric disorders without a shred of competence and had me taking 3 different medications that all acted on the same receptors in the brain. Whooooooo man I really thought my next stop was going to be the psychiatric hospital or 6 feet under. Then to find out it was the meds, she could have killed me, and I was walking around with serotonin syndrome for a month. This was pretty much where I hit rock bottom.\n\nAfter 3 years of this torment, I was able to find an amazing trauma and addiction specialist, a psychiatrist who actually listened to me and I finally started receiving the treatment I needed. I’m doing much better today, but grad school is very much intertwined in the trauma now and I find it difficult to still participate. I am learning that my whole world does not need to revolve around this. Publish or perish? Fuck that. I’m learning how to love and respect myself and grad school isn’t going to take that away from me anymore.\n\nThere is an army of people out here, feeling all the same things you are, and that are here to support you. Make sure you take care of you. That degree doesn’t define you, don’t let it. Take care friend!",
      "author": "DrDendrite747",
      "created": 1613756577,
      "upvotes": 3,
      "replies": {}
    },
    "go06rc8": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go06rc8/",
      "text": "You are not alone ❤️ take things one day at a time",
      "author": "Bloopbleepbloop2",
      "created": 1613742268,
      "upvotes": 3,
      "replies": {}
    },
    "go0t7ci": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go0t7ci/",
      "text": "My final year of grad work (3 semesters- year round classes)I: worked 2 jobs and had two 12 hr shifts at the hospital where I did my internship - along with full coursework loads \nAnd had my first kid 2 months before graduation. \nI had panic attacks constantly.  \nI should have gone to see a psychiatrist.  \nMasters and doctoral students also need support where they can be honest about distress.  \nThe entire academic framework from universities in general to grad programs is a framework based on life decades ago and needs to be tossed.",
      "author": "Themfruckus",
      "created": 1613753033,
      "upvotes": 3,
      "replies": {}
    },
    "go1awy8": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go1awy8/",
      "text": "academia (perhaps especially social science) is not worth ruining your life over. stress made me feel physically awful through much of grad school and finishing as quickly as possible to leave that situation was very motivating, because you don't have to live like that.",
      "author": null,
      "created": 1613760885,
      "upvotes": 3,
      "replies": {}
    },
    "go110d7": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go110d7/",
      "text": "Get out, see friends (in person, not zoom). Do something. Like actual physical stuff in groups",
      "author": "lucaxx85",
      "created": 1613756478,
      "upvotes": 2,
      "replies": {}
    },
    "go1nlxn": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go1nlxn/",
      "text": "Honestly doing sports always saved my ass so just go train and let your body move helps with confidence anxiety addiction depression everything basically",
      "author": "jimmy_hawkins_____",
      "created": 1613766572,
      "upvotes": 2,
      "replies": {}
    },
    "go7en4k": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go7en4k/",
      "text": " I took a year off school , convincing myself that I wasnt going to go back and during that time I was chugging 805's to fall asleep and waking up the next day to go to work. I obviously didnt stop to think because I convinced myself that as long as i have money that Ill be better off in the long run. I can tell you right now that because I went from a  miserable to extremely depressed stage at the age of 23 that I feel more comfortable being back on track. Sometimes  imo you just have to go down the rabbit hole cause its there you instinctively decide you dont want that life. In conclusion, my life was S+++ and it got even crappier over time because I chose that, I had no passion for school because i was convinced that even after I graduate I wasn't going to get a job but how can i make that conclusion when I have even tried yet?\n\nIn a weird sort of manner, im still in the \"proverbial hole\", but I've already started the climb\n\nbest of luck!",
      "author": "Thestalliongallops_",
      "created": 1613891474,
      "upvotes": 2,
      "replies": {}
    },
    "godrl18": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/godrl18/",
      "text": "Babe, I am struggling right there with you. If my story helps you to know you are not alone I am happy to share.\n\nI am a second-year Ph.D. and I have some incredibly awful people in my cohort. I love my program, I love my staff, I love my uni, and I love my alumni-fellows...which keeps me going. We lost an integral unit of my cohort in a tragic car accident last semester so I took my first incomplete, which was devastating...but I was also recently diagnosed with late-onset schizoaffective due to military PTSD. Fuck me, right.\n\nMy professors have been so incredibly supportive because I keep them updated on my mental health status as it occurs. Use your disability card as often as you need....you are a warrior! You are getting a degree that only 1%....ONE PERCENT of the world ever receives...during a PANDEMIC! And, I am in Dallas and had the worst of the winter storms. My apartment flooded...blah blah blah. So I am getting thru in a fur coat, with champagne, and THC. Get thru it as you need to...you got this, love.\n\nWe are going to finish this. You deserve that beautiful cap and gown. I am sending my love and academic energy out to you. I am here with you, boo. Namaste",
      "author": "ladydocfreud",
      "created": 1614026903,
      "upvotes": 2,
      "replies": {}
    },
    "go1jw1t": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go1jw1t/",
      "text": "I'm sorry to hear about your situation, but I think your experience is unfortunately pretty common. I sank into depression and I have gotten behind on my work for I'd say the past 2 years while seeing a psychologist. I am slowly getting out of it just now but I did struggle at points in my PhD time with smoking too much weed just to numb my mind to not think or feel anything, and I was an addict. My first year I would drink too everyday I came home from classes because of the intense stress, I just needed something to take the edge off and make me forget my anxiety. I really wish I had seen a mental health professional from the get go, but I didn't start seeing one until I was a year and a half in. Now I am coming up to the end of my PhD and while I am in a much much better mental place, I still deal with tons of anxiety about my work and progress and feel guilty for not being able be at my 100% for the past 2 or so years. I never went on meds because I'm just scared to, and my psychologist said talk therapy would be best for me. I wouldn't rule it out, and I might in the future. I still do feel emotionally worn down but at least I do now feel my emotions are somewhat manageable. Anyways, I hope my story gave you some comfort that you're not at lone at least, I obviously don't sound super chipper because I am mentally exhausted. Haha. But if you aren't seeing some kind of mental health professional, please do! That is what really saved me.",
      "author": "notjennyschecter",
      "created": 1613764886,
      "upvotes": 1,
      "replies": {}
    },
    "go1pagk": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go1pagk/",
      "text": "I'm in a similar situation, albeit I smoked weed. However, I've been recovering lately and am feeling better than a couple months ago. Here's what helped me: \n1) have a routine before you get to work and after work and stick to it; \n2) at the end of the day, look back at what has been accomplished (notes can help there) and identify where you can do better; \n3) never stop trying to do better, baby steps are steps forward nonetheless; \n4) when I get distracted, I close my eyes, take a deep breath or 3, and tell myself the same thing to straighten my mind (in my case it's \"Total concentration, celestial form\"; the point is to clear the mind and focus on the task at hand).\nResearch involves a lot of grinding and it can be unpleasant sometimes. But if the risks you take are worth it because it allows you to get closer to your dreams, then you should do whatever it takes to change in order to achieve it.",
      "author": "pixel-janitor",
      "created": 1613767343,
      "upvotes": 1,
      "replies": {}
    },
    "go2mpfc": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go2mpfc/",
      "text": "Developed a drinking problem to help me with my anxiety shortly before and during grad school. Did the Sinclair Method and it cured me of alcoholism. Now I can treat the anxiety with therapy and meds.",
      "author": null,
      "created": 1613784825,
      "upvotes": 1,
      "replies": {}
    },
    "go32c2r": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go32c2r/",
      "text": "I have diagnosed anxiety and depression. too. All emerged during grad school stress, and I'm surrounded by bullies. I don't know which part of the world you are, but many universities have counseling and psychological help services. My first anxiety attack was before my qualifications, and I called the counseling services. Of course, they didn't give me immediate attention, but they interviewed me, and led me to a group therapy session with other graduate students at our university that is 100% paid by my student insurance. The group therapy didn't cut it, so I applied to counseling services again, they led me to a psychiatrist. I've been on antidepressants for 1.5 years, and they saved my life. People told me that I would feel woozy, or I'd feel like a zombie, but it isn't like that. It just gives you enough energy and mood to be able to cope with things that are very much harder to cope without medication. I also see an individual therapist every two-three weeks depending on the criticality of my mood. Three of them have. helped beyond any friend, family, or support system. So, if you have any possible help services at your university, apply without hesitation. They know best how you can overcome this.\n\nSecond thing I can suggest is [focusmate.com](https://focusmate.com). We are very much alone during the pandemic, and we need human contact. This is a website that matches you with another person for work or chores for 50 minutes. It's not for socializing or chatting, but after a couple of daily or even weekly sessions, you don't feel alone. It also has Friday Community Working sessions (which I'm on right now) where you can chat, too. A group of people meet, and work/study for 50 minutes, and then chat for 10 minutes. I'm on my fifth session today, and I've studied for 50\\*5 minutes, and chatted with people for almost 10 minutes. It's been so much fun. There is also a lot of pressure to make community working multiple days a week. So, you cannot feel that alone.",
      "author": "capucini",
      "created": 1613793221,
      "upvotes": 1,
      "replies": {}
    },
    "go36260": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go36260/",
      "text": "I had stress problems during my undergrad, and Vipassana meditation helped me to reduce anxiety. To learn the technique you need to go for a 10-day camp, but I am not sure a camp nearby you would be running or is it feasible for you to take off right now. Though I highly recommend it. In the meantime, watch some videos of Anapana meditation on youtube on how to practice it and some English discourse. Basically,  Anapana is the first step of the larger Vipassana meditation.\n\nHope you will overcome your challenges and please avoid spoiling your health from alcohol, if possible. Health is more important than grad studies :)",
      "author": "Persimmon-Emotional",
      "created": 1613795335,
      "upvotes": 1,
      "replies": {}
    },
    "go01z0g": {
      "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go01z0g/",
      "text": "Why put yourself through all this. If academia is so hard on you then think of other ways to live. Academia is not worth it.",
      "author": "whiskeyandtaxes",
      "created": 1613739242,
      "upvotes": -2,
      "replies": {
        "go08cla": {
          "link": "/r/AskAcademia/comments/lndq8r/academia_anxiety_addiction/go08cla/",
          "text": "Well, for one thing I really do enjoy learning and doing research, and my program is top notch in the field. And I'm really good at it, I'm published, I got a uni award during my undergrad program, I got a stipend, yadayada \nThere's also the fact that I don't really know how to do anything else, and am not sure what to do if I were to quit",
          "author": "Rose_Illusion",
          "created": 1613743155,
          "upvotes": 14,
          "replies": {}
        }
      }
    }
  }
}