{
  "sid": "qcas71",
  "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/",
  "title:": "Writing a NSF proposal as a postdoc while maintaining maximum ownership of the project",
  "text": "So I recently started my post-doc at a top-lab in the U.S., which I am extremely happy and excited about, but I'm struggling with the tension between working under an advisor while also building my own research portfolio. \n\nI've been nurturing the idea for a project all through my PhD, and my new advisor supports it, and even wants to apply to an NSF grant with the project, due in February 2022. I have a strong sense of ownership with this project, and beyond that, if its funded I want to be able to leverage it into a faculty position. However, per NSF guidelines, post-docs cannot serve as a PI or Co-PI on any grant, and instead are relegated to the \"other personnel\" section. \n\nSo my motivations are to maintain as much ownership of my project as possible, both for personal and professional benefit. With this in mind, the following are potential paths forward:\n\n* Convince my advisor to bump me up to a \"research scientist\" position before February, allowing me apply as a Co-PI. However, if I push too much, I risk damaging my relationship with my advisor, and potentially with other postdocs who have been in the lab longer without such a promotion (it usually comes with a pay raise). It could also be awkward the project is not funded. \n* Wait to see if the project is funded, and if so, negotiate the same \"research scientist\" position, but only *after* my current contract ends in August 2022, and afterwards my advisor should add me as a Co-PI.\n* No negotiation, but make clear in my CV that I was the primary contributor to the grant\n\nI'm new to applying for and navigating grants, so I'd love insights on which of these options might be better career-wise, or if there are other dimensions I hadn't considered.",
  "author": "wise_garden_hermit",
  "created": 1634763442,
  "updated": 1636174541,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hhfuo1r": {
      "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhfuo1r/",
      "text": "Not sure how it works in the social sciences, but you generally can't do these kinds of things in practice in the sciences. You can technically be a co-PI if your title changes, but it will weaken the grant because you're an extremely junior co-PI. I believe NSF and most funding agencies usually won't allow addition of a co-PI after the award is made. The PI level grants aren't designed for postdocs. Neither the funding agency or the university wants a postdoc to have ownership of the grant. You should look for mentored grants like the NIH K99 and other K-grants. Other agencies also have mentored transition grants.",
      "author": "fwafwa",
      "created": 1634780737,
      "upvotes": 6,
      "replies": {
        "hhhhgv9": {
          "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhhhgv9/",
          "text": "Thanks for the insight! I understand why the rules are the way they are, but it does present a sad tension at a time when scientists should be gaining independence. \n\nI'll dig deeper into the sources of mentored funding and see whats available",
          "author": "wise_garden_hermit",
          "created": 1634820921,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhetxwg": {
      "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhetxwg/",
      "text": "I think an open conversation with your PI is in order. You already seem to be taking the view this is going to be a fight and you need to outmanoeuvre your PI yet you also say they're supportive of you. \n\nTalk to your PI about your hopes and also be open to hearing their views. You may not be ready for that post or may need to demonstrate certain things before they can support it or there may be external reasons why they can't. Or they may agree to make you a research scientist if you get the funding and add you as co-PI. If they just shut you down you should ask for feedback on why. You may not change their mind but you might learn something.\n\nRight now you have nothing to lose and a lot to gain so I think going for it and being open and transparent earlier rather than later is in order. Be clear about what it is you want - people often hedge about when asking these things and bosses can easily misunderstand what's being asked for. \n\nLastly, I wouldn't wait until after you've applied because that's going to mean your PI dealing with bureaucracy and they're going to feel like you should have raised it earlier and possibly that you misled them with your intentions.",
      "author": "ACatGod",
      "created": 1634764213,
      "upvotes": 6,
      "replies": {
        "hhfifmu": {
          "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhfifmu/",
          "text": "Thinks, I think you're right that a direct conversation is in order, and honestly I think my advisor would be open to it. I had an incredibly supportive PhD advisor who was really pro-active about doing things in my best interest; the funny thing is that that support left me a bit lost for how to go about having frank/tough discussions. Its a skill I should develop. \n\nAnd your point about not waiting until after submission makes a lot of sense, so I won't even consider that option.",
          "author": "wise_garden_hermit",
          "created": 1634775137,
          "upvotes": 2,
          "replies": {
            "hhfm2qj": {
              "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhfm2qj/",
              "text": "Definitely a direct conversation is in order for your first and second options. Just wanted to add that if those two options don't work out, the third option of adding it to your CV needs to be backed up by your PI in their letter of recommendation. It is a common issue that PhD students or postdocs don't get to be PI even if they contribute significantly to writing the proposal. The hiring committee will rely on your PI's recommendation to judge how much you contributed to the effort rather than just relying on what you say on your CV. Maybe bring this up in your conversation if it looks like the first two options are not feasible.",
              "author": "aaryal0",
              "created": 1634776787,
              "upvotes": 3,
              "replies": {
                "hhhgarz": {
                  "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhhgarz/",
                  "text": "That's an excellent point, thanks for bringing it up. I am pretty certain my PI will be willing to tailor a rec letter to emphasize my work, but I'll have to be proactive about asking & reminding him.",
                  "author": "wise_garden_hermit",
                  "created": 1634820285,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhgnhtc": {
      "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhgnhtc/",
      "text": "Why not apply for a NSF postdoc? Unfortunately you need a full time faculty position to be a PI.",
      "author": "nevernotdating",
      "created": 1634797503,
      "upvotes": 2,
      "replies": {}
    },
    "hhf9stc": {
      "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhf9stc/",
      "text": "Could you take this idea and submit it as an NSF postdoctoral grant? \n\nNSF rules can be unfair. However, it’s the institution that stipulates whether postdocs can be PIs, not NSF. Most institutions don’t allow it because “postdoc” is a temporary position and NSF funding is awarded to the institution, not the PI. So if you are a PI of a grant and you move, the grant will stay at your institution and be given to another PI… usually. Some institutions will let you negotiate to take the grant with you but it’s not usual and entirely at the discretion of the institution.\n\nI agree with what the other poster said- talk to your PI. If this research idea is really important to you, I’d explore what small part of it could be submitted as a postdoc fellowship project, or else save it till you are a PI.",
      "author": "boilerlashes",
      "created": 1634771119,
      "upvotes": 1,
      "replies": {
        "hhfuz8b": {
          "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhfuz8b/",
          "text": "No, NSF and NIH PI grants usually move with the PI. I moved my NSF grant when I moved as faculty to a new university.",
          "author": "fwafwa",
          "created": 1634780885,
          "upvotes": 1,
          "replies": {
            "hhfvo2o": {
              "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhfvo2o/",
              "text": "It depends, I’ve seen both. I’m more familiar with NSF, but in that case the money is given to the institution to distribute / manage, not directly to the PI (like a postdoc fellowship grant is, for example). The institution is not required to release the funds if it can identify another capable PI at the institution. You were lucky to have an institution who was willing to work with you.",
              "author": "boilerlashes",
              "created": 1634781209,
              "upvotes": 1,
              "replies": {
                "hhfyn9i": {
                  "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhfyn9i/",
                  "text": "It is typical for PI-level grants to transfer, for NIH and NSF grants in the sciences. It's not like the university can find someone else to do the same research project. If it is a center grant, then that may or may not stay at the university.",
                  "author": "fwafwa",
                  "created": 1634782593,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hhhgvxw": {
          "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhhgvxw/",
          "text": "I thought about the postdoctoral grant (also mentioned by u/nevernotdating), but I was unsure about the ethics/logistics of it. \n\nDoes the NSF allow submitting *both* a standard grant, along with a post-doctorate fellowship grant in the same (or at least closely related) topic, to the same program? Would submitting both simultaneously affect their likelihood of being accepted?",
          "author": "wise_garden_hermit",
          "created": 1634820606,
          "upvotes": 1,
          "replies": {
            "hhifrgw": {
              "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhifrgw/",
              "text": "Looks like the answer is no: [https://www.nsf.gov/pubs/policydocs/pappg17\\_1/pappg\\_4.jsp#IVB](https://www.nsf.gov/pubs/policydocs/pappg17_1/pappg_4.jsp#IVB)\n\nJust write the postdoc grant.",
              "author": "nevernotdating",
              "created": 1634835819,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhgmfwt": {
      "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhgmfwt/",
      "text": "This happened to me and it is shit. Of you are not pi or co-pi you cannot put it on your CV in most cases. I spent half a year writing a grant which they didn't put me on (i could stay as a postdoc). But after I left the job because the environment was toxic, i have nothing to show for despite it being my idea. I fucking hate if you do the work and the big professors get the credits for it. The system sucks!",
      "author": "momo_dynamics",
      "created": 1634796658,
      "upvotes": 1,
      "replies": {
        "hhhgi1c": {
          "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhhgi1c/",
          "text": "Yeah, its a pain. I just wish the NSF had a position of \"contributor\" or something on grants, just so that a postdoc's name could be formally associated with it.",
          "author": "wise_garden_hermit",
          "created": 1634820395,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhf1x1j": {
      "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhf1x1j/",
      "text": "nice",
      "author": "lerobinbot",
      "created": 1634767602,
      "upvotes": -1,
      "replies": {}
    },
    "hhwg7d2": {
      "link": "/r/AskAcademia/comments/qcas71/writing_a_nsf_proposal_as_a_postdoc_while/hhwg7d2/",
      "text": "If you are smart enough to design, write, and submit a NSF or NIH grant (not a fellowship). Then you should be leaving that lab and start your own lab. Anything done in that lab does not belong to you no matter how much you contributed. Everyone knows PIs dont do shit, yet they get all the credit. You are not the first postdoc whose ideas are acredited to others. It is just a sign that you should move on and run your own lab. Otherwise, you should start writing transition grants.",
      "author": "Outrageous_Ad1882",
      "created": 1635105231,
      "upvotes": 1,
      "replies": {}
    }
  }
}