{
  "sid": "q172b4",
  "link": "/r/AskAcademia/comments/q172b4/good_masters_in_economicsstatistics_program_to/",
  "title:": "Good masters in economics/statistics program to prepare for Accounting PhD",
  "text": "Apologies if this is not the right sub for this. \n\n I have a bachelors and masters in accounting, passed my CPA and currently have 2 years or work experience all in the US. I recently considered eventually going to PhD in accounting but have a number of concerns/weakness in my application:  \n\n\n* No academic research experience\n* No good relationship with professors for LORs\n* Below average quant(math/stats/econ)skills- Most advanced classes I've taken are linear algebra, and Calculus 3. I have never taken econometrics although I am considering doing an online course on that soon.\n\nAfter a brutally honest discussion with a well-published former accounting professor, he suggested that I explore getting a Masters in Econ/Statistics that is academic oriented to address my 3 weaknesses above as well as figure out if academia is really for me. He made the point that even if I do get into a PhD program right now, I would be behind and might not do well; in his opinion I should sharpen my skills with an MA and hit the ground running in the PhD program. He specifically named the Duke MA in economics program as something that he recently observed to be a springboard for a lot of Accounting PhDs.  \n \n\n My question:  \n\n\n1. What do you guys think about his advice?\n2. Does anybody have experience with the Duke MA in Econ?\n3. What are other MA in econ/statistics program I should consider that will prepare me for accounting PhDs",
  "author": "chucknowdis",
  "created": 1633359429,
  "updated": 1634078778,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hfd0mo6": {
      "link": "/r/AskAcademia/comments/q172b4/good_masters_in_economicsstatistics_program_to/hfd0mo6/",
      "text": "That’s not bad advice at all. From my understanding, accounting PhD programs are heavy into research as opposed to fundamentals, so it’d be a shift from what you’ve done. And economics is a good springboard into research. It’s a little less business-y while heavy in the behavioral concepts. An econometrics course or two would probably be invaluable as part of a masters in economics. Duke has a really good econ department. I’m a little partial to Texas A&M because I went to grad school there, but I don’t think your professor is steering you wrong. \n\nNow I’m not an academic, I’m an economist who works in the electric utility industry, so take it with a couple grams of salt...",
      "author": "attaboy_stampy",
      "created": 1633361864,
      "upvotes": 4,
      "replies": {}
    },
    "hfd580y": {
      "link": "/r/AskAcademia/comments/q172b4/good_masters_in_economicsstatistics_program_to/hfd580y/",
      "text": "A master's in Statistics *never* hurt anyone's PhD application. I mean, pretty much all research in the social sciences requires some kind of statistics.",
      "author": "DeskAccepted",
      "created": 1633363737,
      "upvotes": 5,
      "replies": {}
    }
  }
}