{
  "sid": "qurcqq",
  "link": "/r/AskAcademia/comments/qurcqq/leaving_postdoc_early_for_industry/",
  "title:": "Leaving Postdoc Early for Industry",
  "text": "Hi All,\n\nI have been at a postdoc in a small lab for the past 6 months. I originally took the position as I wanted to try and branch out into a new field after my PhD. However, since joining, I haven't really enjoyed the research as much as my previous field and the lab environment hasn't been a great fit. Additionally, this experience has furthered my desire to go into industry.\n\nCurrently I have been interviewing for positions in a number of large pharmaceutical companies and I am hopeful that I will receive an offer. However, if I do, I am conflicted on leaving my position so early in the contract. My PI has been fairly accommodating and with his help I was able to obtain a F32 grant for one of his projects I am working on. My question is how unreasonable is it to leave a position so early. I feel bad about wasting my PIs time and backing out of a commitment early. At the same time, since I want to go to industry, I think the best thing for my career is getting my foot in the door to begin advancing at a company rather than further delaying my start out of a sense of obligation.",
  "author": "ibthugin",
  "created": 1637012869,
  "updated": 1637180882,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "hkrzsni": {
      "link": "/r/AskAcademia/comments/qurcqq/leaving_postdoc_early_for_industry/hkrzsni/",
      "text": "As I can see it, you won't produce much result anyway if your heart and mind are not there. Better to talk with your supervisor, they will understand it.",
      "author": "Hajimemeforme",
      "created": 1637015131,
      "upvotes": 10,
      "replies": {}
    },
    "hkspwot": {
      "link": "/r/AskAcademia/comments/qurcqq/leaving_postdoc_early_for_industry/hkspwot/",
      "text": "I left an F32 early for an industry job. It's your life, you gotta do what's right for you, and life is too short to be doing something you know you don't wanna do. Definitely check the requirements, as payback is likely required depending on the time you signed on for vs when you leave, but doing mostly anything revolving around science will count towards that. Best of luck!",
      "author": "Team_Cap",
      "created": 1637026563,
      "upvotes": 8,
      "replies": {
        "hkt15ux": {
          "link": "/r/AskAcademia/comments/qurcqq/leaving_postdoc_early_for_industry/hkt15ux/",
          "text": "Thank you for your input and the heads up on the F32! Luckily the jobs that I have been interviewing should satisfy the payback obligation on the grant.",
          "author": "ibthugin",
          "created": 1637031528,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hksn33m": {
      "link": "/r/AskAcademia/comments/qurcqq/leaving_postdoc_early_for_industry/hksn33m/",
      "text": "If your end goal is industry, then taking the job is definitely the best option. You have to do what’s best for yourself. \n\nDouble check the terms on your F32 though. Sometimes you need to repay it if you don’t stay for the full length. Some industry jobs do satisfy the requirement so check that.\n\nI don’t know all the details of an F32, but def something you should look into.",
      "author": "NeuroscienceNerd",
      "created": 1637025307,
      "upvotes": 2,
      "replies": {}
    }
  }
}