{
  "sid": "dutn6n",
  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/",
  "title:": "Undergrad suggestion box",
  "text": "Following on from the undergrad chat thread a couple of weeks ago, we thought we'd try a new topic: undergrad suggestions. Somewhere for people to talk about the aspects of higher education that they find strange/unhelpful and how they might be improved. Or better yet, to big up any parts of your education experience that you think have been really good!",
  "author": "foibleShmoible",
  "created": 1573484968,
  "updated": 1634081265,
  "over_18": false,
  "upvotes": 144,
  "upvote_ratio": 0.95,
  "comments": {
    "f78748a": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78748a/",
      "text": "I'm in History and I feel like my formal introduction to theory came way too late, and honestly only because I wandered out into the English department for some electives.\n\nI don't know if it's just a failing of my department, which otherwise I think is quite good, but I really would have benefitted from an introduction to Derrida, Said, Spivak, etc. much earlier in my degree. As it was, I always felt like there was something (some way of thinking in retrospect) that was always just outside my grasp but I didn't know enough to understand what it was and how to fix the problem. Turns out it's theory and I'm not just 'naturally' less capable than some of my peers.",
      "author": "PLAAND",
      "created": 1573486900,
      "upvotes": 1,
      "replies": {
        "f787dhb": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f787dhb/",
          "text": "Since you're an undergrad, don't you think it isn't \"way too late\" for anything?",
          "author": "h11584",
          "created": 1573487076,
          "upvotes": 1,
          "replies": {
            "f787sjh": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f787sjh/",
              "text": "Most people stop after undergrad so if you're learning something late into the 4 years that could've helped you succeed in upper level courses, of course it's too late.",
              "author": "lilysohma",
              "created": 1573487367,
              "upvotes": 1,
              "replies": {}
            },
            "f787sn4": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f787sn4/",
              "text": "I mean, I certainly think that something can come \"way too late\" in an undergraduate degree relative to the expectations of the rest of the coursework. That doesn't mean that it's too late for u/PLAAND's career as a historian or anything dramatic like that, but I think that some things absolutely should come earlier or later in the structure of a degree in any department, and it's fair to comment that this department seems to have structured the degree in a way that wasn't useful in u/PLAAND's experience.",
              "author": "onsereverra",
              "created": 1573487369,
              "upvotes": 1,
              "replies": {}
            },
            "f787zbz": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f787zbz/",
              "text": "I mean \"way too late\" in the sense that I feel it should have been woven into my coursework from the beginning, not in the sense that I've, personally, lost some sort of life-opportunity.\n\nThat said, I would have liked to have been able to have more time in my undergrad to integrate these ideas and examine subjects in relation to them. As it stands, it's unlikely that I'll do any graduate studies. I won't be able to afford them for some time and I'm doing my undergrad late, I'm already 31.",
              "author": "PLAAND",
              "created": 1573487496,
              "upvotes": 1,
              "replies": {}
            },
            "f78r2ip": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78r2ip/",
              "text": "Well it's too late to make up for the benefits in previous years",
              "author": "MsFaolin",
              "created": 1573497209,
              "upvotes": 1,
              "replies": {}
            },
            "f7adi4e": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7adi4e/",
              "text": "It's too late if you're competing with students that were able to really plan and work in the long term since freshman year. Sometimes high school.",
              "author": null,
              "created": 1573526552,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f787qrr": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f787qrr/",
          "text": "A common problem in undergrad curricula is departments (in social sciences at least) like to place theory and methods at the end of the course sequence because it's more difficult and boring for most people and scares them off from the major. But if you're able to take those classes sooner, it will improve your ability to understand the rest of your classes.",
          "author": "tritonetelephone",
          "created": 1573487333,
          "upvotes": 1,
          "replies": {
            "f788bha": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f788bha/",
              "text": "I certainly understand that impluse, and I think on day one I would have needed a lot of easing into theory. Even now reading a lot of Derrida is like running into a wall.\n\nWhat I would have liked to have seen would have been theory woven into my coursework in a way that it was always present and identifiable, but gradually unfolding/becoming less abstracted as I entered more advanced classes.",
              "author": "PLAAND",
              "created": 1573487726,
              "upvotes": 1,
              "replies": {}
            },
            "f788waf": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f788waf/",
              "text": "I actually had the opposite problem in my undergrad – despite the fact that I was in a \"discovery\" major (most people started college not even knowing what the field was), the four foundational classes of my major all assumed that you were already interested in and committed to the field, and focused on equipping you with the skills you needed to be able to do upper-level coursework without ever actually telling students why the field is interesting. It drove me absolutely crazy because, while I was lucky enough to come in already knowing for certain what I wanted to study, I think our intro-level classes probably turned a lot of potential majors off of the subject because they were very technical and not terribly engaging.  \n\n\nWe then had the fun bonus problem that our mid-level classes were open to students of any major with no prereqs, so in any given class about half of the students didn't actually know any of the fundamental skills that students in the major had been told were so essential to be able to take any non-intro-level classes. During my undergrad I probably sat through half a dozen different two-week crash courses in the fundamental skills that were taught in our four-class intro sequence, because every mid-level elective had to do something to get the non-majors up to speed, which made the intro sequence feel like even more of a waste of time.  \n\n\nEven now I'm in an MA program and I'm encountering the same problem – I'm currently in a lecture that is in my area of specialization but most of the students are in different degree programs within my department and have zero background in the area. The lectures are doing a great job of explaining *how* to do research in this area, but haven't touched on *why* that research is interesting and valuable even a little bit. I often chat with the people who sit near me before and after class and when I tell them what I find so exciting about this area of research, they're always like, \"wow, this is actually so cool!!\" and they're not getting that from the lectures at all.  \n\n\ntl;dr I have very strong feelings about how classes that welcome people from outside the field/specialization need to be structured to actually get people excited about that field before they jump right into theory and skill-building.",
              "author": "onsereverra",
              "created": 1573488123,
              "upvotes": 1,
              "replies": {
                "f78bhce": {
                  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78bhce/",
                  "text": "I think this points to the other extreme and how that doesn't really work either. The moment[s] when I have been most able to engage with theory have been when it's been presented alongside something interesting in a way that allows me to chew on both the theory and the subject matter.",
                  "author": "PLAAND",
                  "created": 1573489856,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f7881ef": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7881ef/",
      "text": "This is a cool initiative. Graduated with a BA in the social sciences in the last few years and happy to share one of the best things of my experience + something that was not so great for my peers. I was lucky to be in a unique program where every semester I had a one-on-one tutorial with a professor (largely on a topic broadly of my choosing, with the specifics hashed out based on a given profs research area. Incredible opportunity but partly an aside). As part of this, I also had an overall advisor who remained the same throughout the program, and who helped me liaise with the profs and plan out the semesters. As a result, I had a solid advisor the entire program, and essentially weekly 1-on-1 interaction with professors for the entire 4 years. Obviously, this really helped me become a knowledgeable and specialized student who regularly had their judgement and arguments critiqued. But more than that alone, I think this amount of exposure to professors was fundamental in helping me gain a solid foundation for why I was doing the major I was, and gaining a sense of vision for where to go with the field and whether or not I wanted to go to grad school / start working / do policy vs. research vs. academia, etc. Our 1-on-1 conversations helped build a casual relationship that made exploring my own professors interests in the field and their career tracks more accessible. I definitely learned more about their own intellectual and career development through these meetings than they would share with classes.  But most of my peers had almost no regular interaction with professors on this level (of course, they probably rarely went to office hours if ever), and had advisors who changed frequently and often could only meet with them for what seemed like 15 or 20 minutes per semester. I think I was a hardworking and forward thinking student, and this surely benefited me in having a good head for making future life plans, but I think I probably wouldn't have been half as far along if I didn't have that 1-on-1 exposure with professors and the close conversations about what career + future study prospects look like. All of this is to essentially say, I think too little of the typical undergraduate experience focuses on the question of why we study a given major, and there is too little discussion of what we can actually do with it after leaving university. Almost everything, maybe rightfully, seems to be focused in the middle, just memorizing and internalizing knowledge - take this textbook and read, take good notes in lecture, actually fix your writing as I recommend to you in your paper's comments, and off you go. I know it is not exactly a professors job to get students a job, nor do I think that's what the sole goal of universities should be, but if you were to take the typical undergrad and ask them: did your professors prepare you to work after graduation? They would probably say no, the word job was never even mentioned in class. Possible jobs, possible places of work, the day to day reality of what those positions look like - in my experience (in normal lectures) almost none of that is ever discussed by a professor. Indeed, beyond a brief 2-3 minutes explanation at the beginning of syllabus week, professors barely seem to address why they even became a professor or what they may have done beforehand - information that I think would be invaluable to most undergrads. The same goes for grad schools - professors will kind of offhandedly say \"if you're thinking about grad school, this is good to know\" or \"this name will come up a lot\", etc. but never did a professor mention postgraduate studies more than just in passing. Idk, perhaps some of these observations are a result of my not fully understanding the role of professors, moreso failings on the universities part, failure of students to go to office hours, or the nature of attending a public rather than private institution. This may be unnecessarily long-winded but regardless, I think one of my biggest takeaways from undergrad and my unique track was that my professors themselves, rather than simply the books and articles they had me read, were the most essential resource for my success. And not just in attaining knowledge, but also in knowing what to do with it after. Share more of your own experience with us.",
      "author": "RevolutionaryNews",
      "created": 1573487534,
      "upvotes": 1,
      "replies": {
        "f78f9nn": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78f9nn/",
          "text": "In my case, the only careers I know about (biology) all require a graduate degree.  When I graduated college I took a year off before grad school and worked at a coffee shop because every job wanted two years experience or a Master's degree. I've been told there are jobs out there for someone with a BS in Biology, but I don't actually know anything about them, so I wouldn't talk about them. I suspect a lot of professors only really know about academic jobs, and very few students actually want to go that route.",
          "author": "Maddprofessor",
          "created": 1573492116,
          "upvotes": 1,
          "replies": {}
        },
        "f78g47h": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78g47h/",
          "text": "The 1 on 1 time can somewhat be achieved by going to office hours, although realistically not every student can do this.  I may have 60 students and I simply can't spend an hour with each one every week.  Although most semesters I only have one student actually come by my office hours.  Most students don't care about more in depth learning, they just want to check off a requirement and get out, which is sad.  I love learning and don't really get students who don't care.  That said, I think it's great when colleges offer some sort of optional program where a student can work with a professor one on one, or in a small group of 2-3 students, and engage with the subject on a more personal level.",
          "author": "Maddprofessor",
          "created": 1573492564,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f789fd0": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f789fd0/",
      "text": "[removed]",
      "author": null,
      "created": 1573488486,
      "upvotes": 1,
      "replies": {
        "f78aipo": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78aipo/",
          "text": "Not sure about the cheating, but your second paragraph is a phenomenon happening all over the place (and something I'm looking into in part of my dissertation). It's called \"Upskilling\" (though a cursory google search indicates the term itself has been co-opted by businesses to be portrayed in a positive light). Not sure I have much uplifting to say (besides that this is part of why I'm leaving academia, and I believe it's still possible to live a good life). Stay woke.",
          "author": "PrajnabutterandJelly",
          "created": 1573489220,
          "upvotes": 1,
          "replies": {
            "f78bf00": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78bf00/",
              "text": "[removed]",
              "author": null,
              "created": 1573489813,
              "upvotes": 1,
              "replies": {
                "f78g6x0": {
                  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78g6x0/",
                  "text": "I agree and I'm concerned, or saddened maybe more so, that cheating is being attributed to \"minority\" students, whatever that is code for in this case. I'm hearing that thrown around more and more. Cheating is more common in students with lower academic skills and those who have jobs during college, but entitlement also plays a role. So do cultural factors in some students from other countries, oh and let's not forget intercollegiate athletics and the crap positions they can put students in. My point is there are lots of reasons.\n\nStudents face lots of pressures and may be arriving poorly prepared. If cheating or erosion of standards is a concern, discuss the problems not the people. There was a thread recently about the serious erosion of standards in PhD and EdD programs and it's also a huge issue. Degree bloat and lower standards can be found lots and lots of places, but don't throw specific groups of students under the bus as if they're causing it.",
                  "author": "arrrrr_won",
                  "created": 1573492601,
                  "upvotes": 1,
                  "replies": {
                    "f79pm6o": {
                      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79pm6o/",
                      "text": "I believe it is not that minority students are causing it, but that they are targets for universities that want to profit off the minority student and so push them through classes without really teaching them - by encouraging them to cheat. It is a failing of the system and the teacher, not the student.",
                      "author": "dontpanikitsorganik",
                      "created": 1573512430,
                      "upvotes": 1,
                      "replies": {
                        "f7a8oto": {
                          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7a8oto/",
                          "text": "I’m not understanding how that actually happens, mechanistically speaking. For sure administration has certain goals with respect to diversity, but they don’t usually teach undergrad classes in order to encourage some students to cheat. Your basic professor does not care who passes and who fails with respect to diversity or group membership. I can see if cheating is just tolerated, especially if you have adjuncts involved, but I don’t see it being encouraged for a certain group by profs themselves. \n\nI’m in total agreement that undergrad education is becoming too much of a business and standards slip when this happens, though. 100%",
                          "author": "arrrrr_won",
                          "created": 1573523244,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "f78l8df": {
                  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78l8df/",
                  "text": "> having more qualifying attributes makes a person more competitive for a job   \n\nI think you misunderstand. The phenomenon is this: as more and more people go to college (higher supply) the value of a degree goes down. This is the actual side effect of capitalism - meaning that it actually has nothing to do with qualifying attributes, or actual skill or competence. Rather, companies move the goalposts for what is considered qualifying. Where a bachelors used to be considered qualification enough, now a graduate degree is required. A person with a bachelors (assuming the education remains of the same quality) could do the job, but if a company can hire someone with an advanced/graduate degree, especially because they are in higher supply, why should they hire an undergrad? Essentially, companies reap the rewards of people becoming more and more educated, and education gets you less and less far - even if you are skilled.",
                  "author": "PrajnabutterandJelly",
                  "created": 1573494835,
                  "upvotes": 1,
                  "replies": {
                    "f78nq9s": {
                      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78nq9s/",
                      "text": "Are you taking economics this semester?\n\nYes, capitalistic systems encourage higher degrees of certification - I said so in my original statement. I'm not sure what you are trying to educate me on.\n\nEdit: My concern is much less about completing the requirements for an advanced degree and much more about the racist comments about students from minority groups. I *did* see that some groups in my own PhD program developed ethnic study groups, but it never affected exams (to my knowledge) and is totally understandable - would you rather study with someone who speaks your language or someone who does not?",
                      "author": "skleats",
                      "created": 1573495867,
                      "upvotes": 1,
                      "replies": {
                        "f78ruz2": {
                          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78ruz2/",
                          "text": "My issue was more about this upskilling, which I see as a legitimate complaint about higher education, fit for a suggestion box, maybe could be counter-acted on some level....I pretty much skipped over the racism, which I think is fine to report, call out. And yeah, I suppose this person is not woke.",
                          "author": "PrajnabutterandJelly",
                          "created": 1573497517,
                          "upvotes": 1,
                          "replies": {
                            "f78t7wk": {
                              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78t7wk/",
                              "text": "I refer you to my other comment, and, overall, I agree with you. \n\nTL,DR: There are students who shouldn't go to college and that is okay. They are suited to professions which do not require a college degree (sometimes associated, sometimes none). That should not be frowned upon, and we should not incentivize schools to put these students into college track courses or incentivize college track as the \"best\" option.",
                              "author": "skleats",
                              "created": 1573498049,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "f78lvlq": {
                  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78lvlq/",
                  "text": "In part, this phenomenon demonstrates the breakdown of the myth of education=social mobility. With capitalism, companies will always try to skim off the top, even if the bottom is well educated. In part, this is responsible for the whole \"Barista with a Master's\" thing, though usually those Master's are in Humanities, but that's another story.",
                  "author": "PrajnabutterandJelly",
                  "created": 1573495097,
                  "upvotes": 1,
                  "replies": {
                    "f78rc8t": {
                      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78rc8t/",
                      "text": "I actually to agree with you in one way: the message that everyone should go to college is a false hope. Many parents see a college education as the best hope for their children. The glut of college-educated applicants means many of those students graduate to become baristas, cash register attendants, burger flippers. If they had gone to technical school they could be mechanics, welders, dental hygienists, physical therapy assistants,  and so many more career options. College is not for everyone, and some people should choose a different path - not because they are stupid, but because their career goals do not mesh with college.\n\nCollege education has been idolized because many careers prioritize it, but many do not require it. It does, therefore,  select for students who have not identified a specific field to specialize in. Students who may flunk out in their first year, may complete their degree and still be unable to get a job, may change or make up their minds midway through their degree. \n\nWe should encourage other pathways - incentivizing school districts for AP/DE enrollment is ridiculous. I've had incoming college freshmen who took AP biology (and failed) and childcare classes (which they passed). Why are they then going on to major in biology in college? There are pressures influencing - teachers, family, friends, society, probably others.",
                      "author": "skleats",
                      "created": 1573497314,
                      "upvotes": 1,
                      "replies": {
                        "f78tf1s": {
                          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78tf1s/",
                          "text": "Sure, I think that is one appropriate response, which also means, to me, that complaining about current circumstances is at least somewhat valid - minus the racist parts in the OP.",
                          "author": "PrajnabutterandJelly",
                          "created": 1573498122,
                          "upvotes": 1,
                          "replies": {
                            "f79dgjf": {
                              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79dgjf/",
                              "text": "[removed]",
                              "author": null,
                              "created": 1573505980,
                              "upvotes": 1,
                              "replies": {
                                "f79pce1": {
                                  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79pce1/",
                                  "text": "Interesting, I have witnessed the same in Australia with Chinese students, who are minority and immigrant but financially rich. I always thought it was their lacking English that pushed them to cheat, but there's definitely a culture of cheating/helping/copying together. My university does nought to tackle it because of the vast amounts of money incoming, and because most of these students appear to be using education as a path to visas rather than as a path to employment.",
                                  "author": "dontpanikitsorganik",
                                  "created": 1573512219,
                                  "upvotes": 1,
                                  "replies": {
                                    "f79qtuw": {
                                      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79qtuw/",
                                      "text": "Dude same! My school is a visa mill. And my best friends are immigrants and Asians and Jews — it’s not like I use that term lightly. \n\nCollege is no longer a place for learning; it’s a place for economic upward mobirity.",
                                      "author": "ThiccaryClinton",
                                      "created": 1573513265,
                                      "upvotes": 1,
                                      "replies": {}
                                    },
                                    "f79r8dv": {
                                      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79r8dv/",
                                      "text": "Oh my god I'm reading this and I didn't realise it was this widespread. This happened to me in my masters programme with international rich Chinese students. The cheating was ridiculous and there was absolutely nothing the university did about it. However my Chinese friends told me the incentive to study abroad wasn't for visas it was for the opportunity to get higher paid jobs once back in China from studying at an international school.\n\nI loved my class it was just a kick in the guts to see them cheat the way through it and me work my ass off. Its not their fault the system allows them to do it. I never resented them. I just I can't believe how often I'm hearing this. This was in the UK for reference.",
                                      "author": "dahliafw",
                                      "created": 1573513530,
                                      "upvotes": 1,
                                      "replies": {
                                        "f7apso8": {
                                          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7apso8/",
                                          "text": "Yeah same, I don’t blame or hate the students. When I formalized my complaint to the dean before he resigned, I kept their names out and singled out the professor who encouraged it. The system is designed to make money. They all are.\n\nI was a fan of Bernie’s free college policy until I witnessed all of the cheating. People are abusing college en masse. It means nothing. It’s a power grab. College no longer is about ***learning***.",
                                          "author": "ThiccaryClinton",
                                          "created": 1573535869,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "f79aa2f": {
                  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79aa2f/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1573504750,
                  "upvotes": 1,
                  "replies": {
                    "f79p7e1": {
                      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79p7e1/",
                      "text": "If you read my comment then you should see that my report was not due to disagreement. Is was due to calling out a specific non-public person by name for the purpose of criticism. That's against the rules, and that's that. The edit fixed that.",
                      "author": "skleats",
                      "created": 1573512106,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f78a8mf": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78a8mf/",
      "text": "They have one for economics! There's even a cookie-cutter grad school prep list.\n\nhttps://old.reddit.com/r/Economics/wiki/index",
      "author": "jinnyjuice",
      "created": 1573489034,
      "upvotes": 1,
      "replies": {}
    },
    "f78f13p": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78f13p/",
      "text": "I graduated a few years ago, but I had a two semester Software Engineering set. It was setup so that there were three projects going on. At each project phase students were grouped and placed into a project.  Then in the next phase students were regrouped and placed into another project. \n\nIt seemed weird at the time, but after entering the field I realized that it was a great representation of actual software engineering. It forces you to collaborate with others, understand code you didn’t write and experience firsthand the shortcomings of bad design and lack of documentation. There was usually at least one person that had been on the same project for two phases and that person took on explaining the thought process of the former group. \n\nMy dream job is to be able to teach a course set like this someday.",
      "author": "eggoChicken",
      "created": 1573491985,
      "upvotes": 1,
      "replies": {
        "f78w376": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78w376/",
          "text": "What you're describing sounds very similar to what my cousin is doing at his coding boot camp.",
          "author": "FermatsLastAccount",
          "created": 1573499170,
          "upvotes": 1,
          "replies": {
            "f78whbz": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78whbz/",
              "text": "How do they like the bootcamp? As someone in the field I’m conflicted by them. On one hand they seem to produce job ready candidates, but at the same time I find it difficult to believe they’re getting completely prepared for a long career.",
              "author": "eggoChicken",
              "created": 1573499328,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f78fdkl": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f78fdkl/",
      "text": "Not an undergrad anymore, but as someone with significant (medically diagnosed) memory problems I really wish that there was a shift to make lectures more accessible. I thrived in courses where I could make connections and discuss practical applications, but struggled with theory because I simply couldn’t remember the specifics and it was so far removed from the applied side. Recorded lectures would have been a godsend.",
      "author": "lazyfirefly",
      "created": 1573492177,
      "upvotes": 1,
      "replies": {}
    },
    "f79092t": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79092t/",
      "text": "Sociology undergrad here with a pretty specific gripe but which might be helpful for others: \n\nWhile I do appreciate the money-saving aspect assigning long academic papers with lots of jargon in lieu of expensive text books, I think the class as a whole would benefit from a “cheat sheet” or something along those lines which highlights key points and/or defines key terms from the readings. It would be very helpful to have alongside the reading so to help with zoning out which I’m personally prone to while trying to digest dense academic writing. Of course, this does leave the door open to people just skipping the reading but just a suggestion.",
      "author": "Sloanosaurus-Nick",
      "created": 1573500824,
      "upvotes": 1,
      "replies": {
        "f797osc": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f797osc/",
          "text": "[This](https://sociologydictionary.org/) might help. I am not a sociology major. So, I am sorry if it does not help.",
          "author": null,
          "created": 1573503739,
          "upvotes": 1,
          "replies": {}
        },
        "f79h68g": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79h68g/",
          "text": "No one has an easy time with academic writing, learning to read it is part of the challenge. If you see a term you don’t know—google it, that’s what professionals do.",
          "author": "kinderdemon",
          "created": 1573507522,
          "upvotes": 1,
          "replies": {}
        },
        "f7daxxk": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7daxxk/",
          "text": "Sociology first-year masters student here. If it makes you feel better, no one reads the methods section in-depth unless they're doing further research or whatever. For a class, in almost every situation, you can read the lit review, find out whether it was a survey or interviews or whatever, and read the discussion/conclusions",
          "author": "biggestbaddestnerd",
          "created": 1573612055,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f790xum": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f790xum/",
      "text": "Textbooks are a complete scam. Nearly all the material students \"study\" in a textbook can be found in one form or another for free. Professors should drop textbooks and provide free resources.",
      "author": "BUNDLE_OF_FACTS",
      "created": 1573501078,
      "upvotes": 1,
      "replies": {
        "f793yq8": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f793yq8/",
          "text": "I’d be personally satisfied if professors would just use one or two editions from the current edition. It’s amazing how cheap the 12th edition is vs the 14th edition.",
          "author": "Love_Never_Shuns",
          "created": 1573502274,
          "upvotes": 1,
          "replies": {
            "f79s333": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79s333/",
              "text": "A lot of times, the university is contractually required to use a current edition by whatever bookstore they use.",
              "author": "YangWenli1",
              "created": 1573514056,
              "upvotes": 1,
              "replies": {
                "f8n73bp": {
                  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f8n73bp/",
                  "text": "This is simply not true in my institution (and many others). What IS a factor is that publishers junk previous editions, so students cannot buy that version. I have had this problem repeatedly where a change of edition has been forced upon me as the publisher did not have 400+ of the previous edition left to guarantee for students.",
                  "author": "drrmau",
                  "created": 1574639890,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "f7a9t6s": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7a9t6s/",
          "text": "http://gen.lib.rus.ec/",
          "author": "selectyour",
          "created": 1573524052,
          "upvotes": 1,
          "replies": {}
        },
        "f7aeh6b": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7aeh6b/",
          "text": "One of my professors is using an open source textbook this semester and tbh it's great. I hope the use of free open source textbooks catches on.",
          "author": "HumanDrinkingTea",
          "created": 1573527233,
          "upvotes": 1,
          "replies": {}
        },
        "f8vglxr": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f8vglxr/",
          "text": "This is true for some fields more than others. I built an OER course for my intro class, and overall it’s very good, but I had to write some materials myself, and there are still a few weak areas. I think some people don’t realize just how much information is NOT online, much less in a free, legal, and high-quality form.",
          "author": "SnittingNexttoBorpo",
          "created": 1574868957,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f791mqb": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f791mqb/",
      "text": "From when I was an undergrad, the biggest challenge used to be finding people willing to write letters of reference for jobs, grad programs, etc.",
      "author": "LockedOutOfElfland",
      "created": 1573501352,
      "upvotes": 1,
      "replies": {
        "f7adp0r": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7adp0r/",
          "text": "I taught in smaller, upper level courses and was always happy to write rec letters, I think it's about finding a teacher who actually knows your work well enough to write about you.",
          "author": "possumosaur",
          "created": 1573526682,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f791no0": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f791no0/",
      "text": "Personally, I don't like it when professors don't allow students to use technology in the classroom. On one hand, I can understand why professors may not like technology as it can serve as a distraction and be abused by students. However, I think it works better for students who have poor penmanship or write slowly. Also, digital notes can be backed up via a cloud service whereas if you lose your notebook, you've just lost your notes for an entire semester. Therefore, my suggestion is to allow technology in classrooms. If you find repetitive abuse, then inform your class that they will no longer be able to utilize their laptops or tablets.",
      "author": "bibliophile322",
      "created": 1573501362,
      "upvotes": 1,
      "replies": {
        "f8vg9km": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f8vg9km/",
          "text": "There are pedagogical reasons for taking notes by hand. It’s a different process from transcribing via keyboard. It’s not just about banning technology, but also about encouraging a positive practice. \n\nIf people have bad handwriting or write slowly, some probably need to spend more time writing by hand and developing that skill, just like any other. Some are maybe just not good at it, like how some people are not good at pronouncing the letter “r” in French, or making microscope slides, or any other skill a course might require. It’s not always possible to artificially create a level playing field for everyone, in every respect, in a college classroom. \n\nAs for allowing technology unless/until “repetitive abuse,” you’re underestimating how difficult it is to make that call, and to take away a “privilege” once students are used to having it. That’s a recipe for mutiny. And it’s definitely not a matter of “if,” but “when.” Technology is distracting by design. There is no way that a visible screen is not distracting someone in the room. \n\nSome instructors are okay with that, or don’t believe it’s the case (probably because they don’t know what it’s like to have ADHD or sensory disorders), and so students think, well if Professor A is fine with it, then Professor B must be uptight and controlling for not allowing it. It’s unusual for them to presume that Professor B might actually have the more well-considered or student-centric policy, since it doesn’t immediately feel gratifying. It’s also fairly typical for younger adults to take any restrictions on their behavior as an intolerable exercise of unearned power, it’s later, through experience, that some will come to understand why those policies exist. \n\nIf you’re worried about losing your handwritten notes, digitize them after class. Office Lens is one good app for that; I’m sure there are others.",
          "author": "SnittingNexttoBorpo",
          "created": 1574868723,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f794a2i": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f794a2i/",
      "text": "The amount of cheating I saw in undergrad was ridiculous. It has reached a point where honest students are at a serious disadvantage. This includes what some consider to be \"grey area\" cheating, such as sharing info from previous semesters, excessive collaboration, and undeserved academic considerations like ILPs.\n\nAt the risk of worsening the above issue, please post as much course material as possible online. Some of us work jobs and any schedule flexibility helps. Avoiding posting your slides is not going to help increase class engagement or participation.\n\nGrades mean very little anymore (I say that as someone with good grades). There are a lot of unskilled, dumb people battering their way through high school and undergrad in spite of their low intelligence and mediocre abilities, because they're good at parroting textbooks and have no hobbies or commitments outside of university.\nGoodhart's Law comes to mind. A handful of people in my graduating undergrad class, including one who I genuinely believe was mentally handicapped, got into very good professional or grad programs. Grades are simply no longer an accurate assessment of academic potential, because given enough time and money, any idiot can hammer their way through a degree.\n\nAt the same time, a lot of upper year science courses seem to be purposely misleading, with cryptic, hard to understand slides and lectures. Lots of concepts that stumped me in upper year chemistry and math courses were, in retrospect, very simple to understand, but poorly explained.\n\nNatural sciences has a ridiculous amount of gatekeeping now, particularly by TAs (friends at several universities have had similar experiences). Please be specific with TAs about how to mark. Don't leave it up to their interpretation, I don't want to have to argue against their personal judgments about what constitutes decent work.\n\nTL;DR: lots of academics are worried about their institutions becoming degree mills, but neither academic selectivity, nor hard marking, nor withholding information, nor anti-cheating measures can guarantee that. The only way to guarantee that is assessing students, on a personal level, for academic aptitude (things like confidence in the lab, writing and presentation ability, competent problem solving, all alongside grades), to accurately judge who has the potential to be successful in their chosen field.",
      "author": null,
      "created": 1573502400,
      "upvotes": 1,
      "replies": {
        "f7a5bfm": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7a5bfm/",
          "text": "> At the same time, a lot of upper year science courses seem to be purposely misleading, with cryptic, hard to understand slides and lectures. Lots of concepts that stumped me in upper year chemistry and math courses were, in retrospect, very simple to understand, but poorly explained.\n\nThis is such a huge problem at research universities. Faculty are hired pretty much solely for their research and their teaching is rarely if ever considered in their performance reviews & promotion. All of this creates a perfect storm of professors who have neither the desire nor the time to perfect their teaching and they just get up there and ramble along through the material. The incentive structure in academia is totally messed up...",
          "author": "spec_of_cp",
          "created": 1573520765,
          "upvotes": 1,
          "replies": {}
        },
        "f7ajbhu": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7ajbhu/",
          "text": "The worst part about this is that since cheating is so rampant in intro STEM classes, those of us who teach other classes, especially intro ones, have to deal with students who think they can get away with anything.\n\nI am constantly surprised by how *bad* the students I catch cheating are at cheating. And all that tells me is that they've had several other profs that let them get away with it.",
          "author": "CommodoreCoCo",
          "created": 1573530741,
          "upvotes": 1,
          "replies": {}
        },
        "f7ao87d": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7ao87d/",
          "text": "What do you mean by \"academic potential\"? Because it sounds like you are really saying grades and degrees are no longer an accurate assement of intelligence, in which case- they never were. Degrees are more about persistence than anything. So yes, if they keep trying then with enough time (and money) any idiot can get a good grade or get a degree. It's true for grad degrees as well-I'm no genius by any means yet I met plenty of people with PhDs who I thought were complete idiots. But if you mean academic potential in terms of potential to succeed in academia- they still aren't a good indicator but they are much better than say GRE scores for example \n\nUpper level science courses are not *purposely* misleading. It's just that a lot of professors are bad teachers because they never get any real training on how to teach. All their training is focused on being a researcher. And the way tenure works, teaching isn't really incentivised. They want to give tenure to professors who research will bring in money and prestige to the university. So what you end up with is professors who are primarily interested in doing research and just put up with teaching because they have to\n\nI was always provided a grading rubric by the professor for assignments/exams whenever I TA'ed, even when I TA'ed upper level classes. But there will always be *some* level of subjectiveness when grading, as long as they can rationalize the grade they give, it's not any different than if a professor was doing the grading",
          "author": "stathicus",
          "created": 1573534577,
          "upvotes": 1,
          "replies": {
            "f7baqx3": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7baqx3/",
              "text": "> What do you mean by \"academic potential\"?\n\nPotential to excel in whatever field they're studying, particularly academically. I've heard a couple profs (and occasionally people on this sub) express concerns about issues like grade inflation and universities putting out sub-par graduates, which I assume they are trying to control for, if they think that's an issue.",
              "author": null,
              "created": 1573563152,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f797omm": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f797omm/",
      "text": "Undergrad here. I've been in that position where I have to change my major because people who been there done that ( mainly older than me)  keep on suggesting \"pick promising major\". Why can't I pick something that I love, regardless it's promising or not?.  If I just want to get a job, or money is my goal I ain't spending my time at uni getting a degree. I would definitely get a job straight away or going to vocational school.\n\nJust for those who been there done that, please stop lol.",
      "author": "teddybearalfredo",
      "created": 1573503737,
      "upvotes": 1,
      "replies": {
        "f79d96b": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79d96b/",
          "text": "Why do you \"have\" to change your major? It's your major - you get to pick what you want to study. I applaud your interest in actually learning stuff that you're interested in and honestly you're better served by doing well at something you're passionate about than doing a mediocre job at something you don't like.",
          "author": null,
          "created": 1573505904,
          "upvotes": 1,
          "replies": {
            "f79f304": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79f304/",
              "text": "I was in the position where either I changed my major or let my grades ( and myself) \n suffer because of the demanding requirements my old major had. \n\nIt's just in my best interest really. I wish those people just let me choose this major in the first place ( which is my plan before I decided to get my old major) and don't give those \" why are u doing that? That ain't promising major \".",
              "author": "teddybearalfredo",
              "created": 1573506635,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f7apxpc": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7apxpc/",
          "text": "Why are you getting a degree then? Just to learn? Degrees are too expensive nowadays to get one just to gain knowledge. If you really just want to learn about a field, go get a job and learn in your free time- there's so many freely available resources out there nowadays that there is really no reason why you couldn't learn more about any field on your own \n\nMost people get degrees because they want better careers, but nowadays there are legitamately some degrees that will not led to better jobs than if they started a trade or working out of high school. If they're majoring in something that won't pay them back the amount they spent on their degree or won't get them a job that pays enough to cover the minimum payments on their student loans then that's a huge issue, which is why so many people keep telling you to pick a promising major\n\nOf course if you're not paying for your degree you can just ignore all of this",
          "author": "stathicus",
          "created": 1573536000,
          "upvotes": 1,
          "replies": {
            "f7azit9": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7azit9/",
              "text": "I disagree with this wholeheartedly. If you want to learn and can afford it, do it.  It’s a different experience than working in a field, some better aspects and some worse.",
              "author": "theoneeyedpete",
              "created": 1573547461,
              "upvotes": 1,
              "replies": {}
            },
            "f7b1eel": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7b1eel/",
              "text": "As a chemist, you must understand though that folk wanting to study say chemistry, kind of either need university or enough money to afford their home lab (and dance with the legalities involved).",
              "author": "Hoihe",
              "created": 1573550350,
              "upvotes": 1,
              "replies": {
                "f7bf4l6": {
                  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7bf4l6/",
                  "text": "Yes and no. You can learn a good deal about chemistry without ever stepping in a lab. But if you want chemistry, or any science really, to be your career then you have to go to school. But in that case your motivation for getting the degree is both to have a career and because you think it's interesting, not just because you think it's interesting.",
                  "author": "stathicus",
                  "created": 1573567129,
                  "upvotes": 1,
                  "replies": {
                    "f7bqimc": {
                      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7bqimc/",
                      "text": "One can argue about careers there still.\n\nLike, if one does not want anything to do with for-profit industry in chem, does it still count as a \"viable career\", considering today's economy?",
                      "author": "Hoihe",
                      "created": 1573575318,
                      "upvotes": 1,
                      "replies": {
                        "f7bxaeo": {
                          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7bxaeo/",
                          "text": "I feel like we are discussing two different topics now but to answer your question\n\nHonestly? For someone who is looking to enter the workforce after undergrad and not go to grad school or anything? I wouldn't suggest current students major in chemistry. While I don't think it's as bad as some other markets, it's starting to (some will probably argue it's past that) suffer the same fate as bio and psych for example\n\nEven if they were planning on grad school from the beginning, I'm not sure I'd recommend it honestly. It would depend on what they wanted to study in grad school.",
                          "author": "stathicus",
                          "created": 1573579689,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f799abe": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f799abe/",
      "text": "How do I get reference letters if my professors don’t know my name",
      "author": "harukiitou",
      "created": 1573504373,
      "upvotes": 1,
      "replies": {
        "f799ez0": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f799ez0/",
          "text": "I am a cs and math student",
          "author": "harukiitou",
          "created": 1573504422,
          "upvotes": 1,
          "replies": {
            "f79ogz7": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79ogz7/",
              "text": "you should edit your original post instead of creating a new one",
              "author": "ExquisiteApathy",
              "created": 1573511395,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f79crmc": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79crmc/",
          "text": "Go to office hours so that they do know your name. Tell them what you want to study and ask their advice about how to do it.",
          "author": null,
          "created": 1573505721,
          "upvotes": 1,
          "replies": {
            "f79i5zk": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79i5zk/",
              "text": "Can I ask profs who taught me two semesters before to write me a reference letter?",
              "author": "harukiitou",
              "created": 1573507941,
              "upvotes": 1,
              "replies": {
                "f79x02h": {
                  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79x02h/",
                  "text": "I would and have done that. Just make sure you remind them of your work and provide some materials for them to reference.",
                  "author": "j_la",
                  "created": 1573516602,
                  "upvotes": 1,
                  "replies": {}
                },
                "f79x74w": {
                  "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79x74w/",
                  "text": "If they remember you, sure.",
                  "author": "thalidimide",
                  "created": 1573516694,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "f7a31xr": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7a31xr/",
          "text": "Why do you want reference letters from people who don't even know your name?",
          "author": "dball37",
          "created": 1573519427,
          "upvotes": 1,
          "replies": {
            "f7e8xc8": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7e8xc8/",
              "text": "Students decide they may want to go to grad school and that requires going through the pointless, rhetorical process of getting profs to reference you.\n\n> \"uhhh yeah... s/he shows up to class. Sometimes. Seems pretty engaged.\"",
              "author": null,
              "created": 1573650876,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f799cnm": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f799cnm/",
      "text": "Especially for the sciences, please post the lecture notes online. Even in classes where I have perfect attendance and copy down everything from the lectures that I'm supposed to, I still wish I could get the lecture notes because there are places where my notation is unclear, or the wording is weird and I want to double-check that I got it right before basing my studying on it (especially so if the lectures don't follow the textbook very closely)",
      "author": "RarelyNecessary",
      "created": 1573504397,
      "upvotes": 1,
      "replies": {
        "f79bfq1": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79bfq1/",
          "text": "Agreed, it's also hard to take very clear notes in a live lecture since you don't know where the arguments are going necessarily, so you don't know what is more or less important.",
          "author": "PinheadXXXXXX",
          "created": 1573505202,
          "upvotes": 1,
          "replies": {
            "f7b1bel": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7b1bel/",
              "text": "this\n Often i wound up starting something only for having to rewrite the entire thing due to not making sense that way. this mostly applies when trying to use layout to my benefit.",
              "author": "Hoihe",
              "created": 1573550215,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f79macx": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79macx/",
      "text": "A couple of quick things. (STEM Major here)\n\n1.) Please put full lecture slides online, preferably ahead of time. I understand that some professors put fillable slides or no slides at all because they want to increase attendance. Ultimately though, having notes that we can go back and reference against our own is extremely helpful when studying for upcoming exams or we're looking back through our notes and things are still unclear. The same can be said for posting them ahead of time. It allows students to have the slides ahead of time so that we can spend more time listening to you and taking notes on what you say rather than what you put on the slides. Lastly, sometimes we have to miss class. Everyone gets sick sometimes and other times we have to travel for family, personal, or academic reasons. It's hard to catch back up before the next class if we don't have notes that we can access online. \n\n2.) I dislike that many professors are anti-chegg and similar services. I completely understand that some students copy straight from chegg. That sucks. I don't know a way to stop that. Generally those students perform poorly on exams. If they don't, then they must have still learned the material, which is the goal, right? That said, as someone who does take the time to do all of the homework, I use chegg. It's a great resource for me when I get stuck or don't understand why something was done a certain way in the in class examples (if the professors do them at all). \nBeing able to see an example step by step helps me understand far more than a single example on some slides in class. Plus, chegg isn't always right, so it still forces me to work through the problem, check their work, and figure out where and why they were wrong. Additionally, sometimes I don't understand what the textbook problems are asking me to solve for. In any event, I think Chegg is a great tool when used appropriately.",
      "author": "Puppett_Master",
      "created": 1573509709,
      "upvotes": 1,
      "replies": {}
    },
    "f79puid": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79puid/",
      "text": "Staff that aren't lecturers should be subject to the same rating system that lecturers are. These people can often act as gatekeepers to lab space, equipment etc and have no one they have to answer to\n\nEdit: typo",
      "author": "WildDogAlice",
      "created": 1573512605,
      "upvotes": 1,
      "replies": {}
    },
    "f79q1nh": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79q1nh/",
      "text": "I find it strange that personal tutors are not trained to identify a student that is struggling (whether it be academia related or personal), and are not make aware of the support available that they can personally provide to that student e.g. University counselling",
      "author": "WildDogAlice",
      "created": 1573512749,
      "upvotes": 1,
      "replies": {}
    },
    "f79t11l": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79t11l/",
      "text": "I wish my advisors/professors would actually give me advice on the future beyond \"just follow your passions\" or \"you'll be fine\". I don't need the perfect ultra-fulfilling job that fills me with joy every day, I need a safe place to live and a car and you can't just stumble into that kind of job.",
      "author": null,
      "created": 1573514603,
      "upvotes": 1,
      "replies": {
        "f7a2adg": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7a2adg/",
          "text": "They may not be able to give you practical advice.  Older professors got their professorships when the academic job market wasn't nearly as difficult, and the newest professors tend to be superstars in their fields, which is how they got their jobs in the first place.  Aside from professional degrees (e.g. law, medicine, architecture, business), many profs have never worked outside academia so they lack the information they would need to advise you towards a non-academic career path.",
          "author": "knockknockbear",
          "created": 1573519061,
          "upvotes": 1,
          "replies": {
            "f7aayzd": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7aayzd/",
              "text": "^^ this comment needs gold and needs to be higher up.\n\nSeriously if you're looking for career options *outside* academia, your professors should be the _last_ people to ask.",
              "author": "PM_ME_GRANT_PROPOSAL",
              "created": 1573524883,
              "upvotes": 1,
              "replies": {}
            },
            "f7acyz9": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7acyz9/",
              "text": "It's not just my professors though: my advisors (ie. admins who are supposed to advise us on career and major stuff) have also been unwilling to move beyond \"do what you love :)\" narratives. I've been trying my best to work with our career center but they're heavily geared towards people that want to go into business and that's not me.",
              "author": null,
              "created": 1573526200,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f7e8nv6": {
          "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7e8nv6/",
          "text": "That advice isn't necessarily right or wrong, but as someone who tried to choose a more \"practical\" career path isn't of doing something I wanted to do, I frequently suffer from severe motivation issues and doubt over what I really want to do. Doing something you hate for a living is hard.\n\n> you can't just stumble into that kind of job.\n\nA lot of people do, tbh. Not necessarily stumble into it, but plenty of my classmates who did \"useless\" social science degrees now work well-paying jobs in government or NGOs. Lots of people get lucky in the job search and land good positions simply due to searching at the right time, and lots of ambitious people who extensively plan out their career paths have those plans derailed by issues that are out of their control.\n\n> I don't need the perfect ultra-fulfilling job that fills me with joy every day\n\nThat's a pragmatic attitude to have. \"Passion\" or \"doing what you love\" is a bad way to assess career paths because every profession eventually becomes work. No one loves what they do 100% of the time, especially when they have to get up at 7 or 8 AM every day to do it.\n\nThat said, academics tend to be people from the top 10% of their field, so obviously they are going to suggest \"doing what you love,\" since they are the part of their field for whom doing what they love is a realistic career. The people who need to hear the harsh reality that their dream careers aren't realistic are the 90 IQ high school hotshots, not someone who's got top marks.",
          "author": null,
          "created": 1573650625,
          "upvotes": 1,
          "replies": {
            "f7emyhx": {
              "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7emyhx/",
              "text": "> Doing something you hate for a living is hard\n\nLike you said, most people end up hating their jobs anyways and starving is harder. I don’t think it’s responsible to push the idea that finding a career should be about one’s interests when they’ll end up killing them.",
              "author": null,
              "created": 1573661329,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f79yb6i": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f79yb6i/",
      "text": "Does anyone else have the problem of comment ordering working in browser but getting broken and disorganized in the mobile app? Is that a function of this being a \"chat\" comment section?",
      "author": "PLAAND",
      "created": 1573517207,
      "upvotes": 1,
      "replies": {}
    },
    "f7a910x": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7a910x/",
      "text": "Do whatever the fuck you want. Just do it. But don’t pressure people into things and don’t hurt anyone else in the process. If you want to be an Art Major and not a Biology Major, then do it.",
      "author": "moocowpoop",
      "created": 1573523485,
      "upvotes": 1,
      "replies": {}
    },
    "f7a96pk": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7a96pk/",
      "text": "Mobile app response ordering seems... chaotic.",
      "author": "RayvenTheWolfe",
      "created": 1573523602,
      "upvotes": 1,
      "replies": {}
    },
    "f7cl43e": {
      "link": "/r/AskAcademia/comments/dutn6n/undergrad_suggestion_box/f7cl43e/",
      "text": "Unrelated but I think that it sucks that STEM is brutal as hell. It's okay, I entered the STEM fields myself. Context, I'm in Information Science, Systems, and Technology at Cornell University as a junior and I'm mainly interested in data science, natural language processing, machine learning, and artificial intelligence.",
      "author": null,
      "created": 1573594614,
      "upvotes": 1,
      "replies": {}
    }
  }
}