{
  "sid": "oyhijz",
  "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/",
  "title:": "Lecturers suffering from burnout… when is enough enough?",
  "text": "Hi all,\n\nLooking for some objective advice.\n\nI’m a lecturer at a UK university, due to staff cut backs in the pandemic my work load doubled as I took on the teaching of one exiting professor, then another colleague went on sabbatical and I took over her programme leadership responsibilities. \nNothing has been taken away my work load/responsibilities to accommodate the extra work (it goes without saying there was no pay rise). Then there’s all the usual pandemic chaos we’ve all had to deal with, switch to online teaching, extra pastoral support for students etc. Lack of support from senior management…\n\nMy lovely colleague I worked closely with died suddenly and unexpectedly a few weeks ago from a heart attack at a very young age (i don’t know, but I can’t help feeling it was stress related). The university would not push back our marking deadlines by even a day to give us time to process the loss. \n\nDue to all this extra work, I’ve barely taken any annual leave (the uni has a use it or lose it policy) and honestly I’m exhausted.\n\nI have so much work to do, and I just burst into tears because my stupid MFA app wouldn’t let me access any of my work accounts.\n\nI’m lucky enough to have a permanent position, but when I picture still being in this job in 6 months I want to throw myself into the sea.\n\nshould I just get on with the job and hope it gets better in a few months? \nDo I call it quits?\n\nHonestly I feel like I have nothing left to give, but my colleagues would be the ones to suffer if I left.\n\nAdvice welcome x",
  "author": "PerpetualStudent2021",
  "created": 1628170000,
  "updated": 1634080000,
  "over_18": false,
  "upvotes": 22,
  "upvote_ratio": 0.92,
  "comments": {
    "h7triqk": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7triqk/",
      "text": ">  The university would not push back our marking deadlines by even a day to give us time to process the loss.\n\n>Due to all this extra work, I’ve barely taken any annual leave\n\nPrior to this summer I had been a stickler for keeping to deadlines and getting stuff done.\n\nThis year my attitidue toward university deadlines is that they can go swing. The deadlines they have gives us as staff have routinely fallen short of the expectations laid out in the teaching agreements, with an expectation that staff goodwill will keep the boat afloat.\n\nTake your leave. *All of it*. If they are not staffing things sufficiently, that is on them. At every opportunity tell them there is not enough time to do a task, and how are they going to address it. Leave a papertrail of evidence that you are not being sufficiently supported. They don't have a leg to stand on, so don't let them abuse you as an employee. If the marks aren't in in time for the exam boards that's for *them* to explain to the students.\n\nWe've all busted a gut to keep things on track, but we've just come into our resit season, where all university deadlines were set ont eh same day. Blackboard shat itself, so they pushed the student deadline back, but not our 10 day (!) marking deadline. I've got leave booked, and will be taking it, whether my marking is finished or not. \n\nYou have to look after you, because your employer doesn't care.",
      "author": "OrbitalPete",
      "created": 1628181756,
      "upvotes": 32,
      "replies": {
        "h7ujst7": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7ujst7/",
          "text": "Aside - ours decided to do the moodle upgrade the week before resits start. Which takes it completely offline. Because who could know that might be the time when students might need to access it for revision. AARRRGGHHH",
          "author": "drvictoriosa",
          "created": 1628193263,
          "upvotes": 3,
          "replies": {}
        },
        "h7tuxhn": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7tuxhn/",
          "text": "I like deadlines. I like the whooshing sound they make as they fly past.  \nI like how you called out the uni. Whatchagonnado, huh?",
          "author": "tryatriassic",
          "created": 1628183156,
          "upvotes": 2,
          "replies": {}
        },
        "h7vo65g": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7vo65g/",
          "text": "Hell yes! This is the attitude to adopt!",
          "author": "tacful_cactus",
          "created": 1628211591,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7szge6": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7szge6/",
      "text": "My belief is once you reach the stage of saying if I'm doing this in 6 months I'll go crazy and jump in the sea then it's time to start planning for immediate action. That action though depends alot on what you can financially afford.",
      "author": "MAE2021JM",
      "created": 1628171252,
      "upvotes": 30,
      "replies": {}
    },
    "h7tulde": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7tulde/",
      "text": "Stop enabling the Uni.  \nYou're making their problem (i.e. understaffing and underfunding) your problem (i.e. no quality of life, massive stress).   \nIt all starts by realizing that your choice to do all this extra shit for no pay *is your choice*. Let go, young one ...",
      "author": "tryatriassic",
      "created": 1628183018,
      "upvotes": 19,
      "replies": {
        "h7wj2ic": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7wj2ic/",
          "text": "I mean, yeah… fair point! I can’t really argue with this 😆",
          "author": "PerpetualStudent2021",
          "created": 1628228345,
          "upvotes": 2,
          "replies": {
            "h7ztwsv": {
              "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7ztwsv/",
              "text": "Gotta think about numero uno first!",
              "author": "tryatriassic",
              "created": 1628292032,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h7ts8ap": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7ts8ap/",
      "text": "You do not owe your job anything. You may like your colleagues, but it isn’t your responsibility to keep them healthy, stress free, and at a reasonable workload.\n\nDo you think things will get better now that they know you can and will take on extra work without extra pay?",
      "author": "profpetitfours",
      "created": 1628182050,
      "upvotes": 11,
      "replies": {
        "h7voctd": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7voctd/",
          "text": "Exactly. If one person quitting harms other colleagues that’s a management fuck up. In the UK we have to give 3 months notice so if they haven’t hired someone else by then to do the work that’s on management.",
          "author": "tacful_cactus",
          "created": 1628211682,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h7ur22a": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7ur22a/",
      "text": "If you're past probation then really I would ignore the deadlines. I've always been concerned of missing them, but this year I've learnt that literally nothing happens when you do. I would also take the annual leave. And dramatically lower your standards,  something's got to give, and it shouldn't be your salary or your mental health.",
      "author": "WhoMeNoMe",
      "created": 1628196275,
      "upvotes": 7,
      "replies": {
        "h7us9s8": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7us9s8/",
          "text": "Yeah. I feel bad saying this, but if you can't meet a deadline you can't meet a deadline. We all struggled to meet our semester 2 exam marking deadline. So the board of examiners was pushed back a week. The sky didn't fall. No one got in trouble. Sometimes you have to just say \"I can't do it. This is unrealistic.\"",
          "author": "drvictoriosa",
          "created": 1628196791,
          "upvotes": 4,
          "replies": {}
        },
        "h7voloz": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7voloz/",
          "text": "Once, when all the stars were aligned, I had a good line manager who used to tell me, if I was freaking out about a marking deadline I couldn’t meet, “is anyone going to die or suffer serious harm? No? Then don’t worry about it”. I always keep that in my mind now.",
          "author": "tacful_cactus",
          "created": 1628211803,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h7syoxf": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7syoxf/",
      "text": "Lower your level of ambition to fit the hours you are paid. If that gets you to a good enough level, you are good. If it dips below what is acceptable, you tell those in power.",
      "author": "molobodd",
      "created": 1628170893,
      "upvotes": 8,
      "replies": {}
    },
    "h7v1v6b": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7v1v6b/",
      "text": "I've been in this situation in a UK institution and it sucks. Even before the pandemic, folk were working with unbearable workloads and now the cracks in the system are turning into chasms.\n\nI'll share my experience: I was in a similar place to you and I ended up going to my GP - I thought I was having an episode of mental illness but after talking it over they said \"No wonder you're burned out, you're doing 3 people's jobs\". Although many factors contributing to my burnout were systemic failures I began to realise my own collusion with this broken system by not taking leave, working crazy hours and picking up extra work when colleagues left etc.\n\nThe GP signed me off work and it took me a very long time to learn how to relax and to begin to recover. I don't think holiday leave would have helped at my lowest point because I just couldn't switch off.\n\nSo, based on my experience I advise consultation with GP and getting a referral to occupational health at your workplace. Take sick leave if you need it. Don't worry about your colleagues picking up the slack - it's really hard, I know, but you can only take responsibility for yourself in this situation. Hopefully colleagues will say no to the extra work and management will be forced to take notice. \n\nWhen I was well enough to return to work I invested in some coaching and learned some skills in assertiveness, saying no to things and managing work life balance.\n\nOf course the pandemic adds an extra layer of awfulness to a situation like this. Every step of the way is so much harder. I very much wish you all the best and to say that recovery from burnout IS possible.",
      "author": "GSVQuietlyConfident",
      "created": 1628200918,
      "upvotes": 5,
      "replies": {
        "h7vovum": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7vovum/",
          "text": "Completely concur with this. If you have burnt out with stress you need sick leave. Your body is telling you you can’t carry on and nothing good is going to happen if you try and force yourself to.",
          "author": "tacful_cactus",
          "created": 1628211942,
          "upvotes": 3,
          "replies": {}
        },
        "h7wioeb": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7wioeb/",
          "text": "Thanks for sharing, I think you’re right, I need to get a drs note and take a proper break for a little bit. I raised my work load with occupational health after the first lockdown and since then it’s only gotten worse. Hopefully a after some rest I’ll be able to come up with a plan.. or an escape lol",
          "author": "PerpetualStudent2021",
          "created": 1628228067,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h7ujj7r": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7ujj7r/",
      "text": "Take all your leave. Now. It doesn’t matter if there are deadlines. If there’s something that’s that urgent then they can get someone else to do it. I know it often feels there isn’t anyone else who can do stuff and it will just be waiting when you get back but that’s a) not your fault - it’s the institutions that already have us all working above 1fte with no extra pay that have caused this and b) not your problem. If there’s something that really, truly can’t wait they *will* find away to get it done. Yes, it will probably get passed onto someone else,  but (hopefully) there’s someone in your dept who has an overview of who’s doing what and will give it to someone who has the capacity to do it. An example - I’ve been at the point of burnout for about 9 months now. Because of all the no detriment stuff we have in place there is only 1 exam that we dont have any students taking in the summer resit period. Out of something like 30 units. So there’s a fuckton of setting,  vetting, coursework setting etc right now. At the same time we were running an online conference for ~1000 people. A couple of days before the conference (a few weeks ago) I was at breaking point. I had teaching deadlines that I knew I couldn’t meet if I took time to eat/sleep. So I just told them. I can’t do it (exam vetting) please find someone else. And they did. No fuss. And in a few days I’ll be on holiday for 10 days.  No fallout from not doing the thing. Because our colleagues are human. They understand how hard these last 18 months have been and (no matter how it seems sometimes) they want you to be ok. \n\nIf you take some annual leave and are still feeling this way when you get back, start looking around for something else. It’s not worth wasting your life in a job that makes you miserable. Especially one that demands so much and makes it so yiu can’t enjoy the rest of your life. Your colleagues won’t suffer (other than being sad your leaving of course!). We’ve had a few take early retirement/voluntary exit and no one is angry at them. We’re happy for them. We miss them, but we’re not sat there saying “how could that twat just leave and make us all this extra work”. \n\nBut please, take some time off. We all already do so much unpaid overtime,don’t give the uni any more of your time for free. You don’t owe the institution anything.",
      "author": "drvictoriosa",
      "created": 1628193154,
      "upvotes": 4,
      "replies": {}
    },
    "h7vbq1v": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7vbq1v/",
      "text": "Take some leave now, or plan it asap if you absolutely can't take it immediately. Take at least 2 weeks and don't check email in that time. Spend it doing the little things in life that make you happy. See how you feel at the end of that time. If you need more time, take more. Tell anyone who takes issue with it that you've been doing multiple people's jobs with without a break, AND recently lost a colleague, and that you have a leave entitlement for a reason. \n\nIt's hard to learn to do this but desperation is a good teacher, and you're at that point where if you don't take a break you're going to do yourself some damage. The University shouldn't treat you like this, but they will push you as far as you let them push you. Time to push back. Don't wait until you're pushed beyond your limits. Don't make any rash decisions about your future in this role from the point of burnout. Take a good break first.",
      "author": "The-very-naughtyduck",
      "created": 1628205460,
      "upvotes": 3,
      "replies": {
        "h7whq5y": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7whq5y/",
          "text": "Good advice, I can’t see any long annual leave being approved right now, but maybe I will try and get a drs note next week to take some sick leave. 👍🏻",
          "author": "PerpetualStudent2021",
          "created": 1628227392,
          "upvotes": 3,
          "replies": {
            "h7wi6st": {
              "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7wi6st/",
              "text": "Please do. This stranger wants to see you feel better soon.",
              "author": "The-very-naughtyduck",
              "created": 1628227714,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "h7vf64o": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7vf64o/",
      "text": "Take care of yourself, don't get lost in your own thoughts and end up like this UK lecturer.\n\n[https://www.bbc.com/news/uk-wales-south-east-wales-44389004](https://www.bbc.com/news/uk-wales-south-east-wales-44389004)\n\nLove the job, but don't love the company for the company cannot love you back is always a good thing to keep in mind. Get a secondary hobby to distract yourself and find meaning elsewhere. Lots of people have taken up gardening in the pandemic, maybe try that. Plants give more tactile and honest feedback than students anyway. You care, they grow. You don't, they die. My tomatoes never commented about my office hours availability.",
      "author": "gergasi",
      "created": 1628207142,
      "upvotes": 3,
      "replies": {
        "h7whe3r": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7whe3r/",
          "text": "This is lovely advice, unfortunately I’m in a city flat with no garden, but this was all the prompting I needed to buy another house plant 😄",
          "author": "PerpetualStudent2021",
          "created": 1628227158,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7vnf0s": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7vnf0s/",
      "text": "Hey I’m late to the party here but I was in a very similar situation to you (lecturer in UK) until recently. I quit when I was denied what should have been a bog standard promotion because of my ill health that was caused by work stress (ofc they didn’t say it was my ill health, they said I wasn’t a ‘team player’ because I reduced ONE of my three admin roles to try and reduce my stress so I could get better - I was part time and even full time employees weren’t supposed to have more than 2), and when I got to the point that you seem to be at, I just felt sick and miserable and anxious to the point of panic attacks daily. I put in my 3 months notice and the very first day after my final day there I breathed without misery for the first time in many years. It took me a while to get back on my feet but I managed it. Academia in the UK, esp now, is unbelievably abusive and mentally destructive. Also: it won’t get better. I told myself it would year after year until the job destroyed me. It only ever got worse.",
      "author": "tacful_cactus",
      "created": 1628211219,
      "upvotes": 3,
      "replies": {
        "h7wh8bl": {
          "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7wh8bl/",
          "text": "Thanks for taking the time to reply, and I’m sorry to hear you were in a similar situation. You’re right, it’s not going to get better, I think that’s why I feel so much dread about the future. Time to go and try something new I think. Something where I at least get to enjoy my weekends",
          "author": "PerpetualStudent2021",
          "created": 1628227048,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h7tecwo": {
      "link": "/r/AskAcademia/comments/oyhijz/lecturers_suffering_from_burnout_when_is_enough/h7tecwo/",
      "text": "maybe se if they will let you go part time if money is an issue? so that you have enough to get by but dont have all the pressure, and then just take some time to find something else or think about what you want to do? Not sure if that is an option for you but just a thought.",
      "author": null,
      "created": 1628176270,
      "upvotes": 1,
      "replies": {}
    }
  }
}