{
  "sid": "cvmw0s",
  "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/",
  "title:": "Salty PI emails!",
  "text": "I was hoping others could share salty emails they have received from their PI. For example, I recently got one that said \"...In fact, your presentation suggests that you don’t understand your own results.\"\n\nFor context, this is a notoriously difficult person who provides very little feedback months or years after it's been requested. The comments, in this instance, were relatively minor, but extra tangy!\nI definitely chuckled at this! \n \n\nEDIT: In asking this question, I am hoping to highlight the (potential) commonality of such comments. Ultimately, I hope that readers are reminded that poor manners and salty comments are not a reflection of academic merit.",
  "author": null,
  "created": 1566819588,
  "updated": 1634081816,
  "over_18": false,
  "upvotes": 117,
  "upvote_ratio": 0.94,
  "comments": {
    "ey56yi6": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey56yi6/",
      "text": "During my masters, my PI sent me an email after an in-class assignment: “...if this is the quality of your work, you have no business being in graduate school.”\n\nDuring a presentation, he gave no feedback on content, but told me that “your voice is very soothing, but your breathing patterns when you talk are very distracting.”\n\nSo, yeah, that wasn’t fun. I should have left that semester instead of dragging it out another 2 years to leave with a masters. I eventually got my PhD, but there was so much unnecessary suffering due to that ass.",
      "author": "chooseroftheslayed",
      "created": 1566823753,
      "upvotes": 103,
      "replies": {
        "ey5gy6a": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5gy6a/",
          "text": "Oh geez! What does that even mean?! So sorry that was your experience. Thanks for sharing, and you breathe however you damn well please. Breathing is good for your health.",
          "author": null,
          "created": 1566831387,
          "upvotes": 27,
          "replies": {
            "ey5jkhj": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5jkhj/",
              "text": "> During a presentation, he gave no feedback on content, but told me that “your voice is very soothing, but your breathing patterns when you talk are very distracting.”\n\nHow close was he sitting to notice your breathing patterns?",
              "author": "rpfflgt",
              "created": 1566833250,
              "upvotes": 20,
              "replies": {
                "ey5v6zb": {
                  "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5v6zb/",
                  "text": "When I was in grad school, one supervisor kept hammering on a student for having too much spit in her mouth when she talked. She asked me to watch her speak and in my professional spit opinion it was fine. She was indeed saying it not spraying it.",
                  "author": "arrrrr_won",
                  "created": 1566841091,
                  "upvotes": 28,
                  "replies": {}
                }
              }
            },
            "ey6c2wm": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey6c2wm/",
              "text": "> Breathing is good for your health.\n\n[citation needed]\n\nI'll have you know that 100% of people who breathe do actually end up dying. \n\n/s in case it's needed",
              "author": "needlzor",
              "created": 1566852140,
              "upvotes": 14,
              "replies": {}
            }
          }
        }
      }
    },
    "ey5b6fp": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5b6fp/",
      "text": "This was a comment in front of everyone, not an e-mail. We were doing a seminar where we were all supposed to practice presenting our research. It was mostly attended by students, but the supervisor of each student was invited to come see their student presents.\n\nMine asked a question as to why I hadn’t smoothed a particular graph. I replied (reasonably, in the eyes of those present) that I had taken the data from another group and wanted to replicate it verbatim, without modification. \n\nHe then said “I guess you’re just too lazy to do it”, in front of all my peers and colleagues.\n\nThankfully the chair was mortified and interjected icily to remind him that our presentation skills, not the soundness of our science, was what we were being evaluated on in the seminar, and to keep that kind of comment for private discussions.",
      "author": "ThePhysicistIsIn",
      "created": 1566827163,
      "upvotes": 85,
      "replies": {
        "ey5jvs5": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5jvs5/",
          "text": "> Thankfully the chair was mortified and interjected icily to remind him that our presentation skills, not the soundness of our science, was what we were being evaluated on in the seminar, and to keep that kind of comment for private discussions.\n\nI mean, even if. I'm not going to modify someone else's data unless I think it's absolutely necessary. And smoothing data is something that's mostly cosmetic and usually done to mask statistical scatter (and thereby obfuscate the error bar) in data. I'd say it's unnecessary most of the time and counterproductive at least some of the time.",
          "author": "rpfflgt",
          "created": 1566833462,
          "upvotes": 64,
          "replies": {}
        }
      }
    },
    "ey5cuhq": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5cuhq/",
      "text": "There's a line from a movie about academia which roughly translated goes: \"your paper has many novel and true aspects. The problem is the novel ones aren't true and the true ones aren't novel\".\n\nI love that line...",
      "author": "justryingtokeepup",
      "created": 1566828423,
      "upvotes": 84,
      "replies": {
        "ey5g1vb": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5g1vb/",
          "text": "Haha! I really like this!",
          "author": null,
          "created": 1566830757,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "ey5rbh4": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5rbh4/",
      "text": "Damn, I don't think I really realized how good I have it with my PI until reading some of these comments. Even when providing me with constructive criticism she's very supportive and has a \"we'll work through this together until you understand\" attitude. I leave every meeting with her feeling excited about my research, even if I went into the meeting feeling dumb and lost. \n\nI am her first grad student, so maybe I'm getting some of that early naivete, but I hope she stays like this for her future grad students too. It makes grad school really worthwhile to have such an amazing PI.",
      "author": "CurvyBadger",
      "created": 1566838517,
      "upvotes": 61,
      "replies": {
        "ey5u2fj": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5u2fj/",
          "text": "I bet she’d appreciate it if you told her what you’ve realized!",
          "author": "MrsSpice",
          "created": 1566840343,
          "upvotes": 23,
          "replies": {}
        },
        "ey78n1f": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey78n1f/",
          "text": "I know I shouldn't be surprised at all the shitty PIs... but holy shit I am.",
          "author": "JAKSTAT",
          "created": 1566874909,
          "upvotes": 3,
          "replies": {
            "ey8jr9d": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey8jr9d/",
              "text": "managing is a skill, and it's one that takes training and practice to get good at. Unfortunately, in the sciences at least, managing positions are earned by demonstrating good research abilities, not good managing abilities, and few people have the authority to tell a PI that there are books and classes they could/should be taking, since they're being asked to start learning this skill at the bottom.\n\nMy grad school admins did at one point strongly suggest that they send my PI one of the many 'managing skills for PIs' books, but I knew that since I was his only grad student, it could only be seen in reference to their observations of how he was treating me, and it was not likely to improve matters.",
              "author": "alittleperil",
              "created": 1566921664,
              "upvotes": 3,
              "replies": {
                "ey8mcfg": {
                  "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey8mcfg/",
                  "text": "It's awful. Some of this is just common human decency!!! aggh",
                  "author": "JAKSTAT",
                  "created": 1566923338,
                  "upvotes": 2,
                  "replies": {
                    "ey97cws": {
                      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey97cws/",
                      "text": "Heh, I'm gonna tell you what my mom would tell me if I got aggravated at people not using what ten-year-old me considered 'common sense':\n\nCommon human decency isn't all that common.",
                      "author": "alittleperil",
                      "created": 1566936876,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "ey8qkqe": {
                  "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey8qkqe/",
                  "text": "My PI told me very seriously that outsiders (like a HR department) couldn't tell him anything useful about supervising scientists. You can imagine what kind of a supervisor he is....",
                  "author": "cupoftea_I",
                  "created": 1566926072,
                  "upvotes": 2,
                  "replies": {
                    "eydalem": {
                      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/eydalem/",
                      "text": "It's weird how people who think of themselves as being rational and reasoning will get an expert's advice on a particular protocol, but not on a particular type of human interaction. \n\nHow does it hurt him to listen and see what their advice is? If it's useful he gained something valuable and if it's not then he only risked a small amount of time on the potential for something valuable. I'm about to go refactor all of my data *again* just because the output doesn't match the expectations so I need to check that I didn't do something wonky in any step of my data analysis pipeline. I'm planning on throwing away at least two days of time on something I don't think will result in something valuable, just in case, and I'm pretty lazy for a scientist.\n\nTrading our time for something that may or may not provide useful information is our thing. Saying they'll only do that about science is really limiting. Applying a strategy that works in a different setting to a current setting to see if it will also work here is *also* our thing!",
                      "author": "alittleperil",
                      "created": 1567014798,
                      "upvotes": 2,
                      "replies": {
                        "eyhqkj3": {
                          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/eyhqkj3/",
                          "text": "I find it astounding tbh. He doesn't want to listen to them because they'll change his way of working, like trying to enforce illegally long working hours (anything less than 20 hr days and you are not serious), you can imagine his thoughts on weekends and holidays :P\n\nGood luck with reworking your data :) it could be fun at some point to ask people what other ridiculously time-wasting requests they've had from PI's at some point",
                          "author": "cupoftea_I",
                          "created": 1567091225,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ey5q45b": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5q45b/",
      "text": "I had a masters course on algebra, I found it quite challenging so often walked to the professor to ask questions. Note, this was a type of course hour where you were supposed to work on questions during that hour (like homework), and the prof would be there in case you didn't understand. So, after two or three of my questions he said loudly so everyone could hear: \"I don't think you have the right sort of brain for this course\". Being the only girl, that was rough.",
      "author": "Aepensteijn",
      "created": 1566837710,
      "upvotes": 44,
      "replies": {
        "ey62tle": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey62tle/",
          "text": "I can relate to this. One time I was asking for help on my Advanced Calc hwk. I’m horrible at theory and it killed me every class. \n\nI’m a biology major first and added a math degree (which I finished). I was in my math advisors office for office hours and he goes “you don’t think like a mathematician do you?”\n\nAlso made me feel terrible when I told him I got a B in Partial Differential Equations and an A in graduate level modeling. The look of shock on his face was HUMILIATING.",
          "author": "Fulcrum_1",
          "created": 1566846123,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "ey5z5yj": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5z5yj/",
      "text": "My semester evaluation (which goes to the entire department) following the unexpected death of my mother included gems like:\n\n “the amount of time off she’s needed demonstrates she is not committed to the program and does not consider grad school to be a full time job” \n\nand \n\n“while I once saw her as a rising star in the field, I’m not sure she can finish a PhD.” \n\nI took 10 days off. Her body wasn’t ready for 7. \n\nWhen I returned I told him I could be technical help but had discussed, and agreed, with him and and the chair of the program I should focus on my course work over generating data. \n\nAfter the evaluation I had a sit down meeting with him & the chair in which I asked him how he thought I should have proceeded: “Technically [school] employees get 3 days bereavement.”",
      "author": "Biolobri14",
      "created": 1566843717,
      "upvotes": 34,
      "replies": {
        "ey60yzs": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey60yzs/",
          "text": "[deleted]",
          "author": null,
          "created": 1566844905,
          "upvotes": 15,
          "replies": {
            "ey61hbc": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey61hbc/",
              "text": "The chair and administrator were both super supportive but there wasn’t a whole lot they could do bc he’s allowed to run his lab however he wants. Initially he had told me “whatever you need, just let us know” - but I guess he didn’t really mean it.\n\nI ended up changing labs & getting through prelims but the whole ordeal left me pretty depressed. Ended up taking the terminal masters. I love my position now & have a really great and supportive boss but I do feel like his PhD concern was self-fulfilling.",
              "author": "Biolobri14",
              "created": 1566845244,
              "upvotes": 16,
              "replies": {}
            }
          }
        },
        "ey7894h": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey7894h/",
          "text": "A few months after my son died, my pi sat me down to tell me that I didn’t seem like a good fit for the program because I “wasn’t happy”. I flat-out refused to leave because my research was literally the only thing that made me want to get up in the morning.",
          "author": "Weaselpanties",
          "created": 1566874589,
          "upvotes": 10,
          "replies": {
            "ey7q997": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey7q997/",
              "text": "My heart breaks for you.  I am so sorry you had to experience this and commend you for your perseverance.  While it pales in comparison, my long-time spouse filed for divorce (blindsiding me) during my 3rd year. I moved 1200+ miles from the nearest relative in my family and had immersed myself in my labwork in order to get through the M-F; I never got to know my much-younger cohort because I drove 4 hours home each week.\n\nResearch is still my only reason to get out of bed in the morning.  I relate to you on that level. If you ever need anything, even just a place to vent, please contact me.  You are not alone.  For what it's worth, my PI scheduled a private meeting with me in his office before saying, \"well, maybe you just need to work harder.\"\n\nI have never cried in public and have strong strong opinions on those who *do* cry at work...  I burst into tears and sobbed for a good 30 minutes. lol.\n\nedit: am now a 5th year.",
              "author": "petite_philosopher",
              "created": 1566895153,
              "upvotes": 4,
              "replies": {
                "ey8966m": {
                  "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey8966m/",
                  "text": "Thank you! I am glad you persevered. I really do think that 90% of success in academia is just refusing to give up.",
                  "author": "Weaselpanties",
                  "created": 1566914551,
                  "upvotes": 3,
                  "replies": {}
                },
                "ey8lb5u": {
                  "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey8lb5u/",
                  "text": "take good care of yourself after you leave. You are being trained and conditioned in responses that are not normal or healthy in a good lab. At one point my postdoc adviser sat me down and said that I didn't have to keep trying to prove I was actually working when I wasn't getting a lot of good output, they already knew and trusted that completely. One of the few times something *nice* in a PI's office had me crying all over the place.\n\nI hadn't realized how obvious it was that I was used to dealing with a toxic environment. That made me cry a bit too.\n\nThis became something I felt I had to apologize for further down the road, and I'm still working on regaining my sense of 'normal'. I posted one of my PI's unreasonable responses to waiting for his feedback, and the way I learned to deal with similar situations is to send reminders regularly and then at some point say 'If I don't hear from you by X I'm going to assume I should go ahead and submit it.' which came across as pushy and judgy when my PI forgot my previous lab situation. They were immediately apologetic about having gotten snippy with me once I explained my intent, but it still sucked to realize how many protective mechanisms I'd developed and how they were making things worse in a new environment.\n\nAlso, maybe try not to judge other people for crying at work? Work is a third of your day on weekdays, and some people are criers. My wife cries at hallmark commercials and pictures of sad puppies, to name the most innocuous things that have triggered tears. She can't help that she cries at any stressor, even as she keeps working despite it and talks past it reasonably enough, any more than a morning person can help being peppy in the morning. Humans gotta human. I try not to judge them for that when I can, especially when it's obvious they aren't humanning *at* me or manipulatively.\n\nGood luck!",
                  "author": "alittleperil",
                  "created": 1566922673,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "ey6swki": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey6swki/",
          "text": "holy shit.",
          "author": "actuallycallie",
          "created": 1566863274,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "ey5l061": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5l061/",
      "text": "Although not in email form, I was TA for a professor. The class is ~200 level. One day this professor said to one student’s face that “your chemistry is not good enough to take this class”. To be fair, this class does not have any prerequisite and this is for non-major students (it’s a plant science introductory class).\n\nI felt so bad at the moment and at the end of the day I email that student and let him know that that specific chemistry concept is difficult and he can come by my office anytime to clarify it he wants.\n\nThis student is, although “not enough for this class”, one of my most engaging students in my lab sessions.\n\nI really hope that this kind of harsh, non-constructive words can be noted by all educators, so I want to share it here :(",
      "author": "kyuukimi",
      "created": 1566834235,
      "upvotes": 23,
      "replies": {}
    },
    "ey5jse3": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5jse3/",
      "text": "Oh man. Not a PI, but a professor I basically idolized and hoped to work with at the PhD-level. Admittedly, I was being a bit ambitious when I wrote my final paper, but I was excited about the concept and felt generally good about the result. Got a comment back saying that it was \"hard to read\" and that it looked like I was \"just throwing random sentences together\". I worked on this thing for a month solid and never tried so hard in my life. Man, those comments were ROUGH!",
      "author": "banjobeulah",
      "created": 1566833399,
      "upvotes": 20,
      "replies": {
        "ey6ceqa": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey6ceqa/",
          "text": "I mean it's hard to say from your comment, but if those criticisms came with some recommendations to improve it they're really in the upper tier of professor comments. I will take harsh and constructive over nice and non-confrontational any day, having had the experience of both.",
          "author": "needlzor",
          "created": 1566852350,
          "upvotes": 8,
          "replies": {
            "ey6fajb": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey6fajb/",
              "text": "No suggestions. I would have honestly loved that. I emailed them to ask what they found fault with, and they said that I made a few leaps that would need substantiation. So, not as bad as \"word salad\", I guess?",
              "author": "banjobeulah",
              "created": 1566854247,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "ey55ssl": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey55ssl/",
      "text": "During lab meetings, lab members present the experimental setup and sometimes the PI just doesn’t get the rationale of including a certain control; or how it will be meaningless to pursue a particular direction. \n\nRecently he sent the lab a rather long email, detailing what each presentation should cover “so that we are not lost in our own work”. One of the points was, “please present how your data will fit in a publication and quantify as to how much you are working towards this publication”. \n\n2 weeks ago he sent also an email to the lab again, saying “since we haven’t met for a month, please make sure to present substantial data during lab meetings.” \n\nThe main PI also recently sent a BITTER email to my co-supervisor (who only joined the department for 2 years) for not helping me in my research when all along my main PI had been the one dictating the direction I should focus on just for publication purposes.",
      "author": "nixeij",
      "created": 1566822718,
      "upvotes": 15,
      "replies": {}
    },
    "ey54vx8": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey54vx8/",
      "text": "That’s... not healthy.",
      "author": null,
      "created": 1566821867,
      "upvotes": 32,
      "replies": {
        "ey5lpyo": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5lpyo/",
          "text": "What's not healthy the lack of feedback or the harsh comment?",
          "author": "Average650",
          "created": 1566834725,
          "upvotes": 3,
          "replies": {
            "ey5mtjo": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5mtjo/",
              "text": "Yeah.",
              "author": "QxV",
              "created": 1566835483,
              "upvotes": 17,
              "replies": {}
            }
          }
        },
        "ey5g8az": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5g8az/",
          "text": "Yeah - I don't think it's uncommon and I think people (particularly ECRs) can be weighted down by shitty comments.",
          "author": null,
          "created": 1566830883,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ey5vecg": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5vecg/",
      "text": "Ooh, I can contribute.\n\nI wrote up my procedural methodology for submission. This was literally a base-covering exercise to show I had undertaken my data collection in a structured and ethical manner, both of which I took pride in.\n\n(What it was not was a PhD \"methodology\" section, which I hoped to write next / later.)\n\nMy PI clearly felt it should have been the latter. \n\nThey described the procedural methodology as - and I quote- \"Like a an instruction manual for flushing a toilet\".\n\nI really don't miss them.",
      "author": "Cocanola",
      "created": 1566841227,
      "upvotes": 14,
      "replies": {}
    },
    "ey61mob": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey61mob/",
      "text": "Ooof, I've since moved on but at one point in grad school I needed to submit a committee update on Friday (the 12th that month). But my school is incredibly lax about deadlines, and my PI had previously berated me for not getting his feedback and edits on a committee update. He didn't tell me he would be out for two weeks, but asked that I send him a copy he could edit and email back to me. I sent it the Sunday before (the 7th) and he said he'd get notes back to me soon. I sent him one email per day trying to get a response that week. \n\nFinally, the day it was due (the 12th), he told me to request a one-week extension. My school did not care in the slightest, so now it was due on the 19th. Another weekend came and went, and I again sent him up-to-date copies every day that weekend in an effort to get him to read it without saying 'hey, dickwad, either read this or tell me you're not going to'. Thursday he asks for another copy (the 18th). Email on Thursday didn't get a response, and another one on Friday didn't get a response. I figured the admins aren't in over the weekend anyway, so I'd hang on to it in case he had edits, since I didn't want to get berated again, and submit it Monday morning (the 22nd). \n\nSaturday's 'hey, did you get a chance to look at this yet?' email came and went, and then came Sunday's. This was the full extent of his response (the 21st):\n\n>I thought we had agreed that you would turn this in on Friday. You\ncan't keep missing deadlines like this. \n\n>\nJust to be clear, you are the only person responsible for meeting your\ndeadlines, just as you are the only person responsible for ultimately\ncompleting your PhD thesis. I am happy to help you along as best I can,\nbut none of your responsibilities are contingent on any work on my part.\n\n> When you want my input on something, you have to ask for it in a timely\nmanner. You then have to politely prod me until I get back to you,\nbecause if I don't get back to you on something you still need to meet\nyour obligations.\n\n> In the future, if you want an extension on any of your thesis deadlines\nor want to delay any of our meetings, we need to agree to this delay\nexplicitly.\n\nThis was the first deadline I'd ever missed in his lab.",
      "author": "alittleperil",
      "created": 1566845341,
      "upvotes": 13,
      "replies": {}
    },
    "ey58bci": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey58bci/",
      "text": "I once had “what do you mean?” At the end of what I considered quite a succinct description of a cellular process. I know it’s actually pretty benign, but made me cry at the time because I had no idea what I meant at that point  (one of those exhausted self-pitying moments🤦🏻‍♀️😂)",
      "author": "SJEEE",
      "created": 1566824897,
      "upvotes": 21,
      "replies": {
        "ey63d83": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey63d83/",
          "text": "Gotta love those vague, open-ended questions that keep coming when they're obviously hunting for a specific answer.\n\n\"What is cell death?\"\n\n\"When the cell ceases functioning.\"\n\n\"Go on...\"\n\n\"The mitochondria stops producing energy.\"\n\n\"Which means...?\"\n\n\"The electron transport chain stops?\"\n\n\"And..?\"\n\n\"Respiration stops?\"\n\n\"Sorry the answer I'm looking for is the cessation of oxidative phosphorylation.\"",
          "author": "rupert1920",
          "created": 1566846488,
          "upvotes": 16,
          "replies": {
            "ey63lzn": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey63lzn/",
              "text": "This. Exactly. It tends to be at the worst times too. Generally when you’re genuinely considering leaving for a career in sheep herding* \n\n*literally anything but what you’re currently doing.",
              "author": "SJEEE",
              "created": 1566846651,
              "upvotes": 14,
              "replies": {}
            },
            "ey64d0j": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey64d0j/",
              "text": "I *hate* when they're actively trying to quiz you. That is not how a conversation works!",
              "author": "alittleperil",
              "created": 1566847146,
              "upvotes": 8,
              "replies": {}
            },
            "ey7qfum": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey7qfum/",
              "text": "This is exactly how I failed the course my entire PhD focuses on. LOL",
              "author": "petite_philosopher",
              "created": 1566895425,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ey5xi6d": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5xi6d/",
      "text": "My PI told me that if I was in the field and my co researcher got electrocuted, I should hold her hand... my PI jokingly told me to kill myself lol.",
      "author": "Algaefarmer",
      "created": 1566842615,
      "upvotes": 10,
      "replies": {
        "ey5xiju": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5xiju/",
          "text": "If you or someone you know is contemplating suicide, please do not hesitate to talk to someone.\n\n**US:**\n\nCall 1-800-273-8255 or text HOME to 741-741\n\n**Non-US:**\n\n[https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines](https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines)\n \n --- \n \n^^I ^^am ^^a ^^bot.  ^^Feedback ^^appreciated.",
          "author": null,
          "created": 1566842622,
          "upvotes": 9,
          "replies": {
            "ey7fily": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey7fily/",
              "text": "Pretty appropriate bot post for this thread",
              "author": "wantonyak",
              "created": 1566881301,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ey622oy": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey622oy/",
      "text": "Oh man I needed this thread right now. I'm sitting here obsessing over a relatively benign email from my advisor. Thank you all for sharing some truly rough moments. This keeps it in perspective!",
      "author": "Byron-Blue",
      "created": 1566845634,
      "upvotes": 9,
      "replies": {}
    },
    "ey5mi5m": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5mi5m/",
      "text": "My PI is way too nice and shy to write such things to students, or at least students he doesn't consider horrible. For example, his criticism on me not having enough results to his liking was phrased as \"your writing abilities are far better than of an average student and it’s a pity you can’t write about a lot of great / publishable results\". He is harsher and more fun as a referee for bad manuscripts submitted to good journals (\"I recommend that the language of the manuscript be upgraded (e.g. \"electron doner\" (donerkebab?)\" - I wrote most of that referee report, but he added the donerkebab).",
      "author": "AstraGlacialia",
      "created": 1566835260,
      "upvotes": 9,
      "replies": {
        "ey6avxq": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey6avxq/",
          "text": "My PI is the same, always super nice and constructive with his students, but man he can be relentless to others. An undergrad student was presenting their project seminar (they were doing photochemistry) and included [this Jablonski diagram](https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcQYAX8_yojoOPTy6i1XqiGZ43BkcDMMnFTJDDDNQBON7XTkr734) and my PI asked \"why did you select this colour scheme?\" The student just said \"it looked nice\", and my PI took that as a \"I know nothing about what I'm presenting\", and proceeded to go to town on him.",
          "author": "Cheffinator",
          "created": 1566851374,
          "upvotes": 3,
          "replies": {
            "ey73c42": {
              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey73c42/",
              "text": "And people keep saying I agonize over my color choices too much...",
              "author": "alittleperil",
              "created": 1566870699,
              "upvotes": 3,
              "replies": {
                "ey8m2dm": {
                  "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey8m2dm/",
                  "text": "for anyone curious about how nutty I am on the topic, I check everything with software that does color-blindness filtering for different types of color-blindness, and I also make an effort to keep things intelligible in grayscale. Then, after I've filled *those* personal requirements, I want them to be aesthetically pleasing and harmonious with each other and with the colors I tend to dress in. Then I try to have related data carried through all slides/figures within the same color family. I also take into account my university's public affairs office's official color list for the campus logo/title, so things won't clash with that, if possible. At least they give that in CMYK.\n\nand that PI can still go kick rocks, color selection is a teeny tiny part of the skills needed to put together a good presentation, and not one related to your understanding of the concepts.",
                  "author": "alittleperil",
                  "created": 1566923158,
                  "upvotes": 2,
                  "replies": {
                    "ey9dapy": {
                      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey9dapy/",
                      "text": "To be fair, the colour scheme of the Jablonski diagram is relevant (although it can be done in black and white and still be OK). The Y axis of the diagram is effectively energy, and thus the higher energy transitions are represented by higher energy wavelengths of light in the visible spectrum (purple and blue for low wavelength/high energy) and lower energy transitions by lower energy wavelengths of light (red and orange for higher wavelength/lower energy). Not so much nit-picking about colour schemes, but rather seeing if the student understood what the diagram that they included was really portraying.",
                      "author": "Cheffinator",
                      "created": 1566940710,
                      "upvotes": 1,
                      "replies": {
                        "ey9yvu8": {
                          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey9yvu8/",
                          "text": "ah, makes more sense, though they probably should have asked the student to explain their color scheme instead. I've found that sometimes people have a rationale that is a bit off-kilter from mine and direct questions don't sort that out as well as asking them to explain it to me does. \n\nWas a lesson I learned from a bunch of older and very prestigious (and cranky) PIs, they'd ask the reasoning behind all sorts of random crap and several times it would turn out that though they were using the standard color scheme or terms or plots, they weren't actually using the standard reasoning. One can argue that they should have made that clearer in their presentation, but some people don't seem to be able to predict what others will think of something at all.\n\nThe extremely few times I've encountered Jablonski diagrams they were in black and white, how standardized are the color schemes? What color is used for ultraviolet? Is it an informal coloring scheme or is there an exact correspondence between energy and wavelength for them?",
                          "author": "alittleperil",
                          "created": 1566955353,
                          "upvotes": 1,
                          "replies": {
                            "eya0a78": {
                              "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/eya0a78/",
                              "text": "I think the question was more along the lines of \"could you explain why you selected that colour scheme for your diagram\", but I know what you mean. \n\nThe colours really aren't necessary, but if it is coloured, it is done for that specific reason. The colours aren't indicative of what wavelengths will be absorbed or emitted as fluorescence/phosphorescence, but just that there is a general trend that the light absorbed will be higher energy/lower wavelength than the light emitted due to Kasha's Rule, resulting in a Stokes Shift.",
                              "author": "Cheffinator",
                              "created": 1566956122,
                              "upvotes": 1,
                              "replies": {
                                "eycfgvv": {
                                  "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/eycfgvv/",
                                  "text": "Thanks!",
                                  "author": "alittleperil",
                                  "created": 1567001142,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ey5ry3k": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5ry3k/",
      "text": "The number and length of ellipses is directly proportional the the amount of displeasure",
      "author": "Juggernaut1210",
      "created": 1566838931,
      "upvotes": 16,
      "replies": {
        "ey64s28": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey64s28/",
          "text": "Ouch!",
          "author": "SJEEE",
          "created": 1566847418,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ey59kiy": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey59kiy/",
      "text": "I've had an email from my PI that was sent to the entire lab (after we had been there for three years) detailing all these do and don't in the lab as well as expected hours to be there.  Now this would be normally bad but if you spoke to him in person, he would say that if you are producing than the rest didn't matter...so you can ignore what I'm saying if you have data.  But if I feel like you don't or are lazy, then I'm going to be passive aggressive to everyone... seriously.  That email was for ONE person out of the entire lab but to not hurt their feelings, he sent it to everyone.  So we all ignored everything after a week.  If you're gonna lay down some rules, be consistent and enforce them (said he was gonna make people who didn't follow the rules present extra papers during lab meeting but never did).",
      "author": "AimanaCorts",
      "created": 1566825908,
      "upvotes": 7,
      "replies": {}
    },
    "ey5ysej": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5ysej/",
      "text": "My PI can send stuff like this but it goes back and forth...  he sent me back a paper after the 15th back and forth with his rephrasing and editing in which he used a specific word about 15 times I answered with a picture of Inigo Montoya saying \"you keep using that word, I don't think it means what you think it means\".",
      "author": "justryingtokeepup",
      "created": 1566843468,
      "upvotes": 7,
      "replies": {}
    },
    "ey6bvo9": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey6bvo9/",
      "text": "I had a conversation where it was like \"what are your ideas?\" I said \"Here are my ideas.\" Then he said \"so, you don't have any ideas?\"",
      "author": "AnimaLepton",
      "created": 1566852011,
      "upvotes": 6,
      "replies": {}
    },
    "ey6usjx": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey6usjx/",
      "text": "My PhD advisor at our first meeting after returning from an approximately 6 week break between semesters after I just had a baby. And we agreed on the break and she told me to enjoy my family.  \n\n“I really wish you were more productive this summer.  I don’t think you are dedicated enough to this program.”\n\nI found a new advisor the next week.  I’m now a candidate and I’m still in track to graduate as planned.",
      "author": "ukjenn231",
      "created": 1566864467,
      "upvotes": 7,
      "replies": {}
    },
    "ey7e10d": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey7e10d/",
      "text": "My Master’s PI sent me and my lab mates a group email with the subject “Disgrace”. The actual email proceeded to berate us for not washing the lab ware after a protein purification. It was the first time any of us had done that and believe me, it was the last. The email was followed by an hour long lab meeting about our so called poor habits. \n\nAnyway, just the shock of the notification for an email from a PI with the subject “disgrace” left me reeling for weeks",
      "author": "coffeebeforebed_",
      "created": 1566879775,
      "upvotes": 6,
      "replies": {}
    },
    "ey6gp1f": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey6gp1f/",
      "text": "Looking over some images I took with an electron microscope (tem)-\nDo you wear glasses?\nNo. \nMaybe you should.",
      "author": "Maddprofessor",
      "created": 1566855183,
      "upvotes": 3,
      "replies": {}
    },
    "ey679aq": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey679aq/",
      "text": "I finished my master last summer. We were supposed to publish my work but I started another program 4000km away. I worked on the paper for a bit, back and forth for edits. Then at one point my PI send their comment the week of a big exam: I replied to say I would look at it the following week. The reply was quite salty (translated): “i let you finished your master with clear expectation that you would make the paper a priority....I expected better since I let you go and that you wouldn’t be in your dream program if I kept you until you finished the paper...”. I revised the paper the following days. \n\nIt fells worse now because my PI just send me the re-revised version, one year after that email!",
      "author": "audrey_c",
      "created": 1566849011,
      "upvotes": 2,
      "replies": {}
    },
    "ey6sphy": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey6sphy/",
      "text": "This was a comment in front of other people at a conference, not an email, but it made me feel shitty all the same!\n\nI was at a music ed conference wandering around the poster sessions and I'd stopped to read something (I don't even rememeber what, now) when my advisor shows up and says to me, \"oh I'm so glad you're reading this. you don't know enough about this kind of stuff.\" Then she says to the person presenting the poster, \"yeah this is my doc student, she doesn't know anything about \\[topic\\].\" I TAUGHT PUBLIC SCHOOL TWICE AS LONG AS YOU DID and am goddamn nationally certified, don't act like I don't know anything and definitely don't say it to this random stranger at a conference!",
      "author": "actuallycallie",
      "created": 1566863144,
      "upvotes": 2,
      "replies": {}
    },
    "ey660nj": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey660nj/",
      "text": "> I definitely chuckled at this!  \n\nI don't think you did.",
      "author": "100011101011",
      "created": 1566848218,
      "upvotes": 2,
      "replies": {}
    },
    "ey6inyq": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey6inyq/",
      "text": "Something salty occurred during my second year of an MA in History in a required class that had a mix of first- and second-year students.  The professor called another second-year student and I to her office and told us that we were intimidating the first-year students and should participate less in class discussions.",
      "author": "postcardigans",
      "created": 1566856496,
      "upvotes": -1,
      "replies": {}
    },
    "ey5z1z2": {
      "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey5z1z2/",
      "text": "I mean, I'm sorry for everyone for being treated poorly by others, but threads like these really don't help the negativity problem in academia. This is just a collection of bad experiences; could we not at least try to make it a bit more positive by suggesting coping strategies for despicable behaviours like these?",
      "author": "turkishdisco2",
      "created": 1566843644,
      "upvotes": -13,
      "replies": {
        "ey623tv": {
          "link": "/r/AskAcademia/comments/cvmw0s/salty_pi_emails/ey623tv/",
          "text": "Be the change you want to see in the world.",
          "author": "alittleperil",
          "created": 1566845654,
          "upvotes": 12,
          "replies": {}
        }
      }
    }
  }
}