{
  "sid": "jxg3af",
  "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/",
  "title:": "I got an interview for my dream postdoc",
  "text": "Somehow, I have managed to get an interview for my dream postdoc. It's in a location I have always dreamed of living in. It's at a renowned research institution under the supervision of an incredible and famous researcher. It's a position I don't feel that I am qualified for but yet somehow here I am. \n\nThere are two positions open. And 6 people being interviewed. It is all too surreal. We went from me applying almost as a joke since I am nowhere near the caliber of the research that goes on there to finding out I got an interview to finding out that there's a decent chance of being successful.\n\nBut now, I am even more stressed. I feel I am going to botch the interview and I will feel even worse because it was such a small hiring pool. I want to do well and have been practicing answering interview questions and reading up on the project topic for the last week. But I still feel like it won't be enough. \n\nHow do I ace the interview and go on to live my dream position?",
  "author": "minutemaidpeach",
  "created": 1605836747,
  "updated": 1634080623,
  "over_18": false,
  "upvotes": 230,
  "upvote_ratio": 0.98,
  "comments": {
    "gcweqn0": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcweqn0/",
      "text": "Sounds like you've been answering interview questions and reading up on the topic already, which is great! If you're going to give a presentation to the PI (or to the PI's group), I would schedule a practice talk with your current lab, advisor, or close friends. \n\nThe fact that you are on the shortlist is a GREAT thing. It shows that you have what they're looking for on paper. Now, you just have to see if there's a connection when you're actually chatting about the project and your previous research experience with the PI. I stress easily, so I can relate to how you're feeling, and I've also had intense feelings of imposter syndrome (still do) and feeling like I'm nowhere near qualified for opportunities that I've been given. But you've already done enough work to get (or to get close to getting) a PhD, so now is your chance to highlight your accomplishments! Try to focus on what you CAN bring to the table and also try to think of the interview as a two-way street. The researcher might be incredible and famous, but the interview is your opportunity to also make sure that they'll be a good mentor/PI for you as a postdoc. \n\n&#x200B;\n\nGood luck! :)",
      "author": "saltedcheesetea",
      "created": 1605838371,
      "upvotes": 62,
      "replies": {}
    },
    "gcwj30b": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcwj30b/",
      "text": "Seconded what the other two commenters said. Practice your talk, and keep in mind that now that you’re almost done your PhD you are one of a handful of experts in that very specific thing. I just wanted to comment because I was in the same position, applied for a reach/a dream postdoc, actually got an interview and ended up getting hired!! It can happen!! Keep your head up and believe in your own science and your own abilities and you’ll be great",
      "author": "evil_twin_revolution",
      "created": 1605840793,
      "upvotes": 28,
      "replies": {}
    },
    "gcwh4th": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcwh4th/",
      "text": "Just remember—if you got this far, it means they know for a fact that you are good enough to actually get the position! You wouldn’t be at this stage otherwise. Be confident and put your best foot forward. Pulling for you!",
      "author": "truthswillsetyoufree",
      "created": 1605839702,
      "upvotes": 18,
      "replies": {}
    },
    "gcwua4u": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcwua4u/",
      "text": "I agree with everyone’s suggestions here. I wanted to provided one more counter perspective that no one has mentioned yet. Sounds like you’re suffering imposter’s syndrome. Easier said than done, but as soon as you shake that feeling and start realizing your value, the less tense and more free you’ll feel to talk about your passion for the science. Just remember, even if you don’t get this exact position there are so many potential positions that can offer just as auspicious of an opportunity. If you’ve already got this far and got this level of interest, then that means you’ll inevitably land a nice position somewhere. Once you free yourself of the notion that this is do or die, it will liberate you to be more yourself during the interview. You’ll begin to focus on what you think/feel rather than saying what you think they want to hear (which is a terrible trap to fall into).",
      "author": "amrbmr",
      "created": 1605847341,
      "upvotes": 14,
      "replies": {}
    },
    "gcxam4x": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcxam4x/",
      "text": "In addition to what everyone else has said, try to come across as a collegiate, friendly, and likeable individual. At times this is the only thing that separates two candidates that I think will be equally good fit in my lab.",
      "author": "motorheadavcn",
      "created": 1605860936,
      "upvotes": 8,
      "replies": {}
    },
    "gcwv3xn": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcwv3xn/",
      "text": "I don't have specific advice, but you would not have gotten an interview if they didn't think you were great (and very qualified). Believe in yourself!",
      "author": "tishtok",
      "created": 1605847878,
      "upvotes": 6,
      "replies": {}
    },
    "gcxgfqo": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcxgfqo/",
      "text": "A late comment tacked on to the other good advice you are getting:\n\nJust remember you don't have to be at the top of the field, if they had wanted that they wouldn't be advertising for a postdoc, but instead for full a professor. They want a person with prospects and are willing to continue your education by mentoring you. Also, the other five candidates are just as nervous as you are! And it is quite possible that none of you have that dream-level of skills that you feel you lack. You are probably all in the same boat, so do do fear them. Also, as you call this your ideal postdoc, they will pick up on that enthusiasm. Some of your competitors may have their dream spot at some other place, and the  committee will percieve that too. You may very well be well positioned.\n\nBest wishes from a retired but OK boomer, whippersnapper.🍻",
      "author": "grodhagen",
      "created": 1605867295,
      "upvotes": 7,
      "replies": {}
    },
    "gcx77vr": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcx77vr/",
      "text": "Two things:\n1. Practice. With people who will give you feedback.\n2. You have got this far. They know you can do the job. But they want to meet you and see if you would be a good person to work with. So just be yourself. And be cool.",
      "author": "reversechinlock",
      "created": 1605857609,
      "upvotes": 3,
      "replies": {}
    },
    "gcwr7ko": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcwr7ko/",
      "text": "I would sit quietly and really imagine my day to day life in that job. How will I feel? What will I contribute? Who will I work with? How will I collaborate with them? Where will I live? What will I eat? I think too often candidates practice expressing the highlights of the work they have already done in the past, but the interviewer needs to know what the candidate will do in the future, in the interviewer's future. Not only that, but what the candidate will do must be what the interviewer needs. So, they must have a shared vision of the future. They both have to imagine they will work well together and be productive before the interviewer can offer the job to that candidate.\n\nAlso, the candidate must listen attentively. Sometimes an interviewer will explain the project and/or specific needs he requires of the postdoc only during the interview. This information is not written in the advertisement so the candidate has no way to prepare for it. Keep your wits about you.",
      "author": "patriotto",
      "created": 1605845489,
      "upvotes": 7,
      "replies": {}
    },
    "gcxgnw3": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcxgnw3/",
      "text": "In addition to practicing the talk, ask yourself regular old interview questions and respond to them out loud. It helps so much to hear yourself say something and revise it!  I do this in the car for days leading up to it.\n\nAlso underscoring what others have said— you are good enough/qualified. They’re looking for best fit now. Good Luck!!",
      "author": "BetsyTacyTib",
      "created": 1605867552,
      "upvotes": 2,
      "replies": {}
    },
    "gcxh0u5": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcxh0u5/",
      "text": "Quick tips:\n\n1. Read up on the post-doc proposal; they tend to be highly technical, and that's only one of the parts you should extract info for. The other is: the nature of the project and the funding (private, national, international, etc); if there's a company involved, rea dup on the company; if it's an international project then follow-up on that, and so on. \n2.Prepare a couple of \"success stories\" from previous experiences related with the post-doc; this means describing them brieffly and finish by explaining how it translates to the position you're applying to. be ready to answer a few follow-up questions. \n3. Read up on the work on the lab; look for techniques, equipment, research topics that you are familiar with and bring them up during the interview (e.g. \"I read that you have equipment XX that you have used for YYY, and it so happens that I've also used one...\")\n4. Although you wil be hired for a specific project, the responsabilities of a post doc may vary widely. If you don't know yet, askk if it requires supervision work, writing proposals for funding, teaching, manage a lab/equipment and so on. Be reasy to support your competences by mentioning previous experiences, and how they may be relevant.  \n\nYou got this.",
      "author": "_whatevs_",
      "created": 1605867963,
      "upvotes": 2,
      "replies": {}
    },
    "gcxigue": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcxigue/",
      "text": "Everybody has given you great advice. One more thing. Be sure to read about the lab, the institution and the area so that you have maybe a half dozen questions that can be answered in a minute or so. Scatter those questions around in the various meetings that you have. It will make it clear that you care enough about the position to have done background research on the place. One thing that really eliminated people from our pool at interviews were those that made statements about what they would/could do that were inconsistent with our educational mission.\n\nCongratulations and good luck!",
      "author": "rockyfaceprof",
      "created": 1605869595,
      "upvotes": 2,
      "replies": {}
    },
    "gcxmrvl": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcxmrvl/",
      "text": "Congratulations on this wonderful opportunity! I 100% agree with everyone’s advice here. I also want to make sure you know that even if you don’t end up getting the position (we should be sure to prepare ourselves for all possible outcomes), you are still a worthy and accomplished researcher. The fact that you were chosen for this interview speaks to that fact, and it is not contingent on you landing the job. \n\nThat being said, good luck!!!",
      "author": "esacchi",
      "created": 1605874024,
      "upvotes": 2,
      "replies": {}
    },
    "gcy5vf8": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcy5vf8/",
      "text": "My only piece of advice: leave your \"I'm here by sheer luck\" attitude out of every single piece of narrative you provide. It's great that this came as a suprise, and congratulations, but the overexcited, surprised, shocked by the news applicant tends to be very unattractive during interview, as it shows self doubt, a juvenile character, and provides little evidence of how you would be as an actual colleague.\n\nRegardless, and by all means: CONGRATULATIONS and I hope you get this!!!",
      "author": "phenomenologist83",
      "created": 1605886391,
      "upvotes": 2,
      "replies": {}
    },
    "gcxaecz": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcxaecz/",
      "text": "Do you get anxious during these types of things in a way that takes away from what you’re trying to present? If so, beta blockers are a wonderful aid.",
      "author": null,
      "created": 1605860715,
      "upvotes": 1,
      "replies": {}
    },
    "gcyg7jh": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcyg7jh/",
      "text": "I don’t have anything to add, but just wishing you the best! You’ve got this :)",
      "author": "secretpoop75",
      "created": 1605891445,
      "upvotes": 1,
      "replies": {}
    },
    "gcyghyi": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcyghyi/",
      "text": "And don't be afraid to show your passion for working and living there!",
      "author": "botnut",
      "created": 1605891583,
      "upvotes": 1,
      "replies": {}
    },
    "gcz2blv": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcz2blv/",
      "text": "A post doc job is a combination of both the research itself and executing the lab operations.  So prepare for the interview with both tracks in mind.  Look up behavioral interview questions and prepare STAR (situation task action result) answers for them, aiming to provide examples  of your past experience (research and otherwise) that shows you're a good fit for a \"manager of operations\" type role in research - I'm betting they have a substantial team so this may not be wholly your responsibility alone, but the role really is like a sous-chef of the research world.  Even if the prof doesn't hold the interview in that format, it does help to prepare a variety of quick and comfortable responses that shows the prof all you're bringing to the table.\n\nI'd be preparing answers along the lines of \"What do you do when you get stuck in your work?\" \"Tell me about a time you had to deal with someone difficult\" \"How do you deal with a lot of work and deadlines coming up at once\" and other situations in a research lab where shit can head south quick...",
      "author": "lizbunbun",
      "created": 1605902063,
      "upvotes": 1,
      "replies": {}
    },
    "gczh6kk": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gczh6kk/",
      "text": "Don’t be shy, show them or express how enthusiastic/passionate are you about the research, joining their group, and working with them.",
      "author": "Vegan_Force",
      "created": 1605909561,
      "upvotes": 1,
      "replies": {}
    },
    "gcydc9h": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gcydc9h/",
      "text": "Oh relax. If you don’t get it, it’s not like they cut your legs off. Go in there relaxed, thinking “I probably won’t get it, but just interviewing and meeting these people is a valuable experience.” Just try to get the most out of *that*.",
      "author": "TakeOffYourMask",
      "created": 1605890080,
      "upvotes": 1,
      "replies": {}
    },
    "gdhkvcv": {
      "link": "/r/AskAcademia/comments/jxg3af/i_got_an_interview_for_my_dream_postdoc/gdhkvcv/",
      "text": "Everybody keeps saying practice your talk.  Yes, but not too much so that it sounds memorized.  You want to go and have a conversation with them, i.e. be open to interruptions, etc. Something nobody mentioned is that you need to relax and focus on just being friendly to everyone. Likability is a huge factor in all this. They want to know you're someone that makes them comfortable and is easy to be around.",
      "author": "scintor",
      "created": 1606254318,
      "upvotes": 0,
      "replies": {}
    }
  }
}