{
  "sid": "q5e3zz",
  "link": "/r/AskAcademia/comments/q5e3zz/could_comments_and_reaction_videos_on_youtube_be/",
  "title:": "Could comments and reaction videos on YouTube be a source for writing about people's opinion on pop songs?",
  "text": "I could imagine it might not seem professional and interviews are always preferred, but doesn't it also shows people's opinion?",
  "author": "Lost7799",
  "created": 1633891728,
  "updated": 1634078389,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hg522qy": {
      "link": "/r/AskAcademia/comments/q5e3zz/could_comments_and_reaction_videos_on_youtube_be/hg522qy/",
      "text": "Depends on how you're using them and your methodology",
      "author": "IntLawprof",
      "created": 1633894648,
      "upvotes": 3,
      "replies": {}
    },
    "hg57k63": {
      "link": "/r/AskAcademia/comments/q5e3zz/could_comments_and_reaction_videos_on_youtube_be/hg57k63/",
      "text": "If you define \"people\" as \"people commenting on YT\" (not as a representative sample of all people on Earth) in your paper and explain why this is interesting and important, it could be a viable source.\n\nBut, check with your advisor/professor. There may be other stuff at play here that outsiders aren't aware of.",
      "author": "molobodd",
      "created": 1633896821,
      "upvotes": 3,
      "replies": {}
    },
    "hg67tbw": {
      "link": "/r/AskAcademia/comments/q5e3zz/could_comments_and_reaction_videos_on_youtube_be/hg67tbw/",
      "text": "Of course comments on YouTube (or any website) can be legitimate sources in scholarly articles.  I've used them myself in an article I published in a very good journal in my (humanities) field.  (Incidentally, I recently reviewed a scholarly article that quotes comments on a subreddit!)\n\nAny source is legitimate, as long as you use and interpret it properly, and do not attribute value to it that it is not able to bear.\n\nAnd fyi, interviews are not always preferable. They would have been irrelevant both in the article I wrote, and in the article I just reviewed.  Your choice of data depends on what you are trying to accomplish in your article, and what interpretive methods you are using.",
      "author": "matthewsmugmanager",
      "created": 1633913113,
      "upvotes": 2,
      "replies": {}
    }
  }
}