{
  "sid": "q3icp3",
  "link": "/r/AskAcademia/comments/q3icp3/what_are_your_experiences_like_serving_as_an/",
  "title:": "What are your experiences like serving as an associate editor?",
  "text": "I'm curious on different experiences you've had serving as an associate editor of an academic journal? Pros/cons, articles about that experience? Is it more political than you expect? Is it more or less work than you expect? (I'm in the US, in science/engineering, but curious about all disciplines).",
  "author": "BananasonThebrain",
  "created": 1633639870,
  "updated": 1634078685,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hft0y7a": {
      "link": "/r/AskAcademia/comments/q3icp3/what_are_your_experiences_like_serving_as_an/hft0y7a/",
      "text": "It’s mostly just annoying trying to track down good reviewers and keep things moving. Sometimes it’s also a pain when two good reviewers give very different reviews and you have to make a judgement call.",
      "author": "ohnoyoudin",
      "created": 1633658949,
      "upvotes": 4,
      "replies": {
        "hfvielv": {
          "link": "/r/AskAcademia/comments/q3icp3/what_are_your_experiences_like_serving_as_an/hfvielv/",
          "text": "Don't you ask a third reviewer to split the tie then?",
          "author": "ThePhysicistIsIn",
          "created": 1633712718,
          "upvotes": 1,
          "replies": {
            "hfvqsq1": {
              "link": "/r/AskAcademia/comments/q3icp3/what_are_your_experiences_like_serving_as_an/hfvqsq1/",
              "text": "Sometimes, but it’s not required.",
              "author": "ohnoyoudin",
              "created": 1633716200,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfs8n7n": {
      "link": "/r/AskAcademia/comments/q3icp3/what_are_your_experiences_like_serving_as_an/hfs8n7n/",
      "text": "I’m a biologist. I am an AE at a fairly prestigious journal in my field. I only agreed pre-tenure because I was promised handling one article at a time with a monthly upper limit. I have not found it to be political, but we have fairly aggressive desk reject procedures. I would not have taken the position if I didn’t have foreknowledge of the desk reject procedures and the article limit. I feel like if you have weak upper management at a journal and they kick a lot of crap down to you, you have to flat-out reject more and that’s where a lot of politics come in.\n\nWe also have a policy where there is no “major revisions” acceptance, and that saves us some grief.",
      "author": "StorageRecess",
      "created": 1633645138,
      "upvotes": 4,
      "replies": {
        "hfswrjy": {
          "link": "/r/AskAcademia/comments/q3icp3/what_are_your_experiences_like_serving_as_an/hfswrjy/",
          "text": "Do you not like because you don't like \"being mean\" or you think you have to reject actually decent science? I fear if I took an AE role I'd be simultaneously annoyed that authors didn't implement all the suggestions and frustrated that I had to play bad cop. On the other hand it's a nice resume builder and a different type of experience / a peak even further into the curtains of publishing.",
          "author": "BananasonThebrain",
          "created": 1633656885,
          "upvotes": 2,
          "replies": {
            "hft9ues": {
              "link": "/r/AskAcademia/comments/q3icp3/what_are_your_experiences_like_serving_as_an/hft9ues/",
              "text": "Do I not like what? \n\nI don't feel like I'm being pressured to reject science that is both good and fit for the journal. I would say sometimes I get submissions that don't belong in the journal, even if they're methodologically sound. No journal can publish everything; there has to be scope and that's fine. I don't necessarily see my role as rejecting or being mean. I read and form an opinion, as do the reviewers, and it's my job to synthesize those four viewpoints into a coherent, actionable recommendation. The editor can decide to agree or disagree with me.\n\nBut I also don't think rejection is that big a deal. If a paper doesn't fit the journal, send it elsewhere. If AEs and reviewers say you have a lot more to do, decide how much you want that paper and act accordingly. We all get work rejected sometimes.",
              "author": "StorageRecess",
              "created": 1633663376,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hfupxbn": {
      "link": "/r/AskAcademia/comments/q3icp3/what_are_your_experiences_like_serving_as_an/hfupxbn/",
      "text": "It's more work than it seems if you want to do a good job. Getting people to agree to review is the second worst part of it (not that I necessarily blame potential reviewers - there are probably too many journals). The worst is being on the hook for the decision when you aren't an expert on the topic and the reviewers disagree. But the position forces you to read more papers and connect with people in the field, so there are upsides.",
      "author": "late4dinner",
      "created": 1633700485,
      "upvotes": 1,
      "replies": {
        "hfurv5b": {
          "link": "/r/AskAcademia/comments/q3icp3/what_are_your_experiences_like_serving_as_an/hfurv5b/",
          "text": "Thanks - this is helpful. It does seem like a tricky mix of decision-making and cajoling reviewers, with the upside of learning a bit outside your core area and (maybe optimistically) helping shape the field.",
          "author": "BananasonThebrain",
          "created": 1633701398,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}