{
  "sid": "pvzhuj",
  "link": "/r/AskAcademia/comments/pvzhuj/what_is_considered_service/",
  "title:": "What is considered \"service\"?",
  "text": "I have to do a self-evaluation as part of our annual review. For NTT we are rated on teaching/student engagement and service. I don't participate in any committee work and basically just attend faculty meetings. So, what else counts as service? I write many letters of recommendation - does that go towards service?",
  "author": "Lakanas",
  "created": 1632681185,
  "updated": 1634078840,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.92,
  "comments": {
    "hedt0ny": {
      "link": "/r/AskAcademia/comments/pvzhuj/what_is_considered_service/hedt0ny/",
      "text": "This varies by school (and by country), but a few general principles that probably apply more often than not:\n\nThere are different levels of service: to the department, to the college, to the university, to the community, and to the field.\n\nService to the department involves things like committee work, curriculum design, assessment, and advising. Same pretty much goes for service to the college and university, though those tend to be more important committees, etc.\n\nService to the community could be any type of, well, community service. Not every place is going to care if you're reading to the elderly at nursing homes or something, but people put that kind of thing down, especially if it can be at all tied back to what you teach or your research areas. But it's usually possible to spin civic engagement in a positive fashion, especially if you can call it \"outreach\" for your discipline.\n\nService to the field involves being on committees for regional and national professional organizations, but can also include doing peer review for journals and presses.\n\nThis is obviously just a broad overview, but I hope it's enough to at least give you some idea.",
      "author": "Publius_Romanus",
      "created": 1632684296,
      "upvotes": 16,
      "replies": {}
    },
    "hee6lpx": {
      "link": "/r/AskAcademia/comments/pvzhuj/what_is_considered_service/hee6lpx/",
      "text": "Anything that's not research and teaching.",
      "author": "MDPhDDoc",
      "created": 1632689829,
      "upvotes": 5,
      "replies": {
        "hee8rmm": {
          "link": "/r/AskAcademia/comments/pvzhuj/what_is_considered_service/hee8rmm/",
          "text": "Thanks. I guess I will include advising, and letters as service as they are not directly teaching. I'm so teaching focused I often forget about this other stuff. Hope my committee neglect doesn't harm me when I apply for senior lecturer position.",
          "author": "Lakanas",
          "created": 1632690760,
          "upvotes": 7,
          "replies": {
            "hee8z74": {
              "link": "/r/AskAcademia/comments/pvzhuj/what_is_considered_service/hee8z74/",
              "text": "I would consider all that you have said here as service. \n\nI mean it's ambiguous so include everything you can. No wrong answer.",
              "author": "MDPhDDoc",
              "created": 1632690852,
              "upvotes": 5,
              "replies": {}
            },
            "heecv5s": {
              "link": "/r/AskAcademia/comments/pvzhuj/what_is_considered_service/heecv5s/",
              "text": "How far away are you for going up for senior lecturer? It might help to join a few committees. Some schools really stress service work, and advising and letters aren't really things you can volunteer for. Committees are. It's very frustrating and annoying, but sometimes you can volunteer to run your department's Twitter or something and that will help.",
              "author": "ekochamber",
              "created": 1632692534,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hedvrne": {
      "link": "/r/AskAcademia/comments/pvzhuj/what_is_considered_service/hedvrne/",
      "text": "gods i wish my school would clarify this.  some people write that mowing their lawns is service to the community.",
      "author": "printandpolish",
      "created": 1632685408,
      "upvotes": 4,
      "replies": {
        "hee79wi": {
          "link": "/r/AskAcademia/comments/pvzhuj/what_is_considered_service/hee79wi/",
          "text": "Well if that old bag across the street doesn't stroke out and call the HOA every time I miss a week of mowing, and then I subsequently don't have to see her in the hospital, I'm pretty sure thats service. Hahaha but seriously, you're comment is too true.",
          "author": "StewardOfRavenclaw",
          "created": 1632690120,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "heejuxp": {
      "link": "/r/AskAcademia/comments/pvzhuj/what_is_considered_service/heejuxp/",
      "text": "Talk to your chair about it. I was very expansive both as a faculty member and as a chair and so attending student service activities, going to sporting events after they sent emails to faculty asking us to go to basketball games, etc., helping other faculty in a variety of ways (down to sharing syllabi, etc.), talking with media, meeting with students who are considering attending the institution and so on. In the community, doing anything that is essentially showing the flag, so going to recruitment events, giving community talks at which I'm represented as a faculty member/chair, helping in the local school system and mentioning the college, and so on.\n\nI'd put down more rather than fewer things. But, again, have a chat with your chair about what is appropriate.",
      "author": "rockyfaceprof",
      "created": 1632695712,
      "upvotes": 1,
      "replies": {}
    }
  }
}