{
  "sid": "hpawhd",
  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/",
  "title:": "Do you ever feel \"reviewer's guilt\"?",
  "text": "Recently reviewed a paper and couldn't help but give it a very critical review with a recommendation to the editor to reject. I gave a very detailed review with both specific and general comments, and tried to write something constructive.\n\nI can't help but empathize with the writer. Probably a PhD student trying to get published, worked hard and did what his advisor suggested and likely poured his guts in to it.\n\nI couldn't suggest to accept it but I can't help feeling guilty for \"being mean\" to the authors and ruining their day/week/month.\n\nAnyone else feel this? How do you deal with it?",
  "author": "justryingtokeepup",
  "created": 1594477779,
  "updated": 1634080232,
  "over_18": false,
  "upvotes": 285,
  "upvote_ratio": 0.98,
  "comments": {
    "fxoofm8": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxoofm8/",
      "text": "Reviews are hurting when the reviews are not helpful and felt like reviewers didn't read it carefully. Or sometimes I can easily tell the reviewers already knew who I am (it's not difficult to figure out no matter what kind of blind system the journal is using) and they just don't like my group for whatever reason. Constructive reviews, even if they're very critical of my work, don't hurt. Often I feel thankful for their time and effort to read my paper. I understand how you feel, and I guess you feel it because you're a kind person in general, but at the end of the day you're helping the entire community not only the authors.",
      "author": "log-normally",
      "created": 1594480673,
      "upvotes": 176,
      "replies": {
        "fxp26mz": {
          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxp26mz/",
          "text": ">Or sometimes I can easily tell the reviewers already knew who I am (it's not difficult to figure out no matter what kind of blind system the journal is using) and they just don't like my group for whatever reason. \n\nI can't even imagine being that petty...",
          "author": "MonstarGaming",
          "created": 1594484198,
          "upvotes": 48,
          "replies": {
            "fxpcwyu": {
              "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpcwyu/",
              "text": "oh believe me it is far more common than you would think",
              "author": "YNSBRYR",
              "created": 1594487131,
              "upvotes": 67,
              "replies": {
                "fxppkpr": {
                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxppkpr/",
                  "text": "Yep, sad. It happened two of my fellow group members recently.",
                  "author": "Dr_Defecation",
                  "created": 1594490180,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        },
        "fxqmbhv": {
          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqmbhv/",
          "text": "[deleted]",
          "author": null,
          "created": 1594498035,
          "upvotes": 3,
          "replies": {
            "fxqr2ww": {
              "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqr2ww/",
              "text": "It doesn’t really matter. As your career goes on, you become familiar enough with your field/peers to often accurately identify what group a paper has come from just by the content of the paper itself (at least in STEM, via the specific hypothesis being tested, methods used, etc.).",
              "author": "functionalatbest",
              "created": 1594499045,
              "upvotes": 16,
              "replies": {
                "fxsdvz7": {
                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxsdvz7/",
                  "text": "Yep. I accurately identified the other two reviewers of a paper I reviewed just recently because the field is so small. I guarantee the writter also knew who at least one of us were, if not more.",
                  "author": "fleeingslowly",
                  "created": 1594521334,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fxol7dw": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxol7dw/",
      "text": "If they take on your feedback they will be a better writer and a better researcher at the end of it. \n\nYou're doing them a favour in the long run, but with some pain in the short; and are an essential part of the academic process.",
      "author": "SweatyKoalas",
      "created": 1594479742,
      "upvotes": 138,
      "replies": {
        "fxp3h7b": {
          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxp3h7b/",
          "text": "That said, OP is on to something here. Even after +30 papers, I vividly remember the review of my first paper that I had spent more than a year writing. \n\nIt received a review in two weeks, which was a short & sweet insulting paragraph saying *there is no way they did what they claimed to do here* for something we didn't claim to do. \n\nThere is no reviewer school but some people will hide behind (the necessary) anonymity and will have lasting impact on others.\n\nBeing respectful and conscientious, you can still reject the paper.",
          "author": "YNSBRYR",
          "created": 1594484567,
          "upvotes": 74,
          "replies": {
            "fxpdyth": {
              "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpdyth/",
              "text": "A good editor should never allow mean-spirited comments to be passed on to the authors. There simply is no place for it. I’ve edited at 4 journals now for a cumulative 20+ years; I would have been livid were I to have read callous or mean comments that were meant to be no more than an effort to drag someone down. My first submitted paper was very much like what OP described and it was because of the patient hand-holding of the reviewers and editor that it was published. Now it’s a highly cited paper. I look on that experience and it shapes my behavior to this day. Science is not made better by us dragging each other down. There is much too much to learn and too much curiosity to satisfy to lead to and allow such gate-keeping behavior. I won’t stand for it in my small corner of the world.",
              "author": "Frogmarsh",
              "created": 1594487418,
              "upvotes": 46,
              "replies": {
                "fxpv62q": {
                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpv62q/",
                  "text": "I recently co-authored a manuscript with a PhD student. One of the reviewer's comments were some of the nastiest I have seen. The reviewer included sarcastic questions (and equally sarcastic answers to their own questions), a condescending tone, and overall included very few constructive comments. I was shocked the editor let these comments even reach us. My co-author was upset and confused by this reviewer, particularly as the other reviews were overall positive.  I have thick skin and can handle these types of reviewers, but am disappointed that this journal (which regularly receives submissions from students and early career researchers) would let this reviewer be so nasty. \n\nAs an editor, do you have any recommendations for these situations (in regards to authors communicating their experiences to editors)?",
                  "author": "kittymeowss",
                  "created": 1594491463,
                  "upvotes": 21,
                  "replies": {
                    "fxpynbr": {
                      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpynbr/",
                      "text": "I would write a strongly worded letter to the lead editor (cc’ing any handling or assistant editor) letting them know in no uncertain terms how unacceptable it is for them to have forwarded those comments on. If they push back, I’d go to the larger Society, assuming it’s a Society journal, and alert them to the inept stewardship at the journal. If you’re not getting the response from the journal or society you require and depending on the severity of the situation, I’d create a shit storm of negative publicity on Twitter; bullying in academia must come to an end and the only way to do so is to bring it into the light. We should expect respect and if it isn’t given demand it and if it isn’t given then then take it. If you can’t tell, I’m quite angry just thinking about this topic.",
                      "author": "Frogmarsh",
                      "created": 1594492219,
                      "upvotes": 26,
                      "replies": {
                        "fxq0sip": {
                          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxq0sip/",
                          "text": "Thank you for your advice. I had considered writing to the editor but now feel much more confident that that is an appropriate next step. I'm also very upset about the bullying that occurrs, especially in reviewing. I'm glad to hear there are others who fight the good fight! Thank you again!",
                          "author": "kittymeowss",
                          "created": 1594492749,
                          "upvotes": 16,
                          "replies": {
                            "fxrul2u": {
                              "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxrul2u/",
                              "text": "(With caveat that I’ve gotten unfair / poorly done reviews but never one like that review) I’d avoid alienating the editor (and certainly would be hesitant to escalate to “a shit storm of negative publicity”. Not great to create broad swaths of enemies. Definitely inhumane reviews shouldn’t be ignored; but i just want to avoid the reviewer getting away and you bearing all the negative consequences.",
                              "author": "schizontastic",
                              "created": 1594511135,
                              "upvotes": 1,
                              "replies": {
                                "fxsxk9x": {
                                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxsxk9x/",
                                  "text": "I'm going to have to disagree on this. This whole avoidance of conflict and commitment to always let bullies save face is one of the reasons crap like this persists. So, so soooo much damage is being done to people with zero consequences because you \"don't want to make enemies\". This is how abuse has persisted in and outside of academia, in our society - literally any scale I can think of. If people can get away with it and know that comfort is of the utmost priority, people will just continue like this.",
                                  "author": "IntriguinglyRandom",
                                  "created": 1594532274,
                                  "upvotes": 5,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fxpzcq0": {
                      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpzcq0/",
                      "text": "How did you respond w your student? I had a similar situation w an r-and-r at a fine but not especially prestigious journal, where the PhD student was lead author on our paper, and she was so upset by the shittiness of the reject reviewer comments that she didn't want to return to the piece and revise for resubmission. I tried empathizing w her hurt feelings (which were totally legitimate) and also reframing things a bit (you know: this person representsone possible audience; we wouldn'thave gotten an r-and-r if the editor didn't see merit to the piece; etc.), w/out much success. The paper was her lead, and not really important for me agenda-wise, so I stopped pressing her on it after a few communications, and we never ended up resubmitting. Which is a pity, because I think only more over time that the piece would have been a real contribution. \n\nI feel badly that I wasn't able to help that student see past the snideness and recover her enthusiasm for the work. I mean, I tried, but failed. How were you able to help your student do that?",
                      "author": null,
                      "created": 1594492350,
                      "upvotes": 12,
                      "replies": {
                        "fxq5ee3": {
                          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxq5ee3/",
                          "text": "I'm sorry your student had a similar experience. My circumstance was a little different, in that the PhD student was a student from another institution. I worked with her previously while I was also a student, but now I'm TT. \n\nThat being said, I basically validated that this was in fact a shitty reviewer and their feedback was not representative of the quality of the manuscript. I helped her identify which points the reviewer made that were valid (there were few) and explained why most of the rest of the review was inappropriate. Because I was serving as a coauthor instead a mentor, I volunteered to handle all responses to that reviewer and had her focus on the other two reviews, which were far more constructive and accurate. \n\nWe got the manuscript tidied up and recently re-submitted it. I will be very surprised if it is not accepted. \n\nI'm not sure what else I would have done in your situation, tbh. It sounds like you tried to help reassure her that the work was still meaningful, but other than validating the shittiness of the review, it's hard to know how to support students when they get this kind of feedback.",
                          "author": "kittymeowss",
                          "created": 1594493949,
                          "upvotes": 9,
                          "replies": {
                            "fxq7jqw": {
                              "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxq7jqw/",
                              "text": "Thanks a lot for sharing your experience, and I wish the paper wings!\n\n(I hope there's growing awareness about the moral weight of tone in reviews, too.)",
                              "author": null,
                              "created": 1594494407,
                              "upvotes": 5,
                              "replies": {
                                "fxq9rxh": {
                                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxq9rxh/",
                                  "text": "Thank you so much! I'm glad to see so many others who want to build scientists up, not tear them down",
                                  "author": "kittymeowss",
                                  "created": 1594494941,
                                  "upvotes": 6,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fxse9st": {
                      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxse9st/",
                      "text": "In the review I last did, the whole process was automated, so there was no way to edit out any reviewers comments. It just anonymized them and sent them to the editor and author.",
                      "author": "fleeingslowly",
                      "created": 1594521480,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "fxsx9y5": {
                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxsx9y5/",
                  "text": "Wish you were a reviewer on my paper that my ex (read co-advisor for the sake of peace keeping) advisor is trying to force through... we got some really nasty reviews on it and now this faculty is threatening my authorship so they can put their current PhD student on it. It's absolutely participating in gate keeping and apparently this faculty has displayed a pattern of doing this... we are also in ecology but sadly I am out of this field because of this behavior. My life is worth more.",
                  "author": "IntriguinglyRandom",
                  "created": 1594532057,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fxqmdrn": {
          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqmdrn/",
          "text": "Similarly, if your review is too polite and kind, there is a real risk that the authors will either miss your point or simply choose not to improve their paper.\n\nAlthough often taken too far, a blunt and critical review is often the best way to help authors improve.",
          "author": "pressed",
          "created": 1594498042,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fxou21v": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxou21v/",
      "text": "I am the student you speak of. As long as there is feedback I can use please don't feel guilty. Obviosuly publishing is the best outcome for me, but having someone read your paper, actually care and provide feedback is a good 2nd.",
      "author": "S_27",
      "created": 1594482237,
      "upvotes": 36,
      "replies": {
        "fxti4kg": {
          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxti4kg/",
          "text": "One could argue that having one published paper that no one will take seriously is worse than not publishing. Your first paper will be the first thing on your CV for a while. I’m also a PhD student, si not talking from experience, just my intuition.",
          "author": "Melvinci",
          "created": 1594552108,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fxoqjzi": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxoqjzi/",
      "text": "Your main objective as a reviewer is to help authors to enhance the paper. If you provide constructive feedback and suggest ways of improving it then there is nothing really to feel guilty about. You should feel that you have provided help. \n\nJust avoid comments such as \"the paper does not meet the quality standards of this journal\" or similar :) That would be perceived as mean especially coming from an anonymous reviewer.",
      "author": "drsolarcat",
      "created": 1594481342,
      "upvotes": 28,
      "replies": {}
    },
    "fxorucf": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxorucf/",
      "text": "In the long run, detailed constructive reviews are very helpful especially as a graduate student. Detailed reviewer comments are possibly the only real outside source to learn from. What’s not helpful is comments like “this is not interesting” or condescending remarks with no real information.",
      "author": "geometer2015",
      "created": 1594481671,
      "upvotes": 23,
      "replies": {}
    },
    "fxozazx": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxozazx/",
      "text": "Yes, I feel a lot of reviewer's (and editor's) guilt when I am critical of a work that was clearly done with passion, but that it is not (hopefully yet) up to par.\n\nJust yesterday I had to make a recommendation for a large national grant, the ones that are pretty much a requirement for young academics. The project wasn't good so I gave it a mediocre, but not horrible, score. I knew that means the researcher won't get the grant, I know it was the right thing to do, but I regret it all the same. That is just empathy I guess, and it is a good thing to have. I have received many reviews without an iota of empathy, being quite mean, condescending, or simply aggressive. People who forget there is a person on the other side. I rather feel guilt but be reassured I'm doing what's right.",
      "author": "SMFet",
      "created": 1594483419,
      "upvotes": 21,
      "replies": {}
    },
    "fxpm4nn": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpm4nn/",
      "text": "My favorite review I got as a grad student: \"this result is almost certainly false, but if it is valid, I already published it 30 years ago\" yours was certainly more useful than that.",
      "author": "blakehannaford",
      "created": 1594489414,
      "upvotes": 13,
      "replies": {}
    },
    "fxoqftt": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxoqftt/",
      "text": "Maybe inspect your review for tone and see if you really are being “mean,” or just responding to a lot of things that need work. There are constructive ways to say pretty much everything, and knowing how to frame things is important. If you think that article is written by a grad student, well, would you say those same things in a meeting with your own student? \n\nIt’s not that you have to be nice exactly, but people are more likely to take constructive feedback. if you truly want to help them make the manuscript better, being constructive is more likely to do that. The anonymity of the peer review process turns some people into total assholes, saying things they’d never say to a colleague. You can get away with it, of course, but there’s a higher road than taking out personal frustrations via peer review.",
      "author": "arrrrr_won",
      "created": 1594481320,
      "upvotes": 11,
      "replies": {}
    },
    "fxop82v": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxop82v/",
      "text": "I often feel guilt for not understanding a paper well enough or not having spent enough time on a paper to give it a very helpful review. Most of the time I still recommend acceptance or if not, then I give the authors the opportunity to resubmit their work.\n\nThis probably does not apply to you, but perhaps it can help. I have a mental health condition (OCD) that makes me prone to guilt. I sometimes tell myself this and remind myself that the guilt is not real. Of course, it is not possible to be 100% certain if guilt is warranted or not. The idea is to accept that uncertainty and do/think about something else in the present moment",
      "author": "perhapsaturningpoint",
      "created": 1594480911,
      "upvotes": 9,
      "replies": {
        "fxqyusk": {
          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqyusk/",
          "text": "Just wondering, how long have you been reviewing papers? I’m a bit over a year out of my PhD and I’ve formally reviewed two papers and both I recommended acceptance with minor revisions. The first one I understood very well and I was surprised that I was able to give it a review on par with other reviewers. The second one, coincidentally by the same lab, I felt like I didn’t spend enough time trying to understand some of their more technical points and I feel guilty for not getting what they were saying right away and guilty for not being more critical on those points. In some areas the best I could do was ask the author to clarify their points, and that’s a normal thing for reviewers to say, but I still felt guilty saying it.",
          "author": "Wyrdletini",
          "created": 1594500929,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fxpjfpz": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpjfpz/",
      "text": "If you have valid reasons for why you rejected a paper, then I don't see the problem. If you give genuinely useful feedback, then you're using your time in a way that's productive for the writer. \n\nHowever, I can tell you I've had stuff rejected for absolutely absurd reasons. Like, REALLY absurd. \"this isn't intersectional enough\". \"You don't have any trans participants\" \"you didn't put a trigger warning\". If you're making those kind of decisions, then yeah, I can see why you feel guilt.",
      "author": "yourmomdotbiz",
      "created": 1594488770,
      "upvotes": 6,
      "replies": {
        "fxpn7n8": {
          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpn7n8/",
          "text": "What field are you in? I am upset that this sort of comment would fly as an acceptable reason to reject a paper, even in a social science / gender studies? (I'm assuming) situation. I'm in natural sciences though so I really don't know. I hope you are exaggerating?",
          "author": "rosemary515",
          "created": 1594489667,
          "upvotes": 9,
          "replies": {
            "fxpx8wz": {
              "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpx8wz/",
              "text": "[deleted]",
              "author": null,
              "created": 1594491932,
              "upvotes": 3,
              "replies": {
                "fxqbzfw": {
                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqbzfw/",
                  "text": "Honestly, I guess I'm not too surprised (given that I also read about Sokal 2) but this reality is just so depressing to me. I'm sorry that you have to deal with that level of bs. I imagine it is so demotivating for people in the field who actually want to do solid work and make advances - shouldn't science be questioning preconceived ideas and paradigms instead of being forced to fall in line with them? Ugh. /rant\n\nAnyways, thanks for the response.",
                  "author": "rosemary515",
                  "created": 1594495426,
                  "upvotes": 5,
                  "replies": {
                    "fxqcog0": {
                      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqcog0/",
                      "text": "> shouldn't science be questioning preconceived ideas and paradigms instead of being forced to fall in line with them? Ugh. /rant\n\nI couldn't agree with you more! I appreciate the commentary, it is reassuring.",
                      "author": "yourmomdotbiz",
                      "created": 1594495552,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fxpzv08": {
              "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpzv08/",
              "text": "No exaggeration here. I see this stuff in management when I do submit articles. Not as much now as earlier in my career, but often enough. Lots of formerly abused children in the academy, I suppose.",
              "author": "sigholmes",
              "created": 1594492507,
              "upvotes": 1,
              "replies": {
                "fxq256l": {
                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxq256l/",
                  "text": " Lots of formerly abused children in the academy, I suppose. \n\nWow, never thought of it this way, but it's so true. Like it's despicable that this industry is completely unregulated and there's no ethical standard for this kind of behavior.",
                  "author": "yourmomdotbiz",
                  "created": 1594493114,
                  "upvotes": 2,
                  "replies": {
                    "fxq5d38": {
                      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxq5d38/",
                      "text": "I seldom outright reject a paper. It’s usually revise & resubmit, with detailed commentary and reasons for why. I’ve been reviewing for > 25 years, and I can count on one hand the number of rejections I’ve handed out.\n\nWhen I do reject something it’s because of:\n• theory problems;\n• methods/quantitative problems;\n• failure to correct above in resubmit.",
                      "author": "sigholmes",
                      "created": 1594493937,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fxqo3qg": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqo3qg/",
      "text": "I once reviewed the worst paper. Not terribly written, but what they were doing was so astonishingly ridiculous and amateurish for the field that it could have passed as a joke in any class. \n\nIt would be like a chemist putting food coloring into water in their own kitchen and then claiming to have created \"green water\" and thus the water was more environmentally friendly because it was green. \n\nAt first I was confused, but it was a serious thing so I wrote a review explaining the problems nicely and then a much harsher \"absolutely not\" note to the editor. It never got published, at least in that journal. \n\nBut I was very sad when I looked up the author and found they were in a legit graduate program (not prestigious, but something where you'd expect training and guidance) and somehow their advisor (who was also an author) had greenlit this project and apparently encouraged it as a thesis. I felt very bad for that poor student.",
      "author": "logouteventually",
      "created": 1594498401,
      "upvotes": 7,
      "replies": {}
    },
    "fxpfy80": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpfy80/",
      "text": "I hate it. I want to be the generous, helpful reviewer that I rarely get on my own submissions. And then I read the paper, and probably three out of four times, I have to argue for either substantial changes or outright rejection. I always do a lot of \"[are we the baddies?](https://www.youtube.com/watch?v=hn1VxaMEjRU)\" soul-searching after this. And I try to write very helpful feedback, which shows that I took their work _very_ seriously. But I know what it feels like to be on the other end of that. It's still rough. But necessary.",
      "author": "restricteddata",
      "created": 1594487987,
      "upvotes": 7,
      "replies": {}
    },
    "fxrhrqw": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxrhrqw/",
      "text": "I don't feel too guilty, but I'm also not a total dick when I review (I don't mean to imply you are, or others who feel guilty are - Just that I know I was being constructive, and careful in my wording, so there's no reason, personally, for me to feel guilty).\n\nI think as long as you are constructive, kind, patient, and thorough, that's all that matters. Offer helpful suggestions; ask for clarification; raise concerns, and don't be overconfident (!) that your criticisms are correct \\[seriously, how many times I've seen reviewers cite some 'major problem' that is 100%, factually incorrect; yet they treat it as though it's 100% a correct criticism, and use it to beat the paper down\\].\n\nI also tend to couch my criticism in a 'niceties' sandwich.\n\nStart by reiterating the purpose of the paper; mention positive thoughts you had going into it. Bring up major concerns first (appropriately calibrated to your confidence in those concerns). Bring up minor concerns second. Editorial notes third (misspellings, flow problems, reorganization tips). Then end with what you think was good about the paper; these can still be couched as 'critical', in the sense of \"I really enjoyed sections X, Y, and Z; I think section A would be improved if it came after section X.\" Make it clear that you hope the review can help improve the paper and future projects; and that the review isn't inherently meant to be pissy. I sometimes even say \"I apologize if my terse review reads as harsher than intended; I enjoyed many aspects of this paper, and feel it could be improved by my comments above.\" \\[literally, because sometimes I have terse sentences that indeed could be read by someone as aggressive\\].\n\nI review others' papers as I wish they'd review mine. I'm thorough, careful, and helpful; I try to be nice, because there's no need to be cruel in a review, despite what some asses think. As long as I do that, I feel confident in whatever recommendation I give, and I don't feel guilty for it.",
      "author": "StephenSRMMartin",
      "created": 1594505910,
      "upvotes": 6,
      "replies": {}
    },
    "fxopo6i": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxopo6i/",
      "text": "The way I see it, you're providing a great service to others and society by doing your work this way.",
      "author": "Tryrshaugh",
      "created": 1594481076,
      "upvotes": 6,
      "replies": {}
    },
    "fxp55pw": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxp55pw/",
      "text": "I do tend to share the feeling of disappointment that I think authors have when I give a negative review, especially if they have submitted something that would be novel or otherwise interesting.\n\nIn these cases, it's usually that the authors aren't able to truly and strongly support their findings due to some methodological or statistical shortcoming. Nonetheless, these papers are otherwise strong in their conception or hypotheses.\n\nThis would probably describe an easy majority of papers I review. Ever once and a while I will come across a paper that overwhelming does not meet the mark, but that's pretty rare.",
      "author": "some_ether",
      "created": 1594485029,
      "upvotes": 3,
      "replies": {}
    },
    "fxpwx6p": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpwx6p/",
      "text": "Absolutely, yes. It's what prompts me to write careful, hopefully constructive, thoughtfully phrased feedback in exactly the way you describe.\n\nHaving had a fair bit both published and rejected, I'm of the view that what you're describing is simply the appropriate moral baseline.",
      "author": null,
      "created": 1594491833,
      "upvotes": 3,
      "replies": {}
    },
    "fxowssw": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxowssw/",
      "text": "I’m surprised more people don’t feel this way. I do, even though I know being critical where necessary is the right thing to do.",
      "author": "northamrec",
      "created": 1594482873,
      "upvotes": 3,
      "replies": {}
    },
    "fxp9rk0": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxp9rk0/",
      "text": "Yes. Especially with reviewing proposals for funding that you know could really establish someone’s career. \n\nI have been guided that you saying no to one person allows a yes to someone else. It’s not fair to either to feel bound to rate something positively just because you happened to invest time (and, often, emotional energy) into reading and thinking about it.",
      "author": "BananasonThebrain",
      "created": 1594486368,
      "upvotes": 3,
      "replies": {}
    },
    "fxph8ei": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxph8ei/",
      "text": "I don’t ever feel guilty, but I do occasionally feel sad when it is apparent that someone had a good idea and worked hard, but really missed the mark for some reason.  The job of a reviewer is to support the editor in making an appropriate decision, not manage the feelings of the authors.  A really good review can give the authors valuable feedback that will enable them to not only improve the paper, but become better scientists and writers.  Either way, how they feel about it is their business.  It should not factor into your thinking when writing your review, beyond perhaps tempering your language to make it easier for them to understand and appreciate your feedback, but that is more about compassion and effective communication.",
      "author": "bigrottentuna",
      "created": 1594488273,
      "upvotes": 3,
      "replies": {}
    },
    "fxqv3hv": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqv3hv/",
      "text": "Maybe, you were being mean?",
      "author": "TheDevilsYouDont",
      "created": 1594500028,
      "upvotes": 3,
      "replies": {}
    },
    "fxq84lt": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxq84lt/",
      "text": "My experience as a writer and reviewer is that most papers end up accepted eventually. Failure of a paper to be published in a given submission cycle is typically due to a mismatch between journal and manuscript, and the manuscript will be okay, often with minimal revision, once it finds the right journal. Very few papers (<10%) are so bad that they require substantial overhauls. Those really bad papers are bad for only a handful of reasons. The biggest reason is insufficient communication and feedback between the authors; either the trainee is not taking feedback from their PI, or their PI is not providing sufficient guidance. A rejected manuscript can be a way to shock the system, so to speak, and get the PI and trainee communicating in order to fix problems in how the authors go from data to results to inferences, or bringing on additional experts to address gaps in technical expertise. \n\nThat's not to say there aren't malicious or frivolous rejections (there are and I've seen some first-hand) but if you're trying to be constructive but still identifying critical problems with a manuscript, the chances are this will ultimately help everyone involved, including the trainee.",
      "author": "tchomptchomp",
      "created": 1594494593,
      "upvotes": 2,
      "replies": {}
    },
    "fxqyszd": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqyszd/",
      "text": "Just had a paper rejected for lame reasons. Was it you???\n\nActually submitted and accepted to another journal, so no hard feelings",
      "author": "AnswerMyQuestionssss",
      "created": 1594500915,
      "upvotes": 2,
      "replies": {}
    },
    "fxsdatl": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxsdatl/",
      "text": "I'm about to probably do this right now. I rejected the paper once but said they could resubmit. I seriously doubt they have made the changes they needed, so now I'm procrastinating reading it so I don't have to reject it for awhile.",
      "author": "fleeingslowly",
      "created": 1594521123,
      "upvotes": 2,
      "replies": {}
    },
    "fxt74sn": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxt74sn/",
      "text": "Disclaimer: I'm still a master's student. I've only reviewed at most 6-7 manuscripts until now (I don't really remember exactly).\n\nI've never felt reviewer's guilt until now. Then again, I rarely - if ever - give critical feedback. \"Critical\" in the sense of being harsh/sharp with your words, not pointing out flaws. I always find flaws in work, starting from poor writing/grammar to flaws in methodology to hastily conducted literature surveys. In fact, I've been told more than once that it's \"not etiquette to give too much negative feedback.\" I still don't know wth this means, but my advisor seems to have no problem when I decide to give an \"Accept\" to authors, but always throws a _load_ of questions when the decision is \"Reject.\" Maybe I'm being naive and am still inexperienced but this was always counterintuitive to me. But I digress.\n\nThat being said, many of the manuscripts that I review actually make me very frustrated. It's obvious that even the authors know that their writing is (excuse my language) utter crap and they just wanted to submit it to receive feedback.",
      "author": "Seankala",
      "created": 1594540746,
      "upvotes": 2,
      "replies": {}
    },
    "fxp02b2": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxp02b2/",
      "text": "I feel a little bad. And, I have never recommended to reject a paper outright. Instead I opt to choose the reject and resubmit option. The editor has to make the decision whether or not it can be resubmitted. With that said, I have not reviewed a paper that I thought was fundamentally unsound. I don't feel bad, because I think of my first manuscript which was a hot mess. My PI probably should not have let me submit it. But, I think he was fed up with me not making progress so we just sent it in. Fortunately the reviewers gave constructive feedback and I end up resubmitting laterally and getting the paper accepted. The review process made my paper way better than it was.",
      "author": "Pop_pop_pop",
      "created": 1594483639,
      "upvotes": 3,
      "replies": {}
    },
    "fxq5594": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxq5594/",
      "text": "The vast majority of papers I review I recommend for rejection. At this point, I have gotten over the guilt.",
      "author": "nc_bound",
      "created": 1594493863,
      "upvotes": 1,
      "replies": {
        "fxqhi70": {
          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqhi70/",
          "text": "This is surprising to me...what is the usual reason for rejection?",
          "author": "spinningspinning",
          "created": 1594496924,
          "upvotes": 1,
          "replies": {
            "fxs5w39": {
              "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxs5w39/",
              "text": "Problems with theory, research design, analyses, conclusions, lack of meaningful contribution. And most of these journals are only mid tier.",
              "author": "nc_bound",
              "created": 1594517419,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fxrrdja": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxrrdja/",
      "text": "[deleted]",
      "author": null,
      "created": 1594509277,
      "upvotes": 1,
      "replies": {}
    },
    "fxs97k1": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxs97k1/",
      "text": "Did the editor ask for your suggestion to publish? My experience has been that I offer my assessment of the strength of the evidence and claims in the paper. It’s up to the editor to decide to accept or reject. I never felt any pressure to say whether I thought the claims were strong or not.",
      "author": "easy_peazy",
      "created": 1594519134,
      "upvotes": 1,
      "replies": {}
    },
    "fxtgdc9": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxtgdc9/",
      "text": "Imagine how much worse you could hurt literally everyone else by allowing low quality papers to get published",
      "author": "Me_ADC_Me_SMASH",
      "created": 1594550303,
      "upvotes": 1,
      "replies": {}
    },
    "fxud3cz": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxud3cz/",
      "text": "I have never felt guilt over giving a harsh review.  It is our responsibility as reviewers to hold authors accountable and ensure that their work is up to the standard of the scientific community.  As long as you are fair and aren't attacking them needlessly, I don't think there's anything to feel guilty about.",
      "author": null,
      "created": 1594572637,
      "upvotes": 1,
      "replies": {}
    },
    "fxvz5a9": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxvz5a9/",
      "text": "No your job is not to get people published.",
      "author": "IIIIllllllIIIll",
      "created": 1594604889,
      "upvotes": 1,
      "replies": {}
    },
    "fxom9bw": {
      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxom9bw/",
      "text": "[deleted]",
      "author": null,
      "created": 1594479999,
      "upvotes": -25,
      "replies": {
        "fxono4s": {
          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxono4s/",
          "text": "I...don't like this attitude.",
          "author": "pastaandpizza",
          "created": 1594480427,
          "upvotes": 21,
          "replies": {
            "fxor4mt": {
              "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxor4mt/",
              "text": "[deleted]",
              "author": null,
              "created": 1594481453,
              "upvotes": -4,
              "replies": {
                "fxp34xz": {
                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxp34xz/",
                  "text": "Lol what even is this attitude?  You're saying that the authors of a paper that is rejected willing wrote the paper intentionally to give you a bad experience and waste your time? But you would never do that, of course, only others...How about the authors put their own best foot forward, just like you do, and reviewers provide constructive feedback based on an outside perspective for what is best for the material, even if it means rejection, and no one has wasted their time?",
                  "author": "pastaandpizza",
                  "created": 1594484455,
                  "upvotes": 5,
                  "replies": {
                    "fxpcp9l": {
                      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpcp9l/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1594487048,
                      "upvotes": -2,
                      "replies": {
                        "fxqlp70": {
                          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxqlp70/",
                          "text": "Ok, if we ignore that you did strongly imply authors were intentionally wasting your time, fine, but this still doesn't hold up. When you wrote shit papers, it was *not* at waste of time for the reviewers that rejected them - it helped you and their own field by offering critiques. To complain now about people waisting *your* time? I...still don't like this attitude.",
                          "author": "pastaandpizza",
                          "created": 1594497881,
                          "upvotes": 1,
                          "replies": {
                            "fxs0hvd": {
                              "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxs0hvd/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1594514676,
                              "upvotes": 1,
                              "replies": {
                                "fxs792t": {
                                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxs792t/",
                                  "text": "> The way see it is that they're asking me (and potential other readers) for something very valuable, my time. So they better present something good.\n\nSo it sounded like you meant a particular reason is because they wasted your time. And when I said I didn't like that attitude you asked me why, was it because I valued my time differently...which seemed to affirmed that. I doubt anyone here would argue shitty papers should get published so I don't think that's where this conversation went awry 🤷‍♂️",
                                  "author": "pastaandpizza",
                                  "created": 1594518196,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fxp3kby": {
                  "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxp3kby/",
                  "text": "No one writes a paper with the intent of it being shit or a bad experience for the reviewers. You need to chill and stop taking yourself so seriously.",
                  "author": "zsantana459",
                  "created": 1594484597,
                  "upvotes": 4,
                  "replies": {
                    "fxpcwcd": {
                      "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpcwcd/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1594487124,
                      "upvotes": -2,
                      "replies": {
                        "fxpi7db": {
                          "link": "/r/AskAcademia/comments/hpawhd/do_you_ever_feel_reviewers_guilt/fxpi7db/",
                          "text": "Eh, sounds to me like you clearly implied this. Or you think people who have writing skills below those of your supreme capabilities just shouldn't submit for publication. Either way, your attitude is shit.",
                          "author": "zsantana459",
                          "created": 1594488545,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}