{
  "sid": "os7o0l",
  "link": "/r/AskAcademia/comments/os7o0l/should_i_give_up_on_my_masters_thesis_topic/",
  "title:": "Should I give up on my masters thesis topic?",
  "text": "I have started my CS-y master thesis more than a year ago which is not a big deal I am usually slow so it was expected, I did work a lot on it though. \n\nThe point is there were times where I felt the topic was a dead end in the sense that in some ways it’s above my skill level and I sometimes just had an experiment that wasn’t working at all and I haven’t progressed for weeks not really knowing what to do. I have hit a similar roadblock now where one of my experiment results is complete nonsense and I probably just messed something up somewhere. But I don’t know what and where and like the roadblocks before I don’t know if I will really ever resolve this and if so in how much time. I only have six month before a hard deadline where if I don’t graduate I will be expelled. Is it time to switch my topic to something straightforward?\nI don’t get how people write theses.",
  "author": "drugkompotik",
  "created": 1627332313,
  "updated": 1634082424,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "h6mrn5f": {
      "link": "/r/AskAcademia/comments/os7o0l/should_i_give_up_on_my_masters_thesis_topic/h6mrn5f/",
      "text": "Did you try to get in touch with your professor? Use all ressources that you might have access to. Fellow students, members of the working group, PhD students.. and ask for their opinion. \nThere is ALWAYS a chance to make a thesis out of nothing. The most important part is that you worked scientifically correct. Your project must:\n\n-follow the guidelines according to your department / profession (like: introduction / materials and methods/ results/ discussion). Create a meaningful table of contents and follow the headline you give each. Male sure that you keep the right content in the right section.\n\n-be repeatable. It must be explained as much as needed to repeat your experiments and (!) To obtain the same results by someone who is not an expert in that topic. Even when you just have negative / no results, you can always discuss them. You can also discuss some mistakes you recognized in retro perspective and give suggestions how to do it better for further research\n\n-you must keep the promises you made in the introduction. Talk/ discuss all the topics you stated in the introduction\n\n-create a nice story. \"Support\" the reader. A well written thesis with less results might score higher than a thesis full of results without any connection. You tell a story, so make it sound interesting and exciting! Be a narrator. Connect everything and explain everything. \n\n-each section must be understable without reading the other ones. \n\nI was in a similar situation as you. My supervisors let me down, I ended up with 23 pages written with two months due to Submission. And I had no fucking clue how to continue. My first attempt didn't work and I just sat there with a half project and hard to explain results. I decided to focus on making everying look nice, elaborate on everything and telling the story and everything went well in the end! \n\nI personally would highly recommend to keep your head up and finish your project. Don't run away. Teach yourself, read other good work, talk with colleagues, revise your own work.",
      "author": "Galawinn",
      "created": 1627333847,
      "upvotes": 6,
      "replies": {}
    }
  }
}