{
  "sid": "n0osu7",
  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/",
  "title:": "Addressing Professors",
  "text": "In Canada or US, does Professor John Smith mind being addressed as Hi John, in an email. How about in person? In what context is it (in)appropriate to use Hi Prof Smith vs Hi John? \nHow about pre-interview, during and after getting hired and working in the same lab?",
  "author": "ReddMedPhy",
  "created": 1619643928,
  "updated": 1634081397,
  "over_18": false,
  "upvotes": 128,
  "upvote_ratio": 0.97,
  "comments": {
    "gw7z5bw": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw7z5bw/",
      "text": "With the usual disclaimer that things can vary wildly by disciple and by university...\n\nA reasonably safe policy is to start formal at first-contact (\"Professor/Dr Smith\"), especially if it's by email, and then pay attention to how they sign off their email replies. If the reply is formal (\"Sincerely, Prof Smith\"), stay with that. If it's casual (\"Cheers, John\"), I take that as an invitation to respond that way.\n\nIn person, something similar usually works. Mirror whatever level of formality they use, and when it doubt err on the side of more formal and see how they respond.",
      "author": "listens_to_galaxies",
      "created": 1619645001,
      "upvotes": 174,
      "replies": {}
    },
    "gw8dqq6": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8dqq6/",
      "text": "Even as a full professor, I will use an honorific when emailing a professor I don't know for the first time, and I would be rather put off if someone I didn't know addressed me by my first name in an email.",
      "author": "mleok",
      "created": 1619651802,
      "upvotes": 118,
      "replies": {
        "gw8qixp": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8qixp/",
          "text": "Same here - especially if my correspondent appears to be appreciably older than me. In the same way I’d address someone as Mr/ Ms X at first, not hey guy/gal/person.",
          "author": "ccots",
          "created": 1619658015,
          "upvotes": 32,
          "replies": {}
        },
        "gw9af45": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9af45/",
          "text": "Medical doctor here, I do the same. I generally don’t mind people calling me by my first name at all but when they jump to it right away if feels presumptuous. This is more true for trainees than colleagues but it’s very similar.",
          "author": "DJ_MJD_MD",
          "created": 1619668154,
          "upvotes": 21,
          "replies": {
            "gwaga8r": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwaga8r/",
              "text": "I’m different lmao, also a MD, but I get putted o/ff by older docs who don’t know me calling me by my first name. (Maybe cause I’m a young doc).\n\nTrainees can call me Dr cunt for all I care, I’m pretty easy going and don’t really care.",
              "author": "quemacuenta",
              "created": 1619700442,
              "upvotes": 7,
              "replies": {
                "gwb1ryg": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwb1ryg/",
                  "text": "It makes me feel weird if trainees call me by my first name but makes me think they’re pretentious if they don’t haha\n\nFor nurses and support staff if I meet them once or twice it’s doctor, if more than that it’s first name. \n\nI have patients, especially older patients, who insist on calling me by my first name. Some seem to get off on it and that bothers me, but I always refer to myself as doctor with patients.",
                  "author": "DJ_MJD_MD",
                  "created": 1619710310,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gwc9ouj": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwc9ouj/",
              "text": "work in research at a medical school. I always refer to MDs as \"Dr. so and so\", but PhDs (including my boss) go by first name barring specific context. I'm 26 and not much younger than some of the fellows, for example though, and initially would refer to them as \"Dr. X\" but they've generally insisted on first names.",
              "author": "djsquilz",
              "created": 1619727475,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gwajlfi": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwajlfi/",
          "text": "My language has different words depending on who you speak to (hungarian) based on \"class\"/authority.\n\nI was taught to always default to highest address.\n\nBetter to be given permission than demand it!",
          "author": "Hoihe",
          "created": 1619702179,
          "upvotes": 3,
          "replies": {}
        },
        "gwakx26": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwakx26/",
          "text": "Exactly.\n\nIf you feel you can be more familiar, and there's less 'hierarchy' (e.g. between two staff members of the same institution who don't know each other), I feel there's nothing wrong with the following formula:\n\nDear prof. Smith,  \nDear John,\n\n*Wall of text...*",
          "author": "Gaendel",
          "created": 1619702847,
          "upvotes": 2,
          "replies": {}
        },
        "gwb0pp2": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwb0pp2/",
          "text": "[deleted]",
          "author": null,
          "created": 1619709862,
          "upvotes": -1,
          "replies": {
            "gwdawz8": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwdawz8/",
              "text": "I received my degrees, and teach at a \"top school\" in the US, and I find it ludicrous to be \"schooled\" about academic culture from a person who hasn't yet received their PhD.\n\nIt's not a question of whether I am secure in my accomplishments, it is simply a matter of etiquette and courtesy. The fact that you think this says a lot about me, and that you immediately assume that it is due to insecurity says a lot about your upbringing. \n\nI would never address anyone I don't know by their first name, that's just rude and presumptuous. As I said, I extend the same courtesy to professors I have not met in person, even those at earlier career stages, and at lower ranked institutions.",
              "author": "mleok",
              "created": 1619744368,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gw7yk7o": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw7yk7o/",
      "text": "It's Prof. or Dr. until they give you permission, either explicitly or implicitly. If they start signing emails \"-John\", then you're probably clear to use the first name. Until then, use the honorific.",
      "author": "downsideleft",
      "created": 1619644745,
      "upvotes": 350,
      "replies": {
        "gw93x93": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw93x93/",
          "text": "I appreciate that you used \"probably.\" My grad school advisor always signed emails with his first name, but he preferred to be Dr. Xxxx until internship (close to graduation). He hated awkward conversations, and yet...\n\nI'm just first name unless we're in front of patients.",
          "author": "thereticent",
          "created": 1619664531,
          "upvotes": 40,
          "replies": {
            "gw9uo99": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9uo99/",
              "text": "People like this infuriate me. Being both stuck up and going against a widely recognised norm causing people to 'offend' them---it's like they enjoy holding grudges against people.",
              "author": "simoncolumbus",
              "created": 1619683487,
              "upvotes": 4,
              "replies": {
                "gwaxvp9": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwaxvp9/",
                  "text": "That's interesting -- I never even considered that signing an e-mail would be a signal to call me by that, although it makes sense now that I see everyone say it. I think I've been too influenced by Japanese, which is what I teach. In Japanese you never use honorifics like \"Professor\" or \"Dr.\" to refer to yourself, except in specific situations (like on a business card). But this doesn't cause any confusion because you always refer to professors as \"X-sensei\"; even if they are your colleagues or juniors. Even if you just took one class with a professor, you would still call them \"X-sensei\" 5 years later.",
                  "author": "honkoku",
                  "created": 1619708681,
                  "upvotes": 4,
                  "replies": {
                    "gwdzskm": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwdzskm/",
                      "text": "Makes a lot of sense that the norms differ between cultures. Clearly, Japanese professors and students have a convention that works---it's, from what you describe, unambiguous how to address somebody. And that's fine. \n\nOf course there might be hiccups when switching languages, but I think most people are aware of that. (I'm sure you've encountered the situation where somebody goes in for a handshake, but a Japanese person bows for a greeting. It threw me off the first one or two times it happened, but I don't think anybody will be offended---both people recognise that they are simply used to different conventions.)",
                      "author": "simoncolumbus",
                      "created": 1619757076,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gw9c50p": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9c50p/",
          "text": "Just to add, if they sign an email with their full name i.e., John Smith, then it’s Dr./Prof. Smith",
          "author": "syr12",
          "created": 1619669193,
          "upvotes": 18,
          "replies": {
            "gwahp1j": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwahp1j/",
              "text": "Or if they don’t put a name at all, continue with the Dr/ Prof Smith.\n\nEdit to remove a r / link and to amend this is when they do or don’t have a signature text at the end of the thing.",
              "author": "elvenwanderer06",
              "created": 1619701194,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gw87jjb": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw87jjb/",
      "text": "Dear Dr/Prof Smith,\nBlah blah blah\nThanks,\nStudent\n\n\nDear student,\nBlah blah blah.\n-Joe\n—then you can respond “Hi Joe”",
      "author": "Cupcakequeen789",
      "created": 1619648829,
      "upvotes": 35,
      "replies": {
        "gw8aub7": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8aub7/",
          "text": "The first time I did this with any given professor, I’d write “Dear Joe (if I may), ...” to let them know I was following their lead and not assuming. That prompted them to tell me yes it’s fine and kept me showing respect the first time I used more casual address.",
          "author": "plumpolly",
          "created": 1619650402,
          "upvotes": -31,
          "replies": {
            "gw8bquf": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8bquf/",
              "text": "Oh no, I would let them sign the email how they want addressed. \nConsider how an underrepresented or assistant prof might feel if you act like you don’t think they deserve the respect of their title they earned because “you don’t want to be formal “.\nI would instantly not like you, especially if you acknowledge that you know I deserve a title and you don’t think you owe me that title..... \n\nafter I email back my name, I don’t expect anyone to call me dr.",
              "author": "Cupcakequeen789",
              "created": 1619650833,
              "upvotes": 39,
              "replies": {
                "gw8cnjh": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8cnjh/",
                  "text": "Maybe plumpolly means they signed it this way after receiving back the prof’s email: “best, Joe.” If that’s the case, that’s actually a good way to go about it and I think I’ll use that. Even after the prof signs back with their first name I sometimes feel awkward just assuming, so acknowledging the shift seems good. \n\nTangentially, I just hate it when a prof signs off with an initial. That happens oddly frequently and it’s so informal but doesn’t suggest how I should change my form of address.\n\nEdit: I’ve reread the comment a couple times and actually can’t decide how it was meant. For sure always address a professor as “Professor X” until that prof tells you otherwise.",
                  "author": "ConsciousReindeer265",
                  "created": 1619651272,
                  "upvotes": 11,
                  "replies": {
                    "gw8e78v": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8e78v/",
                      "text": "A professor who signs off with an initial isn't inviting you to address them in a less formal manner.",
                      "author": "mleok",
                      "created": 1619652025,
                      "upvotes": 7,
                      "replies": {
                        "gw8g0o2": {
                          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8g0o2/",
                          "text": "I would generally agree with this. If I get a “-j” I’m assuming they just responded quickly. \nI also feel like at the undergraduate level error on using prof and dr. You rarely can go wrong.... only can go wrong being too informal",
                          "author": "Cupcakequeen789",
                          "created": 1619652908,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gw8c0pk": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8c0pk/",
                  "text": "I always email my first name in my signature, I never sign with “Dr.” I actually never called most professors by their first name but in email I tended to be formal and check. Just bc I use my first name doesn’t mean I’ve given blanket permission.\n\nEdited to add- I agree with you, I would always go formal first. I just wouldn’t assume first name just bc they used it. I’d ask.",
                  "author": "plumpolly",
                  "created": 1619650965,
                  "upvotes": 15,
                  "replies": {
                    "gw8cx0h": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8cx0h/",
                      "text": "I think most people sign their names how they want to be addressed, and if they're not, then they're not following a standard convention and setting themselves up for needless miscommunications.",
                      "author": "Semantix",
                      "created": 1619651399,
                      "upvotes": 19,
                      "replies": {
                        "gw94tz8": {
                          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw94tz8/",
                          "text": "Yeah, this is the convention in the States. If you don't want to be addressed by the first name, you'd sign with a full name (instead of signing my name with \"Dr.\" or \"Mr./Ms.\" which does sound weird and pretentious). Of course, some exceptions exist because that's how conventions work (Most people follow, some don't).",
                          "author": "Kindly_Book5115",
                          "created": 1619665015,
                          "upvotes": 4,
                          "replies": {}
                        },
                        "gw8fsyw": {
                          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8fsyw/",
                          "text": "Agreed. Exception maybe deans and nobel laureates I’ve never met. or maybe a few other rare exceptions.",
                          "author": "Cupcakequeen789",
                          "created": 1619652802,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gw8e1uk": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8e1uk/",
              "text": "No, I don't think that's a good approach at all. It is disrespectful and presumptuous, and forces people to feel like a jerk if they feel the need to assert a more formal form of address. Put another way, if you addressed me in this way, and needed a favor from me, my knee-jerk would be to say no.",
              "author": "mleok",
              "created": 1619651953,
              "upvotes": 13,
              "replies": {
                "gw8ecw2": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8ecw2/",
                  "text": "I’m responding to the folks saying If profs signs w first name, they use it. I would never use first name only without asking permission, only title/last name.",
                  "author": "plumpolly",
                  "created": 1619652101,
                  "upvotes": 8,
                  "replies": {
                    "gw8en3l": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8en3l/",
                      "text": "Okay, but even then, you're better off waiting until a professor explicitly asks you to address them by their first name.",
                      "author": "mleok",
                      "created": 1619652238,
                      "upvotes": 5,
                      "replies": {
                        "gw8ffp1": {
                          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8ffp1/",
                          "text": "Agreed.",
                          "author": "plumpolly",
                          "created": 1619652622,
                          "upvotes": 5,
                          "replies": {}
                        },
                        "gw9mkmm": {
                          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9mkmm/",
                          "text": "No you aren't. Use the sign off. If someone uses a sign off that they're not comfortable being addressed with it's their own fault.",
                          "author": "blueb0g",
                          "created": 1619676611,
                          "upvotes": 3,
                          "replies": {
                            "gw9ow9a": {
                              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9ow9a/",
                              "text": "There is absolutely no downside to being more formal than necessary. And, there are definitely many senior faculty who will sign off with their first name, but which don't really expect to be addressed as such by their undergraduate students.\n\nMy PhD advisor who was in his 50s when I first met him as an undergraduate always signed off with his first name, and it took years before I became comfortable addressing him by his first name. During those years, he never asked me to address him by his first name, which I would expect him to if he truly preferred it.\n\nKeep in mind that sometimes the sign off is part of a person's email signature.",
                              "author": "mleok",
                              "created": 1619678451,
                              "upvotes": 2,
                              "replies": {
                                "gw9vxcp": {
                                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9vxcp/",
                                  "text": ">There is absolutely no downside to being more formal than necessary\n\nExcept for the fact that it isn't necessary and undermines the spirit of collegiality which separates university from school - the whole point of an undergraduate degree is to start getting the students to think like independent adults. The fact of the matter is that it is widely regarded as an invitation to use the first name if you sign off with it; conversely, an academic is unlikely to correct a student who keeps using the formal title, because it's a bit awkward to do so. The etiquette exists *exactly* to clear up that confusion and awkwardness, and cut out the worry about what titles to use. Formal first, then however they advertise themselves to you. Easy peasy.\n\n>Keep in mind that sometimes the sign off is part of a person's email signature.\n\nIs it? Normally the sign off is one element that's part of the actual email body, and then the signature gives the full title and academic rank, etc. If an email ends like this:\n\nBest wishes,\nJohn\n\nDr. John Smith\nSenior lecturer, UCL\n\nIt's pretty clear what's meant.",
                                  "author": "blueb0g",
                                  "created": 1619684667,
                                  "upvotes": 1,
                                  "replies": {
                                    "gwdcf6l": {
                                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwdcf6l/",
                                      "text": "I agree in principle that one ought not to sign off an email with a first name if one would get offended if the recipient addressed the reply using the first name, but in practice, there are people who will be offended by that.\n\nI do try to use my full name in responses when replying to undergraduates to communicate that I expect some measure of formality in their response. If you tend to sign off your emails with \"Best wishes, John\" then you can certainly include that in your email signature, and especially if you're responding on a mobile device, you might forget to change that default sign off to a more formal one.\n\nAs for the \"spirit of collegiality,\" my students are not my colleagues, and maybe when they graduate, they can address me more informally.",
                                      "author": "mleok",
                                      "created": 1619745098,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gw992w1": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw992w1/",
              "text": "Please don’t listen to his or her advice.",
              "author": "jasonmoyy",
              "created": 1619667375,
              "upvotes": 1,
              "replies": {}
            },
            "gwbjx79": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwbjx79/",
              "text": "No idea why you're being downvoted. When all you've done is agree with the consensus and add that you add an even more respectful response email. \n\nIt's worrying in an academic subreddit how many readers have failed basic comprehension.",
              "author": "Onyx_Rhino",
              "created": 1619717226,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gw8i0jl": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8i0jl/",
      "text": "If in doubt, err on the formal side.  No one ought to be offended if you're too formal.\n\n\"Professor\" is safer than \"Doctor\" (not all instructors have doctorates), but if you know someone is a doctor, use that title.",
      "author": "PhotoJim99",
      "created": 1619653871,
      "upvotes": 23,
      "replies": {
        "gwafbhc": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwafbhc/",
          "text": "I once had a Biology Professor correct a student in class who called him \"Doctor\" say \"Im not just a Doctor, I'm a Professor. Professors give people Doctorates.\"",
          "author": "DJGCrusader",
          "created": 1619699908,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gw8jfvt": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8jfvt/",
      "text": "Please stick with the formal until they give you permission to use their first name. I’ve had students try & call me by my 1st name and it’s super weird. Then I feel like a bitch when I correct them.",
      "author": "West-Veterinarian-53",
      "created": 1619654561,
      "upvotes": 20,
      "replies": {}
    },
    "gw8ggwm": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8ggwm/",
      "text": "There is often an issue for female professors where students call male professors Dr. but call females Mrs. Students often feel more comfortable being informal with women because of ideas of nurturing etc. So a lot of female professors insist on the honorific to maintain their equality with colleagues. I explain this to my students at the beginning of each semester.",
      "author": "crimbuscarol",
      "created": 1619653127,
      "upvotes": 89,
      "replies": {
        "gw90nfw": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw90nfw/",
          "text": "Gender definitely makes a difference. I stopped introducing myself by my first name to my classes, and instead start with Dr./Prof. As a ‘youngish’ female professor it created too much casualness that I thought sometimes led to a lack of respect from some students. If a student gets to know me better through advising, research, or office hours then eventually I might invite them to use or sign off with my first name.",
          "author": "Sparrow_theBird",
          "created": 1619662848,
          "upvotes": 25,
          "replies": {}
        },
        "gwaoxch": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwaoxch/",
          "text": "This is why I stick to the formal titles. It's not personally important to me that someone address me as Professor/Dr., but I keep up the practice anyway and ask that my students do the same. I understand that those titles can be deeply important for some, particularly those who may not fit the \"bearded old white guy and/or 30-something brofessor\" archetype, and are constantly having to deal with the assumption that they don't have advanced degrees, etc. It's my attempt at some degree of solidarity.",
          "author": "yomish",
          "created": 1619704755,
          "upvotes": 5,
          "replies": {
            "gwbj3hy": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwbj3hy/",
              "text": "This is the proper response to someone telling you about inequity, in my opinion. Instead of saying, as another poster did, “this can’t be true, I’ve never seen it. Provide me research that I will quickly dismiss as lacking rigor.” It is so important to believe traditionally marginalized groups when they speak up about the things that cause them discomfort.",
              "author": "crimbuscarol",
              "created": 1619716926,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gw9mnx1": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9mnx1/",
          "text": "I've heard about this and trust it actually happens a lot, but it's puzzling to me as I would never fathom doing that even when I was a student (I think I just called all my professors as professor/prof, even if they were a lecturer without a doctorate). It leaves me wondering who these people doing this are.",
          "author": "bennyandthef16s",
          "created": 1619676682,
          "upvotes": 3,
          "replies": {}
        },
        "gw8mefe": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8mefe/",
          "text": "Is there a citation for that? I have never heard of that being a thing.\n\nI get called my first name all the time by loads of people, even Mr quite often. Being called Dr for me is so foreign that I get caught out if people say it haha",
          "author": "PersonalZebra8993",
          "created": 1619656002,
          "upvotes": -32,
          "replies": {
            "gw8n5od": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8n5od/",
              "text": "Yes social scientists have done research on the gendered expectations of students. They have also proven that women are asked to do service more often, have student reviews mention their physical appearance more often, etc. I’m sure if you asked your female colleagues about this, they would have stories.",
              "author": "crimbuscarol",
              "created": 1619656370,
              "upvotes": 43,
              "replies": {
                "gw8v8di": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8v8di/",
                  "text": "It's hilarious that I have 6 downvotes for asking a question lmao. Just shows that those people don't actually have an answer, but like to believe things with no research on the matter.\n\nThank you for replying in a nice way and actually givng an answer. I will look it up and research it.",
                  "author": "PersonalZebra8993",
                  "created": 1619660261,
                  "upvotes": -26,
                  "replies": {
                    "gw90mun": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw90mun/",
                      "text": "That’s an odd assumption. Perhaps they’re just from people who know this basic fact who are tired of having to present research studies when stating something that can be checked with a simple google search. Perhaps you should interrogate why you felt the need to publicly challenge the claim instead of checking it yourself?",
                      "author": "girl_engineer",
                      "created": 1619662840,
                      "upvotes": 36,
                      "replies": {
                        "gw9jtvr": {
                          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9jtvr/",
                          "text": "Weird, still no citation. I found a couple of studies but none are really robust. Think about it this way, if I had the exact opposite happens, but provided no research, my opinion would be just as valid as the opposite.\n\nPeople downvote and don't provide citations because they can't back up claims. It's simple as that.",
                          "author": "PersonalZebra8993",
                          "created": 1619674506,
                          "upvotes": -13,
                          "replies": {
                            "gw9qdjd": {
                              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9qdjd/",
                              "text": "[https://www.nature.com/articles/s41564-018-0320-6](https://www.nature.com/articles/s41564-018-0320-6)",
                              "author": "mleok",
                              "created": 1619679665,
                              "upvotes": 8,
                              "replies": {}
                            },
                            "gw9zsd0": {
                              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9zsd0/",
                              "text": "I will never understand what a downvote means in this sub. It is different from most others, that's for sure.\n\nI got curious and found these ones. I don't know if you would label them robust, but at least they go beyond anecdotal experiences and perceptions.\n\n[https://www.pnas.org/content/115/28/7278.short](https://www.pnas.org/content/115/28/7278.short)\n\n>Men and women were, on average across studies, more than twice as likely  to describe a male (vs. female) professional by surname in domains,  such as science, literature, and politics.\n\n[https://psycnet.apa.org/record/1982-10726-001](https://psycnet.apa.org/record/1982-10726-001)\n\n>Few contextual differences were found; however, female professors, especially those in the 26–33 age group, were addressed by first names more often than their male colleagues.",
                              "author": "molobodd",
                              "created": 1619688337,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gw99ie5": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw99ie5/",
              "text": "I didn’t downvote you. But, I do think your should Google it. I think there are a lot of research supporting that.",
              "author": "jasonmoyy",
              "created": 1619667625,
              "upvotes": 11,
              "replies": {
                "gw9jwnm": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9jwnm/",
                  "text": "I looked, nothing robust. Since no one can provide any research, it guess it's just false.",
                  "author": "PersonalZebra8993",
                  "created": 1619674562,
                  "upvotes": -3,
                  "replies": {
                    "gwabpnw": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwabpnw/",
                      "text": "Here you go. Here’s one. Since you are so expert at researching I’m sure you can find a copy of the whole article https://www.sciencedirect.com/science/article/abs/pii/S1096751608000237",
                      "author": "CardboardChewingGum",
                      "created": 1619697762,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "gw9xtz1": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9xtz1/",
                      "text": "I have more emails than I care to remember addressed to Dr MaleColleague and Mrs MyName. Over and over again. Even after one of us corrects them",
                      "author": "drvictoriosa",
                      "created": 1619686470,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gw8dbi2": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8dbi2/",
      "text": "Just call them Prof Smith to be safe, some people might be offended if they are not addressed properly. If they explicitly tell you to call them by their first name then you can do that, otherwise just stick to Prof.",
      "author": "SubcooledBoiling",
      "created": 1619651596,
      "upvotes": 10,
      "replies": {}
    },
    "gw8hunn": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8hunn/",
      "text": "To add to what others have said, even when you do have permission to call someone by their first name, context still matters. I've had thanksgiving dinner and babysat for one of my profs, and they're not much older than me, so I'm on first name basis. But only among us, or when its some other close grad students. If I meet him in a class, am referring to him in conversation with an undergrad, or some situation like that, I revert back to Professor as an address. \n\nFWIW, if you're ever uncertain, default to using a title and let them correct you. Only an insane person would get offended at being called by their formal title. But being offended over casual use is much more understandable.",
      "author": "boringhistoryfan",
      "created": 1619653794,
      "upvotes": 10,
      "replies": {}
    },
    "gw8jgct": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8jgct/",
      "text": "Canadian here - I address all faculty by “Dr.” until I get to know them well. Usually it takes a few longish conversations until I become comfortable around them. This strategy hasn’t insulted anyone afaik yet.",
      "author": "WhoCaresWhyBother",
      "created": 1619654567,
      "upvotes": 8,
      "replies": {}
    },
    "gw7yhbg": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw7yhbg/",
      "text": "Academic etiquette exists for a reason. You don't call someone by their first name, unless you know them personally (or unless that person lets you know that they prefer to be addressed by their first name). In all other cases, you address a person officially - with their title and last name. Even when you know someone, you still address them officially in front of their or your students (unless those are the students in that professor's lab, but that depends on the individual lab's habits/traditions).",
      "author": "k8ua",
      "created": 1619644710,
      "upvotes": 84,
      "replies": {
        "gw8ck0d": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8ck0d/",
          "text": "And what is that reason?",
          "author": "im_a_determinist",
          "created": 1619651224,
          "upvotes": -29,
          "replies": {
            "gw8d1cm": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8d1cm/",
              "text": "To show respect to your senior colleagues (at the very least). Then, there are also some traditions. It's like in martial arts - you won't address your Sensei by saying \"hey man!\".",
              "author": "k8ua",
              "created": 1619651459,
              "upvotes": 48,
              "replies": {
                "gw8jykj": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8jykj/",
                  "text": "I think this varies by country. I haven't seen it during my Postdoc at R1 US college but admittedly not had much interaction during COVID.\n\nI've also never seen it in the UK at mid-table and top 5 uni, Oxbridge and private laboratories/institutes (other than undergrads addressing academics for the first time). \n\nPeople who I've seen it from were researchers and grad students from India who were obsequiously deferential until the staff they were addressing assured them it's fine to just be casual. Chatting with Indian labmates it seems like it can be a big issue with PIs and teaching professors (more so male) and their insistence on title/Sir being used.",
                  "author": "mafiafish",
                  "created": 1619654812,
                  "upvotes": 11,
                  "replies": {
                    "gw8u14t": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8u14t/",
                      "text": "It does differ - when I worked in Switzerland (and in general in Europe), it is more common to address your PI by the first name. But again - there are plenty of examples like this in the US as well. For example, everybody in my lab addresses me by my first name - except when we're in a formal class setting. However, if a student does not work with me - they will have to use my title and last name. Same when I talk with my colleagues - it's just first names between us, but when we refer to each other in front of the students, we will use titles and last names.",
                      "author": "k8ua",
                      "created": 1619659696,
                      "upvotes": 8,
                      "replies": {}
                    },
                    "gw8lf06": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8lf06/",
                      "text": "Yeah same in Australia (in my discipline at least). But the OP did specify Canada/US.",
                      "author": "HappyAkratic",
                      "created": 1619655530,
                      "upvotes": 8,
                      "replies": {}
                    },
                    "gw9t9ma": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9t9ma/",
                      "text": "Definitely. I'm in the UK and every professor I had, even at undergrad, was fine with first names. Some explicitly stated this in their introductory lectures. \n\nThat said, I'd still start formal when reaching out to someone for the first time. Although I can not count the number of times I've sent a full formal email and received something almost comically informal back",
                      "author": "HalfFaust",
                      "created": 1619682194,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gw8k7mf": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8k7mf/",
              "text": "I don't know why this is getting downvoted, seemed like a reasonable question.",
              "author": "Mutant321",
              "created": 1619654935,
              "upvotes": 8,
              "replies": {}
            },
            "gw8fwse": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8fwse/",
              "text": "[removed]",
              "author": null,
              "created": 1619652855,
              "upvotes": -29,
              "replies": {
                "gw95bzy": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw95bzy/",
                  "text": "LOL So showing respect to one another is an ego trip. That sounds like a hell of an ego trip. I'm an American who grew up in East Asia (lived there for 16 years), and calling each other with honorifics to be polite isn't an ego trip. It's an ego trip only when one side is demanding to be respected while they don't respect the other. In the U.S., we use honorifics to one another in academia, and it's not that senior professors are demanding junior professors to use it but they don't call junior professors by honorifics just because they're younger. \n\nEvery country and inner culture has a different way and mannerism, so how about showing some respect?",
                  "author": "Kindly_Book5115",
                  "created": 1619665286,
                  "upvotes": 4,
                  "replies": {}
                },
                "gw8k7j0": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8k7j0/",
                  "text": "Really worried by how downvoted you are. Using titles in any facet of life is stupid and unnecessary.\n\nYeah, it's cool my ID says Dr, but what other reason do I need other people to call me as such than to massage my ego?",
                  "author": "mafiafish",
                  "created": 1619654933,
                  "upvotes": -1,
                  "replies": {
                    "gw8lb6h": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8lb6h/",
                      "text": "It's not about the Dr or the Prof itself, it's about what is the official way of addressing someone, if your name is Michael, you probably won't like it if a total stranger was like \"Hey mike!\".\n\n\nIt's just rude and unpleasant, if you don't mind it, others might, and it's just so unprofessional to do something that might annoy your senior just because this is how YOU like things to be.\n\n\nNow who is the one with the ego, the one that simply wants to be addressed in a formal way, or the one that wants to project their character on everyone else?.",
                      "author": "Round-Defiant",
                      "created": 1619655478,
                      "upvotes": 13,
                      "replies": {
                        "gw8nup5": {
                          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8nup5/",
                          "text": "I've never worked or studied in a situation where staff would expect to be addressed with their title (other than a stint in the military), so there was never any inculcation of this being disrespectful. If an institute that pays my wages has an official code of communication I'd obviously defer to that, but otherwise there is no universal expectation, hence the OP's question. \n\nObviously, as has been said, there are variations between countries: I can only speak of my experience in the UK and USA.\n\n\nAs with many others here, I think it's low risk to use Dr / Prof on first contact (which is my advice for students and communicating with people unknown to you). Other than that, it's about ego, not effective communication. One could argue that students are customers (particularly in the US) and don't implicitly owe professors any deference beyond those of any other profession. \n\nI do not think it is rude and unpleasant to email someone using their name if you have met, if anything this is more standard than adding titles to every email - I don't know a single person who would ever ask that from another PhD holder.\n\nI think some of the hangup about title use often comes from institions or individuals setting norms that seem traditional or \"formal\" in an effort to add some level of prestige.",
                          "author": "mafiafish",
                          "created": 1619656709,
                          "upvotes": 0,
                          "replies": {
                            "gw94gzl": {
                              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw94gzl/",
                              "text": ">One could argue that students are customers\n\nNo, students are NOT \"customers.\"",
                              "author": "LadyChatterteeth",
                              "created": 1619664818,
                              "upvotes": 10,
                              "replies": {
                                "gw95mmj": {
                                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw95mmj/",
                                  "text": "Second this. Students are NOT customers. If you view an education system that way, it's very unfortunate.",
                                  "author": "Kindly_Book5115",
                                  "created": 1619665447,
                                  "upvotes": 7,
                                  "replies": {}
                                },
                                "gw95fzb": {
                                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw95fzb/",
                                  "text": "Maybe not to research staff supported solely from grants, but if undergrads are paying $20-40,000+ a year which funds many teaching staff, they're certainly paying a lot of money for a service (and facilities, of course).\n\nI don't for a moment think education should be transactional with the burden of learning falling on staff rather than students who need to study, rather that deference to instructors beyond everyday politeness and acknowledgment of expertise is strange for people paying for a service.",
                                  "author": "mafiafish",
                                  "created": 1619665347,
                                  "upvotes": -1,
                                  "replies": {}
                                }
                              }
                            },
                            "gw8ptcp": {
                              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8ptcp/",
                              "text": "Ah, now that you clarified your point of view, I totally agree.\n\nIn my previous comment, I assumed this was an interaction between a student/trainee and a professor, not between colleagues.\n\nI apologise for my misunderstanding.",
                              "author": "Round-Defiant",
                              "created": 1619657664,
                              "upvotes": 3,
                              "replies": {
                                "gw8qxxw": {
                                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8qxxw/",
                                  "text": "No worries - it's a very different dynamic, but one that PhD students in particular can often find difficult as some faculty and postdocs will consider them part of the gang, while some will prefer to keep a student-professor distance. I'm sure many of us have seen this with our grad student peers and the different interactions with their supervisors and lab groups.",
                                  "author": "mafiafish",
                                  "created": 1619658223,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gw95j3z": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw95j3z/",
                      "text": "You don't need to be worried, seriously. Are East Asians (especially Japan and Korea) are all consumed by their egos since they use honorifics in their daily interactions? That's such a narrow way to judge how other people interact, and you're coming from your own bias, tbh.",
                      "author": "Kindly_Book5115",
                      "created": 1619665395,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gwcadh7": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwcadh7/",
          "text": "In undergrad I had one professor who insisted we used his first name. It felt weird to me at the time so I'd use both interchangeably. (this was as an anthro student). Super chill guy who spent most of his time making stone tools in his lab, took 4 or 5 courses from him over my time there, all max 10 people in the class, generally half were grad students. It was a pretty small circle, lots of the same faces in every class",
          "author": "djsquilz",
          "created": 1619727755,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gw8mf3y": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8mf3y/",
      "text": "Contrary to what others say here, as a professor... undergraduates should call them \"Professor\" unless they explicitly tell you to be informal. No matter how they sign their e-mails. You cannot err doing this; you _can_ err by making assumptions. For graduate students, it will depend on the local culture (ask around first), but usually the transition to first name basis is more automatic, but not always. Again, err on the side of formality. \n\nIf you're too informal with a professor, it's quite grating, and correcting it makes one feel like a dick, so just don't put us in that position, please.",
      "author": "restricteddata",
      "created": 1619656012,
      "upvotes": 11,
      "replies": {
        "gw9r7qc": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9r7qc/",
          "text": ">If you're too formal with a professor, it's quite grating, and correcting it makes one feel like a dick, so just don't put us in that position, please.\n\nI assume you mean informal here. But, yes, if a student is too informal in their form of address, it is certainly annoying, but it does make me feel like a jerk for pointing it out.",
          "author": "mleok",
          "created": 1619680380,
          "upvotes": 2,
          "replies": {
            "gwawr2t": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwawr2t/",
              "text": "Right, corrected!",
              "author": "restricteddata",
              "created": 1619708196,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gw9uyob": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9uyob/",
          "text": "People who don't want to be called by their first name shouldn't sign their email with their first name, then. Their fault if they do, and they have no right to be offended.",
          "author": "simoncolumbus",
          "created": 1619683754,
          "upvotes": -2,
          "replies": {
            "gwawphn": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwawphn/",
              "text": "This is just not how formality works in any culture, sorry (_to clarify: you cannot just reason your way through it, it is not about logic_). If someone is significantly above you in a social hierarchy, you don't address them informally unless given _explicit_ permission to. Signing a letter with your first name doesn't give that permission.\n\nPresident Biden probably signs things \"Joe\" but you'd be an idiot to call him \"Joe\" unless he told you to. Separately, consider that it is seen as quite an indulgence for someone above you to tell you that you can call them by their first name — that's part of the ritual. \"Ah, call me Joe\" — is part of the game of showing who is actually in charge.\n\nYou might wonder, should professors care about this? I don't know. But they do. Why? Probably because it takes an _enormous_ amount of effort and sacrifice to become one — a lot more than it does to become an undergraduate — and because we aren't typically afforded much social respect for that elsewhere. \n\nAgain, in this situation — like all involving rules of respect and formality — you can't err by being too formal until told you don't have to be. But you can err in the other direction very easily. The correct answer is to be formal until you are told to be informal. You might think that's irrational but again, that's how it works in our culture (and our culture is WAY more lax about formality than a lot of cultures; many languages have entirely different ways of declining verbs and pronouns based on your formality status).",
              "author": "restricteddata",
              "created": 1619708177,
              "upvotes": 2,
              "replies": {
                "gwdzz1a": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwdzz1a/",
                  "text": "Oh look, it's an American thinking they know how 'any culture' works. Your arrogance is utterly misplaced.",
                  "author": "simoncolumbus",
                  "created": 1619757195,
                  "upvotes": 1,
                  "replies": {
                    "gwg9hla": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwg9hla/",
                      "text": "To clarify, my point was not that US formality is universal (obviously it is not), but that cultural rules about formality are not dictated by logic.",
                      "author": "restricteddata",
                      "created": 1619805356,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "gweiaze": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gweiaze/",
                  "text": ">This is just not how formality works in any culture, sorry.\n\nThere are definitely cultures where formality is grating and offensive (I grew up in one), and informal address is the polite form of address, including for first meeting.\n\nUS culture is rather formal, on the whole.",
                  "author": "officially_anxious",
                  "created": 1619772173,
                  "upvotes": 1,
                  "replies": {
                    "gwg9fy7": {
                      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwg9fy7/",
                      "text": "My point was not that US formality is universal, but that cultural rules about formality are not dictated by logic.",
                      "author": "restricteddata",
                      "created": 1619805336,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gw8xmoc": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8xmoc/",
      "text": "This does differ by institution as well as country and relationship. The liberal arts colleges I attended for undergrad in the U.S. both had first-name policies or at strong cultural pressure to use first names, so undergraduates essentially never called anyone \"Dr.\" or \"Professor.\" (I also once had a course taught by a very unprepared professor because he and his wife both hyphenated and taught in the same department, and both had thought she was going to teach the course until the week before.)\n\nMy graduate programs (U.S. and international) and the lab I visited recently (Sweden) were also largely default to first names, although many of the Asian students in the international program did not seem to be comfortable with this and stuck to \"Dr.\" or \"Professor.\" I don't think I heard anyone in the Swedish lab use a surname, ever, and from talking to Swedish friends, it is a culture where too much formality can come across very strangely.\n\nWhen in doubt, go for formal on first contact and then ask later \"How would you like me to address you?\"",
      "author": "threecuttlefish",
      "created": 1619661384,
      "upvotes": 4,
      "replies": {}
    },
    "gw885xy": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw885xy/",
      "text": "If you’re a PhD student or an RA in a lab, I can’t see why your professor would be offended by you calling his/her first name.\n\nIf you haven’t met him before/ he doesn’t know you, perhaps address him as Professor xxx to maintain some distance.",
      "author": "overlapping_gen",
      "created": 1619649126,
      "upvotes": 21,
      "replies": {
        "gw8dcto": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8dcto/",
          "text": "Oh I’ve actually *seen* them be offended. One PhD student was chewed out for addressing a professor in our department (whom they didn’t yet know personally) by his first name. And this was otherwise a very nice prof who’s on a first name basis with everyone, but demands the honorific off the bat. Then he’ll cheerfully say, “Call me X.”",
          "author": "ConsciousReindeer265",
          "created": 1619651613,
          "upvotes": 23,
          "replies": {
            "gw8edvj": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8edvj/",
              "text": "Okay I must not have met enough professor to know those who actually derive utility from these kind of petty things",
              "author": "overlapping_gen",
              "created": 1619652114,
              "upvotes": 5,
              "replies": {}
            },
            "gw8l1au": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8l1au/",
              "text": "That just seems so unnecessary - like a grammar pedant who points out errors when they occur but doesn't really care and uses them themselves.\n\nJust because something fits your preferred convention, doesn't mean it's required. Particularly so when a Prof isn't your line manager/PI. Research isn't the military.",
              "author": "mafiafish",
              "created": 1619655343,
              "upvotes": 4,
              "replies": {
                "gw96jar": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw96jar/",
                  "text": "Why do we have any niceties in human interactions at all? Why should anyone ever treat anyone they just met with any respect whatsoever? It's so stupid and pointless, isn't it? \n\nWhat people find offensive isn't necessarily rational, and can more often than not be arbitrary products of history, and yes, conflicts of egos. But it is the way it is, whether you like it or not. And so one *should*---in the sense that one *should* not be a fucking asshole just because you have some idiosyncratic personal issue---roll with it.",
                  "author": "respeckKnuckles",
                  "created": 1619665942,
                  "upvotes": 7,
                  "replies": {}
                },
                "gw9y4us": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9y4us/",
                  "text": "You are just showing some respect to the hard-earned title. I don’t know why people can’t see that",
                  "author": "jasonmoyy",
                  "created": 1619686759,
                  "upvotes": 5,
                  "replies": {}
                },
                "gw8x52e": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8x52e/",
                  "text": "Actually the situation above sounds pretty normal to me. My advisor was also very nice to everyone, but he was quite offended when a stranger would start off with his first name, even though he's switch to \"Call me John\" or whatever pretty soon after.\n\nIt's just politeness and civilized society, and it's similar to other professional situations. If someone rents a car the person behind the counter will usually say \"Here are the keys, have a good trip Mr. or Mrs. so-and-so\". They wouldn't just say \"Here you go Bob, have a good one.\" Same if you walk into a bank and talk to a teller, or check into a hotel room, etc.",
                  "author": "eraoul",
                  "created": 1619661151,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "gw8ef2l": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8ef2l/",
          "text": "In my experience you are usually on a first name basis with the professor you work under, but all other faculty are 'Dr. X.'",
          "author": "hdorsettcase",
          "created": 1619652130,
          "upvotes": 4,
          "replies": {}
        },
        "gw8gzlh": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8gzlh/",
          "text": ">If you’re a PhD student or an RA in a lab, I can’t see why your professor would be offended by you calling his/her first name.\n\nThis can vary wildly with the advisor in question; for reference, I never called my advisor anything other than \"Dr.\", and I *still* haven't referred to him by his first name even though I have my doctorate now and we're both nominally of the same academic \"rank.\"\n\nFor what it's worth; the lab wasn't exceptionally formal, to the degree that we usually held our lab meetings in local bars. The only formality expected was using their title; everything beyond that was fair game.",
          "author": "r3dl3g",
          "created": 1619653376,
          "upvotes": 4,
          "replies": {
            "gw8sa7h": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8sa7h/",
              "text": "Definitely. Where I did my graduate degrees, I was on a first name basis w/ most of the Profs in my depts, and definitely w/ my supervisors.\n\nIn my current lab, my PI insists on being called Dr / Prof by anyone w/ out PhD. Once student has PhD, then they are free to call them by first name.\n\nI don't personally like that convention, but I abide by it. I personally prefer everyone call me by my first name, although given issues around people NOT using honorifics for women Profs and assuming they are only students, I've started reconsidering that position. If I use the honorific, it's a lot easier to point out that someone else deserves it to be used as well.",
              "author": "rflight79",
              "created": 1619658879,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gw8bfci": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8bfci/",
      "text": "Dear Dr/Professor Smith when first writing, and after that until they tell you otherwise.\n\nIf, for example, they're actually a grad student teaching your class, they'll probably tell you almost immediately.\n\nSigning their emails 'John' doesn't mean you can call them John.\n\nIf you are their grad student and/or work for them, the traditional etiquette is to keep calling them the formal style until they tell you not to.\n\nMy PhD supervisor was a traditionalist. She was Dr X to me for the entire year I knew her as an undergrad while she assisted me with my PhD proposal. Once I officially started, she replied to my first email to her with 'First of all, my name is [firstname].'",
      "author": "sirophiuchus",
      "created": 1619650680,
      "upvotes": 21,
      "replies": {
        "gw8dzcp": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8dzcp/",
          "text": "> Signing their emails 'John' doesn't mean you can call them John.\n\nI would disagree, though it does depend on your professor.  I am always careful to adapt my signature to whomever I am communicating with: Undergrads get \"–N. Moore\" but colleagues, staff, and grad students get \"–Neil\".  I, personally, would never sign an email to an undergrad with the latter, unless I had some reason to be on a first-name basis with them.",
          "author": "neilmoore",
          "created": 1619651920,
          "upvotes": 17,
          "replies": {
            "gw8ehnj": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8ehnj/",
              "text": "That might be a cultural difference. Here in Ireland, it would be very strange to sign an email with anything other than your first name. The highest possible formality would be firstname + lastname.",
              "author": "sirophiuchus",
              "created": 1619652163,
              "upvotes": 17,
              "replies": {
                "gw8ewmy": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8ewmy/",
                  "text": "True, US-an here",
                  "author": "neilmoore",
                  "created": 1619652365,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gw8ibir": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8ibir/",
          "text": "Yeah I have to agree with this. Email signatures are not an open invitation, and the signature may not even be a conscious response at this point. You can set an outlook signature pretty easily, and I also know professors who default to a first name more because they do professional & interdepartmental work than with students. For some profs, the informal address is something their student has to earn. \n\nThe golden rule is to follow the German convention: never use the first name until given explicit permission. Anything else runs the risk of giving insult.",
          "author": "BeondTheGrave",
          "created": 1619654019,
          "upvotes": 7,
          "replies": {}
        },
        "gw8eerk": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8eerk/",
          "text": "Indeed, just because I sign off my email with my first name, isn't necessarily an invitation to an undergraduate to use that when addressing me moving forward. It is better as you say to wait until one receives an explicit invitation to do so, at least when there is a significant differential in career stage.",
          "author": "mleok",
          "created": 1619652126,
          "upvotes": 5,
          "replies": {
            "gw8eqoa": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8eqoa/",
              "text": "Honestly, the main benefit of clarifying all of this isn't even to protect the egos of staff: it helps the students.\n\nI could feel the anxiety coming off the screen when reading emails from undergraduates, and 'how to properly address your lecturer' is a common stress point.\n\nIf things are consistent, nobody has to worry.",
              "author": "sirophiuchus",
              "created": 1619652285,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "gw9mzdk": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9mzdk/",
          "text": "This is insane. If you don't want to be called John, don't sign your emails John. This must be the crustiest group of academics in the whole world on this page because I have never, ever met or heard anyone in real life who would be offended or surprised if a student addressed them with their first names, allowing the first contact had been formal and they had signed off with their first names.",
          "author": "blueb0g",
          "created": 1619676931,
          "upvotes": 2,
          "replies": {
            "gw9ns6w": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9ns6w/",
              "text": "I'm simply passing on what I've observed, which is that there are plenty of academics who casually sign everything 'John' who still don't want their students to actually call then that.",
              "author": "sirophiuchus",
              "created": 1619677552,
              "upvotes": 3,
              "replies": {}
            },
            "gw9v9gj": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9v9gj/",
              "text": "These people really just seem to be looking for reasons to be offended. If they are so precious and don't want to be addressed by their first name, they shouldn't invite it. Going by the email signature is a widely recognised norm. It's like that joke about a person driving on the wrong side of the road and calling everybody else crazy.",
              "author": "simoncolumbus",
              "created": 1619684037,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gw8gsp0": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8gsp0/",
      "text": "If they have a doctorate; Dr.\n\nIf they are a professor, then professor.\n\nIf both; either in a classroom/teaching setting, Dr. outside of that.\n\nIf neither; Mr/Mrs/Ms.\n\nAlso Sir/Ma'am are great if you know their gender but not their \"true\" title.",
      "author": "r3dl3g",
      "created": 1619653285,
      "upvotes": 18,
      "replies": {
        "gw8p8lv": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8p8lv/",
          "text": "This right here is the correct answer",
          "author": "dikchzze",
          "created": 1619657388,
          "upvotes": 1,
          "replies": {}
        },
        "gw8wpu1": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8wpu1/",
          "text": "A professor as I understand it is only PHD level, someone with a master’s is an instructor. I wouldn’t call them a professor, although you can’t offend them with professor.",
          "author": "Cupcakequeen789",
          "created": 1619660955,
          "upvotes": -7,
          "replies": {
            "gw90plj": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw90plj/",
              "text": "Doctor is only PhD level. Professor as an official HR job title may be mostly TT PhDs, but a Masters level class instructor could still be addressed as Professor as an honorific, especially by their students.",
              "author": "bacon_music_love",
              "created": 1619662879,
              "upvotes": 5,
              "replies": {}
            },
            "gwacldm": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwacldm/",
              "text": "In North America, \"Professor\" is an honorific that just comes with the job of being faculty. I had a few classes taught by adjuncts and long-time professors without PhDs (and one with just a B.S.), but they all were given the \"professor\" title.",
              "author": "r3dl3g",
              "created": 1619698306,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gw8gm69": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8gm69/",
      "text": "never.  unless they specifically tell you to do so.  this goes for men and women.  under no circumstances should you use first names in a job interview unless directed to do so.",
      "author": "printandpolish",
      "created": 1619653199,
      "upvotes": 9,
      "replies": {}
    },
    "gw98z3k": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw98z3k/",
      "text": "It’s always better to be safe than sorry. You should probably go with Prof or Dr.",
      "author": "jasonmoyy",
      "created": 1619667316,
      "upvotes": 3,
      "replies": {}
    },
    "gw9ff1n": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9ff1n/",
      "text": "As others have said, it really varies, both by field and by region. In terms of Canada, in Quebec it's much more common to address professors by their first name unless they say otherwise (McGill seems to be a large exception to this). \n\nIn the US, Prof. or Dr. (or other honorific they might have, like Judge) until you're explicitly told otherwise is the norm. \n\nDefinitely use honourifics pre-interview and while in the hiring process.",
      "author": "yellowbubble7",
      "created": 1619671305,
      "upvotes": 3,
      "replies": {}
    },
    "gw8ocol": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8ocol/",
      "text": "Here I am just happy if they spell my last night correctly.",
      "author": "itsthepunisher",
      "created": 1619656953,
      "upvotes": 2,
      "replies": {}
    },
    "gw8p6wp": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8p6wp/",
      "text": "My experience in the US is all contact is basically Dr/Professor unless it is my advisor or someone I am working closely with, and even then I'd check once I started working in the lab by 1) their email signature and 2) saying \"How would you like me to refer to you?\" \n\nBoth my committee members answered 2 with their first names but I still use the Dr. sometimes as a sign of respect/gratitude.",
      "author": "jenesaisquoi",
      "created": 1619657365,
      "upvotes": 2,
      "replies": {}
    },
    "gw8uw7t": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8uw7t/",
      "text": "In the US, it’s pretty common for undergrads to use Dr. Smith at pretty much all times. \nThe only time I was asked to use a first name was after working in a research lab on two occasions. One was a US professor who said Dr Smith was their teaching name. The other was from the UK where this may be different?\n\nI’m a PhD student and now use Dr. Smith in all formal emails as well as when meeting professors for the first time unless they introduce themselves by their first name or say call me Dr Smith.",
      "author": "PenguinFeather4",
      "created": 1619660106,
      "upvotes": 2,
      "replies": {
        "gw9p9r8": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9p9r8/",
          "text": ">The other was from the UK where this may be different?\n\nYeahhhhh.... and this took me *a while* to figure out as an international student from an English-speaking country.\n\nAnyone with a PhD is Dr. Lastname. Once Dr. Lastname has earned the rank of full professor they become Professor Lastname. A higher education teacher without a PhD is not Professor Lastname (as it would be in the US), although I haven't encountered any teaching faculty with terminal MAs, so idk what their formal name would be.\n\nThat said, after a few months being their students, my supervisors told me to use \\[Firstnames\\] when I'm interacting with them directly. But I still use Prof./Dr. Lastnames when I need to reference them in formal writing other people will read.",
          "author": "RedPotato",
          "created": 1619678760,
          "upvotes": 2,
          "replies": {
            "gwdyyn4": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwdyyn4/",
              "text": "Thank you! I think I had figured most of this out from having a friend/informal mentor in the UK. But I definitely agree it can take a while to figure out the academic terms in different countries!",
              "author": "PenguinFeather4",
              "created": 1619756533,
              "upvotes": 1,
              "replies": {
                "gwdz7lr": {
                  "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwdz7lr/",
                  "text": "YW. I've swapped my apartment for flat, my elevators for lifts, and my bathroom for loo, but reversing professor and doctor is just the one thing I can't get behind. I always feel like I'm disrespecting full professors.",
                  "author": "RedPotato",
                  "created": 1619756694,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gw91izp": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw91izp/",
      "text": "Always use their formal titles for anyone above you or older than you unless they personally instruct you otherwise.",
      "author": "TSIDATSI",
      "created": 1619663287,
      "upvotes": 2,
      "replies": {}
    },
    "gw9ls9y": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9ls9y/",
      "text": "Never start with a first name",
      "author": "baummer",
      "created": 1619676005,
      "upvotes": 2,
      "replies": {}
    },
    "gw9t2kc": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9t2kc/",
      "text": "I would always avoid using 'hi' in an email unless you know the person very well. Use 'dear' or 'hello'.",
      "author": "Rebel_traveller",
      "created": 1619682014,
      "upvotes": 2,
      "replies": {}
    },
    "gw9ul6c": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9ul6c/",
      "text": "At our technical university in the Netherlands, we usually use \"Hi John\", \"Dear John\", etc.\n\nOnly the first time may be an exception, but not necessarily.",
      "author": "Koen1999",
      "created": 1619683408,
      "upvotes": 2,
      "replies": {}
    },
    "gw9ylcj": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9ylcj/",
      "text": "People are actually researching this stuff.\n\n[https://scholarworks.wmich.edu/jcp/vol3/iss1/7/](https://scholarworks.wmich.edu/jcp/vol3/iss1/7/)\n\n&#x200B;\n\n>Abstract  \n>  \n>This experimental study tested whether a professor’s form of address (FOA) and email signature influenced students’ perceptions of the professor’s credibility, approachability, and likability. Guided by communication accommodation theory, the study investigated the likelihood that students would reciprocate a professor’s FOA in email communication. Participants were randomly assigned to one of seven conditions varying by professor FOA (doctor, professor, first name) and email signature (present or not), with a signature only control condition. Results indicated students were more likely to reciprocate the FOA when an email signature was not present. Open-ended responses suggested students perceive instructors more positively when instructors specify a FOA and feel anxious and uncertain when professors do not specify a FOA.",
      "author": "molobodd",
      "created": 1619687197,
      "upvotes": 2,
      "replies": {}
    },
    "gwaf1jw": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwaf1jw/",
      "text": "(USA, Engineering) \nIf you have a PhD and you're in the same field and looking to become a professor yourself, I've heard (and I practice) that addressing them as \"John\" makes you their near-equal colleague, in a way. If you're applying to be a professor, they're looking for an equal colleague to join their department alongside them, not another student in need of guidance and mentorship. If I'm introducing them formally to others, I'll refer to them as \"Professor\".",
      "author": "DJGCrusader",
      "created": 1619699753,
      "upvotes": 2,
      "replies": {}
    },
    "gw8a7wl": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8a7wl/",
      "text": "Are you an undergrad or a grad student/staff/etc? Stay more formal as an undergrad, but otherwise, first name is probably fine for professors in your department (though you can wait & see what the norms are).",
      "author": "mediocre-spice",
      "created": 1619650103,
      "upvotes": 5,
      "replies": {}
    },
    "gw8cvx8": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8cvx8/",
      "text": "As others mentioned, it depends on the context but better be more professional than not until told otherwise. So: Dear XXX over hi XXX or hello XXX; Prof XXX (no PhD) or Dr XXX (yes PhD) over first name. If they've told you to address them by something, use that. When in doubt, ask.\n\nA couple examples:\n\n1: A professor at my undergrad university requested that all students in his first and second year course call him Professor LastName. Then, in his third and fourth year courses, students were allowed to call him FirstName.\n\n2: I will be starting my PhD in September 2021. I contacted a professor at the university I wanted to attended late summer 2020 and referred to him by Dr. LastName. After a couple of virtual interviews with him, a lab tour, meeting a couple of his current students (virtually) and submitting my application, I began referring to him by FirstName.",
      "author": "poniesgirl",
      "created": 1619651384,
      "upvotes": 3,
      "replies": {}
    },
    "gw8lzta": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8lzta/",
      "text": "It depends on you and where you are in your career.\n\nIn person, If you are a undergrad, then calling them Prof Smith is usually the way to go until they tell you otherwise. At Masters level I called my profs by their first names, but some this is unusually still. PhD level, mostly first name I think, but I imagine in some countries it'll be different. I am not sure about USA or Canada. At postdoc onwards, yeah first name always in person.\n\nFor email, it would be the same as in person UNLESS you don't know them. Then always Prof Smith.\n\nThat's just from the places I have been to. Other countries, institutes, and people will differ.",
      "author": "PersonalZebra8993",
      "created": 1619655805,
      "upvotes": 2,
      "replies": {}
    },
    "gw8m5m9": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8m5m9/",
      "text": "I do a weird sorta twitch whenever a student sends me an email and just uses my first name, I'm like really, no prof, mr, dr, or anything??? Even when I email other faculty or staff, I still at least use some salutation.\n\n\\~\\~though sometimes i wonder if its cause some of the students are 10-20+ yrs older than me\\~\\~\\~",
      "author": "Major_Schedule_2392",
      "created": 1619655881,
      "upvotes": 1,
      "replies": {}
    },
    "gw9n2o4": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9n2o4/",
      "text": "Firstname is the norm, but only after permission is given or after  familiarity is established. Permission can be explicit (\"please, call me Donald\") or implicit (if he introduces himself by his firstname or uses just his firstname in his email closings). Familiarity is very quickly established, usually within a minute of in person conversation or over a few emails.\n\nPersonally, I insist everyone calls me by my first name immediately as I think honorifics are stupid in general. Mr/Dr/Professor, naw. If it ever matters, they already know my title or whatever other info an honorific conveys, including gender identity. My degrees/title/gender doesn't need to be brought up all the time to \"honor\" me and set me apart from my fellow man, or woman in the case of Mr. It's just all so unnecessary and pompous. I don't need a show of respect/formality.",
      "author": "bennyandthef16s",
      "created": 1619677002,
      "upvotes": 1,
      "replies": {}
    },
    "gw9w122": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9w122/",
      "text": "I've always just said Hi first name and finish off the email with my first name and I've never had issues",
      "author": "roranora_nonanora",
      "created": 1619684760,
      "upvotes": 1,
      "replies": {}
    },
    "gw8t61t": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw8t61t/",
      "text": "I always start off with Dr/Prof LastName as people have said, and when they start on first name basis I still refer to them as Prof. FirstName... might be a cultural thing, but I've just never felt comfortable referring to teachers/mentors/etc only by first name",
      "author": "lilsandyball",
      "created": 1619659294,
      "upvotes": 1,
      "replies": {}
    },
    "gwblwdy": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwblwdy/",
      "text": "While not directly related to the use of a title, when a student starts an email by “Hey” Professor, that reminds me that when I was growing up if you said “Hey”, the response was “Hey is for horses” have respect.",
      "author": "BCCISProf",
      "created": 1619718034,
      "upvotes": 1,
      "replies": {}
    },
    "gwc1uv7": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwc1uv7/",
      "text": "My experience has been a little different than most people's - in my program, once you are acquainted with a professor (i.e. once they know who you are) it's pretty normal to address professors by their first name. But I know this is very different in different contexts and there's a big difference between, for example, the west coast and east coast of the US.",
      "author": "raoadityam",
      "created": 1619724393,
      "upvotes": 1,
      "replies": {}
    },
    "gw9iukm": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9iukm/",
      "text": "Don't use Dr. or Prof. in Canada/US even for a first email. Instead, use their full name:\n\nDear John Smith,\n\nthen if they sign off as just 'John' then you can switch future emails to Dear John. \n\nDon't start an email with 'Hi'.",
      "author": "DevFRus",
      "created": 1619673770,
      "upvotes": -6,
      "replies": {
        "gw9ro9x": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9ro9x/",
          "text": "Where do you even come up with this nonsense? Of course you should use Prof. Lastname in the first email at a US/Canadian professor.",
          "author": "mleok",
          "created": 1619680774,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gw94ebh": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw94ebh/",
      "text": "If addressing for the first time in a mail, which salutation is better? \n\n1. Respected Sir\n2. Respected Dr. John Smith\n3. Respected Prof. John Smith",
      "author": "98Vitthal",
      "created": 1619664778,
      "upvotes": -2,
      "replies": {
        "gw9ia0z": {
          "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9ia0z/",
          "text": "In the US\n\nI would rank these \n\n1 a. Professor Smith\n\n1 b. Prof. Smith\n\n2. Dr. Smith\n\n3. Sir (although, I would recommend against this, as it is too general; you know their name, use it). \n\nKeep in mind not all Dr. are Professors so if one has earned the title “professor” then “doctor” is, technically, insufficient. So it is better to error on the more respectful side.\n\n(Edit: formatting)",
          "author": "0hioMan",
          "created": 1619673349,
          "upvotes": 5,
          "replies": {
            "gw9rx25": {
              "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gw9rx25/",
              "text": "Dr. vs. Prof. gets a bit subtle. In the UK, only full professors are referred to as Prof., and in the US, it depends on the kind of institution whether Dr. or Prof. is a more distinguished title for a faculty member. At an institution where not everyone has a doctorate, then PhDs might prefer to be referred to as Dr., but at a research university where it is pretty much taken for granted that faculty have PhDs, but not every faculty member is a tenure-track or tenured faculty member, then Prof. might be preferred over Dr. To complicate matters further, the local convention might be that a student refers to any course instructor as Prof., even if the instructor is a graduate student.",
              "author": "mleok",
              "created": 1619680985,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gwa880t": {
      "link": "/r/AskAcademia/comments/n0osu7/addressing_professors/gwa880t/",
      "text": "If I think prof. is too formal, but I don't feel comfortable using first name only yet, I usually use first and last name (Hi John Smith), that usually works for me.",
      "author": "ScienceCat08",
      "created": 1619695434,
      "upvotes": -1,
      "replies": {}
    }
  }
}