{
  "sid": "q1er6r",
  "link": "/r/AskAcademia/comments/q1er6r/phd_cycle_for_fall_2021/",
  "title:": "Phd Cycle for Fall 2021",
  "text": "Hi! \n\nI am a current senior at a branch campus of a well reputed US university and I am looking to get a Phd in Sociology or Anthropology. I have taken the GRE this summer but didn’t do that great due to ongoing research projects. I am worried that though most departments made the GRE optional but being an international student and not submitting GRE will harm my chances. \n\nI am in desperate need of suggestions/help \n\nAny advice about what to do?",
  "author": "stk3293",
  "created": 1633380373,
  "updated": 1634078777,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hfex8ph": {
      "link": "/r/AskAcademia/comments/q1er6r/phd_cycle_for_fall_2021/hfex8ph/",
      "text": "There’s no harm in taking the GRE again (especially if you are confident in doing better) but I do believe the older score is retained and is visible to schools.  Though, it’s been well over a decade since I had to deal with grad school admissions.  If you do take it again, I would recommend getting a course book.  The fact that you can train for the GRE kind of invalidates the whole concept but it is possible to train for it.  \n\nBTW, if you’re worried about being in a lower than say 80th percentile, keep in mind that you’re competing with other grad school bound people, not randos off the street.  For instance I got 780 on the quantitative portion (literally one notch below a perfect score; 800 was the perfect score back in the day, I think they’ve changed the scale since) and I was in the 80th percentile.  My verbal was like in the 60th and that did not hurt me any; still above the median and all.",
      "author": "Doctor_Yev",
      "created": 1633388186,
      "upvotes": 2,
      "replies": {
        "hff0tx4": {
          "link": "/r/AskAcademia/comments/q1er6r/phd_cycle_for_fall_2021/hff0tx4/",
          "text": "Thank you for the advice. I am thinking of taking it again but I don’t how much time I will be able to devote since I am in the middle of my semester.",
          "author": "stk3293",
          "created": 1633389993,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}