{
  "sid": "qbfa3e",
  "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/",
  "title:": "What do you regret about your thesis?",
  "text": "Hi,\n\nI'm currently in the process of picking a thesis subject for my AI masters degree.\nI find it to be a difficult decision and am, after elimination of others, left with two projects that I think could both really be fun.\n\nAs such, I think I want to make my decision by minimising possible future regret, but since we're not there yet, I do not know what I might regret so I've decided to turn to the hivemind/internet/reddit and ask you:\n\nWhat do/did you regret about your thesis? \n\nI'm looking for anything remotely related, so please do mention it even if you would otherwise think it is too far removed.\n\nThanks everyone, you've helped me make up my mind!",
  "author": "Laafheid",
  "created": 1634661342,
  "updated": 1634750169,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "hh92f70": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh92f70/",
      "text": "Probably the only thing I regret about my thesis is investing too much in its importance beyond merely being a vehicle to obtain a degree. The thesis has a job to do, and after it does that job it doesn't have a tremendous amount of value. So keeping the scope of the thesis narrow is really important.",
      "author": "brett_hoover_wx",
      "created": 1634661992,
      "upvotes": 36,
      "replies": {
        "hh93dn7": {
          "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh93dn7/",
          "text": "I had a similar experience with my bachelor thesis (although for me it was already an extension of a project I had started earlier), so I get where you're coming from I think.\n\nThinking back to it, when did you feel like it was getting too wide of a project?",
          "author": "Laafheid",
          "created": 1634662375,
          "upvotes": 1,
          "replies": {
            "hh96ie6": {
              "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh96ie6/",
              "text": "I had a good committee who didn't let my proposal get out-of-hand from the start. Two best pieces of advice I received: (1) \"leave something for your actual career\", and (2) \"do something short that yields results, graduate, and then get into a job where you can make real money\". A lot of people have tone-deaf committees who think a student is content with just being a student in perpetuity and set the target at perfection, I was lucky to not have that and when possible I try to be the reasonable person in the room when I sit on student committees as a research scientist.  \n  \nThe point where I had to reign it in a second time was in what turned into the last six months of my time as ABD in graduate school, where I had the option of either sewing things up and finalizing a portfolio of work for my dissertation or continue to tweak, refine, add experiments, or test-drive new methods or analytics that are constantly coming into your frame of vision from other people's work. It takes courage to tell yourself that it's time to finish - there is a certain amount of identity assassination involved with finishing since up to that point it's likely that the only thing you've ever *been* is a student, and finishing means you have to become something else. The end product is not everything it could be, nothing is, but understanding that it doesn't have to be everything it could be is key.",
              "author": "brett_hoover_wx",
              "created": 1634663650,
              "upvotes": 5,
              "replies": {
                "hhagneh": {
                  "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhagneh/",
                  "text": "Thanks for the in depth reply!\n\nI do want to write my thesis in the allotted time, but I'll keep in mind that a thesis is a thesis, and that if it comes down to time, polishing the application might be during a full job instead.",
                  "author": "Laafheid",
                  "created": 1634682288,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh96774": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh96774/",
      "text": "I regret nothing.\n\nTo be clear, I could absolutely go back and identify plenty of things I would do differently now, or that I wish I had done better at the time. But the thesis and dissertation are a means to an end.\n\nChoose a topic you think you will be interested in, because you will ultimately spend a lot of time on your thesis. But there is no one right answer. The thesis is a project that is part of earning your degree. If you have two good options, pick one, enjoy the process, and know that in, say, five years from now, it is highly unlikely that you will spend your time looking back wishing you had selected the other project.",
      "author": "jogam",
      "created": 1634663526,
      "upvotes": 3,
      "replies": {}
    },
    "hha3tqh": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hha3tqh/",
      "text": ".... that it came true before I could flesh it out and publish 🙄\n\n(I did a case study on hospitals and their lack of preparedness for novel infectious disease pandemics)\n\n(really. if i can't get a first author, i at least deserve a gold star lol)",
      "author": "NotSkinNotAGirl",
      "created": 1634676781,
      "upvotes": 3,
      "replies": {
        "hhaed8j": {
          "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhaed8j/",
          "text": "I mean l, you were looking very much in the right direction...",
          "author": "Laafheid",
          "created": 1634681255,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hh92j91": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh92j91/",
      "text": "I can tell you what I definitely loved about my thesis and dissertation. (Which isn’t quite what you asked, I know.) I was genuinely interested in the topic which combined a few interesting areas into one “gap” in research. AND I found it to be interesting to explain to others. You’ll be doing a lot of reading, writing, presenting, and explaining, so make sure you enjoy it as much as possible. I don’t think I regret anything about the topic choice itself.",
      "author": "REC_HLTH",
      "created": 1634662037,
      "upvotes": 2,
      "replies": {
        "hh945w3": {
          "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh945w3/",
          "text": "That's good to hear too!\n\nA lot of students around me, which started a year earlier, tell me they have (had) a really bad time with their thesis, so it's nice to hear others have had a good experience!\n\nDid you have difficulty deciding between subjects in any way?",
          "author": "Laafheid",
          "created": 1634662693,
          "upvotes": 2,
          "replies": {
            "hh95gfb": {
              "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh95gfb/",
              "text": "Not really. Both topics that I considered were based in my own work experience when I realized there was a “problem” of sorts. One was a more interesting problem and I could tell “lightbulbs” clicked on when I was asking professors what they thought and realized they really hadn’t ever considered it themselves. One said, “that kinda blows my mind” another mentioned “When you explain it it seems so obvious, I don’t know why more people don’t talk about it”. So, I knew that topic was my “ticket”. The process wasn’t all roses for sure, but at least I liked it and thought it was important which helps a TON with perseverance! I also went into the process sort of blindly- which may have been good. I don’t think I knew all that would end up being involved so I just kept doing the next thing as I learned and was advised. I “drove” the dissertation process more than my thesis, but of course had committees for both. (Pick committee members who listen and understand your goals and cheer you on/help you reach your goals.)\n\nNote- I am in a different field than you.",
              "author": "REC_HLTH",
              "created": 1634663219,
              "upvotes": 1,
              "replies": {
                "hhanzgp": {
                  "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhanzgp/",
                  "text": "Perseverence is a good one, although I think I am in a good spot on that front: I do like the project and think I will continue to find it interesting to work on for the entire duration, which I doubted with other projects.\n\nIt also helps that the people I will be working with seem really pro-active, which gives me confidence I will be able to get support from them (rather than getting no responses for weeks like I heard from other students from last year).",
                  "author": "Laafheid",
                  "created": 1634685671,
                  "upvotes": 2,
                  "replies": {
                    "hhapf6k": {
                      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhapf6k/",
                      "text": "Sounds like you’ll be just fine. There will be some rough spots, but if you have a good team and a good topic you’ll have a “done dissertation” which is the best kind to have.",
                      "author": "REC_HLTH",
                      "created": 1634686331,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hh9kkvd": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh9kkvd/",
      "text": "I regret worrying so much what people (supervisor, committee members, peers, etc.) thought about me and my work. If I could go back, I would take a more relaxed approach to the whole process.",
      "author": "Hhas1proton",
      "created": 1634669192,
      "upvotes": 2,
      "replies": {
        "hhamv87": {
          "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhamv87/",
          "text": "whose opinion did you end up caring more about than you though you would beforehand?",
          "author": "Laafheid",
          "created": 1634685148,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhat0f4": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhat0f4/",
      "text": "I mean, all of my thesis-related regrets are fundamentally just things that I would have done differently had I actually known better at the time.\n\nFocus on picking a topic you enjoy and an advisor that you can jive with, and you won't have any serious regrets.",
      "author": "r3dl3g",
      "created": 1634687982,
      "upvotes": 2,
      "replies": {}
    },
    "hh93bp7": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh93bp7/",
      "text": "I do not know how related this is to your question,  the people you will be working with can make the same project a super interesting or super boring one (or a nightmare). If you have a chance to choose, work with someone who is doing active research related to the project topic and seems a decent human being (or, if you already have an advisor: choose a project in their area of research) .\nAlso, trust your gut.",
      "author": "ombelicoInfinito",
      "created": 1634662353,
      "upvotes": 1,
      "replies": {
        "hh94ttn": {
          "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh94ttn/",
          "text": "Yeah that's definitly important.\n\nWould you say it's a problem if a would-be supervisor publishes actively in many areas? (versus sparsely in a single area)",
          "author": "Laafheid",
          "created": 1634662964,
          "upvotes": 1,
          "replies": {
            "hhaa8nf": {
              "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhaa8nf/",
              "text": "I don't think so. Just make sure that they are actually giving some contribution and not merely putting they name on students' work :)",
              "author": "ombelicoInfinito",
              "created": 1634679459,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh9eoei": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh9eoei/",
      "text": "I had a bad member on my committee. Big name, good for street cred, but ultimately was a huge flake and caused lots of problems and a delayed graduation.",
      "author": "EccentricName",
      "created": 1634666889,
      "upvotes": 1,
      "replies": {}
    },
    "hh9iljd": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh9iljd/",
      "text": "I regret that I choose my supervisor based on „willingness to produce a unique work“ and not based on „need to get at least 70%“. \n\nSecond I regret that I didn‘t benefit from having a supervisor by having regular meetings with him/her.  \n\nFirst my supervisor him/herself was great. Great academic, critical thinker and teacher. However , he/she was famous on campus to give lower grades as he/she demanded more effort and more unique work. I thought that this was exactly what the kind of motivation I would need to succeed in my thesis,  in order to provide an outstanding work. While he/she was great in giving me guidance troughout the research process - my grade from first and second reader differed by more than 20%. Due to college policy a third reader graded my thesis and I ended up with a score under the required 70% to pursue Phd at the schools of my choice…\nIf I could go back, I would chose my supervisor more based on the fact that I need at least 70% in this thesis… and seek guidance from critical academics during their courses where I learn. \n\nSecond, plan regular meetings with your supervisors upfront - maybe ask if he/she is willing to read drafts of each (or selected) chapter beforehand and schedule these deadlines as well.",
      "author": "Bubble_Buddy23",
      "created": 1634668422,
      "upvotes": 1,
      "replies": {
        "hh9jy1y": {
          "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh9jy1y/",
          "text": "I'll definitely bring up the draft reading/feedback for the final talks with them.\n\nIt's quite ironic you mention it, because during the last year's I've actively offered to proofread for friends because I experienced during my bachelor how little feedback you can get.",
          "author": "Laafheid",
          "created": 1634668945,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh9rgr9": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh9rgr9/",
      "text": "I used to interview quite a few graduates, I never once cared what their dissertation was on in the CV sift. I would ask about their dissertation in the interview because I wanted to see if they had understood the basics of analysis and research, if they had passion for it, and could they explain it to someone not immersed in it. The topic was completely irrelevant. \n\nSkip forward to now as a masters dissertation supervisor and all I hear is how a student wants to do this topic because it will look good on the CV. No-one but you will care. Just do something you are genuinely interested in and work hard.\n\nTo more directly answer your question, I don’t regret a thing about my (PhD) dissertation because it was a fascinating subject and I learnt a lot of transferable skills in writing and explaining. I also learnt how to use LaTeX, which I don’t regret for a second and makes your dissertation look bloody fantastic! Also U don’t regret a thing because ten years later I barely remember it…",
      "author": "dangerroo_2",
      "created": 1634671890,
      "upvotes": 1,
      "replies": {
        "hhaot5y": {
          "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhaot5y/",
          "text": "haha, I too, know the joy that is LaTeX.\n\nMore seriously though, it's good to hear that this is indeed the case from someone who does interviews. This (passion about projects they have pursued) had been my perception/guess for that as well but it is good to hear it confirmed directly.\n\nI have just made my choice and I have come to the project which wouldn't be the most \"fancy\" one, but it definitely makes me happy to work on it!\n\nA question though: how long do topics \"look good\" anyway, AI seems to be in 10-years cycles of approaches. I'm guessing you are in another field, what is it like for you?",
          "author": "Laafheid",
          "created": 1634686052,
          "upvotes": 2,
          "replies": {
            "hhcmhpq": {
              "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhcmhpq/",
              "text": "I’m in Data Analytics, but am old enough to know that ML is just statistics with a shiny new badge! What goes around comes around.\n\nI did my PhD in simulation modelling (infectious disease modelling to be precise), which is very unfashionable nowadays, everyone wants ML or AI. Python seems to be a shortcut for all bad companies that don’t know what they’re doing for trying to find a data scientist. But what will never go out of fashion is good old analytical skills such as problem structuring and solving, and being able to explore data and say something useful about it by crowbarring datasets together. The exact analytical tool that sits on top of it is often much less important as I’m sure you realise. Companies just want someone who can handle their data and tell them something useful about it!",
              "author": "dangerroo_2",
              "created": 1634730386,
              "upvotes": 2,
              "replies": {
                "hhd09h1": {
                  "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhd09h1/",
                  "text": "That's good to hear!",
                  "author": "Laafheid",
                  "created": 1634737703,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hhcmitx": {
              "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhcmitx/",
              "text": "Btw, good luck with the project!",
              "author": "dangerroo_2",
              "created": 1634730406,
              "upvotes": 1,
              "replies": {
                "hhd04fp": {
                  "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhd04fp/",
                  "text": "Thanks!",
                  "author": "Laafheid",
                  "created": 1634737640,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh9wcfj": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hh9wcfj/",
      "text": "Maybe it’s not something I regret but rather something I could’ve done better - ask questions and request for feedback!! I tend to overthink and wonder if I’m being annoying if I were to ask something but honestly your supervisor is there to help you so don’t feel bad for using that valuable resource. \n\nAlso, not everything has to be perfect. For the longest time I didn’t want to send anything to my supervisor cuz I felt like my work wasn’t good enough yet. But again, they’re there to help you and once I started sending in drafts, the process got so much smoother and it’ll help w your confidence too.",
      "author": "throwawaythesadslut",
      "created": 1634673794,
      "upvotes": 1,
      "replies": {
        "hhap2z0": {
          "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhap2z0/",
          "text": "Yeah feedback is major.\nI've been giving fellow students feedback (both for my own learning about cool new subjects, as well as for them) for a while now, and have already set up an extra feedback group with people I know who do good work to give eachother extra feedback during the process as well.",
          "author": "Laafheid",
          "created": 1634686177,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhad8ka": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhad8ka/",
      "text": "I wish I was more organised with following up what I did each day, like keeping a little journal. Because sometimes I wished that I could have gone back to see how my thought process was about a particular thing etc.\n\nOne thing I _don't_ regret was choosing something I was really interested in, and challenging myself. My master thesis went on for a year and it's draining enough as it is, so I thought I might as well do and learn about something I love. This did cause me to change project last minute because I didn't believe in the first idea as much.",
      "author": "bearbutt1337",
      "created": 1634680756,
      "upvotes": 1,
      "replies": {}
    },
    "hhajdeu": {
      "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhajdeu/",
      "text": "Are you actually creating an AI or throwing training sets at a problem for machine learning?",
      "author": "Ashelth",
      "created": 1634683500,
      "upvotes": 1,
      "replies": {
        "hhalw7v": {
          "link": "/r/AskAcademia/comments/qbfa3e/what_do_you_regret_about_your_thesis/hhalw7v/",
          "text": "If you mean an AGI or something that would perform well on the Abstraction and Reasoning Challenge, ​then no.\nif you mean the standard datasets + some semi-plausible incremental improvement to get published, then I hope no.\n\nWhatever the project I decide on in the end, it will likely be some form of multi-task learning applied to create some practical/usefull (I would like it if it existed) application.",
          "author": "Laafheid",
          "created": 1634684683,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}