{
  "sid": "kmuu1s",
  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/",
  "title:": "Can an educated patient with a rare disease present and publish self researched interventions?",
  "text": "I am not a scientist or healthcare professional. I do have a very rare genetic disease with no therapy or cure. I am university educated ( arts degrees) and self researched and applied lifestyle interventions that were unexpectedly successful. As I track all data regarding my interventions, my medical team and I, as first author, published an article this Spring.\n\nAs I am acting outside the standard of care for someone with my disease, albeit with proven success, my medical team has now backed away from further research collaboration for ethical and liability reasons. As an informed patient, I am not bound by the same ethical or professional constraints of my medical team. Over the past year, I have progressed the interventions, still outside the standard of care, and I would now like to independently present the results as an N=1 study at a Conference in June. \n\nI am uncertain as to the appropriateness of this effort but feel very strongly that the research would be immensely valuable to other patients suffering with the same disease. Currently, there is no cure or therapy for this progressive and debilitating disease and my research might offer some hope for others. \n\nAny academic advice on strategies for navigating through the publication process would be very much appreciated.",
  "author": "adagio1369",
  "created": 1609302031,
  "updated": 1634081363,
  "over_18": false,
  "upvotes": 133,
  "upvote_ratio": 0.91,
  "comments": {
    "ghgvq14": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghgvq14/",
      "text": "Have you, as first author, and your medical team, as co-authors already published a case report in a peer-reviewed journal? Your post appears to indicate that you did so last spring.\n\nIf you've already get a paper out, even if it's a case report (that n = 1), then a conference is easier. Read up on the submission guidelines/requirements and prepare an abstract according to the req.",
      "author": "SmirkingImperialist",
      "created": 1609302673,
      "upvotes": 94,
      "replies": {
        "ghgxrsp": {
          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghgxrsp/",
          "text": "Thank you for your comments.\n\nYes, already published. I will be submitting an abstract for the Conference in June. While I am confident in the quality of the data, it is at best an N=1 observational study and I draw no conclusions on generalizability. It is more of a proof of concept for safety and tolerability in an effort to prompt further research efforts and to attract funding. \n\nIt is a provocative study that challenges the current Consensus Statement on clinical practice for this disease. I have no academic ally in place and my clinic has distanced itself from further collaboration. I am outside my comfort zone but the data stands and has value and should be brought forward I think. \n\nI will do my best. Thanks for the guidance.",
          "author": "adagio1369",
          "created": 1609303948,
          "upvotes": 41,
          "replies": {
            "ghh282o": {
              "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghh282o/",
              "text": "> Yes, already published in [redacted] journal in May. \n\nI think you answered your own question.\n\nA case report is about as far as this *can* go with an n of 1. Other than reporting the results at conferences, there really isn't a step forward from here other than organizing a larger study.\n\nI think the issue here is that, as you say, the topic goes against consensus. As such, it is going to be nearly impossible for an ethics review board to okay a study if it means one group will have to forgo proven clinical practice.",
              "author": "the_Q_spice",
              "created": 1609306894,
              "upvotes": 52,
              "replies": {}
            },
            "ghkdji5": {
              "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghkdji5/",
              "text": "Hey, OP, I just wanted to point out that by sharing the journal name and date of publication, you've made yourself very identifiable. You may want to vague up your post here a bit, and ask /u/the_Q_spice to remove their quote of that information.",
              "author": "Zoethor2",
              "created": 1609381606,
              "upvotes": 4,
              "replies": {}
            },
            "ghol98n": {
              "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghol98n/",
              "text": "You really need to edit out the journal and month.  Took me 30 seconds to find the paper.",
              "author": "Life_time_learner",
              "created": 1609482733,
              "upvotes": 1,
              "replies": {
                "ghpy7gf": {
                  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghpy7gf/",
                  "text": "Thank you for the advice. I have redacted the journal and month. I am not certain why this information would be harmful to me. I am already a published author, maintain a website and have no academic reputation to protect. My medical insurance already knows of my health status and I reside in a country that does not deny healthcare for a pre-existing condition. I am seeking an academic ally to assist in analyzing my data and I am trying to publish. Perhaps I am simply being naive. Can you explain what I am missing here?",
                  "author": "adagio1369",
                  "created": 1609514222,
                  "upvotes": 1,
                  "replies": {
                    "ghsue31": {
                      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghsue31/",
                      "text": "\"Can you explain what I am missing here?\"\n\nThere are some very disturbed people out there (sadly).  The information posted would enable someone to get your name and home town, a fairly simple search would get me (probably) your address, maybe a photo, plus a lot of your life history.  \n\nImportantly, the information links every single comment made by \"adagio1369\" to that person. Have you ever disagreed with anyone here?  Ever?  Posted anything that could be considered controversial, something that could be considered provocative?  \n\nYou would be amazed at the type of innocent comment that someone can take as a personal attack.",
                      "author": "Life_time_learner",
                      "created": 1609564801,
                      "upvotes": 1,
                      "replies": {
                        "ghu4kvc": {
                          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghu4kvc/",
                          "text": "Thanks for the clarification. It seems I am naive to the potential for abuse. While I think anyone with enough motivation can get pretty much any information they want on anybody, or make it up if they can’t, I don’t need to make it easy for them. Thanks.",
                          "author": "adagio1369",
                          "created": 1609604033,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "ghh0r9s": {
              "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghh0r9s/",
              "text": "[deleted]",
              "author": null,
              "created": 1609305898,
              "upvotes": -32,
              "replies": {
                "ghh8tm1": {
                  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghh8tm1/",
                  "text": "That's why it's a \"case\" report and not anything else.\n\nCase reports are very common from, for example, Emergency department. Patient showed up with condition X but was allergic to all the common treatments, typicaly prognosis 6 hours to fatality, then the ED did A, B, C and the outcomes were D, E, F, etc ...\n\nThose are all valid findings to report and there are journals that accept those reports. \"Case\".\n\nAfter all, the first publication on HIV, was a report of N=5.",
                  "author": "SmirkingImperialist",
                  "created": 1609312067,
                  "upvotes": 58,
                  "replies": {}
                },
                "ghh2p8g": {
                  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghh2p8g/",
                  "text": "Noted and accounted for. \n\nThe study has 100% internal validity and can be replicated. All data is recorded using commercially available apps. There has been no progress or pharmacological interest in this area of research for over 20 years. It is a very rare, debilitating and progressive disease with no therapy and no cure. My first child died from this disease and everyone in my family is impacted by it, so yes I have a bias.\n\nThe data stands.",
                  "author": "adagio1369",
                  "created": 1609307227,
                  "upvotes": 46,
                  "replies": {
                    "ghi791w": {
                      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghi791w/",
                      "text": "I realize you're responding to a dumb comment, but to say that it has \"100% internal validity\" is so superfluous that it might be considered misleading (if forexample put in submitted literature). There's also a convention to not really include \"case studies\" in the same category as a \"study\" understood in the epidemiological clinical sense. Just because \"clinical\" study types are sort of kept apart. For example i had a discussion  recently about a friends use of \"cross-sectional\" which has one meaning clinically and if said alone is often thought to refer to that case specifically. \n\nHowever, other preclinical/more heterogenous research can sometimes be published even from a single *animal* (especially if it is scoping research where you go: somethign weird happened in my mouse, look at these daily bloodgasses over 2 monnths), if you try to \"flatten\" the data in a different way - so there is absolutely nothing weird about it. \n\n On the other hand with the provisory statements you give in your initial post, it's obviously fine altogether, and very valuable information. \n\nAs a curious med student (although currently paused from clinical medicine to do research) would you mind linking your article?",
                      "author": "boriswied",
                      "created": 1609341858,
                      "upvotes": 20,
                      "replies": {
                        "ghi82qw": {
                          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghi82qw/",
                          "text": "Thanks for the response.\nI maintain a non commercial website at theeducatedpatient.ca and you can find the article under the for professionals tab, AMDC clinic. The study at issue progresses one aspect of the lifestyle interventions referred to in this article.",
                          "author": "adagio1369",
                          "created": 1609342315,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    },
                    "ghhbno9": {
                      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhbno9/",
                      "text": "Hell yeah.",
                      "author": "whoooooknows",
                      "created": 1609314662,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "ghil9am": {
                      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghil9am/",
                      "text": "Single subject (or N=1) research designs are perfectly fine if you have something that can be reliably measured repeatedly.  It has a long tradition in psychology through the study of behaviorism.  Granted it is mostly out of favor except in the area of Behavior Analysis, but it works fine.\n\nIf you do something like an ABAB design study where you take a series of baseline measures (A) then begin a treatment over time (B), then remove the treatment (A), then reintroduce the treatment (B), something like [this](http://acelab.qwriting.qc.cuny.edu/files/2015/03/Reversal-Pic.jpg).  If you see reliable changes in your repeated measures, that is pretty strong evidence of internal validity.\n\nMost biomedical researchers are not taught this methodology or it is so against anything else they have learned in statistics that they discount it.  You can even get some level of external validity through multiple baseline methods.  \n\nThere are drawbacks and limitations to N=1 research designs and not everything can be studied with this method. \n\nAll of that being said, don't quit a treatment if it is detrimental to your health just for the sake of proving something.",
                      "author": "manova",
                      "created": 1609349078,
                      "upvotes": 2,
                      "replies": {
                        "ghiwf2q": {
                          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghiwf2q/",
                          "text": "Low N studies are alive and well in the Personal Informatics and Quantified Self fields.",
                          "author": "fumblesmcdrum",
                          "created": 1609354546,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ghhehln": {
                  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhehln/",
                  "text": "It’s a case study.",
                  "author": "shytheearnestdryad",
                  "created": 1609317460,
                  "upvotes": 8,
                  "replies": {}
                },
                "ghhbomk": {
                  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhbomk/",
                  "text": "Don't know much about case studies do we",
                  "author": "whoooooknows",
                  "created": 1609314687,
                  "upvotes": 14,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ghhd39i": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhd39i/",
      "text": "Since you've already published your work in a peer-reviewed journal, under normal circumstances it would be quite normal to present it or an update of it at a conference as well.\n\nHowever, in your case there is the risk of the conference reviewers or (if you're accepted) audience getting the impression that you're some quack who is trying to publish in a medical conference without even any basic medical training.  Obviously in the paper this was easy to avoid with the inclusion of your medical team as co-authors.  Now that they aren't included, you will need to very carefully prepare your written and verbal material to navigate this situation.  \n\nWhen your write your abstract, make sure you heavily reference your own published work along with the rest of the literature in the field.  Use phrases like \"As we have demonstrated in our paper...\" more than would be typical in a conference abstract.  It might even be worth contacting the chair of the conference or session to explain the unusual authorship situation so they don't think you're omitting your previous co-authors because of some spat or unethical behaviour, but I don't know whehter this is likely to work out.\n\nIt's hard to tell from your post, of course, how much you yourself have mastered the language used by medical professionals amongst themselves, and whether you're familiar with the format and style of conference papers and presentations in this field.  Usually a grad student (for example) would get feedback and revisions from their supervisors on their first few talks before they do them, and they would of course have been also attending talks in the mean time.  You could consider asking one of your doctors if they would look over your material with you to ensure you are hitting the right target, if you feel this would be appropriate given your relationship.",
      "author": "polyphonal",
      "created": 1609316053,
      "upvotes": 34,
      "replies": {}
    },
    "ghhufte": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhufte/",
      "text": "The fact that your medical team has backed away after already publishing with you suggests they're finding this whole thing as weird as you're making it sound, and they just don't want to put their reputation on the line any more than it already is. Being experienced in how it feels to live with a disease =/= being an expert in objectively analysing it, or having the medical training to know *how* to analyse it.",
      "author": "Glaselar",
      "created": 1609333295,
      "upvotes": 21,
      "replies": {}
    },
    "ghhngc4": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhngc4/",
      "text": "You would have to be very careful how you frame the article, how you define the scope of the work, and how you establish and retain credibility throughout it (much more so than someone with a research degree in medicine or an allied discipline), but it is doable. \n\n\n.\n\n\n\nInstead of (or perhaps in addition to) presenting it as a case report which aims to offer an update and a very slight expansion to your previous work at a medically-oriented conference, you might consider publishing it within the framework of an auto-ethnography of your disease and current clinical standards at a more interdisciplinary venue - say, at a medical-anthropology or medical geography conference. I’m a historian and geographer, so I’m not sure exactly how to approach it, or if those are really the ideal venues, but that’s probably close to the track I’d take. \n\n\n\n.\n\n\n\n\n\nLike I said, I’d approach it very carefully. I might write it up in a way which: \n\n\na) reviews the available lit (including your previous article), \n\n\nb) speaks to the experience of the condition and the experience of treatment within current standards of care in your particular context, \n\n\nc)  highlights the need for an expansion of the available treatments in specific ways which address the tensions you pointed out in the previous section,\n\n\nd) speaks very tentatively to the potential benefits of your experimental treatments and your experiences with them in terms of a case report, and,\n\n\ne) emphasizes the importance of examining these and other potential treatments, acknowledges the ethical hurdles, and maybe suggests commonly accepted solutions to those or similar ethical hurdles to demonstrate a way forward for this research within the context of a more traditional clinical review process.\n\n\n\n.\n\n\n\n\nFair warning, even if you are incredibly careful in the construction and presentation of the paper, independent scholars get a tough reception at even the most welcoming venues, and the medical set isn’t usually known for being exactly that. \n\n\n\nGood luck!\n\n\n\n\n.\n\n\n\nEdit: /u/polyphonal makes a fantastic point about disciplinary genre conventions and their (perhaps unfortunately frequent) use as shibboleths. I would absolutely run this past a second set of trusted eyes with experience within whatever discipline you intend to publish/present your work.",
      "author": "TheSoundOfTastyYum",
      "created": 1609326718,
      "upvotes": 12,
      "replies": {}
    },
    "ghhawfh": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhawfh/",
      "text": "I think you should contact a Swedish woman, Sara Riggare. [webpage](https://www.riggare.se)\nShe is what i Sweden is called “spetspatient” and her reasoning is that she is the expert of her own disease, not doctors. \nShe is doing a PhD in this area and is very active in promoting patient centered care as well as actually talking to patients.",
      "author": "CoherentJorunn",
      "created": 1609313944,
      "upvotes": 39,
      "replies": {
        "ghhssmw": {
          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhssmw/",
          "text": "I'd argue that the old idiom about a lawyer representing themselves is appropriate here.",
          "author": "airwalker12",
          "created": 1609331892,
          "upvotes": 5,
          "replies": {
            "ghhv3a8": {
              "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhv3a8/",
              "text": "Well when the choice is between representing yourself and not being represented, the situation looks different. I study a relatively common disease that is heavily researched and well-funded although it is not lethal. My boss has a massive amount of lab space and lavish funding. Meanwhile, my best friend will probably die in a few years of a rare disease, and nobody knows anything about it because there just isn't any incentive for folks to research it unless they are personally affected. It took 20 years simply to get a diagnosis. \n\nI really hate when research scientists scorn the desperate efforts of abandoned people to add to the meager stockpile of understanding how to treat them. Are they supposed to just sit and calmly watch their whole family die painfully, because there isn't sufficient financial return on the investment into researching ways to help them?",
              "author": "ReclaimingLinden",
              "created": 1609333826,
              "upvotes": 27,
              "replies": {
                "ghhvc0b": {
                  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhvc0b/",
                  "text": "There is a vast difference between advocacy and claiming to be the de facto expert on a topic despite lacking the credentials to do so. I take no issue with the former, I think the latter is quite asinine.",
                  "author": "airwalker12",
                  "created": 1609334018,
                  "upvotes": -3,
                  "replies": {
                    "ghhzrkh": {
                      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhzrkh/",
                      "text": "I think you are conflating credentials with expertise. They are strongly correlated, but our Ph.D.s are not the guarantor of brilliance that we like to think they are.",
                      "author": "ReclaimingLinden",
                      "created": 1609337262,
                      "upvotes": 12,
                      "replies": {
                        "ghi0nrd": {
                          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghi0nrd/",
                          "text": "You're conflating intelligence with expertise.",
                          "author": "airwalker12",
                          "created": 1609337864,
                          "upvotes": -4,
                          "replies": {
                            "ghi2iu1": {
                              "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghi2iu1/",
                              "text": "No, I'm not. One can be intelligent without knowing anything about a subject. One can also be credentialed in a subject without having real expertise in it. You seem to be under the impression that intelligent people with an interest in the subject can only gain expertise in an area through a formal credentialing process, which is simply not the case. \n\nAs an example: I have a friend whose dissertation research was done studying caribou. The local farmers and hunters had long reported that the domesticated reindeer interbred with the native caribou, which was consistently dismissed by the credentialed administrators of the Forest Service. My friend found clear genetic evidence of hybridization with reindeer in the caribou. Biomedical research is not immune to parallel issues, and it is generally worth listening to people who have decades of experience observing or living with whatever it is that you are hoping to study.\n\nYou remind me of the folks in my old department when I was a professor. I quit for many reasons, one of them being that I didn't like everyone's absurd insistence on gatekeeping, generally to their own detriment. If academic scientists were more willing to admit that other people can know a thing, perhaps more progress could be made (especially for those of us in underrepresented populations, who suffer from being excluded from research studies and then not receiving appropriate treatments because nobody wants to do an RCT on a group that makes up about 1% of the population).",
                              "author": "ReclaimingLinden",
                              "created": 1609339066,
                              "upvotes": 7,
                              "replies": {
                                "ghi739b": {
                                  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghi739b/",
                                  "text": "Right, and someone without the requisite experience or training, no matter how intelligent just is not the expert on a pathophysiology just because it is happening to them. Sure, they are capable of advocating for themselves, but saying that they are the \"expert\" on said disease is just stupid.",
                                  "author": "airwalker12",
                                  "created": 1609341766,
                                  "upvotes": 6,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "ghi62i1": {
                      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghi62i1/",
                      "text": "Not claiming expertise on anything other than my lived experience which I have recorded in a meticulous and scientific manner. I make no apologies in seeking quality of life improvements when none were offered by my medical team. My single act of revolution was taking complete responsibility for my own health and being completely honest with my medical team. Otherwise, what is the point of the relationship?\n\nI am not responsible for their anxiety regarding my exercise of patient autonomy. The risk was mine to take.",
                      "author": "adagio1369",
                      "created": 1609341183,
                      "upvotes": 8,
                      "replies": {
                        "ghi79p8": {
                          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghi79p8/",
                          "text": "Nobody is saying you should not be seeking QOL improvements. What I (and many others before me have said) is that you are not qualified to claim expertise.  \n\n\nRecorded in a scientific manner, with  n =1. Do you not see the oxymoron in that statement?",
                          "author": "airwalker12",
                          "created": 1609341867,
                          "upvotes": 7,
                          "replies": {
                            "ghimmr4": {
                              "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghimmr4/",
                              "text": "Case studies in medicine (n=1) are published all the time.",
                              "author": null,
                              "created": 1609349748,
                              "upvotes": 4,
                              "replies": {
                                "ghiym4w": {
                                  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghiym4w/",
                                  "text": "By people who have years of experience and training and can accurately diagnose and describe the case.\n\nFurther, those case studies aren't considered best practice guidelines.\n\nAnd what do you mean by \"all the time\"? Statistics or real numbers, please.",
                                  "author": "airwalker12",
                                  "created": 1609355626,
                                  "upvotes": 1,
                                  "replies": {
                                    "ghj1x31": {
                                      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghj1x31/",
                                      "text": "\"All the time\" was just me using a vague expression - I do not know the percentage of articles in medical journals that are case studies, for instance; I was just trying to imply that it is not at all difficult to find case studies published in such journals. \n\nAlso, I agree that a) they are published with those with years of experience/training and technical knowledge and b) that they are not considered best practice.\n\nJust wanted to make the point that case studies are still published in peer-reviewed journals, implying that they are still viewed as \"scientific\" in some sense, and therefore, n=1 and \"scientific\" are not necessarily mutually exclusive, *in practice* (emphasis because statistically and theoretically insofar as generalizability and such are concerned, n=1 studies do lack scientific rigor and overwhelmingly focus on statistical outliers).",
                                      "author": null,
                                      "created": 1609357275,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "ghieb1w": {
                              "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghieb1w/",
                              "text": "You’d be more effective if you wrote in plain English. This is Reddit, not a peer-reviewed medical journal. Also, you might not intend it, but you come across as very informed but arrogant, which is off-putting to folks who are trying to evaluate your comments. If we were sparring with colleagues / or folks purporting to be colleagues your tone might be appropriate — but the patient has graciously and honestly admitted his lack of credentials, so what’s your point? He specifically asked for guidance, not condemnation.",
                              "author": "Merlinostregone",
                              "created": 1609345599,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "ghi8h0q": {
                              "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghi8h0q/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1609342531,
                              "upvotes": -2,
                              "replies": {
                                "ghi8tsi": {
                                  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghi8tsi/",
                                  "text": "Someone else can better understand the pathophysiology and requisite cell biology than you.",
                                  "author": "airwalker12",
                                  "created": 1609342722,
                                  "upvotes": 9,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ghhhzf7": {
          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhhzf7/",
          "text": "this is very interesting!",
          "author": "billscumslut",
          "created": 1609321040,
          "upvotes": 1,
          "replies": {
            "ghhk8s7": {
              "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhk8s7/",
              "text": "It certainly is. I don’t know her myself, but have read about her and read some of her studies. \nIt is an interesting perspective, especially when it comes to rare or chronic diseases. \n\n[Sara Riggare pub med-search](https://pubmed.ncbi.nlm.nih.gov/?term=sara%20riggare)",
              "author": "CoherentJorunn",
              "created": 1609323407,
              "upvotes": 5,
              "replies": {
                "ghkbuye": {
                  "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghkbuye/",
                  "text": "> Sara Riggare pub med-search\n\nCaitlin Berrigan has also written beautifully about her experience of living with hepatitis c, you should check her out",
                  "author": "billscumslut",
                  "created": 1609380739,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ghh65ub": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghh65ub/",
      "text": "Well not a academic advice but why don't you make a website and try to reach other people who been suffering from that disease and tell them about your experiences?",
      "author": "anavarzaaa",
      "created": 1609309830,
      "upvotes": 16,
      "replies": {
        "ghi57bg": {
          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghi57bg/",
          "text": "This is a good idea. Theeducatedpatient.ca. \n\nNot claiming expertise on the science, but I read broadly, deeply and intensely. I am a relentless researcher and read without discrimination. I have decent critical analysis skills. I have taken two upper level university courses and have over 1,200 scientific articles in my Mendeley library. \n\nI am aware of the closed and hierarchical structure of the medical and academic communities. I am aware that my efforts to further research in this field may be interpreted by some as unnatural and ill advised. \n\nThe data stands. My motivation is strong. I am seeking scientific collaboration, not suffocation.",
          "author": "adagio1369",
          "created": 1609340682,
          "upvotes": -3,
          "replies": {}
        }
      }
    },
    "ghifnz9": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghifnz9/",
      "text": "[deleted]",
      "author": null,
      "created": 1609346293,
      "upvotes": 13,
      "replies": {
        "ghiqcyx": {
          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghiqcyx/",
          "text": ">correlation, auto-correlation, and stochasticity.\n\nNot to mention survivorship bias.",
          "author": "rlrl",
          "created": 1609351574,
          "upvotes": 9,
          "replies": {}
        },
        "ghtpez1": {
          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghtpez1/",
          "text": "thats a bit harsh, my reading was that she just wants to share her experiences in the hopes that they will help someone else",
          "author": "Fkd1970",
          "created": 1609594076,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ghh3k4d": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghh3k4d/",
      "text": "At N=1, it will be very hard to draw conclusions from your case. Could you write and subsequently publish a case report on yourself? Sure. I’d read that and I’d find it interesting. It might make me ask questions for a well constructed research study applied to a larger group of people. \n\nMost physicians and scientists are not going to trust the results of a “research study” that’s based entirely on one individual. At the core, it’s a statistics problem. On a broader clinical level—you’re one human being. One. People are vastly different for a variety of reasons—it’s almost impossible to draw conclusions from an intervention preformed on a single individual. It is, however, possible to see that an intervention is worth studying on bigger playing field from one individual. Rare disease or not, a true clinical research effort among multiple physicians at multiple hospital centers could gather together a group of you for a research intervention. That’s something the scientific community would put more stock in. So write a case report with yourself as the patient. Publish it. Suggest in your discussion that your modus operandi be tested in a larger patient group.",
      "author": "Eab11",
      "created": 1609307840,
      "upvotes": 18,
      "replies": {}
    },
    "ghh1ld5": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghh1ld5/",
      "text": "Agree with the rest of the comments on case reports. \n\nWill you be monetizing your intervention? If so, might be worth it to keep quiet about it until you can collaborate with the industry to perhaps explore more robust evidence generation (randomized control trials).",
      "author": "adisturbedsoul",
      "created": 1609306460,
      "upvotes": 5,
      "replies": {}
    },
    "ghhapg9": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghhapg9/",
      "text": "Some journals have pretty strict criteria about what they will publish, and may require that a study was approved by an IRB, had an adequate sample size, etc. You may not personally require IRB approval to collect data on yourself, yet a journal could still require IRB approval to publish it. \n\nI think you will get more traction if you can develop a collaboration with a professional or team of professionals. However valuable your insights may be, there are good reasons that scientific norms and standards have been put into place, and attempting to bypass them will undermine your ultimate goal.",
      "author": "zinfandelightful",
      "created": 1609313761,
      "upvotes": 7,
      "replies": {
        "ghiq7kh": {
          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghiq7kh/",
          "text": "Yeah, research ethics and its oversight mechanisms isn't just to protect subjects from researchers, it's also to protect self-experimenters from themselves (and dissuade unsupervised self-experimentation in general).",
          "author": "rlrl",
          "created": 1609351501,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ghic70c": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghic70c/",
      "text": "While I would not expect to quickly change medical practice relating to your condition, and much as correlation is not the same as causation, your results should give researchers some direction to look to understand why your interventions have worked for you and whether they can be applied to other patients.\n\nThe worst that can happen is that the conference rejects your abstract.  You are still your best advocate.",
      "author": "shellexyz",
      "created": 1609344507,
      "upvotes": 2,
      "replies": {}
    },
    "ghihio3": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghihio3/",
      "text": "Yes! The obvious method is a case study, or other qualitative approaches, but do look up 'single case experiments' (n=1)!! Uch as an A-B-B-A design. That means you do the intervention (the A) you are using (e.g. exercise, a supplement) for a period of time, then stop, then start again, then stop. The periods of you not using the intervention (the B) acts as the control condition, and you compare your results of A to B to see if there is a significant difference or clinical significance, so it is essentially like a real experiment! They are very underused and more research needs to use them. You'd be a great example to use them. About the logistics of publishing as a  person not involved in a university, I am not so sure, but I am sure it is doable. Most things are doable if you put your mind to it!! Good luck.",
      "author": "JamesfEngland",
      "created": 1609347223,
      "upvotes": 2,
      "replies": {}
    },
    "ghjg8jh": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghjg8jh/",
      "text": "I  wanted to thank everyone who provided feedback on my question. I have learned a great deal from both sides of the argument and this has definitely helped me in refining my approach. I very much respect and appreciate your insight. Thank you.",
      "author": "adagio1369",
      "created": 1609364366,
      "upvotes": 2,
      "replies": {}
    },
    "ghjh3n2": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghjh3n2/",
      "text": "What you’re describing is unlikely to be considered “human subjects research” under the relevant regulations, at least in the US. Part of that requirement would be contribution to generalizable knowledge, and some IRBs will consider it a given that a single subject project isn’t generalizable and is not HSR.  You’ll want to look into IRB/HSR requirements wherever you’re thinking of publishing/presenting, as that may be a limiting factor for you or something you have to make a special case for.\n\nThis is likely to be an uphill battle for you.  It might serve you well to go looking for other academic and medical collaborators who would be willing to champion your project or use it as impetus for an actual pilot study.",
      "author": "Amaranthesque",
      "created": 1609364794,
      "upvotes": 2,
      "replies": {}
    },
    "ghke62s": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghke62s/",
      "text": "At the risk of seriously doxxing myself, a senior author on a manuscript in preparation whose first author is a patient. The patient started a facebook group for people with a rare disease, then started a small foundation, raised money, distributed grants. They then went to an independent IRB and got a protocol approved to collate clinical information from many patients with the same disease. Another physician scientist and I gave advice about how to define the disease (important in rare diseases: do you lump or split?) and what information was valuable to collate.",
      "author": "pteradactylitis",
      "created": 1609381922,
      "upvotes": 2,
      "replies": {}
    },
    "ghibbc6": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghibbc6/",
      "text": "Yes! Even if it's just to make more rigorous and theoretical what you already do. If everyone wrote papers about significant things in their lives, it would be good for society I imagine. Most papers get written by uninspired people in programs with a supervisor. Doesn't hurt to really care about yours. \n\nTry to remain objective about your hypothesis and solution spaces and that's all that can be asked. We use peer review for genuine editing. After you're done, or have main points down, find someone to look over it from academia who you have some relationship with, even teacher(if they won't hate it). Gl",
      "author": "LucasBeauchemin",
      "created": 1609344043,
      "upvotes": 1,
      "replies": {}
    },
    "ghiowcj": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghiowcj/",
      "text": "It really depends on the conference.  The medical conference I regularly attend does not accept case reports.  So you need to make sure to read all of the submission instructions for the conference.  Additionally, I would find the abstract book from the prior year and read other case reports so you can get a feel for the language use. \n\nI'm an abstract reviewer for this conference.  It used to be a blind review and I discovered I approved a high school student (who had a co-author from the local medical school).  But I would have never known this since it was written well.  The reviews for my conference are not blind now.  I don't know exactly how I would respond, but I would probably read an abstract from someone unaffiliated more closely. \n\nBut technically, there is nothing that says you have to be a PhD or MD to present research.  In my conference, undergrads, grad students, and people in industry with a variety of degrees all give presentations.  The science should speak for itself.  That being said, usually the biggest hurdle is that non-scientists sound like non-scientists.  The hands on part of science is like an apprenticeship where your mentor shapes you to take on the culture of science.  You write things or give talks and they give you feedback to shape your language.  You are also surrounded by other scientists that have been enculturated as well.  This is why many scientists have trouble talking to the public (press, TED-type talks, pop-science books, etc.), because it is a very different language.  This makes it very difficult for citizen scientists to break into publishing their work because the very nature of their language makes them appear to not know what they are doing. \n\nI do not say this to discourage you, but instead help you understand the uphill battle you face.  The fact that you have already collaborated on a published paper is a really big deal and maybe you have learned enough from that experience to strike out on your own.",
      "author": "manova",
      "created": 1609350858,
      "upvotes": 1,
      "replies": {}
    },
    "ghllyw3": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghllyw3/",
      "text": "Interventions? Probably not.\n\nMost measurements will be way too noisy to draw any sort of conclusions without lots of repetitions to average out the noise. Which is why most studies have a lot of repetition (in medical studies usually multiple participants).\n\nIf you can gather low-noise data and a lot of it (for example an ECG is what, 100Hz so 100 data points per second?) to establish a baseline before the intervention and then build a sufficiently good model of predicting what it will be and your intervention has a large enough effect to be completely different from that prediction... sure you can establish causality for your intervention.\n\nI doubt any of this is possible with \"lifestyle interventions\"... there simply isn't a way to get a good predictive model for your baseline because of all the noise.\n\nPhysicians/medicine is quite skeptical when you're not doing a traditional RCT using a standard protocol so you'll need some irrefutable evidence which is is very hard to obtain when humans are involved. Even then they will probably reject it because they don't understand what you have done rather than admitting they don't understand and recommending someone else review it.",
      "author": null,
      "created": 1609416944,
      "upvotes": 1,
      "replies": {}
    },
    "ghlmmoz": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghlmmoz/",
      "text": "You can put it on [ResearchGate.net](https://ResearchGate.net) or  [www.biorxiv.org](https://www.biorxiv.org/)",
      "author": "Such_Possession4553",
      "created": 1609417580,
      "upvotes": 1,
      "replies": {}
    },
    "gngx8u3": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/gngx8u3/",
      "text": "Ok, so this sounds stupid, if you were to reverse the treatment, would symptoms come back?",
      "author": "potatosword",
      "created": 1613339405,
      "upvotes": 1,
      "replies": {
        "gnhaqf8": {
          "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/gnhaqf8/",
          "text": "Not stupid, just unethical. I was sick before, and am asymptomatic now. Aside from scientific curiosity, what possible benefit or harm would come to me from reversing my protocol? A more interesting question to my mind would be to retest my load factors for the mtDNA mutation and compare pre and post intervention.  What if there was a significant change? What would that mean? My team has refused to do so thus far, so unlikely to happen but no ethical considerations in retesting I think.",
          "author": "adagio1369",
          "created": 1613346782,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghjvdxw": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghjvdxw/",
      "text": "What you're saying does sound amazing and valuable but since academia is a horrible nightmare hellscape where no genuine love or enthusiasm is permitted to flourish... yeah, I doubt it.  The rich people who own all institutions of higher learning can afford to cure basically every disease on the planet and they don't really care how us serfs live, die, and if anyone remembers.  I'm saying this as another disabled person.\n\nNevertheless, fucking do it.  Self publish.  Make YouTube videos.  Post it here.  Find disability and healthcare activists to listen.  Do a conference since those are easy to get than a paper.  Knowing how humiliating and debasing academic salaries are nowadays it would probably be a safe investment to forgo the academy entirely.  That's what I did.  I'm starting a small business I can use as my private research lab and I'll never have to go to another politically correct seminar about how to be inclusive of other-kin identities in my bore-logs and dream of eating lead.",
      "author": "boudica2024",
      "created": 1609372108,
      "upvotes": 0,
      "replies": {}
    },
    "ghih0pe": {
      "link": "/r/AskAcademia/comments/kmuu1s/can_an_educated_patient_with_a_rare_disease/ghih0pe/",
      "text": "Could you please tell me how science expands the knowledge base if they are only focussed on how many angels can dance on the head of a pin?",
      "author": "adagio1369",
      "created": 1609346973,
      "upvotes": -10,
      "replies": {}
    }
  }
}