{
  "sid": "qh0n2b",
  "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/",
  "title:": "Should I list papers under review in my CV?",
  "text": "Hello. When applying for jobs, should I list papers under review in my CV? I earned my PhD last year and I have a couple of papers still under review. Should I add them to my CV when applying?\nEdit: I am in linguistics",
  "author": "Normal_Kaleidoscope",
  "created": 1635352322,
  "updated": 1635456589,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {
    "hia38qf": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hia38qf/",
      "text": "Yes I would, and I have myself. At your early stage an extra paper or 2 on the list makes a big difference. Just put it in a seperate section after your publications under \"manuscripts in preparation\" or similar. But only include those where there's actually a reasonably mature manuscript / already submitted as you may be asked about them. I'm STEM in UK for reference",
      "author": "yutryin2lukgd",
      "created": 1635359970,
      "upvotes": 19,
      "replies": {
        "hia9woi": {
          "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hia9woi/",
          "text": "Thanks. Yes they were submitted. It was major revisions for both, which I have already worked on.",
          "author": "Normal_Kaleidoscope",
          "created": 1635362569,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hi9mpf6": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hi9mpf6/",
      "text": "This is field-dependent. In my field, yes (possibly in a section on \"work in progress,\" rather than publications), but I know from a previous thread that some STEM people warned against doing that.",
      "author": "CruxAveSpesUnica",
      "created": 1635353525,
      "upvotes": 12,
      "replies": {
        "hi9nn72": {
          "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hi9nn72/",
          "text": "Hi, thanks for your reply. I am in linguistics, by the way. I have seen that some people do it but I wasn't so sure",
          "author": "Normal_Kaleidoscope",
          "created": 1635353896,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hia5e3c": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hia5e3c/",
      "text": "The worst that someone can do is ignore it. People in science know how long it can take for peer review and having a paper on the record even if it's not published shows documentation of attempted productivity. Just make sure to label it appropriately.",
      "author": "ActionXPotential",
      "created": 1635360804,
      "upvotes": 9,
      "replies": {
        "hia9pp8": {
          "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hia9pp8/",
          "text": "Attempted productivity is exactly what I am trying to show... I have been waiting 1 year and more to receive the reviews for these two papers. Also I graduated in the midst of a pandemic which canceled some fieldtrips I had planned. I am an adjunct now so I don't have funds for publishing fees and I can't submit my papers to OA journals which have a faster turnaround (not the predatory ones of course). I should not disclose the name of the journals where the papers were submitted, right?",
          "author": "Normal_Kaleidoscope",
          "created": 1635362495,
          "upvotes": 3,
          "replies": {
            "hibr7sb": {
              "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hibr7sb/",
              "text": "> I have been waiting 1 year and more to receive the reviews for these two papers.\n\nSo this might be field-dependent, but there is no chance in hell in my field that the review process would take a year. Are you sure everything is going alright? In your shoes I'd be reaching out to the editor for an explanation.",
              "author": "Eltargrim",
              "created": 1635384821,
              "upvotes": 1,
              "replies": {
                "hicy19b": {
                  "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hicy19b/",
                  "text": "In my field it's not unheard of sadly... I was advised to submit my papers to high impact journals, and this is what I did. Luckily I have received the reviews from both journals and submitted my revisions. Now I am waiting to see if there's going to be another round of revisions",
                  "author": "Normal_Kaleidoscope",
                  "created": 1635411547,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hiak273": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hiak273/",
      "text": "The main issue is to make sure these papers are not listed with peer-reviewed publications, which looks like CV padding. You can list them separately in an \"under review\" section. This is sometimes done by junior scholars, but looks odd for senior scholars, at least in many fields. One downside, in addition to those mentioned by other posters, is that if your paper is not accepted than readers of your CV will know which journals rejected you. As practices are field dependent, why not talk with your advisor?",
      "author": "professorbix",
      "created": 1635366444,
      "upvotes": 6,
      "replies": {}
    },
    "hia666z": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hia666z/",
      "text": "I put all submitted papers on my CV.  But I am in a field where all my submitted papers have been accepted, except one we withdrew because the referee was an ass and the editor wouldn't tell him to get bent.",
      "author": "Spambot0",
      "created": 1635361108,
      "upvotes": 2,
      "replies": {}
    },
    "hiadzk4": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hiadzk4/",
      "text": "Might be different depending on the field, but one solution is to submit your paper to a preprint server, and then you can list the doi of the preprint on your cv. Advantage of that is that then people can actually look at your manuscript, and that is more informative than writing something is \"under review\".",
      "author": "Matthias_Rillig",
      "created": 1635364136,
      "upvotes": 2,
      "replies": {}
    },
    "hialims": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hialims/",
      "text": "I think this becomes  a lot more acceptable if your field has a preprint service.",
      "author": "OrbitalPete",
      "created": 1635366995,
      "upvotes": 2,
      "replies": {}
    },
    "hibjc59": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hibjc59/",
      "text": "Yes.  I typically use the phrase “submitted for publication,” but “under review” is just fine.\n\nBut whatever you do, _don’t_ list anything as “in preparation.” Until they are submitted, your draft papers are vaporware.",
      "author": "nrnrnr",
      "created": 1635381331,
      "upvotes": 2,
      "replies": {
        "hidiiq5": {
          "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hidiiq5/",
          "text": "Thanks. Makes sense!",
          "author": "Normal_Kaleidoscope",
          "created": 1635425671,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hibv3wv": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hibv3wv/",
      "text": "Not in your public cv, but in the one you send in for a job.",
      "author": "Pikaus",
      "created": 1635386523,
      "upvotes": 2,
      "replies": {}
    },
    "hi9px2g": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hi9px2g/",
      "text": "In CS, it is not advised to do so, because that would leak author information and that might cause advantages in double blind review.",
      "author": "AerysSk",
      "created": 1635354806,
      "upvotes": 2,
      "replies": {}
    },
    "hi9pkm8": {
      "link": "/r/AskAcademia/comments/qh0n2b/should_i_list_papers_under_review_in_my_cv/hi9pkm8/",
      "text": "It is recommended to include only accepted papers.But one can mention orally about under review papers.",
      "author": "heysharif",
      "created": 1635354665,
      "upvotes": 1,
      "replies": {}
    }
  }
}