{
  "sid": "i821xy",
  "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/",
  "title:": "I asked my prof for a letter of recommendation. She emailed back but I’m confused on what she’s asking from me.",
  "text": "I’m applying to law school in the fall. I asked a professor from undergrad to write a letter of recommendation. She said yes and then wrote:\n\n“It would be best if, when the time comes, you send me a draft of what you think needs to be covered on the basis of your interests, courses, and experience. I can’t speak to any of that, only your work in my course.”\n\nIs she asking me to give a brief explanation of my “interests, past courses, and experience”. OR is she asking me to give her a list of attributes to “judge” me on, like analytic skills, reasoning abilities, and so on? \n\nI just don’t want to send her the wrong thing and lead her to believe that she made a mistake in agreeing to this when I can’t follow simple directions.\n\nEdit: Thank you for all your replies. I really appreciate it! I will not be writing my own letter of recommendation, but as a handful of you suggested, I will give my professor a list/explanation of the skills I improved on in her class and how I believe it will aid in my future success in law school.",
  "author": "truly_anonymis",
  "created": 1597186264,
  "updated": 1634081238,
  "over_18": false,
  "upvotes": 154,
  "upvote_ratio": 0.97,
  "comments": {
    "g15le5n": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15le5n/",
      "text": "She is basically asking you to write the letter of recommendation for her and include things that you think are relevant.  Often times letter writers will do this so that the letter is personalized, highlights the most important topics that you think are relevant, and saves them time.  She wants you to write a draft of the letter.",
      "author": "edk208",
      "created": 1597187156,
      "upvotes": 143,
      "replies": {
        "g15ml7g": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15ml7g/",
          "text": "Thanks!",
          "author": "truly_anonymis",
          "created": 1597187747,
          "upvotes": 22,
          "replies": {}
        },
        "g170bmt": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g170bmt/",
          "text": "Not only that, but also she may not have remembered him or his achievements while students tend to remember.",
          "author": "madameruth",
          "created": 1597219322,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "g15lakx": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15lakx/",
      "text": "I think you write a draft of the recommendation letter and send it to her to check and revise.",
      "author": "redheadrois",
      "created": 1597187107,
      "upvotes": 320,
      "replies": {
        "g15yuy9": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15yuy9/",
          "text": "I could've had my students do this the entire time?!? 🤦",
          "author": "Theomancer",
          "created": 1597193953,
          "upvotes": 175,
          "replies": {
            "g162prw": {
              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g162prw/",
              "text": "It sort of depends on the level of your students. Delegating the task of writing a draft of a LOR to the recepient is common, but best done when they actually know what a LOR is supposed to look like. Few undergraduate students will have the experience to make this worthwhile. Certainly anyone applying for a junior faculty job should have a draft of their LOR pre-written before even asking their letter writers. If you are writing letters for someone like that, then yes, have them write drafts of their own.",
              "author": "sluggyfreelancer",
              "created": 1597195912,
              "upvotes": 68,
              "replies": {
                "g16d8vd": {
                  "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16d8vd/",
                  "text": "Would getting your hands on a prof written LOR (as I did) be advantageous? And subsequently modelling any drafts you might write as an undergrad student after the prof's writing and perspective?",
                  "author": "JustSkipThatQuestion",
                  "created": 1597201668,
                  "upvotes": 6,
                  "replies": {
                    "g1949qv": {
                      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g1949qv/",
                      "text": "Yes, but even better would be understanding what makes a good vs mediocre LOR.",
                      "author": "sluggyfreelancer",
                      "created": 1597263960,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "g16drcd": {
                  "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16drcd/",
                  "text": "When I was applying to graduate school I was asked to write a draft by 1-2 of my recommenders. One of the schools I applied to (and the offer I actually ended up accepting) made it clear that the applicant was to have no role in writing the letter. I ended up using less than ideal references because of this (a recommendation coming from one of those other people would have looked better, ya know). so somethin to consider",
                  "author": "am_juice",
                  "created": 1597201969,
                  "upvotes": 5,
                  "replies": {
                    "ggz8slo": {
                      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/ggz8slo/",
                      "text": "I'm in the same boat. I have what I believe would be a strong reference, however they asked me to draft the first letter, and one of the programs insisted that the student had no role in drafting the letter. How did you proceed with letting them know that you were going to ask someone else to write the letter instead? And did you still use them to write other letters for programs that didn't add this caveat?",
                      "author": "Wrhaight",
                      "created": 1608890777,
                      "upvotes": 1,
                      "replies": {
                        "gh39okj": {
                          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/gh39okj/",
                          "text": "yeah I did still use them for other programs; only one had that disclaimer. I had a good relationship with this person so I just said “hey, I’m not gonna use it for just X institution because they said I couldn’t have any role in the letter writing” and it was no big deal. I had 1 or 2 other recommenders on deck for obstacles like that.",
                          "author": "am_juice",
                          "created": 1609006985,
                          "upvotes": 1,
                          "replies": {
                            "gha3edp": {
                              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/gha3edp/",
                              "text": "Awesome! Thanks. Sending that email out to them tomorrow. It's crunch time, because the recommendation is due Jan 5th though...",
                              "author": "Wrhaight",
                              "created": 1609154406,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "g16m17t": {
              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16m17t/",
              "text": "As a grad student, please don’t do this. In my senior year I would *not* have known what to write and am eternally grateful to my recommenders for writing the letters. I am not skilled at assessing the strengths that grad schools would like to hear about, I’ve never written a rec letter and have no idea how it is done, and I would simply feel *bad* doing it myself - as if I were cheating somehow.\n\nFor you it probably is an annoying chore, for a student it would be weeks of writing, rewriting, and mild-to-moderate panic.",
              "author": "singingtangerine",
              "created": 1597207159,
              "upvotes": 26,
              "replies": {
                "g17em87": {
                  "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g17em87/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1597233195,
                  "upvotes": 3,
                  "replies": {
                    "g17nfur": {
                      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g17nfur/",
                      "text": "Exactly - the request for a draft is less about reducing work and more about having the referencee identify characteristics of their work and of the program(s) they are applying to. The process of doing this will make their application materials better since they will spend more time considering what they want and what they bring to the table. I particularly use this strategy for students who are planning for careers in which they might have to write LORs in the future - it's not something routinely taught as a course assignment. Often I read the draft and set it aside without using the student's writing at all.",
                      "author": "skleats",
                      "created": 1597239193,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g1615i6": {
              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g1615i6/",
              "text": "Yes. Anytime someone asks me for a referral or recommendation I always ask them to write what they want and send it to me for my review/edits.\n\nIt’s win-win for everybody.",
              "author": "YouGotLoopholed",
              "created": 1597195124,
              "upvotes": 16,
              "replies": {
                "g16c8v6": {
                  "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16c8v6/",
                  "text": "Is it though? Do students really have the ability to assess their strengths? Is that what mentors are so good at and why they are supposed to write the letters?",
                  "author": "Mallornthetree",
                  "created": 1597201095,
                  "upvotes": 37,
                  "replies": {
                    "g16sdma": {
                      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16sdma/",
                      "text": "I think it's a dick move.  You'd have to be a real narcissist to be able to praise yourself as effusively as you'd praise someone else.  I dunno, maybe that's just me.  But I think there are plenty of people like me who aren't comfortable doing it and I don't think recommendation letters should select against them.",
                      "author": "dampew",
                      "created": 1597211963,
                      "upvotes": 19,
                      "replies": {
                        "g1715ym": {
                          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g1715ym/",
                          "text": "It would be a dick move to get the student to write all those superlatives of praise, but that's not what their draft is for: it's to make sure that I include everything they need me to. (And, conversely, that nothing they want me to include is left out: can I remember their incisive comments in a tutorial three years ago?) \n\nThere's a big difference between praising a particular technical skill they learned from me, their general aptitude (say) working with data or writing clear reports, and their work ethic. And, frankly, getting the student to think about exactly what my letter is doing in the context of the entire application package is part of the point: some still think that a LoR is a magic amulet independent of the rest of their application, rather than something that can support specific points they want to make.\n\nThe bits saying “towering intellect … staggering genius … best I’ve seen in my teaching career … pls send Nobel by return post” I can add later. :-)",
                          "author": "aant",
                          "created": 1597220188,
                          "upvotes": 2,
                          "replies": {
                            "g18rbqo": {
                              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g18rbqo/",
                              "text": "Yes, that's why I usually have a meeting with the student to discuss their application, go over what and why they're doing and find out what kinds of things will be important to them.\n\nBut when I write a recommendation letter, one of the things I try to lay out is how a student differs from other students.  I think that's very difficult for a student to know.  Maybe a student helps me when I'm struggling at the board -- they might think nothing of it, but maybe I'm impressed.  A student falls asleep in class every morning, but I find out that it's because they're working two jobs and have to take the last train home every night; and they still get a B+.  A student manages to solve an accidental challenge problem, or happens to be especially good at some technique...  I think there are a lot of reasons why a student might not quite realize the things that make them special that a professor should be able to see.\n\nMaybe that's the stuff that goes into your last bit but it seems very difficult to write a recommendation letter without that stuff.  I dunno.",
                              "author": "dampew",
                              "created": 1597258029,
                              "upvotes": 2,
                              "replies": {
                                "g1d76pg": {
                                  "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g1d76pg/",
                                  "text": "Yes, that’s a very fair point. It clearly wouldn’t be fair to expect a student to provide those details. (Mind you, the bits they do provide might remind me of one!)",
                                  "author": "aant",
                                  "created": 1597350027,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "g16yv6r": {
                          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16yv6r/",
                          "text": "I think it is a logical thing to select for to some degree, so often in science you have to sell yourself, your study, your grant proposal etc.,  so it is an important skill to have. And please don't act like asking you to praise yourself a bit is like asking a blind man what color things are. You can just swallow your discomfort for a bit and write it anyway, it isn't an impossible task.",
                          "author": "n23_",
                          "created": 1597217875,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "g178okz": {
                      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g178okz/",
                      "text": "that's why a good letter writer then revises. I take out the stuff I couldnt really comment on, I rewrite into my own style, and I emphasize the good stuff in strong but not effusive language.",
                      "author": "100011101011",
                      "created": 1597227899,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "g177fpc": {
                      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g177fpc/",
                      "text": "For me and my colleagues it's more that we are really busy and many LOR requests ask for specific things from the sxhool(s) so it's quicker for them to write the initial draft so I can better ensure everything they need to be covered is covered.",
                      "author": "wh0datnati0n",
                      "created": 1597226658,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "g16dv1v": {
                  "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16dv1v/",
                  "text": "It’s very stressful on the student. Most of the time, I doubt my strengths and am stressed to the point that I don’t realize it. The one LOR I was allowed to read from a professor listed so many attributes I didn’t immediately realize in myself. That’s where a LOR helps because it asks for a 2nd perspective.",
                  "author": "truly_anonymis",
                  "created": 1597202028,
                  "upvotes": 29,
                  "replies": {
                    "g16ncop": {
                      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16ncop/",
                      "text": "I never ask students for a draft, but I ask them for a list of points that in their opinion I need to cover. Just so that I wouldn't forget, I tell them. And I promise, that I would also add other good things that I know and remember. I just really want you to think a bit ahead, and help me to strategize.\n\nTwo examples:\n\n1) A student applies to a dental school. Later this same  student applies to a masters in public health. In one case, I need to praise their dexterity, and ability to do microdissections. In the other case, I need to write more about their programming skills. That's helpful!\n\n2) A student is good in areas A and B, and professor X (no magic powers, sadly) knows about both A and B, while professor Y knows only about A. In this case it makes sense to tell prof X: by the way, I have another person to describe A a little bit, but I have nobody else to write about B. So please spend some time on it if you could.\n\nDoes it make sense?",
                      "author": "ampanmdagaba",
                      "created": 1597208087,
                      "upvotes": 16,
                      "replies": {
                        "g16s3nb": {
                          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16s3nb/",
                          "text": "I usually did this by having a conversation with the student rather than asking them to write a draft.",
                          "author": "dampew",
                          "created": 1597211740,
                          "upvotes": 9,
                          "replies": {}
                        },
                        "g16wt0x": {
                          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16wt0x/",
                          "text": "Yes it does. Thank you.",
                          "author": "truly_anonymis",
                          "created": 1597215911,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "g16x5j1": {
                      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16x5j1/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1597216235,
                      "upvotes": 1,
                      "replies": {
                        "g16x7i4": {
                          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16x7i4/",
                          "text": "I am applying to a handful law schools in CA.",
                          "author": "truly_anonymis",
                          "created": 1597216287,
                          "upvotes": 1,
                          "replies": {
                            "g16xp3u": {
                              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16xp3u/",
                              "text": "Oh, sorry. I don't have law school lors",
                              "author": null,
                              "created": 1597216754,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g16m8nm": {
                  "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16m8nm/",
                  "text": "I said this above but it would not be a win for me if my recommenders had done it. At 21 I did not have the skills to write letters like that, nor the knowledge of what was expected. I was stressed just thinking that my professors might make me write the letter.",
                  "author": "singingtangerine",
                  "created": 1597207303,
                  "upvotes": 5,
                  "replies": {}
                },
                "g16s49m": {
                  "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16s49m/",
                  "text": "No, it's not win win for everybody. Professors are (or should be) more skilled in writing recommendation letters and, theoretically, know what a PhD program wants since they have one. Students don't. This only benefits the professor, not the student.",
                  "author": "roseofjuly",
                  "created": 1597211754,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "g177bf4": {
              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g177bf4/",
              "text": "Super common.",
              "author": "wh0datnati0n",
              "created": 1597226537,
              "upvotes": 1,
              "replies": {}
            },
            "g16s1wq": {
              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16s1wq/",
              "text": "Please don't.",
              "author": "roseofjuly",
              "created": 1597211699,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "g15lmzx": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15lmzx/",
      "text": "Some professors want you to list out for them the qualities, attributes, accomplishments, etc. that you would like them to highlight in the letter.\n\nFor some professors, this is because they may not know or remember you in great detail, but still want to write a quality letter. On the other hand, one professor I know extremely well asked me to do this because he wants his letter to be as effective as possible - and I know what the program wants to see of me better than he does.",
      "author": "sanitizedhandbasket",
      "created": 1597187279,
      "upvotes": 62,
      "replies": {
        "g15yoiw": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15yoiw/",
          "text": "Yes, this. Things that you would like them, ideally, to touch on or to highlight.",
          "author": "jadynfirehawk",
          "created": 1597193864,
          "upvotes": 10,
          "replies": {}
        },
        "g15mgj7": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15mgj7/",
          "text": "Thank you! This helps a lot!",
          "author": "truly_anonymis",
          "created": 1597187685,
          "upvotes": 7,
          "replies": {}
        },
        "g16krdb": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16krdb/",
          "text": "This is the right interpretation. I'm surprised is not the top comment. OP, follow this!",
          "author": "jucamilomd",
          "created": 1597206290,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g15lgn6": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15lgn6/",
      "text": "She is telling you to write a draft of the letter covering all of the things she mentioned, because she doesn’t know those things about you.",
      "author": "bigrottentuna",
      "created": 1597187190,
      "upvotes": 38,
      "replies": {
        "g15mhpy": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15mhpy/",
          "text": "Thanks so much!",
          "author": "truly_anonymis",
          "created": 1597187702,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g15lfv3": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15lfv3/",
      "text": "Prof here. She wants to write a strong and specific letter for you. This is a normal request of students going to grad school or asking for a job rec.",
      "author": "melissalaughingg",
      "created": 1597187180,
      "upvotes": 38,
      "replies": {
        "g15mj9o": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15mj9o/",
          "text": "Thank you!",
          "author": "truly_anonymis",
          "created": 1597187722,
          "upvotes": 6,
          "replies": {}
        },
        "g16glam": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16glam/",
          "text": "Question for a professor: I always offer to write letters on behalf of my professors if I ever ask for a letter from them. I’m still in grad school, but to date, I’ve written 4 professors letters of support when they were up for an award, tenure, and promotions. I’ve made other offers to professors that wrote me letters in the past and they never took me up on it. Is it unusual for a student to offer to do this? Do professors ever have to seek student letters of support or is that a conflict of interest?",
          "author": "Thats-What-She-Shed",
          "created": 1597203650,
          "upvotes": 3,
          "replies": {
            "g1cm83d": {
              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g1cm83d/",
              "text": "Those letters are solicited from students when needed. We often get to suggest students who could write detailed letters - just as you know which faculty can write you strong letters, so do we. \n\nSo the offer isn't necessary and would make me at least feel a little awkward, albeit grateful for the thought. It turns the LOR I'm writing for you into a quid pro quo, which is a little icky. And if I say no thanks, I feel bad for turning down a nice offer from you.\n\nNow, if you want to spontaneously write a letter to an awesome professor's chair saying why they're awesome, that's a different deal and can sometimes help us out. Just don't do it for everyone or it loses its punch.\n\nAnd of course we all love to receive personal thank you notes AFTER we've done what we can for you.",
              "author": "HomunculusParty",
              "created": 1597340565,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g15xkin": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15xkin/",
      "text": "When students ask me for a letter, I ask for a brag sheet: experiences, accomplishments, honors., etc...anything they would like highlighted in the letter. This lets me go beyond what I know about them in the college classroom and weeds out students who ask every professor they know for a letter.",
      "author": "CAinCa",
      "created": 1597193303,
      "upvotes": 12,
      "replies": {
        "g16e8h8": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16e8h8/",
          "text": "What if a student’s only accomplishment is taking classes & graduating? Other than getting good grades, what would you consider an accomplishment? Every student who wants to pursue education after undergrad needs 3+ LOR and it doesn’t help when an A in their class isn’t enough.",
          "author": "truly_anonymis",
          "created": 1597202242,
          "upvotes": 4,
          "replies": {
            "g16g3vu": {
              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16g3vu/",
              "text": "I think there are a lot of ways to think about accomplishments and I have met a lot of students who really sell themselves short on what they have done in the midst of taking classes. Here’s an example- I had a student who, when I asked what other things she had done, she said  she started a study group for her cohort. And she didn’t think that was something that could be included in a letter of recommendation. \n\nWe kept talking about it and she told me that it was important to her to include anyone who wanted to be in it, she took a leadership role and she communicated with the entire group, held regular study sessions, and assigned different responsibilities to members. Every graduate-level program in every discipline is looking for someone who does these things. \n\nYou’re doing more than you realize.",
              "author": "CAinCa",
              "created": 1597203356,
              "upvotes": 9,
              "replies": {
                "g16go3y": {
                  "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16go3y/",
                  "text": "Thank you. This makes me feel better about the whole situation.",
                  "author": "truly_anonymis",
                  "created": 1597203699,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "g1671sw": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g1671sw/",
          "text": "This is much better than asking a student to write their own letter. I'm surprised that others don't see that as unprofessional.",
          "author": "biwei",
          "created": 1597198239,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "g15ty4x": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15ty4x/",
      "text": "I’m a Prof who writes reference letters for students, mostly for advanced graduate programs or scholarships. Sometimes the letters are for recent graduates, but sometimes it is for past graduates (5+ years). I always ask for a CV/resume and a copy of their application essay. I then read those and call them back and discuss strategy about what attributes they want highlighted. I especially like having the application essay so I don’t accidentally say something contradictory. Some professors ask for a draft or bullet points to get to the same place.",
      "author": "virtualprof",
      "created": 1597191455,
      "upvotes": 11,
      "replies": {
        "g15uft1": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15uft1/",
          "text": "I see how that can help, but in my case I’m asking a professor who’s class just finished last week. I’m not applying to law school until fall (the earliest - maybe winter) so I don’t have a resume/application prepared.",
          "author": "truly_anonymis",
          "created": 1597191707,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g15qa48": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15qa48/",
      "text": "I would say it a little of both. Presumably your other application materials paint a specific picture of you as a candidate and that you are using particular experiences, interests, and skills as evidence of your suitability for law school. I think that your recommender is asking for you to put some of this in writing so that she can write a letter that lays out a consistent narrative with your other application materials.\n\nSo, I would include information that is reinforces and complements your other application materials.",
      "author": null,
      "created": 1597189583,
      "upvotes": 6,
      "replies": {
        "g16emxb": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16emxb/",
          "text": "Thanks for your comment! I will definitely be doing this!",
          "author": "truly_anonymis",
          "created": 1597202475,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g160oj4": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g160oj4/",
      "text": "She is definitely asking you to please draft the entire letter. Not uncommon, as someone at your level should be able to do a pretty good job selling yourself. For tips, you can google top attributes to mention in a law school recommendation--find the rec letter tutorials for profs and go from there.",
      "author": "IndieAcademic",
      "created": 1597194889,
      "upvotes": 3,
      "replies": {}
    },
    "g16tp9q": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16tp9q/",
      "text": "I don’t think she’s asking you to write a draft of the letter. I think she’s asking you to talk a bit about what your interests etc. are, since she doesn’t know.",
      "author": "lala__",
      "created": 1597213094,
      "upvotes": 2,
      "replies": {}
    },
    "g15z6pg": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g15z6pg/",
      "text": "Either give her a draft and have her edit or give her a list of items/qualities and what you want her to say about them.",
      "author": "lickmysackett",
      "created": 1597194121,
      "upvotes": 4,
      "replies": {}
    },
    "g163xzk": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g163xzk/",
      "text": "She’s asking you to draft the letter. She’ll make a few changes or add things here or there. Write a complete letter and send it to her. Include anything you want covered, including your work with her. This is typical. I have written many of my own letters over the last decade.",
      "author": "Eab11",
      "created": 1597196566,
      "upvotes": 2,
      "replies": {}
    },
    "g16rd6g": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16rd6g/",
      "text": "I just read your edit in which you say you will not write a draft but instead give a list of interests and topics. Do not do this! Since your professor explicitly asks for a draft, write a draft! As a professor, it is very annoying if you give students highly specific instructions only to have students do something else entirely. Trust me: If she asks for a draft, she wants a draft, not a list of interests from which she has to compose a draft.",
      "author": "Marky_Marky_Mark",
      "created": 1597211137,
      "upvotes": 2,
      "replies": {
        "g16sjg4": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16sjg4/",
          "text": "Well one, she didn't really ask for a draft of the letter - she asked for a draft of the specific things the OP thinks need to be covered in the letter. That's quite different.\n\nSecondly...graduate programs want to know what professors think of the applicant, not what applicants think of themselves with a professor's name signed at the bottom. That defeats the whole purpose of a letter.",
          "author": "roseofjuly",
          "created": 1597212096,
          "upvotes": 7,
          "replies": {
            "g16wvbo": {
              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16wvbo/",
              "text": "Well said. Thank you.",
              "author": "truly_anonymis",
              "created": 1597215969,
              "upvotes": 2,
              "replies": {}
            },
            "g16u6zw": {
              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16u6zw/",
              "text": "Fair enough, good points.",
              "author": "Marky_Marky_Mark",
              "created": 1597213529,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g166xwk": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g166xwk/",
      "text": "Be *very* careful here. A lot of people have already commented that your prof is asking you to write a \"draft.\" Oftentimes these \"drafts\" aren't drafts but will be the letter a prof submits, maybe with a few additions. It's common practice, but HIGHLY unethical. \n\nDoes your prof understand what you have gained from each extracurricular activity you've done? No. Do they understand every skill you've developed during your education and life as a whole? No. Can they talk about how experiences you've had have helped you grow and mature? No. And that's not their job. Those are stories *you* get to tell in a personal statement. \n\nThe best thing you can do is provide a detailed CV for your prof to reference. Highlight projects you've worked on, group work you've managed, unusual skills you've gained and ask your prof to talk about how they see those skills in your interactions with them and how, based on their relevant expertise, those skills will serve you well in your future pursuits. You can provide details that are extra from what you include in your CV but you should not be writing a draft for them. \n\nI am honestly appalled at the people here saying this is an acceptable practice because it is *NOT* and should not be normalized.",
      "author": "fly-not-fox",
      "created": 1597198180,
      "upvotes": 2,
      "replies": {
        "g16d5j7": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16d5j7/",
          "text": "Thank you for your comment. I was never planning on writing my own letter of rec, despite what the comments said. I was planning to let the prof know more about myself, why I chose to apply to law school, and what skills I improved on in her class. What she decides to do with those details is up to her. I honestly hope that it’s enough, and will give her what she needs to write a genuine (and positive) letter on my behalf.",
          "author": "truly_anonymis",
          "created": 1597201613,
          "upvotes": 3,
          "replies": {
            "g178zcu": {
              "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g178zcu/",
              "text": "I'm very glad to hear that, that sounds like the perfect approach to this situation. Best of luck to you in your application and studies and thank you for acting with integrity.",
              "author": "fly-not-fox",
              "created": 1597228190,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g16hbyi": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16hbyi/",
          "text": "\\+1. I'd actually never heard of this. I went to a small uni where I had at least a handful of professors knew me well inside and outside of class, so I've never had anyone ask me to write my own LOR. Aside from the fact that this defeats the whole point of LORs, it just seems extremely dishonest to write your own - especially when you have your personal statement to sell yourself.",
          "author": null,
          "created": 1597204104,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g16g2z1": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16g2z1/",
      "text": "They’re asking you to essentially write the letter. The first time that happened to me it totally threw me for a loop.",
      "author": "herpslurp",
      "created": 1597203341,
      "upvotes": 1,
      "replies": {
        "g16ggta": {
          "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16ggta/",
          "text": "What if I just write out my reasons for wanting to go into law and talk about how I think this professor’s class helped me improve the skills I believe are necessary for it? At least then I will have offered info that she can use to write the letter.",
          "author": "truly_anonymis",
          "created": 1597203574,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g16mi9j": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g16mi9j/",
      "text": "She is tell you to write the letter in a way that will give you best chance of being accepted and then she will put her name on it",
      "author": "PBandJammm",
      "created": 1597207490,
      "upvotes": 1,
      "replies": {}
    },
    "g165rjc": {
      "link": "/r/AskAcademia/comments/i821xy/i_asked_my_prof_for_a_letter_of_recommendation/g165rjc/",
      "text": "Send a draft and she will edit it. This is common",
      "author": "isiik",
      "created": 1597197549,
      "upvotes": 1,
      "replies": {}
    }
  }
}