{
  "sid": "olz8ss",
  "link": "/r/AskAcademia/comments/olz8ss/switch_masters_departments_stay_where_i_am_or/",
  "title:": "Switch masters departments, stay where I am, or leave? How will my choice affect my future in academia?",
  "text": "Hi! Sorry this is really long. TLDR at the end.\n\nMy goal is to get a PhD, haven't decided if I want to stay in academia or move to industry.\n\nCurrently, I am halfway through a two year masters in entomology. I am interested in a very specific research area - insect virology. My undergrad was in microbiology/biochem, no previous entomology coursework. \n\nI have a research assistantship in an excellent insect virology lab, and my thesis is almost entirely focused on the \"virology\" compared to the \"insect\". I love my lab and my research- I'm super interested in my project, making good progress on my thesis. I do very well at the bench. \n\nMy issue with the entomology masters is that I hate the coursework. I find that most of it isn't applicable to my area of interest, and I'm not excited by it at all. I really dislike collecting insects (major grade component in many classes). I've only genuinely enjoyed one course, insect physiology, that was very biochem heavy (also the only course I got an A in).\n\nMy grades are bad overall (2.9 GPA). I had to appeal to stay in the program for not meeting the 3.0 GPA minimum. There's no way I'll get another chance if my GPA doesn't improve - I'd get kicked out. \n\nI can attribute my bad grades to a variety of factors, some of which I have already fixed (improved time management and mental health) but I mainly think it stems from a lack of genuine interest in the material. I am much more interested in the courses the microbiology department offers. I believe that my bad grades are mainly because I'm in the wrong department, and I believe that I am fully capable of succeeding in the right graduate program.\n\nI discussed this with my PI. They suggested switching my masters to microbiology, while continuing my thesis in their lab. I loved the idea.\n\nThe problem: my institutions microbiology department only officially offers a research based PhD, which my PI doesn't recommend trying for right now. They also have a non-thesis masters program, but I would have to stop doing research and pay for the degree myself which I definitely don't want to do.\n\nAfter emailing the micro department coordinator about a masters with thesis option, they told me that \"in special cases if a faculty member would like to directly admit a thesis MS student to their lab, the department is willing to consider that, but it is fairly uncommon\". My PI is willing to register with the micro faculty in order to try this, but it would still depend on if the micro department accepted me or not - I'm worried my poor entomology grades will count against me.\n\nI'm thinking of staying in the entomology masters if I can't switch. I want to try my hardest to improve my GPA and not give up because there's a chance of failure. I also love my research project and don't want to quit it- I'm willing to suffer through courses I hate if it means I can continue work in this lab.\n\nMy reservation on this option is that I still hope to continue on with graduate studies, whether that's now or in the future. Since there is a chance of failure, would it be better for future graduate admissions to withdraw before I can (maybe) officially get kicked out?\n\nThank you so much for reading, I appreciate any advice you have to offer!\n\nTLDR; Chose the wrong department for my masters, small chance of being able to switch departments. If I can't switch, wondering which would look better for future graduate admissions - keep trying with the possibility of getting kicked out or withdraw before that can happen.",
  "author": "goosegurl",
  "created": 1626504689,
  "updated": 1634082517,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "h5hrbp5": {
      "link": "/r/AskAcademia/comments/olz8ss/switch_masters_departments_stay_where_i_am_or/h5hrbp5/",
      "text": "I'm in a completely different field, but based on what you're saying it sounds to me like pursuing the microbio degree is a good option. Grades may hold you back, but you have the advantage of being able to talk directly to the department and explain that that's precisely why you want to switch. You can point to the courses with more of a Biochem/microbiology focus and in your undergrad to support that you can succeed in that environment, and have your PI reference your lab work skills. Nothing is guaranteed, but you don't lose anything by pursuing it. Both improving your grades and enjoying all of your work come with direct benefits for future applications for PhDs (where \"I'm good at classes that interest me\" may be less competitive), and indirectly as mental health and interest in your work improves. It seems you have everything to gain by trying to switch, so I'd say go for it.\n\nIf it doesn't work out, as you say, it's a tougher decision. Lower grades make it much more difficult to get in, especially to very competitive programs. If you have good research experience and good references (and publications, if possible), you can probably still get accepted to a decent program if you set your expectations reasonably. It's something to address in a cover letter for sure, to give context about your interests and emphasize where you've been most successful in the past (and how those two things align with what you're applying for). The research generally tends to trump academics at the graduate level, so if you're happy with the research it may be better for you to tough it out if you can't jump to a better program, and work on a really good PhD application to something that is more aligned with your interests.",
      "author": "xenotranshumanist",
      "created": 1626506283,
      "upvotes": 3,
      "replies": {}
    }
  }
}