{
  "sid": "i750km",
  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/",
  "title:": "Is it necessary to mention that the order of names in the paper is alphabetical when including it in a CV?",
  "text": "I am an undergraduate student (in Physics). My internship work is being published as a part of a larger paper with 7-8 authors. The paper is quite long (approx 25 pages) and my work forms only 1 section of it (1-1.5 page). However, they are ordering the authors alphabetically because of which I am becoming the 'first author'. The paper itself is quite broad comparing 2 different techniques and I have not interacted with any other author(except my guide) nor do I know what the rest of the paper is about. My knowledge is limited to technique 1 and my result is being included as an improvement to previous results of technique 1 with a bit of extra analysis.\n\nWhen applying to grad school or in the future, should I explicitly mention that ordering is alphabetical in my CV or whenever I mention this paper? I don't want a potential advisor (actually anyone) misjudging the entire paper as my work. Also, when I'm sending 'I'm interested to work with you' mail and bring up this paper-should I mention that it's ordered alphabetically?\n\nThanks in advance!",
  "author": "loopdaed_mI",
  "created": 1597066827,
  "updated": 1634081815,
  "over_18": false,
  "upvotes": 113,
  "upvote_ratio": 0.99,
  "comments": {
    "g0zz8ut": {
      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g0zz8ut/",
      "text": "[deleted]",
      "author": null,
      "created": 1597071713,
      "upvotes": 167,
      "replies": {
        "g1027em": {
          "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g1027em/",
          "text": "[deleted]",
          "author": null,
          "created": 1597073238,
          "upvotes": 41,
          "replies": {
            "g109v5g": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g109v5g/",
              "text": "I work in two fields one of which alphabetizes and the other does by contribution.  I just have a footnote to say which is which.",
              "author": "e_to_the_pi_i_plus_1",
              "created": 1597077067,
              "upvotes": 11,
              "replies": {}
            },
            "g11x4yk": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g11x4yk/",
              "text": "For what it's worth, a bullet point might take up space/not look as aesthetically pleasing. You might also consider something like \"Author 1, Author 2, Author 3 (alphabetical). Year. Title and so on.\"\n\nReally, don't feel constrained by this. It won't hurt you to include it, so you might as well; but, don't worry about it too much.",
              "author": "WrestlingStuffGuy",
              "created": 1597106575,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "g0zuxas": {
      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g0zuxas/",
      "text": "I'm just surprised that your discipline apparently doesn't have a standard for ordering names on a publication that would be known to anyone in the discipline.",
      "author": "thegreenaquarium",
      "created": 1597069398,
      "upvotes": 81,
      "replies": {
        "g0zxo3p": {
          "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g0zxo3p/",
          "text": "[deleted]",
          "author": null,
          "created": 1597070889,
          "upvotes": 24,
          "replies": {
            "g0zxrgr": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g0zxrgr/",
              "text": "per this guy that I dated, names are alphabetized in physics, but you should def ask\n\nedit: unsubscribe from physics citation facts ahaha",
              "author": "thegreenaquarium",
              "created": 1597070940,
              "upvotes": 34,
              "replies": {
                "g0zz81z": {
                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g0zz81z/",
                  "text": "Most of the physics papers I've seen were ordered by contribution. So I guess it depends on the particular sub-field as well.",
                  "author": "SamStringTheory",
                  "created": 1597071702,
                  "upvotes": 35,
                  "replies": {
                    "g101au4": {
                      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g101au4/",
                      "text": "At least in my subfield, experimental biophysics, the authors are ordered by contribution with the PI last. But I have seen that very large collaborations in other subfields, like [ATLAS](https://en.wikipedia.org/wiki/ATLAS_experiment), will arrange the authors alphabetically.",
                      "author": "capellablue",
                      "created": 1597072777,
                      "upvotes": 19,
                      "replies": {}
                    },
                    "g10falc": {
                      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10falc/",
                      "text": "They're also mostly listed by contribution in my field too, although I have seen a select few in alphabetical, so I feel pretty safe saying there's no standard.",
                      "author": null,
                      "created": 1597079714,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "g10vabe": {
                      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10vabe/",
                      "text": "I published in astrophysics journals and it was always alphabetical. So it appears to be even subfield specific.",
                      "author": "downsideleft",
                      "created": 1597087394,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "g106end": {
                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g106end/",
                  "text": "That's only true in big collaborations. The predominant standard in physics is to order by contribution + PI as the last author.",
                  "author": "tpolakov1",
                  "created": 1597075360,
                  "upvotes": 8,
                  "replies": {}
                },
                "g10t9cc": {
                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10t9cc/",
                  "text": "That's more a size thing. It doesn't make much sense to do things by \"contribution\" if you're in a collaboration that's big enough for one guy to be in charge of the wiring on one detector (eg LHC). I'm honestly surprised to hear that an 8 author paper is doing it alphabetically. Contribution with PI as last author is by far the most common choice in physics outside of papers with hundreds of authors.",
                  "author": "Mezmorizor",
                  "created": 1597086423,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "g10xlo3": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10xlo3/",
              "text": "I am in Astronomy, and most papers are ordered by contribution. This also the norm for most other physics fields. The only exception I have seen is in nuclear physics papers that have an incredibly long author list.",
              "author": "quantum_riff",
              "created": 1597088496,
              "upvotes": 1,
              "replies": {}
            },
            "g100fvx": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g100fvx/",
              "text": "Very easy to check if that is the case, isn't it?",
              "author": "aleph04",
              "created": 1597072337,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g10jciy": {
          "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10jciy/",
          "text": "Actually in Physics it's very dependent on the kind of project. Small project within a single institution? Authors are listed in order of contributions. Large multi-institutional collaborations, particularly the kind with dozens (if not hundreds) of authors? listed  alphabetically.\n\nAt some point there must be a gray area between the two extremes of \"*grad student + advisor*\" and \"*CERN pub with dozens of universities and [5154 authors](https://www.nature.com/news/physics-paper-sets-record-with-more-than-5-000-authors-1.17567)*\", and that's where clarification comes in handy.",
          "author": "ThePhysicistIsIn",
          "created": 1597081651,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g0zrvs6": {
      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g0zrvs6/",
      "text": "I think it would be honest, otherwise they will assume you were the principal writer. \n\nPeople usually do this when they want to make sure their contributions are recognized, not to underplay their role though. It wouldn’t be a national crime to leave it unsaid, even if not terribly honest. Most people wont check very deeply when reviewing your CV.",
      "author": "ThePhysicistIsIn",
      "created": 1597067674,
      "upvotes": 17,
      "replies": {
        "g10licb": {
          "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10licb/",
          "text": "It’s not dishonest at all to not mention it. If OP’s field expects authorship to be alphabetized, then it is redundant to remark on it. The bigger issue, to my mind, is authoring a paper for which OP knows nothing of 85% of the material. In my field and I dare say most (all?) scholarly publishing requires that ALL authors stand by ALL the findings of the study. If there is fraud or malfeasance in the article, ALL authors are responsible for it.",
          "author": "Frogmarsh",
          "created": 1597082680,
          "upvotes": 7,
          "replies": {
            "g10mez6": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10mez6/",
              "text": "In my experience, alphabetization is not universal and is only for large, multi-faceted and multi-institution contributions where tiering by contribution is unfeasible. From their description, OP’s paper falls in a gray zone (only 8 authors, but multiple projects and teams) such that there’s a good probability that it will be unclear to the person reading it.\n\nAnd even if it were clear - specifying it will not detract from OP. The only way OP gains from not specifying is if it leads a reader to conclude OP was the principal author of this study when they weren’t, which is vaguely unethical but I wouldn’t lose too much sleep over it.\n\nAs far as your second point goes, I (a physicist) collaborate with biologists and physicians. Not one of us understand each other’s contribution (beyond a layman’s understanding in very broad strokes) enough to stand by it. We have to trust each other’s expertise.  That agreement of standing behind 100% of the results is a fiction, and if we actually had to wait until that were true, medical research would grind to a halt. The concept that all authors should be 100% aware of a paper’s intricacies is a privilege allowed only to those who don’t collaborate across disciplines.",
              "author": "ThePhysicistIsIn",
              "created": 1597083121,
              "upvotes": 4,
              "replies": {
                "g115zwd": {
                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g115zwd/",
                  "text": "I collaborate broadly well outside my discipline. I agree, trust is required, but if it is broken, I cannot say I hold no responsibility. If you cannot claim responsibility, you should not claim authorship, because in truth they are synonymous.",
                  "author": "Frogmarsh",
                  "created": 1597092561,
                  "upvotes": 3,
                  "replies": {
                    "g118azu": {
                      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g118azu/",
                      "text": "Of course you have responsibility. \n\nBut if it comes out that my physician colleague faked a bunch of patients in our study, it's unlikely that I will face the same backlash as he did. See for instance the Spider Biologist Jonathan Pruitt—who was found out to have faked almost all his data. His collaborators have had to retract all their papers, but none of them are going to face nearly the same backlash that he is. Because all of them can say \"we trusted that he acquired his data like said he did, we did the best under the circumstances to verify it, and we were blindsided by his fraud just as much as everyone else was\".",
                      "author": "ThePhysicistIsIn",
                      "created": 1597093663,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g0zssh5": {
      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g0zssh5/",
      "text": "Isn't that written in the authorship statement? Many journals now demand a statement of what the authors contributed, and whether authors are listed by contribution or in some other way. It can be a good idea to mention if that is not clear (or to list your articles in your CV by your author position, think first - second - third+ author). But a supervisor/employing committee should  know well to check the statement anyway before assuming you are first author.",
      "author": "kaneltroll",
      "created": 1597068201,
      "upvotes": 7,
      "replies": {
        "g10jil3": {
          "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10jil3/",
          "text": "Nope. Out of two dozen papers I wrote, I had to justify author contributions in exactly one of them. \n\nIt's definitely not universal.",
          "author": "ThePhysicistIsIn",
          "created": 1597081732,
          "upvotes": 4,
          "replies": {
            "g10o3vc": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10o3vc/",
              "text": "Oh, maybe it's different in the social sciences. It's becoming very common for us. My colleagues are always complaining about how the author contributions forms or certain journals are so detailed that they struggle to fill them in properly without just writing \"everybody did a bit of everything\".",
              "author": "kaneltroll",
              "created": 1597083938,
              "upvotes": 2,
              "replies": {
                "g10ome7": {
                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10ome7/",
                  "text": "It definitely varies journal by journal and discipline by discipline. Very little advice in academia is universal, other than \"grants are good\" and \"publish more\".",
                  "author": "ThePhysicistIsIn",
                  "created": 1597084186,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "g0zyomg": {
          "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g0zyomg/",
          "text": "[deleted]",
          "author": null,
          "created": 1597071420,
          "upvotes": 4,
          "replies": {
            "g10fgkl": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10fgkl/",
              "text": "It's generally demanded when you submit, it's not published with the paper itself (certainly hasn't been for mine)",
              "author": null,
              "created": 1597079792,
              "upvotes": 1,
              "replies": {
                "g10oyts": {
                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10oyts/",
                  "text": "It seems it's different in the social sciences (my field) than in physics. I've seen the author statement included in many social science articles published in the last few years, so just assumed it was the case in the natural sciences as well.",
                  "author": "kaneltroll",
                  "created": 1597084352,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g10gwaz": {
      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10gwaz/",
      "text": "[deleted]",
      "author": null,
      "created": 1597080478,
      "upvotes": 6,
      "replies": {
        "g10jupt": {
          "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10jupt/",
          "text": "Consider [this publication](https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.114.191803) with 5154 authors, and imagine trying to distribute authorship by contribution.",
          "author": "ThePhysicistIsIn",
          "created": 1597081890,
          "upvotes": 3,
          "replies": {
            "g10m7ws": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10m7ws/",
              "text": "[deleted]",
              "author": null,
              "created": 1597083025,
              "upvotes": 2,
              "replies": {
                "g10ppf4": {
                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10ppf4/",
                  "text": "Lots of papers that come from the LHC have many authors, because the experimental apparatuses took many people to design and build. ATLAS (one of the experiments at the LHC) is a 55-nation collaboration with over a thousand scientists involved in that experiment alone.\n\nIt’s not just CERN, either. LIGO has similar authorship numbers. Physics has reached the era of massive experiments, where it takes thousands of collaborating scientists and engineers to design an experiment, because of how sensitive the measurements we must make are. Each of those individuals contributed in a very real way to the experimental design, and the experiment would not exist without their efforts, so everyone deserves authorship.",
                  "author": "YeetMeIntoKSpace",
                  "created": 1597084710,
                  "upvotes": 3,
                  "replies": {
                    "g10zxci": {
                      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10zxci/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1597089615,
                      "upvotes": 1,
                      "replies": {
                        "g11eb8w": {
                          "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g11eb8w/",
                          "text": "I’ve known particle physicists switching fields to ours in which nearly their entire time was spent working on these >100 author contributions, yes. They had only papers like this, with 300 citations each.\n\nIt made it difficult to truly evaluate their potential as a sole scientist driving their own project.",
                          "author": "ThePhysicistIsIn",
                          "created": 1597096574,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g10n272": {
                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10n272/",
                  "text": "It’s the norm when a large number of authors are on a study. Otherwise it is by contribution.\n\nThere must necessarily be gray areas where there is few enough authors that contributions could be spelled out and tiered, but the authors don’t want to haggle.",
                  "author": "ThePhysicistIsIn",
                  "created": 1597083430,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "g112pha": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g112pha/",
              "text": "There seems to be *some* ordering by contribution. Because the list repeatedly cycles through A-Z order, it's not straight through from start to finish. It must be by research group and alphabetical within each one?",
              "author": "Violet_Plum_Tea",
              "created": 1597090962,
              "upvotes": 1,
              "replies": {
                "g1187c8": {
                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g1187c8/",
                  "text": "Perhaps? I'm not familiar with it really. \n\nThe point is, you can't really order strictly by contribution among >5000 authors. You have to pick something more egalitarian.",
                  "author": "ThePhysicistIsIn",
                  "created": 1597093616,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g10ciyk": {
      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10ciyk/",
      "text": "Other commenters have covered the name thing but...have you not read this paper?? As a rule of thumb you should be able to discuss (in it’s entirety) any piece of work your name is on. Even if you didn’t write/work on the whole thing.",
      "author": "watermelon_200",
      "created": 1597078372,
      "upvotes": 4,
      "replies": {
        "g10kcvz": {
          "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10kcvz/",
          "text": "As faculty, I gloss over the bits that are outside my specialty. I am not equipped to understand them - I lack the undergraduate courses that are pre-reqs for the graduate courses that would one day lead to me possibly having a clue about what is going on. Of course I have a broad, layman's understanding (\"they verified if giving the drug to the mice led to fewer dead mice when they did the thing, vs the control\") but the details are complete goobly-gook to me. I have to trust my biology colleagues that they know what they're about. Likewise, my contribution is goobly-gook to them. \n\nWe both sign the authorship declaration that says that we stand behind the entire document, because that's necessary to publish. Neither of us has the time to do a PhD in each other's field to figure out what we're about. The lab techs whose names get put on because they performed some of the analysis and produced some of the graphs? Forget it, they don't have a clue.\n\nNow imagine being an undergrad. I have no problem believing OP when they say they don't understand the rest of the paper, even if it's closer to their field than my example. They aren't mentally equipped for it yet.",
          "author": "ThePhysicistIsIn",
          "created": 1597082128,
          "upvotes": 5,
          "replies": {
            "g119zam": {
              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g119zam/",
              "text": "I am a grad student and this is something my undergrad advisor taught me. My name has never been on something I didn’t understand. I’m not saying OP should be able to replicate every single experiment or explain the tiniest details of everything but they should at the very least READ the whole thing. I don’t understand the minute details of every paper I read but that doesn’t mean I can’t discuss it or explain it in general terms. And don’t you think it’s a little reductive to assume that undergrads can only understand the portions of publications directly relevant to their field? The undergrads that I work with are perfectly capable of reading an interdisciplinary paper.",
              "author": "watermelon_200",
              "created": 1597094466,
              "upvotes": 2,
              "replies": {
                "g11cs5i": {
                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g11cs5i/",
                  "text": "Sure, you can read it. I read the papers I'm an author on, for all the good it does me. But if you're reading it and have to (more or less) unquestionably accept whatever information your co-author wrote, you're still not standing by it. When my colleague tells me that drug X is a whatsit pathway inhibitor, and that's why it will induce effect Y when Z is performed, I have to take their word for it. Sure, I could google it, and make sure that it really is. Or at least, that other people seem to be doing similar things, as far as I can follow along. That's a pretty superficial level verification I could do.  But I don't really know in any depth what it **really** means. More importantly, I don't know if it's relevant, or what it implies. I don't know what other effects that they haven't implicitly written about might confound our study. It's really not anything I can stand behind in any level of confidence, even if (as I already said) I can explain it in broad strokes.\n\nMaybe your cohort of undergrads are much smarter and educated than I am, and you're capable of being experts in more than one discipline. I posit it's more likely that as an undergrad they haven't achieved much depth in any one discipline, except perhaps their own, and have an equally superficial understanding in all of them. \n\nI say this looking back at my own experience as an undergraduate student who thought I understood my own field much more than I actually did. But perhaps you're much better than I was. Who knows?",
                  "author": "ThePhysicistIsIn",
                  "created": 1597095824,
                  "upvotes": 0,
                  "replies": {
                    "g11l1oc": {
                      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g11l1oc/",
                      "text": "No need to get snarky here. I never said or even implied that undergraduates are capable of the level of understanding you seem to think makes it “worth it” to read a paper, or that they are experts in anything. In fact I blatantly said they aren’t. All I’m saying is that they ARE capable of comprehending the overall goals and findings of a paper, or at least should be it they’re at a point where their own work is being published. And if their names are going to be on it, they should at the very least know what the broad goals and conclusions reached are, even for the parts outside their discipline.",
                      "author": "watermelon_200",
                      "created": 1597099962,
                      "upvotes": 2,
                      "replies": {
                        "g11lmh8": {
                          "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g11lmh8/",
                          "text": "I'm not being snarky. I'm just pointing out that anyone can read a paper, but to \"stand behind it\" like authorship agreement require, implies a deeper level of understanding of all aspects of the paper that I truly believe is simply impossible in (most) multi-disciplinary research.",
                          "author": "ThePhysicistIsIn",
                          "created": 1597100266,
                          "upvotes": 0,
                          "replies": {
                            "g11n4te": {
                              "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g11n4te/",
                              "text": "Yes, you are. But that’s besides the point. \n\nYou seem to be having a different conversation than what I have said in this thread. I have said nothing of authorship agreement, only that undergrads are capable of broad level understanding of many disciplines and should read anything they put their name on.",
                              "author": "watermelon_200",
                              "created": 1597101061,
                              "upvotes": 2,
                              "replies": {
                                "g11nrzt": {
                                  "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g11nrzt/",
                                  "text": "Usually the argument put forward as reason people should be aware of the content of their publications is because by agreeing to authorship, they agree to be responsible for the entire content of the article, not just the section to which they contributed.",
                                  "author": "ThePhysicistIsIn",
                                  "created": 1597101401,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g12ebor": {
      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g12ebor/",
      "text": "[deleted]",
      "author": null,
      "created": 1597116442,
      "upvotes": 1,
      "replies": {}
    },
    "g10auhl": {
      "link": "/r/AskAcademia/comments/i750km/is_it_necessary_to_mention_that_the_order_of/g10auhl/",
      "text": "When in doubt, say less. Interpret that how you wish.",
      "author": "Free_Paint",
      "created": 1597077546,
      "upvotes": 1,
      "replies": {}
    }
  }
}