{
  "sid": "qeul3r",
  "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/",
  "title:": "Uk lecturers",
  "text": "If a student comes to you to tell you they have been raped by another student on campus, does your university state that you must call the police? Even if the student doesn’t want you to?",
  "author": "Cronegoddess",
  "created": 1635089879,
  "updated": 1635184081,
  "over_18": false,
  "upvotes": 21,
  "upvote_ratio": 0.9,
  "comments": {
    "hhvfp0u": {
      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhvfp0u/",
      "text": "We have to tell a university official who takes action from there",
      "author": "AliasNefertiti",
      "created": 1635090521,
      "upvotes": 29,
      "replies": {
        "hhvsksz": {
          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhvsksz/",
          "text": "Oh ok - thank you",
          "author": "Cronegoddess",
          "created": 1635095793,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhw2uh7": {
      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhw2uh7/",
      "text": "If your university has a safeguarding officer contact them immediately, they are trained for dealing with these situations, and will take the necessary action. \nIt’s a horrible situation for you to be confronted with, and I’m so sorry for your poor student. The safeguarding officer will hopefully be able to advise you and your colleagues on how best to support the student in your capacity as teaching staff. All the best x",
      "author": "PerpetualStudent2021",
      "created": 1635099883,
      "upvotes": 18,
      "replies": {
        "hhw3hax": {
          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhw3hax/",
          "text": "Thank you for your comment. I’m the student who was raped a few weeks ago and I’m too scared to tell anyone or to report it right now. I’m scared that if I tell my supervisor she will call the police immediately as some USA lecturers have said that’s what they have to do. I am in the uk and I wanted to know what to expect if I tell a teacher what happened face to face",
          "author": "Cronegoddess",
          "created": 1635100133,
          "upvotes": 18,
          "replies": {
            "hhwcple": {
              "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwcple/",
              "text": "I suspect those people are mandated reporters and they legally are obliged to report various things to police. In the UK, there is mandatory reporting but I believe it only applies to much narrower range of professions (not university staff) and only in relation to children. Your supervisor has no obligation to call the police and should respect your wishes. I obviously cannot promise she wouldn't but she's not legally required to. If she does call the police, you do not have to speak to them and you will not be in trouble if you choose not to. \n\nWould contacting victim support help you? They are an independent charity who can provide advice and support. They aren't linked to the police and you don't have to have reported the crime to the police to access their services.\n\nI think we chatted a few days ago. I'm so so sorry this is happening. Please do keep coming back here if you have questions or need advice.",
              "author": "ACatGod",
              "created": 1635103838,
              "upvotes": 16,
              "replies": {
                "hhwesf3": {
                  "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwesf3/",
                  "text": "Hello - yes we did. \nOkay, thank you. That information helped. I’m just so stuck in a fearful state of not knowing what’s going to happen next/if I report. My university has no information at all as to what to expect. Their only advice was to call the police but I’m not ready for that yet",
                  "author": "Cronegoddess",
                  "created": 1635104665,
                  "upvotes": 10,
                  "replies": {
                    "hhwfnxi": {
                      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwfnxi/",
                      "text": "Ugh. That's terrible, I'm sorry. I can't understand how in 2021  universities are still so bad about this. \n\nIf it's advice about what you can expect if you report this to the police I think victim support is a good place to try. In addition, you could try the legal advice UK sub on here. Just make sure you go to the UK and not the US one.",
                      "author": "ACatGod",
                      "created": 1635105011,
                      "upvotes": 8,
                      "replies": {
                        "hhwgymz": {
                          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwgymz/",
                          "text": "Ok I will contact them. Thank you so much xx",
                          "author": "Cronegoddess",
                          "created": 1635105543,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hhw8j8d": {
              "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhw8j8d/",
              "text": "Oh my dear, I’m so sorry that happened to you and you’ve had to deal with it by yourself all these weeks. I had something similar happen to me as a student and I still remember so well how it felt in the days, weeks afterwards.\nThe most important thing in this situation is that you feel safe and supported. If you don’t feel ready to go to the police yet, please consider talking to the uni safeguarding officer or a trusted lecturer. You shouldn’t have to see or interact with the person who did this, you have the right to feel safe on campus.\nIf the prospect of talking to a member of staff seems over whelming at the moment, then ask your uni well-being services for counselling sessions to help you process everything. First and foremost, look after yourself. You will get through this x",
              "author": "PerpetualStudent2021",
              "created": 1635102145,
              "upvotes": 11,
              "replies": {
                "hhw9qp9": {
                  "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhw9qp9/",
                  "text": "Thank you for your kind words. I’m too scared to go back to campus as I don’t know him so I don’t know where he will be at any given time. I don’t want to bump into him so I think I’m just going to quit my phd.",
                  "author": "Cronegoddess",
                  "created": 1635102631,
                  "upvotes": 5,
                  "replies": {
                    "hhwbjtp": {
                      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwbjtp/",
                      "text": "Do you have a supportive supervisor? Perhaps they will be happy for you to work from home for a little while until you figure everything out? \nOr if you have a second supervisor at another institution perhaps you could work there for a few months?\nYou can also suspend your studies for a little while if you need some time fully away from Uni.\nThere are plenty of reasons to leave a PhD, but take a break before you decide to quit, time and space will help you realise if this is what’s best for you. Do you have friends around you can lean on? X",
                      "author": "PerpetualStudent2021",
                      "created": 1635103367,
                      "upvotes": 8,
                      "replies": {
                        "hhwdvjw": {
                          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwdvjw/",
                          "text": "It’s hard because I’m stuck - not telling someone what happened means I can’t explain/ ask for these things such as taking a break. I think I’m just too scared to ask anyone for help as Iam scared I’m going to be forced to make a report or that someone will call the police. I’m already trying to cope and I can’t deal with everything that comes with reporting (revealing my identity). Plus it doesn’t help that my university seems to have no support at all. I sent a message to the student union saying I was desperate for help after an assault and they sent me an emoji.",
                          "author": "Cronegoddess",
                          "created": 1635104309,
                          "upvotes": 6,
                          "replies": {
                            "hhwrj19": {
                              "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwrj19/",
                              "text": "> not telling someone what happened means I can’t explain/ ask for these things such as taking a break. \n\nYou can ask for a leave of absence without providing a reason - \"personal matter\"\n\nAnd Jesus Christ, that's a terrible response from the union. Does your university have a women space or student affairs office or any mental health support (this is often listed under 'student services' or 'student affairs')",
                              "author": "GrumpySimon",
                              "created": 1635109897,
                              "upvotes": 5,
                              "replies": {
                                "hhwsmmg": {
                                  "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwsmmg/",
                                  "text": "Ok - I wasn’t sure if I had to give a reason. Thank you. And the mental health service at the university has a waiting list of three months ...",
                                  "author": "Cronegoddess",
                                  "created": 1635110373,
                                  "upvotes": 2,
                                  "replies": {
                                    "hhx5le0": {
                                      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhx5le0/",
                                      "text": "So sorry this has happened to you! \nWhen I was working on my phd I was threatened by a student from my department but also wasn‘t ready to tell my supervisor. I talked to the pgr secretary for my department - she was able to write down everything to sort out internally without my name being involved. She also said that this would help if I do decide to do something (I didn’t file a complaint but this would’ve been helpful). Maybe you can find someone who is not directly involved in your everyday (making it easier for you to talk about it) but someone who knows the system - where to go, who to call to get support.",
                                      "author": "GnomeChomChom",
                                      "created": 1635116273,
                                      "upvotes": 3,
                                      "replies": {
                                        "hhy0w4e": {
                                          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhy0w4e/",
                                          "text": "Hi yes I have reached out to someone anonymously for more info (someone who doesn’t know me anyway) and I also made an anonymous report online but that isn’t much good because I don’t know what his name is",
                                          "author": "Cronegoddess",
                                          "created": 1635132286,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "hhwgk8q": {
                          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwgk8q/",
                          "text": "Oh I forgot to say I haven’t told anyone I know what happened. Everyone seems to have their own issues right now and I don’t want to burden anyone including my supervisors,  The attack happened on the first day of my course and so I haven’t been to any events since. I haven’t made any friends on campus to talk to or ask to come with me places. I wish I had someone to confide in at the university",
                          "author": "Cronegoddess",
                          "created": 1635105379,
                          "upvotes": 5,
                          "replies": {
                            "hhwr8ao": {
                              "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwr8ao/",
                              "text": "> Oh I forgot to say I haven’t told anyone I know what happened. Everyone seems to have their own issues right now and I don’t want to burden anyone including my supervisors, The attack happened on the first day of my course and so I haven’t been to any events since. I haven’t made any friends on campus to talk to or ask to come with me places. I wish I had someone to confide in at the university\n\nAs a supervisor, I'd want to know so I could help. If you're not comfortable talking to your supervisor about this, then at the very least let them know you have a personal emergency and need a leave of absence. Then look after yourself and make sure you're safe.",
                              "author": "GrumpySimon",
                              "created": 1635109770,
                              "upvotes": 8,
                              "replies": {
                                "hhwsdd0": {
                                  "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwsdd0/",
                                  "text": "Thank you. Part of me worries if I tell my supervisor that I’m burdening them on top of all my other concerns... it’s just so stressful. What if they get annoyed at me about it ? And this man also said nobody would believe me because he is a lecturer in his country and has important friends at the university. What if that’s true and my supervisor doesn’t believe me?",
                                  "author": "Cronegoddess",
                                  "created": 1635110262,
                                  "upvotes": 3,
                                  "replies": {
                                    "hhzqob2": {
                                      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhzqob2/",
                                      "text": "Staff are here to be burdened with stuff like this.\n\nSpeak to your supervisor if you possibly can. They will likely offer to help refer you to the university counselling service.\n\nThe response from the SU is very troubling. Was this through a formal reporting route, or perhaps a more informal / facebook messenger / etc channel?",
                                      "author": "OrbitalPete",
                                      "created": 1635174149,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhwudzx": {
      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwudzx/",
      "text": "OP I am a therapist and have worked quite a lot with people who have experienced sexual assault. Have you contacted any places that specifically support people who have been raped? Eg[Rape Crisis](https://rapecrisis.org.uk), [Survivors Trust](https://www.thesurvivorstrust.org) and if you are in London [The Havens](https://www.thehavens.org.uk). You could also access counselling support through your student union where you could talk things through with a trained counsellor. \n\nI hope you don’t mind me posting this as I know it’s not answering your question, I guess I’m trying to offer you something that might you process what has happened and give you somewhere safe to talk about things if you don’t want to take the Police route",
      "author": "MegTheMonkey",
      "created": 1635111141,
      "upvotes": 10,
      "replies": {
        "hhwypv1": {
          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwypv1/",
          "text": "Thank you so much. My university has a three month waiting list for counselling and support and no I haven’t contacted any external services yet for advice or help and that’s mostly because my only experience with therapy didn’t work. It actually made everything worse it seemed. I really don’t like to remember things. I prefer to forget.",
          "author": "Cronegoddess",
          "created": 1635113077,
          "upvotes": 3,
          "replies": {
            "hhx0vk7": {
              "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhx0vk7/",
              "text": "I’m so sorry, I really feel so sad when people tell me of negative experiences in therapy. Reading through your comments I can feel your despair and isolation and would really encourage you to seek support from someone/where you trust, be that a Counsellor, nurse, doctor, lecturer or from somewhere like Rape Crisis. Reaching out and being vulnerable especially when you are feeling so vulnerable and violated already can be so scary. You matter and none of this is your fault",
              "author": "MegTheMonkey",
              "created": 1635114057,
              "upvotes": 5,
              "replies": {
                "hhx3wkp": {
                  "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhx3wkp/",
                  "text": "Thank you. I definitely feel I did a lot of things wrong. Why did I go into that empty classroom with him? Why did I believe he wanted to ‘network’ with me? I feel like I’m doing everything wrong right now",
                  "author": "Cronegoddess",
                  "created": 1635115479,
                  "upvotes": 3,
                  "replies": {
                    "hhxdnkb": {
                      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhxdnkb/",
                      "text": "Please remember that It's not you who did anything wrong. It's not your fault. You just had a terrible misfortune to meet a very, very wrong person. I really hope you will find the help you need. Please message if I can help in any way.",
                      "author": "isayatar",
                      "created": 1635120279,
                      "upvotes": 5,
                      "replies": {
                        "hhy1a1d": {
                          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhy1a1d/",
                          "text": "Thank you very much",
                          "author": "Cronegoddess",
                          "created": 1635132504,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hhytcr7": {
              "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhytcr7/",
              "text": "Waiting lists are for “routine” stuff like chronic conditions, not acute post-trauma support. Thing is, your uni may not be equipped to deal with that level of crisis anyway, treat this as back up. \nAbsolutely contact the specialist rape crisis services on the phone wherever you are, they have better options insight and knowledge than anyone here on reddit and they won’t force you to do anything and they can provide you with emergency menta health that’s actually tailored. I’m speaking from experience. \nAlso, you definitely need a looking at at the hospital if you’re blacking out - and in general. Take a friend and go to a walk in sexual health clinic (theyre kinder and skilled at handling sexual assault) but your local A&E should be as well. \nRemember that whatever you do, you don’t have to go to the police or press charges or anything. You just need to take care of you. But if you are given options that would preserve evidence or allow evidence in the future, and it’s not excruciating to go through, I’d thorougly recommend you see if you can. At worst, you leave it. At best, once your post-trauma recovery progresses you will have options. And options is what you want after what this inhumane person did to you. I am so sorry. You can get through this, make sure you priorotise your physical safety (inc health), physiological felt safety (where you sleep, where you go), then mental health, and plans and long term commitments are last. Let them slide for now, you will catch up, it will be explained later. Use your autopilot to take care of and organsie the basics, then let yourself collapse in safe company. The only thing that matters is that you give yourself space and safe environment to reel from the violation, let yourself rest in peace as the shock subdues. The more you do this the easier it will get. Sending you so much love. X",
              "author": "sailorsensi",
              "created": 1635154167,
              "upvotes": 3,
              "replies": {
                "hhz7pci": {
                  "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhz7pci/",
                  "text": "Thank you. That helped a lot. You have said a few things I didn’t think of. I’m going to the hospital today.",
                  "author": "Cronegoddess",
                  "created": 1635164932,
                  "upvotes": 2,
                  "replies": {
                    "hhzs0t2": {
                      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhzs0t2/",
                      "text": "Take good care xxx",
                      "author": "sailorsensi",
                      "created": 1635174733,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hhwz2o0": {
          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwz2o0/",
          "text": "But I think I will have to go to a medical centre because I received an injury to my head during the attack and my vision is blacking out sometimes. I’m getting worried about it. Everything is so overwhelming- this is all too much. I don’t think I can cope with all this",
          "author": "Cronegoddess",
          "created": 1635113233,
          "upvotes": 2,
          "replies": {
            "hhx0743": {
              "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhx0743/",
              "text": "If you are getting these symptoms please go to A&E/ Emergency Dept",
              "author": "MegTheMonkey",
              "created": 1635113748,
              "upvotes": 6,
              "replies": {
                "hhx42at": {
                  "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhx42at/",
                  "text": "I guess I have to",
                  "author": "Cronegoddess",
                  "created": 1635115553,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhwqdc3": {
      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwqdc3/",
      "text": "I'm in the UK. The support staff (not sure about lecturers) at my university say they are only allowed to report it under extreme circumstances where there is a serious risk to your's or other's safety.",
      "author": "SuperSecant",
      "created": 1635109412,
      "upvotes": 7,
      "replies": {
        "hhwr5rd": {
          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwr5rd/",
          "text": "Ok I see ... Thank you",
          "author": "Cronegoddess",
          "created": 1635109741,
          "upvotes": 3,
          "replies": {
            "hhwtkoa": {
              "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwtkoa/",
              "text": "I just read the other posts. I'm so sorry that this happened to you! It's terrible your university such awful support.\n\nI concur with what u/GrumpySimon is saying. You can take a leave of absence without giving a reason. It is your right to keep personal matters personal. It is probably good to let someone like your supervisor know that you are having a personal issue of some sought so they can be ready to help you if and when you want their help.\n\nIf you want, I could ask the people at my university (in London) if they'd be willing to talk to you even though you're not a student here. It's not ideal but maybe they could help you find sources of support nearer to you?",
              "author": "SuperSecant",
              "created": 1635110784,
              "upvotes": 5,
              "replies": {
                "hhwxyuh": {
                  "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhwxyuh/",
                  "text": "That’s very kind of you. I am also in london.",
                  "author": "Cronegoddess",
                  "created": 1635112738,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhxffb6": {
      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhxffb6/",
      "text": "Can you reach out to rape crisis services off campus off campus? They will have a counselor there who can help walk you through and know what the laws are  in your country",
      "author": "Elsbethe",
      "created": 1635121191,
      "upvotes": 3,
      "replies": {
        "hhy30xx": {
          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhy30xx/",
          "text": "Yes I will thank you",
          "author": "Cronegoddess",
          "created": 1635133507,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhx6s5i": {
      "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhx6s5i/",
      "text": "I'm so sorry this has happened to you. Putting myself in the lecturers shoes, if someone has disclosed to me that another student has raped them, I then know that there may be a risk of further harm to other students. I would also want to respect the student who disclosed. It is a very difficult ethical dilemma for that lecturer.",
      "author": "Corrie_W",
      "created": 1635116846,
      "upvotes": 1,
      "replies": {
        "hhy34du": {
          "link": "/r/AskAcademia/comments/qeul3r/uk_lecturers/hhy34du/",
          "text": "This is why I don’t want to tell my supervisor as well",
          "author": "Cronegoddess",
          "created": 1635133563,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}