{
  "sid": "lroa36",
  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/",
  "title:": "Is the Tenure-Track Job Era Over?",
  "text": "It seems universities are now less likely than ever to replace retiring faculty with new TT lines. This suggests, in my opinion, that contracted 1, 2, and 3 year positions (benefitted?) will become the new norm, with a smattering of adjuncts to fill the gaps. Perhaps the most well-funded and \"elite\" universities will be the only ones to continue the TT tradition. So, is the TT era over? What do you see happening, or hear, at your universities? This may be a field-specific issue, so please note if so. Eager junior scholars want to know.",
  "author": "gggggggggggfff",
  "created": 1614204222,
  "updated": 1634080731,
  "over_18": false,
  "upvotes": 191,
  "upvote_ratio": 0.98,
  "comments": {
    "gonbadk": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonbadk/",
      "text": "The jobs are...out there...but I think the direction universities have been going in is definitely one of the gig economy, hiring on a per class basis. That is and will be the case for the majority of people.\n\nMeanwhile, they will hire TT positions for a handful of slots in order to have people around they can advertise to donors and people applying for grad programs. This is already the case.\n\nIn short: unless you're a rockstar, it's already over.",
      "author": "amishius",
      "created": 1614212763,
      "upvotes": 81,
      "replies": {
        "gooppmj": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gooppmj/",
          "text": ">Meanwhile, they will hire TT positions for a handful of slots in order to have people around they can advertise to donors and people applying for grad programs. This is already the case.\n\nAlso first and foremost to bring in grant money. Job status is a major factor in determining grant proposal acceptance probability and universities will get a lot more grants if they have a few people with high status jobs applying.",
          "author": "CaptainCornerCamper",
          "created": 1614242520,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "gonanr3": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonanr3/",
      "text": "Yes and no.  Let's be clear here: the number of graduate students trained and the number of professors retiring (or, let's be honest, passing away) were always going to collide with each other in such a way that caused a crunch for the number of TT positions. \n\nWith the incoming demographic crunch (less students going to Universities) and the massive supply of PhDs willing to take adjunct jobs, I do not see there being many ways where many institutions that are solely teaching-oriented continuing to have TT lines except for core departments that are considered essential to the mission of the University. \n\nFor research-focused institutions, TT lines will always remain just because it's considered such a major incentive to attract researchers to begin with. Since researchers bring in more money/prestige (but mainly money) Universities would be hard pressed to drop that if they would like to remain research-focused.\n\nAs an aside: Tenure has always been kind of weird to me. It's original purpose was two fold; to protect professors from retaliation due to teaching unorthodox (and even sacrilegious) ideas/concepts, and to allow them the freedom to explore new ideas and research directions without the fear of getting fired. I'm not sure the first motivation still really holds today; not often do we hear professors getting terminated for ideas that are deviant to the church or state (with some notable exceptions).",
      "author": "DrSomewhatEvil",
      "created": 1614212445,
      "upvotes": 70,
      "replies": {
        "gondb4o": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gondb4o/",
          "text": "I just wanted to add to your last point about the two reasons for tenure. When I started my academic career, it was a lot harder for me to do more daring research. I can only speak to my experience, but I was most concerned with getting published, making new connections with other academics for further research, all to build my resume to make sure my CV was competitive. \n\nEverything had to be within a framework that I knew would be easy to publish, or quick enough research that I knew would be finished soon. That’s not to say the research was bad, but rather, I didn’t have the security to approach my field from a radically different angle. I actually didn’t realize this at the time, but after I was offered tenure, I had a sudden realization that, not only did those experiences and previous research build up my knowledge and skills to do more research (thus earning tenure), but I was now “free” to do whatever research I wanted to do. \n\nIf it would take a few years to really flesh out these new ideas, or if I knew it was “against the grain” of the field, I knew I had time to fully develop it, make my case, and if it’s not initially accepted easily, I could restart or reassess and present new case studies for more substantive support. Or just really take the time to develop this new research to the point I was confident the top journals, conferences etc would accept it. I never thought about that aspect of tenure until it happened to me: it gives me time and security to actually be a better researcher that didn’t just support the field but moved it in new directions.",
          "author": "asuraasunder",
          "created": 1614213733,
          "upvotes": 62,
          "replies": {
            "gonnnkq": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonnnkq/",
              "text": "That's interesting that you put it that way. I feel the opposite, I cannot really get funding unless I propose ideas that are revolutionary and next-level. Based on previous recent cases it seems unlikely that I'd get tenure if I do research that is just 'business as usual'.",
              "author": "IHTFPhD",
              "created": 1614218559,
              "upvotes": 15,
              "replies": {
                "goo32ih": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo32ih/",
                  "text": "To get funding you have to do radical ideas, but you also have to convince the funding agencies that they'll pan out. That kind of limits the radicalness of the ideas you propose, because you need to have that clarity/arguments in the very early stages of those ideas. So they need to be pretty radical but not totally ridiculous, just right.\n\nI think what the parent commenter is saying that post-tenure you feel free to pursue ideas that are so radical that it's not at all clear they'll ever work. And because you have the very long-term job, you know you'll have the time to make adjustments and try lots of different things.",
                  "author": "pb-pretzels",
                  "created": 1614226081,
                  "upvotes": 14,
                  "replies": {
                    "goo62m1": {
                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo62m1/",
                      "text": "Yes, that is exactly what I meant. Thank you for articulating it better than I did!\n\nThere is definitely some sort of “intellectual release” that comes with tenure, where I now have the freedom to really dig into ideas that I didn’t have the time to explore fully in the past because I couldn’t afford to invest that time previously. \n\nI also realized how much more I’m willing to invest in my now “home institution,” which I know I am situated at for the foreseeable future. Previously I wasn’t anywhere long enough to make any long term plans or efforts that I would have seen the results of or be able to refine over the period of a 5-10 years.\n\nAll of these things also help facilitate more radical ideas, because there is an institutional backdrop that supports me long term. Because of that, as you said, I can now pursue ideas that I’m not quite sure the results of because of that support.",
                      "author": "asuraasunder",
                      "created": 1614227756,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "goolwt3": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goolwt3/",
          "text": ">I'm not sure the first motivation still really holds today; not often do we hear professors getting terminated for ideas that are deviant to the church or state (with some notable exceptions).\n\nIt may not be the church calling the shots anymore, but there are definitely powers that be doing their best to influence the scientific evidence as a way to shape policies, practices, public opinion, and so forth. There are fields where the pressure to conform to orthodoxy is quite strong, but I am not sure if TT would help at all. It's still unlikely that those willing to openly question the status quo reached those positions, I am really not sure what's the best solution to this sort of situations.\n\nI work as a medical anthropologist doing ethnopsychiatric research. My experience observing that particular field is that those practitioners and scientists willing to openly question the current state of affairs when it comes to mental health understanding and interventions, and point at the insane influence of the pharmaceutical industry and other interest groups in shaping the so-called bible of psychiatry (currently the DSM-5), the research lines that get funded, and in general what can be said and done without being considered a heretic, face harsh consequences. In some quarters the fear of retaliation, of being a pariah and not being able to advance in their careers or even keep their jobs, is a real issue.",
          "author": "Destrezza",
          "created": 1614239084,
          "upvotes": 6,
          "replies": {
            "goschlb": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goschlb/",
              "text": "Have a look at the case of Peter Ridd, who is currently fighting his case in the Australian High Court. In Australia, our variant of \"tenure\" is \"continuing\" employment, which is supposed to be fairly difficult to remove. \n\n[https://www.abc.net.au/news/2021-02-11/marine-expert-peter-ridd-coral-bleaching-case-heard-high-court/13144912](https://www.abc.net.au/news/2021-02-11/marine-expert-peter-ridd-coral-bleaching-case-heard-high-court/13144912)",
              "author": "drrmau",
              "created": 1614308048,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "goq352y": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goq352y/",
          "text": "I think there's a 3rd important effect of tenure (at least in theory): Administrators cannot make drastic changes to the departments on a whim. A new president can't decide that he doesn't really think Classics are important, so let's fire the Classics professors and bring in more Economics professors. Or decide that we should have more French professors who do African Francophone literature, so fire the medievalist French prof and bring one in.",
          "author": "honkoku",
          "created": 1614272485,
          "upvotes": 4,
          "replies": {}
        },
        "gootpjv": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gootpjv/",
          "text": ">Tenure has always been kind of weird to me. It's original purpose was two fold; to protect professors from retaliation due to teaching unorthodox (and even sacrilegious) ideas/concepts, and to allow them the freedom to explore new ideas and research directions without the fear of getting fired.\n\nI like this in theory and maybe it was the case that tenure had the desired effects but the filters that determine who gets tenure and what they have to do to get there and the pressured on tenured faculty now basically make this null and void.\n\nOn the teaching side, I have known a lot of tenured faculty and very few, if any, have been teaching unorthodox ideas. It is not that they don't have unorthodox ideas and it is not that they are scared to share them, it is just that they are so overburdened with other responsibilities that teaching is basically an afterthought. Also many of them don't care about teaching anyway and just treat it like a tedious chore. It is easier to just use standard teaching materials than to really spend a lot of time developing something new.\n\nOn the research side, I think the problem is largely that people who are really likely to explore risky and innovative new research directions are very unlikely to make it through the filters and actually get tenure. The modern academic system rewards people for following trends and for consistently producing publications, and the easiest way to publish consistently is to do research that tells us what we already know. Getting tenure typically requires that you are well cited, well known, and have obtained a decent amount of funding, and developing these things is time consuming and it is much easier if you are doing research on easy-mode.\n\nThere is the idea that although younger academics need to be conservative in their research, when they do get tenure they can then open up and start doing high risk research. This doesn't turn out this way partly because the filters have already removed the people who are likely to do this and partly because most modern tenured professors have groups that they are responsible for. They need to get grants to keep people employed and to keep people producing research that they can put their names on, so the same pressures continue to exist.",
          "author": "CaptainCornerCamper",
          "created": 1614246217,
          "upvotes": 4,
          "replies": {
            "goowmka": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goowmka/",
              "text": ">They need to get grants to keep people employed and to keep people producing research that they can put their names on, so the same pressures continue to exist.\n\nI think this is the biggest problem. If tenure came with an unlimited bag of cash then yeah, people could afford to take on projects that are risky. But any research group worth a damn has postdocs and students who've gotta be paid and who need that steady stream of publications, and the funding agencies don't have a special \"easy\" track for tenured faculty.\n\nTenure is a perverse incentive and doesn't currently fulfil its original purpose.",
              "author": "officially_anxious",
              "created": 1614248986,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gondk4a": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gondk4a/",
          "text": "> I'm not sure the first motivation still really holds today; not often do we hear professors getting terminated for ideas that are deviant to the church or state (with some notable exceptions).\n\nNot to get all conservative on you or anything, but recently professors have been getting fired for saying things deviant to current social norms all the time. And in many progressive countries those norms have become the law of the state, too.\n\nIf you try to do research on satisfaction rates after transgender surgery or potential differences in intelligence or abilities by race, you stand a real chance of getting fired even if you do have tenure. You can agree with those norm changes and firings, but it can no longer be said that professors have full freedom to say and study what they want.",
          "author": "Kmlevitt",
          "created": 1614213852,
          "upvotes": 4,
          "replies": {
            "gonl3tv": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonl3tv/",
              "text": "You may be playing devil's advocate here. That's fine, but while I agree with your first point to a degree, your second point reminds me of a Joe Rogan talking point, and I disagree with that.\n\nThere are many studies on intelligence and race, just not the ones you seem to be envisioning. For most people within a standard deviation or so of the IQ bell curve, intelligence is impacted to some degree by social circumstances (parental and educational resources, quality of school, socio-economic status, exposure to problematic chemicals, etc). It is not a purely biological ability scenario, so treating it as such is not good research and probably unlikely to get funded. And, intelligence takes many forms--emotional, artistic, social, analytic, etc. It is not often analyzed as one large thing (even in psychological testing, IQ speaks to different types of abilities). Neuroscience research on intelligence relating to race often factors in social impact on cognitive development to find answers to possible disparities. I bet if you look through top neuroscience journal databases you will find related research.\n\nIn terms of the trans research, my guess is that this research is probably already happening if not already published. If not it will develop when more trans people express dissatisfaction with transitioning, given that so many publicly express a decrease in suicidal ideality and increased happiness. But there is a lot of research on the inadequacy of F to M bottom surgery, and those who have undergone bottom surgery may be more likely to express dissatisfaction with their transition. That would be more about procedure but certainly about \"satisfaction\".\n\nThe issue is that general research on \"race and intelligence\", if there were disparities, would be weaponized to defend some biological reductionist perspective on racial difference, and being so general it would not be adequate research. The trans research similarly would be weaponized to fight against trans civil rights and the authenticity of trans people's desires to transition.",
              "author": "gggggggggggfff",
              "created": 1614217380,
              "upvotes": 33,
              "replies": {
                "gonlvg8": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonlvg8/",
                  "text": "I don’t want to get stuck on an argument about the merits of such research or justifications for banning it. Those are just recent examples of research themes that are heavily frowned on and can lead to strong adverse consequences. My point is simply that some researchers jobs would be in jeopardy without tenure.\n\nCases like this. This guy is too old to apply for a tenure-track job anyway, but I think it’s a given that nobody would touch him with a 20 foot pole even if his study turned out to be done impeccably well-\n\nhttps://www.theguardian.com/education/2017/sep/25/bath-spa-university-transgender-gender-reassignment-reversal-research",
                  "author": "Kmlevitt",
                  "created": 1614217730,
                  "upvotes": -5,
                  "replies": {}
                },
                "gookc2f": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gookc2f/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1614237733,
                  "upvotes": -1,
                  "replies": {
                    "gopyx53": {
                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gopyx53/",
                      "text": "> Publish your study if you disagree with the other professor, not fire the professor for doing an “controversial” study.\n\nWhat if the study is based on research that is fraudulent?",
                      "author": "Adventurous_Map_4392",
                      "created": 1614270708,
                      "upvotes": 1,
                      "replies": {
                        "gopz4rs": {
                          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gopz4rs/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1614270799,
                          "upvotes": 1,
                          "replies": {
                            "goq2651": {
                              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goq2651/",
                              "text": ">  If that’s the case, you should report that for the journal. And the journal should withdraw that publication like what we are doing right now, and that would be a RIGHT REASON to fire that professor if he / she is unethical.\n\nYeah. This has happened repeatedly with racial pseudoscience.  \n\nThe problem, though, is that when the publication is retracted, the authors will immediately scream that the retraction is politically biased. Then we'll be right back to you whining about cancellation. \n\nDoesn't seem like much of a solution.",
                              "author": "Adventurous_Map_4392",
                              "created": 1614272080,
                              "upvotes": 2,
                              "replies": {
                                "goq2tyy": {
                                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goq2tyy/",
                                  "text": "Again, you are back to the wrong point. I am not against firing professors that are fabricating data to advance their own agenda, I am against firing professor just doing the research using the same level of scientific rigorousness as we do. It should based on academic and scientific merit instead of the social norm.",
                                  "author": "jasonmoyy",
                                  "created": 1614272356,
                                  "upvotes": 1,
                                  "replies": {
                                    "goqmkkm": {
                                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goqmkkm/",
                                      "text": "> I am not against firing professors that are fabricating data to advance their own agenda,\n\n>using the same level of scientific rigorousness\n\nWell, bad news. Racial pseudoscience is just that, pseudoscience. It doesn't meet any levels of rigor. That's why racial \"scientists\" don't get jobs and lose the ones they have.",
                                      "author": "Adventurous_Map_4392",
                                      "created": 1614279931,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gonv6n1": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonv6n1/",
                  "text": "To a scientist, whether somebody else might “weaponize” the research should have no bearing on whether that topic is worth studying or whether a purported phenomena exists or has the claimed extent. One may personally choose not to research something for fear of possible ramifications, but it’s unscientific to say “this topic is off-limits for research because it may be used by people who disagree with my values.”",
                  "author": "TakeOffYourMask",
                  "created": 1614222061,
                  "upvotes": -6,
                  "replies": {
                    "gonx7kx": {
                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonx7kx/",
                      "text": "Sure, agreed. But very general research on \"race and intelligence\" wouldn't be taken seriously regardless. It would only be done to be weaponized.",
                      "author": "gggggggggggfff",
                      "created": 1614223014,
                      "upvotes": 17,
                      "replies": {
                        "gonyedn": {
                          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonyedn/",
                          "text": "If you want to make the case that there is no link between what we call “race” and intelligence then why would you want there to be *less* research on it? Unless you’re worried what they’ll find.\n\nWouldn’t you want the best body of evidence possible to back up your assertion?",
                          "author": "TakeOffYourMask",
                          "created": 1614223610,
                          "upvotes": -15,
                          "replies": {
                            "gonyjpv": {
                              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonyjpv/",
                              "text": "It doesn't sound like you read my post above. But whatever.",
                              "author": "gggggggggggfff",
                              "created": 1614223685,
                              "upvotes": 9,
                              "replies": {}
                            }
                          }
                        },
                        "goo1tz6": {
                          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo1tz6/",
                          "text": "> Sure, agreed. But very general research on \"race and intelligence\" wouldn't be taken seriously regardless. It would only be done to be weaponized.\n\nThis isn’t true. Geneticists have warned that inevitably, we are going to find certain genes that result in higher intelligence. And inevitably, you are likely going to see certain populations of people that have a higher or lower than average tendency of expressing those particular genes, whether the findings conform with current perceptions of “race“ or not. How could you not? \n\nSome credible scientists have legitimate concerns that when that happens, research will be shuttered for political purposes because a lot of people just don’t want to hear it, regardless of the real value of knowing about it for apolitical reasons.\n\nAgain though, it’s not worth getting hung up on the specific cases in question. Yes, highly controversial research that goes against today’s social norms is going to be seen as of no real merit by most people today. That is tautological. But it is also shortsighted to assume that today we have reached some kind of Nirvana of scientific enlightenment, and that we in the year 2021 can be perfect judges of which research is both morally and scientifically appropriate and which is not.",
                          "author": "Kmlevitt",
                          "created": 1614225406,
                          "upvotes": -9,
                          "replies": {
                            "goo59lf": {
                              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo59lf/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1614227300,
                              "upvotes": 12,
                              "replies": {
                                "goo7dr7": {
                                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo7dr7/",
                                  "text": "https://www.nytimes.com/2018/03/23/opinion/sunday/genetics-race.html\n\n\n\n\n>I have deep sympathy for the concern that genetic discoveries could be misused to justify racism. But as a geneticist I also know that it is simply no longer possible to ignore average genetic differences among “races.”...\n\n>...This study has been joined by others finding genetic predictors of behavior. One of these, led by the geneticist Danielle Posthuma, studied more than 70,000 people and found genetic variations in more than 20 genes that were predictive of performance on intelligence tests.\n\n>Is performance on an intelligence test or the number of years of school a person attends shaped by the way a person is brought up? Of course. But does it measure something having to do with some aspect of behavior or cognition? Almost certainly. And since all traits influenced by genetics are expected to differ across populations (because the frequencies of genetic variations are rarely exactly the same across populations), the genetic influences on behavior and cognition will differ across populations, too...\n\n>...It is important to face whatever science will reveal without prejudging the outcome and with the confidence that we can be mature enough to handle any findings. Arguing that no substantial differences among human populations are possible will only invite the racist misuse of genetics that we wish to avoid.\n\nDavid Reich is no friend of racists. But he knows that inevitably things are going to be discovered that racists use as vindications of their claims, and that some people on the left are going to assume his colleagues' research had a political agenda and deal with the politics rather than take a closer look at the meaning of those findings. It will put some researchers in an awkward position and it is likely to influence what gets funded and who gets to stay employed, even if they didn't intend to get caught in the socio-political crossfire.",
                                  "author": "Kmlevitt",
                                  "created": 1614228518,
                                  "upvotes": -3,
                                  "replies": {
                                    "goofgw5": {
                                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goofgw5/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1614233896,
                                      "upvotes": 3,
                                      "replies": {
                                        "gooha7t": {
                                          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gooha7t/",
                                          "text": "> You’ve sent an OpEd behind a paywall. \n\n...Which I extensively quoted here so you could read the relevant passages yourself.\n\n>The fact of the matter is we can’t even point at a gene or series of genes that cause male pattern baldness, something which has received absolutely wild amounts of funding. The claim that we will find a gene or series of genes responsible for intelligence, something that evades objective definition, beggars belief.\n\nFirst off, your belief about that is irrelevant to my original statement. I stated credible geneticists worry about this stuff becoming a problem in the future as we learn more about genes related to intelligence. You demanded a source for that. I gave you one- [David Reich](https://en.wikipedia.org/wiki/David_Reich_\\(geneticist\\))- a credible geneticist that worries about just that.\n\nNow you want to argue that such a thing is impossible, and turn this into a debate about possible genetic origins of intelligence, rather than the broader argument about academic freedom. Fine, here you go-\n\n>Daniel Benjamin compiled information on the number of years of education from more than 400,000 people, almost all of whom were of European ancestry. After controlling for differences in socioeconomic background, he and his colleagues identified 74 genetic variations that are over-represented in genes known to be important in neurological development, each of which is incontrovertibly more common in Europeans with more years of education than in Europeans with fewer years of education.\n\nGo to town on him-\n\nhttps://scholar.google.com/citations?user=wIEUEuYAAAAJ&hl=en&oi=ao\n\n>A follow-up study of Icelanders led by the geneticist Augustine Kong showed that these genetic variations also nudge people who carry them to delay having children.\n\nFind the paper for yourself-\n\nhttps://scholar.google.com/citations?user=VInFNMcAAAAJ&hl=en&oi=sra\n\n>This study has been joined by others finding genetic predictors of behavior. One of these, led by the geneticist Danielle Posthuma, studied more than 70,000 people and found genetic variations in more than 20 genes that were predictive of performance on intelligence tests.\n\nhttps://scholar.google.com/citations?user=R8_Y1ZgAAAAJ&hl=en&oi=sra\n\nHow about that, first author on a different intelligence/heritability study in Nature-\n\nhttps://www.nature.com/articles/nn0202-83\n\nI'm sure you'll object to most all of that. That's fine, and I won't argue this specific example with you further. But you're proving my point that some people are vehemently opposed to certain lines of scientific inquiry, and the social pressure that can put on research.",
                                          "author": "Kmlevitt",
                                          "created": 1614235262,
                                          "upvotes": -1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "goq2a9g": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goq2a9g/",
              "text": "> but it can no longer be said that professors have full freedom to say and study what they want.\n\n\"No longer\" meaning as opposed to when? Want me to produce the vast unending list of professors fired for having leftist views, starting with the late 19th century and continuing till today?",
              "author": "Adventurous_Map_4392",
              "created": 1614272128,
              "upvotes": 2,
              "replies": {
                "goqz10o": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goqz10o/",
                  "text": "Sure, have it your way- the need for tenure has never left us.",
                  "author": "Kmlevitt",
                  "created": 1614284920,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gons4hb": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gons4hb/",
          "text": "Replace \"church\" with \"social justice\" and your first reason for tenure is more relevant than it ever has been, not that it helps in most cases.",
          "author": null,
          "created": 1614220638,
          "upvotes": -13,
          "replies": {}
        },
        "gonvgpk": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonvgpk/",
          "text": ">not often do we hear professors getting terminated for ideas that are deviant to the church or state\n\nMaybe not by the church, but social justice warriors like to cancel all sorts of people over misunderstandings or because someone questioned or critically discussed something they don't agree with. The \"if you're against me you're a sexist/racist/homophobic biggot\" trend is a real problem sometimes.",
          "author": "idk7643",
          "created": 1614222194,
          "upvotes": -20,
          "replies": {
            "gonvwno": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonvwno/",
              "text": "Somehow this only happens to fascists though—a mystery!",
              "author": "kinderdemon",
              "created": 1614222402,
              "upvotes": 23,
              "replies": {
                "gonxbxi": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonxbxi/",
                  "text": "There's one case where a professor almost got fired because he said a word in Japanese that sounded like the N word",
                  "author": "idk7643",
                  "created": 1614223072,
                  "upvotes": -12,
                  "replies": {
                    "gopyl34": {
                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gopyl34/",
                      "text": "And by almost got fired, you mean, didn't get fired at all. \n\nAnything can be true if you make shit up.",
                      "author": "Adventurous_Map_4392",
                      "created": 1614270567,
                      "upvotes": 3,
                      "replies": {
                        "gopzglq": {
                          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gopzglq/",
                          "text": "Investigation into US professor sparks debate over Chinese word - BBC News\nhttps://www.bbc.com/news/world-asia-china-54107329\n\n\n\n\"Enunciated, na-ge sounds like the N-word, which led several of the professor's students to complain to the university. Responding to the complaint, the dean of the university, Geoffrey Garrett, told students that Prof Patton would no longer be teaching the course.\n\n\"It is simply unacceptable for the faculty to use words in class that can marginalize, hurt and harm the psychological safety of our students,\" he said.\n\nThe university says that Prof Patton \"volunteered to step away\" from his role amid the investigation into complaints made against him.\"",
                          "author": "idk7643",
                          "created": 1614270939,
                          "upvotes": 0,
                          "replies": {
                            "goq2gk1": {
                              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goq2gk1/",
                              "text": "Yep, so when you said \"almost got fired\", you were lying. No surprise.",
                              "author": "Adventurous_Map_4392",
                              "created": 1614272201,
                              "upvotes": 3,
                              "replies": {
                                "goq8rjr": {
                                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goq8rjr/",
                                  "text": "What about that is a lie? He got pressured to step down because he said a word in a different language. He got almost fired.",
                                  "author": "idk7643",
                                  "created": 1614274836,
                                  "upvotes": 1,
                                  "replies": {
                                    "goqmdem": {
                                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goqmdem/",
                                      "text": "I can pressure Joe Biden to step down right now, easily. That doesn't mean that Joe Biden was almost fired.\n\nThe irony here is that your views are exactly those you claim to criticize. You are a totalitarian---you demand that every person agree with you, and if they act in a way you don't approve of (ie, by criticizing the professor there), you demand their silence.",
                                      "author": "Adventurous_Map_4392",
                                      "created": 1614279858,
                                      "upvotes": 2,
                                      "replies": {
                                        "goqt6qm": {
                                          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goqt6qm/",
                                          "text": "I believe in free discourse. I believe that people should be able to express their opinions freely, even if they are controversial. Or in this case, it wasn't even an opinion, it was a word in a language.\n\nA professor should only be pressured to step down if he sexually harasses people or grades people based on discrimination. Not because they say things some students don't agree with.",
                                          "author": "idk7643",
                                          "created": 1614282534,
                                          "upvotes": 1,
                                          "replies": {
                                            "gowkw19": {
                                              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gowkw19/",
                                              "text": "Gotta love the contradiction!\n\n>  I believe that people should be able to express their opinions freely, even if they are controversial.\n\nBut, apparently, this doesn't count when criticizing or asking the professor to stand down:\n\n> A professor should only be pressured to step down if he sexually harasses people or grades people based on discrimination. Not because they say things some students don't agree with.\n\nFree discourse for some, shutting up for others.",
                                              "author": "Adventurous_Map_4392",
                                              "created": 1614380554,
                                              "upvotes": 1,
                                              "replies": {
                                                "gowmvnq": {
                                                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gowmvnq/",
                                                  "text": ">But, apparently, this doesn't count when criticizing or asking the professor to stand down:\n\nYou can critize him all you want, but he shouldn't face a threat to his career unless he physically assaults somebody or treats people unfairly",
                                                  "author": "idk7643",
                                                  "created": 1614381186,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gon63ps": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gon63ps/",
      "text": "I think it depends. My university is hiring, at minimum, probably 40-60 tenure track positions. Probably more, honestly. (Our College is hiring 10, which if every College in our University was hiring 10, that would be 170 - I do know one College that is hiring like 15, so I suspect it is on the higher end).\n\nI'm not saying there is not a decline in TT lines - but I think what we are also seeing is the condensing of educational institutes overall and the emergence of larger institutions. The SLAC and non-state-supported schools are increasingly being overrun by the state flagships and research institutes. People (like Georgia) are realizing they don't need 34 state-supported colleges/universities when other states like Arizona do it with 3.",
      "author": "gamecat89",
      "created": 1614210187,
      "upvotes": 98,
      "replies": {
        "gonyqcr": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonyqcr/",
          "text": "seventeen colleges! Wow!",
          "author": "BananasonThebrain",
          "created": 1614223779,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "gonbp24": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonbp24/",
      "text": "Rather than it just ending and there not being any TT positions, TT positions are just going to become worse and worse until they aren't worth having anymore.  They've already hit that point for me and many others.",
      "author": "TADodger",
      "created": 1614212965,
      "upvotes": 20,
      "replies": {
        "gonc69q": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonc69q/",
          "text": "When you say \"worse\", what do you mean?",
          "author": "gggggggggggfff",
          "created": 1614213192,
          "upvotes": 11,
          "replies": {
            "gonmqjt": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonmqjt/",
              "text": "Low pay, high demand. In the case of biomedical science the percentage of your salary paid by the university is becoming less and less. My University has gone from a garunteed 70% to 40% in the past 7 years. So, if your starting pay is 100k, they will only give 40k, the rest needs to be made up in grants. However, most grants will not cover 60k of salary, maybe 30, so you need to maintain several grants at a time to maintain that actually salary. It's terrible job security and only getting worse. Some universities only cover 20%, some less. Obviously it depends on teaching load, but even while teaching a class it's not very good.",
              "author": "ActionXPotential",
              "created": 1614218133,
              "upvotes": 22,
              "replies": {
                "gonn5ab": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonn5ab/",
                  "text": "Thanks. This is good to know. I'm not in a grant-related field, so this is informative.",
                  "author": "gggggggggggfff",
                  "created": 1614218322,
                  "upvotes": 9,
                  "replies": {}
                },
                "gonvn8n": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonvn8n/",
                  "text": "Yikes",
                  "author": "TakeOffYourMask",
                  "created": 1614222280,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gonmn6d": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonmn6d/",
      "text": "We lost several TT faculty over the past two years. In return we are getting one TT hire and one instructor hire approved (hopefully). It’s depressing because I think that students really benefit from having faculty who are engaged in research. It’s tough staying on top of the literature when you’re teaching a 4-4 and getting paid 20k less than the TT faculty.",
      "author": "QueenAsphyxiaXIX",
      "created": 1614218090,
      "upvotes": 20,
      "replies": {}
    },
    "gon8lp0": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gon8lp0/",
      "text": "FWIW, in my Counseling Psych PhD program at a major R1, we've hired like 6 TT positions in the last few years and have laid off almost 100% on non-TT faculty (which was quite a number of people). It's either grad students or TT/tenured faculty teaching all courses.",
      "author": "intangiblemango",
      "created": 1614211415,
      "upvotes": 40,
      "replies": {
        "gooflim": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gooflim/",
          "text": ">It's either grad students\n\nSounds like the school only cares about money and not about giving a good education...",
          "author": "MonstarGaming",
          "created": 1614233988,
          "upvotes": 10,
          "replies": {
            "goojb8w": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goojb8w/",
              "text": "Lol, I mean, yes, of course. I would not have had a good experience as an undergrad at my current institution (I went to a SLAC for undergrad and have a general preference for more liberal arts-y, PUI models for undergrad). \n\nEven setting the grad student piece aside, firing all the non-TT faculty also meant firing anyone whose primary priority was teaching and not research. (We do have some good instructors-- but teaching undergrads is certainly a side task to their \"real\" job, which is research, followed by mentoring grad students.) \n\nBut if the question is whether there are places increasing both their number and percentage of TT jobs within the department, the answer is yes. There are.",
              "author": "intangiblemango",
              "created": 1614236891,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gon20yn": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gon20yn/",
      "text": "In biomed, it's all mostly soft money (paid from external grants) researchers already. I'm not even thinking about TT.",
      "author": "hlynn117",
      "created": 1614208255,
      "upvotes": 50,
      "replies": {
        "gon3xdr": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gon3xdr/",
          "text": "Do these positions require teaching or are they research-only positions?",
          "author": "gggggggggggfff",
          "created": 1614209149,
          "upvotes": 8,
          "replies": {
            "gon511v": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gon511v/",
              "text": "Depends on how each specific position is structured. There's definitely a research over teaching focus at most places I've been, but it really depends on the department.",
              "author": "hlynn117",
              "created": 1614209676,
              "upvotes": 15,
              "replies": {}
            },
            "goo4jg2": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo4jg2/",
              "text": "I’m in the biomedical sciences and faculty in medical schools usually only need to teach graduate courses and are expected to focus on research (and bringing in grants), while non-medical departments usually require a higher teaching load. Typically non-medical faculty get more of their salary from the school so while teaching takes away from research it also can guarantee your salary if you have gaps in funding.\n\nIt really depends on the department, some let you “buy out” of teaching if you have grant funds that cover your salary. There’s a lot to consider when looking for positions.",
              "author": "Pathological_RJ",
              "created": 1614226897,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "goo5eq8": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo5eq8/",
      "text": "We're still hiring tenure track. Our tenure track is almost entirely based on teaching, then service and research is third. We're in a small town in the Midwest and struggle to get a lot of candidates. We have so many failed searches.",
      "author": "two_short_dogs",
      "created": 1614227380,
      "upvotes": 8,
      "replies": {
        "goofife": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goofife/",
          "text": "I'm a grad student, and a position like that would be my dream job. Would you mind if I messaged you to learn more about that kind of work environment?",
          "author": "throwAwayTA2018",
          "created": 1614233925,
          "upvotes": 5,
          "replies": {
            "gosp6kg": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gosp6kg/",
              "text": "Sure. I'm at a SLAC and I think most SLACs are teaching focused",
              "author": "two_short_dogs",
              "created": 1614315180,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gondsy4": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gondsy4/",
      "text": "<gif of Indiana Jones making it under closing door>",
      "author": "drpicoloco",
      "created": 1614213968,
      "upvotes": 14,
      "replies": {}
    },
    "gond7rb": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gond7rb/",
      "text": "Not over yet, but reduced.  At my school,  top ten in research for our field of study,  one new hire for every two TT that retire or leave.   We are an old faculty so an entire school's tenured faculty will be halved in a decade+.  I don't know the policy at other schools like the med or law school.",
      "author": "TheProfessorO",
      "created": 1614213689,
      "upvotes": 12,
      "replies": {}
    },
    "gomwmhx": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gomwmhx/",
      "text": "Yes, the TT era is ending. \n\nAt most universities now, when folks retire, their TT lines are not replaced.  The departments have to make a case to the administration for replacement.  In my department, three people just retired, and we managed to get one TT line.   The administration would rather fund f/t instructors than hire TT. \n\nThis is ethically wrong, and sets up inequity and conflict within a department.  But it is just one more instance of neoliberalism at work. \n\n[https://www.thenation.com/article/society/gig-academy-meritocracy-trap-universities-crisis/](https://www.thenation.com/article/society/gig-academy-meritocracy-trap-universities-crisis/)",
      "author": "matthewsmugmanager",
      "created": 1614205818,
      "upvotes": 115,
      "replies": {
        "goncj6l": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goncj6l/",
          "text": "But wait, are the admins still well compensated? That's what really matters.",
          "author": "Ut_Prosim",
          "created": 1614213363,
          "upvotes": 46,
          "replies": {
            "gonnhr0": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonnhr0/",
              "text": "> are the admins still well compensated?\n\nI think we need a committee headed by three new Vice Presidents to find out the answer to this question.",
              "author": "newpua_bie",
              "created": 1614218484,
              "upvotes": 46,
              "replies": {
                "gonow6c": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonow6c/",
                  "text": "I mean, if we must, I volunteer to do it.\n\nMy qualifications are my dad was a booster of the football team, I golf with the provost, and I was middle-manager at large corporation that has absolutely nothing to do with education.",
                  "author": "Ut_Prosim",
                  "created": 1614219144,
                  "upvotes": 28,
                  "replies": {
                    "goo00e2": {
                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo00e2/",
                      "text": "oops you're now the president of a small college",
                      "author": "guttata",
                      "created": 1614224439,
                      "upvotes": 21,
                      "replies": {
                        "goo0mhk": {
                          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo0mhk/",
                          "text": "Sweet. Seems this small college pays their faculty on average 52k a year, so I'm thinking, $700-800k + a company car sounds about right for me?!",
                          "author": "Ut_Prosim",
                          "created": 1614224762,
                          "upvotes": 16,
                          "replies": {
                            "goo1rqs": {
                              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo1rqs/",
                              "text": "Don't forget your on-campus mansion. However, if you'd prefer to live off campus we can also offer you a $10k monthly housing allowance.",
                              "author": "guttata",
                              "created": 1614225373,
                              "upvotes": 15,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gost6hz": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gost6hz/",
              "text": "I found out the admin who is responsible for replenishing our monthly account at our stockroom makes 140k a year, yet they still can't manage to submit forms on time.",
              "author": "gadget399",
              "created": 1614317812,
              "upvotes": 2,
              "replies": {
                "gottmyp": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gottmyp/",
                  "text": "WTF... what title do they have?",
                  "author": "Ut_Prosim",
                  "created": 1614347227,
                  "upvotes": 1,
                  "replies": {
                    "gov2fj7": {
                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gov2fj7/",
                      "text": "Administrative assistants and there are two of them 🥳",
                      "author": "gadget399",
                      "created": 1614364138,
                      "upvotes": 2,
                      "replies": {
                        "govbv94": {
                          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/govbv94/",
                          "text": "The admin assistant makes 140k?",
                          "author": "Ut_Prosim",
                          "created": 1614367201,
                          "upvotes": 1,
                          "replies": {
                            "goy4wzr": {
                              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goy4wzr/",
                              "text": "Yeah its bonkers, and they don't have that high of a workload as its a small department and there are a few of them. All of them made 137k last year according to our public salary disclosure.",
                              "author": "gadget399",
                              "created": 1614402459,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "goswyjh": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goswyjh/",
              "text": "true that...  though if you are in the Big Ten, the real dough comes with the football coach position...",
              "author": "Lagrange-squared",
              "created": 1614320595,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gop28tc": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gop28tc/",
          "text": "Can't even escape neoliberliasm in our ivory towers any more...",
          "author": "CompletelyClassless",
          "created": 1614253924,
          "upvotes": 1,
          "replies": {}
        },
        "goq2k6w": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goq2k6w/",
          "text": "> \n> At most universities now, when folks retire, their TT lines are not replaced.\n\nI mean, this is just false.",
          "author": "Adventurous_Map_4392",
          "created": 1614272242,
          "upvotes": 0,
          "replies": {}
        },
        "gona1jq": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gona1jq/",
          "text": "Have people moved on from calling everything they don’t like “neoliberalism” instead of “fascism”?\n\nEDIT:\n\nDownvoters should talk to the people in their economics departments, and try to learn why market-based economies prevail and centrally-planned ones fail.\n\nhttps://fee.org/articles/neoliberalism-the-left-s-eternal-boogeyman/",
          "author": "TakeOffYourMask",
          "created": 1614212137,
          "upvotes": -46,
          "replies": {
            "gonapdr": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonapdr/",
              "text": "dae calling the economic policies known as neoliberalism by name is for crybabies?",
              "author": "ExtraFig6",
              "created": 1614212468,
              "upvotes": 40,
              "replies": {}
            },
            "gonhkka": {
              "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonhkka/",
              "text": "Neoliberalism is a precise and useful concept. I'm convinced people who wave it off as a vague catch-all boogeyman haven't read any political economic theory. By the way, a Temple physicist wrote a great piece decades ago about the shift he was seeing in university funding models towards the \"Resource Center Management\" model. This model perfectly encapsulates neoliberalism. [http://199.223.128.59/assets/img/PubThoughtAndAction/TAA\\_97Spr\\_07.pdf](http://199.223.128.59/assets/img/PubThoughtAndAction/TAA_97Spr_07.pdf)",
              "author": "gestalt_switching",
              "created": 1614215756,
              "upvotes": 24,
              "replies": {
                "gonn4qi": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonn4qi/",
                  "text": "Hi, thanks for the article. Question: what is this ip address sorcery? I've never seen anyone link directly to an ip address like this using a url. Is there a reason for this? Is the pdf hosted on some sort of private server?",
                  "author": "ExtraSmooth",
                  "created": 1614218315,
                  "upvotes": 2,
                  "replies": {
                    "gonnnxu": {
                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonnnxu/",
                      "text": "That seems to be an old website of National Education Association. I wonder if it's an old server of theirs that's still running the website or someone's private mirror.",
                      "author": "newpua_bie",
                      "created": 1614218564,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "gonoanq": {
                      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonoanq/",
                      "text": "I actually didn't notice this was linking to an IP address, weird - I just did a quick Google search for the first pdf link to the article I could find. It's *Beware Higher Ed's Newest Budget Twist* by Leroy W. Dubeck if you'd like to find it elsewhere.",
                      "author": "gestalt_switching",
                      "created": 1614218863,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gontpy6": {
                  "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gontpy6/",
                  "text": "I used to read nothing *but* economic theory.",
                  "author": "TakeOffYourMask",
                  "created": 1614221372,
                  "upvotes": -5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gonxmq9": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonxmq9/",
      "text": "The story at my university (big public R1, but admits most applicants, US) - warning, not for the faint of heart:\n\nTo the best of my knowledge, we are not only hiring no TT professors at all this year or next, but also hiring no (or almost no) non-TT lines either. We hired very few last year too, even before the pandemic made everything that much worse. Our budget is highly dependent on tuition revenue, and thanks to the demographic trends others have mentioned, it has been shrinking fast. \n\nMany of our departments have no assistant professors and haven't been able to hire one for close to a decade. We're being told now that we should get used to a smaller faculty and not to expect retiring/departing professors to be replaced. I think it's a bit easier for more prestigious/selective universities (they can always admit more students if they need to), but many of them are struggling too.\n\nI don't know if the era of TT is ending just yet (it certainly is under threat in many places), but my impression from everything I've read is that the number of TT lines relative to non-TT is definitely decreasing overall. Also, I think that TT jobs are less attractive and cushy than they used to be, unless (perhaps) you're a superstar at an elite university. I routinely recommend that PhD students consider alternative career tracks (and that applicants to PhD programs consider alternative plans altogether).",
      "author": "tlamaze",
      "created": 1614223222,
      "upvotes": 11,
      "replies": {}
    },
    "gonsz4g": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonsz4g/",
      "text": "This year is obviously awful, but before this year there weren't fewer TT jobs than there were say 30, 40 years ago. Actually there were more now. TT jobs just haven't kept pace with the number of students enrolling in college nor with the number of PhDs--we produce an incredible number of PhDs at this point. Tenured faculty members are too selfish to admit fewer graduate students, because they prefer teaching graduate students to undergraduates and because having a larger graduate program makes them feel more prestigious.",
      "author": "anonybss",
      "created": 1614221028,
      "upvotes": 7,
      "replies": {}
    },
    "gonavoh": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonavoh/",
      "text": "No, but we're producing way more PhDs than we need, and more than we were just a couple decades ago; probably double now per year than we did in 1970.\n\nThe number of jobs hasn't increased at pace with supply.\n\nIt's a high prestige, generally cushy job. So it is rather competitive.",
      "author": "ph0rk",
      "created": 1614212557,
      "upvotes": 20,
      "replies": {
        "goncrje": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goncrje/",
          "text": "We’re also over double the Earth’s population from 1970, so if globally there were also double the PhDs per year it would make sense on some level",
          "author": "Kolbrandr7",
          "created": 1614213473,
          "upvotes": 22,
          "replies": {}
        }
      }
    },
    "gonayy6": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonayy6/",
      "text": "I dunno, my department has been hiring a TT per year for the past four years. Finally recovering from 2008-era austerity and replacing retired professors, mostly. Perhaps big land grants are hanging on to outdated practices though.",
      "author": "Semantix",
      "created": 1614212603,
      "upvotes": 16,
      "replies": {}
    },
    "gon8795": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gon8795/",
      "text": "Universities that want to remain competitive to retain talent who bring in grant money with indirects will continue to offer TT jobs.",
      "author": "zinfandelightful",
      "created": 1614211215,
      "upvotes": 21,
      "replies": {
        "goncxs4": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goncxs4/",
          "text": "I wish that were true but too many academics love to undervalue their own work so much that it's a race to the bottom. The amount of unpaid work academics are already willing to do to get even a shitty job these days is evidence for that.",
          "author": "Grumblepuffs",
          "created": 1614213558,
          "upvotes": 16,
          "replies": {}
        },
        "gonpx3o": {
          "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonpx3o/",
          "text": "No need to remain competitive when the pool is so full that excellent researchers who 20 years ago would have easily achieved a full TT position after one postdoc are now leaving academia after 3. If you love science and research THAT much they don’t need to incentivize you more",
          "author": "dcnairb",
          "created": 1614219624,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "gonel67": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonel67/",
      "text": "I’m at a state school in the social sciences and there are no talks like what you describe. In 2015 they hired 5 faculty, then 1, then none, then 2 and then Covid happened. It is difficult to get a TT position, but positions are out there and faculty are pushing for more TT lines (job openings). It feels like the humanities have it the worst. If you pursue or are pursuing a PhD in the social science make sure you have a job outside of academia in mind. This job should make you just as excited and it is something you will prepare for simultaneously. Think of it less a s a back up but as another route to success.",
      "author": "drpicoloco",
      "created": 1614214345,
      "upvotes": 10,
      "replies": {}
    },
    "goo5l5g": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goo5l5g/",
      "text": "God I hope not, because instead of hiring anybody (including adjuncts) they want us all to overload. I like the money, A LOT, but ten years from now I'm going to be pissy.",
      "author": "phoenix-corn",
      "created": 1614227481,
      "upvotes": 4,
      "replies": {}
    },
    "goobkm1": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goobkm1/",
      "text": "This has already happened in many countries, Australia included. So yeah it is quite likely this will be the new norm. It's a lot cheaper to hire new people all the time: get PhDs and Postdocs to do most of the research work for cheaper",
      "author": null,
      "created": 1614231163,
      "upvotes": 4,
      "replies": {}
    },
    "gonzb48": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonzb48/",
      "text": "I work at an r2 sociology department and while this year we were not able to pre emptively  replace someone who is retiring in may, we have been told we can run the search next fall. We also hired 7 tt people in my department in the 3 years before covid- 5 replacements for retirees/a death, and 2 new positions as a result of growth in majors.  I think it depends on the school to some extent. Small private not highly ranked schools are on a sharp decline, but affordable public schools like mine are expanding with students as a result. State budget issues are probably going to prevent us hiring new expansion positions in the next few years but we will probably be able to replace retirements or people who leave at least.  Although the guy retiring this year is the last baby boomer in the department and the next oldest person is like mid 50s I think so may be a while on more retirements...",
      "author": "abandoningeden",
      "created": 1614224074,
      "upvotes": 3,
      "replies": {}
    },
    "goooqwf": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/goooqwf/",
      "text": "I completed my PhD in physics a couple years ago and was immediately hired for a TT position at a regional university.  For context, my institution is teaching focused and I made sure to develop my skills and resume for exactly this kind of position.  My end goal throughout my graduate study was to go to a teaching focused institution so I made sure to take every opportunity I could to make myself a more desirable candidate.  \n\nThat being said, I applied for many, many positions and a good number of them were not TT.  I saw a surprising number of non-TT positions that were full time and permanent.  These places were trying to establish separate \"teaching\" (non-TT) and \"research\" (TT) focused tracks.  The non-TT positions were generally lower starting salary with a higher teaching load, but had no research requirements and the same advancement opportunities (i.e. assistant, associate, and full professor).",
      "author": "PhysicsIsPants",
      "created": 1614241618,
      "upvotes": 3,
      "replies": {}
    },
    "gonibbi": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gonibbi/",
      "text": "I'm currently part of and have previously been part of a W3 tenure track commission. At our university department there are currently like 3-4 (or more, can't keep track) commissions open for various positions from junior to long-term. It feels like every few weeks we have to find new people for commission positions to fill everything. A bunch of old profs have to find fitting replacements. You might just need to look in a broader spectrum.\nEdit: Computer Science, Germany. We just got major federal grants for excellence, so we have new research groups like robotics, collective behaviour, etc",
      "author": "Magickmaster",
      "created": 1614216103,
      "upvotes": 2,
      "replies": {}
    },
    "gop1yve": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gop1yve/",
      "text": "Our 5000 student baccalaureate institution in the state university system (Georgia) is hiring TT faculty. I chaired social sciences until I retired 18 months ago. I had 22 TT faculty and 2 lecturers. I had 2 or 3 adjuncts. Our campus hired about 10 TT people as the pandemic started last year. The other departments and schools on our campus is the same. We're not reducing TT lines.",
      "author": "rockyfaceprof",
      "created": 1614253702,
      "upvotes": 2,
      "replies": {}
    },
    "gpblbr6": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gpblbr6/",
      "text": "Is tenure at a satellite campus at a state university and below really worth all that much? These jobs don’t compete particularly favorably with other jobs in industry or government. Some jobs in high schools are better.",
      "author": "sluox777",
      "created": 1614621061,
      "upvotes": 1,
      "replies": {}
    },
    "gontn55": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gontn55/",
      "text": "This reminds me of when I fall asleep watching a movie, wake up as the credits are just ending, and ask \"is it over?\" \n\nIt's probably over for those who aren't geniuses. There are too many graduates.",
      "author": "Tahh",
      "created": 1614221336,
      "upvotes": 1,
      "replies": {}
    },
    "gon958b": {
      "link": "/r/AskAcademia/comments/lroa36/is_the_tenuretrack_job_era_over/gon958b/",
      "text": "Yes.\n\nPeople should leave academia after their PhDs unless they’re rich.",
      "author": "TakeOffYourMask",
      "created": 1614211686,
      "upvotes": -2,
      "replies": {}
    }
  }
}