{
  "sid": "ctrrfm",
  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/",
  "title:": "How to be kind but clear when telling a hopeful grad student that their academic record does not meet expectations?",
  "text": "Pretty much the title, but for context:  \n  \n\nMore and more often I'm getting email requests from senior undergrads in my dept who are considering grad school and want to apply to my lab. These are students I have not taught myself, but this isn't unusual since I'm a new prof. When I check their academic records, I am sometimes surprised to find that they have Cs and Ds in relevant courses. I tend to offer to meet with them anyway, because I like to see how they speak about their research interests, career aspirations, and see if they offer any explanation for their course performance.  \n  \nIf the meeting does not improve the situation, I have a really hard time deciding how best to communicate to these students that it's a no. Should it be in person or by email? If it's by email, how do I close the meeting, since I definitely know by that point it's a no?  \n  \nAnd how do I tell them without kicking them while they're down? Should I simply thank them for their interest and say I can't offer them a position? It seems too harsh to say outright that their academic performance does not meet my expectations for a beginning graduate student. Should explanations like these be reserved for cases in which the student specifically asks for feedback? Help me, please.",
  "author": "misagon",
  "created": 1566444466,
  "updated": 1634081766,
  "over_18": false,
  "upvotes": 121,
  "upvote_ratio": 0.97,
  "comments": {
    "exn81pf": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exn81pf/",
      "text": "As someone who just completed a round of applications and didn't get in, I would have LOVED more critical feedback on low points in my application. As much as it sucks to hear, it's going to suck more to waste 100s-1000s of dollars applying to schools if there is a high chance they they aren't going to get in because of their academics.\n\nThat being said, I had a friend who worked in the same lab that I did and he had an advisor tell him that he wouldn't be taken seriously by grad schools (very bluntly) for whatever reason (lack of research experience I think) and he was devastated. He completely stopped doing research, ended up not applying at all, and basically gave up all his plans of getting a PhD. So make sure whatever you say it's tactful and helpful not just negative.",
      "author": "HIPearson",
      "created": 1566448426,
      "upvotes": 114,
      "replies": {
        "expo6pv": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/expo6pv/",
          "text": "I think there's a difference between telling a student \"you will never get into grad school with these grades\" (possibly true, but maybe wrong) and \"our program typically accept students with grades in the range of XX-YY and you would need a minimum of XX to be considered at all\". That leaves it to the student to explore other possibilities and means the supervisor isn't making a blanket statement that may or may not be true.\n\nThe other thing is this: assuming the student is unlikely to get into a certain kind of program, it would make a big difference if an advisor could help the student explore other ways in which they can pursue these interests, e.g., other kinds of postgrad programs, or even career choices that would fit their interests and training.",
          "author": "drmarcj",
          "created": 1566492498,
          "upvotes": 35,
          "replies": {}
        }
      }
    },
    "exn5act": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exn5act/",
      "text": "Be honest, but don’t be a dick.\n\nI really appreciate your interest and I think you have a lot of potential.  I don’t think you’re a good match for my lab, but if you’re serious about getting involved in research, here are a few other ways to get involved.\n\nThen, list a bunch of fellowships and programs they can apply for either in your department or nationally.\n\nI have a whole list of things in my field for students who are serious and want to put in the work.\n\nIf they are serious, they’ll thank me, go apply, get it, show they’ve got what it takes, and I will have made an ally.  If they’re not serious, they’ll walk away rejected, but I at least threw them a life preserver.  If they still drown, you can’t blame me as I did everything I could and left them with a positive message.",
      "author": "nramos33",
      "created": 1566446590,
      "upvotes": 132,
      "replies": {
        "exolxag": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exolxag/",
          "text": "This is reasonable feedback in some sense, but isn't it ethically dubious to encourage a student that OP has described as receiving Cs and Ds to go out and apply for nationally competitive fellowships? \n\nTo pick up on your analogy yes its like throwing a life preserver to someone who is drowning, but what if that person doesn't have any arms or hands to grab it with? Are you still really offering help at all or are you just saying you did something so that \"you can't blame me\"?",
          "author": "TrustMeIAMAProfessor",
          "created": 1566478489,
          "upvotes": 32,
          "replies": {
            "exor3t4": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exor3t4/",
              "text": "I don’t think it’s ethically dubious.  It’s up to those organizations to determine what is right for them.  They may not care about GPA and are focused more on the CV and cover letter.\n\nSome people are terrible in the classroom, but are great at communicating their interests outside of the classroom.  As an undergraduate, I sucked as a journalism student and had a bad GPA.  However, I was a good reporter and was interviewing United States Senators, had my own radio show, TV show, and wrote for multiple newspapers.  \n\nPerformance in the classroom doesn’t always mean someone is going to be a success or a failure.  We shouldn’t throw a student away and deprive them of opportunities because they got a few bad grades.",
              "author": "nramos33",
              "created": 1566480589,
              "upvotes": 13,
              "replies": {
                "exosnrw": {
                  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exosnrw/",
                  "text": "I agree with you, but I don't think the vast majority of national fellowship award committees agree with you. A national award committee can find someone who did all the same things you did as a young journalist but also had a 4.0 GPA. I'm not saying its right or that I agree with it, I just feel like its a terrible idea to routinely tell students who very likely have no hope for these fellowships that this is somehow their next logical move. Isn't there a point where we need to be more realistic?",
                  "author": "TrustMeIAMAProfessor",
                  "created": 1566481202,
                  "upvotes": 18,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "exn956h": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exn956h/",
      "text": "\"I think you have a lot of potential, but the work we do in my lab really requires a strong background in X, and from your transcripts I'm not sure you have that at this point. I don't like to take on students who I think are going to struggle unnecessarily with fundamentals in X. I think if you are really serious about this lab and this topic, you might need to take another course or two in X just to strengthen that background. Otherwise, I'd encourage you to reach out to my colleagues studying Y and Z, since you seem to have done very well in those topics\" (or, alternatively \"I'd encourage you to reach out to other faculty members, we all have different expectations and strengths, one of them may be better able to mentor you through the topics you seemed to struggle in should you be a good fit for their lab\")",
      "author": "blackandwhite1987",
      "created": 1566449200,
      "upvotes": 69,
      "replies": {}
    },
    "exoirmk": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exoirmk/",
      "text": "So I didn't have a very strong academic record, thanks to some undiagnosed mental problems, but I did have good test scores. What helped me the most was a professor, who was not looking to take me in as a grad student, sitting down with me and figuring out how to present myself best and which schools would be less likely to care about my undergrad grades, that still had good programs at least tangentially related to my interests. \n\nI had also had a professor sit down with me while I was in undergrad and suggest I take a few years away from school before deciding on higher education. I got a job in academic research, so I had some papers and experience to my name, and took some courses in my interests for free as an employee, getting much better grades since I only had one class at a time to focus on.\n\nI got rejected by 5/8 of the programs I applied for, accepted at 2 that that professor specifically recommended for me, and 1 a postdoc recommended for similar reasons. My applications focused on the research and coursework I'd done *after* undergrad, and the research I was interested in pursuing. I picked the one that suited me best and got my PhD there.\n\nIf you're genuinely interested in helping them, maybe it would be better to frame the meeting differently. If they went into the meeting knowing you 'weren't really looking for new grad students' but that you were willing to help them figure out some programs to apply for that they might not have thought of, they would not be expecting the meeting to result in an offer. That still gives you room to make an offer if the meeting goes unexpectedly well, though it does mean you'd have to look into a couple of schools with looser GPA requirements. Having a meeting with the purpose being 'to give advice on applying to grad school' would take that expectation off you, so when you don't offer a position it wouldn't be seen as a kick.\n\nI think it's probably best to be honest about their application weaknesses, as long as you can give some constructive advice along with that. You don't know that they aren't cut out for research, you do know that they wouldn't be suited to your lab in your school's grad program, so offer advice that gets them closer to doing research with the record they currently have. Being told 'your GPA is really weak, and there are a lot of schools that will reject you based entirely on that' stung, but the conversation that followed was supportive and helpful for furthering my research goals in a way no one else had ever been.\n\ntl;dr don't let them go into the meeting expecting an offer, and don't kick them unless you can also help and encourage them to get past it",
      "author": "alittleperil",
      "created": 1566477232,
      "upvotes": 15,
      "replies": {}
    },
    "exn5xvn": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exn5xvn/",
      "text": "[deleted]",
      "author": null,
      "created": 1566447017,
      "upvotes": 29,
      "replies": {
        "exqlh4r": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exqlh4r/",
          "text": "This. Don’t leave them wondering what went wrong or they’ll never know what to improve. You also don’t want them blaming everyone and everything else if the issue was something they had control of.",
          "author": "PhD4Hire",
          "created": 1566503925,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "exn80fn": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exn80fn/",
      "text": "Don't they have to apply and get accepted to the program before getting a commitment with a lab, or can you fast track them? Wish them luck on the application process but warn them that their GPA might be an obstacle.",
      "author": "kyew",
      "created": 1566448402,
      "upvotes": 11,
      "replies": {
        "exocacw": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exocacw/",
          "text": "In STEM, most schools don’t even look at your app unless a particular advisor pulls it out because they have already chosen you. There’s no point in applying otherwise.",
          "author": "knewtoff",
          "created": 1566474012,
          "upvotes": 6,
          "replies": {
            "exoyb75": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exoyb75/",
              "text": "[deleted]",
              "author": null,
              "created": 1566483474,
              "upvotes": 9,
              "replies": {
                "exphgpi": {
                  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exphgpi/",
                  "text": "Agreed; which is why I said most :)",
                  "author": "knewtoff",
                  "created": 1566490357,
                  "upvotes": 0,
                  "replies": {
                    "expjadf": {
                      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/expjadf/",
                      "text": "Let's say \"some?\" Maybe it's heavily field dependent but I was never even told contacting specific advisors before applying would help.",
                      "author": "kyew",
                      "created": 1566490990,
                      "upvotes": 5,
                      "replies": {
                        "expy5qn": {
                          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/expy5qn/",
                          "text": "> Maybe it's heavily field dependent\n\nAlso institution dependent and even advisor dependent. I've heard of places where the department's admissions committee says to the rest of the faculty, \"Here's the incoming cohort. Recruit whoever you want for your lab.\" I've also heard of admissions committees saying, \"Acceptance letters go out to every applicant any professor has committed to fund.\" Individual professors might have a lot of influence over admissions or only a little; how they use what influence they have is ultimately up to them.",
                          "author": "east_lisp_junk",
                          "created": 1566495686,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "exos2dk": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exos2dk/",
              "text": "Well, it varies. My experience applying for bioinformatics PhD was I got to the interview phase at Brown (tiny program) but didn't get in because there weren't any labs that were a good fit, I'm at BU (large program) where you spend the first year doing at least three rotations and pick a lab in year two.",
              "author": "kyew",
              "created": 1566480976,
              "upvotes": 3,
              "replies": {
                "exphkw0": {
                  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exphkw0/",
                  "text": "Yeah I applied for a school that was similar; but I wanted to be done in two years so I decided not to go there. Of the ~12 schools I was interested in going, only that one was structured that way.",
                  "author": "knewtoff",
                  "created": 1566490403,
                  "upvotes": 2,
                  "replies": {
                    "exprgdl": {
                      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exprgdl/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1566493539,
                      "upvotes": 1,
                      "replies": {
                        "exqmdet": {
                          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exqmdet/",
                          "text": "Sorry, masters! Oh goodness I wouldn’t trust a two year PhD though that would sound nice...",
                          "author": "knewtoff",
                          "created": 1566504329,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "exqqc26": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exqqc26/",
              "text": "This is not the case in mathematics or physics.",
              "author": "Homomorphism",
              "created": 1566506030,
              "upvotes": 1,
              "replies": {
                "exr167r": {
                  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exr167r/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1566509870,
                  "upvotes": 2,
                  "replies": {
                    "exr2flg": {
                      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exr2flg/",
                      "text": "> It's not like there's no point to applying without having a professor vouching for you\n\nThat was the claim I was responding to, though. There's a big difference between \"being admitted to a lab makes it much more likely you'll be admitted\" and \"only apply if you've been admitted to a lab.\"\n\nIt's also completely false for mathematics.",
                      "author": "Homomorphism",
                      "created": 1566510260,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "exngrz5": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exngrz5/",
      "text": "Maybe it's different in your country but I can hide behind our institutional admissions policy to some extent. I can tell students honestly that it's not wholly my decision and the University requires evidence of a certain level of performance in all but the most exceptional cases. \n\nIf you have some more autonomy than I do over who you can accept, then I wouldn't automatically dismiss someone with a couple of lower grades here and there.",
      "author": "GSVQuietlyConfident",
      "created": 1566455757,
      "upvotes": 11,
      "replies": {}
    },
    "exof61y": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exof61y/",
      "text": "this is how a professor from my department rejected me:\n\nI don't think a project in my lab is a good idea.  I think that the trouble you had with both the exam and final project in xxx is a good indication that projects in my lab would likely not be successful. Because I am time constrained this year, I also think that I would not be able to support an independent study as much as would be needed.  In any case, I'm sorry to give you a negative response and wish you the best in finding a good project.\n\n(I copied his email directly. imo you’re already very nice to give them all a chance, this professor didn’t even bother talking to me)",
      "author": "Pattt2602",
      "created": 1566475423,
      "upvotes": 11,
      "replies": {}
    },
    "exp72xt": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exp72xt/",
      "text": "It sounds like checking the academic records in the first place is giving a bad impression before you meet with the students. Since you are willing to meet with them, though, and still consider giving them a spot with your group, it sounds like this doesn't turn out to be about the grades in the end. Have you considered not asking for their academic records prior to your meetings?\n\nAnecdotally, I ran an NSF REU program a few years ago and we accepted a few students with lower GPAs (but excellent applications otherwise) to see how they'd do and they did fantastic. In the end, one of these students won our internal travel award for the excellent summer research they conducted. Of course, this doesn't mean that all students with poor GPAs (in relevant courses) will do well, but it's something to keep in the back of your mind.\n\nTo answer your question of how to best let them down gently? That is a tough question. I'd recommend being honest and letting them know directly, but with compassion. This is most easily done in person (as text can leave a lot of ambiguity in tone). If you can, suggest other places they may be able to do research or give suggestions on how to improve their \"application packet.\"",
      "author": "Esmereldista",
      "created": 1566486754,
      "upvotes": 5,
      "replies": {}
    },
    "exn7k8d": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exn7k8d/",
      "text": "> hopeful grad student that their academic record does not meet expectations?\n\n\nFirst, you're doing *yourself* a disservice if you actually care about their grades while looking for someone to conduct research for you. GPA does not correlate with research success at any level, all the way up through professorships. Go ahead and ask your own department for their data and see for yourself. Many graduate schools are ditching GRE scores as requirements because again, they offer zero predictive power for success in grad school. (Sidenote: some student fellowships require GPA cutoffs and therefore can skew the data depending on how you measure \"success\").\n\nMy favorite story is from Abigail Salyers, former president of the American Society for Microbiology. She was asked to review medical student applications for the UIC med school. When she met with the rest of the committee to share their picks she literally threw away the applications that had a GPA above 3.5. She told the search committee she polled the life science departments at U of I and found the average professor's undergrad GPA was 3.3. She found she ran a smoother lab when her students had more diverse, less academic heavy bsckgrounds. \n\nShe...wasn't asked back to review the following years applications. \n\nWe are raised to respect GPA, but when it comes to upper level research it is literally useless as a tool to distinguish between who will be successful and who will not. I'm not saying there's a particular reason for that, just that it's what we see. \n\n> If the meeting does not improve the situation, I have a really hard time deciding how best to communicate to these students that it's a no.\n\nIt is GREAT that you still meet with them!  If you've met with them and decided not to take them then it is no longer about their grades. You could just say you've met with a lot of other students and you've chosen someone else that is a better fit for the lab. If they ask for constructive critisism you can of course tell them that for you, grades are important (and that grad school committees still use them as a filter, mostly because of fellowship or training grant GPA requirements). \n\nFor your own sanity, remember in the real world rejections often come with complete silence so anything you give them is better than nothing. \n\n\nMoral of the story is chose who you think is the best for for your lab when you meet them, not necessarily who is the best on paper. Saying you found someone with better \"fit\" can sometimes be the simplest answer.\n\nEDIT: For those interested in the research looking into if GPA and test scores are relevant to finding successful researchers (spoilers, they're not, even subject specific tests) here are two quick write ups reviewing some literature: \n\n\nhttps://www.sciencemag.org/careers/2017/06/gres-dont-predict-grad-school-success-what-does\n\nhttps://www.inverse.com/article/52691-gre-scores-are-a-bad-predictor-of-phd-success",
      "author": "pastaandpizza",
      "created": 1566448098,
      "upvotes": 47,
      "replies": {
        "exod2bp": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exod2bp/",
          "text": "> First, you're doing yourself a disservice if you actually care about their grades while looking for someone to conduct research for you.\n\nYou didn't read their post.\n\nGrades aren't everything, but bad grades and a bad work ethic is basically everything.\n\nIf I were running a chemistry lab, I wouldn't want research assistants that had to retake organic chem twice and consistently earned D's in lab sections - if I had others to choose from, anyway.",
          "author": "ph0rk",
          "created": 1566474273,
          "upvotes": 9,
          "replies": {
            "exokmhk": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exokmhk/",
              "text": "I did read their post and I tried to address that in my reply:\n\n> It is GREAT that you still meet with them! If you've met with them and decided not to take them then it is no longer about their grades.",
              "author": "pastaandpizza",
              "created": 1566477986,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "exnaym1": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnaym1/",
          "text": "[deleted]",
          "author": null,
          "created": 1566450557,
          "upvotes": 36,
          "replies": {
            "exomqnq": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exomqnq/",
              "text": "My best professor at a top R1 had a 2.2 Ugrad GPA... said he didn't know what Thermo was until Graduate school. Guess what research area he specialized in for over 30 years?",
              "author": "GetCookin",
              "created": 1566478828,
              "upvotes": 7,
              "replies": {}
            },
            "exq0sp0": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exq0sp0/",
              "text": "I failed a course that was *directly related* to my field. Upon retake, I got a C. I completed a PhD in that field, got a prestigious national fellowship while in it, and won an award for my dissertation.\n\nThere are a lot of reasons why a student might not get an A in the class, and those reasons may have nothing to do with their knowledge of the subject or their potential to succeed. I'm not saying we should ignore grades altogether, but they need to be considered alongside other factors. (In my case, my overall major GPA was a 3.7, and my grades in that course were low because I was dealing with health problems during the semester I took and retook it. But if a professor had simply concluded that any C or D in any course relevant to my major meant I wouldn't do well, I'd have been hosed.)",
              "author": "roseofjuly",
              "created": 1566496549,
              "upvotes": 3,
              "replies": {}
            },
            "exnc0ii": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnc0ii/",
              "text": "> This is just anecdotal, but I've never seen someone with a C or D in a course relevant to their research do well as a graduate student.\n\n\nImagine a professor working with a student and the professor thinking  -  \"everyone with your GPA fails at this\" - in the back of their mind. Yikes. The sooner we trust the stats on this over anecdotes and cultural bias the better.\n\nWould these failed graduate students you see excel as a graduate student in research that was relevant to courses they got an A in? Or were they just not cut out for research in general and the depth of classroom knowledge in the field wouldn't have saved them?\n\nSimilarly, how many student haven't done well at research but got an A in relevant course work?",
              "author": "pastaandpizza",
              "created": 1566451396,
              "upvotes": 11,
              "replies": {
                "exodm7g": {
                  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exodm7g/",
                  "text": "> Imagine a professor working with a student and the professor thinking - \"everyone with your GPA fails at this\" - in the back of their mind. \n\nAgain, you haven't read OP's post. \n\nIt isn't \"everyone with your GPA fails\" it is \"everyone who also barely managed a D in calculus fails at this calculus-intensive work\".",
                  "author": "ph0rk",
                  "created": 1566474593,
                  "upvotes": 12,
                  "replies": {
                    "exol05g": {
                      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exol05g/",
                      "text": "Ok this post I did misread haha, but OP and I had a very extensive discussion thread following this post haha.",
                      "author": "pastaandpizza",
                      "created": 1566478136,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                },
                "exomn6t": {
                  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exomn6t/",
                  "text": "I have no idea how you could possibly do work in my field without being really, really good quantum mechanics, linear algebra, and group theory. Obviously you need creativity, writing skills, work ethic, the proper mentality, etc. too, but that doesn't change the fact that the work is ultimately very advanced quantum mechanics, and if you don't know that, you're hosed.\n\nAlso, as an aside, that 3.5 GPA anecdote is just flat out stupid. Yes, let's prevent ourselves from admitting geniuses who didn't have to work at all to get a 4.0 in their gen eds and understand the field...",
                  "author": "Mezmorizor",
                  "created": 1566478790,
                  "upvotes": 5,
                  "replies": {}
                },
                "exncym4": {
                  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exncym4/",
                  "text": "> The sooner we trust the stats on this over anecdotes and cultural bias the better.\n\nI agree, but do any of us really have *the stats*? I'm not in pedagogical research. Has anyone actually looked into this?\n\nWithout that, all we have is our own experience.",
                  "author": "BKindYall",
                  "created": 1566452185,
                  "upvotes": 12,
                  "replies": {
                    "exnd8n9": {
                      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnd8n9/",
                      "text": "\n\nhttps://www.sciencemag.org/careers/2017/06/gres-dont-predict-grad-school-success-what-does\n\n\"These papers add to a growing body of information suggesting that widely used “objective” admissions measures, such as GRE test scores and GPA, are exactly the wrong way to go about picking future contributors to scientific progress. Yet, they continue to strongly influence admissions committees—probably to the detriment of individual aspiring scientists who, despite their brilliance, may not look good on paper, and of the entire scientific enterprise.\"",
                      "author": "pastaandpizza",
                      "created": 1566452417,
                      "upvotes": 6,
                      "replies": {
                        "exnddmb": {
                          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnddmb/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1566452546,
                          "upvotes": 20,
                          "replies": {
                            "exndxb3": {
                              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exndxb3/",
                              "text": "Same goes for GRE subject tests like biochemistry  for what that's worth. I can't remember the specific study but there was a physics PhD candidate review and they found the highest predictor of success of a physics PhD student was their GRE writing scores, not the GRE physics subject test.\n\nI guess what you're talking about must be field specific too. For instance I got into my microbiology PhD program (and excelled) without ever taking a microbiology course. So, there was no GPA record for me in something \"specifically relevant\" to my research before I started.",
                              "author": "pastaandpizza",
                              "created": 1566453069,
                              "upvotes": 9,
                              "replies": {
                                "exne8el": {
                                  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exne8el/",
                                  "text": "See, at this point all we have to rely on is anecdotes and personal experiences. Yours just happen to contradict mine.\n\nIf any pedagogy researchers are reading this comment, this topic seems like a good opportunity to do potentially paradigm-shifting research. Hop on it!",
                                  "author": "BKindYall",
                                  "created": 1566453376,
                                  "upvotes": 6,
                                  "replies": {
                                    "exnqqbw": {
                                      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnqqbw/",
                                      "text": "> If any pedagogy researchers are reading this comment, this topic seems like a good opportunity to do potentially paradigm-shifting research. Hop on it!\n\nThis seems like one of those things where the research could be done, the conclusions would confirm the \"obvious\", and it'd end up being borderline unpublishable because of how unsurprising it is.",
                                      "author": "Overunderrated",
                                      "created": 1566461819,
                                      "upvotes": 2,
                                      "replies": {
                                        "exo9ial": {
                                          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exo9ial/",
                                          "text": "Except unsurprising things are published all the time. Especially in the social sciences, many of the most fundamental ideas of our disciplines have never been tested, and some do not hold up to scrutiny when put to the test. It is incredibly important to do that kind of research because these assumptions hurt not only science but the policy that is informed by that science.",
                                          "author": "thegreenaquarium",
                                          "created": 1566472446,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    },
                                    "exnecur": {
                                      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnecur/",
                                      "text": "The GRE subject specific scores are pretty much what you are referring to and is not anecdotal.\n\n\nhttps://www.inverse.com/article/52691-gre-scores-are-a-bad-predictor-of-phd-success\n\n> In the study, Miller analyzed scores from three different GRE test sections: the GRE-V (verbal), the GRE-Q (math) and the GRE-P (the physics-specific subject test). He compared those scores to the completion rates and grades of students in physics Ph.D. programs in four overlapping groups: students from the US, students from abroad, female students from the US, and male students from the US. Across all four groups, the GRE-P *failed to predict* whether students would finish their program",
                                      "author": "pastaandpizza",
                                      "created": 1566453498,
                                      "upvotes": 6,
                                      "replies": {
                                        "exnemci": {
                                          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnemci/",
                                          "text": "That's true, though subject tests are still so wide in scope that I'm not sure I'd call them relevant to graduate research topics. A GRE-P score is just as broad as the GPA of a physics undergrad.",
                                          "author": "BKindYall",
                                          "created": 1566453762,
                                          "upvotes": 5,
                                          "replies": {
                                            "exng8f2": {
                                              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exng8f2/",
                                              "text": "From the same research:  \n\n> “We’re good at selecting who does well in coursework, but of course the skills required to be successful in courses aren’t the same skills that are important to be a successful research physicist,” says Miller. “Moving forward, we’re trying to focus on the things we know make a good researcher, which the current system doesn’t do very well.”\n\nThe people who study this are abandoning success in standardized exams AND course work. You certainly don't have to adopt this and you can weight success in highly specialized undergrad courses as you feel appropriate, but at least you're aware now that this is a thing being discussed.",
                                              "author": "pastaandpizza",
                                              "created": 1566455276,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        },
                                        "exomthg": {
                                          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exomthg/",
                                          "text": "GRE subject scores aren't specific. They're like taking the final of every undergrad major course at once. Except worse because you have a minor time crunch and there are over 100 questions so you can't have the ~hour long questions some upper level classes are known for/are the type of thing you'd see in grad school.",
                                          "author": "Mezmorizor",
                                          "created": 1566478858,
                                          "upvotes": 1,
                                          "replies": {
                                            "exoo2lc": {
                                              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exoo2lc/",
                                              "text": "I understand what you're saying, I'm not defending GRE subject scores, it's just as close to the data OP was looking for that I could find. I understand now OP wanted GPA scores for a course that was used as the background for a majority of their research project. Which I think is very field dependent as a some undergrad institutions don't even offer classes in areas that you can get a PhD in, so a study looking at GPA In a specific relevant subfield wouldn't generalize outside of that subfield, which is fine, just a comment on that.",
                                              "author": "pastaandpizza",
                                              "created": 1566479387,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        },
                                        "exnepmv": {
                                          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnepmv/",
                                          "text": "[deleted]",
                                          "author": null,
                                          "created": 1566453859,
                                          "upvotes": 1,
                                          "replies": {
                                            "exnfodk": {
                                              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnfodk/",
                                              "text": "https://www.inverse.com/article/52691-gre-scores -are-a-bad-predictor-of-phd-success\n\n> In the study, Miller analyzed scores from three different GRE test sections: the GRE-V (verbal), the GRE-Q (math) and the GRE-P (the physics-specific subject test). He compared those scores to the completion rates and grades of students in physics Ph.D. programs in four overlapping groups: students from the US, students from abroad, female students from the US, and male students from the US. Across all four groups, the GRE-P failed to predictwhether students would finish their program, \n\n> Nevertheless, things don’t look particularly good for the GRE in this paper — especially the physics-specific GRE. Students who scored below the 50th percentile had similar degree-completion rates to those who score in the top percentiles, Miller points out. That, he adds, is a key observation because a number of physics Ph.D programs have hard cutoffs. Roughly 25 percent of physics programs advertise that a GRE score should be above the 55th percentile for an applicant to have a shot at admission.",
                                              "author": "pastaandpizza",
                                              "created": 1566454787,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                },
                                "exq62x1": {
                                  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exq62x1/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1566498359,
                                  "upvotes": 2,
                                  "replies": {
                                    "exqao2l": {
                                      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exqao2l/",
                                      "text": "Sure, I'm just pointing out the reliance of very particular courses as a predictor of success in grad school is not applicable to all disciplines. Those in this thread who are supporting the grade in a very particular course is a good predictor of grad school success, I would imagine, would not be satisfied by \"assuming\" the grade a student would have gotten or not gotten.",
                                      "author": "pastaandpizza",
                                      "created": 1566499992,
                                      "upvotes": 0,
                                      "replies": {
                                        "exqbp2x": {
                                          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exqbp2x/",
                                          "text": "[deleted]",
                                          "author": null,
                                          "created": 1566500351,
                                          "upvotes": 1,
                                          "replies": {
                                            "exqc9qm": {
                                              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exqc9qm/",
                                              "text": ">I disagree with this actually. If a senior with a 4.0 walks in but is missing relevant coursework, I'm putting my money on everyone assuming that they'd perform better in the class than the student who got a C.\n\nI see what you're saying, but that seems like a slippery slope, although I haven't totally thought this through: \n\nIf this was true (High GPA should correlate with high score in any particular course), and people think a high grade in particular course work is a predictor of success in grad school, then shouldn't  admitting students based on GPA then also correlate with admitting students with good scores in a particular course? And therefore high GPA would correlate with success in grad school? \n\nBecause most of the research focuses on students who have already been accepted to grad school (and therefore already made it through the \"high GPA filter\" the people defending that having a good grade in relevant course work is predictive of success I guess are assuming there is high variability in scores in relevant course work despite generally high GPAs all around?",
                                              "author": "pastaandpizza",
                                              "created": 1566500560,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "exncl7u": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exncl7u/",
          "text": ">She was asked to review medical student applications for the UIC med school. When she met with the rest of the committee to share their picks she literally threw away the applications that had a GPA above 3.5. She told the search committee she polled the life science departments at U of I and found the average professor's undergrad GPA was 3.3. She found she ran a smoother lab when her students had more diverse, less academic heavy bsckgrounds.\n\nThat sounds like insane arrogance. Why on earth would she assume that the self-reported undergrad GPAs of faculty members in the life sciences would be a good upper limit for the GPAs of med school applicants, or that what makes for a smoother lab for her makes for a better med school cohort? No wonder she wasn't invited back.",
          "author": "Lonelobo",
          "created": 1566451847,
          "upvotes": 21,
          "replies": {
            "exnctre": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnctre/",
              "text": "First, if that's all you took away from my post that is unfortunate and I am sorry I distracted from my main point.\n\nBut to address your comment: She is not a medical doctor and was specifically invited to provide insight as a research scientist. She had no idea what appropriate cutoffs were and that's why I love the story because she had to choose for herself!\n\nWhat is arrogant are search committees highly weighting academic achievement when the statistics explicitly show it is irrelevant.",
              "author": "pastaandpizza",
              "created": 1566452064,
              "upvotes": 1,
              "replies": {
                "exne971": {
                  "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exne971/",
                  "text": ">She had no idea what appropriate cutoffs were and that's why I love the story.\n\nAre you telling the story right? Because on your rendering she didn't do away with traditional cutoffs -- she literally tossed everything OVER a certain cutoff, which would imply that GPA is actually a good predictor of graduate school success, albeit with a negative correlation.  \n\n>What is arrogant are search committees highly weighting academic achievement when the statistics explicitly show it is irrelevant.\n\nAgain, I struggle to follow your point. If it's irrelevant, then why would tossing high GPAs be any better a manner of proceeding than tossing low ones? \n\nAlso, I am not a statistician or involved in the relevant fields, but a quick googling showed me studies saying GRE scores are a weak predictor of some things (above all early grad school GPA) and that undergrad GPA is often a better predictor of grad success than the GRE. And all of these studies are obviously hampered by the fact that ... they are only run on students whose GPAs or GREs were good enough to get them admitted in the first place.\n\nEdit: I've just looked again at the post above this by chance, and it's weird and deliberately misleading that you, u/pastaandpizza, rewrote a post to begin \"First if that's all you took away from my post ...\" long after I had already responded to it, and without marking that that was a later edit. What's up with trying to  make it look retroactively like we were having a different conversation than we were having?",
                  "author": "Lonelobo",
                  "created": 1566453397,
                  "upvotes": 29,
                  "replies": {
                    "exqbhqy": {
                      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exqbhqy/",
                      "text": "Sorry, I literally edited 30 seconds after I posted it, I didn't realize you had already responded.\n\nI seem to have upset you in this thread, sorry!",
                      "author": "pastaandpizza",
                      "created": 1566500282,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "exnf6m3": {
                      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exnf6m3/",
                      "text": "It's a pretty simple story, I told it right and you read it right. She was making a point about weighting high GPAs. Pretty straight forward. I'm not saying that's how admissions should be done or that she was setting a detailed plan for future admissions haha.\n\n> ain, I struggle to follow your point. If it's irrelevant, then why would tossing high GPAs be any better a manner of proceeding than tossing low ones? \n\nSee above \n\nListen, if you want to use GPA as a way to filter who to recruit be my guest. Here is brief write up of some of the literature which is pretty darn clear:\n\nhttps://www.sciencemag.org/careers/2017/06/gres-dont-predict-grad-school-success-what-does\n\nSurely there is nuanced and non-optimal sampling, but it's a pretty clear trend worth discussing, not dismissing.",
                      "author": "pastaandpizza",
                      "created": 1566454342,
                      "upvotes": -10,
                      "replies": {
                        "exo8enu": {
                          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exo8enu/",
                          "text": "The thing is, you keep conflating GPA, which is an okay indicator of a student's ability to consistently complete necessary coursework at a high level (and the skills like time management, focus, etc. that requires), and the GRE which is mostly just an indicator of how privileged you are and is the main thing being discussed in all your links. Of course you shouldn't use GPA alone/as a cutoff to make admissions decisions, there are issues like private schools having average GPAs about 0.3 points higher than public schools across the board so context matters, and it's better to consider the entire transcript rather than the single number, but I have never heard anyone say that GPA/course grades shouldn't be used at all in assessing applicants. In fact, I attended a holistic admissions workshop with Julie Posselt and Casey Miller, the researchers who did a lot of the work that is being summarized in your links, just three days ago and in an example admissions rubric they presented the first criteria was 'academic success' which was based on course grades in the discipline. I strongly doubt that they would endorse a practice of throwing out applications with GPAs over a certain threshold since that would go against the whole concept of holistic admissions. The GRE, yes, throw that away, because it's just a shitty indicator.",
                          "author": "KrunkWantPuppetPals",
                          "created": 1566471881,
                          "upvotes": 11,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "exrfl6b": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exrfl6b/",
          "text": "> When she met with the rest of the committee to share their picks she literally threw away the applications that had a GPA above 3.5.\n\nI take your overall point but this is insanely stupid and she was rightly not invited back for future selection processes.",
          "author": "blueb0g",
          "created": 1566515896,
          "upvotes": 2,
          "replies": {
            "exs63ep": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exs63ep/",
              "text": "It was her point but yea",
              "author": "pastaandpizza",
              "created": 1566533480,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "exo8zoo": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exo8zoo/",
          "text": "For what it's worth this matches my experience. Hell, I was a 3.0 student and now I have my own research program, despite being denied opportunities along the way. \n\nI would never check a student's gpa before interviewing them. Class assessment and research abilities are just two very different things.",
          "author": "fleemfleemfleemfleem",
          "created": 1566472174,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "expxp63": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/expxp63/",
      "text": "Hey, don't be so dismissive. I got C's in major courses in my undergrad, but I got admitted to a PhD anyway. Now I'm in grad school successfully... fucking my research up!",
      "author": null,
      "created": 1566495539,
      "upvotes": 3,
      "replies": {}
    },
    "exoxcer": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exoxcer/",
      "text": "Level with them with concrete examples and don't be a jerk about it. I've included an anecdote below about a student who did get that kind of realistic feedback from schools, because even though I tried (and failed miserably) to tell them that I didn't think that they would be competitive as a Ph.D. candidate, I didn't want to make a life decision for him. \n\nI had a student ask me to look over their graduate school applications.  I knew that they were applying to two really high-level schools, two safety schools, and was looking into industry positions, so I didn't worry too much.  Well, his top choice, one of the top Ph.D. programs in computer science turned him down and offered the standard \"so many qualified applicants, couldn't take them all\" HR-approved note.  He reached out to the advisor he wanted to work for directly, who leveled with him and said \"you have far too many C's and D's in your major courses, while it's clear you like programing from talking to you, we don't think you would be successful with our rigorous curriculum based on your past performance.\" He received similar comments from two other schools, and was offered MS admissions, not Ph.D. for the fourth school. After that level of feedback, he decided that maybe industry experience would do him some good and he is now comfortably making more money than the rest of us, lol.",
      "author": "fresnel_lins",
      "created": 1566483084,
      "upvotes": 2,
      "replies": {}
    },
    "expo0pe": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/expo0pe/",
      "text": "I was applying for grad school for an agriculture related field back in the fall of last year and one professor I specifically wanted to work for just ignored me.  I finally got a meeting with him scheduled, and he said at the the that he'd be in touch, but nothing.  No emails, no notification of yes or no.  I ended up getting in under someone else last minute, but I felt terrible that I wasn't even worthy of a simple \"this isn't going to work out.\"  Be honest, but in a constructive way.  But whatever you do, don't just ignore.",
      "author": "wermy44",
      "created": 1566492461,
      "upvotes": 2,
      "replies": {}
    },
    "exrzfox": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exrzfox/",
      "text": "You can be honest with them about their grades not being up to par, but encourage them to consider taking time to accumulate relevant experience before applying. I floundered in undergrad due to depression and an undiagnosed learning disability, but I spent several years in industry proving myself, and I entered graduate school several years later fairly decorated and enthusiastically recommended by senior scientists at my job. I ended up doing just fine my first year, and I was able to hit the ground running with my research because I have polished lab skills from my time in industry. If the student is determined to get in, addressing poor grades and showing improvement worked for me and may well work for them. (I also retook Orgo II lecture three times to pass and pointed that out as an example of my grit.)\n\nLooking back, having my undergrad advisor tell me point blank there was “no hope” for me based on my grades was devastating and demotivated me even more. If he had offered some more unusual routes to graduate school, I would have known there was a light at the end of the tunnel despite my poor academic performance. I ended up having to figure that out myself.",
      "author": "momo-official",
      "created": 1566528020,
      "upvotes": 2,
      "replies": {}
    },
    "exo04jz": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exo04jz/",
      "text": "This post is Interesting to me because I find increasingly that academia produces this kind of student. I had a terrible experience this year where I got a lot of serious complaints because I told a very average student that it was unlikely they would win extremely competitive graduate funding. The whole thing dragged on for a year, emails were read, meetings were had - it was awful. \n\nI am not sure whether this is a structural problem but I think there is a trend of these kinds of students expecting certain professional trajectories and it might get ugly if these expectations aren’t met. I would phrase everything you say very carefully.",
      "author": "raincloudsilverline",
      "created": 1566467199,
      "upvotes": 3,
      "replies": {
        "expoqfl": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/expoqfl/",
          "text": "A student made a formal complaint because in my feedback I wrote that she had made a couple of \"sloppy mistakes\" here and there - apparently that was \"derogatory language\".  \n\nThe self-entitlement of some students always amazes me.",
          "author": "8eMH83",
          "created": 1566492643,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "exn56cu": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exn56cu/",
      "text": "Look, people have to learn how to deal with disappointments and hardships in life. I have a friend who is a poor student but is completely delusional about his prospects for grad school (we are both currently undergrad seniors). He emails people all the time trying to get into their lab and reaches very far. He gets rejected, and I'm not sure what he expects. In a sense he is putting the people he emails in an awkward position because his academic record is clearly not good enough and he should know better than to reach so far. I think you should tell them why you are rejecting them if it has to do with academic performance. If you don't they will probably assume the wrong thing and may get it into their head that problems they have aren't problems. Life isn't easy and as heartless as this sounds sometimes you just gotta tell someone they aren't good enough.",
      "author": null,
      "created": 1566446518,
      "upvotes": 3,
      "replies": {
        "exooajy": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exooajy/",
          "text": "I'm glad your \"friend\" strives for what they want.",
          "author": "GetCookin",
          "created": 1566479474,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "expm2u6": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/expm2u6/",
      "text": "Cs or Ds are a freshman/sophomore are not the same as Cs/Ds as a junior/senior.\n\nI had a 2.05 my first semester, 2.3 going into junior year.  I graduated with a 2.994 overall and a 3.4 in EE.\n\nNow, if these are bad grades in classes relevant to the research in later years I'm confused who is putting students up to even think of asking.",
      "author": "k0np",
      "created": 1566491850,
      "upvotes": 1,
      "replies": {}
    },
    "exodu0b": {
      "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exodu0b/",
      "text": "> And how do I tell them without kicking them while they're down?\n\nFirst, I'd avoid setting up a meeting for cases that look like they clearly won't have the necessary skills. Second, I'd tell them that the application process is competitive. You don't have to make it that they don't have the skills, but rather that other students looked better to the admissions committee, etc.\n\nI don't think I ever even heard a no from most of the graduate programs I applied to; you don't owe them anything other than a statement to the affect that it was a competitive field.",
      "author": "ph0rk",
      "created": 1566474705,
      "upvotes": -3,
      "replies": {
        "exojarv": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exojarv/",
          "text": "> I don't think I ever even heard a no from most of the graduate programs I applied to\n\nI got a clear 'no' from all but one of them, it made it far easier to make the decision, knowing that I wouldn't decide and then be presented with an option I couldn't consider.",
          "author": "alittleperil",
          "created": 1566477450,
          "upvotes": 5,
          "replies": {}
        },
        "exq1wr7": {
          "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exq1wr7/",
          "text": "If these are senior undergrads in the OP's own department, I think she'd be doing them a disservice by couching this in the \"it's just so competitive\" bs. If she really thinks that they're not going to be competitive for graduate programs because of their grades, it's kinder to just say so. (Even better if she can offer some guidance for how to improve, but that's more optional and just a nice-to-do.)",
          "author": "roseofjuly",
          "created": 1566496909,
          "upvotes": 2,
          "replies": {
            "exq4syb": {
              "link": "/r/AskAcademia/comments/ctrrfm/how_to_be_kind_but_clear_when_telling_a_hopeful/exq4syb/",
              "text": "Well, *I* would simply tell them so, but they were looking for a softer way to do it.\n\nI don't think one owes students in their department (who are not taking a class from them) anything. That certainly isn't labor they'll be rewarded for.",
              "author": "ph0rk",
              "created": 1566497902,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}