{
  "sid": "jprqj7",
  "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/",
  "title:": "Is there a research database that allows you to search for articles based on the theories or methods of analysis that were used?",
  "text": "Specifically for communication studies, please, if anyone has leads. Thank you!",
  "author": "toriegg",
  "created": 1604759380,
  "updated": 1634081943,
  "over_18": false,
  "upvotes": 102,
  "upvote_ratio": 0.99,
  "comments": {
    "gbhi5g0": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhi5g0/",
      "text": "Talk to your librarian! They will be most familiar with the databases you have access to.",
      "author": "agentplatipus",
      "created": 1604779486,
      "upvotes": 30,
      "replies": {}
    },
    "gbhiwtj": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhiwtj/",
      "text": "Academic librarian here: not that I know of. As others have said, advanced search strings can help with this. I highly recommend chatting with your institution's librarian (or one of them) to request some recommended search strings.",
      "author": "rakawido",
      "created": 1604779742,
      "upvotes": 23,
      "replies": {}
    },
    "gbi25hf": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbi25hf/",
      "text": "Another alternative approach is to find one paper that belongs to the category of paper you are interested in, then go to this website [https://www.connectedpapers.com/](https://www.connectedpapers.com/) and search for the paper. As soon as you hit send, the site will build a graph of related papers. It will also allow you to find prior works (These are papers that were most commonly cited by the papers in the graph. This usually means that they are **important seminal works** for this field and it could be a good idea to get familiar with them. Selecting a prior work will highlight all graph papers referencing it, and selecting a graph paper will highlight all referenced prior work).\n\nYou can also find a derivative work button with the  (papers that cited many of the papers in the graph. This usually means that they are **either surveys of the field or recent relevant works** which were inspired by many papers in the graph).\n\nTry it, I find the website highly relevant to all my academic activities.",
      "author": "TheNajeeb",
      "created": 1604786084,
      "upvotes": 15,
      "replies": {
        "gbjds7t": {
          "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbjds7t/",
          "text": "Wow that is so cool and useful thank you so much!!!",
          "author": "Onion-Fart",
          "created": 1604802441,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gbhonwr": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhonwr/",
      "text": "Not a specific database, but you can use those things as search terms and just make sure that you’re searching the entire document text rather than just the title.",
      "author": "bebeyoda22",
      "created": 1604781725,
      "upvotes": 14,
      "replies": {}
    },
    "gbhbae9": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhbae9/",
      "text": "Your best option would be to use the usual databases -- JSTOR, for example -- and to search for the names of prominent representatives of the theories you are attempting to locate. You'd want to search in \"Full text\" and then sort results by relevancy since that should bring up the articles with the most hits for those names. That's how I would do it.",
      "author": "chroniclerofblarney",
      "created": 1604777138,
      "upvotes": 5,
      "replies": {}
    },
    "gbhlf81": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhlf81/",
      "text": "Web of Science tracks citations so if there is a definitive paper on the theory or method, you can at least track articles that cite that paper.",
      "author": "SaySayOh",
      "created": 1604780670,
      "upvotes": 5,
      "replies": {
        "gbhu2wb": {
          "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhu2wb/",
          "text": "This is what I was going to suggest.",
          "author": "manova",
          "created": 1604783459,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gbh525i": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbh525i/",
      "text": "Have u tried google scholar?",
      "author": "Hawkbiitt",
      "created": 1604774696,
      "upvotes": 21,
      "replies": {
        "gbhageh": {
          "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhageh/",
          "text": "[deleted]",
          "author": null,
          "created": 1604776828,
          "upvotes": 3,
          "replies": {
            "gbhapaf": {
              "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhapaf/",
              "text": "I’m not sure but it only pulls academic journals that u might not necessarily have access to if u don’t have a school email for other scholar programs like academic onefile or Galen scholar search, just thought I mention google has that option.",
              "author": "Hawkbiitt",
              "created": 1604776918,
              "upvotes": 8,
              "replies": {
                "gbi7463": {
                  "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbi7463/",
                  "text": "Also, if in chrome, install the Kopernio plug-in. Will show you free PDFs right in the search results.",
                  "author": null,
                  "created": 1604787786,
                  "upvotes": 7,
                  "replies": {}
                },
                "gbhohgj": {
                  "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhohgj/",
                  "text": "If you can find the DOI somewhere you can pull up the article on SciHub. Doesn’t work for books, unfortunately, which also show up on google scholar often. But overall I don’t think google scholar is entirely useless.",
                  "author": "RaveTave",
                  "created": 1604781660,
                  "upvotes": 5,
                  "replies": {
                    "gbih9bf": {
                      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbih9bf/",
                      "text": "Libgen for books!",
                      "author": "laakmus",
                      "created": 1604791138,
                      "upvotes": 3,
                      "replies": {
                        "gbl2r8w": {
                          "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbl2r8w/",
                          "text": "Thank you!",
                          "author": "RaveTave",
                          "created": 1604826236,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gbhhheq": {
                  "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhhheq/",
                  "text": "If I am doing this type of academic research, then I definitely want it to be pulling academic articles. Having access is a different problem, but regardless of access, I can't pretend that research doesn't exist.",
                  "author": "makemeking706",
                  "created": 1604779274,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gbhhub2": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhhub2/",
      "text": "This is what keywords are for, but anything that can search through full text will help with coverage.",
      "author": "makemeking706",
      "created": 1604779383,
      "upvotes": 3,
      "replies": {}
    },
    "gbhc4t6": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhc4t6/",
      "text": "I'm not aware of one that will allow you to filter by those. You can use them as search terms.",
      "author": "yankeegentleman",
      "created": 1604777453,
      "upvotes": 3,
      "replies": {}
    },
    "gbhi8wo": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhi8wo/",
      "text": "I'm not sure about a specific database, but Google Scholar does do a good enough job. For example, if I'm interested in studies that used multimodal discourse analysis (or whatever), I'd just google that, find the most prominent resource in the field/technique (in this case, maybe, Kress, G. and Van Leeuwen, T. (2001). Multimodal Discourse: The Modes and Media of Contemporary Communication) and then search for that on Google Scholar. Then you have the option of \"Cited by\" (most research that relies on multimodal discourse analysis will probably refer to the source you picked), you have the option of searching within cited articles, where you can enter additional search terms to find stuff you're particularly interested in (like, I don't know, gender, advertising, whatever gets you closer to what you're looking for).",
      "author": "rtts-",
      "created": 1604779518,
      "upvotes": 4,
      "replies": {}
    },
    "gbhw968": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhw968/",
      "text": "I'm going to provide you with a different suggestion.\n\nCertain fields use certain methods a lot. Hop over to clinical trials and you'll see a lot of randomized testing. ANOVAs are used in social sciences a lot. So you could search for specific research methods through this.\n\nBTW. This is a good area to create your own database and share them with academics.",
      "author": "Mangek_Eou",
      "created": 1604784172,
      "upvotes": 2,
      "replies": {}
    },
    "gbiy2ls": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbiy2ls/",
      "text": "Between librarians to help you narrow down where to look (specialized journals and other sources) and databases like google scholar, being able to narrow down good keywords to search with and have effective search term formatting (what phrases you put in quotes for exact results, AND commands, etc ) can help narrow down some general methods.",
      "author": "messyredemptions",
      "created": 1604796874,
      "upvotes": 2,
      "replies": {}
    },
    "gbjerbq": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbjerbq/",
      "text": "I have completed a few bibliometric analyses of journals and identified the theories used in each article by looking at the abstract as well as the keywords (both taxonomic as well as those provided by the author(s)).\n\nThis is drudge work to set up, but once you set it up it's relatively easy to parse the database to search for a theory or a keyword that indicates a method of analysis.\n\nHere is what I did in recent work - I downloaded all articles from the past X years in the journals that I was examining. That's the drudge part - you sit at your desk, fire up your favourite browser, point it to your university's library site, and begin downloading all the articles from each journal under review, for all years (say, 25 years). You also download all the metadata associated with each article (ie author, author-university, title, abstract, keywords-by-author, keywords-by-EBSCO, etc). That metadata goes into an excel spreadsheet, one for each journal.\n\nAnd then you search.\n\nA paper that I presented last year at an academic conference was the product of the research that two colleagues and I performed on the top ten marketing journals, from the past 25 years. We catalogued all theories that were used in articles focused on channel marketing, and analyzed the frequency of use of these theories.\n\nIt was manual work: if you want that detail, you have to do the work.",
      "author": "CrankyReviewerTwo",
      "created": 1604802770,
      "upvotes": 2,
      "replies": {}
    },
    "gbhg3at": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gbhg3at/",
      "text": "Multiple resources have already been mentioned, which are good and fine, but the key for you will be to understand Boolean search logic. Learn these little tricks and you'll do much better in finding things.",
      "author": "CharlamagneTheDog",
      "created": 1604778825,
      "upvotes": 2,
      "replies": {}
    },
    "gblpj8w": {
      "link": "/r/AskAcademia/comments/jprqj7/is_there_a_research_database_that_allows_you_to/gblpj8w/",
      "text": "Wow, I got a lot from asking this. Thanks to everyone who replied! All of the information I got was new to me. Unfortunately, I couldn't use Web of Science although I will subscribe to it soon when the free options don't suffice.",
      "author": "toriegg",
      "created": 1604837188,
      "upvotes": 1,
      "replies": {}
    }
  }
}