{
  "sid": "qlsmoj",
  "link": "/r/AskAcademia/comments/qlsmoj/advice_starting_a_new_position_small_chance_to/",
  "title:": "Advice: Starting a new position - small chance to solve a two body problem",
  "text": "I am about to start a new academic position this month (the type of positions I apply to don't follow the academic year). I signed a contract, signed a lease to move there etc. Meanwhile my partner is applying for tenure track positions almost anywhere for the 2022/2023 academic year. \n\nYesterday a job posting popped up in a place geographically close to where my partner did a first round interview (waiting to hear back from them). \n\nWould it be unethical to apply considering I am about to start a new position somewhere else? My mentor says I should apply because this is about family and solving a two-body problem. But I feel very weird to apply while I am super excited about starting a new position somewhere else, and feeling like I don't want to let my new employer down. It would make me look bad. Besides all the practicalities of having to move twice, I don't even know how I would hypothetically be able to get there for an interview.\n\nAccording to this job posting they are looking for somebody with exactly my profile. Chances to be interviewed are high and the position doesn't go with the academic year so it would start as soon as the interview rounds are over. If my partner doesn't get selected for a second round then I wouldn't interview. The deadline is close though, so I have to decide now.\n\nIf you were in my position (=two body problem + starting new job just now), would you apply? If you were my employer, would you understand the circumstances or would you be very mad?",
  "author": "SufficientAd3103",
  "created": 1635939787,
  "updated": 1636136916,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hj5aqzu": {
      "link": "/r/AskAcademia/comments/qlsmoj/advice_starting_a_new_position_small_chance_to/hj5aqzu/",
      "text": "I would still apply. Yes it’s likely your future employer will be annoyed if you break and go to this other place, but you have to do what’s best for your career. \n\nDon’t tell them you’re applying and just shoot for it",
      "author": "moderneros",
      "created": 1635947032,
      "upvotes": 14,
      "replies": {}
    },
    "hj8y57s": {
      "link": "/r/AskAcademia/comments/qlsmoj/advice_starting_a_new_position_small_chance_to/hj8y57s/",
      "text": "Apply. You can always turn down an offer if things don’t match up. Worry about what to do after you have a job offer in hand.",
      "author": "ohnoyoudin",
      "created": 1636002989,
      "upvotes": 4,
      "replies": {}
    }
  }
}