{
  "sid": "onovt9",
  "link": "/r/AskAcademia/comments/onovt9/have_a_bs_in_cs_thinking_about_returning_to/",
  "title:": "Have a BS in CS, thinking about returning to school to pursue a graduate program in Physics, where to start?",
  "text": "Immediately after high school I completed a BS in Computer Science. At the time I was torn between physics and CS, but I already had some experience in software and knew that I could support the life I wanted with it so went with that. I have worked as a software engineer for a few years now and have saved up a fair sum of money and am thinking about returning to school to pursue my original passion, which would be a graduate program in Physics. My heart says PhD, but extra information about potential paths to careers in physics beyond that would be appreciated as I'm extremely uninformed.\n\nI will likely work for an additional year or two before committing to any large changes, but I wanted to start researching what would be required to make such a change, and any potential pitfalls to avoid. It's been some time since I've been a proper student and an even longer time since I've been really practicing directly relevant skills like mathematics. I assume that I will need to complete a BS in Physics, but am not sure how to determine what the specific requirements I need are, so any resources that folks could point me to would be tremendously helpful. My SO has suggested the possibility of completing an undergraduate degree online through a community college and then applying to programs, is this feasible or would I need to commit to attending university in-person and full time? Something specific I worry about with this approach would be research opportunities and entering into a graduate program woefully underprepared.\n\nBeyond the logistics of it all, I was also hoping for a reality check from folks in the industry to help set realistic expectations for this path and the challenges I will have to overcome, or at least links to some good resources to help me do so myself.\n\nThank you for anyone that takes the time to read, and extra thanks to anyone willing to lend some help to an aspiring academic!",
  "author": "Denthos",
  "created": 1626733750,
  "updated": 1634082494,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "h5tad9b": {
      "link": "/r/AskAcademia/comments/onovt9/have_a_bs_in_cs_thinking_about_returning_to/h5tad9b/",
      "text": "Hi OP, I'm currently doing a second BS in physics and in Australia so take this with a grain of salt - I think the vast majority of Physics grad programs will require a BS in physics - though potentially you could find a project/school where a BS in comp sci would work, actually I'm sure a lot of physics projects are heavily comp sci based so it would be more the administrative requirements rather than if you could do the work - it would be worth spending the time to research that because I think if you can avoid doing another BS that would save a whole bunch of time, headache and money.\n\nIn terms of BS programs for Physics - I don't think there are many online ones - physics undergrad programs have a lot of lab hours so it needs to be in-person for the most part. You don't need to go full-time.",
      "author": "zero2hero2017",
      "created": 1626737648,
      "upvotes": 1,
      "replies": {}
    },
    "h5xrq8h": {
      "link": "/r/AskAcademia/comments/onovt9/have_a_bs_in_cs_thinking_about_returning_to/h5xrq8h/",
      "text": "I was the academic advisor for STEM majors at a small university in Oklahoma for two years. You’ll want to contact any grad program you are considering and ask to speak with an advisor; for grad programs, that would likely mean a faculty member. She or he would need a transcript or course history of yours and would know (or figure out) exactly where you would need to start, course-wise.\n\nIt’s very possible for you to go into a grad program without getting an entire separate UG degree in physics, but that possibility would vary widely from school to school.\n\nAlso, if you’re going to be working in the States, you may want to consider if the program in question is ABET-accredited. If it is and your CS degree is *not* ABET-accredited, you might have to take additional courses to get “up to standard.” Also, some employers prefer or require this accreditation.\n\nYour bottlenecks will likely be general physics 1 and 2 (with labs) and/or maths. To get off the ground in a physics grad program, you’ll need something like the whole calc sequence (12 credit hours or so) and diff EQ, I think.\n\nAlso, physics classes and labs are almost never available online in my experience — though that was before COVID.",
      "author": "Stormlight1984",
      "created": 1626824494,
      "upvotes": 1,
      "replies": {}
    }
  }
}