{
  "sid": "emzjxe",
  "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/",
  "title:": "My PhD advisor is trying to forbid me from going to the lab.",
  "text": "I feel like I'm in a bit of a weird situation, and I could use some other thoughts about what I should do. I'm in the last semester of my PhD (I hope). My department is kind of an omnishambles, and there's a lot of political maneuvering that is affecting my situation. \n\nRecently, my department advisor tried to asset control over my work by forbidding me to going to the lab that funds me. My co-advisor, who is my lab supervisor, very nearly cut my funding after my advisor called him to tell him I wasn't going to work in the lab anymore. (I met with him separately later to tell him I would still work there, regardless of what she said.)\n\nMy advisor thinks my research, and my dissertation, is in a much worse off place than it is. She thinks that I need to spend 10 hours a day for a month non-stop writing, but also admits to not having read anything I have sent to her save one chapter. As of this post, I have about 8 chapters, 150-odd pages, all cited, formatted to the university's standards, figures and tables inserted, etc. \n\nI'm not sure if my advisor's behavior is in the scope of normal. The graduate program director has also told me I shouldn't be going to the lab, so I think my advisor catastophized my work to the director. I'm not sure if I should just let it slide and ignore my advisor, but she wants to meet me weekly before I hand my dissertation into my committee. According to my co-advisor and lab supervisor I'm doing fine and he thinks my other advisor is being needlessly negative.\n\nAny advice would be helpful. I honestly don't know what I should do in this situation.",
  "author": "Tricky_Chemistry",
  "created": 1578700799,
  "updated": 1634081968,
  "over_18": false,
  "upvotes": 100,
  "upvote_ratio": 0.94,
  "comments": {
    "fdsieqd": {
      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsieqd/",
      "text": "Just curious...why do you need to be in the lab? With you at the very end of your PhD, and you having seemingly 8 chapters (that’s a ton for a PhD thesis, although 150 pages isn’t very long) worth of data already collected...it seems like you should be done in the lab? Is the stuff you want to do in the lab PhD related, or additional experiments?",
      "author": "ObamazSemenAnts",
      "created": 1578703338,
      "upvotes": 97,
      "replies": {
        "fdt0y80": {
          "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdt0y80/",
          "text": "Apparently that they need to keep working in the lab to keep getting their funding? Perhaps the OP can find a compromise where they demonstrate writing progress while still working part-time in the lab.",
          "author": null,
          "created": 1578710497,
          "upvotes": 28,
          "replies": {}
        }
      }
    },
    "fdsgtv8": {
      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsgtv8/",
      "text": "Why do you think she's doing that? What are the costs and benefits of you spending time in the lab right now?\n\nYes, her behavior sounds weird (and possibly extremely so), but I think we're missing a lot of context.",
      "author": "thereticent",
      "created": 1578702461,
      "upvotes": 80,
      "replies": {
        "fdsn100": {
          "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsn100/",
          "text": "My lab has offered me a postdoc after I graduate. I think it might be good to keep going to maintain that relationship. Additionally, I could squeeze in a bit more data for testing. Thankfully my workload at the lab is fairly flexible, so I'm not expected to show up everyday for eight hours.\n\nMy advisor's behavior is more of less consistent across her advisees. All the others I've spoken to, she's behaved in a similar manner. She's just been the most extreme with me. I'm not sure what other context I can give.",
          "author": "Tricky_Chemistry",
          "created": 1578705352,
          "upvotes": 49,
          "replies": {
            "fdsusbe": {
              "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsusbe/",
              "text": "I’d recommend having a post-doc elsewhere. Not just because of your present situation, but because it typically isn’t great to have your post-doc in the same place where you earn your PhD",
              "author": "ILoveCreatures",
              "created": 1578708212,
              "upvotes": 68,
              "replies": {
                "fdsvt6c": {
                  "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsvt6c/",
                  "text": "Why is this a bad idea? Is this just for STEM fields? (Genuine question)",
                  "author": "Rec0nSl0th",
                  "created": 1578708589,
                  "upvotes": 9,
                  "replies": {
                    "fdsy1z0": {
                      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsy1z0/",
                      "text": "I wouldn’t know about outside of STEM, but for many opportunities later on, especially tenure track positions, they value having diversity in experience. If you’re stuck in the same lab for a really long time, you’re constrained to the same set of ideas, people, standardized ways to do techniques, etc. Maybe it’s not such a bad idea if your lab is very good at doing one specific thing, and you plan on doing that one specific thing for the rest of your life. But most people probably don’t, and even if you do, departments want to hire people who can draw from a wide area of expertise to make strong research innovations and not people with limited training experience. \n\nEven more generally, I’ve heard people say that staying at the same institution for a long time is frowned upon. Different universities and departments will have very different cultures and styles in how they conduct research and organize administration and everything. Being exposed to those differences is also often deemed important when hiring PI’s, as they may be more successful in navigating the professional environment of research in forming collaborations and being a strong team member of the department, etc than someone who’s used to one system and culture their whole academic life.",
                      "author": "Lightning1798",
                      "created": 1578709431,
                      "upvotes": 38,
                      "replies": {
                        "fdtz3uk": {
                          "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdtz3uk/",
                          "text": "In many STEM fields people usually do 2 (or 3) postdocs. In such cases it's perfectly fine and common to do a short (usually up to 1 year, in some places up to 2) postdoc in the same lab / department / institution - if available - in order to finish up and publish the PhD work and secure an optimal position for 2nd, \"real\" postdoc in another institution and on another topic.",
                          "author": "AstraGlacialia",
                          "created": 1578724624,
                          "upvotes": 13,
                          "replies": {}
                        }
                      }
                    },
                    "fdsy54c": {
                      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsy54c/",
                      "text": "Diversity of experience is good. You are the wiz kid of State U but how do people outside of your power hungry PhD advisor’s realm of State U evaluate you? Can you figure out how use different brands of instruments, different safety protocols, etc?",
                      "author": "nbx909",
                      "created": 1578709462,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "fdsz6wj": {
                      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsz6wj/",
                      "text": "It's also true for philosophy.",
                      "author": "StopwatchSparrow",
                      "created": 1578709854,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fdt2876": {
              "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdt2876/",
              "text": "Gotcha. The context you've given makes me think additional lab work is not super high urgency right now, so giving in to your adviser's pressure may be a good survival strategy.\n\nThat said, her putting on such intense pressure without having read your work thus far seems...unhelpful. Maybe /u/ph0rk is right that the ombud is the next place to contact.\n\nAs for additional context (if you feel like giving it): When did this pressure start? How long have you been working on the dissertation? Is your timeline typical for your lab? Can you see any specific reasons why she would be concerned right now about you, or is this typical enough of her that you can conclude she is an ineffective adviser? How assertive have you been in pointing out your progress to her? I can think of more \"food for thought\" questions if you find them helpful to consider.",
              "author": "thereticent",
              "created": 1578710965,
              "upvotes": 8,
              "replies": {}
            },
            "fduvuz8": {
              "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fduvuz8/",
              "text": "As someone else said, a post-doc elsewhere might be better. That said, never turn down a funded post-doc so if this is your only option.\n\nThat said. I HIGHLY doubt that they would retract that offer if you stop working in said lab? I don't know the specifics but, surely they recognise that you are a PhD, you are doing a PhD, a PhD is a full time commitment, and that is what you are focused on?",
              "author": "LiftingHistorian",
              "created": 1578739687,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fdtoqs2": {
      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdtoqs2/",
      "text": "None of this post makes sense to me.  How is your department advisor capable of forbidding you from going into lab?  Why would you want to?  What's so horrible about working 10 hours a day for a month?",
      "author": "dampew",
      "created": 1578719872,
      "upvotes": 14,
      "replies": {
        "fdv31nf": {
          "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdv31nf/",
          "text": "Definitely nothing horrible about working 10hrs a day for a month, it's more that my advisor is overestimating the amount of work needed because she hadn't read anything I've sent her. (which she herself has told me on many occasions.)",
          "author": "Tricky_Chemistry",
          "created": 1578742636,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fdv1coc": {
      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdv1coc/",
      "text": "A semester out from submitting there should be no reason for you to have to be going to the lab; at this point you should be writing up, and maybe trying to get a last paper out. Now is not the time for more data gathering.\n\nYour advisors stance seems perfectly reasonable to me. It sounds like your lab supervisor wants you to keep going in to the la simply to get more of the groups/their prioritised work done. Your advisor is quite correctly stepping in because *your* priority at this point should be getting *your* PhD finished, not doing donkey work for your lab.",
      "author": "OrbitalPete",
      "created": 1578741972,
      "upvotes": 11,
      "replies": {}
    },
    "fduphvc": {
      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fduphvc/",
      "text": "Not that weird.\n\nYour advisor sees you need to stop wasting time doing what they see as a second priority.\n\nAdvisors have different standards for what a PhD needs, and some genuinely believe it needs a really big and well written manuscript. This is an old fashioned view, but entirely their right to hold. Sorry.\n\nYour relationship, with the \" co-advisor \" is probably secondary to getting a PhD.",
      "author": "lednakashim",
      "created": 1578736815,
      "upvotes": 8,
      "replies": {}
    },
    "fdshkf1": {
      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdshkf1/",
      "text": ">As of this post, I have about 8 chapters, 150-odd pages, all cited, formatted to the university's standards, figures and tables inserted, etc. \n\nThis is worrying. You are measuring the quality of your research by the amount of chapters, amount of pages, whether you have citations and whether you have tables, figures and follow the university template. That's something an undergrad would say. Hell, all of it is automatic if you use Latex.\n\nHave the other people actually read your thesis and have the capability of thoroughly reviewing the quality? Your work in the lab is not necessarily correlated with your ability to write your thoughts on a piece of paper, form a coherent argument or have a novel idea.",
      "author": null,
      "created": 1578702882,
      "upvotes": 52,
      "replies": {
        "fdsq2uq": {
          "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsq2uq/",
          "text": "Where does OP’s saying that suggest that OP is using that as a measure of the quality of their research? It does not seem even slightly “worrying”, as you’ve so condescendingly put it.",
          "author": "BrainBlast-At-Last",
          "created": 1578706474,
          "upvotes": 45,
          "replies": {
            "fdt079a": {
              "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdt079a/",
              "text": "The mention of chapters and length may also be meant to imply that the advisor's assessment is based on too-little data. But I certainly read the other details as implying the thesis is of high quality. The OP is citing these superficial details as a counter to the advisor's criticisms. And generally this bag of superficial details is apparently meant to imply the thesis is nearing completion, despite the fact that an advisor, who presumably has expertise and experience in the area, strongly disagrees. Perhaps you'd prefer the word \"concerning\"?",
              "author": null,
              "created": 1578710229,
              "upvotes": 6,
              "replies": {
                "fdt11t9": {
                  "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdt11t9/",
                  "text": "My advisor does not have expertise in my area. She has not read any of my papers or any of the dissertation I have sent to her, so she has no way of judging the quality of my work. My department did not have any professors who were experts in my area when i was looking for an advisor. I am also the only person she has ever been the chair of a committee for. She also doesn't have a PhD herself and doesn't know the scope of work for a PhD. I'm in a really weird position.",
                  "author": "Tricky_Chemistry",
                  "created": 1578710532,
                  "upvotes": 5,
                  "replies": {
                    "fdt45ly": {
                      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdt45ly/",
                      "text": "Your advisor doesn't have a PhD and isn't familiar with your area of research? That's bonkers.\n\nIs there an experienced researcher you have access to that you trust who you can ask for feedback on your work? Maybe someone else on the committee? \n\nIf you only have a semester's worth of work left and your work so far is good, then I'd say wrap that baby up and go somewhere for your post-doc. This does not sound like a good environment for you.",
                      "author": "TheGreatNorthWoods",
                      "created": 1578711676,
                      "upvotes": 26,
                      "replies": {
                        "fdtqph8": {
                          "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdtqph8/",
                          "text": "Where I got my PhD the graduate school would never in a million years have approved a committee where the chair neither has a PhD or even expertise about the student's research. This is crazy if true. Honestly hard to believe. OP is probably fucked and doesn't even know it yet.",
                          "author": "a_large_plant",
                          "created": 1578720714,
                          "upvotes": 18,
                          "replies": {
                            "fdw2sep": {
                              "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdw2sep/",
                              "text": "Hrm. Well someone had to be the first person to ever get a PhD. I wonder who was on that committee",
                              "author": "fleemfleemfleemfleem",
                              "created": 1578754466,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fdt2eox": {
                      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdt2eox/",
                      "text": "Why would you have an advisor who isn’t a PhD? Why not just switch to another advisor, one who still won’t be an expert in what you do but will at least read your work?",
                      "author": "jro727",
                      "created": 1578711032,
                      "upvotes": 17,
                      "replies": {}
                    },
                    "fdt7p0q": {
                      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdt7p0q/",
                      "text": "Your post says she read a chapter. And she is asking for you to focus on writing, not claiming anything about your results, correct? What exactly does she mean then? \n\nAlso she doesn't need to be an expert in your specific thesis topic to have expertise in your area. Generally you should know more about your thesis focus than anyone else by the time you finish. She must be in the same department though? If she is completely useless in assessing your research \\_and\\_ doesn't have a PhD then why on earth is she your advisor? You would need a co-advisor either way anyway. You could have at least gotten someone with real academic training as your main advisor. Speaking of which, you need to get the co-advisor to read your thesis since their opinion is apparently critical here.",
                      "author": null,
                      "created": 1578713000,
                      "upvotes": 5,
                      "replies": {
                        "fdv66wv": {
                          "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdv66wv/",
                          "text": "The single chapter she read was during the summer, and before all of this started happening. She hasn't read any of the others.\n\nAs for expertise I mean to say our overall fields are somewhat related, but don't overlap enough for her to give good feedback. A lot of my work is driven by data, and she is purely humanities. Which means that she has avoided my chapters on experimental design and data analysis, a good half of my dissertation. \n\nThe only good thing to come out of all of this is that my co-advisor is more than happy to read the chapters for review.",
                          "author": "Tricky_Chemistry",
                          "created": 1578743773,
                          "upvotes": 1,
                          "replies": {
                            "fe08guq": {
                              "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fe08guq/",
                              "text": "So perhaps her thinking is that you are spending all your effort on the technical side but not the humanities side of the work? Did you publish in journals relevant to your department (as opposed to those of your co-advisor's field if they're in a different dept)?\n\nGetting feedback from someone outside your area is hugely valuable, though. It's really hard to explain your work to an audience beyond your tiny little niche of a subfield. That's one of the big challenges in writing a thesis. And while your co-advisor can assess whether the thesis is technically correct and impactful, they are probably  too close to your research to assess how well you explain things.",
                              "author": null,
                              "created": 1578805925,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fdt82tf": {
                  "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdt82tf/",
                  "text": "Sorry, my citing the kind of bag of details regarding formatting is the only feedback my advisor gave when I sent her the draft at her request at an earlier time. She gave no feedback on theoretical framework or soundness, testing procedures, or data analysis. Just that it was hard to read because the wasn't formatted according to final style guidelines. Since she admitted multiple times a month later, I assume that office standard formatting dissuaded her from reading it at all. \n\nI designed and conducted my own experiments and got a pool of participants that I've tested. That data is used for my methodology and analysis portion of my dissertation.",
                  "author": "Tricky_Chemistry",
                  "created": 1578713146,
                  "upvotes": 2,
                  "replies": {
                    "fdtag8j": {
                      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdtag8j/",
                      "text": "Ok but why would fixing that require so much time and effort that you can't work in the lab? Can't you just go back and say \"I did what you asked for, enjoy\"?\n\nWas the grammar an issue? I have refused to read manuscripts before where even getting through the abstract required me to navigate dozens of grammatical errors and confusing sentences.",
                      "author": null,
                      "created": 1578714029,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fdsnsu6": {
          "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsnsu6/",
          "text": "I appreciate the feedback. I have relatively little way to compare how and where and why the actual meat of my dissertation is good. A good half of it is material I've used for my candidacy proposal, so it's already passed muster. Another quarter is from papers I've published in conferences, and the last quarter is additional analysis I haven't published on. \n\nI imagine that my writing style and argumentation is relatively okay since it's been accepted to four conferences. Several of the papers have been reviewed by graduate writing tutors. My ideas for research have been reviewed during demos by other experts in the field, and they had good feedback.\n\nI'm not using Latex, it's not common in my field, so my formatting is through Word macros.",
          "author": "Tricky_Chemistry",
          "created": 1578705630,
          "upvotes": 13,
          "replies": {
            "fdtlrti": {
              "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdtlrti/",
              "text": "There are conferences where they will publish literally anything and the review doesn't even consist of reading the paper.\n\nGraduate writing tutors can tell you whether you've made spelling mistakes and whether your grammar is correct, but they are often not experts in your niche field. A research plan that landed you the position doesn't mean your research is any good.\n\nYou should bounce your research (as in stuff you've written down at least as a draft, if it's not written down then it doesn't exist) off experts that can do some sparring and help you refine your ideas and thoughts on the paper.\n\nThere is a huge leap from \"essay writing\" to \"writing academic papers\". There is no expectation of writing academic papers from undergrad or even grad school in most cases (perhaps they hope that you'll achieve that level during your masters thesis but most don't even have one and it's not required).\n\nWriting a research plan, preparing a conference poster etc. is not the same as writing academic papers. In most fields (notable exception is computer science and some engineering fields but you said you don't use Latex) conference papers are not academic papers. They're more of an abstract, a short introduction and a short description of what's up.\n\nI am not doubting your ability to write a text or make pretty figures. What I am doubting is whether the content of the paper is solid.\n\nNobody ever explained to me how exactly do you write a paper in my field (computer science). There were courses that taught how to write academic English and everything related to language and text, there were courses about how to make a conference paper or how to structure a paper and research methodology and techniques and methods and study design and whatever.\n\nBut getting away from \"school paper\" towards \"academic paper\" took a long time of learning by osmosis. Reading some non-top conference/journal papers or looking at young researchers I believe that even most fresh PhD's don't completely understand what's the point of research and how do you do great research and write great papers. \n\nYour PhD supervisor will rarely act irrational and emotional for no reason. You don't get to become a professor or even a senior researcher if you are irrational. If they are saying that you need to work 10 hours per day to salvage your PhD, I'd listen to them and try to figure out what exactly are they talking about and how to fix it. They have probably supervised people before and they probably have a lot of reviewer experience and know what they're doing. Your fellow colleagues and 2nd or 3rd PhD advisor probably don't have that under their belt (or they'd be the first).\n\nShit does happen and some people are batshit insane, but I'd look into it and make sure that I'm not the problem here or misunderstanding something before blaming someone else.\n\nIn my experience if you're confident and think that everyone around you is stupid and doesn't understand you in an University setting, [you're very likely at the peak of Mount Stupid](https://kajabi-storefronts-production.global.ssl.fastly.net/kajabi-storefronts-production/themes/250022/settings_images/PqQFgBHiTmSHXPj5vCgL_Dunning-Kruger-Effect.jpg).\n\nThe dunning kruger effect is treacherous because it makes you absolutely sure you're right and it is not simple to tell the difference between actually being right and just thinking you're right.",
              "author": null,
              "created": 1578718604,
              "upvotes": 12,
              "replies": {
                "fdv5bix": {
                  "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdv5bix/",
                  "text": "So there's a lot going on in your response, but I will address what I think is at the core for this. For most of the last semester I thought I was stupid and subpar, because of how my advisor was treating me and my work. It turns out she does this to the other advisers she has had. Over the past five years I have been here, I am the only student she has chaired a committee for, which shouldn't have happened because she doesn't have a PhD and doesn't know the breadth of work it takes for a PhD. This became very clear to me after her comments on my work were almost all about formatting for the paper. Trust me, I also wanted for my advisor to give concerted feedback about the soundness of difference areas of my research but she simply won't.\n\nI have had different problems with her earlier in the semester, which I have brought up to administration, who also remarked on the erratic and harmful nature of her behavior. This previous behavior is why I am currently wondering if her behavior now is erratic as well.\n\nMy lab supervisor, also a 20 year expert in my field with a PhD, has been reviewing my work. He has brought in different experts to review and give feedback on the work I have proposed that is the major part of the project.\n\nMy area is a field related to computer science, so I tend to submit to computer science conferences, so the conferences papers are more like condensed articles with lots of peer and expert reviews.",
                  "author": "Tricky_Chemistry",
                  "created": 1578743350,
                  "upvotes": 4,
                  "replies": {
                    "fdxs099": {
                      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdxs099/",
                      "text": "Hold up.\n\nYour PhD supervisor doesn't have a PhD? You are submitting computer science conferences that are not in Latex?\n\nThis whole story is making me go \"wtf, wtf.... WTFF???\". Nothing adds up.\n\nWhat the actual fuck? What kind of a university is this?",
                      "author": null,
                      "created": 1578772319,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fdu9cz2": {
          "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdu9cz2/",
          "text": "Genuine question: how do you judge the quality of research you did? For others' research work, citations and methods used sound plausible to me. I'm a student and don't have a lot of experience in research...",
          "author": "vardhanisation",
          "created": 1578729840,
          "upvotes": 2,
          "replies": {
            "fdxt3ld": {
              "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdxt3ld/",
              "text": "Pretend you are a reviewer and go through every sentence and little thing and try to break it apart and find inconsistencies and criticism.\n\nGive it to a friend from a different field and see how much they understand (you should at least roughly understand the intro and the conclusions even as a highschooler). Give it to an expert in a field but not specifically your thing (that's what the random reviewer will be). If they don't understand it, then you haven't made it clear enough. Have your co-workers etc. review it and give you feedback etc. \n\nReview other papers whenever you get the chance. Most people think it's a waste of time but it's a great learning opportunity to spend 6 hours on a paper dissecting it, following the papers they cited and evaluating it.",
              "author": null,
              "created": 1578772614,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fdsiis4": {
          "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsiis4/",
          "text": "I agree with this",
          "author": "ObamazSemenAnts",
          "created": 1578703400,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fdsgj2d": {
      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdsgj2d/",
      "text": "Go to your campus ombudsperson, usually there is one specifically for the graduate school.",
      "author": "ph0rk",
      "created": 1578702286,
      "upvotes": 9,
      "replies": {}
    },
    "fdvoblg": {
      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdvoblg/",
      "text": "Who reviews and signs off on your dissertation? Are you in a US-model or UK-model school?\n\nIf you're in a US-model school (where you work directly with the same professors who will sign your dissertation), is your department advisor also the chair of your dissertation committee? If so, then you need to figure out what she wants. And you will probably benefit from doing what she suggests.  You say she's only read one chapter--but what did she say about that chapter? Did she say it was not good enough? Did she explain why? What are her theoretical and scholarly concerns? (Saying \"you need to work 10 hours a day for the next month\" provides no insight into what your dissertation needs as a piece of research.) Have you said to her \"I've got 8 chapters written, could you give me feedback on whether those 8 chapters are acceptable, and if not, why not?\"\n\nIf you're in a UK-model school (where the reviewers of your work are not the same people as your supervisor), then you need to figure out if your work is actually going to be acceptable to other professors, and you may not need to worry about the concerns of your supervisor as much. \n\nRegardless, I think you need someone to give you specific feedback on your draft. Is that draft good enough? What are its weaknesses?",
      "author": "ThoughtClearing",
      "created": 1578749620,
      "upvotes": 3,
      "replies": {}
    },
    "fdt5567": {
      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdt5567/",
      "text": "Go to your student ombudsperson. If you're having trouble finding out who that is, try your campus research integrity officer, they will know who the ombuds is.\n\nThis sounds like a situation that could go bad quickly, and I don't think you should try to push through it alone without some support. Your graduate program staff would usually be the next place to turn but it sounds like you don't think they will be unbiased, so pull in the ombuds ASAP and let them help de-escalate whatever has gone wrong here. What you're describing is not normal but from the information provided we can't say where the problem is.",
      "author": "Amaranthesque",
      "created": 1578712047,
      "upvotes": 3,
      "replies": {}
    },
    "fdu2520": {
      "link": "/r/AskAcademia/comments/emzjxe/my_phd_advisor_is_trying_to_forbid_me_from_going/fdu2520/",
      "text": "Sounds like you are in a high-stress situation. Take the weekly meetings, attend them. Talk and discuss things. Keep working and turning up. To me it sounds like your advisor hasn't been able to keep a good track of your progress, or perhaps that there hasn't been good communication between the two of you. It's vital you maintain as much regular communication as possible.",
      "author": "tfburns",
      "created": 1578726178,
      "upvotes": 2,
      "replies": {}
    }
  }
}