{
  "sid": "op1b8d",
  "link": "/r/AskAcademia/comments/op1b8d/need_help_deciding_on_phd/",
  "title:": "Need help deciding on PhD",
  "text": "I finished a Masters (STEM and research-based) in Canada 6 months ago and had a terrible time during it.  First off, I completed my research entirely alone during covid.  Worked alone, lived alone.  For much of the time during my research, I was driven to overwork by fear of failure and imposter syndrome.  Whenever I had a presentation or meeting on the horizon, I would work non-stop for 16hrs a day so that I could have some progress to show.  This was compounded by the fact that my supervisor was almost entirely hands-off and I received no real feedback in the form of support or criticism for my efforts.  Often, \"thanks, bye\" was the only feedback I received on presentations.  Multiple paragraph emails with data and related questions were responded to with a single word email, and every face-to-face/zoom meeting I had to spend time re-explaining my work to my supervisor.  These things all led to me not sleeping or eating well, physical ailments from a complete lack of ergonomic concerns and just generally running on adrenaline for months at a time.  Needless to say, I crashed pretty hard after my defense and have slowly been regaining some energy/peace of mind since.   \n\nNow, I have been offered a great opportunity for a 3 year PhD abroad (Europe) with a supervisor that has been a great communicator and very supportive in our interactions thus far.  The position is paid well and involves travel to interesting locations.  The project is relevant to my prior experience and seems like something I can actually complete.  Having said this, I am unsure if I can and want to do research anymore.   I am really struggling to determine if I do or have ever liked research and what impact a different supervisor could make on this.  I will admit that I feel like I really do lack some background knowledge in my field and this further adds to my uncertainty.  This lack of knowledge is entirely my fault, as I have yet to read a significant amount of papers related to my field and managed to complete my research on a \"need to know\" basis.  I know that I can make a plan to go about rectifying my knowledge gaps, but I don't know how to tell if it is worth it anymore.  Everytime I make a point to tell myself that I will read and catch up on background literature, I just don't.  I am beginning to question if this is laziness or just simply lack of interest.   I find sitting and working at the computer (I'm in a computational field) impossible after completing my Masters, and I have never felt better avoiding that kind of work entirely.  I am struggling to fully explain to myself or anyone else why I want to pursue a PhD at all other than because I have always wanted one and it will open unforeseen doors in industry.  I truly believe in science and in the contribution to human knowledge, but I am not sure that I enjoy this process.  How can I tell I like research at all?  I have lost all metrics of joy and satisfaction as it relates to my work and I am uncertain how and if I should proceed down the academic route.  Any comments or thoughts are much appreciated.\n\n&#x200B;\n\nTLDR: Had a bad time with Masters due to self-imposed pressure and a lack of supervision.  Can't tell if I hate research or just my last experience.  I have an offer for a 3 year phd in Europe (I'm from Canada)  that is well-paid, has travel opportunities, an industry secondment, and a supervisor that has been very supportive and communicative to date.  How can I decide if I should go ahead with the PhD given that my last experience was so bad it burned me out?",
  "author": "InsectSilent",
  "created": 1626908680,
  "updated": 1634082475,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "h632g2b": {
      "link": "/r/AskAcademia/comments/op1b8d/need_help_deciding_on_phd/h632g2b/",
      "text": "I cannot guarantee that your PhD experience will be fruitful, as there are a lot of things that come into play (interaction with advisor, funding, interaction with group). \n\nWhat I can tell you is that your experience with your Masters has given you a deeper understanding of yourself, and you now know what you want and don't want, so if anything, you have a leg up on the PhD.",
      "author": "heliumagency",
      "created": 1626923270,
      "upvotes": 2,
      "replies": {
        "h65lay4": {
          "link": "/r/AskAcademia/comments/op1b8d/need_help_deciding_on_phd/h65lay4/",
          "text": "I definitely know what I don't want. I guess I am just uncertain if I can get what I do want out of a research career at all.  Thanks for taking time to comment.",
          "author": "InsectSilent",
          "created": 1626977796,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h63mi04": {
      "link": "/r/AskAcademia/comments/op1b8d/need_help_deciding_on_phd/h63mi04/",
      "text": "Honestly, I think you should think about counselling and if you can pay for it, coaching. Your supervisor has a responsibility to provide proper supervision with constructive feedback and support. However, reading this you draw a solid line between your mental health and their supervision. You cannot make your supervisor and the quality of their supervision responsible for your mental health. You have to learn how to manage your health even when others around you are being shit or even  just aren't giving you everything you feel you need. \n\nA PhD is about learning to be independent and I think based on what you've written here you're going to find that really stressful. I'm not saying you can't do it, you may well be able to but I think you need to build some foundations for yourself and learn to set boundaries and develop strategies for handling the situation when you start to spiral. A PhD is a marathon and I'm exhausted just reading your post, you have to find a way to slow it all down and set a pace you can maintain.",
      "author": "ACatGod",
      "created": 1626936677,
      "upvotes": 1,
      "replies": {
        "h65l7h3": {
          "link": "/r/AskAcademia/comments/op1b8d/need_help_deciding_on_phd/h65l7h3/",
          "text": "That is a fair assessment. You are right that I have a responsibility for my own mental health and I should do more to maintain that regardless of what external influences exist.  Thanks for the reality check.  If I proceed I will try and make pacing and taking care of myself a priority.  I appreciate the comment.",
          "author": "InsectSilent",
          "created": 1626977755,
          "upvotes": 1,
          "replies": {
            "h65lk9g": {
              "link": "/r/AskAcademia/comments/op1b8d/need_help_deciding_on_phd/h65lk9g/",
              "text": "Self care is so important and being independent means taking care of yourself and knowing when to ask for help and when to take a break. Can be tough to learn but you'll be better at everything you do in life. Good luck.",
              "author": "ACatGod",
              "created": 1626977904,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}