{
  "sid": "djgrka",
  "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/",
  "title:": "Applying to a PhD program. After reaching out to potential advisor, they want to have a “chat” tomorrow over the phone.",
  "text": "Hello AskAcademia. I’m a first gen college graduate applying to a PhD program at a very prestigious school and I am very intimidated by this process because it is so foreign to my supportive network. I am so nervous. I sent an email to a prospective advisor describing my background/research interests. She responded, told me that I sounded well-aligned with the program and that she would like to chat more. \n\nFirst question- Is this an interview ? Will it have any influence on their decision to possibly accept or reject me? \n\nSecondly- what questions should I expect to be asked? And finally, what questions should I ask? \n\nThank you!",
  "author": "TheCasshole",
  "created": 1571365119,
  "updated": 1634081987,
  "over_18": false,
  "upvotes": 98,
  "upvote_ratio": 0.95,
  "comments": {
    "f455snq": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f455snq/",
      "text": ">First question- Is this an interview ? Will it have any influence on their decision to possibly accept or reject me?\n\nIt's not part of the formal interview process, in that it sounds like you haven't yet submitted an application. But yes, the impression you leave could have implications for your application (particularly for either extreme, e.g., if you leave a strong positive impression, that can bode well for you, and if there are any red flags, that could harm your application).\n\n>Secondly- what questions should I expect to be asked? And finally, what questions should I ask?\n\nI've not personally had a conversation like this, and you can never be sure what a person will ask. I would say to be familiar with 1) her research and 2) why you're interested in working with her (e.g., how your research interests/experiences might align). As far as what to ask, consider what you might like to know (especially early on in the process, before applying / before a formal interview). There are some guides for asking grad school interview questions (often for each discipline) that may provide some helpful guidance.\n\nCongratulations! My guess is that this potential advisor is interested in you (far from a guarantee that you'll be admitted, to be sure, but I doubt she's offering to chat with everyone who emails her). I hope you have a good chat, and good luck with your applications!",
      "author": "jogam",
      "created": 1571366784,
      "upvotes": 88,
      "replies": {
        "f45fpnj": {
          "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45fpnj/",
          "text": "Why is everyone on here so sweet and encouraging. Neither of my parents graduated college, my dad didn’t even finish high school, so to have strangers that want to help me and give me advice means more than any of you will ever know. Thank you.",
          "author": "TheCasshole",
          "created": 1571375283,
          "upvotes": 81,
          "replies": {
            "f45g7q6": {
              "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45g7q6/",
              "text": "Good luck to you! Neither of my parents went to college. I have a PhD. I teach at a community college with a surprising number of first gen students with doctorates.  It's seriously the most supportive place I've ever worked.",
              "author": "catnamedpants",
              "created": 1571375825,
              "upvotes": 26,
              "replies": {}
            },
            "f45pg8v": {
              "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45pg8v/",
              "text": "Your family background doesn't define you. You're as good as anyone who has 100 generations of PhD's in their ancestry.",
              "author": "parkway_parkway",
              "created": 1571388544,
              "upvotes": 13,
              "replies": {
                "f4765hy": {
                  "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f4765hy/",
                  "text": "I love your comment for the wholesomeness and because it makes me think of some family that has portraits of the PHDs in their family on a wall, stretching back to ancient Rome or China.",
                  "author": "Pop_pop_pop",
                  "created": 1571417842,
                  "upvotes": 3,
                  "replies": {
                    "f4771e3": {
                      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f4771e3/",
                      "text": "I guess he'd be called Pliny the really seriously younger.",
                      "author": "parkway_parkway",
                      "created": 1571418204,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f45xtkh": {
              "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45xtkh/",
              "text": "Honestly, people here just want to help.  Neither of my parents had a PhD though they did go to undergrad.  But they didn't know much about her school.  And my in-laws really less.  They asked when I was finishing if they should go to my defense or my graduation ceremony (basically is there a difference or not).  I told them the defense was bigger since that's when I find out if I get my degree.  \n\nBut to your question, I do think you've got a lot of great potential questions.  One I asked during these meetings (did a lot for postdoc), was what are their expectations for a grad student and what did they like most about the university/department and what they liked the least.  It usually made them think and the common response to the worst was the cold/winter.  It was in Michigan so the winter can be bad if you are not used to it.  Always made the meeting a little more relaxed.  This isn't a make or break interview but can help your chances if you find a professor already interested in taking you.  Makes it easier on the admission committee",
              "author": "AimanaCorts",
              "created": 1571399782,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "f456aqw": {
          "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f456aqw/",
          "text": "When you say be familiar with her research, I’ve realized I don’t quite know what that means. I might go way overboard, reading their papers over the past several years and determining the next steps etc. But I’m realizing it might be a broader overview than that.\n\nCan you give some guidance on this?",
          "author": "ub_biology",
          "created": 1571367132,
          "upvotes": 11,
          "replies": {
            "f457smq": {
              "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f457smq/",
              "text": "That's exactly what you should do, read several of her latest papers. Understand what kind of work she does, what are the common methods she uses. Once you feel comfortable, I'd even see if you can learn a little more about the history of her specific field and where some of her ideas come from.",
              "author": "yungsemite",
              "created": 1571368243,
              "upvotes": 21,
              "replies": {
                "f460gzj": {
                  "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f460gzj/",
                  "text": ">  latest papers\n\nI do think this is important. Prospective advisors want students that share current interests or can provide ways to go in new, but related, research directions. Not students that want to rehash old portions of their research agenda or didn't take the time to check out their brand new exciting stuff.",
                  "author": "a_large_plant",
                  "created": 1571402257,
                  "upvotes": 3,
                  "replies": {}
                },
                "f4580r7": {
                  "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f4580r7/",
                  "text": "It seems like a huge amount of work if you’re looking at more than a few faculty.",
                  "author": "ub_biology",
                  "created": 1571368412,
                  "upvotes": 4,
                  "replies": {
                    "f458h2f": {
                      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f458h2f/",
                      "text": "It's par for the course.",
                      "author": "organiker",
                      "created": 1571368756,
                      "upvotes": 25,
                      "replies": {
                        "f458xx9": {
                          "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f458xx9/",
                          "text": "Alright. Now I know I’m not doing it wrong.",
                          "author": "ub_biology",
                          "created": 1571369121,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "f45m6du": {
                      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45m6du/",
                      "text": "If someone thinks that then a PhD is probably not for them.",
                      "author": "ginisninja",
                      "created": 1571383507,
                      "upvotes": 6,
                      "replies": {
                        "f46fucf": {
                          "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f46fucf/",
                          "text": "Ouch",
                          "author": "ub_biology",
                          "created": 1571408232,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "f45q3fq": {
                      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45q3fq/",
                      "text": "That’s why it’s not advisable to apply to more than a handful of programs. Either your applications have to suffer (because you can’t dedicate enough time to all of them) or your current work suffers (because you’ve dropped it all for apps).",
                      "author": "NoxiousQuadrumvirate",
                      "created": 1571389562,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f457cdt": {
              "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f457cdt/",
              "text": "For example, reading some recent papers from this professor and having a general idea of the kind of work she does (e.g., looking over her website, if one is available). It's not necessary to know the ins and outs of every paper of hers over the past 20 years or anything along those lines.",
              "author": "jogam",
              "created": 1571367900,
              "upvotes": 12,
              "replies": {}
            },
            "f45asn6": {
              "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45asn6/",
              "text": "Print out 2-3 of their most recent first or second author papers. Read the abstract. Then read the conclusion. If all makes sense so far, dive into the results and methods section. Make notes on what you're confused on and ask them about it if it comes up in the conversation. It'll show that you've read their work and are not afraid to learn about it.",
              "author": "diskprept",
              "created": 1571370636,
              "upvotes": 5,
              "replies": {
                "f45tlzr": {
                  "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45tlzr/",
                  "text": "It should be last author.",
                  "author": "shytheearnestdryad",
                  "created": 1571394828,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f4562fo": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f4562fo/",
      "text": "Hi! First of all, good luck on your admissions journey. It can be rough but hang in there!\n\nSounds like this is good news. Usually profs want to chat to get to know you, see if you'd be a good fit for their lab (both personality- and research-wise), and answer your questions. I can't say whether this has too much influence, it depends on the school. Some, the advisor has all the say. Some, they have little. \n\nQuestions I'd ask, in no particular order:\nHow did you get where you are today? (Good icebreaker, learn about them, ppl love talking about themselves so it gets you through the nervous first few minutes)\nWhat do you look for in potential advisees?\nIs your lab mostly structured, or are you more flexible with what your students pursue?\nDo you have full funding for a new student? Or will I need to pursue outside fellowships?\nIs there anyone else you recommend I talk to? (I usually ask at the end)\n\nYou can of course ask more concrete questions about stipends and benefits and such, but usually I save that for later or a follow up email. Hard details can (and should) always be written; you're having a call to get to know each other. \n\nAlso, reach out to their students! They know what it's really like to work with this person, and I know I personally won't sugarcoat things when prospective students ask about my PI. \n\nGOOD LUCK OP!",
      "author": "magpie2295",
      "created": 1571366971,
      "upvotes": 15,
      "replies": {}
    },
    "f456h8y": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f456h8y/",
      "text": "My advisor had me call him after I reached out as well for my masters program. I was so nervous that I prepared some talking points on word and had my laptop open to it during the call. It turned out to be pretty informal and even enjoyable. He just asked me what my research interests were and what my career goals were. It was about half an hour and we talked about other things, like where I’m from and other random things. Honestly, it’s definitely a good sign that they reached out to you! You’re going to do great!",
      "author": "realemohourz",
      "created": 1571367262,
      "upvotes": 9,
      "replies": {}
    },
    "f45aitv": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45aitv/",
      "text": "Hey fellow first gen student! I just had one of these recently and here's what I've learned. \n\nAs far as your first question, yes and no. A phonecall is a chance to give a good first impression to a POI. And good first impressions will definitely serve you well whereas bad impressions will do the opposite. But the POI might not be on the admissions committee so it might not matter. That said, it's always good to give a good first impression so that POI will bat for you if needed.\n\nAs far as your second question, this depends on what you talked about previously. If they said they want to chat, that's probably just it. I wouldn't look at it as an interview. They probably really just want to know about your past experience, what you're looking to do in the future, etc. to see if you'd be a good fit for their lab/their future research plans. \n\nAnd honestly, if it goes badly that's a great sign that the POI might not be someone you want to work with anyway. This is a great opportunity to gain some insight on them before you even pay to apply. Take it! \n\nAlso feel free to PM me with any questions, if you want!",
      "author": "diskprept",
      "created": 1571370402,
      "upvotes": 7,
      "replies": {}
    },
    "f459d53": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f459d53/",
      "text": "I'm a first-gen-college-student working on my PhD at a 'very prestigious school', also in the social sciences....and boy do I know what you mean by *this process...is so foreign to my supportive network*! \n\nThe fact she's reaching out is a **great** sign, make sure to have questions you want to ask them. u/himalayansaltlick has a great list in a comment in this thread. Be prepared to discuss your research interests and be prepared to discuss her research. You don't have to be intimately familiar with her work, but you do have to be prepared to explain why you think she'd be a good fit as an advisor. \n\nSomething to think about, as well, is where she is in her career trajectory: for example, is she tenured? This is NOT something I would ask her, but it might color the way you emphasize certain things. For example, if she seems like she's part of the core faculty in the department, then emphasizing the fit with her makes a lot of sense. If she seems like someone who might be looking to make a move, though...then you might want to make sure you emphasize the fit with the rest of the department as well. \n\nSomething else to think about is that some departments have really strong identities in terms of their place within the discipline. You're going to want to be familiar with that if it's the case...*but also remember that even in the most extreme cases of 'this is how we do it here', there are going to be detractors and you might be talking to one of them.*\n\nYou said *social sciences*, but there's a lot of variation between disciplines. You might want to give some thought to what sort of research methods you'd be interested in deploying. For example, in sociology, it's going to make a difference whether you're an ethnographer, a computational researcher, etc. Are there skills you think you'll need to be successful that you don't already have? If so, you might want to be prepared to say that and talk about how you're planning on acquiring them.\n\nThis is by no means a list of things you should shoehorn into a conversation, just a list of things to maybe have thought about a bit so you're not caught off guard. The fact that you're being this proactive probably means you're going to be just fine.\n\nGood luck! It's a long road, but it can be a pretty rewarding one. If you happen to be looking into my discipline, shoot me a PM and maybe I can be more helpful.",
      "author": "TheGreatNorthWoods",
      "created": 1571369452,
      "upvotes": 18,
      "replies": {
        "f45o1qm": {
          "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45o1qm/",
          "text": "[deleted]",
          "author": null,
          "created": 1571386312,
          "upvotes": 3,
          "replies": {
            "f46ii65": {
              "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f46ii65/",
              "text": "I’m not going to argue about whether or not those were good questions, maybe you’re right and those are better let for later.\n\nBut you’re categorically wrong about whether this sort of experience is foreign to everyone. There are people in my program whose parents are professors. Is it the majority? No...but it’s a significant proportion.\n\nTo some extent, this is going to vary by field and by institution. But neither PhDs nor PhD students are evenly distributed in the population and PhD students are likelier to come from networks with more people who are familiar with the process than students with no college degrees in their families. This isn’t a categorical condition, but it’s the clear trend.\n\nAnd there’s a whole other set of conditions that don’t fall into the ‘have-PhD’ bucket, but are still helpful in providing guidance to someone starting out: navigating a white collar work environment, attending conferences, blah blah blah. If you’re first  gen, you’re less likely to know someone who has experience with that.\n\nNow, I want to be clear that even for people in their networks who have folks who are vaguely familiar with these things, it’s not like those people will necessarily be super helpful. They might very well not be. And the further into a program you get, the more esoteric your challenges. But not having those people in your networks adds to the *sense* that you’re a fish out of water.",
              "author": "TheGreatNorthWoods",
              "created": 1571409242,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "f457d01": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f457d01/",
      "text": "[deleted]",
      "author": null,
      "created": 1571367914,
      "upvotes": 16,
      "replies": {
        "f45fkzi": {
          "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45fkzi/",
          "text": "First of all, thank you. I almost started crying when you said it was a great sign. So do they not give phone calls to each student? \n\nSecond, thank you for your suggestions- they are definitely going on my list of questions, especially the one regarding mentorship style. \n\nFinally, validate me. Do you think I have a chance at this hahah so nervous, but I want it so badly. I graduated Ugrad with a 3.87?   \n\nReddit is the best, and I appreciate you so much.  Thank you Himalayansaltstick",
          "author": "TheCasshole",
          "created": 1571375141,
          "upvotes": 10,
          "replies": {
            "f45z2e0": {
              "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45z2e0/",
              "text": "You definitely have a chance at this, this professor from a highly prestigious school would not be taking time out of her day to talk to you if you didn't have a chance. A 3.87 GPA is very good, but GPA is far from the most important thing for PhD programs. The most important thing is your research experience and understanding of the scientific method.\n\nAs for how to prepare, that is sort of going to depend on what field you are going into... I am in the biomedical sciences, so I can only guarantee this advise applies to that. Obviously read some of the recent papers that have come out of this lab, and be prepared to ask any questions that you find very interesting from those papers. But, recognize that any papers that have been published are from work that has been completed, likely for years now, and the experiments you read about are not the same experiments that are going on in the lab right now. In order to get a better idea of what is happening right now, study the lab web site (hopefully this lab has a good one), and read any descriptions of currently ongoing projects. On this phone call, I would suggest saying something like:\n\n> I really liked your recent paper in [Journal Name], and found it very interesting that [one sentence summary of the major finding of the paper]. I am wondering if this is a line of research you have continued since that finding? (Optional:) In particular, I was wondering if you were pursuing... [If possible, think of what would be the next logical step in that line of research here].\n\nThen the professor will probably talk at some length about what is currently going on in the lab, and you should be prepared to just listen carefully (I do not suggest trying to take notes during this call).\n\nTalking about her research will probably only take a few minutes at the beginning of the call. She wants to talk to you because she wants to find out more about what you are interested in. You should be prepared to give a short, succinct, explanation of the research you have conducted as an undergraduate. You can think of this like an \"elevator pitch\", there are a bunch of resources online on how to best say this. [This is a good resource.](https://www.nature.com/naturejobs/science/articles/10.1038/nj7435-137a)\n\nLastly, try to relax. This type of phone call is not an interview, it is the precursor to an interview. This person that you are talking to completely understands that you have not yet even started a PhD, and is not expecting you to be familiar with every aspect of her research, or for you to have the next Nobel-Prize idea ready for her. She most likely wants to get a good sense of your personality, and whether you are someone she wants to work with and mentor for the next 4-6 years. Be personable and friendly. I would not ask any serious questions about her mentorship style or past students job placements. Those types of questions will come later, once you get the formal interview. I wouldn't ask any questions that could have a potentially negative answer, you want to keep all discussion positive at this point, this is the beginning to a long road of you deciding which lab to join.\n\nGood luck!\n\n**Edit:** Other commenters have recommended you ask her about funding. I would not recommend you do this directly, for the reasons stated at the end of my previous comment; keep it light and don't ask questions that have a potentially negative answer, leave that for the formal interview. If you are dying to know about her funding status, you can search for her on [NIH Reporter](https://projectreporter.nih.gov/reporter.cfm) (assuming this is biomedical sciences; also exists for other federal funding sources, but you'd have to look that up). A way that you can kind of steer the conversation towards her current funding status in a lighthearted way is to comment on things that are on the lab website. If she has 10 postdocs visible on her web page, maybe comment that you noticed she has a very big lab. I would not directly ask about her current funding status during your very first conversation. There is time for all of that later, right now you just want to open as many doors as possible.",
              "author": "gocougs11",
              "created": 1571401043,
              "upvotes": 9,
              "replies": {}
            },
            "f45ndqv": {
              "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45ndqv/",
              "text": "[deleted]",
              "author": null,
              "created": 1571385290,
              "upvotes": -1,
              "replies": {
                "f45vhtx": {
                  "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45vhtx/",
                  "text": "I disagree, having a good relationship with your advisor is the single most important thing in graduate school, and their mentorship/management style has a huge impact on this. If they're hands off and you need more guidance, or vice-versa, they're micro-managy and you can't work with someone breathing down your neck, it's gonna be a rough situation. The questions u/himalayansaltlick listed show that you're being thoughtful about what will make YOU successful in a grad program and if that's a problem for a potential PI, big red flag and I would bounce. Asking about their current/ongoing research is good too because matching research interests are probably the second most important thing, and faculty love talking about what they do, but dont let them spend all the available time on that.",
                  "author": "KrunkWantPuppetPals",
                  "created": 1571397225,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f456ibk": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f456ibk/",
      "text": "Hey! I'm glad you got a response from someone! The first time I applied to PhD programs, I emailed several prospective advisors as well, and some of them just didn't respond at all. \n\nIt is not an interview! She probably just wants to have more of a conversation with you to create a bigger picture of you. I had a phone call with a potential advisor, and he asked me how I decided to apply to grad programs in that particular field. He asked about what I was doing at the time (working in research post-college) and if that aligned with my interests (it didn't). I think it's best to be prepared to discuss your interests a little deeper than what you've put in the email. You also don't need to have a concrete idea of what you're interested in studying. Usually these phone calls are to get more context. I think the question about the influence it can have varies. It might make you stand out when the faculty start reviewing applications. But they also could be having these phone calls with anyone who reaches out. \n\nI remember asking him about his mentoring style and what he looks for in prospective students. You can ask about authorship opportunities. Do her students tend to have a lot of publications or presentations by the time they graduate? If her current research projects aren't clearly articulated somewhere, you can ask what she and her team are currently doing. Ask if they can connect you with any of their current students!\n\nI think if you approach it as having an informal conversation about research interests, that should work out. Sometimes it can make them see you as a whole person and not just some random application coming in.\n\nIt's an awkward thing, but you'll feel better once you have her on the phone!\n\nBest of luck!",
      "author": "MamaKhaleesi",
      "created": 1571367284,
      "upvotes": 5,
      "replies": {}
    },
    "f456k14": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f456k14/",
      "text": "first: deep breaths! you’ve got this!\n\nshe’s likely trying to get a sense of your goals and motivations, your previous experiences and ability to speak to any research you’ve been involved in, and also get a sense of whether you’d be a good fit for their program. it is kind of like an interview in this sense, but not in an official capacity. definitely be prepared to discuss why you want to pursue a PhD and what you’ve done so far that demonstrates how you will be successful on this path, and what specifically about their program was attractive to you.\n\nif you make a good impression, then it will definitely help your application and she will be a helpful resource as you move along in the official application and interview process. \n\nbe sure to keep an open mind about other potential advisors and opportunities through the program. you can consider asking about unique features of their program (that you cant readily access online), teaching requirements, publications, accessibility of other students and faculty advisors, average time it takes to graduate, and funding for your position. you can and should also try to talk with current or recent graduates about the program. \n\nGood luck!",
      "author": "krustymuffin",
      "created": 1571367320,
      "upvotes": 6,
      "replies": {}
    },
    "f457ydt": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f457ydt/",
      "text": "I had two of these interviews. First time, the professor had just called to talk about in general and see if I can speak fluent English.\n\nSecond time, it was more of a chat to learn about my background, what I studied and have researched on. To see if I knew about the professors research background. I also let her know about our common acquaintances which I later learnt she had reached out to to check my background. They were her past students and ex-colleagues.",
      "author": "rafters08",
      "created": 1571368363,
      "upvotes": 6,
      "replies": {}
    },
    "f4580pe": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f4580pe/",
      "text": "First, FUCKING CONGRATS. That’s some awesome news. \nOkay, I haven’t read through all the comments but I had a similar thing happen to me when I applied to my PhD.\n\nI think the professors here can answer your first question. As for question number 2 well I have some advice: \n\nThey won’t expect you to be an expert, relax. Make sure you at least know what the hell is going on in their lab. Knowing their recent published stuff is good, not in depth but be aware. \n\nI think it’s also good to read/skim a paper from a few years ago that you genuinely find compelling. Might come up in conversation. \n\nBe yourself. I always tell my friends who get nervous for “interviews” to not focus on the power dynamics. You are a capable adult and they also respect you. Ask thoughtful questions if you have the chance, admit to ignorance when needed. If you have a mind for jokes insert a funny line here and there. You are also interviewing them and if they’d be a good fit for you. \n\nLastly, if they ever ask if you have any more questions for them it’s always good to know what drives them to do research. I’ve gotten some great answers in the last two years. \n\nAlso, have fun!",
      "author": "DoctusCerebrum",
      "created": 1571368411,
      "upvotes": 6,
      "replies": {}
    },
    "f456qee": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f456qee/",
      "text": "I've had five Skype conversations with potential supervisors when applying to graduate schools.  In terms of the questions asked, they went roughly as follows: (i) one wanted to see if I was actually interested given a partial mismatch between our focuses, which was the majority of the conversation, but also there was some standard interview questions, he got me to ask him about his work, (ii) another wanted me to ask her questions after giving me a brief run down of how the application, MSc (the MSc there was 16 months), etc process worked, (iii) a third wanted to know my familiarity with the kinds of tools he used as well as standard interview questions, (iv) another asked me a lot about my background since I have a very strange undergraduate history, including about my thesis, alongside standard interview questions, and (v) one asked me a lot about my interests and general stuff about arrangements since he would have only been my co-supervisor, in return I picked his mind about certain things he knew a lot about that I'm interested in.  Most asked about how widely I was applying and whether they were my top choice.\n\nI would say that the best preparation is to have a few questions ready for them, have a clear answer for why you want to do the things they do, and to have an elevator pitch for any undergraduate research you've done and/or your undergrad thesis.  Aside from that, just seem nice and maybe prepare for \"job interview\" questions.\n\nI received offers following graduate applications to work with all of the people who interviewed me except (v), which was less surprising since it was to a school out of the country for me.",
      "author": "willbell",
      "created": 1571367450,
      "upvotes": 3,
      "replies": {}
    },
    "f45x7h6": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f45x7h6/",
      "text": "I agree with most of the comments that are here.  The only things that I would add based on when I was applying to programs and had these conversations are:\n1) know why you are interested in a phd. For me this was that I found that at work what I enjoyed the most was the research and that I felt I needed more instruction and experience in various methods. \n2) ask who else in the department/at the university has research interests that are aligned with yours.  This can be helpful because you might have overlooked someone in your original research and because then you can reach out to another person and if you apply you’ll have two or more  people who are expecting your application and interested in bringing you to the university. It’s also good because it’ll give you an idea of how easy it’ll be to form a committee for your dissertation. \n\nGood luck and congrats!",
      "author": "BanAllCars",
      "created": 1571399138,
      "upvotes": 3,
      "replies": {}
    },
    "f46i4z7": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f46i4z7/",
      "text": "Be ready to answer questions like \"why do you want to get a phd\" and \" why do you want to join my lab\". Those questions can be difficult to answer if you haven't organized your thoughts ahead of time.",
      "author": "ZeMeest",
      "created": 1571409103,
      "upvotes": 3,
      "replies": {}
    },
    "f456ci0": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f456ci0/",
      "text": "Love this post!!!",
      "author": "Anonymouswhining",
      "created": 1571367166,
      "upvotes": 2,
      "replies": {}
    },
    "f459nyl": {
      "link": "/r/AskAcademia/comments/djgrka/applying_to_a_phd_program_after_reaching_out_to/f459nyl/",
      "text": "She just wants to get a sense of your personality to see if you'd work well together.  No need to have your proposal idea entirely ironed out.  If she's a good mentor, she'll help you shape the idea into something workable.\n\nDuring the call, she's going to check to make sure you're open to her suggestions.  In other words, don't come in with an inflexible idea of what you want to do.  Let her help you shape your research idea so that the idea is mutually interesting.\n\nGood luck-- you got this!",
      "author": "trevor4551",
      "created": 1571369692,
      "upvotes": 2,
      "replies": {}
    }
  }
}