{
  "sid": "qqxm8q",
  "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/",
  "title:": "Frustrating Ph.D. Life",
  "text": " \n\nSo this happened a couple of times now.\n\nWhile working on a topic I propose one direction of the results saying this seems interesting, to my supervisor. only for him/her to completely obliterate my proposal saying we can do this later.\n\nNow fast forward while presenting my work in a meeting reviewer asked for the same thing that I proposed to my supervisor.\n\nI guess now the supervisor has completely forgotten that I suggested the same thing a few months ago...\n\nHow can earn the trust?\n\nShare your experience...",
  "author": "ch1253",
  "created": 1636560174,
  "updated": 1636654640,
  "over_18": false,
  "upvotes": 98,
  "upvote_ratio": 0.95,
  "comments": {
    "hk32dyr": {
      "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk32dyr/",
      "text": "It's not necessarily a matter of trust, but it can be more of a strategic decision that you don't fully agree with. \"Let's see if the reviewers ask for it\" is a perfectly reasonable path in some cases. \n\nOn the other hand, there often comes a time during a PhD when the student is in a better position to understand what needs to be done, and what comes next. Generally this is toward the end of the degree (maybe year 4 or 5 under the American system). At this point, a little bit of push-pull between mentor/mentee is often necessary and healthy. Advocate for yourself.",
      "author": "redoran",
      "created": 1636561818,
      "upvotes": 67,
      "replies": {
        "hk33k4e": {
          "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk33k4e/",
          "text": "It has happened to me before something similar. It is not about trust. In my case, I thought about it as a communication problem. Sometimes, I am not good at communicating some research path, experiment or results and my supervisors have not clear of what I'm trying to say. Working from home also made this even harder. \n\nIt is also true that we as researchers are in the best position to understand our results and sometimes we forget to mention maybe something obvious for us, but no so for the audience. In addition, they have their heads in many things at the same moment. \n\nAfter that, I decided to put some work in my communtication skills and it has been somewhat better since then. \n\nDon't lose the motivation, trust your gut. \n\nHope it helps!",
          "author": "ahhm1495",
          "created": 1636562237,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "hk439u2": {
      "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk439u2/",
      "text": "haha, this happened so, so often in my PhD.  I would suggest path A, but my advisor suggests path B, then C, then D, and then finally -- after forgetting the initial ideas -- also suggests A, then doubles down on it being the best path forward.\n\nTry not to get frustrated about it.  It's all part of the process.  The silver lining takeaway is that your intuitions are good, and you should take comfort in knowing that.  \n\nFor sanity and protection sake, I do recommend audio recording all of your meetings.  It helped me with keeping track of ideas and who said what, when.",
      "author": "fumblesmcdrum",
      "created": 1636576093,
      "upvotes": 11,
      "replies": {
        "hk4aquz": {
          "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk4aquz/",
          "text": ">I would suggest path A, but my advisor suggests path B, then C, then D, and then finally -- after forgetting the initial ideas -- also suggests A, then doubles down on it being the best path forward.\n\nSometimes in the beginning of my PhD my supervisor would criticize A and demand I do B, C and D, and then later when I presented the data, say it was a bad idea and ask why I did it... Then I learned to agree to B, C and D, but just go and do A. By the time I present the data for A she doesn't remember about B, C or D anymore.",
          "author": "EmeraldIbis",
          "created": 1636578992,
          "upvotes": 7,
          "replies": {
            "hk4da5y": {
              "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk4da5y/",
              "text": "ooh, I'm getting flashbacks",
              "author": "fumblesmcdrum",
              "created": 1636579980,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hk33utp": {
      "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk33utp/",
      "text": "phd students tend to have a problem with focus.  the tendency will be to tell any student no to any peripheral idea.   once the main project is well along limited side projects can be good.  reviewers can help identify these.  \n\ntldr:   i think your supervisor may have been right to tell you no previously.  and it might also be a good idea to reconsider now.   keep a list of your ideas and periodically go through them with your advisor",
      "author": "bu11fr0g",
      "created": 1636562355,
      "upvotes": 30,
      "replies": {}
    },
    "hk32qfw": {
      "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk32qfw/",
      "text": "This sounds totally normal, unless your advisor is being really rude about shutting your proposal down. Everyone changes their mind and forgets things. Sometimes your advisor will be right and sometimes you will be right. How often is this happening? How badly is it affecting your timeline/accomplishments? How senior are you? Are you new or are you about to graduate? \n\nIf it happens once in a while and isn't delaying publication tons, then vent to your friends and move on. Are there proposals your advisor was right to put off? If you're right some of the time but they're right some of the time, that's just life (believe me, I've been there—but if I'm being honest with myself, my PI is right 9 times out of 10, so she's saved me a ton of time chasing up stupid projects. Missing a few things and having to do them after external feedback that convinces her seems like a small price to pay)",
      "author": "tishtok",
      "created": 1636561955,
      "upvotes": 9,
      "replies": {}
    },
    "hk56e4j": {
      "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk56e4j/",
      "text": "I do it in secret and hey, reviewer asks? Here it is. \n\nI know that can’t always be done due to funding and stuff but when I can I do, even slowly pushing experiments along, \n\nIt’s frustrating but this happened way too often my first 3 years I pushed my ego aside and said no more, I have excellent suggestions.",
      "author": "sweetypantz",
      "created": 1636592345,
      "upvotes": 2,
      "replies": {}
    },
    "hk5jwj0": {
      "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk5jwj0/",
      "text": "Similar thing happened to me.\n\nI suggested X, advisor said no, referee said you should include X,  my assignment then becomes doing X for the paper.\n\nIt's frustrating but you can take it as a sign that you're thinking like an expert. As for what to do with your supervisor, just put up with it until you graduate. Honestly, there are soooooo much worse supervisor stories than this; if this is your worst considering yourself lucky.",
      "author": "First_Approximation",
      "created": 1636598371,
      "upvotes": 2,
      "replies": {}
    },
    "hk41dwt": {
      "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk41dwt/",
      "text": "reviewer asked while presenting your work in a meeting? What kind of reviewer?",
      "author": "Suspicious_Charge",
      "created": 1636575362,
      "upvotes": 1,
      "replies": {
        "hk4egxz": {
          "link": "/r/AskAcademia/comments/qqxm8q/frustrating_phd_life/hk4egxz/",
          "text": "Funding provider meeting.",
          "author": "ch1253",
          "created": 1636580450,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}