{
  "sid": "qw1qj2",
  "link": "/r/AskAcademia/comments/qw1qj2/awards_for_excellent_professors/",
  "title:": "Awards for excellent professors",
  "text": "Hi guys, I'm an undergraduate in physics who has a really excellent research mentor. I'm wondering if anyone is aware of some kind of award I can nominate them for? I think mentorship should be at the core of academia and professional success, and it's one of his particular strengths that I don't think has been recognized so far (he's fairly young). I know it's kind of specific for an undergraduate to do the nomination. Of course I looked for this kind of thing through my school first.",
  "author": "Ok_Confusion5952",
  "created": 1637162959,
  "updated": 1637384995,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 1.0,
  "comments": {
    "hl0ahbk": {
      "link": "/r/AskAcademia/comments/qw1qj2/awards_for_excellent_professors/hl0ahbk/",
      "text": "If your university doesn't have awards you can nominate professors for, one of the kindest things you can do is write a letter about how great your professor and send it to your professor, the chair of the department, and the dean of your school. Student letters like that make a big impact!",
      "author": "nezumipi",
      "created": 1637168460,
      "upvotes": 6,
      "replies": {
        "hl0g0g0": {
          "link": "/r/AskAcademia/comments/qw1qj2/awards_for_excellent_professors/hl0g0g0/",
          "text": "Was about to suggest the same thing:)",
          "author": "microbiologist_36",
          "created": 1637170607,
          "upvotes": 2,
          "replies": {}
        },
        "hl3zkmd": {
          "link": "/r/AskAcademia/comments/qw1qj2/awards_for_excellent_professors/hl3zkmd/",
          "text": "I'm a retired chair from a 5000 student state college. I LOVED getting those letters from students. I'd email the professor that I'd received a great letter from a student and how wonderful it was and attach a copy of the letter. I'd cc the dean, the VPAA and the college president who would then all respond to the professor in a positive way. Even more importantly, I'd put quotes from those letters in my annual evaluation of the faculty member and in their tenure/promotion review letters. Letters like this are really useful.\n\nDo this!!!",
          "author": "rockyfaceprof",
          "created": 1637236471,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hl0x02d": {
      "link": "/r/AskAcademia/comments/qw1qj2/awards_for_excellent_professors/hl0x02d/",
      "text": "The American Association of Physics Teachers has several [awards](https://www.aapt.org/Programs/awards/). Candidates are nominated by their colleagues, so you would not be able to nominate them yourself. However, you could work with another physics professor to put together a nomination.\n\nIn addition, you should take /u/nezumipi's suggestion of writing a letter about this. That will have a more direct and immediate impact than nominating them for an award.",
      "author": "ProbabilisticWorld",
      "created": 1637177266,
      "upvotes": 2,
      "replies": {}
    }
  }
}