{
  "sid": "pof8vy",
  "link": "/r/AskAcademia/comments/pof8vy/interlibrary_loan_access/",
  "title:": "Interlibrary Loan Access",
  "text": "After finishing coursework at the institution where I am working on my PhD I moved back home and secured an adjunct job at a local college and was told during the hiring process that I would be able to use the library and Interlibrary Loan. The Library, however, has recently told me that I can only use ILL for curriculum purposes and not for my own research. I'm now at a loss as to how I can continue my research -- the other area universities allow guest access to their own collections but not to ILL. The local public libraries allow ILL only in-state (not helpful) due to Covid. Does anyone have any advice as to how I can secure ILL services or something similar so that I may continue research on my dissertation? I can't afford to simply buy the large number of books I'll need.",
  "author": "RiderstotheSea",
  "created": 1631665750,
  "updated": 1634078991,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hcw3r2s": {
      "link": "/r/AskAcademia/comments/pof8vy/interlibrary_loan_access/hcw3r2s/",
      "text": "How can they tell if it's for your own research or curriculum purposes...",
      "author": "CerebralBypass",
      "created": 1631666290,
      "upvotes": 7,
      "replies": {
        "hcw4olo": {
          "link": "/r/AskAcademia/comments/pof8vy/interlibrary_loan_access/hcw4olo/",
          "text": "Obscure books with titles in languages other than English tend to raise a red flag. Asking for somewhat obscure Latin & French texts (and asking for dozens of them) seems to raise suspicions.",
          "author": "RiderstotheSea",
          "created": 1631666715,
          "upvotes": 1,
          "replies": {
            "hcwnh87": {
              "link": "/r/AskAcademia/comments/pof8vy/interlibrary_loan_access/hcwnh87/",
              "text": "Have they actually pulled you up on your usage thus far?",
              "author": "brazenhead93",
              "created": 1631675582,
              "upvotes": 3,
              "replies": {
                "hcwpamx": {
                  "link": "/r/AskAcademia/comments/pof8vy/interlibrary_loan_access/hcwpamx/",
                  "text": "Yes they sent me an email today informing me they couldn't process my requests.",
                  "author": "RiderstotheSea",
                  "created": 1631676515,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hcwnz4m": {
      "link": "/r/AskAcademia/comments/pof8vy/interlibrary_loan_access/hcwnz4m/",
      "text": "There's certainly no \"one size fits all answer\" to this kind of thing. Here's what I would do.\n\nThe first thing to do is to check with whomever told you you could use it. Because if it's someone with any \"pull\" they could get you an exception (which could take many forms depending on the institution — I am a \"research affiliate\" at an institution pretty much explicitly so I can get access to their e-Resources, for example; it doesn't cost the department anything to give that to me, and I do a little work on the side for them a few times a year to justify it). A department chair can appeal to a dean and a dean can get stuff done. If they care.\n\nThe second thing I'd try is to find someone on the faculty who might be willing to \"loan you\" their ILL access temporarily. That's probably against the rules, but the rules are dumb, so fuck 'em. It would be an inconvenience to them, no doubt. But if you were an adjunct grad student at _my_ institution I'd do this kind of thing for you. Because fuck that noise. Adjuncts are scholars, too.\n\nThe third thing I'd try is to have a very expanded vision of what \"curriculum purposes\" means. Tell them you _are_ thinking about incorporating these books into the curriculum. You can't tell how, exactly, until you have them in your hand, obviously. So they'd better hurry it up! This is obviously the least likely to succeed, depending on how tight a ship is being run at the library. Though you might as well make them try to make the argument. Remember: the library can't fire you. They aren't your boss. They don't write letters of rec. All they can do is what they've promised to do anyway, which is be utterly useless. So you might as well call their bluff. What do you have to lose?",
      "author": "restricteddata",
      "created": 1631675834,
      "upvotes": 4,
      "replies": {
        "hcwqear": {
          "link": "/r/AskAcademia/comments/pof8vy/interlibrary_loan_access/hcwqear/",
          "text": "Thank you for the advice -- I will try the first option to begin with; unfortunately I don't know many of the faculty but I plan on trying to get to know more of them if possible (I don't really belong to a department here), so the second option may come into play Covid restrictions permitting.",
          "author": "RiderstotheSea",
          "created": 1631677097,
          "upvotes": 1,
          "replies": {}
        },
        "hczwlcp": {
          "link": "/r/AskAcademia/comments/pof8vy/interlibrary_loan_access/hczwlcp/",
          "text": "I second the suggestion to try to get some sort of research affiliation. Most schools have these unpaid \"courtesy\" positions. \n\nThis assumes of course that the dean or department chair thinks your research has value such that they would want you to be affiliated with them.\n\nAssuming everyone is agreeable you could offer to list them as your affiliation on any publications that you produce during this period of time.",
          "author": "DeskAccepted",
          "created": 1631738914,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfhmbz7": {
      "link": "/r/AskAcademia/comments/pof8vy/interlibrary_loan_access/hfhmbz7/",
      "text": "Have you tried asking your girlfriend",
      "author": "mrauman54",
      "created": 1633447767,
      "upvotes": 1,
      "replies": {}
    }
  }
}