{
  "sid": "pxiemw",
  "link": "/r/AskAcademia/comments/pxiemw/maintaining_and_creating_a_healthy_social_life/",
  "title:": "Maintaining and creating a healthy social life?",
  "text": "I'm a 23 year old man and I'm exactly 1 year into my program. I'm a PhD student in Maths and I do research in a small office. I'm \n\nI started September 2020 in the middle of COVID, so hardly any clubs were holding in person meetings back then, so I just didn't even go to any. I shut myself in my house, made small talk with my 2 supervisors, and kept in touch with my friends. \n\nAny advice for me? It's been really hard to navigate social life during COVID, at least for me.\n\nI was recently told I can return to the office but I've never physically met the people I'll be sharing it with- any tips on how to garner a good social life?",
  "author": "Erwin_Schr0dinger",
  "created": 1632870676,
  "updated": 1634078825,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "henmwuj": {
      "link": "/r/AskAcademia/comments/pxiemw/maintaining_and_creating_a_healthy_social_life/henmwuj/",
      "text": "Hi. I’ve worked in biomedical production throughout the pandemic. I moved to a new city and knew virtually no one. For me it was all about connecting with my peers over food. First at work, then volunteering at food kitchens…everyone likes some type of food and it’s really special to share.",
      "author": "Brilliant-Grape-4798",
      "created": 1632870892,
      "upvotes": 1,
      "replies": {}
    },
    "henn449": {
      "link": "/r/AskAcademia/comments/pxiemw/maintaining_and_creating_a_healthy_social_life/henn449/",
      "text": "But overall, I would say remember not to overshare or be too vulnerable with people at work/school unless you have built trust, but make sure to keep trying to connect. It’s not as simple as it once was.\nBest of luck. Just sharing my experience, this is by no means a directive",
      "author": "Brilliant-Grape-4798",
      "created": 1632870987,
      "upvotes": 1,
      "replies": {}
    }
  }
}