{
  "sid": "ir8i9s",
  "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/",
  "title:": "Should I call my grad school supervisor by their first name?",
  "text": "I noticed 3 PhD students in our group call the supervisor by his first name. He always signs off with first name. We NEVER call profs by their first name where I'm from, and I feel awkward. What should I do? Should I go with first name?  Another MSc student goes with Dr. last name, however.\n\nBtw, this is a Canadian university.",
  "author": "Mylaiza",
  "created": 1599897123,
  "updated": 1634082354,
  "over_18": false,
  "upvotes": 90,
  "upvote_ratio": 0.94,
  "comments": {
    "g4wx9wn": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4wx9wn/",
      "text": "Ask **him** what you should do.",
      "author": "cat-head",
      "created": 1599901110,
      "upvotes": 257,
      "replies": {
        "g4x0ivs": {
          "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4x0ivs/",
          "text": "Seconded. You could ask something along the lines of \"hey, I realized that most other lab people call you by your first name. I feel a bit awkward doing that, so I wanted to check whether you have a preference either way?\" \n\nProbably his will tell you to do whatever is most comfortable for you, but in any case you'll get his opinion.",
          "author": "wirrbeltier",
          "created": 1599904733,
          "upvotes": 102,
          "replies": {
            "g4xantz": {
              "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xantz/",
              "text": "I’m a professor and advise a few people with cultural origins like OP. This is exactly what they have done but also I’ve had to go out of my way to encourage it. I don’t think it’s always fair to assume the student will know how to ask this question and to follow through. OP you can also start with something like Dr. Jack or whatever the professor’s first name is. Then work your way down to just Jack.",
              "author": "BananasonThebrain",
              "created": 1599914649,
              "upvotes": 58,
              "replies": {}
            },
            "g4zwupn": {
              "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4zwupn/",
              "text": "Hey? isn’t saying Hey a little informal .. \n\nHow about Prof. , how do you like your students to address you?",
              "author": "FoCoCS",
              "created": 1599952241,
              "upvotes": -3,
              "replies": {}
            }
          }
        }
      }
    },
    "g4wxg9g": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4wxg9g/",
      "text": "Personally, if someone signs off by their first name that’s how I’d refer to them - but in the U.K. we are much more chill about using first names, even for undergrads. Just ask id say.",
      "author": "ayeayefitlike",
      "created": 1599901308,
      "upvotes": 104,
      "replies": {
        "g4x935w": {
          "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4x935w/",
          "text": "For sure, whatever they sign off with in the emails.  Everyone is much more comfortable with that.\n\nIf someone actually wants you to constantly use the title they have some sort of superiority issues or social issues imo.",
          "author": "slick3rz",
          "created": 1599913381,
          "upvotes": 23,
          "replies": {
            "g4xi1s5": {
              "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xi1s5/",
              "text": "> If someone actually wants you to constantly use the title they have some sort of superiority issues or social issues imo.\n\nI had a colleague once say that he preferred \"Dr. Lastname\" because someone had brought to his attention that men teaching undergraduate classes, even first year grad students, were routinely called \"Dr. Lastname\", while women who might be tenured professors would in the same situation very often be called \"Ms. Lastname\".\n\nHe felt like encouraging students to be very informal with him was, and this was before I think we'd have used this word, but a form of privilege. He didn't have to work to gain their respect, so it was easy for him to be informal without losing it. So he decided he'd ask for the formality as a way of normalizing it for everyone else.",
              "author": "deong",
              "created": 1599919799,
              "upvotes": 37,
              "replies": {
                "g4xk4j6": {
                  "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xk4j6/",
                  "text": "Yeah its a real issue. Female professors have to work a lot harder to recieve kinda that baseline respect.",
                  "author": "Vanden_Boss",
                  "created": 1599920986,
                  "upvotes": 25,
                  "replies": {}
                },
                "g4zx7uu": {
                  "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4zx7uu/",
                  "text": "I ask my students to call me by my first name (at least my research students). However, there are reasons why people want to be called Dr. and is not always a superiority issue— there are valid reason — I have spoke about this in reddit already, so I don’t want to say it again.",
                  "author": "FoCoCS",
                  "created": 1599952387,
                  "upvotes": -2,
                  "replies": {}
                }
              }
            },
            "g4xblxe": {
              "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xblxe/",
              "text": "I don’t agree about the superiority thing, but to me it feels very school teacher-esque. For undergrads, it’s uncommon here but not so unusual it gives off a weird vibe. For postgrads or above yeah it feels stilted.",
              "author": "ayeayefitlike",
              "created": 1599915354,
              "upvotes": 9,
              "replies": {
                "g4xcn6n": {
                  "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xcn6n/",
                  "text": "Yeah that's more my opinion, I can't honestly imagine making someone do it myself.  I guess it's from older times as a \"sign of respect\", but even that excuse irks me a little. Respect is a two way street.",
                  "author": "slick3rz",
                  "created": 1599916122,
                  "upvotes": 3,
                  "replies": {
                    "g4xu2px": {
                      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xu2px/",
                      "text": "I respect my students enough to call them what they prefer to be called. I expect the same in return.",
                      "author": "kittymeowss",
                      "created": 1599925597,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g4xtyzd": {
              "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xtyzd/",
              "text": "I don't agree. I expect my students to address me by my Last Name as it addresses our social roles in College. I like my personal life to be separate from my professional one and them to understand that they are not allowed to have improper thoughts on me. However, in everything else I am quite chill, so I also acknowledge our humanity at the same time.",
              "author": "Haunting-Parfait",
              "created": 1599925542,
              "upvotes": 4,
              "replies": {}
            },
            "g4y3dik": {
              "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4y3dik/",
              "text": ">whatever they sign off with\n\nI see this advice a lot but I’ve always had a hard time with it because I can’t imagine signing an email with anything but my first name... would feel sort of conceited. I’d think at least some others would feel this way too. \n\nFor example, when inquiring about PhD positions I always addressed people as Dr. xxx. Everyone would use their first name in replies, but it doesn’t mean that it would have been appropriate for me to start using it yet. Similarly, some people just sign with the first letter of their name in lowercase.. obviously you wouldn’t use that. Dunno, I always go for too formal as it’s less awkward to correct than too informal",
              "author": "sweetpotatofiend",
              "created": 1599929524,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g4zh9ac": {
          "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4zh9ac/",
          "text": "This is always my policy and I’m at an American university.",
          "author": "New_Hawaialawan",
          "created": 1599947022,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4wyy5i": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4wyy5i/",
      "text": "I assume you are from one of the Asians countries like me. I have been told that Dr. Last name is a safe bet where both parties are comfortable. It seems ur supervisor is ok with first name but naturally that makes you uncomfortable so Dr. last name would me most appropriate or professor last name.",
      "author": "ShubroDeep",
      "created": 1599902999,
      "upvotes": 33,
      "replies": {
        "g4xkx5v": {
          "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xkx5v/",
          "text": "Asian here doing a PhD in Canada. I totally get what OP is talking about. I come from a country where student-teacher hierarchy is maintained rigorously in most institutions. I moved to Canada for grad school and for first few weeks I had to wrap my head around how all the profs in my department went by their first name when interacting with grad students. The graduate program director actually gave us the same advice that other users have been giving: check with your prof!",
          "author": "pin_yue",
          "created": 1599921361,
          "upvotes": 15,
          "replies": {}
        },
        "g4x9y6k": {
          "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4x9y6k/",
          "text": "Yes, I am, and so is the prof! It makes it more weird. He seems too chill for an Asian, tbh. (I swear I'm not racist, I'm from the same culture!)",
          "author": "Mylaiza",
          "created": 1599914089,
          "upvotes": 22,
          "replies": {}
        },
        "g4x9eju": {
          "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4x9eju/",
          "text": "I instantly thought the same! Lol",
          "author": null,
          "created": 1599913642,
          "upvotes": 5,
          "replies": {}
        },
        "g4xi6se": {
          "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xi6se/",
          "text": "I’m also from Asia but it’s actually nothing to do with Asian. \n\nI was a newbie in the first semester and sent my first email to my advisor, calling her her first name. Then she immediately told me call her D. lastname.\n\nIt’s safe to assume professors like being called as Dr. lastname. Calling first name directly is something that you may be technically allowed but actually don’t recommend.\n\nPhd may be an exception, though.",
          "author": "academic_and_job",
          "created": 1599919887,
          "upvotes": 2,
          "replies": {
            "g4xk5bo": {
              "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xk5bo/",
              "text": "That maybe so but I have neither the balls nor do I feel comfortable calling my professors and supervisor by their first name.",
              "author": "ShubroDeep",
              "created": 1599920997,
              "upvotes": 3,
              "replies": {}
            },
            "g4xjhkg": {
              "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xjhkg/",
              "text": "Asia is a very big place.",
              "author": "Mylaiza",
              "created": 1599920670,
              "upvotes": 7,
              "replies": {
                "g4xjzgl": {
                  "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xjzgl/",
                  "text": "True.",
                  "author": "ShubroDeep",
                  "created": 1599920918,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g4xdvv8": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xdvv8/",
      "text": "I'm a professor at a Canadian university and I don't know any profs who go by anything other than their first name with grad students! Undergrads are sometimes different,  but academic culture in grad school is pretty relaxed.",
      "author": "ke_marshall",
      "created": 1599917007,
      "upvotes": 24,
      "replies": {}
    },
    "g4wzyln": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4wzyln/",
      "text": "It is normal for PhD students to call faculty by their first names when there is more of a colleague type of relationship or preparation/socialization into the field. When I was a doctoral student and just starting I had written emails with Professor or Dr as a title and often got emails back saying at this point we are on a first name basis. It’s not common, however, at the Master’s level to be on a first name basis. In my field, we actually prefer Professor to Dr (in a university and not industry setting, of course) and I have no idea how that convention emerged. If the other masters student is using Dr consistently then that’s probably what it should be, but there’s never harm to ask and it might even reflect positively on you!",
      "author": "ofilosophic",
      "created": 1599904105,
      "upvotes": 12,
      "replies": {}
    },
    "g4xifnj": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xifnj/",
      "text": "I'm a professor in the US. From my first encounter with students of all ranks I introduce myself as \"Dr LastName\" and go on to say \"but, please,  call me FirstName\". If a student, due to their country of origin, home culture,  or personal choice,  decides to call me Dr or Professor, that's fine by me. Im bith of those things. But,  when possible, my first name is fine. I know that some professors do use Dr or Professor. They're absolutely entitled to that. It's not an ego trip,  as somebody suggests in this thread. Believe me when I say, our PhD or our professional title didn't come easy to most of us. We work extremely hard. Most of us are pretty normal, humble people.",
      "author": "phenomenologist83",
      "created": 1599920043,
      "upvotes": 7,
      "replies": {}
    },
    "g4x1zf5": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4x1zf5/",
      "text": "It really depends on the country, and I have no knowledge about the customs in Canada.\n\nIn some countries, you basically always use the \"Dr./Professor last name\" whereas in other countries you always use the first name (including first year undergraduate student addressing a professor).\n\nIf in doubt, just ask him.",
      "author": "AgXrn1",
      "created": 1599906383,
      "upvotes": 3,
      "replies": {
        "g4xl615": {
          "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xl615/",
          "text": "[removed]",
          "author": null,
          "created": 1599921476,
          "upvotes": 3,
          "replies": {
            "g4xqy43": {
              "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xqy43/",
              "text": "Thanks for the info.\n\nI'm probably from one of the chillest places - Scandinavia. A professor insisting on Dr. surname would quickly discover that he/she might as well forget about that. We don't do titles here at all.",
              "author": "AgXrn1",
              "created": 1599924174,
              "upvotes": 2,
              "replies": {
                "g4ydbh8": {
                  "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4ydbh8/",
                  "text": "So interesting. Down here in Austria, anything else but Mr. Lastname or Mr. Professor Lastname would be incredibly rude (unless you're closely working together as postgrad/supervisor in the same lab group or such).",
                  "author": "Quetzacoatl85",
                  "created": 1599933424,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g4xpl37": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xpl37/",
      "text": "I'm also from a Canadian University. I always just refer to my profs the same way they refer to themselves. I've had some profs sign off with just a first name and some sign off with Dr. Last Name; whatever they indicate they're most comfortable with. You can also always ask.",
      "author": "avoiding_a_stalker",
      "created": 1599923570,
      "upvotes": 3,
      "replies": {}
    },
    "g4xj585": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xj585/",
      "text": "I always address someone very formally in this type of situation and it's up to the other person to eventually tell me if they want to be adressed less formally or in certain way e.g. doctor (last name), judge (last name). If it's so important to you to not stand out in this particular situation just ask the person about it. Never assume that you can just address someone the way other people around you do if they don't use formal language ( I mean in situations like this). \nTo be honest I wouldn't call this person by their first name, it changes a lot in your interactions and often not for the better.",
      "author": "enaika",
      "created": 1599920490,
      "upvotes": 2,
      "replies": {}
    },
    "g4xpvye": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xpvye/",
      "text": "most of my group called my old research advisor by his first name. except for one guy who called him boss ..lol. Which my research advisor happily accepted.\n\nI called him. buy his last name, which also was accepted. I definitely didn feel comfortable calling by the first name because when I joined i felt like he was more a professor to student power ratio vs a research advisor to fellow researcher. aka basically the power dynamic was too big.",
      "author": "RaddishEater666",
      "created": 1599923742,
      "upvotes": 2,
      "replies": {}
    },
    "g4xx3xa": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xx3xa/",
      "text": "Just ask. I typically call profs by their titles until they specify to do otherwise. I'm very close to my supervisor and I still call him by his title, it's become a bit of a joke at this rate.",
      "author": "half_a_lime",
      "created": 1599926928,
      "upvotes": 2,
      "replies": {}
    },
    "g4y23bp": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4y23bp/",
      "text": "In general, I always err on the side of being more formal than less. Calling someone Professor or Dr. So and So is never going to be offensive, so when in doubt, or if you prefer it, just call them that. If they prefer you to be more informal then they'll probably just say, you can call me Firstname. But chances are, even if they prefer being addressed by their first name but you call them Dr./Prof it won't be something offensive or bother them that much.",
      "author": "LooksieBee",
      "created": 1599928957,
      "upvotes": 2,
      "replies": {}
    },
    "g503ud3": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g503ud3/",
      "text": "In my Canadian university, unless the prof have emeritus status and is over 65, we call them by their first name.",
      "author": "GrumpyCockatoo",
      "created": 1599954781,
      "upvotes": 2,
      "replies": {}
    },
    "g4xh4dw": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xh4dw/",
      "text": "I started with Professor \\_\\_\\_\\_\\_\\_\\_, but now that it's been a couple months and everyone else in our group (including other MSc students) call him by his first name, I've switched to just using that. \n\nI'm in Canada as well btw :)",
      "author": "Quiinton",
      "created": 1599919199,
      "upvotes": 1,
      "replies": {}
    },
    "g4xhpxs": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xhpxs/",
      "text": "I go by what the professor/supervisor themselves say at the beginning of class. And if they say “You can call me by my first name,” then I do.\n\nMost professors say this. But I have one who only introduces herself as Dr. [X], and so that’s what I call her.",
      "author": "tequilamockingbird16",
      "created": 1599919585,
      "upvotes": 1,
      "replies": {}
    },
    "g4xwlj3": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xwlj3/",
      "text": "Depends on your age difference, honestly.",
      "author": "theoneandonlypatriot",
      "created": 1599926643,
      "upvotes": 1,
      "replies": {}
    },
    "g4xwpfc": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xwpfc/",
      "text": "My feeling is that whatever they sign their name as, that’s who advisors consider themselves in their relationship to you. If other students do it, and you feel comfortable, sounds like you should call them by their first name!",
      "author": "Mallornthetree",
      "created": 1599926703,
      "upvotes": 1,
      "replies": {}
    },
    "g4y6mq4": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4y6mq4/",
      "text": "I’ve always used whatever they use. Frankly, learning to use their first names, in cases where they introduce themselves that way, is good practice for the job market. A lot of job apps get tossed because their letters address the committee as “Drs.” but the applicant signs off with his/her first name. In short, they sound like they’re still students and thus not colleague material.",
      "author": "mljohnson119",
      "created": 1599930906,
      "upvotes": 1,
      "replies": {}
    },
    "g4ydnqu": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4ydnqu/",
      "text": "I heard that PhD students can call their professors and advisors by their first names because they are seen more as colleagues now.\n\nI recommend if you are a Masters or Undergraduate student, you should stick with Dr. ____ \n\nUnless that professor/advisor specifically says you can call him/her by the first name.",
      "author": "CSDisneyFix",
      "created": 1599933605,
      "upvotes": 1,
      "replies": {}
    },
    "g4yf0p4": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4yf0p4/",
      "text": "In our department, we had an unspoken rule: in the lab, and while working together, the use of the first name was OK. Outside, and in reference to him in front of others (students, faculty, general public) he always was and to this day he remains \"Prof. X\".",
      "author": "ethanfinni",
      "created": 1599934048,
      "upvotes": 1,
      "replies": {}
    },
    "g4ygahf": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4ygahf/",
      "text": "I am from Asia so culturally I instinctively feel I should address seniors and supervisors by their title and last name. However, what I've been doing recently is ask them at the end of the first meeting how I should address them. Even if they say first name, I still end up saying Dr. Firstname.",
      "author": "jack-dawed",
      "created": 1599934548,
      "upvotes": 1,
      "replies": {}
    },
    "g4yifki": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4yifki/",
      "text": "The first thing I ask all professors/faculty is \"what should I call you?\" so they can be the ones to say \"call me by my first name\" or not. You never have to guess or be rude, but you have to do this first thing.",
      "author": "Individual-Schemes",
      "created": 1599935367,
      "upvotes": 1,
      "replies": {}
    },
    "g4yrvup": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4yrvup/",
      "text": "The professor is fine with graduate students using their first name or their formal title. Since they're comfortable with both, **I encourage you to do what you're comfortable with.** And keep in mind that it can **change over time.**\n\nEarly on in my PhD, I preferred the formality of referring to faculty as Dr./Prof. These people were not my colleagues or friends, but my superiors in every way. To be honest, I think maintaining that boundary, even in small ways, helped me deal with criticism better than some of my peers. Not everyone who uses first names thinks they're \"buddy-buddy\" with their advisors/committee, but some people do, and any negative feedback ends up being a sharp reminder that they're not equals.\n\n**However,** some time after coursework and exams, I switched to first names, because relationships do evolve. Progressing through the program means that you're moving closer to a symmetrical relationship. It also means they're no longer grading me (beyond assessing the dissertation defense).\n\nMy preference was somewhat related to culture and being a first-generation undergrad/grad student, but also related to *temperament*. So, do what works for your personality and don't be surprised if your preferences change.",
      "author": "synthesis-synthesis",
      "created": 1599938747,
      "upvotes": 1,
      "replies": {}
    },
    "g4yy3a3": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4yy3a3/",
      "text": "You should address him as Respected, Esteemed, Professor, Doctor!",
      "author": "Squirrel-Excellent",
      "created": 1599940912,
      "upvotes": 1,
      "replies": {}
    },
    "g4zccjv": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4zccjv/",
      "text": "Assume and use formal titles and see if they advise you to refer to them differently.",
      "author": "sci-prof_toronto",
      "created": 1599945414,
      "upvotes": 1,
      "replies": {}
    },
    "g4zyxjb": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4zyxjb/",
      "text": "I never call my mentors by their first names. Even when they tell me to. I like to have a boundary there.",
      "author": "Eab11",
      "created": 1599953061,
      "upvotes": 1,
      "replies": {}
    },
    "g50b9ps": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g50b9ps/",
      "text": "People use titles in person??! British uni here and can safely say I've never called my PI, tutor or anyone else by anything other than their first name. When writing Emails to someone I do not know or if it is formal I will use titles",
      "author": "bigsass15",
      "created": 1599957254,
      "upvotes": 1,
      "replies": {}
    },
    "g550ajt": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g550ajt/",
      "text": "Yes.",
      "author": "Tatta_Tatta",
      "created": 1600019999,
      "upvotes": 1,
      "replies": {}
    },
    "g4xwkq1": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xwkq1/",
      "text": "Dr. (First name) has worked well for me",
      "author": null,
      "created": 1599926631,
      "upvotes": 0,
      "replies": {}
    },
    "g4x88q4": {
      "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4x88q4/",
      "text": "[deleted]",
      "author": null,
      "created": 1599912661,
      "upvotes": -30,
      "replies": {
        "g4xg928": {
          "link": "/r/AskAcademia/comments/ir8i9s/should_i_call_my_grad_school_supervisor_by_their/g4xg928/",
          "text": "People come from a variety of backgrounds and cultures and surprisingly this has a huge effect on what feels natural and what is really challenging. In an academic sub with users from literally around the whole world I’d recommend learning to become a little more culturally sensitive, so people don’t berate you when you’re experiencing cultural dissonance :)",
          "author": "shifubear",
          "created": 1599918626,
          "upvotes": 7,
          "replies": {}
        }
      }
    }
  }
}