{
  "sid": "jpxzcs",
  "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/",
  "title:": "Those who've served on admissions, what makes a LOR really stand out?",
  "text": "My field is humanities. I might have to write one for myself before sending it to a professor, so trying to get some opinions. Thank you!",
  "author": "seeker_313",
  "created": 1604781998,
  "updated": 1634082348,
  "over_18": false,
  "upvotes": 95,
  "upvote_ratio": 0.98,
  "comments": {
    "gbhzt9g": {
      "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbhzt9g/",
      "text": "John Hodgman is fond of saying, \"Specificity is the soul of narrative.\" This could not possibly be more true for letters of recommendation. When I read recommendation letters, I want specific examples of what makes someone an excellent student, great collaborator, strong researcher, etc.\n\nI also want to see that the narrative in the letter generally lines up with the personal statement or cover letter written by the application. It can be a red flag if letter writer and the candidate end up contradicting each other about things like career goals.",
      "author": null,
      "created": 1604785327,
      "upvotes": 111,
      "replies": {
        "gbiwqw4": {
          "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbiwqw4/",
          "text": "YES. Concrete details. If all I read are glittering generalities, I assume they're empty. Tell me a story!",
          "author": "quietlysitting",
          "created": 1604796431,
          "upvotes": 27,
          "replies": {}
        },
        "gbjopg8": {
          "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbjopg8/",
          "text": "This is the correct answer.  Details about your interactions with the student are what I want to see.  Broad generalizations, superlatives, and fancy adjectives are not helpful. \n\nQuietlysitting's \"Tell me a story\" request is spot-on.",
          "author": "matthewsmugmanager",
          "created": 1604806193,
          "upvotes": 11,
          "replies": {
            "gbp27wu": {
              "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbp27wu/",
              "text": "Thank you, wonderful people!",
              "author": "seeker_313",
              "created": 1604902622,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gbldmsa": {
          "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbldmsa/",
          "text": "Is it really a red flag if the career goals contradict? Contradiction is a red flag in general, but I would think that it'd be more problematic if there's discrepancy between details on a project. Career goals (especially at the graduate entry level) are a little fickle, aren't they?",
          "author": "Seankala",
          "created": 1604831456,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gbhztyy": {
      "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbhztyy/",
      "text": "Oh my god I really dislike when professors have you write the letter and they approve it. I know it's a common practice but it's just so obvious and disingenuous. \n\nMy suggestion as an AO is pick someone who will spend the thirty minutes it takes to write you an actual recommendation from the heart.",
      "author": "iamsavsavage",
      "created": 1604785333,
      "upvotes": 82,
      "replies": {
        "gbijb9o": {
          "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbijb9o/",
          "text": "I saw another thread where people suggested writing a letter and sending it for approval, but its so shocking to me because that has never even been mentioned to me. Is this a field specific type thing or is it more common than that?",
          "author": "Littlefingersthroat",
          "created": 1604791824,
          "upvotes": 11,
          "replies": {
            "gbikcyk": {
              "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbikcyk/",
              "text": "Perhaps it is field specific? I work in general admissions with a focus on health care  professions.",
              "author": "iamsavsavage",
              "created": 1604792176,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "gbik8a5": {
          "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbik8a5/",
          "text": "[deleted]",
          "author": null,
          "created": 1604792131,
          "upvotes": 15,
          "replies": {
            "gbiqe4q": {
              "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbiqe4q/",
              "text": ">unt that students from abroad come from places where the professors don’t get to inte\n\nthis is so true in my university... when the classes are 200+ people there is even a queue at the end of each lecture to ask the prof. questions",
              "author": "OHelicopter",
              "created": 1604794242,
              "upvotes": 10,
              "replies": {}
            },
            "gbkfdc3": {
              "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbkfdc3/",
              "text": "Rec letters should be from people who supervised you in research, ideally, not people who just taught classes that you happened to be in.  \n\nBut having reviewed a fair amount of applications from international students I can tell you that we are well aware that the vast majority of the reference letters are worthless.  It is not uncommon to get a letter with the wrong candidate's name in it which is clearly just copy-pasted, even though the letter says things in it that are made to sound specific.  And on occasion we have gotten letters from the same professor for two different candidates that are likewise identical except for the names.",
              "author": "spinningspinning",
              "created": 1604816061,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gblqjv1": {
          "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gblqjv1/",
          "text": ">Oh my god I really dislike when professors have you write the letter and they approve it.\n\nIt is part of the recommendation to know if you accurately identify your strong points and don't  say you are \"detail orientated and responsible\" when you are not.\n\nYou should be able to come up with a specific reason, with examples that I should recommend you if you want me to do so.\n\nIt is an important part of the learning process so that you know what goes on in such applications.\n\nIt is a lot of work to write a decent letter and if you get the format and some of the details (like how long I have known you and in what capacity etc) it saves me a lot of time for the favor you want me to do.\n\nI don't know anyone who just approves a letter and sends it.",
          "author": "PersephoneIsNotHome",
          "created": 1604837716,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gbk0kt6": {
      "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbk0kt6/",
      "text": "I’m not in humanities, but admit PhD students every year in another field, so take this FWIW. I look for three things in a good applicant: curiosity, creativity, and initiative. Almost everything else can be trained. If your recommendation letters can provide evidence of any of these, they may help.",
      "author": "john1781",
      "created": 1604810301,
      "upvotes": 12,
      "replies": {}
    },
    "gbk3ptf": {
      "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gbk3ptf/",
      "text": "The best letters are holistic - they provide concrete details but those specifics mesh with how the character of the applicant embodies intellectual curiosity, and openness to new ideas and the capacity for social engagement. There are way too many folks in the professoriate in humanities that might be smart and motivated but just aren’t whole human beings. I need to see something in a letter that illustrates this candidate won’t dig into the narcissism that is graduate school. Most of the time the personal statement is what really matters, because the vast majority of LOR are so “banal.” But when I read that rare good one - it’s makes a hell of a difference.",
      "author": "DSwivler",
      "created": 1604811398,
      "upvotes": 7,
      "replies": {}
    },
    "gblpp6r": {
      "link": "/r/AskAcademia/comments/jpxzcs/those_whove_served_on_admissions_what_makes_a_lor/gblpp6r/",
      "text": "Narrative.",
      "author": "reversechinlock",
      "created": 1604837285,
      "upvotes": 2,
      "replies": {}
    }
  }
}