{
  "sid": "q645su",
  "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/",
  "title:": "Help writing letter of support for mediocre committee member's promotion",
  "text": "Hello all, I'm a fifth year PhD candidate, and one of my dissertation committee members (a co-chair) is up for promotion (assoc to full ,,(EDIT: initially incorrectly said asst)). \n\nTL;DR, they're fine, but not great. \n\n(For context: quant. social sciences, United States, high-R2 program.)\n\nI'm struggling to write an appropriate letter of support (due in 3 weeks), given the following:\n\n\\- I think they deserve the promotion (worse people have been promoted in recent years, so I think it would be unfair to deny this one faculty member, despite their faults.)\n\n\\- I'm expected by the promotion committee to submit a letter. I don't think it'll be a problem for me per se if I don't, but I think there will be questions about why I didn't submit, if I don't. I think it may be read as an implicit vote of no confidence. \n\n \\- as a co-chair, I like them fine; they are helpful and present when asked to be. But compared to the support many of my peers are getting (and, the level of support this faculty member got from their own dissertation chair many moons ago), it's very minimal. They have not, for example, been particularly helpful in helping me build a network within my field (introducing me to people at conferences, for example, including when I've directly asked for it), despite being very well connected. A minor (and maybe petty) quibble, but also the sort of thing that really matters to careers in the long term. So on this front, I have nothing terrible to say, but also nothing great to show. \n\n\\- Perhaps more importantly, two (possibly three) of my peers have had very bad experiences working with them as RAs, including: being given very large, time-consuming, technically complex tasks, with very high bars set on the quality of work expected on early drafts, then being told (after hours of work) to do something else entirely, with the faculty member seeming to have little recollection of the initial task assigned. One of these RAs has since left the PhD program, in part after very difficult experience with them (had his work berated in lab full of other students). \n\n\\- the best thing I have to say about them is that I enjoyed their classes. However, this was 3+ years ago. \n\nI want to do the right thing here, by this faculty member but also by my peers who've had a really hard time. And I don't want to be dishonest. My program seems to weight student testimonials somewhat more strongly than other programs, but at the same time this faculty member has a very strong publishing and service record so some problems with students may not matter at all. \n\nMy questions are (especially for anyone who's served on a promotion comittee):\n\n\\- should I write a brief letter of support with just the few positive things I can say about my experience with them? (\"damned by faint praise\" option)\n\n\\- should I just not write a letter? And let the committee come to whatever conclusion they want? (\"implicit lack of support\" option)?\n\n\\- Are there other options that I'm not considering?\n\nThanks for any help!",
  "author": "djlovepossum",
  "created": 1633981891,
  "updated": 1634078372,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.74,
  "comments": {
    "hg9osgm": {
      "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hg9osgm/",
      "text": "One thing I would say from reading what you've written is you need to focus on your own experience of this person and not other people's. You talk about how other people have had better experiences with their co-chairs but that's your opinion and also isn't relevant. You also talk about other people who got promoted - while it can be a helpful guage as to what the necessary standard for promotion is, again other people getting promoted isn't relevant as to whether you think this person should be promoted. Your point about the RAs is a grey area. If you haven't witnessed the behaviour that's something you can factor in, if it's something you've only been told about you need to be very cautious. \n\nYour review needs to be based on your experience of working with them and should only contain comments based your interactions with them or what you've seen first hand. If you truly feel that their other behaviour is sufficient that you can't support their promotion then you should decline to give a reference (but know that there will probably be an impact on your relationship). Do not bad mouth them in writing. If you are asked why you won't give a reference I personally would be vague unless absolutely pressed for specifics, but generally a smart Dean/Head of Dept will know not to ask a question they don't want to know the answer to.",
      "author": "ACatGod",
      "created": 1633982716,
      "upvotes": 36,
      "replies": {}
    },
    "hg9pemf": {
      "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hg9pemf/",
      "text": "Building off of the excellent advice of /u/ACatGod, you should absolutely not write about \"things you've heard from other people\" or things outside your direct experience / interactions with this person. \n\nI'd also suggest that you write your letter based off of the criteria of their job: for example, is helping students build a network something expected of a co-chair? Are other folks going above and beyond, or is this person underperforming?\n\nFrom what you write, it doesn't seem like you have any real problems with their work in the role. It doesn't seem like they're going above and beyond, but it seems like they're doing well (fine, as you say) in the role. \n\nConsider the situation reversed: would you want your committee members to not write a letter for you just because other people in your cohort or program did more, even if you did everything you needed to do competently and well?\n\nWrite a letter that contains the parts that you can honestly be positive about.\n\nNote that, depending on the school, it's possible for a faculty member to see / find out the content of letters (i.e., in a lawsuit), so don't write anything you wouldn't feel comfortable with being public.\n\nAlso, for promotion: do you mean assistant to associate? Associate is a higher rank than assistant. This would also imply that this isn't just promotion, this is promotion and tenure. Keep in mind that for this professor, not being \"promoted\" may well mean being fired (tenure is retain or fire). Some schools decouple tenure and promotion, many don't.",
      "author": "Eigengrad",
      "created": 1633982981,
      "upvotes": 24,
      "replies": {
        "hg9sbll": {
          "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hg9sbll/",
          "text": "Thanks for the advice! A few things:\n\n- one important thing I got wrong - the promotion is assoc to full. \n\nOverall, I appreciate and will take your advice on sticking to facts about my own experience. And yes, I'm very conscious of saying/doing anything that would jeopardize their career, I don't think they've done anything to deserve that.\n\n- in terms of witnessing the problematic behavior: I was i the lab on one of the times, it was mean (and mean-spirited) but very much in the grey area re: abuse. Either way, will steer clear of it. \n\n- the reason I brought up the networking this is that they promote themselves as very good at networking, to the benefit of their students. I (and others) have not found this to be the case. But again i take your point that making comparisons is not helpful.\n\nThanks again.",
          "author": "djlovepossum",
          "created": 1633984281,
          "upvotes": 6,
          "replies": {
            "hgbrbgv": {
              "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hgbrbgv/",
              "text": ">the reason I brought up the networking this is that they promote themselves as very good at networking, to the benefit of their students. I (and others) have not found this to be the case. But again i take your point that making comparisons is not helpful.\n\nMaybe you can find a way to make silence speak without being too obvious.\n\n(i.e. I'd strongly recommend not to write anything negative, but you can leave eloquent gaps in your endorsing statements.)",
              "author": "No-Heart-1454",
              "created": 1634020497,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hg9sxq5": {
          "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hg9sxq5/",
          "text": "Thank you! I responded in more detail on /u/ACatGod 's comment, but this is all very helpful re: sticking to positive things in my own experience, and writing as though it could be read by anyone (technically only committee members will be able to read letters of support, but as you say there are other ways).",
          "author": "djlovepossum",
          "created": 1633984553,
          "upvotes": 5,
          "replies": {
            "hg9uknx": {
              "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hg9uknx/",
              "text": "Yeah, the biggest way it comes up is in a lawsuit, where since these are considered evaluative, employment law ensures that the applicant would have full access to any relevant documents as part of discovery. \n\nNot common, but worth considering. \n\nFor assoc -> full, a weak letter is less of an impact, as would not writing it. So you do you. \n\nIf you witnessed abuse, it's something you can talk about: but worth being careful to be very factual in the occurrence.",
              "author": "Eigengrad",
              "created": 1633985283,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "hg9pqeg": {
          "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hg9pqeg/",
          "text": "Excellent advice.",
          "author": "ACatGod",
          "created": 1633983129,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgbzupb": {
      "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hgbzupb/",
      "text": "ymmv.\n\nEven at programs where grad student letters matter, they don't matter very much, and reading between the lines here, the promotion is a done deal. So in that position, my first question before I even put pen to paper would be, is this a worthy hill to die on?\n\nThis guy sounds like a bit of a difficult character (mostly according to testimony of other people who are not you, btw), but none of what you bring up seems abusive. There's a different moral code around people who are abusive, of course. But as it stands, it seems like you want to bring up relatively minor quibbles. And the thing is, once this letter is submitted, anyone can read it, including him. Even if he doesn't read it, a colleague is likely to tell him about it. And while some people are good at accepting criticism, others are not, and some who are good at accepting criticism do very much a 180 when the criticism in question directly affects their employment prospects. So, just think about whether being honest is worth it, and how to be honest if you decide that it is.\n\nAt maximum, I would write just about the direct experiences you've had, not the experiences of others, and word those extremely politely. The committee consists of smart people who read between the lines, and who know this professor's tendencies as well as you do.",
      "author": "thegreenaquarium",
      "created": 1634028043,
      "upvotes": 1,
      "replies": {
        "hgdzwxe": {
          "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hgdzwxe/",
          "text": "If it doesn't matter and the promotion is a done deal, then why ask for the letter?\n\nAnd I'm not really directing this question at you, more the overarching system of these things - particularly one that asks for a letter from a doctoral student but gives the professor the opportunity to read it. That's a situation that inherently asks for a student to either omit relevant information or simply not write one at all.",
          "author": "roseofjuly",
          "created": 1634065349,
          "upvotes": 2,
          "replies": {
            "hgehb9f": {
              "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hgehb9f/",
              "text": "> If it doesn't matter and the promotion is a done deal, then why ask for the letter?\n\nI mean, in my recollection, you're a public policy scholar so I'm puzzled why you're asking this question. Obviously, it's to do things by the book, adhere to protocol, and have it on file in case of CYA activities. Moreover, there's powerful people in this establishment who keep advocating for more of these bureaucratic \"safeguards\" out of a totally erroneous assumption that they improve equity or ensure that nepotism isn't happening or some shit. \n\nMore importantly, these are questions to keep in mind but not questions that are useful for grad students to ask. When you're a small fish, you have to adapt, not pick dumb fights with the system.",
              "author": "thegreenaquarium",
              "created": 1634072410,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgdwi4z": {
      "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hgdwi4z/",
      "text": "> - I think they deserve the promotion\n\nThen praise them to the skies and don't mention anything that the most critical person in the world might conceivably misconstrue as negative.\n\nThese things are like customer-service surveys where anything less than THIS WAS THE SINGLE GREATEST EXPERIENCE OF MY LIFE AND MAKES THE BIRTH OF MY FIRSTBORN SEEM LIKE GARBAGE IN COMPARISON is the same as abject and utter failure.",
      "author": "smapdiagesix",
      "created": 1634063962,
      "upvotes": 1,
      "replies": {}
    },
    "hga5kap": {
      "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hga5kap/",
      "text": "[removed]",
      "author": null,
      "created": 1633990422,
      "upvotes": -4,
      "replies": {
        "hgabx37": {
          "link": "/r/AskAcademia/comments/q645su/help_writing_letter_of_support_for_mediocre/hgabx37/",
          "text": "Wow. I thought it was pretty clear from my original post that I am very much trying to be honest about my experience while *not* messing up their career. The two options I presented were (1) writing a brief but positive letter or (2) not writing one at all.  Not sure why you felt like name calling was an appropriate response here. Peace.",
          "author": "djlovepossum",
          "created": 1633993522,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}