{
  "sid": "r4kruz",
  "link": "/r/AskAcademia/comments/r4kruz/someone_is_using_my_data_should_i_be_mad_about/",
  "title:": "Someone is using my data: should I be mad about this?",
  "text": "This isn't specifically related to something happening in an academic context, but I can't find anywhere else to post this, so: \n\nAbout two years ago, as part of my job and at the request of my boss, I did a major data analysis for my organization, which included gathering all the information, developing a data model, conducting the statistical analysis, and writing a report that summarized my findings (as one does when one is presented with a problem).  I shelved the project and started graduate school. \n\nA week or so ago, having finished my graduate degree (yay successful dissertation!), my boss mentioned that he needed to connect me to an outside researcher, who has apparently been working on a paper based on the summary report I'd written; this researcher and I met the other day, and he has asked me for several secondary analyses of the original data set, as well as commentary about what I thought the data meant from an organizational perspective. He was very open about ensuring that I was included as part of the author team going forward, but I'm a bit taken aback that things have gotten this far along without me knowing anything about it. \n\nI have never published anything. The writing I have done has either been for academic credit, or for my organization's internal use, so I am generally unaware of what's involved in the process and what the commonly accepted practices are. Had I not started grad school I probably would have tried to work this data into a paper for publication, but that didn't happen, and so at this point it's all water under the keel. I've reviewed the ICMJE rules around author credit and based on this information I absolutely qualify (although I have yet to review a manuscript or offer input into the drafting process, I am given to understand that we will be starting that soon), so that's positive. \n\nHowever the whole thing has left a bad taste in my mouth, as though someone has taken my work and decided to appropriate it for their own ends; I feel like I should have been consulted, and brought into this project, much earlier. (It's entirely possible my boss was sparing me the burden of trying to work on this while finishing my dissertation, so there may be altruistic motives behind this decision.)   \nShould I be mad about this scenario? What do you even say (to my boss or to this researcher)? Do I just need to have an Uncomfortable Conversation and see where it leads, or should I just get over this? \n\nThanks in advance for the commentary.",
  "author": "UnhappyAnalyst21",
  "created": 1638151936,
  "updated": 1638206283,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.38,
  "comments": {
    "hmhc3qn": {
      "link": "/r/AskAcademia/comments/r4kruz/someone_is_using_my_data_should_i_be_mad_about/hmhc3qn/",
      "text": "They should have included you earlier but then again what is done is done. It is good though that they still want to include you albeit at the later stage. You will still be credited for the work through authorship.\n\nI think you should just go with it. Maintain a good relationship with them.\n\nI have heard worse stories where PI just uses his/her former grad students data for publication without credit / authorship at all.",
      "author": "MarkZelVitch",
      "created": 1638152685,
      "upvotes": 6,
      "replies": {}
    },
    "hmis5p1": {
      "link": "/r/AskAcademia/comments/r4kruz/someone_is_using_my_data_should_i_be_mad_about/hmis5p1/",
      "text": "> as part of my job and at the request of my boss\n\nYou were a paid employee and your boss - who owns your work - has extended this collaboration to an external person and is including you as a co-author on that further work.  That all seems perfectly reasonable.  As employees, we don't get to decide what our bosses do with the work they paid for.  \n\nIf you want to, you can express that you would have like to be involved earlier.  However, as you suggested, it would have been a bit strange for your supervisor to ask you to take time away from your own thesis to do unpaid work relating to a position that you had already left.",
      "author": "polyphonal",
      "created": 1638186468,
      "upvotes": 4,
      "replies": {}
    },
    "hmhd54d": {
      "link": "/r/AskAcademia/comments/r4kruz/someone_is_using_my_data_should_i_be_mad_about/hmhd54d/",
      "text": "My read is that you've already published this data and analysis (as part of a report for your organization), and this person is writing a follow up to that. \n\nI think it's great they're consulting you, but IMO this outside researcher is writing a follow-up to your already existing study using your \"published\" data set. \n\nI think there's a question of how they gained access to your report, but lots of industry reports are available through various different means. \n\nSince this was part of \"a job\", it also wouldn't be unethical for your employer to have given access to your \"published\" final report or the data set you gathered. \n\nIMO, ethically, all the outside researcher would need to do is cite your report, and then they'd freely be able to build off of it, just like any other published data set.",
      "author": "Eigengrad",
      "created": 1638153164,
      "upvotes": 5,
      "replies": {}
    },
    "hmilypr": {
      "link": "/r/AskAcademia/comments/r4kruz/someone_is_using_my_data_should_i_be_mad_about/hmilypr/",
      "text": "They should have asked you at the beginning of this plan. They didn’t. That is common but yeah - not very charming. The cynic in me thinks it’s great they put you up as an author.. but it’s fucked up, you are right. Nothing much to do about it without hurting your prospects I am afraid..",
      "author": "meanmissusmustard86",
      "created": 1638181494,
      "upvotes": -2,
      "replies": {}
    }
  }
}