{
  "sid": "oyenct",
  "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/",
  "title:": "Resources for Finding job Prospects with certain PhDs",
  "text": "Hello! \n\nI am interested in pursuing a PhD related to climate change and urban development. One seemingly age old question is what the job prospects are after pursuing a PhD - that one should not assume just because they have a PhD, their job prospects are better. \n\nAdditionally, I am not necessarily interested in staying in academia after obtaining a PhD. I would like to put my gained knowledge into practice in some other area, such as the private sector, NGOs, etc. \n\nI am wondering if anyone has recommended resources for learning more about job prospects given a specific PhD? I think this would be useful to any person currently thinking of pursuing a PhD program.\n\nThank you for your help!",
  "author": "Tired_Academic_",
  "created": 1628158764,
  "updated": 1634080002,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.84,
  "comments": {
    "h7stzfv": {
      "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7stzfv/",
      "text": "> \nI am wondering if anyone has recommended resources for learning more about job prospects given a specific PhD? \n\nWith few exceptions, the only way to really find out is to talk to people who hold the degree you want or have been in the process of getting it for a while. Unfortunately there is not much transparency in PhD career prospects.\n\n\"climate change and urban development\" could fall under like 10 different disciplines, but generally, if you are getting a public policy PhD or something like it, I strongly recommend getting work experience in policy before attempting the degree. This degree has a narrow area of application, so it's important to be sure of what you're getting into so that you don't get disillusioned and end up wasting all this time and money you spent on this education. It's also useful to understand whether the PhD is necessary or indeed helpful for your desired career trajectory (e.g. a PhD is overkill for 99% of jobs at NGOs). I do know people who did a K-PhD policy track and got work experience while in the program, but quite a few of them now realize that they hate the field but are struggling to leave.",
      "author": "thegreenaquarium",
      "created": 1628168597,
      "upvotes": 11,
      "replies": {
        "h7t1e4h": {
          "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7t1e4h/",
          "text": "THIS. If you are into sustainable urbanism you don't necessarily need a phd, maybe a Master with an applied focus could be of more interest for your career goal? I don't know what is the angle you are into but I'm thinking you could check out geography, urbanism and public management departments and see the projects going on in the labs and research centers there. \n\nA good way it to get information on the market jobs is to go on websites of organizations of people doing what you'd like to do the \"Team\" section that often includes the degrees or certifications people have so that could help. Ideally it would be to talk to people in this field, both at university and on the market to know what a PhD could give you/ limit you for your career goals. If you are more daring and dont personally know people in this field you can try to email some people in this field on their professional email and simply...ask! Some may not answer but some may happily help!\n\nNote that yes a PhD can be used on the market for sure but maybe it's not necessary and doing one will cost you time, money and energy that could be channelled into something that gets you closer to your goals faster.",
          "author": "579red",
          "created": 1628172137,
          "upvotes": 8,
          "replies": {
            "h7t1w77": {
              "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7t1w77/",
              "text": "Thank you for this insight! I have looked a bit at places I would be interested in working to see what types of backgrounds these people have and this I have found to be useful too.  Need to spend a bit more time looking into this",
              "author": "Tired_Academic_",
              "created": 1628172351,
              "upvotes": 1,
              "replies": {}
            },
            "h7t2116": {
              "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7t2116/",
              "text": "Thank you for this insight! I have looked a bit at places I would be interested in working to see what types of backgrounds these people have and this I have found to be useful too.  Need to spend a bit more time looking into this",
              "author": "Tired_Academic_",
              "created": 1628172381,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h7swko4": {
          "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7swko4/",
          "text": "Thank you for your reply on this! I think I can bring my thoughts on this more clearly to two points: \n\n1. I want to gain more expert and precise knowledge on climate change adaption/resilience for cities \n2. I don't want to work only in academia. I get the feeling sometimes that a lot of people go into academia and end up doing research on a wide variety of topics but don't have a lot of experience in implementing in the real world. Essentially I want to take my knowledge and apply it in the real world, whether that is in NGOs, policy, or private sector/consulting. \n\nIs this a good fit for someone thinking of getting a PhD? I am generally a very curious person, love to learn new things, passionate about climate change, not super interested in how much money I will be making, and I don't care about the prestige. \n\nI just want to become more of an expert in this field and I want to actually apply this knowledge on real tangible projects, rather than just researching in academia.",
          "author": "Tired_Academic_",
          "created": 1628169874,
          "upvotes": 2,
          "replies": {
            "h7u2twh": {
              "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7u2twh/",
              "text": "> I want to gain more expert and precise knowledge on climate change adaption/resilience for cities\n\nIs there a reason you can't gain this through a master's, work experience, life experience, self-study..?\n\n> Essentially I want to take my knowledge and apply it in the real world, whether that is in NGOs, policy, or private sector/consulting.\n\nMost people working in all of these places do not have PhDs. Can you articulate a reason why you need to be the exception to that?\n\nLook, *I* can't tell you whether to get a PhD or not. Even though I have some contact with the area of urbanistics and climate change, I can't say whether the PhD would be beneficial without knowing a lot more specifics about your career goals and background. For some career goals, a PhD would be to your detriment. Personally, I would not get a PhD unless I could believably explain why I needed one to do what I want to do. If you want to work in policy, my advice is, get a job or at least an internship in policy right now. There are many jobs for bachelor's and master's degree holders at various types of organizations in your policy area of interest. Get one of those jobs and take the time to understand how the field works, how different types of career progression work, and develop a network of professional contacts. In 1-2 years of this, you will have much more clarity on whether you need a PhD and, if so, what that PhD should be in.",
              "author": "thegreenaquarium",
              "created": 1628186383,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "h7tqdux": {
      "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7tqdux/",
      "text": " You absolutely don't need a PhD to do the kinds of jobs you are thinking of, assuming you want to do something in climate change/urban development. However, lots of orgs like NGOs, funders, foundations, government, intergovernmental orgs, and specialist research institutes (in roles like public engagement or policy) are very used to PhDs and while they would almost never make it a requirement they do like them for certain roles or at the very least don't see you as over qualified and will view your PhD as work experience (handy for negotiating salary and going for jobs one up from graduate scheme/entry level). In addition, in roles where you will be working with experts a PhD can help smooth the path - it helps that you understand academic culture, that you're able to assess evidence, reassures the experts you're working with that what they say won't get lost in translation and so on. \n\nFor companies outside tech and pharma a PhD can be more of an issue - people aren't familiar with them, they think you're over qualified, they're often mystified as to why you're applying for the job, they think you're going to leave etc. So if you want to work outside the field of your PhD, and by outside I mean completely unrelated, not something like Sci Comm or scientific editor, a PhD can be an issue. \n\nI won't say what job I do, but suffice to say I have counterparts in across the public, charitable and academic sector and probably 2/3rds of us have PhDs. It definitely hasn't been a hindrance.",
      "author": "ACatGod",
      "created": 1628181291,
      "upvotes": 6,
      "replies": {}
    },
    "h7tduoo": {
      "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7tduoo/",
      "text": "I am in a program that has quite a few students studying that topic and most they either go into NGOs or government. One friend is in film and she wants to write a non-academic/coffee table book after the PhD. I do know of some architecture/construction firms popping up in the area that focus on sustainable design, but not sure if they would be willing to pay a higher salary for an employee without direct architecture experience",
      "author": "hellokoalaa",
      "created": 1628176049,
      "upvotes": 2,
      "replies": {}
    },
    "h7u6cww": {
      "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7u6cww/",
      "text": "\\>I would like to put my gained knowledge into practice in some other area, such as the private sector, NGOs,\n\nOk but doing what?",
      "author": "yourmomdotbiz",
      "created": 1628187802,
      "upvotes": 2,
      "replies": {}
    },
    "h7uo6kj": {
      "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7uo6kj/",
      "text": "/u/thegreenaquarium's comment further down thread is exactly right. A PhD doesn't sound like the right fit at all for the goals you have. If anything, a PhD would be a disadvantage here.\n\n**The fact that you're not at all clear on what specific PhD programs and what specific kinds of research topics/questions you would pursue is an extremely strong indicator that** ***you are looking for breadth, not narrow depth.*** A degree in meteorology is worlds away from one in urban studies & planning, which in turn is worlds away from one in public policy. We ask different research questions, use different methodologies, work towards different outcomes, etc.\n\nBreadth is great (but it's not what a PhD is for). A good Master's program would give you a strong foundation in whatever field you eventually choose. *The expertise you want to cultivate should come through actual work--through successes and failures--on the ground.*\n\nIn general, people who don't plan to pursue academia as their absolute first choice career above all else shouldn't waste time doing a PhD. Unless you're independently wealthy, 5-7 years of having such a low stipend, being unable to contribute to savings or retirement, and losing out on work experiences in the relevant area become a significant obstacle. And, of course, in most fields, getting a tenure-track position is near impossible. Don't forget: **it's easy for a PhD to be over-degreed but under-qualified.** Good luck.",
      "author": "synthesis-synthesis",
      "created": 1628195073,
      "upvotes": 2,
      "replies": {}
    },
    "h7sk5lb": {
      "link": "/r/AskAcademia/comments/oyenct/resources_for_finding_job_prospects_with_certain/h7sk5lb/",
      "text": "RemindMe! 48 hrs",
      "author": "Feisty_Boss9444",
      "created": 1628162854,
      "upvotes": 0,
      "replies": {}
    }
  }
}