{
  "sid": "qxe34i",
  "link": "/r/AskAcademia/comments/qxe34i/academia_vs_corporate/",
  "title:": "Academia vs Corporate",
  "text": "If you could pick again would you choose going for a doctorate or pursuing a corporate career? Please share your field as well and if you would like, the reasons for your choice. \n\nI am in Marketing and have an offer to continue in my job or start working as a research associate at a University. This would mean a paycut and I am wondering if it would pay off in the long run.\n\nP.S. - I am asking only because I love both and am passionate about my work AND my research. Which is why it is hard to choose.",
  "author": "basicbrownbitch",
  "created": 1637320530,
  "updated": 1637382358,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hl8v1jn": {
      "link": "/r/AskAcademia/comments/qxe34i/academia_vs_corporate/hl8v1jn/",
      "text": "I would say it depends on your goals. Unless you have a PhD it's very difficult to get promoted in academia outside of administrative positions. Some labs may hire lab techs and the like but that's a very small number if jobs with no/little promotion track. \n\nIn my field at least (environmental science/engineering), private sector jobs are by far better paying than any possible academic career, especially if you can code/do data analysis. For example, my wife, in a similar field, earns about 50% more than what a tenure track assistant professor at the better paying public R1s make and received bonuses and other benefits (both starting salaries).\n\nThat said, I chose to stay in academia after some agonizing consideration. My personal values and end goals are most aligned with this path, with public sector being a close second. Kinda chose to split the difference in the end and did a postdoc-like fellowship with the US federal government to learn new skills/expose myself to policy side. Much better paying than a postdoc and not ultra tied to an academic career path (the faculty job market is not great)",
      "author": "Prukutu",
      "created": 1637323875,
      "upvotes": 5,
      "replies": {}
    },
    "hl8zbot": {
      "link": "/r/AskAcademia/comments/qxe34i/academia_vs_corporate/hl8zbot/",
      "text": "I worked in marketing before beginning an unrelated PhD. I derive a lot more satisfaction from academic work and I don't regret it for a second, even if I had to take a pay cut for a while. I also figure I can go back to the former if I need to. \n\nIf you're equally satisfied by both that makes the decision harder. In that case I'd assess the pros and cons beyond the actual work itself: work/life balance, location, opportunities for travel, colleagues and working environment, where you could get to in ten years, etc. If one comes out on top, choose it. Academia is a lot more competitive and unstable, so if you don't love it a lot more than your corporate job I'd think twice about going all in on it.",
      "author": "PsychologicalScars",
      "created": 1637326465,
      "upvotes": 2,
      "replies": {}
    },
    "hl8tke2": {
      "link": "/r/AskAcademia/comments/qxe34i/academia_vs_corporate/hl8tke2/",
      "text": "You can do both. I'm doing both.\n\nI have 3 ongoing research projects and I have a startup that uses research work to produce products. Most of my work in the startup is related to finances and marketing because R&D always lags behind due to limited finances but yeah, you can do both.",
      "author": "Brightboi2000",
      "created": 1637322912,
      "upvotes": 4,
      "replies": {}
    },
    "hl9a18k": {
      "link": "/r/AskAcademia/comments/qxe34i/academia_vs_corporate/hl9a18k/",
      "text": "Nobody tells me what to do.  Other than teaching I make my own hours.  Nobody tells me I have to wear certain clothes.  I'm currently on a sabbatical.  Yeah, I'll take my academic job...",
      "author": "dbrodbeck",
      "created": 1637331876,
      "upvotes": 1,
      "replies": {
        "hlbu3je": {
          "link": "/r/AskAcademia/comments/qxe34i/academia_vs_corporate/hlbu3je/",
          "text": "Those things are certainly not exclusive to academic jobs.",
          "author": "roseofjuly",
          "created": 1637368819,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlbv7fv": {
      "link": "/r/AskAcademia/comments/qxe34i/academia_vs_corporate/hlbv7fv/",
      "text": "I have never been able to answer this question.\n\nI have a PhD and I work in industry (UX research at a tech company). My team is primarily made up of PhDs, so it's unlikely I would've gotten my current role if I didn't have a PhD. I love my job and my team, and I am well-compensated for my work. Furthermore, while I didn't always enjoy the process of getting my PhD, I am grateful for having had opportunity to spend six years studying exactly what I wanted, answering questions I was curious about, and learning the technical research and analysis skills I learned in graduate school (as well as all the soft skills I picked up as well).\n\nThat said, I'm positive I could've found a job I liked equally as much had I gone straight to work after college. I probably wouldn't make as much, but likely I would've made a middle-class salary and lived a relatively comfortable life. I would have six more years of professional experience, of savings, of retirement earnings. Chasing the academic career was an anxiety-provoking process that I wish I had never started. Getting the PhD was also a grueling and emotionally difficult process, and I sometimes wonder how my mental health would be different had I not. I certainly would've had more fun in my early-to-mid 20s.\n\n\\*\n\nIt's impossible to predict how you will feel in the future, and a lot of that will depend on what you end up doing later. (For example, my chances of regretting the PhD would be higher, likely, had I ended up doing something that didn't essentially require it or in which most of my colleagues didn't have one.) The best each one of us can do is make a decision that seems like the best choice now, based on the information we currently have.\n\nBeing a research associate would only pay off in the long run if you 1) want to get a research degree (although not necessarily just a PhD) OR 2) are interested in a research career, like market research. Are you? In the case of #2, if you are interested in market research, there are likely well-paying roles in industry that you could get that would give you research experience but not be patterned after academic research, and also likely would pay you more.",
      "author": "roseofjuly",
      "created": 1637369318,
      "upvotes": 1,
      "replies": {}
    }
  }
}