{
  "sid": "8qnode",
  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/",
  "title:": "Why didn't you hire them?",
  "text": "Reading some of the stories on here from people who didn't get picked up this round, I thought it may be useful to have a thread of stories about why we didn't hire certain candidates. If nothing else, it may help a few people some perspective on the hiring committee and their decisions.\n\nEdit: some great responses here and good insight from various institutions and disciplines. ",
  "author": null,
  "created": 1528845881,
  "updated": 1634080584,
  "over_18": false,
  "upvotes": 241,
  "upvote_ratio": 0.98,
  "comments": {
    "e0kt17m": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kt17m/",
      "text": "One guy we I interviewed failed the lunch test—never had that happen before. The waitress made a minor mistake on his order and he blew up, demanding that the make it right. This was a very good restaurant and they of course were going to make it right. Then as I was planning to pay the check, he said can I have some more? Of course we said yes, and they got him a second entree. When we returned to the school I found out that he had been rude to the secretaries. We don’t need someone that lacks common social graces.",
      "author": "beaubaez",
      "created": 1528853804,
      "upvotes": 271,
      "replies": {
        "e0l3ihr": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l3ihr/",
          "text": "My department didn't hire someone who was rude to office staff. If you treat people badly who you think are beneath you, you're not going to be easy to work with.",
          "author": "hillary511",
          "created": 1528866197,
          "upvotes": 72,
          "replies": {
            "e0l5doc": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l5doc/",
              "text": "As I was leaving my PhD lab, the new grad student treated our tech like shit and that was the beginning of the end for her. I mean, it went much farther and deeper than just that, but it speaks to \"not easy to work with.\" \n\nAlso, who is mean to the office staff? That seems like shooting yourself in the foot. ",
              "author": "alexa-488",
              "created": 1528869072,
              "upvotes": 50,
              "replies": {
                "e0lbnxv": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lbnxv/",
                  "text": "Rule 1 whenever I've started a new job is go and make friends with the office staff. Everything becomes so much easier :)",
                  "author": "OrbitalPete",
                  "created": 1528881461,
                  "upvotes": 32,
                  "replies": {
                    "e0lxpsz": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lxpsz/",
                      "text": "Right? Every time I have a question or need something, the office staff have been so helpful and quick to get back to me. Makes everything so much easier!",
                      "author": "alexa-488",
                      "created": 1528907649,
                      "upvotes": 10,
                      "replies": {}
                    }
                  }
                },
                "e0lx1f5": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lx1f5/",
                  "text": "I dunno man he was vegan and yelled at them the vegan options weren't good enough or something? I live in a place with a lot of vegan options, so probably not true.",
                  "author": "hillary511",
                  "created": 1528907084,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            }
          }
        },
        "e0l66ju": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l66ju/",
          "text": "In all jobs, treat the admin/secretaries well! They do so much, and can make your life heaven/hell. ",
          "author": "tpm319",
          "created": 1528870437,
          "upvotes": 20,
          "replies": {}
        },
        "e0m6ggt": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m6ggt/",
          "text": ">When we returned to the school I found out that he had been rude to the secretaries. \n\nDeath knell there. Every single interaction with our support staff is a test...if they are rude/dismissive to anyone their candidacy is likely sunk. The last thing we need is some self\\-absorbed asshole colleague who antagonizes the people that make the place run smoothly.",
          "author": "SnowblindAlbino",
          "created": 1528914955,
          "upvotes": 13,
          "replies": {}
        },
        "e0kt4j6": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kt4j6/",
          "text": "Yikes. I felt that the cussing lady blew the lunch test too. ",
          "author": null,
          "created": 1528853900,
          "upvotes": 16,
          "replies": {}
        },
        "e0l3vpj": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l3vpj/",
          "text": "Can I get an interview? I can do way better than that.",
          "author": "airwalker12",
          "created": 1528866738,
          "upvotes": 13,
          "replies": {}
        },
        "e0lt54q": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lt54q/",
          "text": "The ironic part about this is that many of our students lack these \"social graces\" and most schools don't see it as enough of a priority to teach them when discussing career skills.",
          "author": "ZenGuruji",
          "created": 1528903762,
          "upvotes": 11,
          "replies": {
            "e0ltcqp": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ltcqp/",
              "text": "One school I taught at created a non-credit required etiquette class, teaching students things like table manners and how not to look at your phone during an interview.",
              "author": "beaubaez",
              "created": 1528903944,
              "upvotes": 8,
              "replies": {
                "e0n0zc0": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0n0zc0/",
                  "text": "My school had an (optional) formal dinner, where we were supposed to dress nicely and learn etiquette.  The president of the school made a special trip to our campus to preside over the gathering.   ",
                  "author": "NighthawkFoo",
                  "created": 1528943943,
                  "upvotes": 12,
                  "replies": {
                    "e0ovnfq": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ovnfq/",
                      "text": "High Point?",
                      "author": null,
                      "created": 1529022077,
                      "upvotes": 1,
                      "replies": {
                        "e0p0snp": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0p0snp/",
                          "text": "I don't understand.",
                          "author": "NighthawkFoo",
                          "created": 1529027801,
                          "upvotes": 1,
                          "replies": {
                            "e0p17hk": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0p17hk/",
                              "text": "They do this at High Point University. I was wondering if you go there. ",
                              "author": null,
                              "created": 1529028267,
                              "upvotes": 1,
                              "replies": {
                                "e0p3qq4": {
                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0p3qq4/",
                                  "text": "Nope, sorry. ",
                                  "author": "NighthawkFoo",
                                  "created": 1529031216,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "e0n3534": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0n3534/",
                  "text": "At my undergrad I recall a few acquaintances mentioning their frat/sorority had formal dining nights to help teach these skills. ",
                  "author": "alexa-488",
                  "created": 1528946342,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e0l4edf": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l4edf/",
      "text": "The candidate requested a spousal hire. Both the candidate and spouse were in the same field and did research on essentially the same thing; it would have meant appointing them both to our department. Imagine being in a Zoology Department and being asked to hire two people who study the wing structure of the Peruvian pelican (not the case, just an example!). \n\nWe didn’t want to hire two people who studied exactly the same thing and there was also the problem that the spouse had an unimpressive CV and wouldn’t have even made our long list. Sounds like an easy pass, you might think, but we were having a hard time as the candidate was really, really good (a superstar in her field) and we really, really wanted her. \n\nSo, we ended up offering the spouse a 3 year guaranteed adjunct position. They turned this down, saying they would only accept a TT position for the spouse and emphasized that he had a job offer from a very prestigious university (in another country) and that we would be lucky to hire them both.  Having quite a few friends in that other university, I asked about the supposed job offer and discovered it didn’t exist. That was the final straw - we ended negotiations and rescinded the offer. Even if you’re a superstar candidate, pull a stunt like that and you’ll be shown the door pretty quickly. \n\nEdit- typo",
      "author": "TheHandofDoge",
      "created": 1528867512,
      "upvotes": 153,
      "replies": {
        "e0l5vs1": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l5vs1/",
          "text": "Well, it took some pretty hefty gonads to try and pull that one. I guess I'll give them credit for trying, but good grief was that in poor form.\n\nI wonder where they are now? Have you googled them?",
          "author": null,
          "created": 1528869926,
          "upvotes": 38,
          "replies": {
            "e0la308": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0la308/",
              "text": "The candidate was already in a TT position when she applied. She’s still there. The spouse is listed as being at the same institution (but not same department) as the candidate, but only as a “research associate” in a quasi-academic unit geared more to dealing with the general public. ",
              "author": "TheHandofDoge",
              "created": 1528877900,
              "upvotes": 29,
              "replies": {
                "e0li7yc": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0li7yc/",
                  "text": "I'm glad that she's doing OK. Can't be easy have a dead weight husband wanting her to lift up his career like that. Also good on you for not putting up with the lies.",
                  "author": "phage10",
                  "created": 1528892946,
                  "upvotes": 26,
                  "replies": {
                    "e0ms8fa": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ms8fa/",
                      "text": "They said spouse, not husband...",
                      "author": "rvaducks",
                      "created": 1528934548,
                      "upvotes": -4,
                      "replies": {
                        "e0p9g2a": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0p9g2a/",
                          "text": "Actually was a female/male couple with the male as the potential spousal hire, and he was her husband. But true, assumptions shouldn’t be made (though I did refer to the spouse as “he”. ",
                          "author": "TheHandofDoge",
                          "created": 1529038464,
                          "upvotes": 16,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e0kmi0s": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kmi0s/",
      "text": "Kicking off what will hopefully be a useful thread, these are some of the stories over the years about candidates who didn't get the job, and the reason why. We are a chemistry department at a large regional public university.\n\n* Lack of enthusiasm. We watched two candidates stand and look bored the entire time they gave a mock lecture. The content was fine, but it was painful to watch someone not move at all when giving a talk (and they had no disability that would prevent it as they walked around campus fine). If we were bored, how would students feel? I will point out that these individuals were both in excess of 400 pounds, but their lack of energy definitely turned us off.\n\n* Bad reference. A candidate rubbed someone the wrong way in the past, and asked them to be a reference. The reference looked good on the surface, but as soon as we asked them if they worked well with others, they said no. He was our first pick until then.\n\n* Lack of knowledge. I recently watched a mock general chemistry lecture full of wrong information. Everyone was shocked that someone with a PhD would know so little about very simple chemistry. Not only were there errors on the board (could happen from nerves) but also on the PowerPoint they prepared.\n\n* Lack of professionalism. I have watched a candidate brag about not using a briefcase/computer bag in lieu of their old ratty backpack from undergrad. This is what they brought to their interview. And then she proceeded to cuss her way through all her meetings. And she wasn't even dressed appropriately to tour the labs. \n\n* Not the right one. There was simply a better person that would fit our research needs better. This person was absolutely great, and we would have been happy with the hire, but we had a slightly better candidate that was first pick for research reasons. Had our first pick turned us down, they would have been offered the position.\n\n* Personality issue. We have a very large at-risk student population, and they are always in need of a little extra help. If you come off as someone that will be unapproachable, or someone that the students would be unwilling to seek help from, that's going to kick you out of our pool.\n\n* Mediocre job teaching. If you know your stuff, that doesn't mean you can teach it. We've seen several people who are able to hold a great conversation with other chemists, but were unable to communicate that knowledge at the front of the room. \n\n* They obviously don't want to be there. If you do nothing but talk 100% about how great your current institution is, don't interview with us. We aren't them.\n\nIf you notice, in our department we have never not given someone a job for research reasons. That would likely be different in more research-based programs, but my guess is that would all be weeded through before an actual site visit. If you are on the campus interviewing, you have a great shot at the job. \n\nWe've had candidates turn us down for about as many reasons as I have above. Even had one once turn down a gig in a sister department because we didn't have enough bike trails in town. Our cost of living is very low, we've been turned down for that. We've lost a few good ones because of pay. \n\nHope this info is at least moderately interesting to those of you on the market. ",
      "author": null,
      "created": 1528846916,
      "upvotes": 160,
      "replies": {
        "e0lpc1b": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lpc1b/",
          "text": ">•Lack of professionalism. I have watched a candidate brag about not using a briefcase/computer bag in lieu of their old ratty backpack from undergrad. This is what they brought to their interview.\n\nIs that really a thing in universities? It's 2018!! Even people older than 50 now use backpacks and not briefcases/computer bags! I don't even own a computer bag!",
          "author": "lucaxx85",
          "created": 1528900417,
          "upvotes": 31,
          "replies": {
            "e0lycf1": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lycf1/",
              "text": "I think the issue is the \"ratty old\" descriptor of the backpack? There are some very nice and professional backpacks. Don't wear ratty clothes, or use ratty old bags to carry your stuff. Also, it's a strange thing to brag about lol\n",
              "author": "alexa-488",
              "created": 1528908175,
              "upvotes": 19,
              "replies": {}
            },
            "e0lyu8v": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lyu8v/",
              "text": "Attire conventions depend (as you know) on field. In business and finance disciplines, a lot of departments still require their faculty to show up in suits and ties - and to teach, not just to interview.",
              "author": "riggorous",
              "created": 1528908588,
              "upvotes": 7,
              "replies": {
                "e0m7khr": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m7khr/",
                  "text": ">In business and finance disciplines, a lot of departments still require their faculty to show up in suits and ties \\- and to teach, not just to interview.\n\nAbsolutely\\-\\- you can pick out faculty on our campus based on their daily \"uniforms.\" The biologists are in jeans and flannel, the business school faculty are in suits every day. The political scientists are usually in chinos but wear suits any time an elected official is expected on campus.  Meanwhile, we historians are the only ones still wearing tweed jackets with leather elbow patches.\n\nBut even the biologists dress professionally for job interviews.",
                  "author": "SnowblindAlbino",
                  "created": 1528915884,
                  "upvotes": 18,
                  "replies": {
                    "e0n23nz": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0n23nz/",
                      "text": "Colorful scarves on all-black outfits tend to indicate anthropology or art history.",
                      "author": "SnittingNexttoBorpo",
                      "created": 1528945175,
                      "upvotes": 23,
                      "replies": {
                        "e0nguqc": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nguqc/",
                          "text": "Don't forget jewelry from your field site and/or wooden jewelry in general.  There's always a preponderance of corduroy and colorful tights at winter anthropology conferences.",
                          "author": "acaciopea",
                          "created": 1528969430,
                          "upvotes": 9,
                          "replies": {
                            "e0p1luf": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0p1luf/",
                              "text": "Found the anthropologist.  I've actually heard people discussed negatively for \"being too formal\" at job interviews.  A tattered backpack wouldn't have caused us to bat an eye in my department.",
                              "author": "DocGlabella",
                              "created": 1529028735,
                              "upvotes": 7,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "e0p5xd9": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0p5xd9/",
                      "text": "Ha, I'll confuse them then - I cycle through the spectrum, from full suit and tie to ripped jeans and band shirt",
                      "author": "Solivaga",
                      "created": 1529033801,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "e0m0cnp": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m0cnp/",
                  "text": "Interesting. My father (in his 60s) works as a sales expert for a huge company that deals directly with other big businesses. And he doesn't use ties anymore and he switched to the backpack like a years ago",
                  "author": "lucaxx85",
                  "created": 1528909858,
                  "upvotes": 1,
                  "replies": {
                    "e0mifyg": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mifyg/",
                      "text": "tell your dad i said hello, but wtf am i supposed to do with this information?",
                      "author": "riggorous",
                      "created": 1528925085,
                      "upvotes": 9,
                      "replies": {
                        "e0my60e": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0my60e/",
                          "text": "Build a canoe ",
                          "author": "ImScaredofCats",
                          "created": 1528940875,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "e0m3nwk": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m3nwk/",
              "text": "The backpack is fine. The fact is was disgusting and falling apart was not.",
              "author": null,
              "created": 1528912617,
              "upvotes": 13,
              "replies": {
                "e0opcfa": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0opcfa/",
                  "text": "that is stupid. what relationship do you think there is between preferences for using old shit and being a good academic? \n\nall that was really communicated by that is that they don't respect that particular social norm. \n\ngod forbid someone prefers to reuse something rather than buy new shit to avoid ruffling your delicate feathers.",
                  "author": null,
                  "created": 1529015371,
                  "upvotes": 16,
                  "replies": {
                    "e0oqfbu": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0oqfbu/",
                      "text": "You may disagree with it, but social conventions are important. You also should wear nice clothing to an interview. You can absolutely abandon that convention and wear the cheap, poorly fitted suit you bought as a freshman for a funeral with white athletic socks, but people will look at you unfavorably for it and it may cost you the job. In the case with that applicant, she was a hot mess all around, and that was icing on the no cake.",
                      "author": null,
                      "created": 1529016441,
                      "upvotes": 13,
                      "replies": {
                        "e0oqjdw": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0oqjdw/",
                          "text": "they are important because we make them important. i'm not arguing with the fact that they exist and that we (you in this case) enforce them. but in many cases they are counterproductive to our ostensible goals. i think that this is a stupid one. ",
                          "author": null,
                          "created": 1529016554,
                          "upvotes": 9,
                          "replies": {
                            "e0orfvu": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0orfvu/",
                              "text": "Well, again, it's not like this issue is what kept her from getting the job, but it was something that rubbed a lot of people the wrong way when she was bragging about using a falling apart bag that she had been using for a literal decade. \n\nIf you want a job, you need to make sure you present yourself as clean and put together in all respects. Your appearance should never stand out in a negative way. It's part of making a good first impression. My coat is covered in dog hair and I'm full of far more piercings than the average human, but I take a lint roller to my coat before an interview and remove my piercings.",
                              "author": null,
                              "created": 1529017483,
                              "upvotes": 11,
                              "replies": {
                                "e0oriy2": {
                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0oriy2/",
                                  "text": "i get what social conventions are. i'm just saying, when you are in the position to enforce them, think about whether they actually matter for what you are trying to achieve.\n\ni've had tt interviews (postdoc now) and i know how to play the game. the game is often quite stupid though.",
                                  "author": null,
                                  "created": 1529017576,
                                  "upvotes": 6,
                                  "replies": {
                                    "e0pt5s7": {
                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0pt5s7/",
                                      "text": "> the game is often quite stupid though\n\nOh, wait until you have to play \"get tenure\" game.  New levels of stupidity and conformity that make just getting a job look like child's play.  I understand you want to change the system, but that takes a lot of time (and energy).  I'd like to think I am contributing to that change, but it's a drop in the ocean.",
                                      "author": "the_Stick",
                                      "created": 1529070941,
                                      "upvotes": 7,
                                      "replies": {}
                                    },
                                    "e0os0rf": {
                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0os0rf/",
                                      "text": "I wouldn't disagree that it is trivial and stupid, but it is the way things are fine, so we still need to do them. Many years ago women couldn't wear pants to an interview and as it normalized, it became okay in interviewing. \n\nThe truth is, people that hire you are looking at a possible colleague for life, and you want to make sure they know how to be a good face to the department to outsiders. We literally ask, \"could we see ourselves working with this person for 30 years?\" When we interview them. How will they get by as positive representatives of the department if they look like they can't put themselves together?",
                                      "author": null,
                                      "created": 1529018103,
                                      "upvotes": 4,
                                      "replies": {
                                        "e0osaf7": {
                                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0osaf7/",
                                          "text": "no we don't need to do them. these are social constructs. we can change them whenever it suits us, just like the pants thing. there isn't anything particularly useful about suits, other than demonstrating that you \"play by the rules\" or are smart enough to know that people think of these rules as handed-down-from-on-high. the pants thing for women is ok because some people decided to not select against women who wore pants. and i'm sure some good women lost out because they decided to wear pants.\n\nso if you want good people you shouldn't pay attention to shit that doesn't strictly speaking matter. this is academia after all. i thought we were cool with \"different.\" apparently not so much eh? i gotta say that i was pretty disappointed when i really learned that this is the case. \n\nidk about you but i can see myself working with someone who \"can't put him/herself together\" in the sense you describe. ",
                                          "author": null,
                                          "created": 1529018389,
                                          "upvotes": 6,
                                          "replies": {
                                            "e0osnke": {
                                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0osnke/",
                                              "text": "Working on a day-to-day basis? Absolutely.\n\nHaving that person serve as a representative to the department for recruiting? Fund raising? Etc? Schmoozing with rich people to get more money for the school? Being a professor goes far past the classroom, and that's where it counts to follow social conventions because it is expected by our society as well as university administrators.\n\nProfessors are known for being eccentric in their personality and dress. They may have crazy hair, have too many piercings, or wear jeans to work every day with a ratty printed t-shirt. That's all fine. Nobody cares. But it IS important to dress up for certain things at the university, and showing that you know how in an interview is important. Of course, you can completely disregard any of that. I'm sure some schools don't care. Mine doesn't happen to be one of them.",
                                              "author": null,
                                              "created": 1529018787,
                                              "upvotes": 4,
                                              "replies": {
                                                "e0osszi": {
                                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0osszi/",
                                                  "text": "it doesn't seem like you get that you have agency here.",
                                                  "author": null,
                                                  "created": 1529018954,
                                                  "upvotes": 3,
                                                  "replies": {
                                                    "e0ot1ou": {
                                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ot1ou/",
                                                      "text": "Not if I want to keep my administrators happy. I want things like promotions.",
                                                      "author": null,
                                                      "created": 1529019216,
                                                      "upvotes": 3,
                                                      "replies": {
                                                        "e0ot4sd": {
                                                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ot4sd/",
                                                          "text": "lol if you say so. at least you know you are just a cog in the machine",
                                                          "author": null,
                                                          "created": 1529019311,
                                                          "upvotes": 3,
                                                          "replies": {
                                                            "e0ot82u": {
                                                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ot82u/",
                                                              "text": "Yes, but I'm employed with great benefits, reasonable pay, and I have a fulfilling job with lots of vacation time. It's worth the trade-off. ",
                                                              "author": null,
                                                              "created": 1529019410,
                                                              "upvotes": 3,
                                                              "replies": {}
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "e0p9zjr": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0p9zjr/",
                          "text": "Do people wear suits to academic interviews in Chemistry? I've never worn a suit to an interview, and never seen someone wear one at a job talk or anything in my field (math/theoretical cs).",
                          "author": "l_lecrup",
                          "created": 1529039244,
                          "upvotes": 1,
                          "replies": {
                            "e0paepq": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0paepq/",
                              "text": "I see it about 80/20. I always wear suits to interviews and so do most of our applicants, but I've seen a few who didn't. We've hired both people who did and people who didn't.",
                              "author": null,
                              "created": 1529039874,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "e0ojthf": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ojthf/",
                  "text": "This interesting. I feel like half of my department carries old ratty bags. ",
                  "author": "never_be_boring",
                  "created": 1529010200,
                  "upvotes": 3,
                  "replies": {
                    "e0okelp": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0okelp/",
                      "text": "But what you do every day is different than at an interview.",
                      "author": null,
                      "created": 1529010737,
                      "upvotes": 2,
                      "replies": {
                        "e0okjcb": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0okjcb/",
                          "text": "That's absolutely true. I read your post out of context and was trying to defend my old lovely leather messenger bag with a ripped zipper :) ",
                          "author": "never_be_boring",
                          "created": 1529010859,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e0kvdkw": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kvdkw/",
          "text": "I am curious what you mean by not dressed appropriately to tour the labs. Can you explain? \n\nAlso, how were you turned down for cost of living being too low?",
          "author": "hemkersh",
          "created": 1528856274,
          "upvotes": 12,
          "replies": {
            "e0kw2e1": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kw2e1/",
              "text": "If you show up to walk around a chemistry lab with high water pants and heels, that's not appropriate lab attire.\n\nAnd if you are used to living in California, and have normal levels of debt, you may not be able to afford to move to a low cost of living area because the salary won't be high enough to cover debt from a high col area.",
              "author": null,
              "created": 1528857011,
              "upvotes": 38,
              "replies": {
                "e0kxint": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kxint/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1528858627,
                  "upvotes": 44,
                  "replies": {
                    "e0kydbh": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kydbh/",
                      "text": "It depends on if you view salary in absolute amount or in ratio to average cost of living in the area.",
                      "author": "JeanLag",
                      "created": 1528859599,
                      "upvotes": 10,
                      "replies": {}
                    },
                    "e0l0bxf": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l0bxf/",
                      "text": "I won't be pedantic about it, but it's the same difference. If they came from a low CoL area to ours, they wouldn't have a problem. Salary is tied 100% to CoL. \n\nWe actually have an issue with people not applying because of where we are located (not a big city in the Southeast). I feel like the number of applicants we get is much smaller than in other schools up north and west of us. ",
                      "author": null,
                      "created": 1528861928,
                      "upvotes": 4,
                      "replies": {
                        "e0ly7ru": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ly7ru/",
                          "text": "To be honest, I think there are a lot of cultural reasons besides salary and cost of living that affect the size of academic applicant pools for schools in small southern towns. Right or wrong, a candidate from the east or west coast would probably feel like 'not a big city' in Michigan or Ohio would be an easier cultural adjustment than 'not a big city' in Alabama or Mississippi, even if salary and cost of living were identical.",
                          "author": "boonamobile",
                          "created": 1528908068,
                          "upvotes": 21,
                          "replies": {
                            "e0ptpnx": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ptpnx/",
                              "text": "The people who would reject a position based on stereotype likely are incapable of overcoming their own biases.  I moved to \"the South\" and was amazed at how diverse (and even progressive) a large number of people are.  There are still times where I realize \"Oh, this is the South\" but mostly it's far more agreeable than one might expect.",
                              "author": "the_Stick",
                              "created": 1529071463,
                              "upvotes": 0,
                              "replies": {
                                "e0pv2hq": {
                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0pv2hq/",
                                  "text": "Do you feel the city or university town you're in is representative of the surrounding area?",
                                  "author": "boonamobile",
                                  "created": 1529072745,
                                  "upvotes": 2,
                                  "replies": {
                                    "e0qmtg2": {
                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0qmtg2/",
                                      "text": "Yes-ish.  My small city is a university town, but it has three or four universities, plus several colleges.  The county population is diverse and generally progressive (at least on most social issues; economic concerns tend to swing more conservatively).  I have encountered a much larger array of ideas and personalities than I expected.\n\nThat said, my county is a bit of an outlier from the surrounding, much more rural counties that tend toward more homogeneity in population and thought and not as many economic opportunities as my county has.  I'm definitely in a prosperous area.  Of course, travel an hour either direction and you get to another area like mine (and even one with some serious urban sprawl).\n\nSo to be as accurate as possible, I may be in the south, but I am in a small city that is not solely dependent on the university to exist, nor am I in a tiny rural enclave.  There is a wealth of unexpected diversity and I have found it fairly easy to find events I'm interested in and people I like to spend time with.",
                                      "author": "the_Stick",
                                      "created": 1529096744,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "e0ptjlf": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ptjlf/",
                          "text": "I'm curious about your university now (and if you're recruiting biochemists any time soon).  I'm in a medium-size SE city with a reasonable CoL but not terribly happy with my institution (we have a history of poor leadership from top to bottom).  It's impacted my morale and motivation, so I think about other opportunities.  Of course, I need to write the three papers I am sitting on first, but information like you have related helps me see the bigger picture.  If nothing else, thanks for your perspective.",
                          "author": "the_Stick",
                          "created": 1529071304,
                          "upvotes": 1,
                          "replies": {
                            "e0q9lxy": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0q9lxy/",
                              "text": "I'm in Tennessee, but we just hired a biochemist this year. Now we have 3.5 biochemist and won't need another until someone retires or leaves.",
                              "author": null,
                              "created": 1529085336,
                              "upvotes": 2,
                              "replies": {
                                "e0qma0c": {
                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0qma0c/",
                                  "text": "Thanks for the response.  Wow, 3.5?  I am the only one in my department.  So... lonely...  :)  \n\nI'm in NC, and my set-up is mostly pretty nice.  We just really, really need better leadership and support for the stated goals, instead of \"teach more classes -- grr.\"",
                                  "author": "the_Stick",
                                  "created": 1529096226,
                                  "upvotes": 1,
                                  "replies": {
                                    "e0qn375": {
                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0qn375/",
                                      "text": "I have a lot of issues with our administration too, and a lot of the campus administrative staff is stepping down or leaving. It's the provost. He's a special kind of jerk to work for I've heard.",
                                      "author": null,
                                      "created": 1529097008,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "e0lpnfj": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lpnfj/",
                  "text": "Was the backpack a problem for people?\n\nI have an old backpack I still use. I thought about replacing it, but the backpack is better for my back than a shoulder\\-bag and from an environmental standpoint I don't like the idea of tossing an okay backpack into a landfill for no good reason. I DO have a nice leather thing I can use for interviews, but it wouldn't hold a laptop easily.\n\nIt sounds like the candidate had a lot of other problems, though. I remember my boss fixating on a stupid little thing when we had a poor candidate come in. ",
                  "author": "rzr101",
                  "created": 1528900701,
                  "upvotes": 10,
                  "replies": {
                    "e0lyo1p": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lyo1p/",
                      "text": "You don't need to toss the backpack. You just need to have a presentable option for interviews. Like, my backpack is nice and I still wouldn't carry it to an interview because it's not strictly formal attire. I use it at work no problem, but an interview is a more formal affair and people expect you to be dressed for it. Since you're not interviewing every day of your life, I don't think expecting you to wear some nice clothes for interviews is a hardship.",
                      "author": "riggorous",
                      "created": 1528908446,
                      "upvotes": 9,
                      "replies": {
                        "e0m4i8z": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m4i8z/",
                          "text": "I understand. I just hadn't thought of my backpack as part of my clothes. And if someone interviewed at my company with an old backpack I'm not sure I would care, but I suppose it depends on whether it's an analyst job versus a more senior position.\n\nI've been looking at job sites but I have forgotten where my fancy leather bag is. I'll have to find it tonight!",
                          "author": "rzr101",
                          "created": 1528913318,
                          "upvotes": 2,
                          "replies": {
                            "e0n285c": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0n285c/",
                              "text": "You could donate an okay backpack to Goodwill or a school supply drive if it's still usable. ",
                              "author": "SnittingNexttoBorpo",
                              "created": 1528945312,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "e0m41jv": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m41jv/",
                      "text": "I use a backpack for day to day, but I have a shoulder style / laptop bag for interviews and such.  It just looks a bit more polished, and it can be a bit easier to stow in offices and such, rather than constantly having to unshoulder a bag.\n\nFewer wrinkles as well.",
                      "author": "sasky_81",
                      "created": 1528912928,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "e0m3m6l": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m3m6l/",
                      "text": "You should always present yourself as well as possible, including not using a 10 year old frayed, dirty backpack to an interview for a professional job.",
                      "author": null,
                      "created": 1528912576,
                      "upvotes": 0,
                      "replies": {
                        "e0m4jry": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m4jry/",
                          "text": "What if I told you it's closer to 20 years, so it's like... vintage?\n\nEDIT: Also, not dirty. I ran it through the washing machine six months ago.",
                          "author": "rzr101",
                          "created": 1528913354,
                          "upvotes": 1,
                          "replies": {
                            "e0m664m": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m664m/",
                              "text": "Then I would suggest you run by a thrift store and buy a non-frayed/falling apart computer bag for $4.",
                              "author": null,
                              "created": 1528914711,
                              "upvotes": 2,
                              "replies": {
                                "e0m7pmc": {
                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m7pmc/",
                                  "text": "Actually, my leather briefcase might hold the small laptop I use these days. Best to check that out.\n\nI AM joking around and I won't be taking my old (but in good shape, really) backpack to job interviews. I will 100% remember to bring my nice briefcase or something similar to my next interview.",
                                  "author": "rzr101",
                                  "created": 1528915999,
                                  "upvotes": 2,
                                  "replies": {
                                    "e0m7ryu": {
                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m7ryu/",
                                      "text": "Whew!",
                                      "author": null,
                                      "created": 1528916055,
                                      "upvotes": 1,
                                      "replies": {
                                        "e0m8pz8": {
                                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m8pz8/",
                                          "text": "I got a little nervous thinking about what I brought to my last interview, but then I remembered I got the job, so it must have been my good bag.\n\nActually, since you've had a lot of good insights... I'm curious, how many people are bringing their laptop to the interview? I rarely carry around my laptop anymore, and if I need files I'll bring a USB stick or save something on the cloud and let the interviewer know I would prefer to borrow a laptop (if they can accommodate that, of course).",
                                          "author": "rzr101",
                                          "created": 1528916846,
                                          "upvotes": 2,
                                          "replies": {
                                            "e0n2cmg": {
                                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0n2cmg/",
                                              "text": "I would never bring a laptop. The hassle of getting it connected, getting the screen resolution right, and probably screwing up the classroom's settings for the next person is just not worth it. (I've also started to lose patience with presenters who do this at conferences.) I bring a USB, but also store my presentation on at least two cloud sites (DropBox, Google Docs, etc.) and email it to myself. It takes 2 minutes and covers a lot of bases.",
                                              "author": "SnittingNexttoBorpo",
                                              "created": 1528945450,
                                              "upvotes": 2,
                                              "replies": {}
                                            },
                                            "e0mesy9": {
                                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mesy9/",
                                              "text": ">I'm curious, how many people are bringing their laptop to the interview?\n\nI don't recall anyone having one with them all the time, but some bring them for the teaching demo and/or research talk. Most of them are Apple users, which is probably smart because we are a Windoze campus and their presentations don't always work well with our systems. Never seen anyone have one out during a meeting though.",
                                              "author": "SnowblindAlbino",
                                              "created": 1528921958,
                                              "upvotes": 1,
                                              "replies": {
                                                "e0mh9jl": {
                                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mh9jl/",
                                                  "text": "Thanks",
                                                  "author": "rzr101",
                                                  "created": 1528924053,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            },
                                            "e0mh0nu": {
                                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mh0nu/",
                                              "text": "Not many. I just put it on cloud storage.",
                                              "author": null,
                                              "created": 1528923836,
                                              "upvotes": 1,
                                              "replies": {
                                                "e0mh9cs": {
                                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mh9cs/",
                                                  "text": "Thanks.",
                                                  "author": "rzr101",
                                                  "created": 1528924049,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "e0kzm1b": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kzm1b/",
                  "text": "Ah. Those make sense. Especially if you know you are touring chemistry labs, wear appropriate dress clothes. It also sends a message you are lax with safety. \n\nI'd didn't even think about the hit to finances from moving to low CoL from high. Good thing to think about. ",
                  "author": "hemkersh",
                  "created": 1528861054,
                  "upvotes": 5,
                  "replies": {
                    "e0l0em4": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l0em4/",
                      "text": "Yup. It should be a no-brainer for a chemist.",
                      "author": null,
                      "created": 1528862023,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "e0lc3ka": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lc3ka/",
                  "text": "> high water pants\n\nwow, TIL a fashion term on an academic sub",
                  "author": "riggorous",
                  "created": 1528882439,
                  "upvotes": 3,
                  "replies": {
                    "e0n2gj9": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0n2gj9/",
                      "text": "A more up-to-date term would probably be skimmer or capri.",
                      "author": "SnittingNexttoBorpo",
                      "created": 1528945571,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "e0ks5en": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ks5en/",
          "text": "What makes me sad about the list is the unqualified people that make it to interview stage, when there are other candidates who kick ass getting passed over. Cause the guy who doesn't actually know science looks good on paper. The way that searches are conducted do not necessarily lead to the right people being interviewed, and that is an injustice.",
          "author": "IamRick_Deckard",
          "created": 1528852881,
          "upvotes": 49,
          "replies": {
            "e0ksnss": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ksnss/",
              "text": "If the qualified people aren't getting hired, they are either applying jobs that they aren't qualified for, or they aren't selling themselves on paper.\n\nThe way we do candidate searches is that every person in the department reads all applications, then we come together and discuss our top 10 choices. Our of dozens of people, we usually all have the same top 5. If we saw one that we really liked and was passed by others at the table, we advocate for them and everyone sits together and looks at that person's packet again. \n\nIt's a very fair process, and if someone who is really good isn't getting picked it's because they were a shitty cover letter, etc... \n\nThe difference between an unqualified person that gets interviewed and a qualified person that doesn't is that the undersigned person knows how to sell their strengths. Then we find out they are full of it during their visit.",
              "author": null,
              "created": 1528853410,
              "upvotes": 74,
              "replies": {
                "e0l3z8w": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l3z8w/",
                  "text": "I had a nobel laureate tell me I should be getting professor jobs based on my CV. They even helped me edit it a bit.\n\nHave yet to get an in person faculty interview.\n\nEdit: Or phone interview for academia. Industry job hunt is going a bit better, but still on the hunt.",
                  "author": "airwalker12",
                  "created": 1528866883,
                  "upvotes": 25,
                  "replies": {
                    "e0l9vif": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l9vif/",
                      "text": "If they're a Nobel laureate, they're most likely old. And if they're old, the necessary requirements for positions have probably increased substantially since they were in your position.\n\nKeep trying though, you'll get there eventually.",
                      "author": "EmeraldIbis",
                      "created": 1528877446,
                      "upvotes": 72,
                      "replies": {
                        "e0lg2rp": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lg2rp/",
                          "text": "'I had someone knowledgeable and graceful give me a confidence boost, and then they showed me where I had been going wrong in a way that made me not realise - even to this day - that that's what they were doing.'",
                          "author": "Glaselar",
                          "created": 1528889962,
                          "upvotes": 23,
                          "replies": {}
                        },
                        "e0mbe92": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mbe92/",
                          "text": "for real. this is a problem plaguing universities, esp (ironically) those that are most prestigious. the faculty get older and older and more out of touch. \n\none of my faculty has a goddamn macarthur fellowship and still has no idea how to teach a basic methods course. won't even introduce such a course into our curriculum. ",
                          "author": "the_girl",
                          "created": 1528919088,
                          "upvotes": 6,
                          "replies": {}
                        },
                        "e0m18dq": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m18dq/",
                          "text": "Thanks man. \n\nLots of interviews on the horizon (in industry), which I am just as excited about.",
                          "author": "airwalker12",
                          "created": 1528910598,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    },
                    "e0l5rzc": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l5rzc/",
                      "text": "You have gotten phone interviews?",
                      "author": null,
                      "created": 1528869744,
                      "upvotes": 2,
                      "replies": {
                        "e0l6q7t": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l6q7t/",
                          "text": "Nope.\n\nFor biotech industry research positions, yes I have gotten a lot of hits. Very active in the process, even debating some offers.\n\nFor assistant prof jobs..... Crickets.",
                          "author": "airwalker12",
                          "created": 1528871373,
                          "upvotes": 5,
                          "replies": {
                            "e0l6rfb": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l6rfb/",
                              "text": "I'm guessing you were applying at R1 schools? ",
                              "author": null,
                              "created": 1528871432,
                              "upvotes": 5,
                              "replies": {
                                "e0l6t73": {
                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l6t73/",
                                  "text": "Yeah. Seems to be the only way the NIH is going to give me enough money to do the research I want to do.",
                                  "author": "airwalker12",
                                  "created": 1528871519,
                                  "upvotes": 7,
                                  "replies": {
                                    "e0l74jo": {
                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l74jo/",
                                      "text": "Yeah. Those jobs are incredibly competitive. A friend of mine did that route for I think 4 review cycles and finally took a lab director job at an ivy instead. ",
                                      "author": null,
                                      "created": 1528872080,
                                      "upvotes": 9,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "e0p9ujn": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0p9ujn/",
                      "text": "Out of curiosity, was that Nobel laureate Holmström? A buddy of mine told me that someone with an impressive cv and Holmström as one of their *references* got turned down for a job under some pretty suspicious circs.",
                      "author": "l_lecrup",
                      "created": 1529039046,
                      "upvotes": 2,
                      "replies": {
                        "e0p9wy6": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0p9wy6/",
                          "text": "Nope, not me. \n\nI am in an entirely different field (I had to Google Holmström)",
                          "author": "airwalker12",
                          "created": 1529039141,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "e0lc07n": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lc07n/",
              "text": "That's just the way the job search works in any field, including mcdonalds serving. It's impossible to capture everything of interest in the written application, which is why people conduct interviews - and why they reject a lot of candidates after the interviews. It's not so much an injustice as a limitation of human abilities. We are not after all telepathic.",
              "author": "riggorous",
              "created": 1528882228,
              "upvotes": 5,
              "replies": {
                "e0lkeby": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lkeby/",
                  "text": "Yes, that is true, but McDonald's conducts many interviews for one position, whereas universities interview 3 people. ",
                  "author": "IamRick_Deckard",
                  "created": 1528895523,
                  "upvotes": 4,
                  "replies": {
                    "e0lliuf": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lliuf/",
                      "text": "arguably, mcdonald's requires many fewer on-paper qualifications and competencies than postgraduate level teaching and research",
                      "author": "riggorous",
                      "created": 1528896711,
                      "upvotes": 5,
                      "replies": {
                        "e0lm75i": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lm75i/",
                          "text": "Yes, but then I would argue that many more applicants have the required competencies than 3, or even 8. Clearly if someone who makes it to interview stage who doesn't actually know science, then the competencies and experience that they are able to show lie in some way, or the committee has a huge blind spot like some bias for a particular institution that lets people like this get past many rounds and make it to the interview stage. There is really no point in arguing further, but committees are made up of fallible human beings, and hiring practices are not scientific or fair. Failed searches show this well: the committee did a bad job of picking and no one is suitable. Bias plays a big role, and the sooner we realize this, the sooner we can fix it. I am dismayed that people want to argue that hiring practices are well and good. Committees do their best, but there is a lot of injustice in the end. We can all work to make the process better.",
                          "author": "IamRick_Deckard",
                          "created": 1528897409,
                          "upvotes": 2,
                          "replies": {
                            "e0lpc1s": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lpc1s/",
                              "text": "I think you're mostly right and I don't want to argue. I wish hiring practices had less biases. \n\nMy most irritating story of hiring managers was when my ex\\-wife was applying for research assistant positions and it was very competitive in the market, so I went to talk to our hiring manager. She said if the prof asked for 10 applicants to look into, she would go through applicants until she got 10 qualified applicants and then stop reviewing. Why review more applications when you've achieved what the prof wanted?",
                              "author": "rzr101",
                              "created": 1528900417,
                              "upvotes": 5,
                              "replies": {}
                            },
                            "e0lxi7i": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lxi7i/",
                              "text": "I never said that hiring practices are well and good, so you can put down your pitchfork. I said that these are the hiring practices in virtually every industry. You're not getting far with arguing that resumes are wrong and that people should be designing hiring procedures that don't let any unqualified people through to the interview stage because that point of view is unrealistic and out of touch.\n\nIt is entirely possible that the committee is biased towards a particular institution (and that bias may or may not have grounds in reality, fyi) and no one is arguing that committees are not made up of fallible human beings. But that some unqualified candidates make it to interviews is a fact of life. If they didn't, we wouldn't need interviews.",
                              "author": "riggorous",
                              "created": 1528907470,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e0lvgch": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lvgch/",
          "text": "> Bad reference. A candidate rubbed someone the wrong way in the past, and asked them to be a reference. The reference looked good on the surface, but as soon as we asked them if they worked well with others, they said no. He was our first pick until then.\n\nThis may merit its own thread, but I wonder about this sometimes when I am asked for a reference from someone I have concerns about. Should I just politely decline, or is there an obligation to warn peers about this person?",
          "author": "adlaiking",
          "created": 1528905738,
          "upvotes": 5,
          "replies": {
            "e0m3owx": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m3owx/",
              "text": "I decline, but it's up to you.",
              "author": null,
              "created": 1528912640,
              "upvotes": 6,
              "replies": {}
            },
            "e0m7t4k": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m7t4k/",
              "text": ">I wonder about this sometimes when I am asked for a reference from someone I have concerns about. Should I just politely decline, or is there an obligation to warn peers about this person?\n\nThis gets tricky if you're a supervisor\\-\\- we are required by our HR rules to contact the candidate's current or immediate past supervisor for a reference check. That's commonly a graduate advisor or department chair, and sometimes they clearly are not keen on giving a reference...so they will damn with faint praise. I've only had a couple who ever gave what I'd consider negative references, and they were basically warnings about personality issues we had already flagged.\n\nIf you are asked by a candidate and cannot give a positive reference I'd indeed simply decline. I have done that with students many times.",
              "author": "SnowblindAlbino",
              "created": 1528916081,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "e0l2nhs": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l2nhs/",
          "text": "I start grad school in a couple of months. Can I reserve a job at your institution for five years from now? ",
          "author": "UnspectacularAim",
          "created": 1528864973,
          "upvotes": 10,
          "replies": {
            "e0l5su5": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l5su5/",
              "text": "Next opening for us will be organic chemistry in 5 years. Interested?",
              "author": null,
              "created": 1528869786,
              "upvotes": 8,
              "replies": {
                "e0lqsf6": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lqsf6/",
                  "text": "How far out in advance do schools know about open positions? 5 years seems like a lot in advance.",
                  "author": "not_a_theorist",
                  "created": 1528901716,
                  "upvotes": 2,
                  "replies": {
                    "e0m3ii9": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m3ii9/",
                      "text": "We have one who said he will retire in 5 years. ",
                      "author": null,
                      "created": 1528912490,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "e0m2iob": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m2iob/",
                      "text": "Usually it's due to an impending retirement.",
                      "author": null,
                      "created": 1528911667,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "e0m63zl": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m63zl/",
                      "text": "we're doing our strategic planning for the time frame until 2028 right now. There aren't that many professor's positions available - even in a large department with 40 people, so it is worthwhile to think about where you want the department to be in 10 years. We do adjust our strategies every 5 years, to take into account changes in the field and to be able to react on people leaving for other positions, but the longer term perspectives need to be discussed and so this is a continuous process.",
                      "author": "velax1",
                      "created": 1528914661,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "e0m7am0": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m7am0/",
                      "text": ">How far out in advance do schools know about open positions?\n\nTheoretically, if it's a retirement, maybe 1\\-2 years (in the US you can't legally ask an employee when they will retire, but they can volunteer to reveal that info). Much more commonly, though, we get an opening due to a resignation or a new line gets approved. At my institution hiring requests go to the deans in May and we get answers around August 1st. So \"how far in advance\" is typically about two weeks, the time period between receiving that approval and the deadline for posting the job ad.\n\nDifferent of course at other kinds of institutions. Sometimes we have grants, endowment gifts, or other such golden eggs that know about earlier.  We also have a strategic plan for the department that lays out our next 3\\-4 hires based on priority, but that might well take 20 years given the rate of retirements/growth we expect.",
                      "author": "SnowblindAlbino",
                      "created": 1528915658,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "e0mt4gp": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mt4gp/",
                  "text": "Organic chemistry is the bees knees. I've been tutoring O\\-chem for the last three years. That job is mine!!\n\nPs. I'm also available to teach biochemistry and genetics.",
                  "author": "UnspectacularAim",
                  "created": 1528935478,
                  "upvotes": 1,
                  "replies": {
                    "e0mvz7s": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mvz7s/",
                      "text": "As long as your doctorate is in organic and not biochemistry or genetics, you should apply!",
                      "author": null,
                      "created": 1528938534,
                      "upvotes": 1,
                      "replies": {
                        "e0mxjvm": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mxjvm/",
                          "text": "It's in biochem... I'll change my department just to get this job.\n\nJust kidding, biochemistry is the best! All of these enzyme mechanisms!",
                          "author": "UnspectacularAim",
                          "created": 1528940212,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e0l7xjv": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l7xjv/",
          "text": "Being in excess of 400 pounds, if you mean by body weight, effectively *is* a disability (morbid obesity). And I don't know how a person can be(come) *that much* overweight in a chemistry PhD and postdocs \\- we walk and stand around labs a lot. Of course, unless it's computational chemistry, or unless the person has a health issue causing weight gain. From that \"unexcited behavior\" I'd guess they are suffering from depression and on antidepressants which caused weight gain and flattened emotions \\- a person with this problem [posted on this subreddit](https://www.reddit.com/r/AskAcademia/comments/8qf2uu/need_help_with_career_options_when_i_cant/) just about a day before you. Of course, if they didn't tell you couldn't know so it isn't discrimination, especially if you had applicants who fit your needs better.",
          "author": "AstraGlacialia",
          "created": 1528873534,
          "upvotes": 10,
          "replies": {
            "e0lc80w": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lc80w/",
              "text": "> unless the person has a health issue causing weight gain. \n\nI don't understand. If the job requires good mobility, then it doesn't matter why the person is fat (or for that matter, why they struggle with mobility) - they're not fit for the job. I don't understand why you think it's okay, in hiring terms, that they're fat because of a health issue vs that they're fat because they eat a lot of cheetos.\n\nIt's also not discrimination in any case because fat is not a protected category (although whether it should be is an open question).\n\nI am deeply uncomfortable with the way OP chose to phrase that point, however. It's like, we didn't like them bc they were boring and lethargic - and btw totally unrelatedly, they were also SUUUUUUUUUUUPER FAT!\n\nwhat??",
              "author": "riggorous",
              "created": 1528882727,
              "upvotes": 21,
              "replies": {
                "e0m45ui": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m45ui/",
                  "text": "I actually pointed it out because I feel it was directly correlated with the reason they were lethargic and unenthusiastic in their presentation. Even every movement looks like a struggle, it seemed to be relevant. Strangely enough, the chair of our department is quite large and made comments about it being an inexcusable reason for giving such a lethargic lecture. ",
                  "author": null,
                  "created": 1528913030,
                  "upvotes": 6,
                  "replies": {}
                },
                "e0lda3p": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lda3p/",
                  "text": "That's better than \"we didn't hire them because they are very fat\". Which probably would be discrimination or at least unfair treatment, as the job of a chemistry professor / lecturer / research group leader generally doesn't really require good mobility (in most or at least many cases they don't need to do labwork or any other notable physical work themselves)... but the previous positions required to get to the point in career that they can apply for such chemistry professor-level jobs (PhD studies and postdoctoral positions) usually do require good mobility, if it is wet lab chemistry rather than computational chemistry. Of course, being very fat still makes some aspects of the professor job more difficult and more problematic - e.g., they may need a large, reinforced chair to sit in while lecturing and in their office, and some professors need to travel a lot and very fat people need two seats in a plane etc. - but that doesn't seem enough to declare that very fat people can't or shouldn't do the job.",
                  "author": "AstraGlacialia",
                  "created": 1528884982,
                  "upvotes": 7,
                  "replies": {
                    "e0le93m": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0le93m/",
                      "text": "> Which probably would be discrimination or at least unfair treatment\n\nOnce again, it would not be either of those things because fat is not a protected category. In the United States, discrimination is recognized against gender, race, disability, age, national origin, and a couple other niche categories. Otherwise, I can elect not to hire you for any reason, be it that you're fat, you have red hair, I don't like the way you eat asparagus...\n\nAnyway, I'm just confused why the weight was mentioned either by you or by OP.",
                      "author": "riggorous",
                      "created": 1528886876,
                      "upvotes": 13,
                      "replies": {
                        "e0legms": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0legms/",
                          "text": "I'd expect it could be considered a disability, but ok, I am not much familiar with the US laws. To me it seems the OP just tried to say that being fat would excuse them acting a bit lower\\-energy than an average applicant, but not that much lower\\-energy. I just responded to that.",
                          "author": "AstraGlacialia",
                          "created": 1528887260,
                          "upvotes": 1,
                          "replies": {
                            "e0leltg": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0leltg/",
                              "text": "[Here's an article on the subject] (https://corporate.findlaw.com/litigation-disputes/is-obesity-a-disability.html). tl;dr, in itself, no.",
                              "author": "riggorous",
                              "created": 1528887519,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "e0lkcar": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lkcar/",
              "text": "I saw that post, and I'll say that this wasn't a flat affect situation. \n\nThe weird thing was they had plenty of personality and enthusiasm when sitting at a table talking. And one we knew very well and was a former student. I guess we could argue that they were actually disabled due to size, but lack of enthusiasm when teaching is just something we can't work with at a school full of struggling students. \n\nI remember our discussion of the candidates included trying to figure out if they lacked enthusiasm, or if they were simply too large to move around, which we didn't want to discriminate against. Both times we found better candidates in the pool, so it became a moot point.",
              "author": null,
              "created": 1528895461,
              "upvotes": 6,
              "replies": {
                "e0m741a": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m741a/",
                  "text": "Thanks for explanation. Then I suppose they are cases of crippling stage fright (fear of public speaking) or/and lack of teaching experience, talent or/and skills, which unfortunately means they weren't good candidates for a teaching-focused school. Nice of you that you put consideration and effort towards not discriminating against their size.",
                  "author": "AstraGlacialia",
                  "created": 1528915503,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "e0m91g6": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m91g6/",
              "text": "> Being in excess of 400 pounds, if you mean by body weight, effectively is a disability\n\nI'd be shocked if they actually were. OP may be bad at guessing weight, 400lbs is absolutely massive unless they're 7+ feet tall",
              "author": "GeneralShepard",
              "created": 1528917111,
              "upvotes": 5,
              "replies": {
                "e0ma6a3": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ma6a3/",
                  "text": "I understand the OP didn't actually weigh them, but gave an illustrative weight which is morbidly obese at any height and body type - the OP wrote they could walk fine, so I pictured something just about \"thin\" enough for that. That is, notably fatter than our most overweight students, who already struggled a lot with physical demands of lab work (for most of them I know they went on to lose quite some weight and work better in their later labs).",
                  "author": "AstraGlacialia",
                  "created": 1528918057,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "e0mfuzu": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mfuzu/",
              "text": "> And I don't know how a person can be(come) that much overweight in a chemistry PhD and postdocs \n\nBy eating lots of food.",
              "author": null,
              "created": 1528922851,
              "upvotes": -1,
              "replies": {
                "e0mj1c1": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mj1c1/",
                  "text": "I eat lots of food. And I am overweight (BMI around 27). But to become that much overweight (just barely still able to walk without accommodations) by the age at which most people interview for professor positions (around 35-37), I think I'd need to eat to the point of feeling sick all the time, which would be very unpleasant and work-disrupting.",
                  "author": "AstraGlacialia",
                  "created": 1528925602,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e0l4mny": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l4mny/",
      "text": "Whew! Most notable: we had an extremely talented scholar interview at my PhD program. They had already published a monograph, several journal articles, and were on contract for a second book (this is a big deal in my area in the humanities). Their work had received some positive attention as well, so they were known. \n\nResearch talk was abysmal. It was unfocused, and they didn't articulate a publication agenda. With a second book under contract, that should have been a slam dunk. \n\nThe biggest issue was dinner. Everyone ordered food and a beer/wine. Candidate ordered a pitcher of beer. Questionable. The pattern continued, and the candidate got sloppy drunk at the dinner. They were supplying beer to the graduated students, which made the senior faculty feel a bit uncomfortable. It doesn't matter how talented a scholar you are- don't get sloppy drunk at a job interview. \n\nAside from this, the most common reason is that people don't understand the institution type/job. I've been on searches with research faculty that only talk about their passion for teaching and instructional faculty candidates that ask about research sabbatical opportunities. That immediately kills interest because we know they wouldn't be sticking around, and that they didn't even bother to google us. \n\nNext in line is the lunch test. We always take lunch easy, and we talk about TV, sports, pop culture, never politics- it's a \"fit\" test. Can this person integrate in a non-academic discussion about us as people? A surprising number of people fail this test and either clam up or try to spin everything towards their research/teaching. I always tell my students to do their work, but watch TV/movies/listen to music- whatever- keep hobbies. It's likely we will have a really talented researcher/teacher that also knows how to engage their coworkers. ",
      "author": "cdb3492",
      "created": 1528867867,
      "upvotes": 66,
      "replies": {
        "e0lpjue": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lpjue/",
          "text": "> I always tell my students to do their work, but watch TV/movies/listen to music- whatever- keep hobbies.\n\nHaving finished my phd only a year ago, I've unfortunately seen a few advisors steering their grad students in the opposite direction. For example: \n\nI led a first-year \"welcome to grad school; here's some tips to succeed\"-style seminar during the last year of my program. As a tip, I suggested finding or keeping a hobby that students enjoy and sticking to a plan to indulge and enjoy time spent with this hobby a few hours each week to maintain sanity. I even made the caveat that there will be weeks where this may not be possible, but did say that work-life balance is difficult in a time-demanding job, so grad school is a good time to learn skills towards achieving whatever a healthy balance means for each person.\n\nAn advisor had been sitting in on that session and contradicted me in front of the first year students, saying that work-life balance is over rated and grad school is the only time in our lives that we will be able to devote ourselves to our studies fully. She said the answer to mental health isn't to \"just go bake a cake\", but to instead be better at our own research. I bit my tongue in the moment, because she had already written me a good letter of recommendation for the job I now have, but still fume over the side conversation we had later where I tried to calmly tell her that not everyone works like her and that it's okay to do so (spoiler: she disagreed and said that she will never regret spending so much time at work instead of with her family, and already regrets not spending more time at work and less with her family). ",
          "author": "BangarangRufio",
          "created": 1528900612,
          "upvotes": 40,
          "replies": {
            "e0ls5ji": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ls5ji/",
              "text": "> spoiler: she disagreed and said that she will never regret spending so much time at work instead of with her family, and already regrets not spending more time at work and less with her family).\n\nThis is why I eventually quit academia (apart from the other crap).\nWhen I think back on my life I don't think the number of Nature publications would be something I'd think about. I hope I'd think about all the human interactions, the good things (and the bad) that come with family and friends.",
              "author": "rambo77",
              "created": 1528902912,
              "upvotes": 25,
              "replies": {
                "e0ltfwm": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ltfwm/",
                  "text": "To be fair to the academic community as a whole: I do know some prolific researchers who make ample time for their hobbies and families. However, having to compete for jobs and grants against people who would rather spend their time researching/writing/producing data than with their family/friends/hobbies creates an often toxic environment of \"if you're not working as many hours as the person next to you, you're a slacker and should give up now\". \n\nAdditionally, I've found that a large percentage of R1 academics do actually fall in the category of those who would enjoy a work-life balance skewed towards work (nothing wrong with that if it's enjoyable to the person). I just hate that advisors force students who have no desire to pursue R1 careers into a work ethic that doesn't match their own interests/goals. As an anecdote, I now work at a teaching SLAC and work 40-50 hour weeks during the school year, despite my advisor's insistence that I would still be working 70 hour weeks (like she does) but grading and lesson-planning instead of researching.",
                  "author": "BangarangRufio",
                  "created": 1528904022,
                  "upvotes": 23,
                  "replies": {
                    "e0mnjpv": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mnjpv/",
                      "text": "My PhD adviser postdoc'd at an R1 institution with a known toxic culture of \"research 1st, family 2nd, free-time never\" sort of philosophy. At our R1, also highly respectable, where she had her first faculty appointment, she said that our university shows there is clearly a better way of doing things: people are doing work on par with that at the previous institute she was at, but everyone has hobbies, work-life balance, and is much happier. She said there was no reason for the people at her previous institute to work so much and be so miserable, because they really weren't getting ahead of anyone else by doing that. ",
                      "author": "alexa-488",
                      "created": 1528929801,
                      "upvotes": 10,
                      "replies": {}
                    }
                  }
                },
                "e0lytps": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lytps/",
                  "text": "This is why I, too, abandoned TT search. I interact frequently with brand new Asst Profs in my current position, and I don't envy them one bit. ",
                  "author": "boonamobile",
                  "created": 1528908576,
                  "upvotes": 4,
                  "replies": {
                    "e0m3z2c": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m3z2c/",
                      "text": "Yeah it's not a good life. It's a shame because I love lab work",
                      "author": "rambo77",
                      "created": 1528912871,
                      "upvotes": 2,
                      "replies": {
                        "e0m5bta": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m5bta/",
                          "text": "Exactly. Thus the staff scientist job. ",
                          "author": "boonamobile",
                          "created": 1528914006,
                          "upvotes": 6,
                          "replies": {
                            "e0nf998": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nf998/",
                              "text": "Where do you work as a staff scientist? (I'm just moving over to pharma, but I fear it's more of a project management role. On the other hand I might sneak into a lab now and then.)",
                              "author": "rambo77",
                              "created": 1528965836,
                              "upvotes": 1,
                              "replies": {
                                "e0nfmqf": {
                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nfmqf/",
                                  "text": "I work in a user facility at a large public research university. It's been a little bit of an adjustment, as my current job responsibilities are still within my degree field but not exactly the area I has developed faculty candidate level experience, though that's not necessarily very different from what happens anyway when you take a postdoc position.",
                                  "author": "boonamobile",
                                  "created": 1528966677,
                                  "upvotes": 2,
                                  "replies": {
                                    "e0nfrq9": {
                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nfrq9/",
                                      "text": "Yeah, it's pretty much to be expected. I worked from embriology to virology...\n\nI will keep an eye out on these position if pharma does not appeal to me. How are they advertised? (\"Staff scientist\"? )\n",
                                      "author": "rambo77",
                                      "created": 1528966992,
                                      "upvotes": 1,
                                      "replies": {
                                        "e0niga2": {
                                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0niga2/",
                                          "text": "The titles can vary -- it's a grab bag of words like 'staff', 'scientist', 'research', 'senior', 'associate', 'technical', 'director', etc, depending on the actual level of seniority and responsibilities.\n\nStaff positions don't usually get a lot of publicity, so I think it can help to monitor individual university job boards, along with any job list servers for professional societies. I heard about my current position because I was a previous user of the facility and maintained pretty close relationships with people there, and they knew I happened to be looking for something more permanent. So it certainly helps to know the right people, and to let it be known that your mindset isn't \"TT or bust\". One of the dirty secrets about a lot of job searches is that there are typically a few favorites already on the radar before the posting even goes public. Private universities may not even have to pretend to do an open search, in which case it helps that much more to know the right people. ",
                                          "author": "boonamobile",
                                          "created": 1528972754,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e0m8tjv": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m8tjv/",
          "text": ">Next in line is the lunch test. We always take lunch easy, and we talk about TV, sports, pop culture, never politics\\- it's a \"fit\" test. Can this person integrate in a non\\-academic discussion about us as people?\n\nOur lunch test is sending them to the cafeteria with a small group of undergraduate majors. They of course report back to the search committee. Most of these are great\\-\\- really interesting candidates who are themselves interested in our students, what they are studying, what campus culture is like, what they think of the department, etc. But occasionally we'll get someone who is rude/dismissive of the students, or wants to talk about entirely inappropriate things (campus party culture, \"Do faculty date students here?\", etc.), or is clearly just rushing the meal in hope of going back to their room early. Also very much a fit test, as we certainly don't want to hire anyone who won't interact well with our students.",
          "author": "SnowblindAlbino",
          "created": 1528916927,
          "upvotes": 16,
          "replies": {}
        },
        "e0l5yxf": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l5yxf/",
          "text": "I have to wonder if that person already had an offer somewhere else and went to your school to just have a paid trip somewhere.",
          "author": null,
          "created": 1528870076,
          "upvotes": 6,
          "replies": {
            "e0l6wiy": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l6wiy/",
              "text": "They did not, and ended up adjuncting for a bit before getting a TT elsewhere. ",
              "author": "cdb3492",
              "created": 1528871685,
              "upvotes": 6,
              "replies": {
                "e135b4f": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e135b4f/",
                  "text": "Then they’ve been suitably punished. Adjuncting humbles you.",
                  "author": "capaldithenewblack",
                  "created": 1529634933,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e0lilmc": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lilmc/",
      "text": "It's always worthwhile to point out that, very often, rather than something doing something wrong it's just a matter of there being a better candidate in the pool.  We just went through a hiring process where there were 3 good candidates after the on\\-campus interviews.  We'd have been just fine getting any of them, but one stood out a bit more than the others.  That candidate accepted our offer, so the other two don't get the job.  No red flags or missteps, just not quite the CV compared to the first choice.\n\nThe good news for the other two is that they ARE solid candidates and will get hired somewhere else, and now there's 1 fewer stronger applicant out there competing.",
      "author": "libgeek",
      "created": 1528893421,
      "upvotes": 39,
      "replies": {
        "e0lzgl5": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lzgl5/",
          "text": ">The good news for the other two is that they ARE solid candidates and will get hired somewhere else, and now there's 1 fewer stronger applicant out there competing.\n\nOr, to give a counter perspective, after being rejected so many times before and now finally by your department despite putting together what they accurately felt to be a great interview, they become so discouraged with the futility of the process that they give up. ",
          "author": "boonamobile",
          "created": 1528909105,
          "upvotes": 32,
          "replies": {
            "e0mmcif": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mmcif/",
              "text": "Academia is not for the faint hearted. \n\nWe are in the business of frequent rejections being doled out by grant review committees and high IF journals. Tough lessons are best learned early.",
              "author": "Radiohead_dot_gov",
              "created": 1528928618,
              "upvotes": 10,
              "replies": {
                "e0mrna9": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mrna9/",
                  "text": "Nor for those who want to live without the perpetual stress of living grant to grant and climbing mountains of instruction and assessment work",
                  "author": "boonamobile",
                  "created": 1528933947,
                  "upvotes": 5,
                  "replies": {
                    "e0pbegz": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0pbegz/",
                      "text": "Then pick another profession. Academia is hell.",
                      "author": "Dr_Marxist",
                      "created": 1529041404,
                      "upvotes": 7,
                      "replies": {
                        "e0pc38o": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0pc38o/",
                          "text": "I've never felt healthier or happier since finishing grad school than I have in the year since abandoning the TT job search. You can have it.",
                          "author": "boonamobile",
                          "created": 1529042506,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e0m1m34": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m1m34/",
          "text": "Indeed, I was recently giving a colloquium at a place I'd applied (a couple months after someone was hired).  The ad was pretty narrow, so they only got sixty applications.  The guy who was the head of the search committee told me of the sixty apps, they'd have been happy to hire fifty-eight of them.  But they didn't have 58 openings.",
          "author": "WilyDoppelganger",
          "created": 1528910912,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "e0kqsrz": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kqsrz/",
      "text": "ITT: People nervously wondering if they will recognize themselves.",
      "author": "fumblesmcdrum",
      "created": 1528851451,
      "upvotes": 71,
      "replies": {
        "e0krn5y": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0krn5y/",
          "text": "[deleted]",
          "author": null,
          "created": 1528852349,
          "upvotes": 75,
          "replies": {
            "e0ktu3k": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ktu3k/",
              "text": "If you are applying and not getting any bites, I would say you are either applying to jobs you aren't qualified for, you aren't selling yourself on paper, or you aren't applying to enough places. I could be wrong, but in my experience that's what I've seen.",
              "author": null,
              "created": 1528854642,
              "upvotes": 15,
              "replies": {
                "e0ku2mp": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ku2mp/",
                  "text": "Or you work in a field that prefers to hire adjuncts for more than half of their faculty. Or you work in a field that has had its funding relentlessly cut. No disrespect, but this is such a naive answer. Perhaps you’ve been away from the wanted ads a bit too long.\nEdit: an apostrophe and a letter since it was done on mobile.",
                  "author": "capaldithenewblack",
                  "created": 1528854897,
                  "upvotes": 67,
                  "replies": {
                    "e0kul1d": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kul1d/",
                      "text": "Well, I haven't been away from wanted ads for too long. I've actively applied for jobs on and off for 10 years just in case I found something better. I've been offered a job every time from those interviews. \n\nI also serve on hiring committees frequently. The people we want for adjuncts are vastly different than what we want for faculty. Adjuncts at most schools don't teach upper level courses, graduate courses, write grants, etc... and I have yet to see a single department that is staffed only by adjuncts. \n\nIn departments with huge service course obligations, I see a lot of adjuncts, so that the number of adjunct hours IS higher than their TT faculty, but they still have plenty of TT faculty to teach the upper level courses, do research, write grants, serve on committees, etc... Every field has had funding cut over and over again the past 15 years to my knowledge. Getting grants funded now is damn near impossible compared to even a decade ago. \n\n",
                      "author": null,
                      "created": 1528855440,
                      "upvotes": 16,
                      "replies": {
                        "e0kyzz5": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kyzz5/",
                          "text": "Applying for jobs from the position of full time is not the same as applying for a job out of grad school, I'm sure you can agree with that. \n\nAs a former adjunct, I did teach a few higher level courses for juniors and seniors. I taught at 4 different colleges, 7-8 courses a semester while applying for jobs-- since I needed to eat. \n\nI challenge you to find out how many TT professors you have at your school in the humanities versus STEM. I think you will be surprised, since I already know the way the funding has been going. Has everyone had some cuts? Sure. My STEM friends have already told me about the grant issues. But whole humanities departments are being cut, whole majors abandoned, and since not all colleges have graduate programs, it's more than possible to not only have adjuncts outnumber the full time professors, but to, yes, have entire departments where the program director is the only one who isn't an adjunct. That is actually the case for one of our programs at the school I teach for now. \n\nI was lucky enough to get hired full time at my institution, but I see plenty of friends and others in my field at conferences with solid resumes and publications and they still cannot get an interview. You're basing all of this on your own experiences, which I get-- we all do this-- but I'm suggesting there are other experiences, and someone with a graduate degree in history or English *will* struggle, and it's not always because they don't look good on paper. The system is just not all that interested in them anymore. \n\nPeople with PhDs in my field are clamoring for jobs at community schools. And I'm sure you know that most of those jobs will be filled by adjuncts as well.  ",
                          "author": "capaldithenewblack",
                          "created": 1528860328,
                          "upvotes": 33,
                          "replies": {
                            "e0l07h6": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l07h6/",
                              "text": "Oh, I absolutely agree that it is different. And applying fresh from grad school has changed in the past 10 years as well. I would never deny that. \n\nMaybe my school is an outlier, but our lit and lang department dwarfs any of our STEM programs except biology. They have about 3X the number of full-time people than we do. They have a ton more adjuncts too, but as far as I've seen when looking through the ads, and knowing what I see at my own school, there are still a lot of job openings for TT lines in non-STEM fields. Maybe there are more people applying for them, but I wouldn't know either way about that.\n\nIf you are associate, we've likely been teaching about the same amount of time full time (decade in my case). I don't know if you have seen the same issues I have, but we DO see a lot more people applying for jobs than when I started. Of those applicants though, we haven't seen any higher number of highly qualified people. 10 years ago, we would have 40 applicants per line and 10 would be worth giving a phone call to. The past 4-5 years, it's closer to 70 applicants, and 10 are worth giving a phone call to. I've heard that from others in different disciplines as well, and not just at my school. We've discussed it previously on here also a year or so ago. IMO, and it's 100% anecdotal, there are a ton of average students going to mediocre graduate schools and graduating with mediocre qualifications. They are flooding the job market. Few people seemingly get hired out of those schools for TT lines unless they go on to do a prestigious post-doc type job (at least in my discipline) unless it is as an adjunct somewhere. \n\nDo you think that in the future, institutions will completely get rid of tenure track English professors? Would they just have adjuncts teach everything? I haven't seen any departments with quite that extreme number of adjuncts that you describe outside of community colleges, but it has pretty much always been like that there from my limited recollection. \n\nEdit: Also, I would love for you to contribute to this thread with reasons your department didn't hire people. Humanities people are needed in the discussion.",
                              "author": null,
                              "created": 1528861776,
                              "upvotes": 5,
                              "replies": {
                                "e0l3a7q": {
                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l3a7q/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1528865867,
                                  "upvotes": 13,
                                  "replies": {
                                    "e0l5p9i": {
                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l5p9i/",
                                      "text": "Really? That DOES sound like a different planet from the one I know (and have confirmed with colleagues in other schools). \n\nWhat discipline are you in? What type of school? My experience is primarily STEM in a teaching school, but that would likely be different for language at an R1. I can't fathom getting 230 applicants where nearly half are VERY well qualified. And I'd say a solid 20% of ours are international applicants that very obviously applied to every single school they found. ",
                                      "author": null,
                                      "created": 1528869618,
                                      "upvotes": 4,
                                      "replies": {
                                        "e0m8a6w": {
                                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m8a6w/",
                                          "text": "> I can't fathom getting 230 applicants where nearly half are VERY well qualified.\n\nI'm at an SLAC and our TT history job searches routinely draw 100\\-150 for non\\-US fields, and 200\\-300\\+ for US positions. Numbers like that are quite common in the mainstream humanities disciplines and some social sciences. Certainly some of those people are unqualified, but I'd confidently say 2/3 or more look OK on paper.",
                                          "author": "SnowblindAlbino",
                                          "created": 1528916475,
                                          "upvotes": 7,
                                          "replies": {
                                            "e0motn1": {
                                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0motn1/",
                                              "text": "> Certainly some of those people are unqualified, but I'd confidently say 2/3 or more look OK on paper.\n\nPerhaps not a question for this thread, but how do you whittle them down? ",
                                              "author": "psstein",
                                              "created": 1528931081,
                                              "upvotes": 1,
                                              "replies": {
                                                "e0muqtl": {
                                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0muqtl/",
                                                  "text": ">  how do you whittle them down?\n\nIn our process the search committee members all make an initial cut on their own, bringing a list of 25 to the first meeting. Our committees typically have 5-6 members, and there's always very strong overlap between the individual lists, which suggests we are in agreement as to what makes a good candidate. The basic criteria are 1) a clear match with the advertised position and qualifications, 2) a strong teaching portfolio, and 3) evidence of potential for scholarship in our environment (i.e. on a 3/3 teaching load). \n\nFrankly, applying #1 usually eliminates about a third of the candidates, many of whom are either reaching in terms of their fit for the position or their qualifications for the job in general. After that committee members have their own processes...I personally read c.v.s first, then cover letters, then teaching statements, and if I'm still interested at that point I will read LORs and the rest of the teaching portfolio before I rank them. Quite often candidates are rejected based on poor cover letters that betray a lack of understanding of the position or our institution...winnowing them down to a couple dozen isn't that hard actually. It's the step after that I find challenging, and someone I might rank very highly on paper might fall completely out of contention once we've talked with them.\n\nIt's an imperfect process. One way we strive toward \"fairness\" is that every candidate deemed \"qualified\" (i.e. that meets the position description) gets evaluated using the same criteria and is given a series of scores that are recorded, then used to drive the initial ranking by the committee. So if one person scores a particular candidate much higher or lower than the rest of the group, we discuss that to find out why-- that brings out both positive and negative things that some on the committee might have missed. I'm ultimately looking for standout candidates who present with as thoughtful teachers and who can check off more than one box for us...for example, if we're looking for a labor historian and find one who also does gender history, that's a plus since we often collaborate with gender studies. Or we might find a labor historian who also does digital humanities, which might not be in the job description but is a great \"value added\" piece for a department if nobody is already doing so. The more bonus boxes a candidate checks, the more interesting they become as long as that's in addition to primary competency in the advertised field.",
                                                  "author": "SnowblindAlbino",
                                                  "created": 1528937211,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "e0mwe8x": {
                                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mwe8x/",
                                                      "text": "Thanks, great information. I'm still quite a ways from the job market, but I'll be sure to keep this kind of information in mind. ",
                                                      "author": "psstein",
                                                      "created": 1528938986,
                                                      "upvotes": 1,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        },
                                        "e0lm14c": {
                                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lm14c/",
                                          "text": "[deleted]",
                                          "author": null,
                                          "created": 1528897237,
                                          "upvotes": 6,
                                          "replies": {
                                            "e0m4a3e": {
                                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m4a3e/",
                                              "text": "Maybe for history, but that's definitely on the high side for any of the sciences, especially at teaching schools.",
                                              "author": null,
                                              "created": 1528913128,
                                              "upvotes": 1,
                                              "replies": {
                                                "e0n8vs1": {
                                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0n8vs1/",
                                                  "text": "Archaeology here, 150-200 is the average for us too. ",
                                                  "author": "fleeingslowly",
                                                  "created": 1528953924,
                                                  "upvotes": 2,
                                                  "replies": {
                                                    "e0na6uy": {
                                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0na6uy/",
                                                      "text": "All I'm learning from this thread at this point is that social sciences, humanities, and business departments are producing far too many graduates to ever have a reasonable shot at having a job related to their degree. That's a damn shame, and I'm hoping everyone here discourages their undergrads from even applying unless they are top 5%.",
                                                      "author": null,
                                                      "created": 1528956042,
                                                      "upvotes": 1,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                },
                                "e0l0zlz": {
                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l0zlz/",
                                  "text": "I’ve taught in higher ed since 2003, but seven of those years were adjuncting like an insane person. The last 8 I’ve been employed full time.\n\n>Do you think that in the future, institutions will completely get rid of tenure track English professors? \n\nI can definitely envision that world. I’m at a non TT granting school which goes by a promotion process that feels very similar to the TT process, but without all the perks. I’m still on a yearly contract, though the expectation of job security is kinda there? — just not guaranteed.\n\n>Would they just have adjuncts teach everything? I haven't seen any departments with quite that extreme number of adjuncts that you describe outside of community colleges, but it has pretty much always been like that there from my limited recollection. \n\nMan, ten years ago even I might have said no, but. HLC is going to have a say since they require a ratio of full time to part time supposedly, which adjuncts can’t provide.  HLC  could make a difference if they stepped up and forced more full time positions for accreditation since this current system isn’t set up to help students or people in general, this adjunct thing.\n\nI hope this makes sense between my last response and this one I took a shot, out with friends before a conference tomorrow.",
                                  "author": "capaldithenewblack",
                                  "created": 1528862751,
                                  "upvotes": 8,
                                  "replies": {
                                    "e0l1l0e": {
                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l1l0e/",
                                      "text": "At least at your school nobody gets tenure, not just English professors! I guess there is some small comfort there. I someone's wish my school had that so we could get rid of a few shitty tenured people.\n\nI think in the worst world scenario, only shitty schools would get rid of their English departments. To have adjuncts you need a pool of PhDs, and for that you need solid graduate programs with professors. Even if small schools went to only adjunct departments, you would still need schools to provide the pool of adjuncts. \n\nSometimes I feel like chemistry is on the cutting block, only because we have no majors interested in chemistry. They all want to be doctors. And when they flunk out, they go to non-stem programs leaving us with only graduating students going into medicine. At this point, I'm not even sure why chemistry departments aren't known as premed departments.",
                                      "author": null,
                                      "created": 1528863529,
                                      "upvotes": 5,
                                      "replies": {
                                        "e0lcib4": {
                                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lcib4/",
                                          "text": "> \nI think in the worst world scenario, only shitty schools would get rid of their English departments.\n\nWell, no, the shitty schools (which is most schools) would just combine a bunch of departments into a humanities department that mostly teaches gen eds (or close down - that's a distinct possibility for a lot of the teaching schools, especially now that high school graduations are down). \n\n> you would still need schools to provide the pool of adjuncts.\n\nthe yearly discrepancy between jobs posted in literature and number of graduating literature PhDs is about an order of magnitude. and that's every year. the backlog of jobless PhDs is thousands strong. there's also the small matter that adjuncthood is not a career anyone should aspire to, and I would resent a system that \"provides\" adjuncts.",
                                          "author": "riggorous",
                                          "created": 1528883371,
                                          "upvotes": 6,
                                          "replies": {
                                            "e0lte6u": {
                                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lte6u/",
                                              "text": "[deleted]",
                                              "author": null,
                                              "created": 1528903980,
                                              "upvotes": 1,
                                              "replies": {
                                                "e0lvi8j": {
                                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lvi8j/",
                                                  "text": "> To me that indicates an oversupply.\n\nIt's the definition of oversupply, but that's hardly insightful information\n\n> I consider it predatory for people to train more PhDs\n\nYou don't say. Shame you're in no position to do anything about it.",
                                                  "author": "riggorous",
                                                  "created": 1528905783,
                                                  "upvotes": 2,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                },
                                "e0l2nai": {
                                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l2nai/",
                                  "text": ">10 years ago, we would have 40 applicants per line and 10 would be worth giving a phone call to. The past 4\\-5 years, it's closer to 70 applicants, and 10 are worth giving a phone call to.\n\nMy program doesn't offer graduate degrees but from talking to peers who admit graduate students, they report the same trend at that level. Similar raw numbers of good students, or even a decline because the economy is relatively better, and a lot more chaff.",
                                  "author": "DrParapraxis",
                                  "created": 1528864965,
                                  "upvotes": 3,
                                  "replies": {
                                    "e0l5uh2": {
                                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l5uh2/",
                                      "text": "I'm at an undergrad school, actually. Is that what you're seeing at yours also, or is it different?",
                                      "author": null,
                                      "created": 1528869862,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "e0m829t": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m829t/",
                          "text": ">Adjuncts at most schools don't teach upper level courses,\n\nWe actually don't let adjuncts teach any intro\\-level courses in my department. Too much at stake there, and if they screw it up we lose majors. We almost exclusively hire them to teach upper\\-division classes in their narrow specialty or required courses that are restricted to majors (methods, seminars, etc.).",
                          "author": "SnowblindAlbino",
                          "created": 1528916289,
                          "upvotes": 1,
                          "replies": {
                            "e0mh4nc": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mh4nc/",
                              "text": "That's the old school use of an adjunct, glad to see it still being used.\n\nWe put ours where they won't do damage that matters. Mostly freshman pan classes and courses our majors don't take.",
                              "author": null,
                              "created": 1528923936,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "e0kx82f": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kx82f/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1528858288,
                  "upvotes": 10,
                  "replies": {
                    "e0kxh02": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kxh02/",
                      "text": "Yes, I looked into museum work many years ago as an option but quickly realized there were less than a handful of jobs open a year! I do think you need to always be there part time or interning to land one of those positions. \n\nAnd without your terminal degree, you'll be inherently less competitive for many academic jobs in the current market. Hopefully when you finish up your will be able to secure a permanent gig.",
                      "author": null,
                      "created": 1528858574,
                      "upvotes": 5,
                      "replies": {
                        "e0kxt6p": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kxt6p/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1528858957,
                          "upvotes": 11,
                          "replies": {}
                        }
                      }
                    },
                    "e0lriu4": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lriu4/",
                      "text": "I know what you mean. I'm not in the same situation, but I've heard things about how extra experience would be considered a good thing, but in reality it seems to hurt you in academics. In academics I've been told my varied CV meant they couldn't trust me to be good in the field I was applying for. Basically told by academics to go out and get more experience to show that I could do/teach some systematic literature review shit because I hadn't done it in my PhD.\n\nIt's really brutal out there... it's very random, there are too many graduates, too few quality jobs, too many bullshit adjuncting jobs. The only positive thing I can say is that if you get out of academia completely you'll likely be seen as an expert just for having a PhD and no one will even ask if its in the field you're working in. Every weird turn on my CV is seen as something to highlight now that I'm in industry.\n\nI hate to offer advice because I'm sure you've researched it yourself, but depending on your need for benefits, it might be worth trying to get to Canada. Things like surgeries would be covered regardless of your job. Medications are often tied to private insurance paid for by your employer, though. Academic positions are just as hard to get, though. And moving across the border will mean you won't have a credit history so it delays buying a house and all that stuff.",
                      "author": "rzr101",
                      "created": 1528902362,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "e0mlvys": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mlvys/",
                      "text": "> if I was 25 and single like most grad school graduates\n\nWait, what? Of my school friends, most were 23-25 when they *started* Doctoral programs. A handful were older with families. How do you finish a 5+ year humanities degree before 25?",
                      "author": "subjection-s",
                      "created": 1528928176,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "e0lcba1": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lcba1/",
                  "text": "or you're in the humanities",
                  "author": "riggorous",
                  "created": 1528882932,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e0m6d3u": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m6d3u/",
      "text": "Hard question to answer in anything but anecdotes. I have a *lot* of experience on search committees and have read thousands of files. There are so many different reasons to reject candidates at the paper stage, so I'll skip that. Here are some for the later stages:\n\n*Phone/Skype interview stage:*\n\n* candidate clearly knows nothing about our institution\n* candidate doesn't understand what a liberal arts college does\n* candidate obviously doesn't want to teach (talked about research non\\-stop)\n* candidate presents as entitled, seems to think he's already got the job and is doing us a favor\n* candidate cannot answer basic questions about pedagogy\n* candidate has no questions at all for *us* despite multiple invitations\n* candidate demonstrates zero passion, engagement, excitement for our field or teaching\n* candidate makes disparaging remarks about our region/state/city\n* candidate makes sexist remarks during interview\n* candidate apparently doesn't know anything about the field in which s/he is applying\n* candidate won't stop talking so we can ask our questions\n* candidate seems on the verge of tears/breakdown, constantly apologizing during interview, seems to want to get away asap\n* candidate was rude/unprofessional to our support staff who set up the interview with them\n* candidate was not really going to be defending their dissertation next month as claimed\n\n*Campus visit stage:*\n\n* candidate was rude/dismissive to staff/students during visit\n* candidate presented as cocky and superior (neither of which was merited)\n* candidate seemed to think s/he was doing us a favor by gracing us with her/his presence\n* candidate repeatedly asked about teaching releases despite being told there were none for new hires\n* candidate gave the worst teaching demonstration we've ever seen\n* candidate gave the worst job talk we've ever seen\n* candidate dressed unprofessionally, was late to appointments, showed minimal interest in the position/school\n* candidate made sexist/racist remarks at dinner\n* candidate told dean s/he wouldn't even consider the job without a salary 33&#37; above our range, teaching releases, and other demands that were ridiculous\n* candidate revealed to search committee member(s) that s/he wasn't really interested in the job and was just using it for leverage elsewhere\n* candidate revealed s/he had no interest in staying with us long term, was only looking for a stepping stone to a research\\-intensive position elsewhere\n* candidate failed to demonstrate basic competency in field(s) claimed in their application in casual interactions\n* candidate was clearly a whack\\-job (variations: jerk, angry, mean, bizarre, unhinged, etc.)\n* candidate told search committee member s/he didn't like college students and really preferred to work from home\n* candidate apparently wanted a position in another department but thought getting into ours would be a good first step\n* candidate went to dinner with search committee, ate steak with hands, and talked about nothing but comic books unless directly questioned otherwise (hands!)\n* candidate was universally deemed unacceptable by multiple groups of students after student\\-only sessions (see \"dismissive,\" \"cocky,\" \"sexist,\" etc above).\n* candidate said offensive things to support staff, students, or search committee member(s) on the ride to/from the airport\n\nThat's a quick list. There are many, many others of course. Virtually all of these are avoidable, and all happened *despite* careful review of files, lengthy phone interviews, and reference checks in advance of campus visits. The single most common reason someone doesn't get an offer from us, of course, is concern about teaching\\-\\- if you are interviewing at an SLAC and are not confident that you can 100&#37; hit a grand slam in your teaching demonstration/classroom presentation then practice it until you are. A poor teaching demo will sink the best paper candidate every time, because while we actively mentor new faculty we *must* have something to start from that goes above the baseline of \"I have a degree and like to talk about my field.\" If you don't have any pedagogical training, get some before you apply.",
      "author": "SnowblindAlbino",
      "created": 1528914875,
      "upvotes": 32,
      "replies": {
        "e0maqke": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0maqke/",
          "text": "> candidate went to dinner with search committee, ate steak with hands, and talked about nothing but comic books unless directly questioned otherwise (hands!)\n\n\nThis is actually hilarious, can you provide more background?",
          "author": "apolotary",
          "created": 1528918535,
          "upvotes": 13,
          "replies": {
            "e0menhn": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0menhn/",
              "text": "See my other response re the steak. The comic books would have been fine (he was a DC collector) but it was literally the only thing he talked about during the interview that showed any interest or passion-- not our common research/teaching interests, not the job, not even the weather. But the comic books became a long-running monologue during the meal when we should have been talking about other things. Couldn't get him to stop, and he clearly did not grasp the fact that three of the four other faculty at the table had no idea what he was talking about and weren't interested after the first ten minutes or so.",
              "author": "SnowblindAlbino",
              "created": 1528921827,
              "upvotes": 15,
              "replies": {}
            }
          }
        },
        "e0m73pc": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m73pc/",
          "text": "Yes, I'm figuring enough of us giving anecdotal responses will be enough for people to see tends among them.\n\nI can't believe you had someone say sexist/racist things at dinner! And you're totally right about phone interviews. We lose a lot of interest in some candidates at that stage. I tell people if they are Landon multiple phone interviews but not site visits, they simply aren't interviewing well.",
          "author": null,
          "created": 1528915495,
          "upvotes": 7,
          "replies": {
            "e0mapdo": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mapdo/",
              "text": "> I can't believe you had someone say sexist/racist things at dinner!\n\nMore than once actually. Usually it's sexist comments from men, typically about female students but at least once about female academics in general. The racist stuff I remember most actually came up in a lecture, where a candidate was making gross generalizations about \"Asians\" that were not just offensive, but factually incorrect. It was very strange.",
              "author": "SnowblindAlbino",
              "created": 1528918507,
              "upvotes": 14,
              "replies": {}
            }
          }
        },
        "e7e7zli": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e7e7zli/",
          "text": "I stopped at your third point with my mouth a gap.\nHow do you apply to a liberal arts college and a.) not want to teach and b.) tell them about your desire to do research.\n\nThat's incredible. ",
          "author": "Ohnehoffnung",
          "created": 1539011174,
          "upvotes": 2,
          "replies": {
            "e7f2tm6": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e7f2tm6/",
              "text": "It's of course quite bizarre, esp since they would have *had* to present a convincing teaching file to even get to the interview stage. But some people are good enough to fake that, or I guess silly enough to think we don't notice when they don't follow through in person.",
              "author": "SnowblindAlbino",
              "created": 1539038306,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "e0mb85f": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mb85f/",
          "text": "While a lot of those reasons make sense, I'm unable to fathom why eating a steak with hands is a big deal. I'm asking out of curiosity because I come from a culture that predominantly eats with hands (also pardon my ignorance; I've never eaten steak).",
          "author": null,
          "created": 1528918947,
          "upvotes": 2,
          "replies": {
            "e0mefok": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mefok/",
              "text": ">  I'm unable to fathom why eating a steak with hands is a big deal. I'm asking out of curiosity because I come from a culture that predominantly eats with hands (also pardon my ignorance; I've never eaten steak).\n\nIn the US one would typically eat a steak, in a nice restaurant and during a formal event, with a knife and fork. Children here are taught never to eat anything but \"finger food\" with their hands. He cut it into bite-sized pieces but ate about half of them with his fingers. That alone wouldn't have been reason to reject, but it was pretty damned odd given that said candidate had no cultural reason to do so...he also refused all the vegetables/sides that came with the meal and told the waiter just to bring the meat.",
              "author": "SnowblindAlbino",
              "created": 1528921644,
              "upvotes": 15,
              "replies": {
                "e0op06c": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0op06c/",
                  "text": "As someone whose sense of flavor precludes me from eating any and all vegetables for fear of gagging at the table: don't discriminate against us! There are dozens of us! Dozens!",
                  "author": "Jurgioslakiv",
                  "created": 1529015036,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e0lvi1i": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lvi1i/",
      "text": "Something I heard from a senior professor following a job talk junior faculty search candidate- \n\n\"There's nothing more depressing than watching a presentation by a young professor who sounds bored by their own research.\"",
      "author": "sandusky_hohoho",
      "created": 1528905779,
      "upvotes": 24,
      "replies": {}
    },
    "e0ku6dm": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ku6dm/",
      "text": "Not answering the damn questions that we asked, but inventing your own and babbling on (note: you are not tenured yet)\n\nGiving a 5-word blurt OR 20 minute monologue answer to  standard questions such as \"why do you want this job?\" or \"describe a time you taught something and your teaching wasn't effective. how did you improve?\"\n\nBeing terrible teachers - just no practice for the presentation, no oral communication skills or in one case actually, to a room of students repeatedly saying \"so, this is easy, yeah?\" and glossing over ANY interactivity, despite us prompting you weeks beforehand to do some form of active learning\n\nAsking dumb questions that you  could have found out with 2 minutes of googling\n\nHaving no vision - what do you want to DO?\n\nProposing wildly under-ambitious OR technically flawed to even a vegetable OR wildly overambitious research projects\n\nRecycling your R1 application for a LAC/PUI\n\nSO MANANY DUMBS. Do your research, people!\n",
      "author": "lalochezia1",
      "created": 1528855007,
      "upvotes": 48,
      "replies": {
        "e0kusaw": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0kusaw/",
          "text": "A lot of those are the reasons I see for not getting to a site visit. Recycled application with no vision and a poor research plan isn't going to even get a phone interview. For us, the site visit is the last stretch of \"is this person a good teacher, are they good for our student body, and can we happily work with them?\" It doesn't seem like that bar should be that high, but good GOD are there some bad applicants.",
          "author": null,
          "created": 1528855651,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "e0lvumx": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lvumx/",
      "text": "Many years ago, when I was still an academic, we had one interviewee who spoke with our dean for about an hour.  During that hour he told the dean (1) that we would be very lucky to get him as an associate professor even though the job offer was for and assistant professorship and (2) he would need at least $50,000 in upgrades to our current computer system in order to support his research.  Money was always very tight at that college so the dean turned thumbs down in no uncertain terms.  \n\nMoral: Don't ask for money you can't get.",
      "author": "MadPat",
      "created": 1528906082,
      "upvotes": 11,
      "replies": {
        "e0m9e7h": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m9e7h/",
          "text": "That second part sounds like the candidate was simply trying to be honest about what they would need to be productive in that position. We can't forget that, no matter how crappy the job market, the candidate also needs to ensure that they would be getting a position that would allow them to succeed. That first part is just dumb though!",
          "author": "mamyd",
          "created": 1528917402,
          "upvotes": 8,
          "replies": {
            "e0mlcec": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mlcec/",
              "text": "I think your interpretation of the second part is reasonable but, if you had heard this guy, it would not sound reasonable at all.  He came on very strong about how great he was.",
              "author": "MadPat",
              "created": 1528927656,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "e0md2ku": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0md2ku/",
      "text": "For a phone interview, had this one guy that didn't explain the science he did, or was going to do, despite several related questions.  I found out he had a twin, he wants to start a family, and had been writing one grant for the past 3 years (!!), but couldn't tell you one aspect of his science. \n\nAt a minimum, in a 30 minute phone interview, you should at least convey what you want to do in your future lab and what you have done in your training. \n\nIn his rejection email I offered to discuss with him some points of improvement. He said, yes he would like that advice. He then responded with a point-by-point reason why I was wrong. Only sealed the committee's  decision. He had been in a 7 year post doc (4 years past average for my field) in the top lab in our discipline. I knew several programs had already turned him down, some more than once! (since his CV was somewhat impressive)",
      "author": "spartan1977",
      "created": 1528920492,
      "upvotes": 12,
      "replies": {
        "e0naog0": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0naog0/",
          "text": "> He had been in a 7 year post doc (4 years past average for my field) in the top lab in our discipline.\n\nForgive my ignorance but is that bad? A long postdoc, but in a very prestigious lab? What does that imply to a hiring committee?",
          "author": "iammaxhailme",
          "created": 1528956860,
          "upvotes": 3,
          "replies": {
            "e0nikq8": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nikq8/",
              "text": "If in a field people usually have ~3 yr post docs, it usually means you have applied for 4yrs for tt positions and not gotten an offer. It is usually not a good sign.",
              "author": "spartan1977",
              "created": 1528972984,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "e0lzsho": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lzsho/",
      "text": "I think it fits the spirit of the post to put in some general advice along with actual experiences: \n\n- Someone said this elsewhere, but there is no excuse for not researching the university and knowing a decent amount about it and the department before you interview. Teaching vs. research focus, mission/strategic plan, etc. I heard a story of someone interviewing at a religious institution and he said he \"didn't mind\" that they were Christian. He didn't get the job. \n\n- One tricky part for the search committee is to suss out how interested the candidate is in the job; it's nice to make an offer to someone who is going to accept. Asking *informed* questions (see first point above) that make it sound like you're trying to envision yourself in the job is a good way to indicate interest. \n\n- As indicated elsewhere in the thread, you are always interviewing. There are the formal parts where the committee asks you questions but the meals and the car trips are as important - sometimes moreso. Many departments may not get another full-time hire for years, so they want to pick someone who has their ego under control and can play nice with others.\n\n- It's easy to find interview questions online, and if you think about it, you could probably make some up: what's your teaching philosophy, what's your research plan, etc. Come up with some solid, concise answers to those questions. You should not be fumbling to tell them basic stuff about your experience or vision for the future.\n\n- Just because you're a grad student doesn't mean you have to remind them of it constantly. Everyone needs a first job at some point. They know where you're at in your career. On the flip-side, don't oversell yourself, because again - they know where you're at in your career. It's okay to say \"In the course I taught last term, I noticed X was a challenge for me, and I've been thinking about how to address it.\" This sounds a lot better than \"I'm great at teaching and every student loves me.\"",
      "author": "adlaiking",
      "created": 1528909384,
      "upvotes": 22,
      "replies": {}
    },
    "e0owr14": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0owr14/",
      "text": "Not appearing to have any interest or knowledge of the faculty you will be meeting with.  It takes thirty seconds to go to a faculty's website and figure out what they do and a question or two about their work.  I had a cheat sheet for every faculty member I met with.  I'm on my second TT job now (upgrade to better job!) and both times I heard that my ability to speak to the faculty and show an interest in their work was a factor in my hire.",
      "author": "preacher37",
      "created": 1529023306,
      "upvotes": 10,
      "replies": {
        "e0owvue": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0owvue/",
          "text": "That's absolutely critical, and a really strange thing when people don't do it. \n\nWe literally gave a phone interview to a guy this year that forgot which school we were.",
          "author": null,
          "created": 1529023450,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "e0m3aot": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m3aot/",
      "text": "As a current PhD student who would like to eventually get a professorship in engineering, this is a very helpful thread. Thank you everyone for the tips for the future.",
      "author": "fashionintegral",
      "created": 1528912312,
      "upvotes": 18,
      "replies": {
        "e0mtenm": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mtenm/",
          "text": "[deleted]",
          "author": null,
          "created": 1528935777,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e0mph6r": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mph6r/",
      "text": "Confessed she had to advertise on a large scale to attract students into her courses. At the time, she was TT at a massive state university, think 30,000+ enrolled.\n\nIf you're having trouble attracting students to your courses there, you're not going to do well at a R2 with 6,000 undergrads. I was on an undergrad committee at the time. ",
      "author": "psstein",
      "created": 1528931746,
      "upvotes": 3,
      "replies": {}
    },
    "e0owut5": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0owut5/",
      "text": "For research positions, long gaps in productivity are problematic.  If you want a research job, avoid taking heavy teaching jobs.  Postdocs are a much better use of your time.",
      "author": "preacher37",
      "created": 1529023419,
      "upvotes": 5,
      "replies": {
        "e0ox0ru": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ox0ru/",
          "text": "That goes both ways for sure, too. If you want a teaching job, get a teaching postdoc/instructor line. If you want a research job, get a research postdoc. You have to prepare yourself well to get the job you want; you need to cultivate the skills that your potential employers will be interested. Everyone will have their doctorate that you are competing with.",
          "author": null,
          "created": 1529023603,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e0l3frt": {
      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l3frt/",
      "text": "In no meaningful order:\n\n* Too rigid, dogmatic, their way or the highway\n* Unprofessional, giddy, casual, treating the interviewers as though we were all pals\n* Lacks requested material\n* Does not meet our qualifications and applies on hope, evidently\n* Asks inappropriate questions such as can the salary be negotiated? Can it? I need to know now.  How about the pension while we're at it?\n* Same application package, with same typos and problematic content is as first time they applied for a similar position is submitted. Sorry, there are no shoe\\-ins. And if you don't revise an application, we can only worry a lack of reflection on teaching and content\n* Overly long and very confusing materials the candidate created for student assignments\n* Course syllabus is boilerplate only, or it is hard to figure out, or it lacks relevant information\n* Knowledge the candidate has bullied or been mean to students, (this doesn't enter the conversations but we all know who they are so we reject them for some other reason)\n* Ditto for those who do not respect limits of professional power and authority inherent in their position, who want to be friends with students, or are otherwise are known to transgress appropriate boundaries\n* The candidate talks about good pedagogy but we find no evidence of it or of their staying current with pedagogical idea\n* Narrow and often outdated research views\n* Not up to date with current international domain research\n* Answers example request questions with the same example\n* Doesn't answer the question asked, didn't answer fully, or answered with too short an answer\n* Answers are way to long and rambly (we think my gosh what would students do with course material presented in this manner?)\n* A normal academic or pedagogic question stumps the candidate\n* No examples of items provided to students (if we ask to see them)\n* References were not chosen wisely and thus didn't glow about you\n* Calling adult students \"kids\"\n\nIn our view what we ask for is relatively easy: that a candidate present for a formal interview (it is, even if the candidate already teaches in our program), that the candidate listen carefully and answer the questions fully to the best of the candidate's ability, that the candidate provide evidence of teaching excellence, research excellence and publication excellence.  We are actually very forgiving, however it seems that after every round of  interviews we shake our heads in amazement that so many who wax poetic about their passion for research and current teaching methods seem to have so little evidence proving either. ",
      "author": "gutfounderedgal",
      "created": 1528866085,
      "upvotes": 17,
      "replies": {
        "e0lmnfr": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lmnfr/",
          "text": "[deleted]",
          "author": null,
          "created": 1528897861,
          "upvotes": 22,
          "replies": {
            "e0lorfs": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lorfs/",
              "text": "This isn't inappropriate at the correct stage. When on campus for an interview, you should be asking questions about what your job and life would look like at the institution, but the details of salary and pension are something you would work out after you have already received an offer. It can come off as presumptuous to bring it up early and already sets a tone that you will create a potentially difficult hiring process with a list of demands instead of a set of negotiations. \n\nAt the interview stage, it is much more appropriate to ask about how the department/institution runs, what policies are in place (i.e. things that are fairly set in stone and are non-negotiable). While at the offer stage, you will begin asking questions and making comments about what is or isn't negotiable (i.e. salary/pension, teaching load for the first year, startup funds, etc.).",
              "author": "BangarangRufio",
              "created": 1528899896,
              "upvotes": 15,
              "replies": {
                "e0m1hzb": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m1hzb/",
                  "text": "This is wrong \\-\\- it is inappropriate for employers to advertise positions without salary ranges and descriptions of benefits. Doing otherwise is a waste of the job applicants' time.\n\nLuckily, some municipalities and states are now requiring the disclosure of salary bands. In California, employers are subject to fines and criminal prosecution if they do not provide the salary band for a position upon request.",
                  "author": "nevernotdating",
                  "created": 1528910818,
                  "upvotes": 31,
                  "replies": {
                    "e0m2o81": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m2o81/",
                      "text": ">it is inappropriate for employers to advertise positions without salary ranges and descriptions of benefits\n\nI don't necessarily disagree with you, but this is a matter of your opinion on workplace ethics and not one of \"inappropriate-ness\". We work in a world where salaries are not discussed openly in many/most workplaces and I'm providing advice on how to navigate that world. \n\nI will say that I applied to a number of lower-paying academic jobs (my current position included), and I was informed of the salary range or the relatively non-negotiable payscale (community colleges) before the interview process in order to not waste my time or theirs. Beyond that, public university salaries are searchable on Google and vary widely depending on how well the applicant negotiated their base salary and/or how in-demand they were as a candidate for the position. This would make providing a salary range fairly difficult as an employer.",
                      "author": "BangarangRufio",
                      "created": 1528911795,
                      "upvotes": 4,
                      "replies": {
                        "e0m31jc": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m31jc/",
                          "text": "My point is that the norms around discussing salaries are changing. When I applied to several jobs in CA this year, the employer had to disclose the salary ranges to me. If they didn't, I could report them to the Labor Commissioner and they would be fined. \n\nEncouraging applicants not to discuss salary openly and early is just perpetuating traditional salary disparities, often across genders and races/ethnicities.",
                          "author": "nevernotdating",
                          "created": 1528912102,
                          "upvotes": 11,
                          "replies": {
                            "e0m3izw": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m3izw/",
                              "text": "> Encouraging applicants not to discuss salary openly and early is just perpetuating traditional salary disparities, often across genders and races/ethnicities\n\nI 100% support breaking down that barrier, as I think it is ridiculous and regressive that we are trained to not discuss pay more openly across the board. And if you work in California, or another location where you will feel comfortable and/or protected in asking for this info upfront, I say go for it. Unfortunately, if you live outside of these locations, you will likely be perceived as I stated in my earlier comment if you insist on discussing negotiation of salary early-on before you have been considered as a final pick for the position. As such, I would still advise against doing so early and instead encourage those of us who already have TT jobs to push for providing these metrics to potential hires.",
                              "author": "BangarangRufio",
                              "created": 1528912502,
                              "upvotes": 6,
                              "replies": {}
                            },
                            "e0mam10": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mam10/",
                              "text": "I think the person who wrote that comment above was saying salary was discussed at the wrong time or incessantly. Not that asking about salary is improper. That IS a problem with jobs... they ask you what you're making, what you want to make, and won't disclose their expected pay range.\n\nBut, if you've having a dinner with a few faculty and you ask to go around the table and everyone states what their take\\-home pay is, you're not being very tactful. Just like above where people are saying how talking solely about research at a dinner event isn't very tactful.",
                              "author": "rzr101",
                              "created": 1528918427,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e0lepx8": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lepx8/",
          "text": "> we find no evidence of it or of their staying current with pedagogical idea\n\nCould you expand on that? Is your faculty expected to use cutting edge pedagogical methodology? With adult students?\n\nI can understand the benefits it in childhood education, but at the university level? Is there new empiric evidence that presenting course material could be improved significantly over, say, what was accepted 15 years ago?",
          "author": "pbmonster",
          "created": 1528887719,
          "upvotes": 14,
          "replies": {
            "e0ls57c": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ls57c/",
              "text": "> at the university level? Is there new empiric evidence that presenting course material could be improved significantly over, say, what was accepted 15 years ago?\n\nYes, active learning in general is taking over higher education and there is a lot of research that supports that it is a better teaching method than the traditional lecture-based format.\n\n> With adult students?\n\nYes? Why would you not? Adults are the ones spending thousands and thousands of dollars to attend colleges - they should absolutely be getting the best education possible for their money. ",
              "author": "dataispower",
              "created": 1528902904,
              "upvotes": 14,
              "replies": {
                "e0nfio8": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nfio8/",
                  "text": "> > With adult students?\n\n> Yes? Why would you not?\n\nThanks for answering! When reading \"current pedagogic idea\", I thought about concepts like student-determined choice of material/subject, student-determined choice of time allocation, removal of focus on student performance, students teaching each other in groups, ect.\n\nGroundbreaking (even esoteric) in childhood education, but as matter of course in adult education for a long time (except performance - difficult to overcome the need to measure success).\n\n> Yes, active learning in general is taking over higher education\n\nAnd has for a long time, in my experience. Lectures have to be interactive, and the pipeline in almost all courses no seems to be \"lecture - home exercises - tutorial and/or lab.\" And many students skip the lecture, as it is the least important (and least interactive) element in the chain.",
                  "author": "pbmonster",
                  "created": 1528966417,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "e0m9rtp": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0m9rtp/",
              "text": ">we find no evidence of it or of their staying current with pedagogical idea  \n>  \n>Could you expand on that? Is your faculty expected to use cutting edge pedagogical methodology? With adult students?\n\nAbsolutely. If a candidate is simply a \"listen to me lecture\" type they won't even get a phone interview with us. We expect active learning pedagogies in the classroom from everyone, and there are always plenty of applicants in every pool with teaching awards, experience as a trainer, publications on pedagogy, documented innovations in blended learning, or who simply present as aware, active\\-learning educators that it's never a problem to cull those who are not. Sometimes, however, one will sneak through and get a campus interview...if they spend an 80 minute class simply lecturing they are finished. At an SLAC like ours there is no part of the on campus interview more important than the teaching demonstration, unless it's the breakfast meeting with the department in which we talk about pedagogy. If a candidate cannot provide evidence of pedagogical awareness (or ideally, some sophistication) they aren't going to be a good fit for us.",
              "author": "SnowblindAlbino",
              "created": 1528917717,
              "upvotes": 7,
              "replies": {
                "e0mhfa6": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mhfa6/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1528924194,
                  "upvotes": 5,
                  "replies": {
                    "e0mkf32": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0mkf32/",
                      "text": "> I never once had anything but a \"sit down listen to me\" lecture, and I was unaware there were other ways to teach.\n\nThings have been changing slowly, and of course that change happens first at places where teaching is the core mission. Active learning pedagogies have been a thing since the 1980s, but are only recently making it into some fields (STEM is often behind) and of course aren't easily adapted to the 300+ student classes common at big universities. The [introduction to this article](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2736024/) (which is a decade old already) provides a nice overview of what it means and how it works based on a biology example.\n\nThe basic premise is that simply delivering/receiving content passively is not a very good use of classroom time/resources; students can accumulate \"information\" on their own time via readings, videos, recorded lectures, powerpoints, etc. Class time is reserved for higher-order tasks that are interactive, generally requiring students to do something with the information they accumulated outside of class. In practice it means lots of discussion, application/skill practice, problem solving, and project-based learning. Lots of variety across disciplines and instructors of course, but it's been happening for a long time...I learned that way as an undergrad in the 1980s and when I was hired in the 1990s everyone in my department (history) save a couple of about-to-retire senior faculty had made the transition long before.",
                      "author": "SnowblindAlbino",
                      "created": 1528926814,
                      "upvotes": 3,
                      "replies": {
                        "e0nfosp": {
                          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nfosp/",
                          "text": ">  Active learning pedagogies have been a thing since the 1980s, but are only recently making it into some fields (STEM is often behind)\n\nYes, if you look only at lectures. And even that is changing.\n\nBut in every STEM course, lectures (the non-interactive part) take only a fraction of the total time a student spends learning. The pipeline almost always is \"lecture - home exercises - tutorial - lab\". The last three are very interactive, and absolutely essential for understanding. They also take by far the most hours out of the student's week.",
                          "author": "pbmonster",
                          "created": 1528966806,
                          "upvotes": 2,
                          "replies": {
                            "e0nutes": {
                              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nutes/",
                              "text": "> The pipeline almost always is \"lecture - home exercises - tutorial - lab\". \n\nExcept when it's not-- a great many STEM classes do not include labs, and I see that trend growing. I've been involved in gen ed reform for several years and have seen lots of examples of 100-level natural science requirements without labs. \n\nEven if there is a proper lab, that's not a justification for lecturing in the traditional format. Read the paper I linked from the NSF-- over a decade ago that study found significantly improved learning outcomes when the entire course was active-learning based, not just the labs.",
                              "author": "SnowblindAlbino",
                              "created": 1528987857,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "e0lk090": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lk090/",
              "text": "Thank you for asking. Glad I’m not the only one wondering about this... ",
              "author": "MightyMightyLostTone",
              "created": 1528895091,
              "upvotes": 3,
              "replies": {}
            },
            "e0nxdne": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nxdne/",
              "text": "I mean more generally, the candidates talk about student engagement, active learning, facilitation and yet they from the evidence presented they only lecture or do lectures with powerpoints. We hear nothing about reinforcement, scaffolding, case study work, flipped classroom and so on, some methods older, some newer or with newer twists.  Worse, the candidates often seem to lack an awareness of whether their designed course progression matches the students' level or general ability, and all that sort of stuff related to actually reflecting on how they are doing. Again, some ideas are older, some newer. In answer to you first question, yes we expect our professors to stay up on pedagogy, and we give them the freedom to experiment in the classroom with new pedagogical ideas, knowing full well some may fly while others won't be repeated. Does pedagogical/methodological excellence benefit adult students in my view: Absolutely. ",
              "author": "gutfounderedgal",
              "created": 1528990078,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "e0l5y0v": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l5y0v/",
          "text": "Curious because some people are making me feel crazy here:\n\nWhat discipline, and what type of program are you in? It's like we get so many candidates but most of them are just horrible. Sounds like you are having that too.\n\nYou would think talking about your life's work wouldn't be so challenging for someone, and that they could answer basic questions about themselves. ",
          "author": null,
          "created": 1528870033,
          "upvotes": 4,
          "replies": {
            "e0l820u": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0l820u/",
              "text": "I'm not the person you replied to, but I know my field (a social sciences/humanities one) gets a lot of \"horrible\" applicants, so I can relate to your comments about only really having 10 good options. It's not even so much that the applicants are subpar teachers or can't articulate a research plan, but I know that there's been an increase in applicants from other fields, hoping they can \"argue\" (for lack of a better term) into the department. \n\nGranted, as with many humanities fields, there is a certain level of interdisciplinary work being done, and certainly a candidate from English would be considered if they met the requirements. But our field is very language-based, and I know from speaking with different professors in different universities (I'm just a PhD candidate myself) that they've seen an increase in the number of candidates who are applying *without* knowledge of our core languages, and hoping that their experience with working with translations will suffice. ",
              "author": "PurrPrinThom",
              "created": 1528873767,
              "upvotes": 9,
              "replies": {
                "e0ma4yb": {
                  "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0ma4yb/",
                  "text": ">I know that there's been an increase in applicants from other fields, hoping they can \"argue\" (for lack of a better term) into the department.\n\nThe worse, god love 'em, are always lawyers. We historians have always had to put up with them, but after the recession it got much worse. Now every pool will have at least a half\\-dozen cocky lawyers in it who basically write a cover letter saying \"I don't have the required Ph.D., or even an MA, or any publications at all, but I do have a JD which I can assure you is better anyway. I am passionate about history\\-\\- I love to read books and watch PBS! \\-\\- and would be giving up a lucrative career in law to lower myself to your level and teach you undergraduates about WWII German bombers and other subjects that interest me.\"",
                  "author": "SnowblindAlbino",
                  "created": 1528918026,
                  "upvotes": 9,
                  "replies": {
                    "e0nfdq4": {
                      "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nfdq4/",
                      "text": "That's amazing. I don't think we've ever had any lawyers but now I'm almost sad to have missed out on those types of letters.",
                      "author": "PurrPrinThom",
                      "created": 1528966113,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "e0nxs3p": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0nxs3p/",
              "text": "I've never really understood either. I view teaching as a privilege combined with bit of performativity.  Thus, think that wanting to do one's job well, and reflecting on whether one's personality fits the general nature of the job would be foundational for everyone. Evidently my assumptions are often wrong. ",
              "author": "gutfounderedgal",
              "created": 1528990427,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "e0lzvkj": {
          "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0lzvkj/",
          "text": "[deleted]",
          "author": null,
          "created": 1528909456,
          "upvotes": 2,
          "replies": {
            "e0magln": {
              "link": "/r/AskAcademia/comments/8qnode/why_didnt_you_hire_them/e0magln/",
              "text": ">Is this common in Academia?\n\nIt's certainly not universal, though \"treat like friends\" is open to wide interpretation. In my SLAC world (as a student and a mid\\-career professor) friendships between faculty and students are the norm, not the exception. While *dating* would certainly be frowned upon (and likely violates policies on most campuses now) social interaction is obviously not. I have lots of faculty colleagues who socialize with students; I've gone to concerts and movies with mine, have them over for dinner (in groups), meet them for coffee, play on intermural teams with them, joined unofficial clubs with them, I even played lead guitar with a student band for a year once. As long as such relationships don't cross the lines of dating or professional conflict\\-of\\-interest they would be seen as quite normal on my campus and those of most other SLACs at which I've been.",
              "author": "SnowblindAlbino",
              "created": 1528918299,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    }
  }
}