{
  "sid": "pq9zao",
  "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/",
  "title:": "How do you find prospective students for grad?",
  "text": "I have been seeing so many questions about 'How do you prospective professors for grad school'. So now let's turn the table and tell us, How Do You Find that awesome blossom student!",
  "author": "Charming_Foot4693",
  "created": 1631916660,
  "updated": 1634078944,
  "over_18": false,
  "upvotes": 42,
  "upvote_ratio": 0.95,
  "comments": {
    "hda0vst": {
      "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/hda0vst/",
      "text": "As a former prospective student... have a decent website that helps me quickly get a sense of who you are and what you do. Some profs say \"just look up my papers,\" but as an inexperienced undergrad I don't have enough background to actually get much out of skimming your papers. That's a lot of work that I'm only going to do for someone I'm already interested in. \n\nHonestly, I pretty much dismissed some schools entirely because their websites were a nightmare to navigate, and it was just way too much effort to try to figure out which profs did work I was interested in. In hindsight, there were good groups at those schools, but I had no way of finding them at the time.",
      "author": "xozorada92",
      "created": 1631927260,
      "upvotes": 57,
      "replies": {
        "hdael8z": {
          "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/hdael8z/",
          "text": "Seconding this. I did read papers in undergrad, but even then I was tracing the author back to their website to try to find more information and more papers. Some departments have a full bio with a description of interests and links to at least recent publications, and that's really nice! Other sites had like two-line bios, and it was really hard to get a sense of the professors and their interests from that. My least favorite were the ones that opened up 57 additional pages for each faculty member. Besides, I also want to get a sense of who else is in the department and what else is going on there!\n\nIf you're in a laboratory research field (like mine), have a site for your lab/research group. I liked reading through the interests of current grad students, where available, because it gives me an idea of how widely their interests ranged and thus how widely you may be willing to advise.\n\nConsider having a summer research experience program, or a prospective students' weekend event. I come from a background underrepresented in science, and a prominent program in my field has a visit weekend for students from backgrounds like mine to learn what doing a PhD in the field is like and get some mentorship from other current grad students with the same background. They have been very successful in recruiting minority doctoral students through this. Even if your future grad student doesn't attend, they may have a friend or classmate they refer to the program from the experience. I also considered a program I never would've otherwise considered because I did my summer research internship there.\n\nYou also might be interested in getting involved in formal mentorship programs in the field. I did one when I was an undergrad, and I got a grad student and a PhD-holding faculty mentor. There are lots of research training programs for undergraduates and you might consider getting involved in one someway, even if it's just attending their annual conference and watching student presentations.",
          "author": "roseofjuly",
          "created": 1631934310,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hdajxol": {
      "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/hdajxol/",
      "text": "They email you and submit an applications to the department, there are hidden gems you take a risk on but those stand out holy shit students are easy to find. Generally the issue is convincing those student not to take the offer from Stanford or MIT. We loose about 30% of the students that get flown out to the department to those schools.",
      "author": "entropyStable",
      "created": 1631937299,
      "upvotes": 12,
      "replies": {}
    },
    "hdat2qt": {
      "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/hdat2qt/",
      "text": "I assume that you are talking about research postgrad positions and not taught postgrads.\n\nMy university publishes the ad, which is then automatically picked by Swedish and European portals for academic jobs. I and other faculty in my research group always use Twitter and LinkedIn to further advertise openings. At that point, at least one of our national research programs or funding agencies may retweet our posts. Other academics share our posts too (as we do for them too!).\n\nConsidering that our field is AI, we may get anywhere between 50 and 100 applicants for that one position through this almost 'passive' search of putting the ad out. However, there are no guarantees that any of the applicants will be suitable. In fact, at least 95% of the applications will be people who say \"I want to do machine learning\" even if the job talks about symbolic reasoning \\*rants\\*. A more 'proactive' approach is to send the ad directly to colleagues in case they supervise any masters' student about to finish up.\n\nQuite a few people though may end up supervising a very awesome master's student. If there is good 'supervision chemistry' between them, it is not unheard of to 'nudge' them into applying for a PhD position.",
      "author": "RecklessCoding",
      "created": 1631943288,
      "upvotes": 5,
      "replies": {}
    },
    "hdajl96": {
      "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/hdajl96/",
      "text": "Not at that stage myself yet, but academic Twitter is the place to be. There are huge networks of students and faculty across the world all happy to blast and retweet job opening and calls for applications. I've passed along several of these calls myself.",
      "author": "Whatifim80lol",
      "created": 1631937095,
      "upvotes": 10,
      "replies": {
        "hdalzv4": {
          "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/hdalzv4/",
          "text": "Hi there ! \n\nWould you mind explaining a bit more about what academic Twitter is?\n\nLike do you follow certain scientists or labs?\n\nI will graduate within a year and am going to look for a postdoc, so this is a completely unexplored avenue for me. So if you can give a few tips on how to get started that will be great .\n\nThanks",
          "author": "Cowboy_Yankee",
          "created": 1631938570,
          "upvotes": 7,
          "replies": {
            "hdb02at": {
              "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/hdb02at/",
              "text": "Sure! A huge number of professors and grad students use Twitter as public-facing academic profile rather than a more casual social media account. They talk about their research, opportunities, their progress through graduate programs, and keep in contact with labs and collaborators all over the world. Their bios usually focus on their professional life rather than their personal life (typically their program, career stage, and their research interest).\n\nGetting involved isn't too hard. First step is to make a (new) Twitter account of course, lol, with minimal personal stuff of anything you wouldn't want colleagues and advisors to see. Keep all that separate.\n\nAnd of course the second bug step is finding who to follow. When I started looking, I was able to get a good start by brute-forcing my way through the presenter list from a recent conference. For each presenter that was remotely close to my research interest, I'd throw their name into Twitter search and see if they have an account. Sometimes it's an individual account, sometimes there's an account for the lab as a whole. And of course you could do the same by using Google scholar topic searches and checking out the author's from recent publications.\n\nOnce you get over like 30 or so follows, Twitter's algorithm gets pretty good at showing you other people worth following. The bios for these accounts will make the choice to follow or not to follow super easy. I stopped when I got around 200 follows. About 80 followed me back!\n\nThen just spend a little bit each day or a couple times a week checking out your feed like a quick little work chore. Retweet job opportunities, congratulate other people's progress,  ask research and career questions where you can squeeze them in, etc. It makes networking a lot more streamlined.\n\nHope that helps!",
              "author": "Whatifim80lol",
              "created": 1631948660,
              "upvotes": 4,
              "replies": {
                "hdfe9h4": {
                  "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/hdfe9h4/",
                  "text": "This is so great, thank you so much for explaining it so well. In fact, I am going to a conference (virtual) next week and will try to network as much as possible using Twitter. I don't think there will be a way to connect with people other than asking questions at end of a presentation.\n\nAgain thank you so much, I need to make the Twitters !!",
                  "author": "Cowboy_Yankee",
                  "created": 1632027545,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hdb26cv": {
      "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/hdb26cv/",
      "text": "Often we find the best future PhD students by recommendation from masters project supervisors",
      "author": "nickbob00",
      "created": 1631950433,
      "upvotes": 3,
      "replies": {}
    },
    "hdbf71e": {
      "link": "/r/AskAcademia/comments/pq9zao/how_do_you_find_prospective_students_for_grad/hdbf71e/",
      "text": "In the UK any funded PhDs are advertised like any other job. The projects are advertised publically and with an outline of what the aim of the work is, with about a page of project description. Applicants are then shortlisted and interviewed based on formal criteria (which can vary between doctoral training schemes).\n\nSO you get the position by being the most well qualified candidate who can demonstrate at interview you are a good fit for the project and can interface well with the supervision team.\n\nAt the same time we all keep our eyes out for promising and keen undergrads, and try to help facilitate their goals. For those who want to go into academia we can help link them with colleagues at our own or other institutions with relevant research interests, who might be able to offer guidance or summer opportunities, etc. THe reason being that these are the kind of things which can make a huge difference in funded PhD applicaiton shortlists.\n\nIf you are interested in doing something tell your lecturers! They can provide lots of guidance. In the UK system, start with your tutor - the can help you navigate things.",
      "author": "OrbitalPete",
      "created": 1631961565,
      "upvotes": 1,
      "replies": {}
    }
  }
}